{
  "content": [
    {
      "type": "text",
      "text": "# Tiguex War\n\nTiguex}}\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Spanish victory\n| status      =\n| combatants_header = Belligerents\n| combatant1  = 12 Southern Tiwa Puebloans\n| combatant2  =  Expedition of Francisco Vázquez de Coronado\n| combatant3  =\n| commander1  = Xauían\n| commander2  =  Francisco Vázquez de Coronado García López de Cárdenas\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   = 50 or so men per village\n| strength2   = 350 Spanish men-at-arms\n2,000 Mexican Indian allies\n350 servants and followers\n| strength3   =\n| casualties1 = Hundreds killed, executed, or wounded\n| casualties2 = Small number of Spanish and Mexican fighters killed\nOver 100 wounded\n| casualties3 =\n| notes       = Tiwan women and children who survived were enslaved by the expedition\n| campaignbox =\n}}\nThe Tiguex War (Tee-wesh) was the first named war between Europeans and Native Americans in what is now part of the United States. The war took place in New Spain, during the colonization of Nuevo México. It was fought in the winter of 1540–41 by the expedition of Francisco Vázquez de Coronado against the twelve or thirteen Pueblos or settlements of what would become the Tiguex Province of Nuevo México. These villages were along both sides of the Rio Grande, north and south of present-day Bernalillo, New Mexico. The Tiguex War led to significant casualties on both sides and damage to all Pueblos, and increased tensions within Spanish-Native relations.\nBackground\nBefore the Tiguex war in 1540, Natives in the Tiguex province (also known as Tiwans) resided in the area for thousands of years and were well established along the Rio Grande. Pueblos were made up of multi-story buildings with some room blocks containing up to 450 ground floor rooms and were able to house thousands of people. Across 12 villages, there was an estimated 10 to 20 thousand people. Tiwans were known for farming corn, squash, beans, and cotton which allowed for rich trade with clothing made from cotton.\nDuring the 1500s, Spain was starting the colonization of North America, conquering both the Aztecs and the Inca. Once Spain established a colonial administration in Nueva Espana (now Mexico) they decided to explore North, hoping they would find the Seven Cities of Cibola (gold) and a possible better route for the shortest voyage to Asia. They were motivated by information provided by the remaining survivors of the Narváez expedition (also known as De Vaca expedition) which started in 1527 and ended in 1536. One of the survivors of the Narváez expedition was an African slave named Estevanico, who provided valuable insight into the mostly uncharted territory of southwest North America after arriving in Mexico City in August 1536.\nAs a result of the information provided by Estevanico, viceroy Antonio de Mendoza of New Spain organized a scouting party in 1539 led by Fray Marcos de Niza, a Spanish priest, with the goal of exploring present day New Mexico and locating native settlements. De Niza was accompanied by Estevanico, who helped guide the Spanish through the same territory he had ventured through a few years prior. After locating what they believed to be the Cibola, in reality a Zuni settlement, de Niza sent Estevanico ahead to make contact with the settlement. However, Estevanico was killed in his interaction with the Zuni people. Following Estevanico's death, de Niza fled back to Mexico City.\nSoon after de Niza’s arrival in Mexico City, viceroy Mendoza was granted the authority by the king of Spain, Carlos I, to organize and help fund another expedition to further explore lands northwest of Mexico with the goal of locating Cibola and more sources of trade.\nDuring the organization of the expedition in the early 1540s, it became one of the largest and most ambitious land-based explorations of the New World carried out by the Spanish Crown. Sparked by the lure of riches and new territories, the venture drew widespread interest and participation. Mendoza and other major figures such as Pedro de Alvarado invested the equivalent of millions of modern-day dollars in resources and supplies. The total value of the expedition reached approximately 600,000 Spanish pesos—about 19 tons of silver—making it a large financial undertaking. Even individual soldiers contributed significant sums, often investing the value of tens of thousands of dollars in goods.\nDue to unrest in the colony, Mendoza remained in Mexico and appointed Francisco Vázquez de Coronado, then governor of Nueva Galicia and a trusted ally, to lead the mission. Though young and lacking in military experience, Coronado was politically experienced and tied to wealth through his marriage. His leadership marked the beginning of an ambitious expedition involving not only 350 European soldiers and clerics but also a much larger contingent—between 1,300 and 2,000—of indigenous allies from central and western Mexico, known as Indios amigos or Indios aliados. These indigenous soldiers, representing around 20 different ethnic groups, formed the bulk of the fighting force and brought their own weaponry and traditions. Coronado's forces also brought many livestock with them, including an estimated 1,100 horses and mules that were used both for transportation and warfare. Furthermore, there are reports of an unspecified number of war dogs being brought on the expedition.\nWar\nGrowing tensions and initial conflicts\nIn August 1540, to establish a headquarters, Cárdenas set up camp at one of the largest of the Tiguex pueblos, Ghufoor (also called Coofor or Alcanfor). However, as more Spanish arrived and the original campsite grew untenable, the Spanish took over nearby pueblo buildings, forcing the native locals to relocate.\nWhile in Ghufoor, and facing an extreme weather they were inadequately prepared for, Cornado instructed his men to gather clothing and food from the Tiguex Province. The Spanish did so with little respect or consideration to the Natives, further exacerbating tensions.\nXauían from Ghufoor, also known by the Spanish nickname of Juan Alemán, opposed the Spanish after their increasing hostility despite being among the pueblo leaders to originally assist in their creation of a camp in Ghufoor. Due to the violence done to them by the Spanish, Xauían went to the chiefs of other tribes trying to establish a united Tiwa nation to fight off the Spanish hostility and not lose anymore resources.\nThe tensions came to a head when a pueblo man requested the Spanish punish a Spanish officer by the name of Juan de Villegas who was accused of raping the man's wife. Juan De Villegas was not formally investigated by the Spanish due to the lack of evidence against him. In December 1540, Tiwans retaliated for the abuses by killing 40 to 60 of the expedition's free-roaming horses and mules. Due to this hostile act against the Spanish occupancy, Coronado would formally declare war on the Tiwa.\nArenal and Moho\nAs Spanish tactics were to respond to any aggression swiftly and strongly, Coronado sent Cárdenas with a large force of Mexican Indian allies to conquer a Tiwa pueblo the Spaniards called Arenal. Despite attempting to surrender, all of Arenal's defenders were killed, including an estimated 30 Tiwas who the Spaniards burned alive at the stake. The Tiwas abandoned their riverside pueblos and made their last stand in a mesa-top stronghold the Spaniards called Moho.\nCoronado was not able to conquer the stronghold by force, so he laid siege to Moho for about 80 days in January–March 1541. Tiwas defended themselves by throwing rocks at the Spaniards from the roofs of their buildings and by firing arrows from inside their buildings. Finally, Moho's defenders ran out of water and attempted to escape in the night to the mountaintops that were around the stronghold. During the escape to the mountains, Xauían was killed while shielding women and children from Spanish hostility. Even though Xauían was killed during the escape, the survivors of the escape make it to the mountaintops around Moho. The Tiwa survivors then wage a guerilla resistance towards Coronado and the Spanish. Due to the harsh weather conditions, lack of food, and overall tiredness of Coronado and his men, Coronado and his army retreat from the area.\nAftermath\nCoronado then set off on his 1541 foray across the Great Plains to central Kansas in search of the chimerical riches of Quivira.  Upon his return, the Towa Indians of Jemez Pueblo had decided the Spaniards were enemies and turned hostile, resulting in a battle and siege against Pecos.\nThe Tiwas had abandoned all Pueblos until the expedition left for Kansas, at which point they reoccupied them, but later abandoned them in favor of larger singular Pueblos. Coronado withdrew back to Mexico in April 1542, and the Spaniards would not return for 39 years.\nLegacy\nBy the time of the next Spanish expedition led by Juan de Oñate in 1598, the Pueblo people in the Tiguex Province had reestablished themselves. But the underlying hostility eventually resurfaced in the 1680 Pueblo Revolt.\nIt was not until 1706 when La Villa de Alburquerque was established as an actual trade outpost for the Pueblos, that Native rights were finally being given thought. By the mid-1700s, Native American rights to their land were being recognized by the Santa Fe de Nuevo México government, by then governor Tomás Vélez Cachupín.\nThe cities of Cibola of that time have since become the modern Southern Tiwa Sandia Pueblo and Isleta Pueblo, and Keres Santa Ana Pueblo.\nPopular culture\nThe only book-length treatment of the Tiguex War is in the historical novel, Winter of the Metal People (2013).\nReferences"
    }
  ]
}