{
  "content": [
    {
      "type": "text",
      "text": "# Tim Elkington\n\nJohn Elkington}}\n|death_date=\n|birth_place=Edgbaston, Birmingham, England\n|death_place=London, England\n|placeofburial=\n|placeofburial_label= Place of burial\n|image=\n|caption=\n|allegiance= United Kingdom\n|serviceyears=1939 &ndash; 1975\n|rank=Wing Commander\n|branch= 22px Royal Air Force\n|unit=No. 1 Squadron RAFNo. 601 Squadron RAFNo. 134 Squadron RAFNo. 539 Squadron RAFNo. 197 Squadron RAF\n|battles=\n* Second World War\n* Battle of Britain\n* Defence of the Soviet Arctic\n* Burma Campaign\n----\n* Northern Ireland conflict\n|awards=\n|\n|laterwork= Founder of picture-framing business\n}}\nWing Commander John Francis Durham \"Tim\" Elkington (23 December 1920 – 1 February 2019) was a British Royal Air Force (RAF) fighter pilot who flew during the Battle of Britain, and was one of the last surviving aircrew known as \"The Few\".\nEarly life\nElkington was born in Edgbaston near Birmingham on 23 December 1920, the only child of Alan Durham Elkington and his wife Isabel Frances (née Griffin). He was educated at Hockley Heath and Bedford School.\nMilitary career\nElkington joined the Royal Air Force in September 1939 as a Flight Cadet at the Royal Air Force College Cranwell. Between October 1939 and April 1940 he trained at No. 9 Elementary Flying Training School at RAF Ansty. Elkington then undertook further training with No. 17 Service Flight Training School at RAF Cranwell. He was commissioned on 14 July 1940 and joined No. 1 Squadron RAF at RAF Northolt a day later and flew Hawker Hurricanes during the Battle of Britain. His first confirmed \"kill\" came on 15 August 1940, downing a Messerschmitt Bf 109.\nA day later he was shot down and wounded on 16 August 1940 (research shows that he was shot down by Helmut Wick). After recuperating at the Royal West Sussex Hospital at Chichester he rejoined No. 1 Squadron on 1 October 1940 at RAF Wittering.\nAfter a spell with No. 55 Operational Training Unit as an instructor, in late May 1941 he joined No. 601 Squadron RAF at RAF Manston. He was promoted to Flying Officer on 14 July 1941. From there he joined No. 134 Squadron RAF at RAF Leconfield in July 1941. On 12 August 1941 the squadron embarked on  and took off from the carrier on 7 September for an airfield near Murmansk. Until mid-October 1941 Elkington took part in escorting bombers and also trained Russian pilots to fly the Hurricane. On 6 October 1941 Elkington  shot down a German bomber Junkers Ju 88 over Vayenga. He returned from Russia in January 1942.\nIn April 1942 he joined the Merchant Ship Fighter Unit (MSFU) at RAF Speke until August 1942. After a short period with No. 1 Squadron again, in September 1942, Elkington joined No. 539 Squadron RAF at RAF Acklington flying Hurricanes alongside Douglas A-20 Havoc aircraft on night operations. He was promoted Flight Lieutenant 14 October 1942.\nAfter 539 Squadron was disbanded in late January 1943, he joined No. 197 Squadron RAF at RAF Drem flying the Hawker Typhoon. After operations from RAF Tangmere he was posted to No. 67 Squadron RAF at Alipore, Calcutta in December 1943. When the tour expired, Elkington spent three years commanding AFDU at RAF Amarda Road and he returned home in October 1946.\nPost war\nElkington had a long and varied career, including a tour with an Avro Shackleton Squadron in Northern Ireland.\nHe was promoted to Squadron Leader in 1946 and Wing Commander in 1961. Elkington retired from the Royal Air Force on 23 December 1975.\nLater life\nAfter leaving the RAF, Elkington set up an art and picture-framing business.\nReferences\nExternal links\n*[http://www.acesofww2.com/UK/aces/elkington/ Aces of WW2 page on Tim (with Tim's notes)]\n*[http://www.mission4today.com/index.php?name=Downloads2&screen=5636 Tim Elkington's Hurricane]"
    }
  ]
}