{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2017 Atlantic hurricane season\n\nThe 2017 Atlantic hurricane season was an event in the annual tropical cyclone season in the north Atlantic Ocean. This Atlantic hurricane season saw above-normal activity;|group=\"nb\"}} it was the seventh most active season on record and the most active since 2005. The season officially began on June&nbsp;1, 2017 and ended on November&nbsp;30, 2017. These dates, adopted by convention, historically describe the period in each year when most tropical systems form. However, storm formation is possible at any time of the year, as demonstrated in 2017 by the formation of the season's first named storm, Tropical Storm Arlene, on April&nbsp;19. The final storm of the season, Tropical Storm Rina degenerated to a remnant area of low pressure on November&nbsp;9.\nThe 2017 season produced 17 named storms, of which 10 became hurricanes including six of which intensified into major hurricanes (Category&nbsp;3, 4 or&nbsp;5). Of those six, Harvey and Irma, became the first major hurricanes to make landfall on the continental United States in 12 years; a third hurricane, Nate, did so as well. September was both the most active month in the season and the most active month for Atlantic hurricanes ever recorded. Four long-lived major hurricanes—Irma, Jose, Lee and Maria—moved through the Atlantic Basin, as did the short-lived Hurricane Katia. Overall, more accumulated cyclone energy was generated during September 2017 than during the entire 2016 season. In April 2018, the World Meteorological Organization retired the names Harvey, Irma, Maria, and Nate from its rotating naming lists due to the number of deaths and amount of damage they caused, and they will not be used again for another Atlantic hurricane.\nThis timeline documents tropical cyclone formations, strengthening, weakening, landfalls, extratropical transitions, and dissipations during the season. It includes information that was not released throughout the season, meaning that data from post-storm reviews by the National Hurricane Center, such as a storm that was not initially warned upon, has been included.\nBy convention, meteorologists use one time zone when issuing forecasts and making observations: Coordinated Universal Time (UTC), and also use the 24-hour clock (where 00:00 = midnight&nbsp;UTC). The National Hurricane Center uses both UTC&nbsp;and the time zone where the center of the tropical cyclone is currently located. The time zones utilized (east to west) prior to 2020 were: Atlantic, Eastern, and Central. In this timeline, all information is listed by UTC first with the respective regional time included in parentheses. Additionally, figures for maximum sustained winds and position estimates are rounded to the nearest 5&nbsp;units (knots, miles, or kilometers), following the convention used in the National Hurricane Center's products. Direct wind observations are rounded to the nearest whole number. Atmospheric pressures are listed to the nearest millibar and nearest hundredth of an inch of mercury.\nTimeline\nApril\nApril 19\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, April&nbsp;18) at Subtropical Depression One develops from an area of low pressure about  southwest of the Azores.\non April&nbsp;20]]\nApril 20\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST April&nbsp;19) at Subtropical Depression One transitions into Tropical Depression One roughly  southwest of the Azores.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Depression One intensifies into Tropical Storm Arlene approximately  southwest of the Azores.\nApril 21\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST April&nbsp;20) at }}Tropical Storm Arlene attains its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  west of the Azores.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Storm Arlene transitions into an extratropical cyclone roughly  west of the Azores, and subsequently dissipates.\nMay\n*No tropical cyclones form in the Atlantic Ocean during the month of May.\nJune\nJune 1\n* The 2017 Atlantic hurricane season officially begins.|group=\"nb\"}}\nJune 20\n* 02:00&nbsp;UTC (10:00&nbsp;p.m. AST) at Tropical Storm Bret attains peak winds of  and makes landfall in southwestern Trinidad.|group=\"nb\"}}|group=\"nb\"}}\nJune 21\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, June&nbsp;20) at Tropical Storm Cindy attains peak sustained winds of , about  southeast of Cameron, Louisiana.\nsatellite loop of Tropical Storm Cindy making landfall in Louisiana on June&nbsp;22]]\nJune 22\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Tropical Storm Cindy attains a minimum barometric pressure of , about  west-southwest of Cameron.\n* 07:00&nbsp;UTC (2:00&nbsp;a.m. CDT) at Tropical Storm Cindy makes landfall about  west of Cameron, just east of the Sabine Pass, with sustained winds of .\nJune 23\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, June&nbsp;22) at Tropical Storm Cindy weakens to a tropical depression about  north-northeast of Shreveport, Louisiana.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Depression Cindy degenerates to a remnant low about  west of Hopkinsville, Kentucky, and subsequently dissipates.\nJuly\nJuly 5\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Depression Four develops from a tropical wave about  east of the Lesser Antilles.\nJuly 6\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Depression Four attains its peak intensity with sustained winds of  and a minimum barometric pressure of , about  east of the Lesser Antilles.\nJuly 7\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Depression Four degenerates into a tropical wave roughly  east of the Lesser Antilles, and subsequently dissipates.\nJuly 17\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at A tropical depression develops from a tropical wave about  east-southeast of Barbados.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at The tropical depression intensifies into Tropical Storm Don about  east-southeast of Barbados.\nJuly 18\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, July&nbsp;17) at Tropical Storm Don attains its peak intensity with sustained winds of  and a minimum barometric pressure of , about  east-southeast of Barbados.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Storm Don opens up into a tropical wave about  southeast of Barbados and subsequently dissipates.\nJuly 30\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Tropical Depression Six forms from an area of low pressure about  west-northwest of St. Petersburg, Florida.\nshortly after Florida landfall on July&nbsp;31]]\nJuly 31\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, July&nbsp;30) at Tropical Depression Six intensifies to become Tropical Storm Emily about  west of St. Petersburg.\n* 14:45&nbsp;UTC (10:45&nbsp;a.m. EDT) at Tropical Storm Emily reaches its peak intensity with sustained winds of  and a minimum pressure of  while simultaneously making landfall about  north of Longboat Key, Florida.\nAugust\nAugust 1\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, July&nbsp;31) at Tropical Storm Emily weakens to a tropical depression inland, about  east of Longboat Key.\nAugust 2\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;1) at Tropical Depression Emily degenerates to a post-tropical cyclone over the Atlantic Ocean, roughly  northeast of Cape Canaveral, Florida, and later dissipates.\nAugust 7\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;6) at Tropical Storm Franklin develops from a tropical wave about  north-northeast of Cabo Gracias a Dios on the Honduras–Nicaragua border.|group=\"nb\"}}\nAugust 8\n* 03:45&nbsp;UTC (10:45&nbsp;p.m. EDT, August&nbsp;7) at Tropical Storm Franklin makes landfall near Pulticub, Quintana Roo, with winds of .\nnear peak intensity on August&nbsp;9]]\nAugust 9\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, August&nbsp;8) at Tropical Storm Franklin emerges over the Bay of Campeche,  northwest of Campeche City, Campeche.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Storm Franklin intensifies into a Category&nbsp;1 hurricane, about  east-northeast of Veracruz City, Veracruz.\nAugust 10\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, August&nbsp;9) at Hurricane Franklin attains its peak intensity with sustained winds of  and a minimum pressure of , about  north-northeast of Veracruz City.\n* 05:00&nbsp;UTC (12:00&nbsp;a.m. CDT) at Hurricane Franklin makes landfall near Vega de Alatorre, Veracruz, with sustained winds of near .\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Hurricane Franklin weakens to a tropical storm inland, about  west-southwest of Vega de Alatorre.|group=\"nb\"}}\nAugust 12\n* 18::00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Tropical Depression Eight forms from a tropical wave about  northeast of the Turks and Caicos Islands.\nAugust 13\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;12) at Tropical Depression Eight intensifies into Tropical Storm Gert about  northeast of the southeastern Bahamas.\nAugust 15\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at Tropical Storm Gert intensifies into a Category&nbsp;1 hurricane, about  west of Bermuda.\nAugust 16\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Gert intensifies into a Category&nbsp;2 hurricane, about  west-northwest of Bermuda.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Gert attains its peak intensity with maximum sustained winds of  and a minimum pressure of , about  south-southeast of Halifax, Nova Scotia.\nAugust 17\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Gert weakens to Category&nbsp;1 strength, about  south of St. John's, Newfoundland and Labrador.|group=\"nb\"}}\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Gert weakens to a tropical storm, about  south of St. John's.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Gert transitions into an extratropical cyclone, about  southeast of St. John's, and subsequently merges with another extratropical cyclone.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at The ninth tropical depression intensifies into Tropical Storm Harvey about  east of Barbados.\nAugust 18\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, August&nbsp;17) at Tropical Storm Harvey attains its initial peak windspeed of , about  east of Barbados.\n* 10:00&nbsp;UTC (6:00&nbsp;a.m. AST) at Tropical Storm Harvey makes landfall on Barbados, with sustained winds of .\n* 15:00&nbsp;UTC (11:00&nbsp;a.m. AST) at Tropical Storm Harvey makes landfall on St. Vincent, with sustained winds of .\nAugust 19\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Storm Harvey weakens to a tropical depression about  west of Saint Vincent.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Depression Harvey degenerates to a tropical wave about  west of St. Vincent.\nAugust 23\n* 12:00&nbsp;UTC (7:00&nbsp;a.m. CDT) at The remnants of Harvey regenerate into a tropical depression in the Bay of Campeche, about  west of Progreso, Yucatán.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Depression Harvey re-strengthens into a tropical storm about  west of Progreso.\nAugust 24\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Storm Harvey intensifies into a Category&nbsp;1 hurricane, about  south-southeast of Port O'Connor, Texas.\nAugust 25\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Hurricane Harvey intensifies into a Category&nbsp;2 hurricane, about  south-southeast of Port O'Connor.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Hurricane Harvey intensifies into a Category&nbsp;3 hurricane, about  south of Port O'Connor.\nAugust 26\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, August&nbsp;25) at Hurricane Harvey intensifies into a Category&nbsp;4 hurricane, about  south-southwest of Port O'Connor.\n* 03:00&nbsp;UTC (10:00&nbsp;p.m. CDT, August&nbsp;25) at Hurricane Harvey attains its peak intensity with sustained winds of  and a minimum barometric pressure of , and simultaneously makes landfall on San Jose Island, Texas.\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Hurricane Harvey weakens to Category&nbsp;3 intensity as it makes landfall on the northeast end of Copano Bay, near Holiday Beach, Texas.\n* 12:00&nbsp;UTC (7:00&nbsp;a.m. CDT) at Hurricane Harvey weakens to Category&nbsp;1 strength inland, about  north-northwest of Holiday Beach.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Hurricane Harvey weakens to tropical storm strength, about   north-northwest of Holiday Beach.\nAugust 29\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Storm Harvey attains a secondary peak windspeed of  in the Gulf of Mexico, about  south-southwest of Cameron, Louisiana.\nAugust 30\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, August&nbsp;29) at The tenth tropical depression of the season develops from a tropical wave, about  west-southwest of São Vicente in the Cabo Verde Islands.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at The tenth tropical depression develops into Tropical Storm Irma, about  west-southwest of São Vicente.\n* 08:00&nbsp;UTC (3:00&nbsp;a.m. CDT) at Tropical Storm Harvey makes its final landfall about  west of Cameron, with sustained winds of .\nAugust 31\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, August&nbsp;30) at Tropical Storm Harvey weakens to a tropical depression about  northeast of Cameron.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Storm Irma becomes a Category&nbsp;1 hurricane about  west of the Cabo Verde Islands.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Irma intensifies to Category&nbsp;2 strength, about  west of the Cabo Verde Islands.\nSeptember\nSeptember 1\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, August&nbsp;31) at Hurricane Irma intensifies into Category&nbsp;3 hurricane, about  west of the Cabo Verde Islands.\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Tropical Depression Harvey becomes extratropical over the Tennessee Valley, and subsequently dissipates.\nSeptember 2\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Irma weakens into Category&nbsp;2 hurricane, about  east of Barbuda.\nSeptember 3\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Irma re-strengthens into Category&nbsp;3 hurricane, about  east of Barbuda.\nSeptember 4\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Irma intensifies into Category&nbsp;4 hurricane, about  east of Barbuda.\nSeptember 5\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at The eleventh tropical depression of the season develops from a tropical wave about  west of the Cabo Verde Islands.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Irma intensifies to Category&nbsp;5 strength, about  east-southeast of Barbuda.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at The eleventh tropical depression develops into Tropical Storm Jose, about  west of the Cabo Verde Islands.\n* 12:00&nbsp;UTC (7:00&nbsp;a.m. CDT) at Tropical Depression Thirteen develops from a tropical wave about  north-northwest of Veracruz, Veracruz.\nSeptember 6\n* 05:45&nbsp;UTC (1:45&nbsp;a.m. AST) at Hurricane Irma makes landfall on Barbuda with sustained winds of .\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Irma reaches its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  west of Barbuda.\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Tropical Depression Thirteen intensifies into Tropical Storm Katia, about  north of Veracruz.\n* 11:15&nbsp;UTC (7:15&nbsp;a.m. AST) at Hurricane Irma makes landfall on St. Martin with sustained winds of .\n* 16:30&nbsp;UTC (12:30&nbsp;p.m. ADT) at Hurricane Irma makes landfall on Virgin Gorda, British Virgin Islands with sustained winds of .\n* 18:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Storm Jose becomes a Category&nbsp;1 hurricane, about  east of the Leeward Islands.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Storm Katia becomes a Category&nbsp;1 hurricane, about  north-northeast of Veracruz.\nSeptember 7\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Jose intensifies into a Category&nbsp;2 hurricane about  east of the Leeward Islands.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Jose intensifies into a Category&nbsp;3 hurricane about  east of the Leeward Islands.\n(left), Irma (center), and Jose (right)]]\nSeptember 8\n* 05:00&nbsp;UTC (1:00&nbsp;a.m. EDT) at Hurricane Irma weakens to a Category&nbsp;4 hurricane and makes landfall on Little Inagua, Bahamas, with sustained winds of .\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Jose intensifies into a Category&nbsp;4 hurricane about  east of the Leeward Islands.\n* 12:00&nbsp;UTC (7:00&nbsp;a.m. CDT) at Hurricane Katia intensifies into a Category&nbsp;2 hurricane about  north-northeast of Veracruz, Veracruz.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Hurricane Irma re-intensifies into a Category&nbsp;5 hurricane about  east of Cayo Romano, Cuba.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Hurricane Katia attains its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  north of Veracruz.\nSeptember 9\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;8) at Hurricane Jose attains its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  east of the Lesser Antilles.\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, September&nbsp;8) at Hurricane Katia weakens to a Category&nbsp;1 hurricane about  north of Veracruz.\n* 03:00&nbsp;UTC (11:00&nbsp;p.m. EDT, September&nbsp;8) at Hurricane Irma makes landfall near Cayo Romano, Cuba, with winds of .\n* 03:00&nbsp;UTC (10:00&nbsp;p.m. CDT September&nbsp;8) at Hurricane Katia makes landfall at Tecolutla, Veracruz, with winds of .\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at Hurricane Irma weakens to a Category&nbsp;4 hurricane in the Jardines del Rey archipelago, about  west of Cayo Romano.\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Hurricane Katia weakens to a tropical storm about  northwest of Veracruz.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. EDT) at Hurricane Irma weakens to a Category&nbsp;3 hurricane about  southeast of Isabela de Sagua, Cuba.|group=\"nb\"}}\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Hurricane Irma weakens to a Category&nbsp;2 hurricane about  northwest of Isabela de Sagua.\nSeptember 10\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, September&nbsp;9) at Hurricane Irma re-intensifies into a Category&nbsp;3 hurricane about  south-southeast of Key West, Florida.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at Hurricane Irma re-intensifies into a Category&nbsp;4 hurricane about  south-southeast of Key West, Florida.\n* 13:00&nbsp;UTC (9:00&nbsp;a.m. EDT) at Hurricane Irma makes landfall on Cudjoe Key, Florida, with winds of .\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Hurricane Irma weakens to a Category&nbsp;3 hurricane about  south of Marco Island, Florida.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Jose weakens to a Category&nbsp;3 hurricane about  northwest of the northern Leeward Islands.\n* 19:30&nbsp;UTC (3:30&nbsp;p.m. EDT) at Hurricane Irma makes its final landfall near Marco Island, with winds of .\nSeptember 11\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, September&nbsp;10) at Hurricane Irma weakens to a Category&nbsp;1 hurricane inland, about  east-northeast of Fort Myers, Florida.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Jose weakens to a Category&nbsp;2 hurricane about  northwest of the northern Leeward Islands.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. EDT) at Hurricane Irma weakens to a tropical storm about  west of Gainesville, Florida.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Jose weakens to a Category&nbsp;1 hurricane about  northwest of the northern Leeward Islands.\nSeptember 12\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at Tropical Storm Irma degenerates into a remnant low over central Alabama, and subsequently dissipates.\n(starting at lower right corner)]]\nSeptember 14\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Depression Fourteen develops from a tropical wave about  south of the Cabo Verde Islands.\nSeptember 15\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, September&nbsp;14) at Hurricane Jose weakens to a tropical storm about  northwest of the northern Leeward Islands.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Tropical Storm Jose re-intensifies into a Category&nbsp;1 hurricane about  northwest of the northern Leeward Islands.\nSeptember 16\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Depression Fourteen intensifies into Tropical Storm Lee about  southwest of the Cabo Verde Islands.|group=\"nb\"}}\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Depression Fifteen intensifies into Tropical Storm Maria about  east of Barbados.\nSeptember 17\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. EDT) at Hurricane Jose attains a secondary peak intensity with sustained winds of  and a barometric pressure of , about  southeast of Virginia Beach, Virginia.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Storm Lee weakens to a tropical depression about  west-southwest of the Cabo Verde Islands.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Storm Maria intensifies into a Category&nbsp;1 hurricane, about  east-southeast of Dominica.\nSeptember 18\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Maria intensifies into a Category&nbsp;3 hurricane, about  east-southeast of Dominica.\nnear peak intensity, moving towards Puerto Rico, on September&nbsp;19]]\nSeptember 19\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;18) at Hurricane Maria intensifies into a Category&nbsp;5 hurricane, about  east-southeast of Dominica.\n* 01:15&nbsp;UTC (9:15&nbsp;p.m. AST, September&nbsp;18) at Hurricane Maria makes landfall in Dominica with maximum winds near .\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Maria weakens to Category&nbsp;4 strength, about  west-northwest of Dominica.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. EDT) at Hurricane Jose weakens again to a tropical storm, about  east of Virginia Beach.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Maria re-strengthens into a Category&nbsp;5 hurricane about  southeast of Saint Croix.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Depression Lee re-intensifies into a tropical storm about  east of the northern Leeward Islands.\nSeptember 20\n* 03:00&nbsp;UTC (11:00&nbsp;p.m. AST, September&nbsp;19) at Hurricane Maria attains its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  south of Saint Croix.\n* 10:15&nbsp;UTC (6:15&nbsp;a.m. AST) at Hurricane Maria weakens to a Category&nbsp;4 hurricane and makes landfall near Yabucoa, Puerto Rico with maximum winds near .\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Tropical Storm Lee degenerates to a trough of low pressure about  east of the northern Leeward Islands.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Maria emerges off the northwest coast of Puerto Rico at Category&nbsp;2 strength, about  west of Arecibo, Puerto Rico.\nSeptember 21\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Maria re-strengthens into a Category&nbsp;3 hurricane about  northeast of Punta Cana, Dominican Republic.\nSeptember 22\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;21) at Hurricane Maria reaches a secondary peak wind speed of near , about  southeast of Grand Turk Island.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Remnants of Lee regenerate into a tropical depression about  east-southeast of Bermuda.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Tropical Storm Jose becomes a post-tropical cyclone about  south-southeast of Nantucket, Massachusetts, and subsequently dissipates.\nSeptember 23\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;22) at Tropical Depression Lee re-intensifies into a tropical storm about  east of Bermuda.\nSeptember 24\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Storm Lee intensifies into a Category&nbsp;1 hurricane about  east of Bermuda.\n* 06:00&nbsp;UTC 2:00&nbsp;a.m. EDT) at Hurricane Maria weakens to a Category&nbsp;2 hurricane, about  south-southeast of Cape Hatteras, North Carolina.\nSeptember 25\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;24) at Hurricane Lee intensifies into a Category&nbsp;2 hurricane, about  east of Bermuda.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Lee weakens to a Category&nbsp;1 hurricane, about  east of Bermuda.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at Hurricane Maria weakens to a Category&nbsp;1 hurricane, about  south-southeast of Cape Hatteras, North Carolina.\nSeptember 26\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Hurricane Lee re-intensifies into a Category&nbsp;2 hurricane about  east-southeast of Bermuda.\nSeptember 27\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Lee intensifies into a Category&nbsp;3 hurricane, about  east-southeast of Bermuda.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Lee attains its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  east of Bermuda.\nSeptember 28\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;27) at Hurricane Lee weakens to a Category&nbsp;2 hurricane about  east of Bermuda.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at Hurricane Maria weakens to a tropical storm about  east-northeast of Cape Hatteras.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Lee weakens to a Category&nbsp;1 hurricane about  east-northeast of Bermuda.\nSeptember 29\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Lee weakens to a tropical storm about  northeast of Bermuda.\nSeptember 30\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Storm Lee becomes a post-tropical low about  northwest of the Azores, and later opens up into a trough.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Storm Maria becomes extratropical about  southeast of Cape Race, Newfoundland, and subsequently dissipates.\nOctober\nOctober 4\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. EDT) at Tropical Depression Sixteen forms from an area of low pressure approximately  south of San Andres Island.\nOctober 5\n* 06:00&nbsp;UTC (02:00&nbsp;a.m. EDT) at Tropical Depression Sixteen intensifies into Tropical Storm Nate about  west-northwest of San Andres Island.\n* 12:00&nbsp;UTC (08:00&nbsp;a.m. EDT) at Tropical Storm Nate makes landfall on the coast of northeastern Nicaragua with winds of .\nentering the Gulf of Mexico on October&nbsp;7]]\nOctober 7\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Tropical Storm Nate intensifies into a Category&nbsp;1 hurricane over the southeastern Gulf of Mexico, about  south-southeast of the mouth of the Mississippi River.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Hurricane Nate attains its peak intensity with maximum sustained winds of  and a minimum barometric pressure of , about  south of the mouth of the Mississippi River.\nOctober 8\n* 00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, October&nbsp;7) at Hurricane Nate makes landfall at the mouth of the Mississippi River with maximum winds of .\n* 05:20&nbsp;UTC (12:20&nbsp;a.m. CDT) at Hurricane Nate makes its final landfall about  west of Biloxi, Mississippi with maximum winds of .\n* 06:00&nbsp;UTC (1:00&nbsp;a.m. CDT) at Hurricane Nate weakens to a tropical storm inland, about  north of Biloxi.\n* 18:00&nbsp;UTC (1:00&nbsp;p.m. CDT) at Tropical Storm Nate weakens into a tropical depression over northern Alabama.\nOctober 9\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, October&nbsp;8) at Tropical Depression Nate degenerates to a remnant low over central Tennessee.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. EDT) at The remnants of Nate become extratropical over southern Ohio, and subsequently dissipate.\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Storm Ophelia develops from an area of low pressure about  west-southwest of the Azores.\n(starting at lower left corner)]]\nOctober 11\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Storm Ophelia intensifies into a Category&nbsp;1 hurricane about  southwest of the Azores.\nOctober 12\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Ophelia intensifies into Category&nbsp;2 hurricane, about  southwest of the Azores.\nOctober 13\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, October&nbsp;12) at Hurricane Ophelia reaches an initial peak windspeed of , about  southwest of the Azores.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Ophelia weakens to a Category&nbsp;1 hurricane about  southwest of the Azores.\nOctober 14\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, October&nbsp;13) at Hurricane Ophelia re-strengthens into a Category&nbsp;2 hurricane about  southwest of the Azores.\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST) at Hurricane Ophelia intensifies into Category&nbsp;3 hurricane and simultaneously attains its peak intensity with maximum sustained winds of  and a minimum pressure of  about  south of the Azores.\nOctober 15\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, October&nbsp;14) at Hurricane Ophelia weakens to a Category&nbsp;2 hurricane about  southeast of the Azores.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Hurricane Ophelia weakens to a Category&nbsp;1 hurricane about  southwest of Mizen Head, Ireland.\nOctober 16\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, October&nbsp;15) at Hurricane Ophelia becomes an extratropical cyclone about  southwest of Mizen Head, and subsequently dissipates.|group=\"nb\"}}\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. EDT) at Tropical Depression Eighteen intensifies into Tropical Storm Philippe and simultaneously attains its peak intensity with winds of  and a minimum pressure of , about  east-southeast of the Isle of Youth.\n* 22:00&nbsp;UTC (6:00&nbsp;p.m. EDT) at Tropical Storm Philippe makes landfall along southern coast of the Zapata Peninsula of Cuba, about  west of the Bay of Pigs, with winds of .\nOctober 29\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;28) at Tropical Storm Philippe weakens to a tropical depression inland over west-central Cuba, and later dissipates.\nmoving across the northern Atlantic Ocean on November&nbsp;8]]\nNovember\nNovember 5\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST) at Tropical Depression Nineteen develops from the interaction between a tropical wave and a large mid- to upper-level trough about  east-southeast of Bermuda.\nNovember 7\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST November&nbsp;6) at Tropical Depression Nineteen intensifies into Tropical Storm Rina about  east of Bermuda.\nNovember 8\n* 06:00&nbsp;UTC (2:00&nbsp;a.m. AST) at Tropical Storm Rina attains peak sustained winds of  about  south-southeast of Cape Race, Newfoundland.\nNovember 9\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, November&nbsp;8) at Tropical Storm Rina attains a minimum barometric pressure of  about  south-southeast of Cape Race.|group=\"nb\"}}\nNovember 30\n*The 2017 Atlantic hurricane season officially ends.\nSee also\n*Lists of Atlantic hurricanes\n*Timeline of the 2017 Pacific hurricane season\nNotes\nReferences\nExternal links\n* [https://www.nhc.noaa.gov/archive/2017/  2017 Tropical Cyclone Advisory Archive], National Hurricane Center and Central Pacific Hurricane Center\n* [https://www.ncdc.noaa.gov/sotc/tropical-cyclones/201713 Hurricanes and Tropical Storms – Annual 2017], National Centers for Environmental Information"
    }
  ]
}