{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of college football in Kansas__disambig_1\n\nThis timeline of college football in Kansas sets forth notable college football-related events that occurred in the state of Kansas.\nOverview\nCollege football in Kansas began in 1890 and has its roots in the formation of the Kansas Collegiate Athletic Conference.  The first game was played on November 22 that year between Baker University and the University of Kansas.  Games have been played in the state continuously every year ever since.\nTimeline\n:Note: this timeline is incomplete.  You can help Wikipedia by expanding it.\n1890s\n* 1890\n** February 15 – The Kansas Intercollegiate Athletic Association is formed.\n** November 22 – The first official intercollegiate football game in the state of Kansas is played in Baldwin City, between the University of Kansas and Baker University.  Baker wins, 22–9.\n* 1891\n** October 31 – The first playing of the \"Border War\" between Kansas and Missouri, in Kansas City, Missouri.  Border War games are played Kansas City until 1911.  In 1912, Kansas hosts the game for the first time in Lawrence.\n* 1893\n** African American Ed Haney plays on the football team for the University of Kansas.\n** November 30 – Kansas State competes in its first intercollegiate football game, against St. Mary's College. The Manhattan Mercury reports afterward on its front page: \"About 30 spectators and lovers of the game accompanied our college foot ball team to St. Marys on Thanksgiving day and witnessed the defeat of St. Marys' college team by a score of 18 to 10.\"\n1900s\n* 1902\n** October 4 – Kansas State and Kansas play the first game of their long rivalry, a 16–0 Jayhawk win.\n* 1904\n** October 28 – Haskell College faces Carlisle at the 1904 World's Fair in St. Louis, in front of a crowd of 12,000 people, in an early inter-sectional college football \"championship\" game.\n* 1905\n** October 6 –  Cooper College (Sterling) plays Fairmount (Wichita State) in a night game – the first night college football game west of the Mississippi River.\n** December 25 – Washburn and Fairmount play an \"experimental\" game to test new rules.\n* 1908\n** November 26 – Kansas completes a 9–0 season and clinches the championship of the Missouri Valley Intercollegiate Athletic Association, the first major conference football title won by a state school.\n1910s\n* 1911\n** October 21 – Kansas beats Kansas State 6–0. After the teams did not play in 1910, this is the first game in a continuous series that has lasted more than 100 years – the sixth-longest continuous series in college football history.\n** November 25 – Over 1,000 people gather in downtown Lawrence to watch a live scale model reenactment of the Kansas Jayhawks game against Missouri.  Game statistics were transmitted by telegraph.\n* 1913\n** Kansas State formally leaves the Kansas Intercollegiate Athletic Association to join the Missouri Valley and compete against the University of Kansas and other larger schools in the region.\n1920s\n* 1928\n** December 1 –  The former Kansas Intercollegiate Athletic Conference disbanded to form the Kansas Collegiate Athletic Conference (\"little six\").\n1930s\n* 1939\n** October 28 –  Kansas State's homecoming game against Nebraska is broadcast on W9XAK television.  This is the first college football game broadcast in Kansas and the second anywhere in the nation.\n1940s\n* 1948\n** January 1 – Both Wichita State and Kansas play in bowl games on the same date – the first bowl appearances for any of the state's schools.  Wichita State plays in the Raisin Bowl, while KU plays in the Orange Bowl.  After the season ends, WSU's head coach Ralph Graham leaves to coach at his alma mater, Kansas State, which is at the time in the midst of an NCAA-record 28-game losing streak.\n* 1949\n** September 24 – Harold Robinson plays his first game for Kansas State, breaking the modern \"color barrier\" in Big Eight Conference athletics, and also becoming the first ever African-American athlete on scholarship in the conference.\n1950s\n* 1951\n** September 14 – Head coach Harold Hunt of Southwestern gains national praise by rejecting a touchdown when he observes his ball carrier stepping out of bounds.\n** Former Washburn Ichabods and Bethany Swedes head coach Bennie Owen is inducted into the College Football Hall of Fame.\n** Former Kansas head coach Fielding H. Yost is inducted into the College Football Hall of Fame.\n* 1955\n** Former Haskell football head coach Matty Bell is inducted into the College Football Hall of Fame.\n* 1957\n** December 21 – Pittsburg State wins its first NAIA national championship.\n1960s\n* 1961\n** Pittsburg State wins its second NAIA National Title.\n** Kansas Sports Hall of Fame is founded.  The organization celebrates all Kansas sports with 19 inductees its first year, including Garfield Weede, Ernie Quigley, Mike Ahearn, Bill Hargiss, and Emil Liston.\n*1966\n** Former Kansas State head coach Pappy Waldorf is voted in to the College Football Hall of Fame.\n*1969\n** October 11 – Kansas State beats KU 26–22, in the first contest in the Governor's Cup series. The game features star players on both sides, with KU led by future Pro Football Hall of Fame running back John Riggins, and KSU led by quarterback Lynn Dickey.\n** November 22 - The Kansas State High School Activities Association holds its first state championship games. Previously, there were no playoffs for high school teams, and champions were determined by media polls.\n1970s\n* 1970\n** October 2 – Approximately half of the Wichita State University football team dies in a plane crash on way to play a game against Utah State University.\n** December 5 – The first Boot Hill Bowl game is played.\n* 1971\n**Kansas State High School Activities Association develops and begins using new overtime rules.  These rules become the future standard for overtime in college football.\n* 1974\n** The College of Emporia closes, discontinuing its football program.\n* 1978\n** Former Kansas State head coach Charlie Bachman is voted in to the College Football Hall of Fame.\n* 1979\n** Willie Jeffries is named the head coach at Wichita State, the first African-American head coach of an NCAA Division-I program at a predominantly white school.\n1980s\n* 1980\n** November 20 – The first Sunflower Bowl is played.\n** November 21 –  The final Boot Hill Bowl game is played.\n* 1986\n** November 15 – The final Sunflower Bowl is played.\n** December 2 – Wichita State University discontinues its football program.\n* 1988\n** December 13 - Bill Snyder. the offensive coordinator for the Iowa Hawkeyes, is named Kansas State's new head coach.\n* 1989\n**Emporia State advances to the NAIA National Championship game, losing to Carson-Newman\n1990s\n* 1991\n** Pittsburg State wins its first NCAA Division II National Championship and 3rd title overall.\n* 1992\n** Saint Mary of the Plains closes (and also its football program)\n* 1995\n** October 28 – Kansas State and Kansas face each other as ranked football teams for the first time.  KU comes into the game ranked number 6 in the nation in the AP Poll, while KSU is ranked number 14.  KSU wins the game, 41–7.\n** The Wheat Bowl plays its first game.\n* 1996\n** August 31 – Texas Tech plays at Kansas State in the first ever Big 12 Conference football game.\n* 1998\n** November 9 – Kansas State rises to the number 1 ranking in the Coaches Poll after improving to 9–0, the first time a state school is ranked first in the nation in the Division I college football polls. The Wildcats finish the regular season 11-0, but squander a chance to play for the national championship by losing 36-33 in double overtime to Texas A&M in the Big 12 Championship game.\n2000s\n* 2001\n** Former Kansas tackle/halfback and former head coach at Kansas, Washburn and Haskell John H. Outland is inducted into the College Football Hall of Fame.\n* 2002\n** Former Wichita State head coach Marcelino Huerta is inducted into the College Football Hall of Fame.\n* 2004\n** Charlie Richard, former head coach at Baker University, is inducted into the College Football Hall of Fame\n*2005\n** November 19 - Bill Snyder retires after 17 seasons as head coach at Kansas State.\n* 2006\n** The final Wheat Bowl game is played.\n* 2007\n** November 24 - Kansas, ranked second in the Associated Press poll, has an opportunity to ascend to No. 1 by defeating archrival Missouri at Arrowhead Stadium in Kansas City, Missouri. However, the Tigers win 36-28 and ascend to the top.\n*2008\n** November 24 - Bill Snyder returns as head coach at Kansas State. His second tenure will last 10 seasons (2009-18).\n* 2009\n** May 12 – The first Kanza Bowl is played\n2010s\n* 2010\n** Former Bethany Swedes head coach Ted Kessinger is inducted into the College Football Hall of Fame, the second Hall of Fame coach from the small school in Lindsborg.\n** Former Wichita State head coach Willie Jeffries  is inducted into the College Football Hall of Fame.\n* 2011\n** Pittsburg State win its second NCAA Division II title, its 4th title overall.\n* 2012\n** November 15 – The final Kanza Bowl is played.\n** Former Haskell head coach William Henry Dietz is inducted into the College Football Hall of Fame.\n* 2015\n** January 9, 2015 – Kansas State head coach Bill Snyder is inducted into the College Football Hall of Fame\n** May 22, 2015 – Haskell University suspends football for the 2015 season.\n* 2016\n**Baker University advances to the 2016 NAIA Football National Championship, losing to Saint Francis (Indiana).\n* 2017\n**September 2, 2017 – Kansas State football player Scott Frantz becomes the first openly gay college football player to play at the NCAA's highest level. Frantz announced to ESPN prior to the season that he is gay.\nSee also\n* List of college athletic programs in Kansas\nReferences\n}}"
    }
  ]
}