{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of New Zealand history__disambig_1\n\nThis is a timeline of the history of New Zealand that includes only events deemed to be of principal importance.\nBefore humans (before c. 1300 CE)\n* 85 mya: Around this time New Zealand splits from the supercontinent Gondwana.\n* 5 mya: New Zealand's climate cools as Australia drifts north. Animals that have adapted to warm temperate and subtropical conditions become extinct.\n* 26,500 BP: The world's most recent supereruption occurs at the Taupō Volcano. The eruption covers much of the country with volcanic ash and causes the Waikato River to shift course from the Hauraki Plains to its current path to the Tasman Sea, while its caldera becomes modern Lake Taupō.\n* 18,000 BP: New Zealand's North and South islands are connected by a land bridge during the Otira Glacial Maximum of the last ice age. Glaciers spread from the Southern Alps carving valleys and making fiords in the South Island. The land bridge is submerged around 9,700 BCE.\n* 181 CE: Hatepe eruption of Lake Taupō.\nAfter Polynesian arrival (c. 1300 to 1839)\nc. 1300 to c. 1500\n* : Humans first settled New Zealand, according to evidence from the earliest archaeological sites.\n* : Most likely period of ongoing early settlement of New Zealand by Polynesian people (the Archaic Moa-Hunter Culture).\n* : Rangitoto Island near Auckland is formed by a series of eruptions.\n* : Development of the Classic Māori Material Culture including expansion of Māori settlement from coastal to inland areas, increase in horticulture and development of pā\n* : Most likely extinction of the moa.\n17th century\n;1601 onwards\n* Expansion and migration of Māori groups and formation of classic iwi, many of which still exist today\n;1642\n* 13 December: Dutch explorer Abel Tasman sights the South Island. He originally named it Staten Landt, but the Dutch East India Company cartographer Joan Blaeu subsequently changed it to Nieuw Zeeland.\n* 18 December: Abel Tasman's expedition sails around Farewell Spit and into Golden Bay. Dutch sailors sight local Māori.\n* 19 December: Four of Tasman's crew are killed at Wharewharangi (Murderers) Bay by a Ngāti Tūmatakōkiri war party. Tasman's ships are approached by 11 waka as he leaves and his ships fire on them, hitting a Māori standing in one of the waka. Tasman's ships depart without landing. The Dutch chart the west of the North Island.\n18th century\n;1701 to 1730\n* Ngāi Tahu migrate from Wellington to the South Island, as far south as Banks Peninsula.\n;1769\n* 8 October: English explorer James Cook makes his first visit to New Zealand on board the Endeavour, and sails into Poverty Bay\n* Cook maps the majority of the New Zealand coastline.\n* French trader Jean de Surville explores parts of the New Zealand coast.\n* 25 December: The first Christian service in New Zealand waters when Mass is celebrated on Christmas Day in Doubtless Bay by Father Paul-Antoine Léonard de Villefeix of the de Surville expedition.\n;1772\n* April: Expedition of French explorer Marc-Joseph Marion du Fresne visits Northland, and anchors at Spirits Bay.\n* 12 June: Marion du Fresne is killed at Tacoury's Cove, Bay of Islands by local Māori.\n;1773\n* April: Cook's second expedition arrives in Queen Charlotte Sound\n* 18 December: A skirmish at Grass Cove in Queen Charlotte Sound results in the deaths of two Māori and nine members of Cook's expedition.\n;1777\n* Cook returns to New Zealand aboard the Resolution, accompanied by the Discovery captained by Charles Clerke.\n;1788\n* New South Wales founded, which, according to Governor Phillip's Commission, includes the islands of New Zealand.\n;1790\n* An epidemic of rewha-rewha (possibly influenza) kills 60% of the Māori population in the southern North Island.\n;1791\n* 29 November: Chatham Islands sighted by HMS Chatham commanded by William Broughton.\n;1792\n* Group of sealers from the Britannia landed in Tamatea / Dusky Sound.\n;1793\n* Dusky Sound sealers picked up.\n* A Spanish expedition led by Italian explorer Alessandro Malaspina charts Doubtful Sound\n* La Recherche and ''L'Espérance'', captained by Bruni d'Entrecasteaux and Jean-Michel Huon de Kermadec sight New Zealand and the Kermadec Islands.\nEarly 19th century\n;1806\n* First Pākehā (European) women arrive in New Zealand.\n;c. 1807\n* Ngāti Toa, Ngāti Raukawa and allied tribes from the west coast south of the Waikato, the southern North Island and the east coast attack Waikato and Ngāti Maniapoto, supported by Ngāti Whātua and Hauraki, in the Battle of Hingakaka, the largest battle ever fought in New Zealand, with the defenders prevailing.\n;1807 or 1808\n* Ngāpuhi fight Ngāti Whātua, Te-Uri-o-Hau and Te Roroa iwi at the battle of Moremonui on the west coast of Northland, the first battle in which Maori used muskets.\n;1809\n* Ngati Uru attack and burn the ship Boyd, killing all but four of its crew and passengers. Whalers wrongly blame Te Puna chief Te Pahi and in a revenge attack kill 60 of his followers.\n;1814\n* 22 December: British missionary Samuel Marsden, of the (Anglican) Church Missionary Society, arrives at Rangihoua at Oihi Bay in the Bay of Islands to establish the country's first mission station. Sheep, cattle, horses and poultry are introduced.\n* 25 December: Marsden holds the first Christian service on land, on Christmas Day.\n;1815\n* February: Thomas Holloway King is the first Pākehā child born in New Zealand, at Rangihoua.\n*\n;1819\n* Raids on Taranaki and Te Whanganui-a-tara regions by Ngāpuhi and Ngāti Toa people led by chiefs Patuone, Nene, Moetara, Tuwhare, and Te Rauparaha.\n* 17 August: the country's second mission station is established, at Kerikeri, when Rev Marsden, John Butler, Francis Hall and William Hall mark out the site which was previously visited by Marsden in 1815.\n* 25 September: Rev Marsden plants 100 vines, the first grapes grown in New Zealand.\n* 4 November: Chiefs Hongi Hika and Rewa sell 13,000 acres (5260 hectares) at Kerikeri to the Church Missionary Society for 48 felling axes.\n;1820\n* 3 May: At Kerikeri, Reverend John Butler uses a plough for the first time in the country.\n* Hongi Hika visits England, meets King George IV and secures supply of muskets.\n;1821\n* Continuation of musket wars by Hongi Hika and Te Morenga on southern iwi throughout the decade.\n;1822\n* Ngāti Toa begin migration south to Cook Strait region, led by Te Rauparaha.\n;1823\n* Jurisdiction of New South Wales courts is extended to British citizens in New Zealand.\n* First Wesleyan Missionary Society mission, Wesleydale, established, at Whangaroa.\n* First Church of England marriage, between Phillip Tapsell and Maria Ringa, conducted by Thomas Kendall in the Bay of Islands.\n;1824\n* Te Heke Niho-puta migration of Taranaki iwi to the Kāpiti Coast.\n;1825\n* The battle of Te Ika-a-ranganui between Ngāpuhi and hapu against Ngatiwhatua, resident occupiers of the land fought upon.\n;1827\n* Te Rauparaha's invasion of the South Island from Kapiti begins.\n* Wesleyan Methodist missionary station at Wesleydale is plundered by Ngāpuhi warriors, and abandoned by the missionaries.\n;1831\n* Whaling stations established at Tory Channel and Preservation Inlet.\n;1832\n* 19 April: stonemason William Parrott begins work on the missionaries' Stone Store at Kerikeri.\n* James Busby appointed British Resident.\n;1833\n* May: James Busby arrives at the Bay of Islands.\n;1834\n* March: United Tribes of New Zealand flag adopted by some 25 northern chiefs at Busby's suggestion.\n* The battle of Haowhenua is fought on the Kāpiti Coast between Ngāti Raukawa and Te Āti Awa, with various allies on both sides.\n;1835\n* 22 April: Wesleyan missionaries extend south beyond their main base at Hokianga to the Waikato Coast, among them James and Mary Wallis.\n* October: Declaration of Independence of New Zealand by the \"Confederation of United Tribes\" signed by 34 northern chiefs (and later by another 18).\n* 19 November: The brig Lord Raglan carrying 500 Māori from Ngati Tama and Ngati Mutunga arrives at the Chatham Islands. It is followed by another sailing with 400 more on 5 December. Those Moriori that are not killed are enslaved.\n;1837\n* Captain William Hobson sent by New South Wales Governor to report on New Zealand. He suggested a treaty with the Māori and imposition of British Law.\n* New Zealand Association formed in London, becoming the New Zealand Colonisation Society in 1838 and the New Zealand Company in 1839, under the inspiration of Edward Gibbon Wakefield.\n;1838\n* Bishop Pompallier founds Roman Catholic Mission at Hokianga.\n;1839\n* William Hobson instructed to establish British rule in New Zealand, as a dependency of New South Wales.\n* Colonel William Wakefield of the New Zealand Company arrives on the Tory to purchase land for a settlement.\nColony and self-government (1840 to 1946)\n1840s\n;1840\n* 22 January: New Zealand Company settlers arrive aboard the Aurora at Te Whanganui a Tara which becomes Port Nicholson, site of Wellington.\n* 29 January: William Hobson arrives in the Bay of Islands and reads out the proclamation of sovereignty.\n* 6 February: Hōne Heke is the first to sign the Treaty of Waitangi at Bay of Islands.\n* 21 May: Hobson proclaims British sovereignty over New Zealand. The North Island by treaty and the South Island by discovery.\n* May: First capital established at Okiato, which was renamed Russell.\n*  St Peter's School, the first Catholic school in New Zealand, opened in Kororareka.\n* 18 August: French colony established in Akaroa.\n* Hobson becomes first governor and sets up executive and legislative councils.\n* Rawiri Taiwhanga in Bay of Islands is running the first dairy farm in New Zealand, near Kaikohe.\n;1841\n* European settlements established at New Plymouth and Wanganui.\n* February: Capital shifted from Russell (Okiato) to Auckland.\n* 3 May: New Zealand proclaimed a colony independent of New South Wales.\n* 27 September 1841: Foundation of a Catholic school for boys, Auckland's first school of any sort.\n;1842\n* Main body of settlers arrive at Nelson.\n* 10 September: Governor Hobson dies in Auckland.\n;1843\n* Twenty-two European settlers and four Māori killed in the Wairau Affray at Tuamarina, near the Wairau River, in Marlborough, marking the start of the New Zealand Wars.\n* Robert FitzRoy succeeds Hobson as governor.\n;1844\n* Hone Heke begins the Flagstaff War.\n* New Zealand Company suspends its colonising operations due to financial difficulties.\n;1845\n* George Grey becomes governor.\n;1846\n* Flagstaff War with the capture of Ruapekapeka.\n* First Constitution Act passed.\n* Charles Heaphy, William Fox, and Thomas Brunner begin exploring the West Coast.\n* First steam vessel, HMS Driver, arrives in New Zealand waters.\n;1848\n* Settlement of Dunedin founded by Scottish Otago Association.\n* New Ulster Province and New Munster Province set up under 1846 Act.\n* Coal discovered at Brunner on the West Coast.\n* Earthquake centred in Marlborough damages most Wellington buildings.\n1850s\n;1850\n* Canterbury settlement founded.\n;1852\n* Second New Zealand Constitution Act passed creating General Assembly and six provinces with representative government.\n;1853\n* Idea of a Māori King canvassed by Tāmihana Te Rauparaha and Hēnare Mātene Te Whiwhi.\n* About 100 Māori – mostly chiefs – enrolled to vote in the forthcoming election.\n* 4 July–1 October: 1853 New Zealand general election\n;1854\n* First session of the General Assembly opens in Auckland.\n;1855\n* Governor Thomas Gore Browne, appointed in 1854, arrives.\n* A severe magnitude 8.1 earthquake strikes Wairarapa. Noted for having the largest movement of a strike-slip earthquake in history, at 17 metres.\n* Adhesive postage stamps on sale.\n* 28 October–28 December: 1855 New Zealand general election.\n;1856\n* Henry Sewell forms first ministry under responsible government and becomes first Premier.\n* Edward Stafford forms first stable ministry.\n;1857\n*Foundation of Auckland's first Catholic boys' secondary school, St Peter's School.\n;1858\n* New Provinces Act passed.\n* Te Wherowhero installed as first Māori King, taking name Pōtatau I.\n;1859\n* First session of Hawke's Bay and Marlborough provincial councils.\n* Gold discovered in Buller River.\n* New Zealand Insurance Company established.\n1860s\n;1860\n* Waitara dispute develops into First Taranaki War.\n* 25 June: The Māori King Pōtatau Te Wherowhero dies and is succeeded by his son Tāwhiao.\n* 12 December – 28 March: 1860–1861 New Zealand general election.\n;1861\n* 4 December: George Grey becomes governor for the second time.\n* May, Gabriel Read discovers gold in Gabriel's Gully near Lawrence. Otago gold rush begins.\n* First session of Southland provincial council.\n* 2 July: Bank of New Zealand incorporated at Auckland.\n;1862\n* The country's first electric telegraph line opens, between Christchurch and Lyttelton.\n* First gold shipment from Dunedin to London.\n;1863\n* War resumes in Taranaki and begins in Waikato when General Cameron crosses the Mangatawhiri stream.\n* New Zealand Settlements Act passed to effect land-confiscation.\n* First steam railway in New Zealand, the Ferrymead Railway opened.\n* 7 February:  sinks in Manukau Harbour, killing 189 people.\n* 23 February: 7.5 earthquake causes moderate damage across central New Zealand.\n;1864\n* War in the Waikato ends with battle of Ōrākau.\n* Gold discovered in Marlborough and Westland.\n* Arthur, George, and Edward Dobson are the first Pākehā to cross what becomes known as Arthur's Pass.\n;1865\n* Capital and seat of government transferred from Auckland to Wellington\n* New Zealand Exhibition held in Dunedin\n* Native Land Court established.\n* Government launches the first of what would become 3,000,000 acres of land-confiscations from Māori in Waikato, Taranaki, Bay of Plenty, and Hawke's Bay.\n* Māori resistance continues.\n* Auckland streets lit by gas for first time.\n;1866\n* First (unreliable) Cook Strait submarine telegraph cable laid.\n* Christchurch to Hokitika road opens.\n* Cobb and Co. coaches run from Canterbury to the West Coast.\n* The Presbytery of Otago separates into three presbyteries and becomes the Synod of Otago and Southland.\n* January–February: Trevor Chute leads raids against Maro in Taranaki\n* 12 February–6 April: 1866 New Zealand general election.\n;1867\n* Thames goldfield opens; soon the town has more people than Auckland.\n* The Maori Representation Act establishes four electoral seats in parliament for Māori, who until then had been indirectly excluded from parliament and from voting due to the land ownership requirement, which did not account for native title under which most Māori owned land.\n* Lyttelton railway tunnel completed.\n* Armed constabulary established.\n;1868\n* Māori resistance continues through campaigns of Te Kooti Arikirangi and Titokowaru.\n* New Zealand's first sheep breed, the Corriedale, is developed.\n;1869\n* Thomas Burns founds New Zealand's first university, the University of Otago, in Dunedin.\n* Visit of Prince Alfred – the first Royal Tour.\n1870s\n;1870\n* The last imperial forces leave New Zealand.\n* Julius Vogel's public works and immigration policy begins, along with national railway construction programme; over 1,000 miles constructed by 1879.\n* University of New Zealand created by the New Zealand University Act, establishing a federal university based on the University of London, which lasts until 1961.\n* First rugby match.\n* Auckland to San Francisco mail service begins.\n;1871\n* Deer freed in Otago.\n* 14 January–23 February: 1871 New Zealand general election.\n;1872\n* Te Kooti retreats to the King Country and Māori armed resistance ceases.\n* Telegraph communication links Auckland, Wellington and southern provinces.\n;1873\n* New Zealand Shipping Company established.\n;1874\n* First New Zealand steam engine built at Invercargill.\n;1875\n* 20 December – 29 January: 1875–1876 New Zealand general election.\n;1876\n* Abolition of the provinces and establishment of local government by counties and boroughs.\n* New Zealand-Australia telegraph cable established.\n;1877\n* Education Act passed, establishing national system of primary education, \"free, secular, and compulsory\".\n;1878\n* Completion of Main South Line railway linking Christchurch, Dunedin, and Invercargill.\n;1879\n* Triennial Parliaments Act passed. Manhood suffrage is extended to non-Māori when the vote is given to every male aged 21 and over.\n* Kaitangata mine explosion, 34 people die.\n* Annual property tax introduced.\n* Kangaroo lays the first reliable telegraph cable across Cook Strait.\n* 28 August–15 September: 1879 New Zealand general election all men enfranchised.\n1880s\n;1881\n* Parihaka community forcibly broken up by troops. Te Whiti, Tohu Kākahi and followers arrested and imprisoned.\n* Wreck of SS Tararua, 131 people die.\n* Auckland and Christchurch telephone exchanges open.\n* The Māori King Movement under Tāwhiao makes peace with the Auckland settler government.\n* 9 December: 1881 New Zealand general election.\n;1882\n* First shipment of frozen meat leaves Port Chalmers for England on the Dunedin.\n* \"State\" visit of King Tawhiao to Auckland – civic reception, banquet & fireworks display.\n;1883\n* Te Kooti pardoned, Te Whiti and other prisoners released.\n* Direct steamer link established between New Zealand and Britain.\n;1884\n* King Tawhiao visits England with petition to the Queen, appealing to the Treaty of Waitangi, and is refused access.\n* First overseas tour by a New Zealand rugby team, to New South Wales.\n* Construction of King Country section of North Island main trunk railway begins.\n* 22 June: 1884 New Zealand general election.\n* 1 August International Industrial Exhibition opened in Wellington.\n* 9 September total Eclipse of the Sun observed at Wellington.\n* November Russian Invasion Scare.\n;1885\n* Mary C. Leavitt, World Missionary for the Woman's Christian Temperance Union, toured New Zealand setting up local branches; appointed Anne Ward of Wellington as the first national president to continue recruiting and organising departments to advocate for women's political and socio-economic rights.\n;1886\n* 23–24 February – First national convention of Women's Christian Temperance Union New Zealand held in Wellington, launching the organisational strategies for a campaign for women's right to vote in national elections.\n* 29 March − 10 April – Visit of German warships to Auckland – SMS Gneisenau & SMS Olga.\n* 11–21 May – Visit of Japanese warship Tsubka to Wellington.\n* 23 May – 2 June surprise visit of Russian naval Vestnik to Wellington.\n* 10 June Mount Tarawera erupts and the Pink and White Terraces are destroyed, around 120 people die.\n* Oil is discovered in Taranaki.\n;1887\n* New Zealand's first national park, Tongariro National Park, is presented to the nation by Te Heuheu Tukino IV.\n* First inland parcel post service.\n* 26 September: 1887 New Zealand general election.\n;1888\n* 12 August: Reefton becomes first town in the Southern Hemisphere to have a public supply of electricity after the commissioning of the Reefton Power Station.\n;1889\n* Abolition of non-residential or property qualification to vote.\n* First New Zealand-built locomotive completed at Addington Workshops.\n1890s\n;1890\n* A maritime strike in Australia spreads to New Zealand, involving 8000 unionists.\n* \"Sweating\" Commission reports on employment conditions.\n* 5 December: 1890 New Zealand general election, the first election on a one-man-one-vote basis\n;1891\n* John McKenzie introduces the first of a series of measures to promote closer land settlement.\n* John Ballance becomes Premier of Liberal Government.\n;1892\n* First Kotahitanga Māori Parliament meets.\n;1893\n* 27 April: John Ballance dies\n* John Ballance succeeded as premier by Richard Seddon.\n* 19 September: All women given the right to vote, New Zealand becomes the first country to grant universal suffrage and plural voting abolished.\n* Liquor licensing poll introduced.\n* Elizabeth Yates, Onehunga, becomes the first woman mayor in British Empire.\n* Banknotes become legal tender.\n* 28 November: 1893 New Zealand general election.\n;1894\n* Compulsory arbitration of industrial disputes and reform of employment laws.\n* Advances to Settlers Act.\n* Clark, Fyfe and Graham become the first people to climb Mt Cook.\n* Wreck of SS Wairarapa.\n;1896\n* National Council of Women is founded.\n* The Brunner Mine disaster kills 67.\n* Census measures national population as 743,214.\n* 13 October: First public screening of a motion picture in New Zealand\n* 4 December: 1896 New Zealand general election.\n;1897\n* First of series of colonial and later imperial conferences held in London.\n* Āpirana Ngata and others form the Te Aute College Students' Association. [https://web.archive.org/web/20060901233024/http://www.stats.govt.nz/quick-facts/people/history-1850-1899.htm]\n;1898\n* Old Age Pensions Act.\n* First cars imported to New Zealand.\n;1899\n* New Zealand army contingent is sent to the South African war.\n* First celebration of Labour Day.\n* 6 December: 1899 New Zealand general election.\n1900s\n;1900\n* Māori Councils Act passed.\n* Public Health Act passed setting up Department of Public Health in 1901.\n;1901\n* Cook and other Pacific Islands annexed.\n* Penny postage first used.\n* Union of the Synod of Otago and Southland with the Northern Presbyterian Church to form the Presbyterian Church of Aotearoa New Zealand.\n* Royal Tour – Visit of the Duke & Duchess of York and Cornwall.\n;1902\n* Pacific telegraph cable begins operating between New Zealand, Australia and Fiji.\n* Wreck of trans-tasman steamer SS Elingamite.\n* 25 November: 1902 New Zealand general election.\n;1903\n* 31 March: Richard Pearse achieves semi-controlled flight near Timaru.\n* 15 August: The New Zealand All Blacks play their first Rugby Test Match against Australia's Wallabies at the Sydney Cricket Ground in Sydney, New South Wales, Australia. New Zealand win, 22–3.\n;1904\n;1905\n* New Zealand rugby team tours England and becomes known as the All Blacks.\n* Old Age Pension increases to £26 per year; however, eligibility tightened.\n* 6 December: 1905 New Zealand general election.\n;1906\n* 10 June: Richard Seddon dies and is succeeded by Joseph Ward as premier.\n;1907\n* July: Resolution passed to constitute New Zealand as a Dominion.\n* Fire destroys Parliament buildings.\n* Tohunga Suppression Act passed\n* 26 September: Dominion of New Zealand declared.\n;1908\n* Auckland to Wellington main trunk railway line opens.\n* First New Zealanders compete at the Olympics as part of Australasian team.\n* Harry Kerr is the first New Zealander to win an Olympic medal (a bronze in the Men's 3500 metre walk).\n* Blackball coal miner strike lasts 11 weeks.\n* Ernest Rutherford is awarded the Nobel Prize in Chemistry.\n* New Zealand's population reaches one million.\n* 17 November, 24 November and 1 December: 1908 New Zealand general election.\n;1909\n* \"Red\" Federation of Labour formed.\n* SS Penguin wrecked in Cook Strait, 75 people die.\n* Compulsory military training introduced.\n* Stamp–vending machine invented and manufactured in New Zealand.\n1910s\n;1910\n* Halley's Comet sighted in New Zealand.\n;1911\n* 7 December, 14 December: 1911 New Zealand general election.\n;1912\n* William Massey wins vote in the House and becomes prime minister; Reform Government formed.\n* Waihi miners' strike.\n* Malcolm Champion becomes first New Zealander to win an Olympic gold medal.\n;1913\n* Waterfront strikes in Auckland and Wellington.\n;1914\n* World War I begins and German Samoa is occupied.\n* New Zealand Expeditionary Force is despatched to Egypt.\n* Huntly coal mine disaster, 43 people die.\n* 15 August: Troops depart for Samoa.\n* 29 August: New Zealand troops land unopposed in Apia.\n* October: 8427 troops leave New Zealand for Europe.\n* 10 December: 1914 New Zealand general election.\n;1915\n* New Zealand forces take part in Gallipoli campaign.\n* Reform and Liberal parties form National War Cabinet.\n* Britain announces its intention to purchase all New Zealand meat exports during war.\n* 25 April: First landings at Gaba Tepe and Cape Helles on the Gallipoli Peninsula.\n* 27 April: Counterattack launched by Turkish forces under the command of Mustafa Kemal Atatürk.\n* 20 December: Final withdraw of all troops from Anzac Cove.\n;1916\n* New Zealand troops transfer from Western Front.\n* Conscription introduced.\n* Labour Party formed.\n* Lake Coleridge electricity supply scheme opened.\n* 10 June: Passing of the Military Services Bill introduces conscription.\n* July: Battle of Romani defaults Turkish force advancing towards the Suez Canal.\n;1917\n* Battle of Passchendaele, 3,700 New Zealanders killed.\n* Six o'clock public house closing introduced.\n* Lord Liverpool becomes first governor-general.\n;1918\n* New Zealand Division in the Battle of the Somme.\n* End of World War I.\n* Influenza pandemic in which an estimated 8,500 die.\n* Creation of power boards for electricity distribution.\n* Prohibition petition with 242,001 signatures presented to Parliament.\n;1919\n* Women eligible for election to Parliament.\n* Massey signs Treaty of Versailles.\n* First official airmail flight from Auckland to Dargaville.\n* 17 December: 1919 New Zealand general election.\n1920s\n;1920\n* Anzac Day established.\n* New Zealand gets League of Nations mandate to govern Western Samoa.\n* First aeroplane flight across Cook Strait.\n* New Zealand sends first team to Olympic Games (previously they have competed as part of Australasian team).\n* Darcy Hadfield wins first Olympic medal for New Zealand.\n;1921\n* New Zealand Division of the Royal Navy established.\n;1922\n* New Zealand Meat Producers Board constituted under Act of Parliament and placed in control of meat exports.\n* 7 December: 1922 New Zealand general election.\n;1923\n* New Zealand Dairy Board constituted under Act of Parliament and placed in control of Dairy exports\n*Otira tunnel opens; Midland Line between Christchurch and Greymouth completed\n*Ross Dependency proclaimed.\n;1924\n* All Black 'Invincibles' tour of Britain and France.\n;1925\n* 4 November: General election won by the Reform party under Gordon Coates.\n;1926\n* National public broadcasting begins under auspices of Radio Broadcasting Co. Ltd.\n;1927\n;1928\n* New Zealand Summer Time introduced.\n* Charles Kingsford Smith completes first flight across Tasman Sea.\n* 14 December: General election won by new United Party.\n* Ted Morgan wins first Olympic gold medal for New Zealand.\n;1929\n* Economic depression worsens.\n* Severe earthquake in the Murchison – Karamea district results in 17 deaths.\n* First health stamps issued.\n1930s\n;1930\n* Unemployment Board set up to provide relief work.\n;1931\n* 3 February: A magnitude 7.8 earthquake in Hawke's Bay kills 256 people.\n* Substantial percentage reductions in public service wages and salaries, to help rebuild Hawke's Bay.\n* Airmail postage stamps introduced.\n* 2 December: General election won by newly formed Coalition Government under George Forbes.\n;1932\n* Compulsory arbitration of industrial disputes abolished.\n* Unemployed riots in Auckland, Dunedin and Christchurch.\n* Reductions in old-age and other pensions.\n* Distinctive New Zealand coins first issued, see New Zealand pound.\n;1933\n* 9 September: Elizabeth McCombs becomes first woman MP.\n;1934\n* Reserve Bank and Mortgage Corporation established.\n* First trans-Tasman airmail.\n;1935\n* Air services begin across Cook Strait.\n* 24 November: New Zealand Post Office jams 1ZB radio broadcast by Colin Scrimgeour (Uncle Scrim).\n* 27 November: General election: First Labour Government elected under Michael Joseph Savage.\n;1936\n* Reserve Bank taken over by state.\n* State housing programme launched.\n* Guaranteed prices for dairy products introduced.\n* National Party formed from former Coalition MPs.\n* Inter-island trunk air services introduced.\n* Jack Lovelock wins Olympic gold and sets world record for 1500m.\n* Jean Batten's record flight from England.\n* Working week reduced from 44 to 40 hours.\n;1937\n* April: Federation of Labour unifies trade union movement.\n* RNZAF set up as separate branch of armed forces.\n* March: Free Milk in schools introduced.\n;1938\n* Social Security Act establishes revised pensions structure and the basis of a national health service.\n* Import and exchange controls are introduced.\n* 15 October: General election, Labour re-elected.\n;1939\n* Second New Zealand Expeditionary Force formed.\n* Bulk purchases of farm products by Great Britain.\n* 3 September: War declared on Germany\n* 12 September: Enlistment in the 2nd New Zealand Expeditionary Force begins.\n* 4 October: Government announces the formation of a Māori Battalion for 2NZEF\n* 23 November: Bernard Freyberg is appointed commander of 2NZEF\n* 13 December:  takes part in The Battle of the River Plate.\n1940 to 1946\n;1940\n* 5 January: First Echelon of the 2NZEF leaves New Zealand for the Middle East.\n* 12 February: The main body of the First Echelon of the 2NZEF, arrives at Maadi Camp in Egypt.\n* 27 March: Prime Minister Michael Joseph Savage dies\n* 1 April: Peter Fraser becomes prime minister.\n* 1 April: Formation of No. 75 (NZ) Squadron of the RAF\n* 11 June: New Zealand declares war on Italy.\n* 19 June: RMS Niagara hits a mine off Bream Head, Northland\n* 2 August: Home Guard established.\n* 20 August: German raider Orion sinks the steamer Turakina off Cape Egmont.\n* October: Stanley Graham kills 7 in shooting spree near Hokitika\n* 25 November: Steamer Holmwood sunk by German raiders off the Chatham Islands.\n* 27 November: Rangitane sunk by German raiders 480&nbsp;km from East Cape\n* 8 December: New Zealand steamer Komata sunk by German raiders off Nauru\n* Sidney Holland becomes Leader of Opposition.\n* Conscription for military service.\n* German mines laid across Hauraki Gulf.\n;1941\n* 20 May – 1 June: New Zealand forces suffer heavy losses in the Battle of Crete.\n* 8 December: New Zealand declares war on Japan following the attack on Pearl Harbor.\n* Māori War Effort Organisation set up.\n* Pharmaceutical and general practitioner medical benefits introduced.\n;1942\n* Economic stabilisation.\n* Fears of a Japanese Invasion prompts precautions such as air raid drills. Membership of the Home Guard became compulsory for men aged between 35 and 50. The threat is eased after the Battle of the Coral Sea.\n* New Zealand troops in First and Second Battles of El Alamein.\n* Food rationing introduced.\n* Mobilisation of women for essential work.\n* 12 June: First 5 ships of American troops from the 37th US Army Division land in Auckland.\n* 14 June: First American Marines from the 1st Corps Division land in Wellington.\n;1943\n* New Zealand troops take part in invasion of Italy.\n* February: Mutiny by Japanese prisoners of war at Featherston prisoner of war camp results in 48 Japanese dead, 61 wounded, plus one dead and 11 injured guards.\n* 3 April: Battle of Manners Street between American and New Zealand servicemen\n* 20 June: Several Marines drown during landing exercises at Paekākāriki\n* 28 August: Eleanor Roosevelt arrives in New Zealand for visit.\n* 3 September: Eleanor Roosevelt flies out from Auckland.\n* 25 September: General election, Labour re-elected.\n*October: Butter rationing begins.\n;1944\n* Australia-New Zealand Agreement provides for co-operation in the South Pacific.\n* NZ Troops suffer heavy losses during The Italian Campaign\n*March: Meat rationing begins,\n;1945\n* New Zealand signs United Nations charter.\n* Māori Social and Economic Advancement Act passed.\n* National Airways Corporation founded.\n*15 December: Main North Line railway completed between Christchurch and Picton.\n;1946\n* Family benefit of £1 per week becomes universal.\n* Bank of New Zealand nationalised.\n* 24 November: 1946 New Zealand general election.\n* 20 August: Railway disaster in Manawatu Gorge\nFull independence (1947 to date)\n1947 to 1949\n;1947\n* Statute of Westminster adopted with the Statute of Westminster Adoption Act 1947, passed by the New Zealand Parliament.\n* New Zealand Constitution Amendment (Request and Consent) Act 1947 passed, granting Parliament of New Zealand the ability to amend the New Zealand Constitution Act 1852.\n* First public performance by National Orchestra.\n* Mabel Howard becomes first woman cabinet minister.\n* Fire in Ballantyne's department store, Christchurch, 41 people die.\n;1948\n* British Nationality and New Zealand Citizenship Act 1948 passed.\n* Protest campaign against exclusion of Māori players from rugby tour of South Africa.\n* Polio epidemic closes schools.\n* Mount Ruapehu and Mount Ngauruhoe erupt.\n* September: Meat rationing ends.\n;1949\n* 1 January: New Zealanders become \"British Subjects and New Zealand Citizens\"\n* Referendum agrees to compulsory military training.\n* New Zealand gets first four navy frigates.\n* 30 November: General election: National Government elected.\n1950s\n;1950\n* Naval and ground forces sent to Korean War.\n* New Zealand Legislative Council abolished.\n* Wool boom.\n*June: Butter rationing ends.\n;1951\n* Prolonged waterfront dispute, state of emergency proclaimed.\n* ANZUS treaty signed between United States, Australia and New Zealand.\n* Māori Women's Welfare League established.\n* 27 December: 1951 New Zealand general election\n;1952\n* Population reaches over two million.\n* 9 September: Rimutaka Tunnel collapses\n* 23 July: Yvette Williams wins gold medal in Olympics\n*10 July: Broken Barrier film released\n;1953\n* First tour by a reigning monarch.\n* Edmund Hillary and Sherpa Tenzing Norgay first to climb Mount Everest.\n* Railway disaster at Tangiwai, 151 people die.\n;1954\n* New Zealand signs South East Asia Collective Defence Treaty.\n* Gains seat on United Nations Security Council.\n* 20 September: in midst of moral panic, the Mazengarb Report is presented.\n* 13 November: 1954 New Zealand general election.\n* Social Credit gets 10 percent of vote in general election, but no seats in Parliament.\n;1955\n* Pulp and paper mill opens at Kawerau.\n* 3 November: Rimutaka rail tunnel opened.\n;1956\n* New Zealand troops sent to Malaya.\n* Roxburgh and Whakamaru power stations in operation.\n;1957\n* 17 February: Last hanging, of Walter James Bolton.\n* Scott Base established in Ross Dependency.\n* Court of Appeal constituted.\n* Dairy products gain 10 years of unrestricted access to Britain.\n* 30 November: General election, National loses election, Walter Nash leads Second Labour Government.\n;1958\n* PAYE tax introduced.\n* Arnold Nordmeyer's \"Black Budget\".\n* First geothermal electricity generated at Wairakei.\n* First heart-lung machine used at Green Lane Hospital, Auckland.\n* The first Temple of the Church of Jesus Christ of Latter-day Saints built in the Southern Hemisphere is opened at Hamilton\n;1959\n* Antarctic Treaty signed with other countries involved in scientific exploration in Antarctica.\n* Auckland Harbour Bridge opened.\n1960s\n;1960\n* Regular television programmes begin in Auckland.\n* Government Service Equal Pay Act passed.\n* 26 November: General election, National Government elected.\n* Treasury leases New Zealand's first computer from IBM.\n;1961\n* New Zealand joins the International Monetary Fund.\n* Capital punishment abolished for ordinary crimes such as murder but remains for treason, espionage and \"crimes committed during war\".[http://www.teara.govt.nz/1966/C/CapitalPunishment/CapitalPunishment/en]\n;1962\n* New Zealand troops sent to Malaysia during confrontation with Indonesia.\n* Western Samoa becomes independent.\n* Sir Guy Powles becomes first Ombudsman.\n* New Zealand Māori Council established.\n* 11 August: Cook Strait rail ferry service begins.\n* Taranaki gas well opens.\n;1963\n* 3 July: New Zealand National Airways Corporation Flight 441 crashes in the Kaimai Ranges; 23 killed.\n*30 November: 1963 New Zealand general election.\n;1964\n* Marsden Point oil refinery opens at Whangārei.\n* Auckland's population reaches half a million.\n*Lyttelton Road Tunnel opens; at nearly 2,000&nbsp;m long, it was the country's longest road tunnel until 2017.\n;1965\n* NAFTA agreement negotiated with Australia.\n*Benmore Dam commissioned.\n*Inter-Island HVDC commissioned, connecting the North and South Island power grids.\n* Support for United States in Vietnam; New Zealand combat force sent, protest movement begins.\n* Cook Islands becomes self-governing.\n*1 April: TEAL renamed Air New Zealand.\n*Air New Zealand introduces the Douglas DC-8 jet aircraft on international routes.\n;1966\n* International airport officially opens at Auckland.\n* New Zealand labour force reaches one million.\n* National Library of New Zealand created.\n* Te Atairangikaahu becomes first Māori Queen.\n* 26 November: 1966 New Zealand general election, National wins a third term.\n;1967\n* Referendum extends hotel closing hours to 10pm.\n* 10 July: Decimal currency introduced; New Zealand dollar replaces the pound at a rate of £1 to $2 (one shilling to 10 cents; one penny to  cent)\n* Lord Arthur Porritt becomes first New Zealand-born Governor-General.\n*Denny Hulme becomes New Zealand's first (and currently only) Formula 1 World Champion.\n;1968\n* 10 April: Inter-island ferry  sinks in severe storm in Wellington Harbour; 51 people killed.\n* 24 May: Three die in Inangahua earthquake.\n*National Airways Corporation introduces Boeing 737 jet services on domestic routes.\n;1969\n* Voting age lowered from 21 to 20.\n* First output from Glenbrook Steel Mill.\n*Television networked nationwide.\n*Breath and blood tests introduced for suspected drunk drivers.\n* 29 November: General election, National wins fourth election in a row.\n1970s\n;1970\n* US Vice President Spiro Agnew Visits New Zealand to prop up the NZ Governments support for the Vietnam War and is met by an anti-war protest in Auckland which turns violent.\n*Natural gas network commissioned, supplying gas from Kapuni to Auckland, Hamilton, New Plymouth, Whanganui, Palmerston North and Wellington.\n;1971\n* New Zealand secures continued access of butter and cheese to the United Kingdom.\n* Ngā Tamatoa protest at Waitangi celebrations.\n* Tiwai Point aluminium smelter begins operating.\n*Manapouri Power Station completed.\n* Warkworth satellite station begins operation.\n;1972\n*Values Party is formed.\n* Equal Pay Act passed.\n* 25 November: General election. Labour Government elected; Norman Kirk becomes 29th Prime Minister.\n* December: New Zealand ends its role in the Vietnam War when Troops are withdrawn under the new Labour Government and Compulsory Military Training is Abolished.\n;1973\n* Naval frigate dispatched in protest against French nuclear testing in the Pacific.\n* New Zealand's population reaches three million.\n* Oil price hike means worst terms of trade in 30 years.\n* Colour TV introduced.\n;1974\n* 1 April: Accident Compensation Corporation (ACC) established.\n*31 August: Prime Minister Norman Kirk dies; Bill Rowling succeeds Kirk as 30th Prime Minister.\n* Commonwealth Games held in Christchurch.\n;1975\n* 4 January: Lynne Cox became the first woman to swim across Cook Strait.\n* 14 September: Māori land march protesting at land loss leaves Te Hāpua\n* 13 October: Māori land march reaches Parliament building in Wellington, Whina Cooper presents a Memorial of Rights to the Prime Minister Bill Rowling and Māori Affairs Minister Matiu Rata.\n* The Waitangi Tribunal is established.\n*Second TV channel starts broadcasting.\n* 29 November: 1975 New Zealand general election. Robert Muldoon becomes 31st Prime Minister after National Party victory.\n* 1975 in New Zealand television\n;1976\n* New Zealand's national day 6 February renamed from New Zealand Day to Waitangi Day\n* Matrimonial Property Act passed.\n* Pacific Islands \"overstayers\" deported.\n* EEC import quotas for New Zealand butter set until 1980.\n* Introduction of metric system of weights and measures.\n* Subscriber toll dialling introduced.\n*Lyttelton–Wellington steamer ferry service ends.\n;1977\n* National Superannuation scheme begins.\n* New Zealand signs the Gleneagles Agreement.\n* The 200 nautical mile (370&nbsp;km) exclusive economic zone (EEZ) is established.\n* 5 January: Bastion Point occupied by protesters.\n*21 November: God Defend New Zealand officially adopted as a national anthem (alongside God Save the Queen)\n;1978\n* Registered unemployed reaches 25,000.\n*New Zealand Film Commission established.\n* 12 February: 17 arrested after protestors led by Eva Rickard set up camp on the Raglan golf course.\n*1 April: National Airways Corporation merges with Air New Zealand.\n* 25 May: Army and Police remove protesters from Bastion Point, 218 arrests are made.\n* 25 November: General election, National re-elected.\n;1979\n* Air New Zealand Flight 901 crashes on Mount Erebus, Antarctica, 257 people die.\n* Carless days introduced to reduce petrol consumption.\n* 7 November: MP Matiu Rata resigns from the Labour Party to join Mana Motuhake Party.\n* Nambassa 3-day music and alternatives festival held in Waihi. Largest event of its kind in New Zealand.\n1980s\n;1980\n* Social Credit wins East Coast Bays by-election.\n* Saturday trading partially legalised.\n* Eighty-day strike at Kinleith Mill.\n;1981\n* South African rugby team's tour brings widespread disruption.\n* 28 November: 1981 New Zealand general election, National re-elected for third term.\n;1982\n* CER agreement signed with Australia.\n* First kōhanga reo established.\n*First FM radio broadcast.\n* Year-long wage, price and rent freeze imposed lasts until 1984.\n* First New Zealand Football team to compete at FIFA World Cup Finals\n;1983\n* Visit by nuclear-powered United States Navy frigate \"Texas\" sparks protests.\n* Official Information Act replaces Official Secrecy Act.\n* New Zealand Party founded.\n;1984\n* Te Hikoi ki Waitangi march and disruption of Waitangi Day celebrations.\n* Auckland's population exceeds that of the South Island.\n* 14 July: 1984 New Zealand general election won by Labour under David Lange.\n* Constitutional crisis follows general election; outgoing Prime Minister Robert Muldoon refuses to implement advice of Prime Minister elect David Lange.\n* Government devalues New Zealand dollar by 20 percent.\n* 26 July: David Lange becomes New Zealand's 32nd Prime Minister; Fourth Labour government formed.\n* Finance Minister Roger Douglas begins deregulating the economy.\n* New Zealand ratifies the United Nations Convention on the Elimination of All Forms of Discrimination Against Women.\n;1985\n* Anti-nuclear policy leads to refusal of a visit by the American warship, the USS Buchanan.\n* 10 July: Greenpeace vessel Rainbow Warrior bombed and sunk by French DGSE agents in Auckland harbour.\n* 4 March: New Zealand dollar floated.\n* First case of locally contracted AIDS is reported.\n* Waitangi Tribunal given power to hear grievances arising since 1840.\n* 20 November: Archbishop Paul Reeves appointed governor general.\n;1986\n* Homosexual Law Reform Act 1986 passed.\n* Royal Commission reports in favour of an MMP (Mixed Member Proportional) electoral system.\n* Jim Bolger becomes National Party leader.\n* Soviet cruise ship, the Mikhail Lermontov, sinks in Marlborough Sounds.\n* Goods and Services Tax introduced.\n* First visit to New Zealand by the Pope.\n* The Constitution Act ends the right of the British Parliament to pass laws for New Zealand.\n* Royal Commission into Broadcasting and Related Communications reports\n;1987\n* Share prices plummet by 59 percent in four months.\n* Māori Language Act making Māori an official language passed.\n* Anti-nuclear legislation enacted.\n* First Lotto draw.\n* New Zealand's first heart transplant is performed.\n* New Zealand wins Rugby World Cup.\n* earthquake in the Bay of Plenty Region.\n* 15 August: General election, Labour re-elected.\n;1988\n* Number of unemployed exceeds 100,000.\n* Bastion Point land returned to Māori ownership.\n* Combined Council of Trade Unions formed. Royal Commission on Social Policy issues April Report.\n* Gibbs Report on hospital services and Picot Report on education published.\n* State Sector Act passed.\n* Cyclone Bola strikes northern North Island.\n* Electrification of the central section of the North Island Main Trunk railway completed.\n* New Zealand Post closes 432 post offices.\n* Fisheries quota package announced for Māori iwi.\n;1989\n* Prime Minister David Lange suggests formal withdrawal from ANZUS.\n* Jim Anderton founds NewLabour Party.\n* Lange resigns and Geoffrey Palmer becomes 33rd Prime Minister.\n* First annual balance of payments surplus since 1973.\n* Reserve Bank Act sets bank's role as one of maintaining price stability.\n* First school board elections under Tomorrow's Schools reforms.\n* First elections under revised local government structure.\n* Sunday trading begins.\n* The final Remnants of capital punishment are abolished\n*26 November: Third TV channel begins.\n* Māori Fisheries Act passed.\n1990s\n;1990\n* New Zealand celebrates its sesquicentennial.\n* Māori leaders inaugurate National Congress of Tribes.\n* Dame Catherine Tizard becomes first woman Governor-General.\n* Geoffrey Palmer resigns as prime minister; Mike Moore succeeds him as the 34th Prime Minister.\n* 30 April: One- and two-cent coins are phased out.\n* Commonwealth Games held in Auckland.\n* Telecom sold for $4.25 billion.\n* Pay Television Network Sky TV began broadcasting.\n* Big earthquake in Hawke's Bay.\n* 27 October: 1990 New Zealand general election: National Party has landslide victory. Jim Bolger becomes 35th Prime Minister.\n* 13–14 November: David Gray kills thirteen at Aramoana, before police shoot him dead.\n;1991\n* The Resource Management Act 1991 is enacted, rewriting planning law.\n*One- and two-dollar coins introduced to replace their respective banknotes.\n* The \"Mother of All Budgets\" is presented by Finance Minister Ruth Richardson.\n* The Alliance party is formed.\n* Employment Contracts Act passed.\n* Consumers Price Index has lowest quarterly increase for 25 years.\n* Welfare payments cut.\n* Number of unemployed exceeds 200,000 for the first time.\n* New Zealand troops join multi-national force in the Gulf War.\n* An avalanche on Aoraki / Mount Cook reduces its height by 10.5 metres.\n;1992\n* Government and Māori interests negotiate Sealord fisheries deal.\n* Public health system reforms.\n* State housing commercialised.\n* New Zealand gets seat on United Nations Security Council.\n* Student Loan system is started / Tertiary Fees raised\n;1993\n* Centennial of women's suffrage celebrated.\n* New Zealand First launched by Winston Peters.\n* 6 November: General election won by National, without obtaining a majority.\n* Referendum favours MMP electoral system.\n* Opposition MP Peter Tapsell becomes Speaker of the House, thus giving the government a majority.\n;1994\n* Government commits 250 soldiers to front-line duty in Bosnia.\n* Government proposes $1 billion cap in plan for final settlement of Treaty of Waitangi claims.\n* New Zealand's first casino opens in Christchurch.\n*David Bain is convicted of murdering five members of his family.\n* First fast-ferry service begins operation across Cook Strait.\n;1995\n* Team New Zealand wins America's Cup.\n* Occupation of Moutoa Gardens, Wanganui.\n* Waikato Raupatu Claims Settlement Act passed.\n* New political parties form: the Conservatives, Christian Heritage and United New Zealand.\n* Renewal of French nuclear tests results in New Zealand protest flotilla and navy ship \"Tui\" sailing for Moruroa Atoll.\n* Commonwealth Heads of Government Meeting in Auckland, Nelson Mandela visits.\n* New Zealand contingent returns from Bosnia.\n;1996\n* Imported pests Mediterranean fruit flies and white-spotted tussock moths cause disruption to export trade and to Aucklanders.\n* Kahurangi National Park, the 13th National Park, is opened in north-west Nelson.\n* Waitangi Tribunal recommends generous settlement of Taranaki land claims.\n* First legal sports betting at TAB.\n* The commercial radio stations and networks owned by Radio New Zealand are sold to Clear Channel creating The Radio Network.\n* $170 million Ngāi Tahu settlement proposed, $40 million Whakatohea settlement announced.\n* 12 October: First MMP election brings National/New Zealand First coalition government.\n;1997\n* America's Cup damaged in an attack by a Māori activist.\n* TV4 begins daily broadcasts.\n* Customs Service cracks down on imported Japanese used cars following claims of odometer fraud.\n* Auckland's Sky Tower is opened.\n* Compulsory superannuation is rejected by a margin of more than nine to one in New Zealand's first postal referendum.\n* Jim Bolger resigns as prime minister after losing the support of the National Party caucus and is replaced by New Zealand's first woman prime minister, Jenny Shipley.\n;1998\n* Auckland city businesses hit by a power cut lasting several weeks. The crisis of over a month results in an inquiry into Mercury Energy.\n* The women's rugby team, the Black Ferns, become the world champions.\n* The National – New Zealand First coalition Government is dissolved leaving the Jenny Shipley led National Party as a minority government.\n* Several cases of tuberculosis discovered in South Auckland in the worst outbreak for a decade.\n* The Hikoi of Hope marches to Parliament, calling for more support for the poor.\n* The government announces plans to lease 28 new fighter aircraft but says no to a new naval frigate.\n* Prime TV launched\n;1999\n* APEC is held in Auckland\n* Alcohol purchase age for off-licenses reduced from 20 to 18 years of age\n* 27 November: 1999 New Zealand general election. Helen Clark's Fifth Labour Government is sworn in.\n2000s\n;2000\n* January: The name suppression of American billionaire Peter Lewis, who was arrested and convicted of drug possession charges, causes controversy.\n* Knighthoods are Abolished\n;2001\n* Interest accrual is removed from student loans while studying. Students who accrued interest prior to 2001 are still required to pay.\n* Air New Zealand bailout, government purchases a 76.5% share in the company\n* New Zealand contributes Troops to Operation Enduring Freedom against the Taliban and Al Qaeda in Afghanistan\n;2002\n* Kiwibank is formed\n* 30 June: The population of Canterbury reaches half a million.\n* 27 July: 2002 general election, Labour-led government returned for a second term.\n;2003\n* Population of New Zealand exceeds 4 million.\n* Prostitution Reform Act 2003 passed in parliament\n* Appeals to the Judicial Committee of the Privy Council abolished; Supreme Court of New Zealand established, and begins work in early 2004.\n;2004\n* Foreshore and Seabed Act passed.\n* Civil Union Act passed\n* Māori Party formed.\n*Māori Television begins broadcasting\n;2005\n* 17 September: 2005 general election, Labour-led government returned for a third term.\n;2006\n* Labour enacts its election promise to remove interest on loans to students living in New Zealand.\n* Five cent coins are dropped from circulation and existing 10-cent, 20-cent and 50-cent coins are replaced with smaller coins.\n* The government announces a NZ$11.5 billion surplus, the largest in the country's history and second only to Denmark in the Western World.\n* South Island population reaches 1 million\n;2007\n* David Bain's final Privy Council appeal results in the quashing of his convictions for the murder of his family. A re-trial is ordered by the Solicitor-General of New Zealand.\n* 2 May: Freeview is launched, providing free-to-air digital television.\n* 1 July: KiwiSaver retirement savings scheme introduced.\n* 2 July Willie Apiata receives the first Victoria Cross for New Zealand, the first New Zealander awarded a VC since World War II.\n* 18 December:Electoral Finance Act enacted.\n;2008\n* 11 January: mountaineer Sir Edmund Hillary dies.\n* 8 November: General election: The National Party gains the largest share ending 9 years of Labour-led government.\n* 27 November: (28 November NZ Time.) XL Airways Germany A320 Flight 888T, an aeroplane owned by Air New Zealand crashes in the Mediterranean Sea off the south coast of France, killing all seven on board, 5 of whom are New Zealanders.\n* Helen Clark is named Administrator of the United Nations Development Programme (UNDP), ranking third in the UN office\n* National reintroduces titular honours 8 years after Labour removed them from the New Zealand Honours System in 2000.\n;2009\n* Knighthoods, Abolished by the previous government, are restored.\n* 6 March: David Bain retrial begins, resulting in not guilty verdicts on all five murder charges on 5 June.\n* 28 April: First confirmed New Zealand case in the 2009 swine flu pandemic.\n2010s\n;2010\n* 4 September: A magnitude 7.1 earthquake strikes the Canterbury Region causing widespread damage to Christchurch and surrounding areas.\n* 19 November: Pike River mine explosion traps and kills 29 miners.\n;2011\n* 22 February: A magnitude 6.3 earthquake strikes Christchurch causing widespread damage and 184 deaths.\n* 8 March: 2011 New Zealand census scheduled for this date is cancelled due to the Christchurch earthquake.\n* 23 October: All Blacks win Rugby World Cup against France, 8–7 in Eden Park, New Zealand.\n* 26 November: 2011 general election: Fifth National Government re-elected to second term with reduced majority.\n;2012\n* 5 November: Royal Commission into the Pike River mine disaster reports.\n;2013\n* 19 August: Same-sex marriage is legalised.\n* 12 October: 2013 local government elections held.\n*1 December: Analogue television is switched off.\n;2014\n* 20 January: Eketāhuna earthquake causes moderate damage in the lower North Island.\n* 20 September: 2014 general election is held. The National Party wins a third term in office.\n* October: New Zealand wins a seat on the United Nations Security Council, starting from 2015. New Zealand last held a seat in 1993–1994.\n;2015\n* February: New Zealand joins the fight against ISIS by sending troops to Iraq to train Iraqi Soldiers against the Islamic Terror Group.\n* 25 October: The All Blacks Win the Rugby World Cup, the only team to ever win the tournament twice in a row.\n;2016\n* 14 November: A magnitude 7.8 earthquake strikes near the town of Kaikōura in the South Island.\n* 5 December: John Key announces he will stand down as prime minister and leader of the National Party on 12 December.\n* 12 December: Bill English becomes the 39th Prime Minister of New Zealand.\n;2017\n* 26 June: Emirates Team New Zealand wins the 35th America's Cup.\n* 2 July: Waterview Tunnels open; at 2.4&nbsp;km long each, they overtake the Lyttelton Road Tunnel to become the country's longest road tunnels.\n*23 September: 2017 general election is held. The National Party wins a plurality, while the Labour Party significantly increases its number of seats.\n* 26 October: Labour and New Zealand First form a coalition government. Labour leader Jacinda Ardern becomes the 40th Prime Minister of New Zealand.\n;2019\n* 15 March: Christchurch mosque shootings, 51 people are killed during an attack on two mosques.\n* &nbsp;December 2019: Whakaari / White Island eruption. 47 people were on the island at the time. Twenty-two people died, either in the explosion or from injuries sustained, including two whose bodies were never found and were later declared dead. A further 25 people suffered injuries, with the majority needing intensive care for severe burns.\n2020s\n;2020\n* 28 February: COVID-19 reaches New Zealand.\n* 18 March: The New Zealand Parliament passes legislation decriminalising abortion.\n*25 March: A State of National Emergency is declared in response to the COVID-19 pandemic in New Zealand. Lockdown restrictions are imposed on the country.\n* 8 June:  The New Zealand Government eases most COVID-19 lockdown restrictions in response to a successful elimination efforts.\n* 12 August: COVID-19 lockdown restrictions are reinstated in New Zealand following a community outbreak in Auckland.\n* 17 October: Originally scheduled for 19 September and delayed due to a second COVID-19 outbreak, the 2020 general election is held.\n* 6 November: Official election results give Labour 65 seats, enough for a majority government, the first time a single party wins enough seats to govern alone since the mixed-member proportional representation (MMP) system was introduced in 1996.\n*29 December - 3 January 2021: Rioting at Waikeria Prison causes major fire damage to the facility.\n;2021\n* 17 March: Emirates Team New Zealand successfully defends the 36th America's Cup held in Auckland, New Zealand against Luna Rossa.\n* 16 July: A state of emergency is declared in the Buller District due to flooding. An emergency is declared in Marlborough the following day.\n* 17 August: The New Zealand government reinstates nationwide lockdown restrictions in response to a community outbreak of the Delta Variant of COVID-19 in Auckland.\n* 21 October: Dame Cindy Kiro is sworn in as the 22nd Governor-General of New Zealand.\n* 2 December: The New Zealand Government phases out the COVID-19 alert level system in favour of the traffic light system.\n;2022\n* 6 February—2 March: Protesters occupy the grounds of the New Zealand Parliament to protest against the Government's COVID-19 lockdown and vaccine mandate policies. Police forcibly evict the protesters following a three-week occupation.\n* 15 February: Parliament passes legislation banning conversion therapy.\n*16 March: Parliament passes legislation creating safe access zones around abortion providers.\n*  7 April: Parliament passes legislation establishing Matariki as a public holiday in New Zealand.\n* 8 September: Elizabeth II, the longest-reigning monarch in New Zealand's history, dies aged 96, after a reign of 70 years. Her son Charles III succeeds her as King of New Zealand.\n* 12 September: COVID-19 Protection Framework ends at 11:59 pm, eliminating most pandemic-related restrictions including face masks.\n* 8 October: The 2022 local elections are held.\n* 25 October: Women make up 50% of MPs in the New Zealand Parliament for the first time.\n* 12 November: The Black Ferns win the Women's Rugby World Cup for the sixth time.\n;2023\n* 19 January: Jacinda Ardern announces her resignation as Prime Minister of New Zealand, taking effect no later than 7 February.\n* 25 January: Chris Hipkins gets sworn in as the 41st Prime Minister of New Zealand.\n* 27 January: Torrential rain in Auckland causes widespread flooding, slips, evacuations, and the deaths of four people (from Cyclone Hale).\n* 12 - 14 February: Cyclone Gabrielle makes landfall in the North Island, causing extensive flooding and damage in the Gisborne District. A national state of emergency is declared.\n* 15 August: The last remaining COVID-19 public health requirements (namely the seven-day mandatory isolation period for positive cases, and the wearing of face masks in healthcare settings) are removed at 12:01am.\n* 14 October: The 2023 New Zealand general election takes place, leading to the National Party's leader Christopher Luxon becoming Prime Minister-designate.\n* 24 November: A National-led coalition government is formed with support from the libertarian ACT New Zealand and populist New Zealand First parties.\n;2024\n* 1 March: The Auckland District Court imposes a total of NZ$10.21 million in reparations and NZ$2 million in fines on five companies and GNS Science over their involvement in the 2019 Whakaari / White Island eruption.\n* 5 July: Three's evening news bulletin Newshub airs for the last time, ending 34 years of broadcasting. It is succeeded the following night by the news bulletin ThreeNews.\n* 24 July; The Royal Commission of Inquiry into Abuse in Care concludes that since 1950, about 200,000 people in state and religious care experienced abuses such as rape, sterilisation, and electric shocks.\n* 29 August: Tūheitia, the Māori King, dies at the age of 69; ending his 24-year reign.\n* 5 September: Nga wai hono i te po is elected as Māori Queen, succeeded her late father King Tūheitia.\n* 6 October: HMNZS Manawanui catches fire and sinks off Samoa, after running aground on 5 October. The sinking marks the first loss of a Royal New Zealand Navy vessel in service since World War II.\n* 12 November: Prime Minister Christopher Luxon delivers the Government's apology to survivors of abuse in state and faith-based care.\n*28 November: The report into the first phase of the Royal Commission of Inquiry into COVID-19 Lessons Learned is released to the public.\n;2025\n*18 August: A New Zealand Defence Force soldier pleaded guilty before a court-martial to attempted espionage on behalf of a foreign country, marking the first espionage conviction in New Zealand. He was sentenced to two years' imprisonment on 20 August.\nSee also\n*List of years in New Zealand\n*Timeline of the New Zealand environment\nReferences\nExternal links\n*[http://timelines.ws/countries/NEWZEALAND.HTML New Zealand] at Timelines of History\n*[https://nzhistory.govt.nz/calendar Today in New Zealand History calendar] at New Zealand History Online"
    }
  ]
}