{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of project management\n\nThis article covers the historical timeline of project management. There is a general understanding that the history of modern project management started around 1950. Until 1900, projects were generally managed by creative architects and engineers themselves, among those, for example, Christopher Wren, Thomas Telford and Isambard Kingdom Brunel.\nEarly civilizations\n* 2570 BC Great Pyramid of Giza completed. Some records remain of how the work was managed: e.g. there were managers of each of the four faces of the pyramid, responsible for their completion (subproject managers).\n* 208 BC The first major construction of the Great Wall of China.\n17th - 19th century\n* Christopher Wren (1632–1723) was a 17th-century English designer, astronomer, geometer, mathematician-physicist and architect. Wren designed 55 of 87 London churches after the Great fire of London in 1666, such as St Paul's Cathedral in 1710, as well as many secular buildings.\n* Thomas Telford (1757-1834) was a Scottish stonemason, architect and civil engineer and a road, bridge and canal builder, who managed the Ellesmere Canal and Pontcysyllte Aqueduct.\n* Isambard Kingdom Brunel (1806–1859) was a British engineer who created the Great Western Railway, a series of steamships, such as the first with a propeller, and numerous bridges and tunnels.\n20th century\n* 1910s The Gantt chart developed by Henry Laurence Gantt (1861&ndash;1919)\n;1950s\n* 1950s The Critical path method (CPM) invented\n* 1950s The US DoD used modern project management techniques in their Polaris project.\n* 1956 The American Association of Cost Engineers (now AACE International) formed\n* 1958 The Program Evaluation and Review Technique (PERT) method invented\n;1960s\n* 1969 Project Management Institute (PMI) launched to promote project management profession\n;1970s\n* 1975 PROMPT methodology (acronym for Project Resource Organisation Management Planning Technique) created by Simpact Systems Ltd (source: PRINCE2 manual)\n* 1975 The Mythical Man-Month: Essays on Software Engineering by Fred Brooks published\n;1980s\n* 1984 The Goal by Eliyahu M. Goldratt published\n* 1986 Scrum was named as a project management style in the article The New New Product Development Game by Takeuchi and Nonaka\n* 1987 First Project Management Body of Knowledge Guide published as a white paper by PMI\n* 1989 PRINCE method derived from PROMPTII is published by the UK Government agency CCTA and becomes the UK standard for all government information projects\n;1990s\n* 1996 PRINCE2 published by CCTA (now Office of Government Commerce OGC) as a generic product management methodology for all UK government projects.\n* 1997 Critical Chain by Eliyahu M. Goldratt published\n21st century\n* 2001 AgileAlliance formed to promote \"lightweight\" software development projects\n* 2006 Total Cost Management Framework release by AACE\n* 2009 PRINCE2 2009 edition, compatible with other methods and more flexible in approach\nSee also\n* List of project management topics\nReferences\nExternal links\n* [http://projectmanagementblogs.wordpress.com/2013/11/15/project-management-history-to-present-days-tools/ \"A Brief History of Project Management\" Infographics]"
    }
  ]
}