{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Port Louis\n\nThe following is a timeline of the history of the city of Port Louis on the island of Mauritius.\nPrior to 20th century\n* 1606 - Dutch settlers start to use this area as a harbour which they call Harbour of Tortoises, after their initial 1598 settlement at Port de Warwick in Ferney, Vieux Grand Port.\n* 1721 - French in power on Isle de France; Noord-Wester Haven (harbor) renamed \"Port Louis.\"\n* 1729 - Hôtel du Gouvernement built.\n* 1735 - Development of Port Louis begins (approximate date).\n* 1749 - Le Réduit (fort) built near Port Louis at Moka.\n* 1772 - Bagne Prison built.\n* 1774 - Line Barracks or Casernes Centrales is inaugurated after start of construction in 1740.\n* 1782 -  construction begins.(de)\n* 1790 - Thomas Enouf becomes mayor of Town of Port Louis.\n* 1791 - Foundation of Collège National or Collège Colonial in Port Louis. This would later become Lycée Colonial and eventually the island's first Royal College.\n* 1794 - Town renamed \"Port de La Montagne.\"\n* 1795 - Town renamed \"Port Nord-Ouest.\"\n* 1803 - Captain Matthew Flinders is arrested during a port call to repair his ship Cumberland as Governor De Caen believes he is a British spy.\n* 1805 - Mosque constructed.\n* 1810\n** Invasion by British navy and army forces from Bombay, Madras and the Cape of Good Hope which land between Cap Malheureux and Bain des Boeufs in late November and early December.\n** For 6 months after the British invasion the \"Lycée Colonial\" is used as a military hospital.\n** Town renamed \"Port Louis\" again.\n** Population: 24,000.\n* 1812 - Champ de Mars Racecourse opens.\n* 1816 - Fire.\n* 1822 - Political prisoner Ratsitatane (from Madagascar) is sentenced to death and is beheaded at Jardin Plaine Verte\n* 1838 -  (Fort Adelaïde) built.\n* 1847 - Roman Catholic Diocese of Port-Louis established.\n* 1849 - Development of Coolie Ghat immigration depot begins.\n* 1850\n** February: Municipal election held.\n** March: Louis Léchelle becomes mayor.\n** November: 1850 Yamsé Ghoon Riots break out at Camp Des Malabars (Plaine Verte nowadays) when muslim pilgrims were forced to abandon their Ghoon structures or Ta'zieh as they were chased around the streets in broad daylight by the Creole assailants who were former slaves, also known as ex-apprentices.\n* 1852 - Mosquée des Arabes established.\n* 1864 - North line railway begins operating.\n* 1866 - Municipal government headquartered in the Hôtel d’Europe building.\n* 1867 - Malaria outbreak.\n* 1869 - Port Louis economy affected by opening of Suez Canal in Egypt.\n* 1870 - General Post Office built.\n* 1880 - Foundation of Mauritius Institute.\n* 1887 - ''Revue historique et littéraire de l'Ile Maurice begins publication.\n* 1892 - 29 April: 1892 Mauritius cyclone occurs.\n* 1897 - 22 June: Statue of British queen Victoria unveiled.\n* 1899 - Due to a plague epidemic the original Royal College Port Louis is permanently closed down as people flee Port Louis to settle in the cooler highlands of Curepipe.\n20th century\n* 1904 - 8–9 June: Flood.\n* 1906 - Pagoda Riots between three rival clans (Hakka, Cantonese, Fukienese) over control of Cohan Tai Biou'' Pagoda\n* 1907 - Population: 30,899.\n* 1910 - Government House rebuilt.\n* 1911 - Riots, which started in Curepipe, spread to Port Louis\n* 1919 - Population: 40,106 metro.\n* 1933 - Catholic St. Louis Cathedral rebuilt.\n* 1937 - Honorary Consulate of Poland opened.\n* 1942 - Airport established in Plaine Magnien, 48&nbsp;km from Port Louis.\n* 1943 - Mass gathering of Basdeo Bissoondoyal's Jan Andolan at Marie Reine de la Paix on 12 December, a precursor to the proclamation of the new [https://www.eisa.org.za/wep/mauoverview7.htm 1947 Constitution] to grant voting rights to the mass.\n* 1945\n** 3 tropical cyclones strike (on 16 January, 2 February and 6 April), causing deaths and destroying homes and infrastructure. International relief arrives in Port Louis.\n** End of World War II is celebrated at Champ de Mars, Town Hall, Luna Park, Majestic, Citadel, Signal Mountain, and streets of Port Louis.\n* 1951 - Fort Adelaide (La Citadelle) murders and hanging\n* 1952 - Population: 84,539.\n* 1953 - Mauritius Sugar Industry Research Institute founded in nearby Réduit.[http://www.msiri.mu/index.php?langue=eng&rub=221]\n* 1956 - Foundation stone for Royal College Port Louis is laid by Princess Margaret.Le Mauricien. [http://www.lemauricien.com/article/histoire-s%C3%A9jour-la-princesse-margaret-en-1956 \"HISTOIRE: Le séjour de la princesse Margaret en 1956\"], Le Mauricien, Mauritius, September 2011.\n* 1960\n** Tropical Cyclone Alix strikes in January, destroying homes and infrastructure.\n** Tropical Cyclone Carol strikes on 27 February, causing 42 deaths and destruction of infrastructure.\n* 1963 - ''L'Express newspaper begins publication.\n* 1964 - Population: 126,550 (estimate).\n* 1965\n** University of Mauritius established in nearby Réduit.\n** State of Emergency & British military from Yemen intervene due to 1965 Ethnic riots\n* 1966\n** City Hall built.\n**  founded.[http://www.musee-photo.voyaz.com/Web_pages/introduction.htm]\n** Riots erupted in October in front of Government House following protests against 10,000 job losses\n* 1967\n** City economy affected by temporary closure of Suez Canal during war in Egypt.\n** Ethnic riots during August 1967 elections\n** September & October 1967 Riots following the dismissal of 10,000 relief workers by the Government\n* 1968\n** Ethnic riots in January, State of Emergency and British military from Malaysia intervene prior to Independence ceremony\n** Mauritian independence in March.\n* 1969 - Six administrative wards created.\n* 1975\n** Suez Canal reopens in Egypt.\n** Tropical Cyclone Gervaise strikes in February, causing 10 deaths and destruction of infrastructure.\n** Student Riots break out on 20 May following a protest march, resulting in looted shops and burnt buses in Port Louis and other parts of the island.\n* 1978 - January: Arson attack on headquarters of Le Mauricien which gave rise to the Sheik Hossen Affair.\n* 1979 - August: Sugar industry labor strike.\n* 1984 - Population: 135,200 (estimate).\n* 1986 - Landslide (glissement de terrain) at La Butte'' results in damage to 1500 private homes, power lines and water pipes.\n* 1989 - Stock Exchange of Mauritius headquartered in city.\n* 1992\n** Mauritius Telecom headquartered in city.\n** City becomes part of independent Republic of Mauritius.\n* 1993\n** October: Meeting of the Organisation internationale de la Francophonie held in city.\n** Meeting of the Association Internationale des Maires Francophones held in city.\n* 1995\n** Mauritius Postal Museum opens\n** Sun Trust Building is inaugurated on Edith Cavell Street.\n* 1996\n** Caudan Waterfront in business.\n** October: 3 political activists are gunned down at night on Gorah Issac Road prior to municipal elections.\n* 1999\n** February: Riots break out at Roche Bois, a suburb of Port Louis, following the death in police custody of singer Kaya and ethnic riots spread across the island.\n** May: L'Amicale riots erupt in the centre of Port Louis following a soccer match, resulting in 7 deaths, looting and property damage.\n* 2000\n** AS Port-Louis 2000 (football club) formed.\n** Population: 144,303 metro.\n21st century\n* 2001 - City hosts the 2001 African Amateur Boxing Championships.\n* 2002 - Statue of Basdeo Bissoondoyal unveiled.\n* 2006 - Bank of Mauritius Tower built.\n* 2007 - Appleby Mauritius in business.[https://www.applebyglobal.com/publication-pdf/site-pdfs/appleby-timeline---april-2016-(2).pdf]\n* 2008 -  (museum) opens.\n* 2010 - Population: 128,483 city; 148,416 metro.\n* 2013 - March–April: Flood.\n* 2017 - Heritage building (circa 1791) \"La School\" (Edith Cavell Street) was demolished.\n* 2018 - Population: 147,448 (estimate).\n* 2019 - October: First train connecting Port Louis to Rose Hill was launched from Richelieu (Phase 1 of Metro Express Project)\n* 2020 - August 29: Around 75,000 citizens march with activist Bruneau Laurette in the centre of Port Louis to protest against the government's poor handling of the MV Wakashio oil spill\nSee also\n* Port Louis history\n* List of mayors of Port Louis\n*\n* List of governors of Isle de France (Mauritius) 1735-1810, seated at Le Réduit, Moka, near Port Louis\n* List of governors of British Mauritius, 1810-1968, seated at Moka near Port Louis\n* Timeline of Mauritius history (in French)\nReferences\n:This article incorporates information from the French Wikipedia and German Wikipedia.\nBibliography\n;in English\n*\n*  (Includes description of Port Louis)\n*\n}}\n*\n}}\n;in French\n*\nExternal links\n*\n*  (Bibliography)\n*  (Bibliography)\n*  (Images, etc.)\nImages\nFile:Port Louis, central station.jpg|Port Louis railway station (photo circa 1880s-1890s)\nFile:Port Louis Cyclone 1892 Poudriere Street St James Cathedral.jpg|Aftermath of cyclone, 1892\nFile:Port Louis, Central Railway Station, 1897, June 22th.jpg|Unveiling of queen Victoria statue, 1897\nFile:Government House Port Louis.JPG|Government House, built 1729, rebuilt in 1910 (photo 2015)"
    }
  ]
}