{
  "content": [
    {
      "type": "text",
      "text": "# Time, Forward!__disambig_1\n\n| runtime        = 158 minutes\n| country        = Soviet Union\n| language       = Russian\n| budget         =\n| gross          =\n}}\nTime, Forward! (, Vremya, vperyod!) is a 1965 Soviet part industrial drama film directed by Sofiya Milkina and Mikhail Schweitzer based on the 1932 novel and a screenplay by Valentin Kataev. The film was produced by Mosfilm, a unit of the State Committee for Cinematography (Goskino). The famous musical score was composed by Georgy Sviridov.\nThe title is derived from Vladimir Mayakovsky's play The Bathhouse ().\nThe film is set in the 1930s, depicting one day of the construction work of Magnitogorsk Iron and Steel Works (or Magnitka). The characters are construction workers and Komsomol members who are eager to work. Learning that their colleagues in Kharkov have set a record, they are mobilized in order to beat them. Everyone at the construction site has embraced socialist competition. They are ready to win at any cost to speed up construction and complete the work on time. A Moscow journalist comes to cover the scope of the great construction project, seeking a hero for his story.\nPlot\nThe film is set in May 1930, on a construction site in the Ural Mountains during the early 1930s, the heyday of Stalin's Five-Year Plans, and chronicles a day in the construction of the Magnitogorsk Metallurgical Plant. News arrives that concrete workers from Kharkiv have set a record for the number of concrete batches mixed in a single shift. Two teams, led by Ishchenko and Khanumov, are eager to break this record, but the site manager, Margulies, must balance their enthusiasm with the need for quality and proper planning. Meanwhile, a visiting writer, Ogniyev, seeks inspiration from the monumental project. Although initially cautious, Margulies approves Ishchenko’s attempt to surpass the record, setting the stage for a day of intense labor and personal challenges.\nAs the workers push themselves to their limits, personal struggles come to the forefront. Ishchenko’s wife goes into labor, forcing him to rush her to the hospital. Meanwhile, two disruptive members of his team are expelled for shirking their duties. Stormy weather and a sudden shortage of cement threaten the effort, prompting Korenev, a foreman, to procure supplies by any means necessary. Just as Ishchenko's team nears the Kharkiv record, news arrives that workers at the Kuznetsk construction site have raised the bar to an astonishing 402 batches. Undeterred, the team presses on. Even Khanumov, initially a competitor, helps automate part of the process. Despite bureaucratic interference, the team triumphantly reports a world-record 415 batches by the end of the shift. A commission arrives to test the concrete’s quality, leaving Margulies and the workers uncertain of their achievement's ultimate validation.\nAs night falls, Margulies, exhausted but still working, walks Shura Soldatova, the enthusiastic worker behind the motivational posters. Their relationship is revealed to be romantic, and Shura impulsively proposes marriage. Margulies, in his reserved manner, responds with a quiet but heartfelt acknowledgment of their mutual bond, ending the day on a note of personal and professional resolution.\nCast\n* Sergei Yursky as David Margulies\n* Inna Gulaya as Shura Soldatova\n* Tamara Syomina as Olya Trigubova\n* Leonid Kuravlyov as Korneyev\n* Vladimir Kashpur as Kanunnikov\n* Stanislav Khitrov as Sayenko\n* Yefim Kopelyan as Nalbandov\n*Bruno O'Ya as Thomas Bixby\n* Tatyana Lavrova as Klava\n* Aleksander Yanvaryov as Ishchenko\n* Mikhail Kokshenov as Kanunnikov\n* Yuri Volyntsev as Writer\n* Viktor Sergachyov as Semechkin\n* Larisa Kadochnikova as Katya\n* Igor Yasulovich as Vinkich\n* Vadim Zobin as Mosya\n* Viktor Markin as Reporter\n* Radner Muratov as Zagirov\n* Klara Rumyanova as Lushka\n* Boris Yurchenko as Filonov\nTheme\nSviridov's orchestral suite written for this film was one of the most recognizable music pieces of the Soviet era, and became a sort of calling card for the Soviet Union itself. Since 1968 it has been used as the theme song of Vremya, the TV news program on USSR Central Television and Russian Channel One (although the tune has been re-orchestrated a few times since then). It was also used as the opening theme for the four-part Channel 4 documentary Spitfire Ace in Great Britain.\nThe theme has been used in subsequent films, most notably Theodore Ushev's Tower Bawher and Guy Maddin's short film \"The Heart of the World\".\nTwo remixed versions of the theme has appeared in 2006 Russian videogame \"The Stalin Subway\" made by Buka Entertainment.\nOlympics association\nIt was performed at the close of the 2010 Olympic ceremony in Vancouver, conducted live by Valery Gergiev, to present the 2014 Winter Olympics, which were held in Sochi, Russia. At the 2014 opening ceremony in Sochi, the theme was used again during a scene depicting national industrialization and the collectivization of agriculture in the Soviet Union. The dancers wore red and black costumes while they interacted with huge figurative tractors, giant ditch-diggers, gears, and similar engine parts. The Russian rhythmic gymnastics team used the Overture in their gold medal winning all-around routine at the 2016 Summer Olympics.\nReferences\nExternal links\n*\n* [http://www.sovmusic.ru/english/download.php?fname=vrvpered Listen to the main theme]\n*  with English subtitles\n*  with English subtitles"
    }
  ]
}