{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of ATV\n\nThis is a timeline of the former British television broadcaster Associated Television (ATV). It provided the ITV service for London at weekends and the Midlands on weekdays from 1955 to 1968, and for the Midlands all week from 1968 to 1982.\n1950s\n* 1954\n** 26 October – The Independent Television Authority (ITA) awards franchises for the weekend service in London and the weekday service in the Midlands to the Associated Broadcasting Development Company (ABDC).\n* 1955\n**25 May – After ABDC has merged with the Incorporated Television Programme Company to form the Associated Broadcasting Company (ABC), the two franchise licences are issued to ABC.\n**24 September – Two days after the launch of ITV, the Associated Broadcasting Company launches its weekend service for the London area.\n** 8 October – After legal action from the Associated British Picture Corporation (ABPC), who already use the ABC brand for their cinemas and wish to use it for their television service, the Associated Broadcasting Company is renamed \"Associated TeleVision\" (ATV).\n* 1956\n**17 February – ATV launches its Midlands service, operating on weekdays with ABPC's ABC providing the weekend programmes. ATV's London service is renamed ATV London.\n**7 May – The first broadcast of ATV Midlands News takes place. It is a short daily summary of regional news with stories often sourced directly from the Birmingham Evening Dispatch, a local newspaper. Film footage is later added with footage shot by Birmingham Commercial Films.\n*1957\n** No events.\n* 1958\n** ATV Midlands News is supplemented by the launch of Midland Montage, a weekly topical magazine programme.\n** May – ATV purchases the Elstree Studios so that it can continue to shoot ITC productions on film.\n* 1959\n** ATV sets up its own news film unit for its regional news programmes.\n** ATV's logo is changed slightly.\n1960s\n* 1960\n** November — Because its existing television studios at other sites were deemed to be insufficient for its requirements, ATV converts its Elstree Studios from film studios into television studios, and this month sees the first of four studios at Elstree begin operations.\n* 1961\n** No events.\n* 1962\n** Police 5 is launched. Initially commissioned for six weeks to fill a gap left by an under-running American import, the series soon becomes permanent. The format is later picked up by other ITV regions, eventually ending in December 1992, ahead of Television South losing its franchise.\n* 1963\n** The Hackney Empire, which ATV had been using as studios since the mid-1950s, begins to be used for non-television purposes when the theatre starts being used by the Mecca Organisation as a bingo hall.\n* 1964\n**A slight change is made to the logo which adds the region's name below the ident.\n**Early in 1964, ATV's weekday lunchtime entertainment programme, Lunchbox, ends. It had been on air since shortly after ATV had begun broadcasting. Consequently, ATV no longer broadcasts programming at lunchtime.\n**September – ATV launches its own listings magazine TV World. Previously, listings for the week ahead had been published in a Midlands version of TVTimes.\n**5 October – Following pressure from the Independent Television Authority to improve regional coverage, ATV introduces a nightly news magazine programme, ATV Today. It runs for 20 minutes and follows the teatime 15 minute-long ATV Midlands News bulletin. Later ATV Today is later expanded to the full 30 minutes and the news bulletin is subsumed into the main programme.\n**2 November – The first edition of ATV's soap opera Crossroads is broadcast. The programme continues to be produced by Central after it takes over from ATV in 1982, eventually ending in 1988. It would be revived in 2001 and would end again in 2003.\n** ATV is given a three-year extension to its licence. This is later extended by a further year.\n* 1965\n** No events.\n* 1966\n** Following a restructure of the company, ATV and Incorporated Television Programme Company (ITC) both become subsidiaries of the Associated Communications Corporation (ACC).\n* 1967\n** No events.\n* 1968\n** 28 July – ATV stops broadcasting in London after its franchise is given to London Weekend Television. It can now broadcast seven days a week across the Midlands and is renamed ATV Limited.\n** 2 August – A technicians' strike forces ITV off the air for several weeks although management manage to launch a temporary ITV Emergency National Service with no regional variations.\n** 14 September – The final edition of ATV's listings magazine TV World is published due to TVTimes launching as a national publication the following week.\n* 1969\n** 15 November — To coincide with the launch of colour broadcasting, ATV's logo is altered and the famous ‘zoom’ ident launches in glorious technicolor.\n** ATV Midlands News is renamed ATV News.\n1970s\n* 1970\n** June – ATV begins colour broadcasting to the southern part of its region from the Oxford transmitting station.\n*1971\n** No events.\n* 1972\n** 16 October – Following a law change which removed all restrictions on broadcasting hours, ATV launches an afternoon service.\n* 1973\n** No events.\n*1974\n** The 1974 franchise round sees no changes in ITV's contractors as the huge cost in switching to colour television would have made the companies unable to compete against rivals in a franchise battle.\n*1975\n** The first ATV Newsdesk bulletins are broadcast to provide views with a regional weekday lunchtime and late evening news update.\n*1976\n** No events.\n*1977\n** No events.\n*1978\n** August – ATV begins broadcasting Public Service Announcements.\n* 1979\n** 10 August – The ITV strike forces ATV off the air. The strike ends ten weeks later on 24 October.\n1980s\n* 1980\n** The Independent Broadcasting Authority announces that the lack of regional programming and production (it had a major studio centre at Elstree in Hertfordshire, a legacy of its London contract), was hampering the region so it insists that the winning applicant for the Midlands franchise needs to be more clearly based in the region and have separate facilities for the East and West Midlands. ACC creates ATV Midlands Limited, a shell company solely for the franchise process.\n**28 December – ACC is awarded the Midlands contract but with conditions attached. ACC is forced to sell 49% of the company, relinquish executive roles, sell the Elstree studios and rename the company to demonstrate that it is effectively a new business.\n* 1981\n** Central Independent Television is chosen as the name of the new Midlands franchise.\n* 1982\n** 1 January – At 12:34am, the ATV name is used for the final time at closedown of the evening's programmes as when transmissions resume at 9:25am, Central officially goes on the air.\n** May – ACC sells its remaining stake in Central, thereby ending Associated Television's involvement with ITV.\n* 1983\n** July – Central uses ATV's studio complex at Elstree for the final time to ensure compliance with a condition of the licence renewal which requires the company to stop using any London-centric facilities.\n* 1984\n** The Elstree Studios complex is sold to the BBC.[http://www.TerraMedia.co.uk/Chronomedia/years/1984.htm \"Chronomedia: 1984\"]  Chronomedia by Terra Media\nSee also\n* History of ITV\n* History of ITV television idents\n* Timeline of ITV\n* Timeline of ABC Weekend TV – ATV's weekend predecessor in the Midlands\n* Timeline of Central Independent Television – ATV's successor in the Midlands\n* Timeline of London Weekend Television – ATV London's successor\nReferences"
    }
  ]
}