{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of reactions to the 2020 Hong Kong national security law (November 2020)\n\nThe Hong Kong National Security Law is a piece of national security legislation passed on 30 June 2020 which was a major factor, besides the COVID-19 pandemic and its accompanying gathering regulations, in essentially ending the anti-extradition bill protests. The law established the crimes of secession, subversion, terrorism, and collusion with foreign organisations. Implementation of the law entitles authorities to surveil, detain, search and extradite persons suspected under its provisions to Mainland China.\nA few local protests took place in November 2020 but there were no large-scale demonstrations in threat of the national security law. The detention of Joshua Wong, Agnes Chow and Ivan Lam on 23 November aroused international attention.\nThe national security law was also a factor in the dismantling of pro-democratic opposition in the LegCo, Hong Kong's parliament. After four lawmakers were ousted on a decision by the Central Government in Beijing on 11 November, the remaining democratic lawmakers collectively resigned in solidarity the same day.\nWestern countries started sanctions on China and Hong Kong officials and suspended agreements with Hong Kong, notably the Surrender of Fugitive Offenders.\n2 November\nHong Kong Telecom staff sentenced to 2 years in prison for doxxing police officers\nA 33-year-old male former technician of Hong Kong Telecom, accused of obtaining personal information of police officers and their family members, and uploading some of the information to Telegram during the 2019 protests. He was sentenced to two years in prison after having been convicted in October of three \"access to computer with criminal or dishonest intent\" charges and one \"offence for disclosing personal data obtained without consent from data users\".\nHong Kong Connection journalist investigating 721 Yuen Long attack arrested\nFreelance journalist Bao Choy, who filmed a Hong Kong Connection episode about the 2019 Yuen Long attack, was arrested. She was charged with misusing a government vehicle licensing database and making false statements to obtain information and records about car owners after trying to discover the owners of a few vehicles suspected of supplying weapons to the attackers. The owners of cars were identified as rural village leaders. She checked a box to declare that the vehicle registration searches were for \"other traffic and transport related matters\". Other options available when accessing the database were ‘legal proceedings’ and ‘sale and purchase of vehicles’. While the previously available option ‘other purposes’ had been scrapped, the magistrate said that Choy should have considered other means to obtain the information. The police dismissed allegations that the arrest was an attack on press freedom.\n3 November\nCanada considering large-scale evacuation\nJeff Nankivell, Consul general of Canada in Hong Kong and Macau told a parliamentary committee that should the security situation in Hong Kong deteriorate, the Canadian government would offer assistance to its nearly 300,000 citizens living in Hong Kong. This, he said, would include the situation where \"the urgent departure of a large number of Canadians would be necessary\", the likelihood of which situation he assessed as  \"right now to be low\".  The Canadian consulate would not be able to help asylum seekers, however, which he said was in line with global policies of Canada which were \"similar to most other countries\" regarding applicants from their own country or territory.\n4 November\nHuman rights lawyer Lu Siwei investigated\nSichuan human rights lawyer Lu Siwei received a notification from the local justice bureau demanding that his law firm hand over all his cases for investigation. Sources said this was related to Lu's handling of the 12 Hongkongers case and that the authorities wanted to force him to quit handling the case.\nHKBU student journalist charged with obstructing police officers and resisting arrest\nThe Students' Union Editorial Board at Hong Kong Baptist University stated that one of its journalists had the previous night been formally charged with obstructing police officers and resisting arrest when interviewing at a \"Lunch with you\" protest in Central held on 8 May. He was to appear in court on 6 November. At the May protest, police officers thought that Tang – who according to the editorial board was wearing a press pass –  looked suspicious. He was said to have ignored police requests to have his bag checked and show his identity card, and shouted emotionally (in Cantonese)  \"Is it illegal to take pictures?\". The police asked him to stay calm, or he would be arrested for misbehavior in public places. He was arrested later. The prosecution said he had struggled fiercely when being arrested. A reporter of Hong Kong Free Press who was present at the scene heard Tang shouting that he had been beaten.\n5 November\nNational Security Department reporting hotline launched\nHong Kong police announced the launch of a National Security Department reporting hotline on their website and on their Facebook page. Citizens could make related non-urgent reports through Wechat, SMS, or email, while the phone hotline would not answer any incoming calls and replies. Lawmaker James To worried that the reporting hotline would cause distrust among people. Icarus Wong, member of the organisation \"Civil Rights Observer\" said the hotline might engender \"a culture of retaliatory informing, Cultural Revolution style\", and create a chilling effect.\nCUHK alleged promotional material of its student union to be in violation of the law\nThe CUHK students' union planned to hold an exhibition to commemorate the first anniversary of the siege of CUHK, with its promotional materials showing pictures of the siege and its poster showing photos of CUHK principal Rocky Tuan and the former principal Joseph Sung. CUHK issued a statement, accusing the protesters of \"illegal use of portraits\" and urging the event organiser to modify or remove the promotional materials immediately to avoid breaking the law.\n6 November\nFour police associations issued an open letter to CUHK President Rocky Tuan\nFour police associationsSuperintendents Association, Hong Kong Police Inspectors' Association, Overseas Inspectors Association, and Junior Police Associationissued an open letter to Chinese University of Hong Kong President Rocky Tuan, in which they repeated their accusations from an October 2019 letter. That month, Tuan had met with students, one of whom had accused police of sexual assaults during arrests, and had later said in an open letter that the school was in touch with 20 students regarding alleged mistreatment; he had also urged an independent probe into police action. As in their first letter, to which Tuan had not responded, police took issue with the statements from the students being, in their view, unsubstantiated and unverified. They asked Tuan to take responsibility for the escalation into the November siege of CUHK.\nPolyU tightens campus security ahead of siege anniversary\nHong Kong Polytechnic University announced that it would refuse entry to most visitors from 6 November. The measure came days before the first anniversary of the siege of the university in November 2019, and followed the installation of turnstiles and the requirement on campus visitors to register before arriving.\n7 November\nCityU, HKBU confirm tighter access control\nOn an inquiry by HK01, CityU replied that in February 2020, the school had completed the installation of an electronic access system and enhanced security measures on the campus. Hong Kong Baptist University had undertaken similar measures.\n8 November\nPolice raises purple banner on first anniversary of Chow Tsz-lok's death\nOn the first anniversary of the death of 22-year-old Hong Kong University of Science and Technology student Chow Tsz-lok, a large number of citizens went to the car park in Tseung Kwan O, where Chow had sustained the injuries that led to his death, to mourn and lay flowers at night. A large number of Tactical Police officers were on guard around the road and in the parking lot, and repeatedly opened microphones to warn those present or violated the gathering restriction order, and asked citizens to leave the scene after completing their mourning. Later, the police officers claimed that they wanted to implement crowd control and set up a cordon in front of the altar for a time. At 8 pm, it was originally planned to hold a silent mourning ceremony, but after someone chanted Liberate Hong Kong, Revolution of our Times, the police officers ran across the road and raised a purple flag to warn that the slogan might violate the Hong Kong national security law.\nFile:DSCF5254 (50579680908).jpg|Someone put a basketball.\nFile:DSCF5333 (50580405411).jpg|At 5:55 in the evening, a man was arrested on suspicion of criminal damage at the wall of the parking lot in Sheung Tak.\nFile:DSCF5511 (50580400566).jpg|Police officers ran across the road and raised a purple flag after someone chanted Liberate Hong Kong to warn that the slogan might violate the national security law.\nFile:DSCF5541 (50580531787).jpg|Male singer Tommy Yuen, social worker Hendrick Lui and others held a memorial service.\nFile:DSCF5358 (50579678318).jpg|Tactical police officers on guard in the parking lot\n9 November\nDepartment of Justice appeals against acquittal of protesters accused of rioting on 31 August 2019\nThe Department of Justice confirmed it had filed an appeal against the acquittal of seven defendants accused of rioting on the night of 31 August 2019, and the dropping of charges against an eighth, social worker Jackie Chen, in late October 2020 and September 2020 respectively. The letter stated that the department was dissatisfied with the decision of District Court Judge Sham Siu-man, who they believed did not adequately and fully consider and analyze all the evidence.\nPro-democracy lawmakers threaten to collectively resign if four disqualified\nAccording to unconfirmed reports, the Standing Committee of the National People's Congress was to revoke the qualifications of four democratic legislators, Alvin Yeung, Dennis Kwok, Kwok Ka-ki and Kenneth Leung, during its meeting on 10 and 11 November. They would be accused of filibustering meetings and violating their oaths of office. The four legislators had been barred from running in the original September Legislative Council election which was later postponed by a year due to the COVID-19 pandemic; the four had decided to stay on for that year.\nOn 9 November, 19 pan-democratic lawmakers met with reporters in response to the reports, indicating that they had unanimously decided that if the four were disqualified, they would have no hesitation in resigning collectively.\nU.S. imposes sanctions against Chinese and Hong Kong officials\nThe U.S. Department of the Treasury announced sanctions against four people accused of 'involving in suppressing dissent in Hong Kong', including Li Kwai-wah, Senior Superintendent of the National Security Department of the Hong Kong Police Force, Edwina Lau, deputy director of the Police Department, Li Jiangzhou, deputy director of the National Security Agency, and deputy director of the Hong Kong and Macau Affairs Office of the State Council Deng Zhonghua. In response, Chinese Foreign Ministry spokesperson Wang Wenbin told reporters at a daily briefing that the sanctions by the United States \"grossly interfere in China's internal affairs\", and demanded that the sanctions be withdrawn.\nHong Kong suspends surrender of fugitive offenders and mutual legal assistance agreements with multiple countries\nThe Hong Kong government announced that it had notified the Consulates General of the Netherlands and Ireland in Hong Kong respectively in accordance with the instructions of the Central Government to suspend the implementation of the agreement on the surrender of fugitive offenders and the agreement on criminal judicial assistance between Hong Kong and the two countries. The government also issued notices to the French, German, and Finnish consulates, shelving the surrender agreement with France, suspending the implementation of the surrendering fugitive agreement with Germany and Finland, and suspending the implementation of the criminal judicial assistance agreement between Hong Kong and the above three countries.\n11 November\nFour LegCo members disqualified\n, Dennis Kwok, Kwok Ka-ki and Kenneth Leung meeting the reporters]]\nThe 23rd Meeting of the Standing Committee of the 13th National People's Congress passed the Decision of the Standing Committee of the National People's Congress on the Qualifications of the Legislative Council Members of the Hong Kong Special Administrative Region on 11 November, allowing the Hong Kong government to expel lawmakers deemed to be supporting Hong Kong independence, colluding with foreign forces or threatening national security, without having to go through the courts.\nto disqualify four legislators.]]\nThe Hong Kong government announced that Alvin Yeung, Dennis Kwok, Kwok Ka-ki and Kenneth Leung had lost their seats as LegCo members. Chief Executive Carrie Lam told reporters that the disqualifications were \"constitutional, legal, reasonable and necessary\", saying: \"We have doubts about their abilities to perform their duties.\" At a press conference, the four ousted lawmakers condemned the move, with Dennis Kwok saying that it \"clearly\" breached the Basic Law.\nLegCo mass resignations\nIn the afternoon, the remaining 15 democrats announced their resignation taking effect on 12 November. Only Civic Passion member Cheng Chung-tai and the medical constituency member Pierre Chan stated that they would stay in office. Convener of the pro-democracy camp and the chairman of the Democratic Party, Wu Chi-wai, had said previously that the resignation was to reflect both the unity of the pan-democrats and the \"tyranny of the central government and the HKSAR\".\nFirst anniversary of the CUHK siege\nThe Student Union of the Chinese University of Hong Kong initiated an exhibition on the first anniversary of Chinese University siege at the Cultural Square next to University Mall. Due to pressure from the university earlier, in order to make the exhibition proceed as scheduled, the Student Union covered up sensitive words in some of the exhibition panels, such as the slogan Liberate Hong Kong, revolution of our times. In a statement issued the same day, the university expressed deep regret about what it called \"biased descriptions\" of the incident in the exhibition. At the same time, the university pointed to its responsibility to cooperate with law enforcement officers in entering the campus to investigate and take actions in accordance with the law. A student union member insisted that the exhibition did not violate the law, and asked university management to specify which of the displays was meant with its accusations of bias.\nFile:CUHK 5942 (50589756778).jpg|The exhibition on the first anniversary of the CUHK siege attracted many CUHK lecturers, students and the public to visit.\nFile:DSCF5876 (50590503146).jpg|Next to the exhibition, there was a 'Write with You' street booth for students to write down what they wanted to say to the arrested.\nFile:CUHK strike items 202011.jpg|The exhibition displayed the tools used by the protesters at the time.\nFile:DSCF5969 (50590500466).jpg|Grandma Wong holding a yellow umbrella and holding up a slogan in support of the 12 Hong Kong activists.\n12 November\nCanada relaxes immigration from Hong Kong\nIn response to the implementation of the Hong Kong national security law, the Canadian government announced a number of measures to facilitate the immigration of Hong Kong people to Canada, including providing a three-year open work permit for young Hong Kong people who have graduated from a tertiary college in the past five years. Those who had at least one year of work experience, met the language and education requirements, or graduated from a Canadian post-secondary education institution could directly apply for permanent residence. The relevant measures would be implemented in 2021.\n16 November\nInquiry into cause of death of Chow Tsz-lok begins\nThe cause of death of Chow Tsz-lok inquest began, and the trial period was expected to last 25 days. His father called on citizens who witnessed the incident to provide information, try to restore the truth, and let his son rest in peace. In his testimony, he stated that on the night of the incident, he had reminded his son to \"be careful\".\n17 November\nReport of former IPCC expert published\nA report written by Clifford Stott, one of the five former members of the International Expert Group of the IPCC, and other scholars was formally published. The report pointed out that the containment strategy by police had repeatedly failed, leading to an escalation of the situation and turning protesters into violent radicals.\n18 November\nYellow Factory closes down after being accused of violating national security law\nThe mask manufacturer Yellow Factory was alleged by pro-China Wen Wei Po and Ta Kung Pao to produce masks suspected of violating the national security law. The reports also quoted criticism by Elizabeth Quat, a DAB Legislative Council member. Yellow Factory stated on Facebook that it has no intention of violating the national security law. Its  Causeway Bay and Mong Kok stores and order pages were temporarily closed.\n19 November\nFive Eyes Alliance expresses concern about the disqualification of legislators\nU.S. Secretary of State Mike Pompeo and the foreign ministers of Canada, Australia, New Zealand and the United Kingdom issued a joint statement, reiterating their serious concerns about the disqualification of legislators of the Legislative Council. The statement criticized the implementation of the Hong Kong national security law and the government's postponement of the legislative council elections.\nIn response to the incident at the press conference, Zhao Lijian, spokesperson of the Ministry of Foreign Affairs of the People's Republic of China, stated that the countries concerned had violated international law and the basic norms of international relations and expressed strong dissatisfaction and firm opposition. He also stated that \"no matter if they have five or ten eyes, as long as they dare to harm China's sovereignty, security, and development interests, be careful that their eyes are poked and blinded.\"\nChinese University students launch a demonstration\nDozens of students of the Chinese University of Hong Kong turned their graduation ceremony into a rare protest to commemorate the pro-democracy protests a year earlier. After the protest, the CUHK stated that the gathering and demonstration activities were suspected of violating the Restrictions on Gathering Order and the Public Order Ordinance. The university, which had called the police, strongly condemned the protest. The National Security Department of the Police Force sent 300 police officers to the campus on the next day to investigate.\n20 November\nNational Security Department enters CUHK campus to search for evidence\nenter the United College of CUHK campus to film and search for evidence]]\nAt about 3 pm, officers from the National Security Department of Police Force, accompanied by university security personnel, entered the CUHK campus to conduct investigations and search for evidence, including 30 criminally damaged locations, and photographed multiple exterior walls and pillars. Police officers also entered the dormitory area to investigate. The operation ended at 6 o'clock in the evening without arrests. The Chairman of the Provisional Administrative Committee of the Student Union of CUHK, Owen Au Cheuk-hei, expressed disappointment over the way the school had involved the police and believed that it would undermine the mutual trust between the school and the students. The Chinese University Staff Union and the Union of university and Tertiary Institutions issued a joint statement, strongly condemning the school's practice of reporting to the police. It deeply regretted this as a violation of educational philosophy.\nA spokesperson for the Liaison Office of the Central Committee of the Chinese Communist Party said that he firmly supported the SAR government in investigating and punishing suspected violations of the National Security Law in the Chinese University in accordance with the law. It accused the protesters of tarnishing the campus and seriously desecrating the feelings of the vast majority of graduates, relatives and friends.\n21 November\nRadio host arrested for funding secession\nD100 radio host Wan Yiu-sing (a.k.a. Giggs), his wife and his assistants were arrested by the police for launching the 'A thousand of fathers and mothers: Taiwan education aid programme' crowdfunding campaign to support the anti-revision movement. The security officer was arrested on suspicion of committing the crime of 'money laundering.' Giggs was also involved in 'funding others to split the country with money or other properties.' This was the first time the police have cited the crime of funding secession under the Hong Kong national security law. The Mainland Affairs Council of Taiwan reprimanded the Hong Kong police for \"repeating the law and doing nothing to help stabilize the Hong Kong society.\"\n721 incident memorials\n, intercepted and searched \"Captain America 2.0\", and then asked him to leave the mall]]\nOn 21 November, 15 months after the 721 incident, a large number of police officers was deployed at Yuen Long station and in the district. In the evening, Adam Ma Chun-man, also known as 'Captain America 2.0', appeared again in the atrium of Yoho Mall, chanting slogans such as 'Liberate Hong Kong and 'Hong Kong Independence', and sang Glory to Hong Kong. Several plainclothes police officers were divided into three teams to take pictures in the surrounding area. In less than ten minutes, more than 30 uniformed police officers wearing helmets walked into the mall, raised the purple flag and pulled up a large-scale cordon around the atrium to intercept and search 'Captain America 2.0'. A large number of police officers continued to patrol the mall, and then once again raised the purple flag. They left the mall at about 7 pm.\nIn addition, social worker Hendrick Lui played the episode of Hong Kong Connection '7.21 Who Owns the Truth' at the Lennon Wall of Yuen Long West Rail station. During the preparation time, more than 20 uniformed police officers and media liaison teams were present. Lui then transferred to the Fung Yau Street Sitting-out Area to hold a screening. Police officers monitored the scene.\nFile:YOHO Mall Bus Terminal Police vehicle 20201121.png|A police car parked at the underground bus stop of Yoho Mall\nFile:Police raise Purple flag in YOHO Mall 20201121.PNG|30 uniformed police officers wearing helmets walked into the mall and raised purple flags, accusing someone of violating national security law\nFile:Police not allow Yuen Long Station screening 20201121.png|Social worker Hendrick Lui asked to leave by police\nFile:Yuen Long screening 20201121.png|Hendrick Lui at Fung Yau Street North to hold a screening\n22 November\nCaptain America 2.0 arrested again\nIn the evening, Adam Ma Chun-man (a.k.a. Captain America 2.0) went to the atrium of PopCorn Mall in Tseung Kwan O to shout slogans and sang Glory to Hong Kong. After that, a large number of uniformed police officers rushed into the mall and raised purple flags, and pulled up a cordon. The police stated that the man was arrested in violation of Article 9 of the Criminal Offences Ordinance for allegedly committing acts with seditious intent.\n23 November\nCourt case against three young activists\n, Ivan Lam and Joshua Wong speaking to the press before remanded outside West Kowloon Magistrates' Court]]\nFormer Demosistо̄ members Joshua Wong, Agnes Chow, and former chairman Ivan Lam had participated in the protests outside the Wan Chai Police Headquarters on 21 June 2019. The case was to open in the West Kowloon Magistrate Courts, but the three were detained immediately after pleading guilty. According to local media, Wong pleaded guilty to organizing and inciting an unauthorized assembly; Lam to incitement; and Chow to incitement and participation in the unauthorized assembly.\nUnited Kingdom publishes 2020 semi-annual report on Hong Kong issues\nThe Department of Foreign and Commonwealth Affairs of the United Kingdom issued its semi-annual report on Hong Kong issues. Besides describing the imposition of the Hong Kong national security law as \"a clear and serious breach\" of the Sino-British Joint Declaration, it also mentioned several other perceived breaches of Hong Kong's autonomy, including the delay of the Legislative Council election.\n24 November\nEmergency Law and Anti-Mask Law constitutional ruling appeal\nAbout 24 democrats and social activists including Leung Kwok-hung filed a final appeal against the constitutionality of the Emergency Regulations Ordinance and the Prohibition on Face Covering Regulation. In her remarks, Gladys Li, a senior barrister representing the democratic camp, questioned the constitutionality of the ordinance and described the law as a 'missile launcher.'\nCaptain America 2.0 charged for inciting secession\nThe police formally charged 30-year-old Adam Ma Chun-man (a.k.a. Captain America 2.0), who had been arrested multiple times before, accusing him of inciting secession in 10 locations and 19 occasions between 15 August and 22 November 2020. Ma was suspected of violating the national security law. He shouted in court: \"The fruit of democracy is bought with blood and sweat!\". At the request of the prosecution, Chief Magistrate Victor So, the defendant was remanded until February 2021 for interrogation.\n25 November\nCarrie Lam releases 2020 policy address\nHong Kong Chief Executive Carrie Lam issued the 2020 Policy Address, which mentioned 'One Country, Two Systems', the relevant decisions of the National People's Congress and the national security law. In her report, she said that the situation in Hong Kong had changed to the point that \"non-central authorities could not take action.\" This made it possible to include the national security law in Annex III of the Basic Law and implement it in Hong Kong on the same day. She said that in the past four months, the law had brought significant effects in restoring Hong Kong's stability. The advocacy of 'Hong Kong independence' and collusion with external forces had gradually diminished. Radical organizations had ceased operations or disbanded, and suspected lawbreakers had absconded in fear of crime. On the other hand, street violence had also been greatly reduced.\n26 November\nReform of Liberal Studies curriculum content\nSecretary for Education, Kevin Yeung, announced a reform of the Liberal Studies subject, which would be renamed, have its teaching hours halved, and have more coverage of mainland China and less on current affairs. President of PTU and LegCo educational constituency member, Ip Kin-yuen, criticized the authorities for implementing reforms out of political considerations.\nSpeaking on RTHK 'Accountability' on 28 November, Chief Executive Carrie Lam said that the reform of Liberal Studies was not about politics, and emphasized that there had been many problems in the subject itself \"from day one\" a decade ago.\nJimmy Lai sues Ta Kung Pao for defamation\nFounder of Next Digital, Jimmy Lai, filed a lawsuit at High Court, alleging that an article in Ta Kung Pao published in June 2020 entitled 'The leader of the chaotic Hong Kong seeks \"grass\" route and charges 1 million to be exposed' was defamatory. In addition to requiring the court to issue an injunction to prohibit Ta Kung Pao from slandering anymore, it also asked the other party to pay compensation and publish an apology.\nCary Lo arrested for wasting police time\nA Tuen Mun District Councillor from Democratic Party, Cary Lo, was arrested for fabricating a fictitious detention by police at Fung Yau North Street, Yuen Long, on 21 July 2020. He was released on bail pending further investigation. The police condemned Lo for blatantly lying against the ethics and integrity of public officials, and did not rule out taking legal action to investigate the incident.\n27 November\nCarrie Lam admits that she has no bank services under US sanctions\nCarrie Lam was asked by reporters during an exclusive interview with the \"Talk The Walk\" of Hong Kong International Finance Business Channel (HKIBC), in a preview clip shown late on 27 November, whether she was caused any inconvenience after being sanctioned by the US government. She revealed that due to US sanctions, she had no bank account and was receiving her salary in cash. However, she said it was an honor to be sanctioned for safeguarding national security.\n30 November\nChinese government sanctions individuals affiliated with United States NGOs\nAt a regular press conference, the spokesperson of the Chinese Ministry of Foreign Affairs, Hua Chunying, announced that China would sanction four people with links to U.S. democracy promotion efforts. They are John Knaus, senior director of the National Endowment for Democracy, Manpreet Anand, a regional director of the National Democratic Institute, Kelvin Sit, the NDI's program director for Hong Kong and Crystal Rosario, a specialist at the NDI.\nCommemoration of Prince Edward Station attack\n]]\nThe day marked 15 months since the 831 Prince Edward Station attack. As on the last day of the preceding months, people marked the event, during which protesters were believed by many to have died in spite of strong denial by authorities and no evidence of this ever having emerged, by coming to the outside of the station, clutching and placing white flowers. Three were reportedly fined for littering. Police loudspeaker announcements warned against breaching the gathering limit of four people imposed due to the COVID-19 pandemic, and against leaving flowers, which would be prosecuted as littering. Prominent protester Grandma Wong was present in the evening. Three people were fined for littering.\nFile:Prince Edward 20201130 (50668957662).jpg|Large numbers of police officers deployed outside the exit of Prince Edward station.\nFile:DSCF6806 (50668136818).jpg|Grandma Wong holding a yellow umbrella\nFile:Flower (50668133488).jpg|Flowers outside Prince Edward station\nFile:DSCF6780 (50668137503).jpg|Lennon Wall at the street station in Mong Kok\nTed Hui leaves Hong Kong\nFormer legislator Ted Hui of the Democratic Party had been returned his travel documents after Danish parliamentarians provided official documentations for a visit to a climate change conference. The invitation had come from Katarina Ammitzbøll. It was later admitted by Danish parliamentarians that the meetings mentioned in the documentations had been made up. Hui arrived in Denmark on 30 November. On 3 December, it emerged that Hui would remain abroad with his family. On that day, he made a Facebook post in which he said he had chosen \"exile\". He said in the post that he would leave the Democratic Party.\nReferences"
    }
  ]
}