{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of mining in Colorado\n\nColorado mining history is a chronology of precious metal mining (e.g., mining for gold and silver), fuel extraction (e.g., mining for uranium and coal), building material quarrying (iron, gypsum, marble), and rare earth mining (titanium, tellurium).\nThe Uravan Mineral Belt (UMB) is on the west side of the state, and the Colorado Mineral Belt (COMB) is a large area of the state that had gold/silver booms.  Outside of the UMB & COMB, the Denver Basin produced small amounts of gold, and the Cripple Creek district had a different gold boom.\nMining events\n{|class=\"wikitable sortable\"\n|+ Chronology\n! Date\n! Type\n! District\n! Event\n|-\n|2011\n| uranium\n|UMB\n|The Pinon Ridge Mill construction in Paradox Valley near Bedrock, Colorado, was approved by the Environmental Protection Agency on October 26, 2011.\n|-\n|2009\n|uranium\n|UMB\n|The price of uranium dropped between 2007 and 2009. In 2009 it cost more per pound to mine the uranium than it could be sold for and, as a result, the last working uranium mine closed that year.}}\n|-\n| 2008\n| gold\n| Gold Hill\n| The only working underground mine in Colorado in 2008 was the Cash mine, built in 1872, at Gold Hill in Boulder County. Each ton of ore yields about .75 ounce of gold at the mine, which daily extracts about 50 tons of ore.\n|-\n|2004\n|nahcolite\n| Piceance Basin\n| American Soda pilot project that mined via fracturing ended after 3.75 years.\n|-\n|2004\n|coal\n|\n| Out of 30 states that produce coal, Colorado was the sixth largest producer of coal in the country. In 2010, Colorado was the eleventh largest producer.\n|-\n|1999\n|\n|Leadville\n| The last working mine in the Leadville mining district, the Black Cloud Mine, closed in 1999.\n|-\n| 1996\n| gemstones\n| State Line Kimberlite District\n| The Kelsey Lake Diamond Mine produced quality diamonds up to 26 carats beginning in 1996.\n|-\n| 1995\n|molybdenum\n| Leadville\n| The Climax mine, the country's largest molybdenum mine, was put on care and maintenance status for years. After a long shutdown, the Climax mine reopened and resumed shipment of molybdenum on May 10, 2012.\n|-\n|1995\n|gold\n|Cripple Creek\n|Large-scale open pit gold mining began at Cripple Creek & Victory Gold Mining Company's Cresson Mine and by 2003 had produced 1.62 million gold ounces. The Cripple Creek district has been the largest producer of gold in the state, with more than 22 million ounces mined.\n|-\n|1991\n|gold\n|Rio Grande County\n|The Summitville mine (now a Superfund site) was served with a cease and desist order by the state government concerned with metal levels in water run-off.\n|-\n|1972\n|uranium\n| Western Colorado\n|The United States Congress created the 15-year Grand Junction Remedial Action Plan in 1972 to clean up sites, like the Climax mill and a total of 594 buildings, that were contaminated during uranium processing. Realizing the implications at other uranium sites in the country, Congress then passed the Uranium Mill Tailings Radiation Control Act, which resulted in the clean-up of nine mills in Colorado, including other Grand Junction area mills, Durango, Rifle, Maybell, Naturita, and Gunnison mills.\n|-\n|1965\n| uranium\n|Ralston Buttes District\n| The Schwartzwalder uranium mine, built in 1953, closed in 2000 after producing a total of 17 million pounds of uranium. Contamination was discovered in 2007.\n|-\n|1959\n|aluminum\n| COMB\n|The aluminum beer can was introduced by Coors.\n|-\n|1957\n|uranium\n|Grand Junction\n|The Grand Junction Climax Uranium Mill at the United States Atomic Energy Commission (A.E.C.) Compound along the Gunnison River processed 2000 tons of North/South Dakota lignites, confirming their \"reserve of uranium\".\n|-\n|1956\n|titanium\n|Iron Hill carbonatite complex\n|DuPont Corporation has purchased property, staked claims, and acquired mineral rights at Iron Hill, which Bradley S. Van Gosen of the US Geological Survey says it is believed to be \"the largest known resources of titanium and niobium in the United States.\"\n|-\n| 1954\n| uranium\n| Gateway\n|Coffinite was first identified by Thomas W. Stern of the US Geological Survey in February 1951 in the Gateway district at the La Sal No. 2 Mine.\n|-\n|1943\n|uranium\n| Grand Junction\n| The War Department acquired  at Grand Junction for a refinery for the Manhattan Project (atomic bomb). There were also mills at Uravan and Durango that were used by the project.\n|-\n| 1941\n| iron\n| Pueblo\n| Pueblo's open-hearth steel plant was stated in Colorado, a Guide to the Highest State, which was published in 1941, to have become \"the largest steel mill west of the Mississippi River\" and \"the largest single industrial establishment in Colorado\".\n|-\n|1927\n|coal\n|Serene\n|During the Columbine Mine massacre, six unarmed Colorado Fuel and Iron Company miners were killed and dozens more were injured by ex-state policemen using machine guns. See also: Coal Wars (1890-1930)\n|-\n|1923\n|radium\n|UMB\n|Radium Company of Colorado was one of the \"world's foremost producers of radium\" until a richer grade of radium from the Belgian Congo made it difficult to compete. Radium mines were closed in Colorado in 1923.\n|-\n| 1918\n|molybdenum\n| Leadville\n| In February, Climax, Colorado's 400-ton molybdenum mill went into production.\n|-\n| 1917\n| coal\n| Hastings\n| The Victor American Hastings Mine Disaster, which killed 121 miners in Las Animas County on April 27, was the worst mine disaster in Colorado's history.\n|-\n| 1915\n| zinc\n|Lake County\n| G.F. Loughlin described the value of zinc in 1915 as an \"extraordinarily high price\", which resulted in a 30% increase in the overall value of metals that year in Colorado. Lake County, for instance, saw more than a doubling of the value of zinc sold in 1915 from the previous year, even though production was reduced from 78,763,334 pounds in 1914 to 72,493,170 pounds in 1915.\n|-\n|1913-14\n|coal\n| Ludlow\n| The Colorado Coalfield War (1913–14) began when about 12,000 coal miners when on strike in Ludlow on September 23. Some of the workers were forced from their home and established a tent city, and 26 people were killed on April 20, 1914, at the makeshift settlement by agents of the coal mine owners. See also: Ludlow Massacre\n|-\n|1913\n|radium\n|Denver\n|The National Radium Institute was founded in 1913 and its Denver plant began production in June 1914. It was a Superfund site in 1983.}}\n|-\n|1910\n|radium\n|UMB\n|Standard Chemical Company started producing vanadium and radium in 1910 in Paradox Valley at the Jim Dandy mine, which initiated a radium boom in Colorado.\n|-\n| 1907\n| gold\n| Colorado City\n| Colorado City's Golden Cycle Mill—considered to be a modern, well-equipment plant—processed Cripple Creek ore economically.\n|-\n|1904\n|gold\n|Cripple Creek\n| A fifteen-month strike, precipitated by firing of workers identified as union members and mine owners calling for state intervention, continued into 1904 and resulted in explosions that killed non-union workers, violence, deaths due to unsafe equipment, mine owners \"jockeying\" for control, and intervention by the military. For instance, the mining camp at Dunnville was captured by a trainload of soldiers that defeated union miners.\n|-\n|1903\n|gold\n| Old Colorado City\n| Governor James Hamilton Peabody sent troops to Colorado City in 1903 to settle a miner's strike. They set up Camp Peabody at what became the 1903 Colorado Labor War. Old Colorado City was the location of a 1903 labor strike that spread to Cripple Creek and eventually led to the Colorado Labor Wars.\n|-\n| 1901\n| aluminum\n| COMB\n| Bauxite was reported to have been recently discovered near Buena Vista, Colorado.\n|-\n| 1900\n| gold\n| Cripple Creek\n|Cripple Creek produced more than $18 million () in gold, which was more than 2/3 of the gold production for Colorado that year.\n|-\n|1900\n|uranium\n|UMB\n|The first mill for radioactive metals was built on La Sal Creek by Charles Poulot and Charles Voilleque. It produced 15,000 pounds of uranium oxide and then closed in 1902. One year later Western Refining Company operated the mill until 1904.\n|-\n|1899\n|tungsten\n|Nederland\n|Ores containing tungsten were found in Nederland, Boulder County. In 1910, 1,221 tons of tungsten was produced in Boulder County.\n|-\n| 1898\n| gypsum\n| Perry Park\n| Gypsum has been quarried in the Ralston Creek formation, near Perry Park, beginning in 1898.\n|-\n|1898\n|uranium\n|UMB\n| Ten tons of a particularly rich shipment of carnotite (15% vanadium(V) oxide and 20% triuranium octoxide) was made from the Copper Prince claim on Roc Creek.\n|-\n|1898\n|uranium\n|UMB\n|Carnotite was discovered in western Montrose County, Colorado in late 1897 or early 1898 and named or French president Marie François Sadi Carnot.}} by Charles Poulet, who built an 1899 mill in the McIntyre mining district of San Miguel County.\n|-\n| 1896-09\n| gold\n| Cripple Creek\n| Cripple Creek ores were processed through a new Colorado-Philadelphia chlorination mill installed at Colorado City.\n|-\n|1896-07\n| silver\n|Leadville\n|The Leadville Miners' Strike by a local organization of the Western Federation of Miners unsuccessfully attempted to get higher wages.\n|-\n| 1894-05\n| gold\n| Cripple Creek\n| Workers of the Western Federation of Miners went on strike, creating the Cripple Creek miners' strike of 1894. A key bargaining issue was creation of an eight-hour-workday. Governor Davis Hanson Waite sent in the militia to maintain peace—after several deputies and strikers were killed—and to mediate bargaining.\n|-\n| 1893\n| gold\n| Cripple Creek\n| The first chlorination plant for the district's ore was erected by Edward Holden.\n|-\n| 1892\n| iron\n| Leadville\n| In 1892, 3,110 tons of manganiferous iron was shipped from Leadville.\n|-\n|1892\n| gold\n|Cripple Creek and Creede\n| Both Cripple Creek and Creede experienced mining booms. One year later, Cripple Creek had the largest gold discovery in the state's history.\n|-\n|1890\n|gold\n|Cripple Creek\n|Gold was discovered in Cripple Creek, which resulted in rapid growth of mining in the area.\n|-\n| 1887\n| carbonate ore\n|Leadville\n| Leadville produced almost one half of the Colorado's metals from carbonate ore for the year, valued at a $12,072,967.81 ().\n|-\n|1886-09\n|gold\n|Manhattan Mining District\n|A \"rich strike\" was discovered west of Fort Collins in September 1886 between the Seven Mile and Elk Horn creeks. This resulted in a rush of miners to the area along Manhattan Creek.\n|-\n| 1885\n| zinc\n| Clear Creek, Summit and Lake counties\n| Zinc, an undesirable byproduct of mining other ores, was first recovered in Colorado in 1885 in Clear Creek, Summit and Lake counties.\n|-\n|1882\n|aluminum\n|Colorado Springs\n|Cryolite was discovered by October 1882 at St. Peter's Dome near Pike's Peak.\n|-\n|1882\n| coal\n|Colorado Springs\n| The completion of the Denver and New Orleans Railroad in July, 1882 was instrumental in the effective production and shipment of coal from the Franceville Mine. It became the first coal mine that was \"worked to any extent\", according to Colorado's state coal-mine inspector.\n|-\n|1881\n|uranium\n|UMB\n|Tom Talbert discovered the yellow uranium-vanadiaum of the Colorado Plateau on Roc Creek, near the town of Uranium. Western Colorado is the country's oldest uranium mining area.\n|-\n| 1880\n|\n| Leadville\n| Colorado's first labor strike required intervention by the state militia.\n|-\n|1879\n|molybdenum\n|Climax\n|Molybdenum was discovered in 1879 near Climax.\n|-\n|1879\n|silver\n|Leadville\n|The Colorado Silver Boom began after a large deposits of silver was found in Leadville, which was one of the first boom towns.  This led to another surge in the territory's population, aided by railroad service. For instance, Denver and Rio Grande Western Railroad was in Leadville by 1880.\n|-\n|1878\n|coal\n|Erie\n|The first Knights of Labor mining labor organization in Colorado was formed by Erie coal miners. Mining labor unions continued to be formed thereafter.\n|-\n| 1877\n| lead\n| Leadville\n| Lead was found in California Gulch, which led to construction of a smelter that year, and soon after the founding of the town named Leadville.\n|-\n| 1874\n| gold\n| Lake City\n| Enos Hotchkiss found a gold lode, originally called Golden Fleece, in Hinsdale County near Lake City. The mine was in production for 50 years.\n|-\n|1873\n|copper\n|Park County\n|A copper reverberatory furnace was installed by the Mount Lincoln Smelting Works at the Dudley Smelter in Park County in August to produce copper matte. It ran until January 25, 1874.\n|-\n| 1873\n| marble\n| Crystal River Valley\n| Yule Marble was discovered in the Crystal River Valley and was used in the Tomb of the Unknowns soldier memorials, Colorado State Capitol, and the outer facade, columns and upper steps of the Lincoln Memorial.\n|-\n|1872\n|tellurium\n|Tellurium Belt\n|Tellurium was discovered in Colorado on Boulder County's Gold Hill in the Red Cloud Mine. The tellurium belt through the Gold Hill, Sugar Loaf, Magnolia, and Sunshine districts of Boulder County is  wide and  long.\n|-\n| 1871\n| uranium\n|\n| The first pitchblende (Uraninite) identified in the United States was found at the Wood gold mine in Central City. For several years, small amounts of high quality uranium were taken as a byproduct from gold mining at the Kirk and Wood gold mines on Quartz Hill.\n|-\n| 1867-06\n| gold\n| Black Hawk\n| Boston & Chicago Smelting Company built an experimental smelter in June 1867 in Black Hawk, which was operational in January 1868.\n|-\n| 1866\n| silver-lead\n| Georgetown\n| Silver-lead deposits were found in 1866 in Georgetown, in 1874 in Leadville, and about 1880 in Aspen.\n|-\n|1864-09\n|silver\n|Argentine\n|The first paying silver mine, the Belmont lode, was found  above Georgetown on McClellan Mountain, by Robert Layton, James Huff, and Governor Robert Williamson Steele on September 14. This led to a rush to mine silver in the Argentine district over the next three years.\n|-\n|1864\n|silver\n|Montezuma\n|Silver was first discovered at the headwaters of South Clear Creek on Glacier mountain at the Coaley claim. This location is one mile south the current town of Montezuma in Summit County. The silver had a high lead content.\n|-\n| 1864\n| gold\n| Leadville\n| The placers near Leadville were exhausted within four years. In April 1860, one of the richest discoveries of Colorado placer gold was discovered at California Gulch, the site of Oro City. Another rich discovery was made at McNulty Gulch along the headwaters of Tenmile Creek.\n|-\n|1863\n|coal\n|Boulder\n|Joseph W. Marshall, owner the Consolidated Coal Company, operated the first commercial coal mine in Marshall, near Boulder, beginning in 1863. The ''Walking Into Colorado's Past: 50 Front Range History Hikes'' book states that William A. Kitchens discovered coal in Marshall in 1859 and sold the property to James Marshall in the mid-1860s.}}\n|-\n|1861\n|gold\n|Gilpin County\n|Within Gilpin County, there are trials of multiple mining methods, including use of chemicals, fire, steam and other crushers. Events in 1861 affected gold mining production: the outbreak of the Civil War and the creation of the Colorado Territory. Gold production fell as miners left Colorado to enlist as soldiers during the Civil War. In addition, much of the gold that was on the surface or easy to attain had been exploited, so miners had to sink mine shafts and change their methods for mining for complex refractory ores. This resulted in an end of the Pike's Peak Gold Rush.\n|-\n|1860-07\n|gold\n|Russell Gulch\n|A consolidated ditch was completed in July 1860 that delivered water from Fall River to Russell Gulch, south of Central City, along two ditches for hydraulic mining.) to build the ditches to transport the water about twelve miles.}}\n|-\n|1860-07\n|gold\n|Denver\n| Austin Clark, Milton Clark, and Emanuel H. Gruber first minted gold coins, many patterned after federal issues, from their Denver bank and assay office beginning July 1860. The United States government purchased the Denver establishment in April 1862.}} See also: Denver Mint\n|-\n| 1859-08\n| gold\n| Summit County\n| \"Rich gold placers\" were found in August and September 1859 along Georgia Gulch in what is now Breckenridge, Summit County. Summit County is Colorado's top placer gold producer, most of it coming from the southern Tenmile and Breckenridge districts.\n|-\n|1859-07\n|gold\n|Central City-Black Hawk\n|On July 5, J. D. Peregrine installed the first water powered arrastra at Gregory Diggings, near Black Hawk.\n|-\n|1859-05\n|gold\n| Central City\n| On May 6, John H. Gregory discovered the first lode vein at Gregory Diggings\",}} now in Central City, on Clear Creek's North Fork. When news of the find spread, the population of Gregory increased to 10,000 from 15 in one month and the summer saw of flood of \"Pikes Peak or Bust\" gold seekers across the plains for Rocky Mountain settlements. Legally, lands in the present state of Colorado were in the Kansas and Nebraska Territories until 1861.}}\n|-\n|1859-04\n|gold\n| Idaho Springs\n|Among the discoveries in 1859, George A. Jackson's discovery of pay placer gold on South Clear Creek, later called Chicago Creek, was an important gold discovery in Colorado, which helped fuel further participation in the Pike's Peak Gold Rush. Discoveries continued in other locations in the current state of Colorado throughout the year. There were also as many people who returned to their homes the first half of 1859—frustrated by the effort, Indian attacks, and reports of a starved group that resorted to cannibalism—as those who tried to find gold in earnest.}}\n|-\n|1858\n|gold\n| Montana City\n| Montana City was established north of the site of the 1857 find by William Green Russell and was the first settlement of modern Denver. The gold findings were unsatisfactory and the settlement was abandoned in 1859. The Pike's Peak Gold Rush began as other prospecting parties looked for gold at other Colorado sites.\n|-\n|1857-06\n|gold\n| Englewood\n|William Green Russell outfitted in Leavenworth, Kansas and led a group of prospectors, including Cherokee Native Americans, that found gold near Little Dry Creek of the South Platte River. Author Caroline Bancroft states that Green was the \"greatest single cause of the Pikes Peak Rush.\"\n|-\n|1850-06\n|gold\n|Denver area\n|Lewis Ralston, and other Cherokee prospectors, en route to the California Gold Rush panned small amounts of gold in June at Ralston Creek, South Platte River, and Cherry Creek. The party continued to California's Gold Country.}}\n|-\n|1848\n|gold\n|Lake City\n|Gold was said to be found near the present Lake City by a member of the John C. Frémont mapping expedition of the West, but \"the spot is unmarked and was unheralded.\" See 1874 Lake City item.\n|-\n| 1807\n| gold\n| South Park districts\n| Zebulon Pike recorded in his journal that James Pursley or Purcell had shown him some gold nuggets in Santa Fe, New Mexico that Purcell said that he found in South Park. Pike, though, questioned the finding.\n|-\n|1758\n|gold\n|\n|Antoine-Simon Le Page du Pratz's map depicted a source of gold north of the Arkansas River near a tributary running from a mountain, which he described \"a rivulet whose waters rolled down gold dust.\" His map, however, was \"clouded with so much doubt and uncertainty, that no dependence could be placed upon it\", according to Antonio de Alcedo and George Alexander Thompson in 1814.\n|-\n| Miocene\n| gold\n| Cripple Creek\n| Breccia rock  of pre-Cambrian gneiss, schist, and granite in a caldera created during the Miocene age is the source of most gold in the Cripple Creek district.\n|-\n| Eocene\n| coal\n|\n| The Dakota Group formed with coal deposits east of the Rocky Mountains, such as the modern Denver\n|}\nMining organizations\n{|class=\"wikitable sortable\"\n|+ Chronology\n! Date\n! Location\n! Organization\n|-\n|1992\n| Creede\n|The mining portion of the Creede Underground Mining Museum was completed.\n|-\n| 1970\n| Colorado Springs\n| The Museum of the West was incorporated and was renamed the 1972 Western Museum of Mining & Industry.\n|-\n| 1949\n| Lulu City\n| The National Park Service purchased the Lulu City, Colorado mining settlement, which was placed on the National Register of Historic Places in 1977.\n|-\n| 1891\n| Pueblo\n| Pueblo's Mineral Palace was completed with \"a ceiling formed of 28 domes [and] specimens of all the minerals produced in the State.\"\n|-\n|1882\n| Denver\n| National Mining Exposition (\"Industrial Exposition\") opened in Denver.\n|-\n|1876\n|Denver\n|The Colorado Mining Association formed (incorporated 1897).\n|-\n|1870\n|Golden City\n|Territorial School of Mines construction began in 1870 by George Maxwell Randall, an Episcopal Bishop. It was sold in 1874 to the Territory of Colorado and is now the Colorado School of Mines.\n|-\n|}\nSee also\n* Coal mining in Colorado\n* Gold mining in Colorado\n* Silver mining in Colorado\n* Uranium mining in Colorado\n* pig mining in Colorado\n* purple mining in Colorado\nNotes\nReferences\n}}"
    }
  ]
}