{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Manchester history\n\nThe following is a timeline of the history of the city of Manchester in north west England.\nPre 1000\n* c. 79 – Romans build a wooden fort at Mamucium in the Castlefield area.\n* 200 – Wooden fort is replaced by a stone one. A little town has grown up by the fort.\n* 407 – Roman army leaves Britain and Roman forts and towns are abandoned.\n* c. 870 – Nico Ditch dug.\n1000–1299\n*1080s – The area around \"Mamecester\" is in the hands of Roger the Poitevin before being granted to Albert de Gresle.\n* 1100s – Hulme Hall is in the ownership of John de Hulme.\n* 1227 – 19 August: Charter granted for an annual fair, at Acresfield (the later St Ann's Square).\n14th Century\n* 1300s (probable) – Buckton Castle built.\n* 1301 – Manchester is granted a charter from Thomas Gresley making it a baronial borough, governed by a reeve.\n* 1315 – Manchester is the starting point for Adam Banastre's rebellion.\n* 1330 – Lady Chapel (Chetham Chapel) of St Mary's Church is built.\n* 1343 – First reference to the Hanging Bridge.\n* c. 1350 – Flemish weavers introduce the textile industry.\n* 1368 – Salford Old Bridge is built across the River Irwell connecting with Manchester.\n15th Century\n* 1421 – Thomas la Warre, 5th Baron De La Warre, lord of the manor and rector of Manchester, raises St Mary's into a collegiate church. The adjacent Hanging Bridge is probably also rebuilt at this time.\n* 1465 – Nave of St Mary's Church is begun.\n16th Century\n* 1515 – 2 July: Manchester Grammar School is endowed by Bishop Hugh Oldham, the first free grammar school in England.\n* c. 1538 – The manor of Manchester passes from the De la Warres to the West family.\n* 1552 – The building that becomes the Old Wellington Inn is constructed.\n17th Century\n* 1603 – The plague strikes Manchester. Up to a quarter of the population die.\n* 1620 – Fustian is woven in Manchester for the first time.\n* 1637 – Silk is woven in Manchester for the first time.\n* 1639 – 24 November (Julian calendar): William Crabtree is one of the two first and only scientific observers of a transit of Venus, probably from his home in Broughton.\n* 1642 – July–September: English Civil War – Royalists try to capture Manchester but fail. On 12 July in a scuffle following Lord Strange's initial attempt to seize the militia magazine for the Royalists, Richard Percival, a linen weaver, is killed, reckoned as the first casualty in the war.\n* 1644 – May: Civil War – Prince Rupert of the Rhine and his Royalist army camp at 'Barloe More', near the fort of the River Mersey at Didsbury, en route to the Battle of Marston Moor. A year later, Parliamentary troops under William Brereton muster at the same place.\n* 1654 – 3 September: Major-General Charles Worsley of Rusholme becomes the first Member of Parliament for Manchester in the First Protectorate Parliament.\n* 1656 – Mid: Chetham's Hospital, founded by bequest of Sir Humphrey Chetham (d. 1653) as a school, admits its first poor children; the Chetham's Library opens in the same year as Britain's first free public library.\n* 1687 – 18 May: First known Manchester Racecourse meeting on Kersal Moor.\n* 1694 – 24 June: A Dissenters' Meeting House, the predecessor of Cross Street Chapel, is opened by Henry Newcome.\n18th Century\n1710s\n* 1712 – 17 June: St Ann's Church, sponsored by Ann, Lady Bland, is consecrated.\n* 1715 – Jacobite rising of 1715:\n** Early May: James Stuart is proclaimed King James III in Manchester.\n** 28 May–23 June: 1715 England riots by Jacobites extend to Manchester. On 10 June a mob sacks the Cross Street Chapel in Manchester, going on to destroy others in the area.\n** November: Charles Wills assembles royal troops in Manchester to march against the Jacobites.\n* 1719 – Publication of the first newspaper to be printed in Manchester and the first book, John Jackson's Mathematical Lectures read to the Mathematical Society in Manchester, printed by Roger Adams.\n1720s\n* 1724–1727 – Daniel Defoe's ''A Tour thro' the Whole Island of Great Britain'' is published, describing Manchester as 'one of the greatest, if not really the greatest meer village in England'.\n* 1729 – First Cotton Exchange is built.\n1730s\n* 1730 – Sawyer's Arms first licensed.\n* 1734–6 – Mersey and Irwell Navigation completed up to Manchester, where in 1735 a quay is built on the River Irwell.\n1740s\n* 1745 – 25 November: Jacobite rising of 1745: The rebel army of Prince Charles Edward Stuart enters Manchester on its march into England and a Manchester Regiment of around 300 is raised. On 8 December the forces retreat through Manchester. On both occasions the troops probably ford the River Mersey at Didsbury.\n1750s\n* 1752 – Foundation of what will become the Manchester Royal Infirmary as a cottage hospital in Garden Street, Shudehill, by surgeon Charles White, moving to Lever's Row (Piccadilly) in 1755.\n* 1753 – The first theatre opens in Manchester.\n* 1759 – 23 March: Francis Egerton, 3rd Duke of Bridgewater, is authorised to construct the Bridgewater Canal; he appoints James Brindley as engineer.\n1760s\n* 1760 – Garratt Mill and Meredith's Factory, early cotton mills water powered by the River Medlock, are built and cotton is first exported from Manchester.\n* 1761\n** 17 July: The Bridgewater Canal is opened to bring coal from the Duke of Bridgewater's Worsley Navigable Levels to Stretford.\n** Blackfriars Street footbridge is built across the River Irwell.\n** Approximate date: Cross Street Chapel becomes a Unitarian meeting house.\n* 1763 – Manchester Lunatic Asylum built next to the Infirmary.\n* 1765 – By 1 August: The Bridgewater Canal is extended to Castlefield. The first Duke's Warehouse here is built in 1771.\n1770s\n* 1772\n** Sir Thomas Egerton commissions James Wyatt to rebuild Heaton Hall.\n** First directory of Manchester published, The Manchester Directory by Elizabeth Raffald.\n* 1774/6 – St Chad's Roman Catholic chapel is established in Rook Street.\n* 1775 – 5 June: The first Theatre Royal opens in Spring Gardens.\n* 1777 – 14 September: Manchester is shaken by an earthquake powerful enough ring the bells of several churches.\n* 1778 – Strangeways Brewery is founded by grain merchants Thomas Caister and Thomas Fry.\n1780s\n* 1781\n** 28 February: The Literary and Philosophical Society of Manchester is founded.\n** \"Manchester Infirmary, Lunatic Asylum and Public Baths\" opens near Piccadilly as the country's first public baths.\n* 1782 – Shudehill Mill is opened as a cotton mill by Arkwright, Simpson and Whitenburgh.\n* 1783 – First guidebook to Manchester published, A Description of Manchester by \"a native of the town\", James Ogden.\n* 1785\n** 12 May: James Sadler makes a balloon ascent from Manchester.\n** 17 July: Fairfield Moravian Church is opened in Fairfield, Droylsden. With its surrounding settlement it has been founded by Benjamin La Trobe as a centre for evangelistic work for the Moravian Church in the Manchester area.\n** New Bailey Bridge is completed across the River Irwell connecting with Salford.\n** Borelle Dyeworks established at Blackley.\n* 1786\n** Following dissolution of the Warrington Academy, the Manchester Academy is opened in Mosley Street by Presbyterian Dissenters. It relocates to York between 1803 and 1840, to London in 1853 and to Oxford in 1889.\n** History of the Jews in Manchester: About 14 Jewish families settle in Manchester.\n*1788\n**11 December: First stone of St Peter's Church, Peter Street, is laid.\n1790s\n* 1790\n** By 1 May: Piccadilly Mill in Auburn Street is in operation; owned by Peter Drinkwater, it is the first cotton mill in Manchester to be directly powered by a steam engine. An attempt to introduce power weaving at a Knott Mill factory is resisted by the workers.\n** St Mary's Hospital is founded as the \"Lying-in Charity\" by Dr Charles White in a house in Old Bridge Street, Salford; in 1795 it becomes the Manchester Lying-in Hospital.\n** First Jewish burial ground leased.\n* 1792\n** Manchester and Salford Police Act creates Police Commissioners responsible for providing a night watch and fire engines and for maintaining, cleaning, draining and lighting (by oil) the streets within the ancient township.\n** Workhouse opens in New Bridge Street.\n* 1793 – 15 April: Manchester Penny Post launched, the first such service in the English provinces.\n* 1794\n** 6 September: St. Peter's Church on Peter Street is consecrated.\n** 31 October: John Dalton delivers a pioneering paper on colour blindness (a condition which he has inherited) to the Manchester Literary and Philosophical Society a few weeks after joining.\n** St Mary, Our Lady of the Assumption, Roman Catholic Church dedicated in Mulberry Street.\n** William Green's map of Manchester is published.\n* 1795–7 – The first of the McConnel & Kennedy Mills, a steam powered cotton mill in Ancoats, is built by James M'Connel and James Kennedy.\n* 1796\n** Autumn: The Manchester Bolton & Bury Canal is substantially completed.\n** End: The Ashton Canal opens from Ducie Street through Ancoats.\n* 1797 – Food riots.\n* 1798\n** Old Mill, the first part of the Murrays' Mills cotton mill complex on Redhill Street, Ancoats, is completed, the oldest mill in the city to survive.\n** Nathan Mayer Rothschild moves from Frankfurt in the Holy Roman Empire to England, settling up in business as a textile trader and financier in Manchester.\n* 1799 – Soup kitchens provided.\n19th Century\n1800s\n* 1800 – The Ashton Canal is physically connected with the Rochdale Canal at Piccadilly.\n* 1801 – 10 March: First national census. The population of Manchester is 78,727.\n* 1803\n** 21 October: John Dalton's atomic theory and list of molecular weights are first made known, at a lecture in Manchester.\n** Volunteer militia formed.\n* 1804 – 21 December: The Rochdale Canal opens from Dale Street throughout, the first to cross the Pennines.\n* 1805 – The Rochdale Canal is extended through Deansgate Tunnel to Castlefield.\n* 1806\n** The Portico Library, designed in the Greek Revival style by Thomas Harrison, opens as a subscription library and newsroom; its first secretary is Dr Peter Mark Roget.\n** Galloway, Bowman form a partnership as millwrights.\n* 1807 – 12 July: The second Theatre Royal opens in Fountain Street.\n* 1808 – December: The Manchester Bolton & Bury Canal is physically connected by locks with the river Irwell in Salford.\n* 1809 – c. 4 June: New Cotton Exchange in Market Street opens.\n* 1808 – Regent Bridge is completed across the River Irwell connecting Hulme with Regent Street, Salford.\n1810s\n* 1810\n** Independent Order of Oddfellows Manchester Unity formed.\n** Derryfield is renamed Manchester, New Hampshire, after its English counterpart.\n* 1812 – Food riots in Shudehill and Deansgate.\n* 1814 – Chorlton New Mills, a cotton mill at Chorlton-on-Medlock, is established, the oldest mill of flameproof construction in Manchester to survive.\n* 1815 – The number of cotton warehouses in Manchester's Cottonopolis reaches 1,819.\n* 1816\n** Manchester gains a piped water supply.\n** Manchester Cricket Club is founded.\n* 1817\n** c. 28 February: Foundation stone laid for Strangeways (toll) Bridge across the River Irwell connecting Strangeways with Greengate, Salford.\n** 10 March: The Blanketeers set out to march to London; on 11 March 160 are arrested at Stockport.\n** November: William Fairbairn, who moved to Manchester in 1813, sets up his own business, which becomes the Ancoats ironfoundry and engineering works of William Fairbairn & Sons.\n** The first Manchester gasworks is erected by the Commissioners of Police at St Mary's Parsonage, Water Street, the world's first municipal installation to sell gas to the public; it also provides street lighting.\n* 1818 – First Manchester Golf Club founded.\n* 1819 – 16 August: Peterloo Massacre in St Peter's Field: a cavalry charge into a crowd of protesters results in 15 deaths and over 400 injuries.\n1820s\n* 1820 – The stone Blackfriars Street road bridge across the River Irwell replaces a footbridge.\n* 1821 – 5 May: The Manchester Guardian newspaper is founded by John Edward Taylor and fellow members of the Portico Library and Little Circle.\n* 1822 – Chios massacre and Greek War of Independence lead to establishment of a refugee Greek community in Manchester.\n* 1823\n** 1 October: Royal Manchester Institution established.\n** School for the deaf and dumb established in Stanley Street.\n** Primitive Methodist chapel is opened in Jersey Street, Ancoats\n* 1824\n** 1 January: John Greenwood begins a horsebus service from Pendleton, the first such regular service in the British provinces.\n** 7 April: Mechanics' Institute established, predecessor of the University of Manchester Institute of Science and Technology.\n** 96th Regiment of Foot re-formed in Manchester.\n* 1825\n** 1 January: The Manchester Courier newspaper is founded by Thomas Fowler.\n** Old Town Hall in King Street (begun 1822) completed.\n** St Matthew's Church completed to the design of Charles Barry on Liverpool Road as a Commissioners' church.\n* 1826 – September: Branch of the Bank of England opened in Manchester.\n* 1827\n** Botanical and Horticultural Society founded and establishes a botanical garden at Trafford Park.\n** Approximate date: Little Ireland established as an immigrant community.\n* 1827–28 – Merchants' Warehouse at Castlefield built.\n* 1828 – William Gaskell joins the Unitarian ministry at Cross Street Chapel, where he will serve until his death in 1884. He will be active in social charities, supported by his wife (from 1832), novelist Elizabeth Gaskell.\n1830s\n* 1830\n** Summer: National Association for the Protection of Labour established by John Doherty.\n** 15 September: The Liverpool & Manchester Railway, the world's first purpose built passenger railway operated by steam locomotives, opens officially to Manchester Liverpool Road railway station.\n** Eaton Hodgkinson’s pioneering paper on the optimum cross section for cast iron structural beams, based on his work with William Fairbairn on the design of the Liverpool and Manchester Railways’ Water Street Bridge, is published by the Manchester Literary and Philosophical Society.\n** The twin-hulled iron paddle steamer Lord Dundas is built by Fairbairn & Lillie in Manchester for service on the Forth & Clyde Canal.\n** Manchester Royal Infirmary is granted its \"Royal\" prefix.\n* 1831 – 30 May: National census. The population of Manchester reaches 142,000.\n* 1832\n** 1829-51 cholera pandemic strikes Manchester and kills 674 people. It returns in 1848.\n** Dr James Kay's study The moral and physical condition of the working-class employed in the cotton manufacture on Manchester is published.\n** 8 December–8 January 1833: 1832 United Kingdom general election, the first following the Great Reform Act 1832 (4 June): Manchester elects its first MPs since 1656. Five candidates, including William Cobbett, stand and Liberals Charles Poulett Thomson and Mark Philips are elected.\n** Richard Cobden settles in Manchester to manage his interests in the textile industry.\n* 1833 – Joseph Whitworth begins his precision machine tool manufacturing business in Chorlton Street.\n* 1834\n** Methodist New Connexion church opens in Peter Street\n** Wilson's Brewery established.\n** Approximate date: Inventors Charles Macintosh and Thomas Hancock move the production of their waterproof fabric (used for manufacture of the Mackintosh) to Manchester.\n* 1835\n** Royal Manchester Institution building in Mosley Street completed as a natural history and art museum.\n** Manchester Athenaeum established.\n* 1836\n** June: Belle Vue Zoological Gardens open.\n** 23 September: Esteemed Spanish opera singer Maria Malibran dies in Manchester after collapsing while performing at a music festival here.\n** Manchester and Salford Bank building in Mosley Street completed.\n* 1837\n** First Corn Exchange opens in Hanging Ditch.\n** Manchester Athenaeum building on Princess Street is opened\n* 1838\n** 18 September: The Anti-Corn Law League is founded by Richard Cobden and John Bright in Manchester, embracing the cause of Manchester Liberalism.\n** 1 November: Manchester is incorporated as a municipal borough under the Municipal Corporations Act 1835, following a campaign by Cobden, absorbing Beswick, Cheetham, Chorlton-on-Medlock and Hulme; in December Thomas Potter becomes first mayor.\n** Victoria Bridge is built across the River Irwell on the site of Salford Old Bridge.\n** A statue of chemist and physicist John Dalton (in marble by Sir Francis Chantrey) is erected in Manchester during the scientist's lifetime.\n* 1839\n** 14 July: First section of Manchester & Leeds Railway opens.\n** 19 October: George Bradshaw publishes the first national railway timetable, ''Bradshaw's Railway Time Tables and Assistant to Railway Travelling'', in Manchester.\n** 28 October: Manchester and Salford Junction Canal opens through the centre of Manchester.\n** Upper Brook Street Chapel (Unitarian), designed by Charles Barry, is completed.\n** Harvest House in Mosley Street is built as a textile warehouse for Richard Cobden by Edward Walters in the Italian palazzo style.\n1840s\n* Average age of death among Manchester's working class is 17, a figure driven by the 57% of working-class children dying before their fifth birthday.\n* 1840\n** 4 June: Manchester & Birmingham Railway opens to Stockport.\n** June: The Royal Victoria Gallery for the Encouragement of Practical Science opens as a subscription institution in the Exchange Dining Room; it operates only until 1842.\n** 11 December: Manchester Poor law union is formally declared and takes responsibility for the administration and funding of the Poor Law in the area.\n** The first (temporary) Free Trade Hall is built.\n** Approximate date: Hulme Hall is demolished.\n* 1841\n** 1 March: Opening throughout of the Manchester & Leeds Railway, the first to cross the Pennines.\n** 17 November: First section of Sheffield, Ashton-under-Lyne and Manchester Railway opens.\n** Scientific instrument maker John Benjamin Dancer moves to Manchester and takes the first photographs of it.\n* 1842\n** 10 May: Store Street (modern-day Manchester Piccadilly railway station) is opened by the Manchester & Birmingham Railway.\n** 7–27 August: Riots in and around Lancashire, protesting against the Corn Laws and in favour of Chartists. Manchester is garrisoned by 2,000 troops with field guns.\n** December: Friedrich Engels moves to Manchester to work for the family textile business.\n** The second Free Trade Hall is built.\n* 1843\n** 23 March: The Chetham Society (the oldest historical society in North-West England, and second oldest in the North of England) is founded during a meeting held at Chetham's Library, Manchester.\n** Bridgewater (Chester Road) Viaduct built.\n* 1844\n** 1 January: Manchester Victoria railway station is opened by the Manchester & Leeds Railway; it becomes headquarters of the Lancashire & Yorkshire Railway.\n** 7 March: The second Theatre Royal is destroyed by fire.\n** 27 July: Death of chemist and physicist John Dalton; his body lies in honour in the Town Hall and more than 40,000 people file past his coffin.\n** 26 August: Albert Bridge is completed across the River Irwell on the site of New Bailey Bridge connecting with Salford.\n** Construction of new back-to-back houses is prohibited in Manchester.\n** Benjamin Disraeli's novel Coningsby is published, describing Manchester as 'as great a human exploit as Athens'.\n** Joseph Whitworth introduces the thou measurement.\n* 1845\n** May: Pomona Gardens open as commercial public pleasure grounds.\n** July–August: Karl Marx makes the first of his visits to Friedrich Engels in Manchester; the two study together in Chetham's Library. This year, Engels' The Condition of the Working Class in England, based on his observations in Manchester the previous year, is published in German in Leipzig.\n** 29 September: The third Theatre Royal opens.\n* 1846\n** 22 August: Queen's Park, Hendham Hall, and Philips Park, Clayton together with Peel Park, Salford, open as some of the world's first free public parks.\n** The borough corporation purchases remaining manorial rights from the Mosley family, and also acquires Smithfield Market in Shudehill.\n* 1847 – 1 September: The Anglican Diocese of Manchester is created and the Church of St Mary is elevated to the status of Manchester Cathedral leading to extensive restoration.\n* 1848\n** 18 October: Elizabeth Gaskell's first novel, Mary Barton: A Tale of Manchester Life, is published anonymously.\n** Construction of the Longdendale Chain of reservoirs for Manchester by John Frederick Bateman begins.\n* 1849\n** 20 July–1 August – Manchester, South Junction and Altrincham Railway opens to the public, running out of Oxford Road station on a large brick viaduct through Castlefield, the first suburban railway.\n** Manchester Royal Lunatic Asylum moves from Piccadilly to Cheadle (Heald Green), 19 miles (16&nbsp;km) south.\n1850s\n* 1850 – Belle Vue Gaol opens.\n* 1851\n** 12 March: Owens College, predecessor of the University of Manchester, is established under the bequest of John Owens (merchant), originally at Cobden House, Quay Street.\n** 30 March: 1851 United Kingdom census: The population of Manchester has increased to over 300,000.\n** October: Visit of Queen Victoria.\n* 1852 – 2 September: The public library in Tonman Street is the first in England to offer free lending under the Public Libraries Act 1850.\n* 1853\n** c. January: Boddingtons Brewery takes over the Strangeways Brewery.\n** 29 March: Manchester is granted city status by letters patent.\n** The number of cotton mills in Manchester's Cottonopolis peaks at 108.\n** Westphalian-born conductor Charles Hallé first moves to Manchester to direct the orchestra for Gentlemen's Concerts.\n* 1854\n** 2 September: Elizabeth Gaskell's novel North and South begins publication, set mostly in a fictionalised Manchester.\n** Beyer, Peacock & Company established at Gorton by Charles Beyer, Richard Peacock and Henry Robertson to build steam locomotives.\n* 1855\n** The Manchester Lying-in Hospital moves from Salford to a building in Quay Street erected at the expense of Dr Thomas Radford.\n** Henry Bessemer experiments with his steelmaking process at W & J Galloway's Knott Mill works.\n* 1856 – 8 October: The third (and last) Free Trade Hall (begun 1853) is completed.\n* 1857\n** 5 May–17 October: The Art Treasures of Great Britain exhibition is held in Trafford Park, one of the largest such displays of all time; it is opened by Prince Albert and on 29–30 June visited by Queen Victoria. The orchestra that plays for visitors becomes The Hallé.\n** Manchester Cricket Club moves to Old Trafford Cricket Ground.\n** A new Manchester Union workhouse is built in Crumpsall with accommodation for about 2,000.\n* 1858\n** 19–20 January: High winds cause damage in the city.\n** 30 January: The Hallé gives its first concert as a permanent orchestra under Charles Hallé at the Free Trade Hall.\n** March: First new steam locomotive completed at the Gorton Locomotive Works of the Manchester, Sheffield & Lincolnshire Railway.\n1860s\n* 1861\n** 12 April: The American Civil War breaks out, leading to the Lancashire Cotton Famine (1861–1865).\n** 7 October: The Greek Orthodox Church of the Annunciation, Manchester in Broughton is consecrated as the oldest purpose-built Greek Orthodox Church in England.\n* 1863\n** November: The North of England Co-operative Wholesale Industrial and Provident Society Limited, predecessor of The Co-operative Group, is registered in Manchester.\n** Members of the Hulme Athenaeum Club for working men establish an association football club, believed to be the earliest example in Manchester.\n* 1864 – 15 October: Prince's Theatre opens in Oxford Road.\n* 1865\n** Albert Memorial in Albert Square is completed.\n** Timpson (retailer) opens as a shoe shop in Oldham Road.\n* 1867\n** January: Lydia Becker convenes the first meeting of the Manchester Women's Suffrage Committee, one of the first organisations to promote women's suffrage in the United Kingdom.\n** 23 November: The 'Manchester Martyrs' are hanged in Salford for the murder of a policeman whilst attempting to rescue two Irish Republican Brotherhood members from imprisonment in Manchester on 18 September.\n** Co-op Insurance is established at a meeting held at the Mechanics’ Institute.\n** The Crossley mechanical engineering business is established.\n* 1868\n** 2–6 June: Inaugural meeting of the national Trades Union Congress held at the Mechanics' Institute.\n** 25 June: Strangeways Prison opens. First execution 29 March 1869.\n** 10 October: The Manchester Evening News newspaper is first published.\n** 26 October: The foundation stone of Manchester Town Hall is laid by the Mayor, Robert Neill\n** Approximate date: The mechanical engineering business that becomes L Gardner & Sons is established.\n* 1869 – Arthur Brooke opens his tea merchant's business, Brooke Bond, at 23 Market Street.\n1870s\n* 1870\n** 6 August: Alexandra Park opened to the public.\n** c. 20 September: Friedrich Engels moves permanently to London from Manchester.\n* 1871 – Barton Arcade built.\n* 1872 – 1 January: Charles Prestwich Scott becomes editor of The Manchester Guardian, a position he will hold until 1929.\n* 1874\n** The third Royal Exchange (for cotton dealers) is completed.\n** Manchester High School for Girls opens, originally in Chorlton-on-Medlock, the first girls' school to provide an academic education in northern England.\n** Primitive Methodist chapel in Ancoats relocates to New Islington\n* 1875 – 9 August: The first new school erected by the Manchester School Board is opened in Vine Street, Hulme.\n* 1876 – Isabella Banks' novel The Manchester Man is published.\n* 1877\n** 17 May: The Manchester Suburban Tramways Company begins the first horse tramway service in the city.\n** 9 July: Temporary Manchester Central railway station opens.\n** 13 September: New Manchester Town Hall, designed by Alfred Waterhouse, is officially opened by the mayor, Abel Heywood. The Manchester Murals in the Great Hall are painted by Ford Madox Brown between 1879 and 1893.\n* 1878\n** 26 January: Telephony in Greater Manchester: Telegraph manufacturer Charles Moseley instals a telephone between a hardware merchant (Thomas Hudson Ltd) on Shudehill to company offices on Dantzic Street, the first such telephone in regular use in the country.\n** Henry Gustav Simon establishes the mechanical engineering business that becomes Simon Carves.\n** Establishment of Newton Heath Lancashire & Yorkshire Railway Football Club, the team that will become Manchester United.\n* 1879\n** July or September: Telephony in Greater Manchester: The Lancashire Telephonic Exchange Ltd opens a telephone exchange in Faulkner Street, the first provincial public exchange in Britain.\n** 9 October: Southern Cemetery opens in Withington.\n** School meals provided for destitute and poorly nourished children.\n1880s\n* 1880\n** 20 April: Victoria University chartered and incorporates Owens College.\n** 1 May: The city's first municipal public baths open, New Islington Baths.\n** 1 July: Permanent Manchester Central railway station is officially opened by the Cheshire Lines Committee.\n** 13 November: First recorded football match played by St Marks (West Gorton), the team that will become Manchester City.\n** Lower Campfield Market hall opens to replace the open-air fairs at this site abolished in 1876.\n** Joseph Whitworth's precision machine tool manufacturing business moves to Openshaw.\n* 1881 – 1 July: Manchester Regiment of the British Army formed.\n* 1882\n** Royal Manchester Institution building transferred to the city corporation to form the Manchester Art Gallery.\n** Higher Campfield Market hall opens.\n** The Crossley mechanical engineering business moves to Openshaw.\n* 1883\n** 21 March: The Lancashire and Cheshire Antiquarian Society is founded during a meeting held in the Rooms of the Manchester Literary and Philosophical Society, George Street, Manchester.\n** Women are first admitted to study regularly for degrees at Owens College, initially in arts subjects only.\n* 1884 – A new Gaiety Theatre opens as the Comedy Theatre.\n* 1885\n** 6 August: Manchester Ship Canal, promoted by mechanical engineer Daniel Adamson, is authorised.\n** September: William Morris addresses an open-air meeting in Albert Square on the subject of free speech.\n** Harpurhey, Bradford-with-Beswick and Rusholme are brought within the city boundaries.\n* 1887\n** 3 May: Royal Jubilee Exhibition, is opened by Princess Alexandra, including an 'Old Manchester and Salford' reconstruction.\n** 11 November: Construction of the Manchester Ship Canal begins; the engineer is Edward Leader Williams.\n* 1888 – New Manchester Museum building opens to the public in Oxford Street.\n* 1889\n** 17 February: The Royal Society for the Protection of Birds is founded in Didsbury, originally as \"The Plumage League\" to campaign against the use of plumage in women's clothing.\n** Victoria Square Dwellings (tenement block) built in Sharratt Street, Manchester's first council housing.\n** The Whitworth Art Gallery is founded by solicitor Robert Dukinfield Darbishire using funds bequeathed by Sir Joseph Whitworth as The Whitworth Institute and Park. Whitworth Park opens to the public on 16 June 1890.\n1890s\n* 1890 – Crumpsall, Blackley and Moston, Newton Heath, Clayton, Openshaw and West Gorton are brought within the city boundaries.\n* 1891\n** 5 April: National census. The population of Manchester reaches 505,368.\n** 10 October: The first street charity collection in the UK is held in Manchester in aid of the Royal National Lifeboat Institution.\n* 1892 – 2 October: Manchester Crematorium opens adjacent to the Southern Cemetery, the UK's second crematory.\n* 1893\n** 3 August: Status of Lord Mayor conferred on the mayoralties of Manchester and Liverpool.\n** October: Royal Manchester College of Music, established by Charles Hallé, admits its first students.\n* 1894\n** 1 January: The CWS's SS Pioneer becomes the first commercial ship to use the Manchester Ship Canal, unloading sugar in Manchester docks within the Port of Manchester. The canal is formally opened on 21 May by Queen Victoria.\n** January: Davyhulme Sewage Works begins to treat the city's waste.\n** 16 April: Manchester City F.C. founded (formerly known as Ardwick A.F.C. and West Gorton St. Marks).\n** 28 September: The new partnership of Marks & Spencer opens its first store, in Cheetham Hill Road.\n** 13 October: First water from Thirlmere in the Lake District is delivered to Manchester by the Thirlmere Aqueduct.\n** Corporation hydraulic power supply system begins operation.\n* 1895 – Refuge Assurance Building on the Oxford/Whitworth Street corner, designed by Alfred Waterhouse, opens.\n* 1896\n** 17 August: Trafford Park established as the world's first planned industrial park by fraudulent financier Ernest Terah Hooley.\n** First cinema in Manchester.\n* 1897 – Rebuilt Corn Exchange first opens.\n* 1898 – 3 May: Manchester Liners established.\n* 1899 – Hans Richter is appointed music director of The Hallé, a post which he will hold until 1911.\n20th Century\n1900s\n* 1900\n** 1 January: John Rylands Library officially opens.\n** Summer Olympics in Paris: Osborne Swimming Club of Manchester represent Great Britain in water polo, winning gold.\n* 1901\n** 7 June: Manchester Corporation Tramways begin a public electric service. Winser (Bloom) Street generating station begins operation. The last horse trams run in 1903.\n** 7 October: Hulme Hippodrome opens as Grand Junction Theatre and Floral Hall.\n** Central Higher Grade School opens in Whitworth Street.\n** CWS (Manchester) Band formed as the CWS Tobacco Factory Band.\n* 1902\n**February: The British Cotton Growing Association is founded, based in Manchester\n** 28 April: Manchester United F.C. is formed by John Henry Davies in a name change from Newton Heath, the football club that he recently saved from going out of business.\n** Heaton Park is sold to Manchester City Council by Arthur Egerton, Earl of Wilton, for public recreation. In 1903 it is brought within the city boundaries.\n** British Westinghouse begins manufacture at the Trafford Park industrial estate.\n* 1903\n** 15 July: The Victoria University of Manchester is independently chartered following dissolution of the federal Victoria University; by act of 24 June 1904 Owens College is merged into it.\n** 5 September: The Midland Hotel, Manchester (begun 1898) is opened by the Midland Railway company.\n** 10 October: Foundation of the militant Women's Social and Political Union by Emmeline and Christabel Pankhurst in Manchester.\n* 1904\n** 23 April: 1904 FA Cup final: Manchester City beat Bolton Wanderers at Crystal Palace in London, becoming the first Manchester side to win a major trophy.\n** 4 May: Charles Rolls and Henry Royce meet for the first time at the new Midland Hotel, Manchester; the first Rolls-Royce motor cars produced under their joint names in Manchester are launched in December.\n** Moss Side, Chorlton-cum-Hardy, Withington, Burnage and Didsbury (all to the south) are brought within the city boundaries.\n** Ardwick Empire (later, Hippodrome) opens as a music hall.\n** Marie Stopes becomes the first woman academic member of staff of the University of Manchester as lecturer in Palaeobotany.\n* 1905\n** 13 July: Manchester Ship Canal Dock No. 9 opens on the site of Manchester Racecourse at New Barns.\n** 13 October: Annie Kenney and Christabel Pankhurst interrupt a Liberal Party rally at the Free Trade Hall and choose imprisonment when convicted, the first militant action of the national suffragette campaign.\n* 1906\n** February: Manchester Corporation Tramways begin motor bus services.\n** 7 September: Victoria Baths open.\n* 1907\n** 20 May: White City Amusement Park established on part of the botanical garden site.\n** 5 November: Corpus Christi Priory opened in Miles Platting by Premonstratensians.\n** New Zealander Ernest Rutherford becomes chair of the Physics Department at Victoria University. The following year he is awarded the Nobel Prize in Chemistry \"for his investigations into the disintegration of the elements, and the chemistry of radioactive substances\".\n** St Peter's Church, Peter Street, is demolished.\n* 1908\n** 18 April: Manchester United secure the Football League First Division title - the first major trophy of their history.\n** 29 July: The Whitworth Art Gallery building is formally opened.\n** 9 November: Annie Horniman purchases the Comedy Theatre; she has it reconstructed to plans by Frank Matcham and it reopens in 1912 as the Gaiety Theatre, Britain's first regional repertory theatre. She champions contemporary dramatists of the Manchester School.\n** 3 December: The Hallé gives the world première of Elgar's Symphony No. 1 under Hans Richter at the Free Trade Hall.\n** The Catenian Association, an international Roman Catholic lay brotherhood, is founded in Manchester.\n** Vimto is invented by John Noel Nichols in Manchester. Originally sold under the name Vimtonic, Nichols shortens it to Vimto in 1912.\n* 1909 – Gorton and Levenshulme are brought within the city boundaries.\n1910s\n* 1910\n** 1 January: Eccles-born Alliott Verdon Roe and his brother Humphrey establish the Avro aircraft factory at Brownsfield Mill in Great Ancoats Street.\n** 19 February: Manchester United F.C. play their first game at Old Trafford.\n** 28 April: Frenchman Louis Paulhan completes the Daily Mail's 1910 London to Manchester air race in under 24 hours.\n** Kings Hall at Belle Vue Zoological Gardens opens\n** Manchester Royal Infirmary moves from Piccadilly to Oxford Road.\n* 1911 – 11 October: The Ford Motor Company assembles its first Model T automobile at its plant on the Trafford Park industrial estate.\n* 1912\n** 26 December: Manchester Opera House opens as the New Theatre in Quay Street.\n** The old town hall in King Street is demolished.\n* 1913\n** 3 April: Three suffragettes – Lillian Williamson, Annie Briggs and Evelyn Manesta – smash the glass in more than a dozen paintings in Manchester Art Gallery.\n** 11 November: Suffragette Kitty Marion plants a bomb that destroys the cactus house in Alexandra Park.\n* 1914\n** 4 August: Manchester Babies Hospital opened.\n** 7 August: Manchester Municipal Secondary School for Boys taken over as headquarters of Second Western General Hospital for the military.\n* 1915 – Manchester Corporation Tramways begins to employ conductresses due to the wartime shortage of men.\n* 1917 – Nuclear fission: Ernest Rutherford, at the Victoria University of Manchester, achieves nuclear transmutation, the first observation of a nuclear reaction, in which he also discovers and names the proton.\n* 1919\n** 14–15 June: Transatlantic flight of Alcock and Brown: Manchester-born John Alcock and Manchester-raised Arthur Whitten Brown make the first nonstop transatlantic flight.\n** The Avro aircraft factory moves to purpose-built premises at Newton Heath.\n** H. H. Johnson joins the Unitarian ministry at Cross Street Chapel, where he will introduce \"wayside pulpit\" messages to the UK.\n** Citizens of Manchester support postwar reconstruction of Charleville-Mézières in France.\n1920s\n* 1921 – Rebuilding of the Royal Exchange (for cotton dealers) is completed.\n* 1922 – 15 November: The British Broadcasting Company begins regular radio broadcasts from its Manchester station 2ZY at the Metropolitan-Vickers works in Trafford Park. It broadcasts the BBC's first children's programme. The 2ZY Orchestra, predecessor of the BBC Philharmonic, is formed.\n* 1923 – 25 August: Manchester City F.C. play their first game at Maine Road in Moss Side, having moved from Hyde Road (stadium).\n* 1924 – 12 July: Manchester Cenotaph, designed by Sir Edwin Lutyens, is unveiled.\n* 1926\n** 3–12 May: 1926 United Kingdom general strike: Major disruption to public transport.\n** 24 July: Greyhound racing meeting at Belle Vue Stadium, the first track in Britain.\n** Manchester City Council buys land which at this time is beyond its southern boundary to construct the Wythenshawe housing estate.\n* 1927 – 1 August: Nesta Wells becomes police surgeon (specifically to examine women and children) for Manchester City Police, the first woman appointed to this office in the UK.\n* 1928 – 16 July: First motorcycle speedway meeting at White City.\n* 1929\n** 22 April: Manchester (Wythenshawe) Aerodrome opens for temporary use, Britain's first municipal airport.\n** 1 July: C. P. Scott retires after 57½ years as editor of The Manchester Guardian and is succeeded by his son, Ted.\n** Manchester Victoria and Exchange railway stations are linked by a platform 2238&nbsp;ft (682 m) long.\n1930s\n* 1930\n** 29 January: Barton Aerodrome opens, Britain's first permanent municipal airport; it will become City Airport & Heliport.\n** First greyhound racing meeting at White City.\n** The academic economics journal The Manchester School is first published by the University of Manchester.\n* 1931\n** 26 April: National census. The population of Manchester reaches an all-time peak of 766,311.\n** 11 May: Full electrified passenger train services begin on the Manchester, South Junction and Altrincham Railway.\n** The parishes of Northenden, Baguley and Northen Etchells, beyond the River Mersey and previously in Bucklow Rural District in Cheshire, are brought within the city boundaries.\n** Parker Street bus station opens in Piccadilly Gardens.\n* 1934\n** 3 March: Record attendance for an English association football club ground of 84,569 is set at an FA Cup sixth round match between Manchester City and Stoke City at Maine Road.\n** 17 July: The circular Manchester Central Library, designed by Vincent Harris, is opened; on the same day the foundation stone for the same architect's adjacent Manchester Town Hall Extension is laid.\n** The Northern Studio Orchestra is renamed the BBC Northern Orchestra.\n* 1935\n** 7 March: Sergei Rachmaninoff gives the English première of his Rhapsody on a Theme of Paganini with The Hallé under Nikolai Malko at the Free Trade Hall.\n** 18 August: Last service held in Mardale church in the Lake District prior to the village's flooding to create Manchester Corporation's Haweswater Reservoir.\n* 1937\n** 16 July: Manchester City Police Headquarters, designed by the Manchester City Architect G. Noel Hill, is opened.\n** Church of St Michael and All Angels, Northenden, designed by Nugent Cachemaille-Day, is completed.\n* 1938\n** 1 March: Trolleybuses in Manchester first operate.\n** 25 June: Manchester Airport at Ringway opens.\n** Manchester Town Hall Extension, designed by Vincent Harris in 1927, is completed\n* 1939\n** Daily Express Building, designed by engineer Sir Owen Williams, is completed.\n** 1 September: \"Operation Pied Piper\": evacuation of children from Manchester and other major UK cities begins.\n1940s\n* 1940 – 22–24 December: Heaviest raids of the Manchester Blitz by the Luftwaffe. 363 are killed and 1,183 wounded; Cross Street Chapel is destroyed; the Free Trade Hall is gutted; and the Cathedral, Royal Exchange and Boddingtons Brewery are badly damaged. Public transport in the city centre is temporarily suspended.\n* 1941\n** 9 January: The Avro Manchester Mark III BT308, prototype of the Avro Lancaster heavy bomber, first flies, from RAF Ringway.\n** 11 March: German air raids cause further extensive damage to the city, a notable casualty being Old Trafford football stadium, home of Manchester United F.C., which is severely damaged.\n** June\n*** From now until 23 March 1946, 30,400 Rolls-Royce Merlin aircraft engines are manufactured in the Ford shadow factories at Trafford Park.\n*** Noël Coward's comedy Blithe Spirit is premiered at Manchester Opera House prior to opening in London.\n* 1943 – John Barbirolli is appointed principal conductor of The Hallé, a post which he will hold until 1968.\n* 1944 – 24 December: Fifty German V-1 flying bombs, air-launched from Heinkel He 111 bombers flying over the North Sea, target the Manchester area.\n* 1945 – 1 October: Matt Busby takes over as manager of Manchester United F.C., a post which he will hold until 1971 (with a break in 1969/70).\n* 1947 – Mary Latchford Kingsmill Jones becomes the first woman Lord Mayor of Manchester.\n* 1948\n** 17 January: All-time highest attendance for an English Football League game as 83,260 people watch Manchester United draw with Arsenal in a match played at Maine Road.\n** 18 March: Release of first film produced at Mancunian Films' Dickenson Road Studios, a former Methodist chapel in Rusholme, Cup-tie Honeymoon.\n** 24 April: Manchester United defeat Blackpool 4–2 in the 1948 FA Cup Final at Wembley Stadium.\n** 21 June: World's first working program run on an electronic stored-program computer, the Manchester Baby.\n* 1949\n** 9 January: Manchester Corporation Tramways last run a regular service.\n** April: The Manchester Mark 1 computer is operable at the University of Manchester.\n** 24 August: Old Trafford football stadium, home of Manchester United F.C., is re-opened following a comprehensive rebuild due to bomb damage by the Luftwaffe eight years ago.\n1950s\n* 1950 – Manchester Chorlton Street coach station opens.\n* 1950s – Some music students in Manchester informally constitute New Music Manchester.\n* 1951\n** February: Ferranti deliver their first Mark 1 computer to the University of Manchester. It is the world's first commercially available general-purpose electronic computer.\n** The Free Trade Hall, rebuilt after bomb damage, reopens as a concert venue.\n** Future architect Norman Foster begins work as an office junior in Manchester Town Hall.\n* 1952\n** 29 September: The Manchester Guardian prints news, rather than advertisements, on its front page for the first time.\n** The first autocode and its compiler are developed by Alick Glennie for the Manchester Mark 1 computer, considered as the first working high-level compiled programming language.\n* 1953\n** 15 August: Irk Valley Junction rail crash: 10 killed.\n** Tom Kilburn at the University of Manchester completes a device called MEG, which performs floating-point calculations. This machine evolves into the first transistorized computer, the Metropolitan-Vickers MV950, ultimately leading to the mass production of computers.\n* 1954\n** 14 June: The Manchester–Sheffield–Wath electric railway is inaugurated by the Eastern Region of British Railways out of London Road station, Britain's first all-electric main line (official opening 14 September); the locomotives have been built at Gorton Locomotive Works and Dukinfield with electrical equipment by Metropolitan-Vickers.\n** 21 December: Manchester Corporation v. Manchester Palace of Varieties Ltd, the only case held in the High Court of Chivalry in 200 years.\n** Excavation of Guardian telephone exchange as an underground Cold War facility largely completed; on 7 December 1958 it begins to function as an exchange.\n* 1955 – 29 July: The Manchester Municipal College of Technology is chartered as an independent university-level institution, Manchester College of Science and Technology.\n* 1956\n** 3 May: Granada Television launches.\n* 5 May: Manchester City F.C. beat Birmingham City 3-1 at Wembley. Bert Trautmann, the Manchester City goalkeeper famously played the last twenty minutes with a broken neck.\n** 12 September: Manchester United F.C. become the first English team to compete in the European Cup, a competition for the champions of domestic leagues across Europe, when they play the first leg of the preliminary round in Belgium, beating R.S.C. Anderlecht 2–0.\n** 6 October: Bobby Charlton makes his first team debut for Manchester United F.C.; he will make 759 appearances and score 249 goals for the team.\n** First Ferranti Pegasus computer manufactured.\n* 1957 – 14 March: British European Airways Flight 411 operated by a Vickers Viscount 701 inbound from Amsterdam crashes into houses in Shadow Moss Road, Woodhouse Park, Wythenshawe, while on final approach to Runway 24 at Manchester Airport. All 20 onboard and two people on the ground are killed; the crash is due to a flap failure caused by fatigue of a wing bolt.\n* 1958 – 6 February: Munich air disaster: 8 Manchester United F.C. players are among the 23 killed.\n1960s\n* 1960\n** 12 September: The London Midland Region of British Railways inaugurates electrified passenger train services to London Road, rebuilt and renamed Manchester Piccadilly station, from Crewe and officially opens the reconstructed Manchester Oxford Road railway station.\n** 9 December: The first episode of soap opera Coronation Street, made by Granada Television in Manchester, is aired on ITV; the series will still be running as of 2022.\n*1961 – 12 July: Yuri Gagarin appears on the Manchester Town Hall balcony to a rapturous reception.\n* 1962\n** 21 October: The first American Folk Blues Festival European tour plays its only UK date at the Free Trade Hall; artists include Sonny Terry, Brownie McGhee and T-Bone Walker. It will be influential on the British R&B scene, with the audience including Mick Jagger, Keith Richards and Brian Jones of The Rolling Stones with Jimmy Page, John Mayall and other musicians, and with a second show filmed and shown on ITV.\n** 22 October: Manchester Ringway Airport opens the first hub and pier terminal in Europe.\n** The CIS Tower, designed by G. S. Hay and Gordon Tait, is completed, becoming the tallest building in the United Kingdom until 1963.\n** The city is twinned with Saint Petersburg in the Soviet Union.\n* 1963\n** 12 July: First of the \"Moors murders\".\n** 9 November: Manchester Racecourse at Castle Irwell holds its last meeting.\n* 1964 – 13 August: Gwynne Owen Evans is hanged at Strangeways Prison for the murder of John Alan West, one of the two last executions to take place in the British Isles.\n* 1965\n** 7 October: Last of the \"Moors murders\"; Ian Brady is arrested the following day and Myra Hindley a few days later. They are convicted on 6 May 1966 of the murders of three of their five Manchester child victims.\n** The Piccadilly Plaza development at Piccadilly Gardens (including the Sunley House tower block and an hotel) is completed.\n* 1966\n** 3 January: The London Midland Region of British Railways inaugurates full electrified passenger train services throughout from London Euston to Manchester Piccadilly.\n** 5 May: The Mancunian Way elevated motorway section of the A57 road is officially opened (by the Prime Minister) to form a by-pass around the south of the Manchester city area.\n** 17 May: Bob Dylan and the Hawks perform at the Free Trade Hall. Dylan is booed by the audience because of his decision to play the second half with an electric band, culminating in a famous shout of \"Judas\".\n** July: Beyer, Peacock & Company deliver their last (diesel) locomotive.\n** 31 December: Trolleybuses in Manchester last operate.\n** Manchester College of Science and Technology is renamed University of Manchester Institute of Science and Technology.\n* 1967\n** 4 June: Stockport air disaster: British Midland Canadair C4 Argonaut G-ALHG on a charter flight from Palma de Mallorca crashes in Stockport on approach to Manchester Airport due to technical failures; 72 are killed and the remaining 12 on board are seriously injured.\n** Manchester Chorlton Street coach station reopens with a multi-storey car park on its upper levels.\n* 1968\n** 29 May: Manchester United become the first English winners of the European Cup, beating Benfica 4–1 in extra-time at Wembley Stadium.\n** July: Cotton trading at the Royal Exchange ceases.\n** 5 November: Manchester Liners' MV Manchester Challenge begins a regular Manchester–Montreal service, the first British-built and -owned oceanic cellular container ship.\n* 1969\n** 1 April: Co-ordination of bus and other public transport in the area is passed to the SELNEC Passenger Transport Authority.\n** 5 May: Manchester Central and Manchester Exchange railway stations are closed.\n** 20 October: The North Western Museum of Science and Industry, predecessor of the Museum of Science and Industry, opens in the former Oddfellows Hall in Grosvenor Street.\n** Chetham's Hospital becomes Chetham's School of Music.\n1970s\n* 1970\n** 3 July: Dan-Air Flight 1903 from Manchester Airport crashes in the Catalan mountains with the loss of all 112 on board.\n** 10 September: BBC Radio Manchester opens as a local station.\n** Manchester Polytechnic formed.\n* 1972\n** c. 19 July: The John Rylands Library merges with the University of Manchester Library to form the John Rylands University Library of Manchester.\n** Hulme Crescents completed.\n* 1973\n** 8 September: A Provisional Irish Republican Army bomb explodes in Manchester.\n** October: The Royal Manchester College of Music merges with the Northern School of Music to form the Royal Northern College of Music.\n* 1974\n** 1 April: The City of Manchester becomes a metropolitan borough of the new Greater Manchester County Council under terms of the Local Government Act 1972. Ringway and Manchester Airport are brought within the city boundaries. Police forces covering the area are merged into Greater Manchester Police and the SELNEC Passenger Transport Executive becomes the Greater Manchester Passenger Transport Executive.\n** 2 April: Piccadilly Radio begins broadcasting.\n* 1975\n** Manchester Arndale shopping centre opens; a bus station opens here on 24 September 1979.\n** Poetry publisher Carcanet Press moves into Manchester.\n* 1976 – 15 September: Royal Exchange Theatre opens.\n* 1977\n** 11 September: Belle Vue Zoological Gardens close as a zoo, continuing until 26 October 1980 as an amusement park.\n** Restoration and cleaning of Albert Memorial in Albert Square is completed.\n* 1979\n** 8 May: A major fire at Woolworths Manchester Piccadilly Gardens store takes place resulting in the deaths of eleven people.\n** 27 May: Museum of Transport opens to the public as a museum of local public transport in the former Queen's Road (Boyle Street) bus garage in Cheetham Hill (official opening 4 May).\n** Castlefield is designated as a conservation area.\n1980s\n* 1981 – 8–11 July: 1981 Moss Side riot.\n* 1982\n** May: Rock band The Smiths formed.\n** 21 May: The Haçienda opens as a nightclub in Whitworth Street.\n** 31 May: Pope John Paul II's visit to the United Kingdom: 200,000 attend Mass at Heaton Park.\n** Salford Docks closed to shipping; the area will be redeveloped as Salford Quays.\n** White City Stadium closed; the area will be redeveloped as a retail park.\n** The BBC Northern Orchestra is renamed the BBC Philharmonic.\n* 1983\n** 15 September: Museum of Science and Industry opens at the Liverpool Road station site with the Air and Space Museum in the adjacent Lower Campfield Market hall.\n** The city is twinned with Karl-Marx-Stadt (Chemnitz) in East Germany.\n** Rock band The Stone Roses are formed.\n* 1984\n** March: Manchester Jewish Museum opens in the former Sephardic Synagogue on Cheetham Hill Road.\n** Graham Stringer becomes Labour leader of Manchester City Council, serving until 1996.\n* 1985\n** 22 August: British Airtours Flight 28M, a Boeing 737 bound for Corfu catches fire on the runway at Manchester Airport due to technical failure; 55 killed.\n** 3 October: Cornerhouse opens as a contemporary arts venue.\n* 1986\n** 21 March: G-Mex Centre opens as an exhibition and concert venue in the former Manchester Central railway station trainshed.\n** 6 November: Alex Ferguson takes over as manager of Manchester United F.C., a post which he will hold until 2013.\n** The Chinese Arts Centre, later the Centre for Chinese Contemporary Art, originates as Chinese View '86 and the city is twinned with Wuhan in the People's Republic of China.\n* 1988\n** 16 May: British Rail opens the Windsor Link Line between Salford and Deansgate, connecting railway services across Manchester.\n** 30 June: Formation of the Central Manchester Development Corporation (dissolved in 1996) to kick-start regeneration of the city centre.\n** 3 September: At midday, local station Piccadilly Radio splits into two services. Piccadilly Radio is relaunched as an oldies station on MW called Piccadilly Gold with a new station, Key 103, launching on FM.\n1990s\n* 1990\n** 1–25 April: 1990 Strangeways Prison riot.\n** 18 September: Manchester's is one of the losing bids for the 1996 Summer Olympics.\n* 1991\n** c. 20 May: Control of Manchester Ship Canal passes to The Peel Group.\n** 18 August: Rock band Oasis play their first gig, at the Boardwalk club.\n* 1992\n** 6 April: Manchester Metrolink light rail system opens for public service on its first stage over the former railway line from Manchester Victoria station to Bury Interchange; on 27 April the second stage, to G-Mex, opens, the first street running new-generation light rail route in Britain (official opening 17 July).\n** 12 April: Manchester United F.C. win the Football League Cup for the first time with a 1–0 win over Nottingham Forest in the Wembley final. Brian McClair scores the only goal of the game.\n** 15 September: Manchester Polytechnic, in common with most British polytechnics, is granted the power to award degrees in its own right, giving it the status of a new university, Manchester Metropolitan University.\n** 3 December: 1992 Manchester bombing: two Provisional Irish Republican Army bombs explode.\n* 1993 – 23 September: Manchester's is one of the losing bids for the 2000 Summer Olympics.\n* 1994\n** 31 March: GM Buses North and South are sold, initially in management/employee buyouts.\n** 27 May: The People's History Museum opens to the public in the former Water Street hydraulic pumping station.\n** University of Manchester Institute of Science and Technology achieves the status of an independent University with its own degree awarding powers.\n* 1995\n** 26 May: Pomona Lock opens connecting the Manchester Ship Canal with the Bridgewater Canal.\n** 15 July: Manchester Arena opens at Victoria station.\n* 1996\n** 15 June: 1996 Manchester bombing: A 1500&nbsp;kg lorry bomb planted by the Provisional Irish Republican Army in Corporation Street devastates the city centre but the area is evacuated in time to avoid fatalities.\n** 11 September: Bridgewater Hall opens as an orchestral concert venue. The Free Trade Hall closes this year as a public venue and is subsequently redeveloped as an hotel.\n* 1997\n** 10 May: Hulme Arch Bridge opened.\n** The Spinningfields development begins.\n** The city is twinned with Faisalabad in Pakistan.\n* 1998 – 10 September: Trafford Centre retail complex opens.\n* 1999\n** 26 May: Manchester United F.C. complete a continental treble (association football).\n** November: Shambles Square is completed.\n21st Century\n2000s\n* 2000\n** 14 February: Local television comes to Manchester with the launch of Channel M.\n** October: Final section of M60 Manchester Outer Ring Road opens (Denton–Middleton), the last new publicly funded motorway in Britain.\n** 12 October: The Lowry art gallery and theatre complex opens in Salford Quays.\n** 9 November: The Printworks leisure and entertainment complex opens in Withy Grove.\n* 2002\n** 5 July: Imperial War Museum North, designed by Daniel Libeskind, opens in Trafford Park.\n** 25 July: The City of Manchester Stadium opens, inaugurating the 2002 Commonwealth Games (which continue until 4 August).\n** 21 October: Largest earthquake in a swarm to hit Manchester.\n** Piccadilly Gardens remodelling completed.\n* 2003\n** 10 August: Manchester City F.C. play their first match at the City of Manchester Stadium, having moved from Maine Road.\n** 29 September: A 15-year-old orphaned girl dies while in the care of Manchester social services, following which Greater Manchester Police launches 'Operation Augusta' which identifies at least 57 children at risk of sexual abuse and up to 97 possible abusers, but which is prematurely closed down.\n** One Piccadilly Gardens office block opens.\n* 2004\n** 29 March: A fire in the Guardian telephone exchange causes 130,000 telephone lines to be cut off.\n** August: The annual gay pride event in the city is first officially known as Manchester Pride.\n** 1 October: Victoria University of Manchester and University of Manchester Institute of Science and Technology merge to form a new University of Manchester. The John Rylands University Library of Manchester merges with the Joule Library of UMIST to form the John Rylands University Library.\n** 22 October: Publication of the rediscovery, isolation and characterization of graphene by Andre Geim and Konstantin Novoselov at the University of Manchester.\n* 2005 – 12 January: Britain's tallest self-supporting sculpture, the \"B of the Bang\", is unveiled in Manchester.\n* 2006 – 9 October: Opening of the Beetham Tower, a landmark 168-metre 47-storey skyscraper with oversailing upper floors designed by Ian Simpson of SimpsonHaugh and Partners, the tallest building in the UK outside London at this time, and with its penthouse apartments (above the Hilton Hotel) being the highest residential addresses in the country.\n* 2007\n** 28 June–15 July: Inaugural Manchester International Festival.\n** 24 October: Manchester Civil Justice Centre, designed by Denton Corker Marshall, opens in Spinningfields (officially 28 February 2008).\n* 2008 – 1 August: The Manchester College is established by merger of City College and Manchester College of Arts and Technology to form the largest further education college in the UK\n2010s\n* 2010 – 1 July: Nancy Rothwell becomes the first woman President and Vice-Chancellor of the University of Manchester.\n* 2011\n** 1 April: Greater Manchester Combined Authority established. Its subsidiary Greater Manchester Passenger Transport Executive becomes Transport for Greater Manchester.\n** 9–10 August: 2011 England riots spread to parts of Manchester.\n** EventCity is opened as an exhibition venue in TraffordCity by The Peel Group.\n* 2012\n** 16 April: After 12 years on air, Channel M closes.\n** Summer: The John Rylands University Library is renamed as the University of Manchester Library.\n** 18 September: Two female police officers are killed in Hattersley in a gun and grenade attack by quadruple murderer Dale Cregan.\n* 2013 – 6 November: TNT Post begins door-to-door deliveries in Manchester.\n* 2014 – 3 November: The Airport Line (Manchester Metrolink) opens to Manchester Airport station.\n* 2017\n** 26 February: Manchester Metrolink Second City Crossing opens throughout.\n** 4 May: Andy Burnham becomes the first Mayor of Greater Manchester.\n** 22 May: Manchester Arena bombing: A Manchester-born suicide bomber kills 22 as young people leave an Ariana Grande concert at the Manchester Arena.\n** 10 December: The Ordsall Chord is opened. It provides a direct rail link between  and Manchester Oxford Road and  for the first time.\n* 2018 – November: Topping out of South Tower in Deansgate Square, a 200.5-metre residential development surpassing Beetham Tower as the tallest building in the UK outside London.\n* 2019\n**4-21 July: Manchester International Festival\n**23 September: Manchester child sex abuse ring members sentenced.\n**November: Manchester Museum returns 43 secret sacred and ceremonial items from Aboriginal Australians and Torres Strait Islanders communities to Australia.\n2020s\n* 2020\n** 23 March: COVID-19 pandemic in the United Kingdom: Manchester goes into a nationwide lockdown.\n** 18 December: The Chief Constable of Greater Manchester Police resigns after publication of a critical report on its failure to record crimes.\n* 2023\n**10 June: Manchester City F.C. win the Champions League final to complete the \"Treble\" along with the English Premier League and the F.A.Cup treble (association football).\n** c. 28 June: Factory International arts venue opens as Aviva Studios for previews (officially 18 October).\n** 17 September: The Bee Network, an integrated route network for Greater Manchester composed of bus, tram, cycling and walking routes, is launched with the start of franchised bus services across the city region. The three-phase roll-out of bus franchising will be completed by 2025. Manchester is the first area of the UK to introduce such a system which is seen as a part-reversal of bus deregulation in Great Britain which took place in the mid-1980s. The network's main goal is to reduce the percentage of car journeys throughout the region from 60% to 50% by 2040.\n* 2024\n** 24 March: Bee Network bus franchising extended to areas on the north side of Manchester.\n** 14 May: Co-op Live, the UK's largest-capacity indoor arena, officially opens in Manchester following several postponements.\n** 19 May: Manchester City F.C. win the Premier League title for the fourth consecutive time, an unprecedented feat in English top flight football.\nBirths\n* 1580 – 10 July: Humphrey Chetham, merchant and philanthropist (d. 1653)\n* 1585 – Ambrose Barlow, Benedictine monk (martyred 1641)\n* 1622 – 24 June: Charles Worsley, Parliamentary soldier and politician (d. 1656)\n* 1692 – 29 February: John Byrom, poet and inventor of a shorthand system (d. 1763)\n* 1785 – 15 August: Thomas De Quincey, essayist (d. 1859)\n* 1790 – John Owens, merchant (d. 1846)\n* 1800 – 24 January: Edwin Chadwick, social reformer (d. 1890)\n* 1805 – 4 February: W. Harrison Ainsworth, historical novelist (d. 1882)\n* 1817 – 23 January: John Cassell, publisher, entrepreneur and social reformer (d. 1865)\n* 1827 – 24 February: Lydia Becker, suffragist (d. 1890)\n* 1844 – 26 February: Annie Swynnerton, née Robinson, ARA, painter (d. 1933)\n* 1849 – 24 November: Frances Hodgson Burnett, children's novelist (d. 1924)\n* 1852 – 4 July: George Garrett, clergyman and pioneer submarine designer (d. 1902)\n* 1856 – 18 December: J. J. Thomson, physicist, recipient of the Nobel Prize in Physics (d. 1940)\n* 1858 – 15 July: Emmeline Pankhurst, née Goulden, suffragette (d. 1928)\n* 1863 – 17 January:\n** Janet Achurch, actress (d. 1916)\n** David Lloyd George, Liberal politician and Prime Minister of the UK (d. 1945)\n* 1864 – 26 January: Wynford Dewhurst, Impressionist painter (d. 1941)\n* 1865 – 12 October: Arthur Harden, biochemist, recipient of the Nobel Prize in Chemistry (d. 1940)\n* 1873 – 8 November: Louise Kirkby Lunn, contralto (d. 1930)\n* 1876 – 17 April: John Hay Beith, writer (d. 1952)\n* 1880 – 22 September: Christabel Pankhurst, suffragette (d. 1958)\n* 1882 – 5 May: Sylvia Pankhurst, suffragette (d. 1960)\n* 1885\n** 19 June: Adela Pankhurst, suffragette (d. 1961)\n** 6 November: Frank Kingdon-Ward, botanist (d. 1958)\n* 1887 – 1 November: L. S. Lowry, painter (d. 1976)\n* 1888 – 2 April: Neville Cardus, cricket writer and music critic (d. 1975)\n* 1891 – 8 October: Ellen Wilkinson, Labour politician (d. 1947)\n* 1892 – 5 November: John Alcock, pioneer aviator (k. 1919)\n* 1893 – 30 June: Harold Laski, political and economic theorist (d. 1950)\n* 1900 – 7 September: Taylor Caldwell, novelist (d. 1985)\n* 1904 – Eleanor Schill, physician (d. 2005)\n* 1905 – 18 March: Robert Donat, film actor (d. 1958)\n* 1907 – 9 December: Ernest Marples, Conservative politician (d. 1978)\n* 1911\n** 2 January: Sunny Lowry, distance swimmer (d. 2008)\n** 1 June: Benny Rothman, political activist (d. 2002)\n* 1912\n** 1 October: Kathleen Ollerenshaw, mathematician and Lord Mayor of Manchester (d. 2014)\n** 5 November: Paul Dehn, screenwriter and poet (d. 1976)\n* 1914\n** 15 January: Harold Lever, Labour politician (d. 1995)\n** 10 May: Richard Lewis, tenor (d. 1990)\n* 1915 – 24 October: Marghanita Laski, writer (d. 1988)\n* 1917 – 25 February: Anthony Burgess, novelist (d. 1993)\n* 1919 – 13 May: Michael Mills, television producer (d. 1988)\n* 1928 – 28 June: Harold Evans, newspaper editor (d. 2020)\n* 1930\n** 13 August: Bernard Manning, comedian\n** 26 September: Joe Brown, climber (d. 2020)\n* 1931 – 2 February: Les Dawson, comedian (d. 1993)\n* 1942\n** 3 January: John Thaw, television actor (d. 2002)\n** 18 May: Nobby Stiles, international footballer (d. 2020)\n** 25 August: Howard Jacobson, comic novelist\n* 1945 – 30 December: Davy Jones, pop singer (d. 2012)\n* 1948\n** 16 May: Judy Finnigan, television presenter\n** 23 July: Michael Wood, historian\n* 1950 – 22 February: Genesis P-Orridge, né Neil Megson, singer-songwriter and performance artist (d. 2020)\n* 1956\n** 7 May: Nicholas Hytner, theatre director\n** 15 July: Ian Curtis, post-punk singer-songwriter (suicide 1980)\n* 1959 – 22 May: (Steven) Morrissey, rock singer\n* 1960 – 29 August: Susan Bailey, child psychiatrist\n* 1963 – 31 October: Johnny Marr, rock musician\n* 1967 – 29 May: Noel Gallagher, rock musician\n* 1972 – 21 September: Liam Gallagher, rock musician\n* 1974 – 10 October: Lucy Powell, Labour politician\n* 1979 – 22 September: Rebecca Long-Bailey, Labour politician\n* 1988 – 12 August: Tyson Fury, heavyweight boxer\n* 1997 – 31 October: Marcus Rashford, footballer\nSee also\n* History of Manchester\nReferences\nSources\n*\n*\n*\nFurther reading\n;Published before 1900\n*\n*\n*\n*\n*\n;Published in the 1900s\n*\n*\n*\n*\n*\n;Published in the 2000s\n*\n*\n*\n*\n*"
    }
  ]
}