{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the George W. Bush presidency (2005)\n\nThe following is a timeline of the presidency of George W. Bush, from January 1, 2005 to December 31, 2005.\nJanuary\n*January 1 – President Bush delivers a radio address in regards to the relief of tsunamis on New Year's Day.\n*January 2 – President Bush issues a statement on the passing of Bob Matsui the previous day.\n*January 3 – President Bush is joined by former Presidents George H. W. Bush and Bill Clinton while in the Roosevelt Room as he announces the two will be involved with relief efforts.\n*January 5 – President Bush delivers a speech on medical liability reform at the Gateway Center in Collinsville, Illinois during the afternoon.\n*January 6 – In a joint session of the United States Congress, the results for the electoral college are counted. In his role as President of the Senate, Vice President Dick Cheney reads the results and declares President Bush as the winner of the 2004 presidential election.\n*January 6 – President Bush meets with congressional members to discuss reform of class-action in the Cabinet Room at the White House, saying afterward, \"We had a very good discussion. It's a discussion that says to me that it is very possible that a good piece of legislation can move quickly this year out of both the Senate and the House, get it to conference quickly and get it to my desk quickly, to show the American people that both parties are willing to work together to solve problems.\"\n*January 7 – President Bush speaks about asbestos litigation while in the Macomb Center for the Performing Arts at Macomb Community College in Clinton Township, Michigan.\n*January 8 – President Bush reflects on the work of relief for tsunami occurrences within the US during the weekly radio address.\n*January 11 – President Bush announces his nomination of Michael Chertoff for United States Secretary of Homeland Security in the Roosevelt Room. President Bush delivers a speech and later answers questions on reform of Social Security at the Andrew W. Mellon Auditorium in Washington, D.C.\n*January 12 – President Bush delivers a speech on No Child Left Behind and high school programs during an appearance at J.E.B. Stuart High School in Falls Church, Virginia.\n*January 13 – President Bush receives a briefing on tsunami relief efforts and the ongoing battle against terrorism at the Pentagon.\n*January 14 – President Bush speaks and answers questions regarding higher education as well as job training at the Florida Community College at Jacksonville in Jacksonville, Florida.\n*January 15 – President Bush discusses relief of tsunamis during his radio address.\n*January 17 – President Bush attends the 'Let Freedom Ring' event at the John F. Kennedy Center for the Performing Arts.\n*January 20 – Second inauguration of George W. Bush\n*January 29 – President Bush discusses Iraq and American involvement within the country during his radio address.\n*January 30 – President Bush issues a statement on the Iraqi parliamentary election held that that day during the afternoon.\n*January 31 – President Bush attends the swearing in ceremony of Margaret Spellings as United States Secretary of Education.\nFebruary\n*February 1 – President Bush issues a proclamation designating the month of February 2005 as \"American Heart Month\".\n*February 2 – President Bush delivers his annual State of the Union Address.\n*February 3 – President Bush gives a speech at the Annual National Prayer Breakfast at the Washington Hilton Hotel in Washington, D.C. during the morning. President Bush speaks on social security reform amid a panel at Montana ExpoPark in Great Falls, Montana during the afternoon.\n*February 4 – President Bush delivers a social security reform speech and answers questions at Qwest Center Omaha Arena in Omaha, Nebraska. President Bush declares the existence of a major disaster in California and orders federal aid to the state.\n*February 8 – President Bush delivers an economic speech at the COBO Conference and Economic Center in Detroit, Michigan during the afternoon.\n*February 9 – President Bush meets with President of Poland Aleksander Kwaśniewski in the Oval Office during the morning. President Bush discusses reform on class action lawsuit in the Department of Commerce building in Washington, D.C. during the afternoon.\n*February 24 – President Bush meets with Prime Minister of Slovakia Mikuláš Dzurinda for discussions on Slovakia's foreign policy and its relation to American international stances in the Office Of The Prime Minister in Bratislava, Slovakia during the morning. The two outline the details of their talks to reporters after the meeting concludes. President Bush holds a joint public appearance with Russian President Vladimir Putin to discuss the relations between the United States and Russia in the Constitution Hall of the Bratislava Castle in Bratislava, Slovakia during the afternoon. President Bush releases a statement on the failing health of Pope John Paul II, wishing him a recovery.\n*February 25 – President Bush announces the nominations of Nancy Ann Nord for Commissioner of the Consumer Product Safety Commission and Christopher J. Hanley for membership on the Board of Directors of the Overseas Private Investment Corporation, the appointment of James C. Langdon, Jr. for membership on the President's Foreign Intelligence Advisory Board, and the designation of Grover Whitehurst for Acting Commissioner of Education Statistics at the Department of Education.\n*February 26 – President Bush discusses improving Social Security during his radio address.\n*February 27 – President Bush delivers remarks to the National Governors Association State Dinner in the State Dining Room during the evening.\n*February 28 – President Bush attends the National Governors Association meeting at the State Floor during the morning.\nMarch\n*March 1 – President Bush delivers a speech at the Omni Shoreham Hotel in Washington, D.C. during the morning.\n*March 2 – President Bush makes an appearance at the Anne Arundel Community College in Arnold, Maryland for discussions on education and training for occupations during the morning. President Bush awards Rachel Robinson the Congressional Gold Medal for her late husband Jackie Robinson during the afternoon.\n*March 3 – Michael Chertoff is sworn in as United States Secretary of Homeland Security in the Ronald Reagan Building and International Trade Center.\n*March 27 – President Bush wishes \"all the fellow citizens and their families a happy Easter\" at the 4th Infantry Division Memorial Chapel in Fort Hood, Texas during the morning.\n*March 29 – President Bush delivers an address on reforming Iraq from the Rose Garden during the morning.\n*March 30 – President Bush participates in a discussion on social security reform at the Kirkwood Community College in Cedar Rapids, Iowa during the afternoon.\n*March 31 – President Bush delivers an address on the Terri Schiavo case and Iraq Intelligence Commission in Room 450 at the Dwight D. Eisenhower Executive Office Building during the morning. Bush issues a statement congratulating Paul Wolfowitz for being elected President of the World Bank Group.\nApril\nMay\n*May 10 – An assassination attempt is made on President Bush and Georgian President Mikheil Saakashvili when Vladimir Arutyunian throws a grenade at President Bush while he is addressing a crowd in the Georgian capital of Tbilisi. The grenade fails to detonate.\nJune\nJuly\n*July 1 – President Bush delivers a speech on the career of Supreme Court Justice Sandra Day O'Connor, after she announces her decision to retire, in the Rose Garden during the morning.\n*July 2 – President Bush speaks on Independence Day in his radio address.\n*July 4 – President Bush delivers an Independence Day speech at West Virginia University in Morgantown, West Virginia during the morning.\n*July 19 - On July 19, 2005, President Bush nominated Roberts to the U.S. Supreme Court to fill a vacancy to be created by the impending retirement of Justice Sandra Day O'Connor. Roberts's nomination was the first Supreme Court nomination since Stephen Breyer in 1994.\nAugust\n*August 1 – President Bush announces that he has used his \"constitutional authority\" to appoint John Bolton as United States Ambassador to the United Nations in the Roosevelt Room.\n*August 2 – CAFTA-DR is signed by President Bush in the East Room. President Bush signs the Department of Interior, Environment, and Related Agencies Appropriations Act of 2006, the bill allocating funds \"for the Department of the Interior, the Forest Service of the Department of Agriculture, the Indian Health Service of the Department of Health and Human Services, the Environmental Protection Agency, and several smaller agencies.\"\n*August 23 – President Bush gives a speech and then answers questions from reporters on the Iraqi Constitution in the Tamarack Resort in Donnelly, Idaho during the morning. President Bush declares a major disaster exists within Kansas in response to flooding from June 30 to July 1 and orders federal aid.\n*August 24 – President Bush delivers a speech on the war on terror at the Idaho Center while in Nampa, Idaho during the morning.\n*August 28 – President Bush says \"Hurricane Katrina is now designated a category five hurricane\" as well as calling on Americans to move to safe ground to save themselves and calls the decision to draft a constitution in Iraq an advancement in the political process \"to another important stage for a new and free Iraq\" during an address from the Prairie Chapel Ranch in Crawford, Texas.\n*August 29 – President Bush delivers an address on Medicare and later discusses the subject at the Pueblo El Mirage RV Resort and Country Club in El Mirage, Arizona during the morning. Hurricane Katrina devastates the Gulf of Mexico's bordering southern states.\n*August 30 – President Bush delivers a speech commemorating the sixtieth anniversary of V-J Day as well as the leadership of US Presidents Franklin D. Roosevelt and Harry Truman during World War II at the Naval Air Station North Island in San Diego, California.\n*August 31 – President Bush discusses general policies by his administration to aid in relief efforts in the aftermath of Hurricane Katrina during a speech in the Rose Garden.\nSeptember\nOctober\nNovember\n*November 30 – First Lady Laura Bush unveils the Christmas decorations at the White House for the fifth time.\nDecember\nReferences\nExternal links\n* [https://millercenter.org/president/george-w-bush/key-events Miller Center G.W. Bush Presidential Timeline]\nSee also\n* Timeline of the George W. Bush presidency, for an index of the Bush presidency timeline articles"
    }
  ]
}