{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Granada Television\n\nThis is a timeline of the history of Granada Television (now known as ITV Granada), and of the television interests of its former owner Granada plc.\nGranada Television has provided the ITV service for North West England since 1968, and previously provided the service for the North of England on weekdays from 1956 to 1968.\nGranada plc took over the services for London at weekends, Yorkshire, the North East, the South, the East, Cumbria and southern Scotland before merging with Carlton Communications to form ITV plc.\n1950s\n* 1951\n**12 October – The Holme Moss transmitter is opened in Northern England, making the BBC Television Service available to the region for the first time.\n* 1954\n**The Independent Television Authority (ITA) awards Granada the North of England contract for Monday to Friday - ABC gets the weekend licence.\n*1955\n**No events.\n* 1956\n**3 May – Granada Television launches, originally just broadcasting in the North West.\n**3 November – Granada and weekend contractor ABC, begin transmitting across most of Yorkshire from the newly built Emley Moor transmitting station.\n* 1957\n**No events.\n* 1958\n**13 February – Granada becomes the first British broadcaster to fully cover a by-election. Granada's groundbreaking coverage of the 1958 Rochdale by-election includes two candidate debates.\n* 1959\n**No events.\n1960s\n* 1960\n**9 December – The first episode of the soap opera Coronation Street, is aired on ITV. Intended as a 13-week pilot, it continues to this day as the world's longest-running television soap opera.\n* 1961\n** No events.\n* 1962\n**21 September – The first episode of the quiz show University Challenge airs and is one of the very few non-news/current affairs programmes on ITV to be transmitted without a commercial break.\n* 1963\n**7 January – The first edition of Granada's flagship current affairs programme World in Action airs and would run until 1998.\n* 1964\n**24 February – Granada broadcasts after midnight for the first time when it shows coverage of Henry Cooper's title fight at Manchester's Belle Vue Zoological Gardens.\n**5 May – World in Action airs a film called Seven Up which followed the lives of fourteen children aged seven. It continued to track their lives at seven-year intervals and its latest instalment, 63 Up, aired in 2019.\n**Granada is given a three-year extension to its licence. This is later extended by a further year.\n* 1965\n**A new relay station in Scarborough extends Granada's North of England service to the Yorkshire coast.\n* 1966\n**No events.\n* 1967\n**The Independent Television Authority announces that the forthcoming ITV licensing round will see the North of England franchise split between North West England and the three Ridings of Yorkshire with each licence being seven days a week operations.\n* 1968\n**29 July – From this day, Granada only broadcasts to the North West although it now operates seven days a week.\n**August – A technicians strike forces ITV off the air for several weeks although management manage to launch a temporary ITV Emergency National Service with no regional variations.\n**Granada launches its famous pointed ‘G’ logo, replacing the “From the North” tagline. The new ident is not animated and consists purely of a static caption.\n* 1969\n**15 November – Granada starts broadcasting in colour.\n1970s\n* 1970\n**No events.\n* 1971\n**2 August – The Pendle Forest transmitter is switched on and becomes the first UHF relay service to be operated by the Independent Television Authority. The transmitter covers east Lancashire.\n* 1972\n**28 January – The Saddleworth transmitter begins broadcasting and brings improved reception to people living in the eastern areas of Greater Manchester including Saddleworth, Mossley and Stalybridge.\n**26 June – The Lancaster transmitter is switched on.\n**16 October – Following the lifting of restrictions on broadcasting hours, Granada launches an afternoon service.\n* 1973\n**Granada's nightly news programme is relaunched as Granada Reports. It had previously went under various titles, including Northern Newscast, Scene at Six Thirty, Newsview and People and Places.\n* 1974\n**The 1974 franchise round sees no changes in ITV's contractors as it is felt that the huge cost in switching to colour television would have made the companies unable to compete against rivals in a franchise battle.\n* 1975\n**No events.\n* 1976\n**No events.\n* 1977\n**No events.\n* 1978\n**10 April – Granada opens a news base in Liverpool.\n* 1979\n**10 August – The ten week ITV strike forces Granada Television off the air. The strike ends on 24 October.\n1980s\n* 1980\n**28 December – The Independent Broadcasting Authority announces the new contractors to commence on 1 January 1982 and Granada is reawarded its licence although its coverage area is to be slightly reduced with several transmitters along its border being transferred to other companies.\n* 1981\n**No events.\n* 1982\n**1 January – Granada loses the right to broadcast to the Todmorden and Walsden area of West Yorkshire and to the Kendal area of south Cumbria when the transmitters covering these areas are transferred to Yorkshire Television and Border Television respectively.\n* 1983\n**1 February – ITV's breakfast television service TV-am launches. Consequently, Granada's broadcast day now begins at 9:25am.\n**14 February – Granada does not broadcast on that day because of an industrial dispute staged by electricians at their Manchester studios that is sparked by discord when a foreman receives a pay rise without union knowledge. Members of the Electrical, Electronic, Telecommunications and Plumbing Union (EETPU) hold a meeting to discuss the situation, scheduling it to coincide with the evening's broadcast of Coronation Street. As a result, the Monday evening schedule is heavily disrupted while Coronation Street is scheduled as a one-off omnibus edition along with the week's Wednesday episode later in the week and is also aired on Channel 4 the following Sunday.\n* 1984\n**No events.\n* 1985\n**3 January – Granada's last day of transmission using the 405-lines system.\n* 1986\n**April – Most of Granada's regional news operations is relocated from Manchester to a computerised news centre at the former Traffic Office building in Liverpool's Albert Dock.\n* 1987\n**7 September – Following the transfer of ITV Schools to Channel 4, ITV provides a full morning programme schedule, with advertising, for the first time. The new service includes regular five-minute national and regional news bulletins.\n**31 December – University Challenge is broadcast on ITV for the final time, after being on the air for 25 years. Recent years had seen it aired in off-peak slots and the two London companies (Thames and LWT) had dropped the show in 1983. However, in 1992, a new one-off episode aired on BBC2 as part of a Granada-themed evening which led to a revival in 1994 which is still running to this day.\n* 1988\n**13 February – Granada begins 24-hour broadcasting.\n**2 September – Granada launches an overnight service called Night Time to make it easier for the smaller companies to introduce 24-hour broadcasting. The service is networked to Tyne Tees, TSW, Grampian and Border with Ulster taking the service from 3 October.\n**3 October – Having been awarded the contract to produce ITV's new flagship daytime programme, This Morning makes its debut, broadcast live from its studios at Albert Dock in Liverpool. Granada had fought off bids from four other ITV companies to produce the show.\n* 1989\n**1 September\n***  Granada launches a look featuring a translucent pointed G which rotated into place in time to the music against a natural scene.\n*** ITV introduces its first official logo as part of an attempt to unify the network under one image whilst retaining regional identity. However, Granada refused to adopt it, because the Granada Television logo was incorrectly inserted into the 'V' segment of the logo. The company used a version with its translucent logo shown at the beginning, before continuing with the generic ident and ending with the generic ITV logo.\n1990s\n* 1990\n**2 January – Granada Television's nightly news programme Granada Reports is rebranded as Granada Tonight and the shorter bulletins are rebranded as Granada News.\n**May – What the Papers Say which has been broadcast on ITV and Channel 4 since 1956, becomes the first Granada commission for the BBC when the show transfers over to them.\n**25 May – Granada starts broadcasting in NICAM digital stereo.\n**4 June – Granada Television in the run-up to the 1991 franchise round, relaunches its on-screen branding to a blue stripe descending from the top of the screen, containing the pointed 'G' against a plain white background accompanied by the same music as before. Variations are seen from which the stripe formed from a falling feather or was backlit.\n* 1991\n**16 October – The Independent Television Commission announces the results of the franchise round. Granada Television is reawarded its licence. A rival bid came from Mersey Television, a company producing the Channel 4 soap opera Brookside. They bid £35 million compared to Granada's £9m, but Granada won as Mersey TV did not meet the 'quality threshold' applied by the Independent Television Commission.\n* 1992\n**Granada Tonight returns to Manchester, although bulletins continue to be broadcast from the Albert Dock newsroom until 1998.\n* 1993\n**No events.\n* 1994\n**21 September – University Challenge is revived with the BBC commissioning Granada to produce this version. It is presented by Jeremy Paxman until 2023 and is still running to this day.\n* 1995\n**4 June – Granada closes its Night Time service and instead carries the new national overnight service from London.\n* 1996\n**The daytime show This Morning is moved from Liverpool's Albert Dock to the London Studios on the grounds that it was difficult to get celebrity guests to travel from London to Liverpool.\n**1 October – Granada Sky Broadcasting launches. It is a joint venture between Granada and BSkyB. The four-channel service consists of Granada Plus, showing entertainment programmes from the archives of Granada and its subsidiaries including classic episodes of Coronation Street, Granada Good Life, a lifestyle channel split into four segments: Granada Food & Wine, Granada Health & Beauty, Granada TV High Street and Granada Home & Garden, Granada Men & Motors, a channel aimed at men and broadcasts for three hours each night after Granada Plus and Granada Talk TV, a daytime-only debate channel.\n* 1997\n**31 January – Granada Television, Carlton Television and British Sky Broadcasting (BSkyB), create British Digital Broadcasting (BDB) as a joint venture to operate three digital terrestrial television (DTT) licences.\n**26 June – Granada Group plc (now ITV plc) acquires Yorkshire-Tyne Tees Television plc .\n**31 August – Granada Talk TV closes.\n**20 December – The ITC awards the sole DTT broadcast licence to British Digital Broadcasting. However, BSkyB had by now been forced by the ITC to pull out of the joint venture on competition grounds, effectively placed Sky's forthcoming digital satellite service in direct competition with the new service, although Sky was still required to provide key channels such as Sky Movies and Sky Sports to ONdigital.\n* 1998\n**1 May – Granada Good Life is relaunched as a single channel called Granada Breeze in order to improve ratings.\n**28 July – BDB announces that the DTT service will be called ONdigital.\n**15 November\n***OnDigital launches and the three remaining Granada Sky Broadcasting channels form part of the service.\n***The home-shopping channel Shop! launches, in conjunction with Littlewoods.\n**7 December – After 35 years on the air, the final edition of Granada's current affairs programme World in Action is broadcast. It is replaced the following April by Tonight which adopts a lighter, UK-orientated human interest-led agenda.\n* 1999\n**8 November – A new, hearts-based on-air look is introduced.\n2000s\n* 2000\n**August – The Granada Studios are handed over to 3SixtyMedia, a new joint venture between Granada Television and BBC Manchester.\n**8 December – Coronation Street airs a live episode to mark 40 years of the soap, featuring guest appearances from The Prince of Wales and Sir Trevor McDonald.\n* 2001\n**July – Granada buys Border Television.\n**11 July – Granada and Carlton relaunch OnDigital as ITV Digital in an attempt to better compete with Sky.\n**11 August – ITV's main channel is rebranded ITV1.\n**28 September – Granada's flagship nightly news programme Granada Tonight is rebranded to its original title Granada Reports.\n* 2002\n**27 March – ITV Digital goes into administration.\n**8 April – Shop! closes.\n**30 April – Granada Breeze closes.\n**1 May – ITV Digital stops broadcasting.\n**28 October – On-air regional identities are dropped apart from when introducing regional programmes and Granada is renamed ITV1 Granada. This leads to sweeping cuts in the organisation, including cutting budgets for programmes and a loss of jobs at Granada's Manchester headquarters.\n* 2003\n**No events.\n* 2004\n**2 February – Granada plc merges with Carlton Communications to form a single England and Wales ITV company called ITV plc.\n**31 October – The Granada logo is seen at the end of its own programmes for the final time.\n**1 November\n***ITV takes full control of Granada Sky Broadcasting.\n***Granada Plus closes to make way for ITV3.\n***All Granada productions are now credited as \"Granada Manchester\".\n*2005\n**Granada closes its offices in Blackburn and Chester.\n* 2006\n**16 January – The Granada name stops appearing at the end of programmes when the in-house production arm is renamed 'ITV Productions'.\n**July – Granada closes its studios at Liverpool's Albert Dock.\n**13 November –  Granada loses its on-air identity when regional programming begins to be voiced as ITV1 or ITV1 Granada over a generic ident.\n* 2007\n**No events.\n* 2008\n**22 May – What the Papers Say airs for the final time following a decision by the BBC not to renew the programme. It had been produced by Granada since the station first went on the air in 1956.\n**December – All non-news local programming ends after Ofcom gives ITV permission to drastically cut back its regional programming. From 2009, the only regional programme is the monthly political discussion show.\n* 2009\n**February – ITV makes major cutbacks to its regional broadcasts in England. Granada News is unaffected by the changes.\n**16 July – ITV Granada takes over coverage of the Isle of Man from ITV Border.\n**2 December – The Granada region completes its digital switchover.\n2010s\n*2010\n**1 April – Men & Motors stops broadcasting.\n**September – The iconic \"Granada TV\" sign on the roof and entrance of Granada Studios is removed after a safety check revealed the signs which have been in place since the 1950s were severely corroded and unsafe.\n**16 December – ITV announces that it will move its North West production facilities from the Granada Studios on Quay Street in central Manchester to MediaCityUK.\n*2011\n**No events.\n*2012\n**No events.\n*2013\n**24 March – Granada Reports is broadcast from MediaCityUK for the first time, signifying the completion of the initial phase of Granada's migration from the Granada Studios in Quay Street. The MediaCity site is home to approximately 750 employees at ITV Granada and ITV Studios.\n**June – The Granada Studios close.\nSee also\n* History of ITV\n* History of ITV television idents\n* Timeline of ITV\n* Timeline of Yorkshire Television – Granada's successor in Yorkshire\n* Timeline of ABC Weekend TV – Granada's weekend predecessor in the North West\nReferences"
    }
  ]
}