{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of strikes in 1980\n\nIn 1980, a number of labour strikes, labour disputes, and other industrial actions occurred.\nBackground\nA labor strike is a work stoppage caused by the mass refusal of employees to work. It is usually a response to employee grievances, such as low pay or poor working conditions. Strikes can also occur to demonstrate solidarity with workers in other workplaces or pressure governments to change policies.\nTimeline\nContinuing strikes from 1979\n* 1978–1980 ABC Paulista strikes\n* 1979–1980 International Harvester strike, by International Harvester workers over work rules, represented by the United Auto Workers.\n* 1975-80 Sonacotra rent strike, rent strike by immigrant workers in France.\nJanuary\n* 1980 Greek bank strike, 6-week strike by bank workers in Greece.\n* 1980 San Onofre nuclear strike, 2-day wildcat strike by workers at the San Onofre Nuclear Generating Station, represented by the Plumbers and Pipefitters Union, after 13 of the station's workers had been fired for protesting working conditions.\n* 1980 UK steelworkers strike, by British Steel steelworkers in the United Kingdom, against redundancies.\nFebruary\n* 1980 Tihange Nuclear Power Station strike, at the Tihange Nuclear Power Station in Belgium.\nMarch\n* Strikes called by the Muslim Brotherhood in Aleppo, Syria, which led to the Siege of Aleppo.\n* 1980 American Totalisator strike, by electrical workers of the American Totalisator Company.\n* Berber Spring, including strikes, calling for recognition of the Berbers in Algeria.\n* 1980 Port of Santos strike, 5-day strike by dock workers at the Port of Santos in Brazil.\n* 1980 Nepal transport strike, by bus and taxi drivers in Nepal calling for better safety.\n* 1980 Paris Métro cleaners' strike, by cleaners of the Paris Métro in France.\n* March 1980 West Bank general strike, in protest against the Israeli government's move to allow Israeli settlement in the city of Hebron.\n* 1980 Zimbabwe wildcat strikes, wildcat strikes in Zimbabwe prior to the country's formal independence.\nApril\n* 1980 Major League Baseball strike\n* 1980 New York City transit strike, by New York City Transit Authority workers, the first since 1966.\n* 1980 Portsmouth Cottage Hospital strike, 25-day strike by nurses at the Portsmouth Cottage Hospital in Portsmouth, New Hampshire, the first nurses' strike in New Hampshire history.\n* 1980 University of Wisconsin–Madison strike, 5-week strike by University of Wisconsin–Madison teaching assistants, represented by the Teaching Assistants Association.\n* 1980 Zaire students' strike\nMay\n* 1980 Danbury Hospital strike, 23-day strike by nurses at the Danbury Hospital in the United States in protest against understaffing.\n* 1980 Santo Domingo minibus strike, by minibus drivers in Santo Domingo, the Dominican Republic, against increases in fuel prices.\n* Storkonflikten 1980, general strike in Sweden.\n* 1980 Togliatti strike, wildcat strikes by AvtoVAZ factory workers in the Soviet Union.\nJune\n* 1980 BBC musicians' strike, by BBC musicians in the United Kingdom, represented by the Musicians' Union.\n* 1980 California carpenters' strike\n* June 1980 West Bank general strike, in protest against a Jewish Underground bombing that injured Mayor of Nablus Bassam Shakaa and Mayor Ramallah Karim Khalaf.\nJuly\n* 1980 Abitibi-Price strike, by workers at Abitibi-Consolidated in Canada.\n* 1980 actors strike\n* 1980-81 Alberta brewery strike 7-month strike by breweries in Alberta.\n* 1980 Anaconda Copper strike, 154-day strike by copper miners at Anaconda Copper in the United States.\n* 1980 California garlic strike, by garlic farm field hands in California, United States, represented by the United Farm Workers.\n* 1980 Lublin strikes, in the Polish People's Republic, demanding higher wages and more affordable food.\n* 1980 Norwegian oil strike, a 2-week strike by North Sea oil workers in Norway.\n* 1980 San Francisco hotel strike\n* 1980 Sri Lankan general strike\n* 1980 Tehran water strike, by Tehran Regional Water Authority workers in Iran.\nAugust\n* 1980 French fishers' strike\n* 1980 LaGuardia Hospital strike, by nurses at the LaGuardia Hospital in the United States.\n* 1980 Soviet immigrants' protests in Israel, including strikes by Soviet immigrants to Israel over lack of jobs and housing, triggered by the suicide of chemical engineer and Soviet immigrant Arkodi Seiderman.\n* 1980 The Times strike, by journalists at The Times in the United Kingdom, the first in the newspaper's history.\n* Upper Silesia 1980 strikes, in the Polish People's Republic calling for the establishment of independent trade unions.\nSeptember\n* 1980 Berlin S-Bahn strike\n* 1980 CR strike, 9-day strike by federal government clerks in Canada, represented by the Public Service Alliance of Canada.\n* 1980 Gardner strike, by L. Gardner and Sons workers in the United Kingdom.\nOctober\n* 1980 Brownsville Eagle bus strike\n* 1980 New Jersey Symphony Orchestra strike, 3-month strike by musicians of the New Jersey Symphony Orchestra in the United States.\nNovember\n* 1980 Swiss printers' strikes, led by the Union of Printing and Paper.\n* 1980 West German journalists strike, by journalists in West Germany demanding a 40-hour work week.\nDecember\n* 1980-81 Bangalore public sector strike\n* 1980 Greece teachers strike, demanding higher wages.\n* 1980-81 West Bank teachers strike, by Israeli-employed Palestinian teachers in the West Bank demanding pay raises to match their salaries with the salaries of teachers in Israel.\nReferences"
    }
  ]
}