{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Niccolò Machiavelli__disambig_1\n\nin Florence, Italy.]]\nThis timeline lists important events relevant to the life of the Italian diplomat, writer and political philosopher Niccolò Machiavelli (1469–1527).\nMachiavelli was born in Florence in 1469 of an old citizen family. Little is known about his life until 1498, when he was appointed secretary and second chancellor to the Florentine Republic. During his time of office his journeys included missions to Louis XII of France and to the Holy Roman Emperor Maximillian I; he was with Cesare Borgia in the Romagna; and after watching the second Papal election of 1503 he accompanied Pope Julius II on his first campaign of conquest. In 1507, as chancellor of the newly appointed Nove di Milizia (Nine of the Militia), he organised an infantry force which fought at the capture of Pisa in 1509. Three years later it was defeated by the Holy League at Prato, the Medici returned to Florence, and Machiavelli was excluded from public life. After suffering imprisonment and torture, he retired to his farm near San Casciano, where he lived with his wife and six children and gave his time to study and writing. His works included The Prince; the Discourses on the First Decade of Livy; The Art of War and the comedy, Mandragola, a satire on seduction. In 1520, Cardinal Giulio de' Medici (later Pope Clement VII, 1523) secured him a commission to write a history of Florence, which he finished in 1525. After a brief return to public life, he died in 1527.\nTimeline\n(Dates in square brackets are conjectural)\n.]]\n1469\n: 3 May: Niccolò Machiavelli is born in Florence.\n1471\n: 6–9 August: Cardinal Francesco della Rovere is elected Pope as Sixtus IV.\n1480s\n1481\n:With his brother Totto, Niccolò begins at  the school of Paolo da Ronciglione.\n1484\n: 26–29 August: After the death of Pope Sixtus IV, the papal conclave elects Cardinal Giovanni Battista Cybo as Pope Innocent VIII.\n1490s\n1491\n:The Dominican priest Girolamo Savonarola begins to win influence in Florence.\n1492\n:9 April: Lorenzo de' Medici the de facto ruler of the Florentine Republic dies, and his son Piero di Lorenzo (known as Piero the Unfortunate) becomes head of the Medici family.\n:11 August: Roderic de Borja, Alexander VI, is elected pope.\n1494\n:The Italian Wars begins when Charles VIII of France invades Italy with a 25,000 men strong army.\n:November: Piero and the Medici are expelled from Florence, when French troops enter the city.\n1498\n:23 May: Savonarola is executed for heresy, after being excommunicated by Pope Alexander VI in May 1497.\n:June: Machiavelli is confirmed by the Great Council as second chancellor of the Republic.\n:July: Machiavelli is elected secretary to the Ten of War (La Guerra dei Dieci), the body that manages Florence's military matters.\n:November: On behalf of the Ten of War he is sent on his first diplomatic mission to Piombino.\n1499\n:Report on the Pisan War, (Discorso della guerra di Pisa).\n:Mission to Caterina Sforza Riario, ruler of Imola and Forlì.\n1500s\n, Pope Julius II, Pope Clement VII and Charles VIII of France.]]\n1500\n:July: Machiavelli is sent on a six-month diplomatic mission to King Louis XII of France. In France, he also meets the Cardinal of Rouen Georges d'Amboise\n1501\n:Marries Marietta Corsini.\n[1501-1503]\n:Primavera di Niccolò dei Machiavelli is born. Sometimes referred to as Primerana, most likely named after her paternal aunt Primavera di Bernardo dei Machiavelli; presumably the suck daughter Marietta Corsini wrote about in a letter to Machiavelli from November 24, 1503, suggesting that she died soon afterwards due to a lack of further references.\n1502\n:In the wake of the execution of Savonarola; Piero Soderini is elected gonfaloniere of the Florentine Republic for life by the Florentines, with the pretext of being given the mission to re-stabilise the republican institutions.\n[1502-1503]\n:Miscarriage\n1503\n:Machiavelli publishes Description of the Manner in which Duke Valentino put Vitellozzo Vitelli, Oliverotto da Fermo, Lord Pagola and the Duke of Gravina to Death (); Discourse about the Provision of Money (Discorso sopra la provisione del danaro), and On the method of dealing with the Rebellious Peoples of Val di Chiana (Del modo di trattare i popoli della Valdichiana ribellati).\n:For Machiavelli's plan to assert Florentine authority over Pisa, which was in revolt against Florence from 1502–1509, Leonardo da Vinci is consulted on a scheme to divert the river Arno around Pisa to the sea at Livorno\n:April: Machiavelli is sent on mission to Pandolfo Petrucci, ruler of Siena.\n:September: Election of Pope Pius III.\n:October: Machiavelli is sent on mission to the Papal court at Rome.\n:November: Election of Pope Julius II.\nNov. 8, 1503\n:Bernardo II. di Niccolò dei Machiavelli is born. Most likely named after his paternal grandfather Bernardo I. di Niccolò dei Machiavelli. Marries Ippolita di Alessandro Rinuccini in 1543 and had with her two sons and three daughters (Niccolò, Leonarda, Maddalena, Alessandro, Sistilia). Worked as provincial treasurer of the Apostolic Camera in Perugia and Umbria from 1555-1565. Died 1574.\n1504\n:Machiavelli's poem;  The First Decade () is published.\n:January: Machiavelli travels on his second mission to the court of Louis XII.\n:July: Second mission to Pandolfo Petrucci.\n1504\n:Lodovico di Niccolò dei Machiavelli is born. Died during the Siege of Florence in 1530, part of the War of the League of Cognac. He was said to have a violent temperament, and was frequently in debt to his father.\n1506\n:Discourse on Florentine Military Preparation ().\n:January: Recruits for the militia in the Mugello region, north of Florence.\n:August–October: Machiavelli's second mission to the Papal Court follows Pope Julius II from Viterbo to Orvieto, Perugia, Urbino, Cesena, and Imola.\n1507\n:December: Sent on a mission to the court of the Holy Roman Emperor Maximillian I in the County of Tyrol.\n1508\n:Report on the state of Germany ().\n1509\n:Report on Germany and the Emperor (Discorso sopra le cose della Magna e sopra lo imperatore).\n:The poem, The Second Decade (Decennale secondo); an update to Machiavelli's earlier work The First Decade (Decennale Primo) is published.\n1510s\nat the Uffizi Gallery in Florence, Italy.]]\n1510\n:June–September: Third mission to the court of Louis XII.\n1511\n:September: Machiavelli's fourth diplomatic mission to the court of Louis XII.\n1512\n:The Italian Wars continues, and after Spanish troops invade Florentine territory – and sack Prato – Florence surrenders, Piero Soderini is deposed and goes into exile as the House of Medici returns to power. (See War of the League of Cambrai).\n[After April 1512]\n:Description of German Affairs ().\n[After April 1512 and before August 1513]\n:Description of French Affairs ().\n:November: Machiavelli is ousted from the Chancery and sentenced to a years confinement within Florentine territory.\n[1512-13]\n:Guido di Niccolò dei Machiavelli is born. Described as having a very gentle temperament. Became prior of Santi Martino e Giusto in Lucardo. Promoted studies as translator and scholar of classical literature and languages. Studied music in his youth due to the wishes of his father, though he seemed to genuinely enjoy the pursuit, despite his frequent illness. Wrote the comedy Tizia in 1550. Died in 1567.\n1513\n:February: Machiavelli is tried for conspiracy, tortured and imprisoned.\n:March–April: After his release Machiavelli retires to his farm at Sant'Andrea in Percussina, seven miles south of Florence.\n:March: The papal conclave elects Giovanni de' Medici as, Pope Leo X.\n:July: Machiavelli drafts The Prince ().\n:August: Miscarriage. His daughter dies three days after being born. Machiavelli described as falling into a 'deep sadness' over the events of the year, but especially this loss.\n[1514 or later]\n:Discourse or Dialogue on Our Language ().\n1513\n:Machiavelli enters a discussion group – interested in literature and politics – meeting at Orti Oricellari, in Florence. He starts writing Discourses on the First Decade of Titus Livy (), a commentary on the first ten books of Livy's History of Rome.\nDec. 14, 1514\n:Piero di Niccolò dei Machiavelli is born. Also called Pietro in some sources. Most likely named after his maternal step-grandfather Piero di Francesco del Nero. Became a sailor and cosmographer in 1534, was made commissioner of the galleys by Cosimo I. de Medici in 1557. Became a knight of the Order of Saint Stephen in 1562.\n[1515–1520]\n:Writes the novella Belfagor arcidiavolo (published with Machiavelli's collected works in 1549).\nCirca 1516\n:Manuscript copies of The Prince begin to circulate in and beyond Florence.\n[1517 or 1518]\n:Machiavelli's version of The Golden Ass () of Apuleius, a satirical poem of eight chapters, written in terza rima.  The poem concerns the theme of metamorphosis, and contains autobiographical, grotesque, and allegorical episodes.\n1518\n:Writes a book on military organisation, The Art of War () and The Life of Castruccio Castracani of Lucca (La vita di Castruccio Castracani da Luca), as well as a ''Summary of Lucca's system of government (Sommario delle cosse della città di Lucca)''. He is commissioned to write the history of Florence by Cardinal Giulio de' Medici (later elected as Pope Clement VII, in the Papal conclave, 1523).\n[1519 or 1520]\n:Discourse on the Florentine Affairs After the Death of Lorenzo (Discorso delle cose fiorentine dopo la morte di Lorenzo).\n1520\n:Bartolomea di Niccolò dei Machiavelli is born. Sometimes referred to as Baccia or Baccina. Married Giovanni di Giuliano dei Ricci in 1540 and had four sons and two daughters with him.\n1520s\n(fresco by Giorgio Vasari, 1558).]]\n1521\n:The Art of War is published.\n1522\n:Advice to Raffaello Girolami (Memoriale a Raffaello Girolami)''\n:Cardinal Adrian Florensz is elected Pope as Adrian VI.\n:\n:Totto di Bernardo dei Machiavelli, Niccolò Machiavelli's younger brother, dies.\n1523\n:Cardinal Giulio de' Medici is elected Pope as Clement VII.\n[1524–1525]\n:Clizia, a comedy based upon a classical play by Plautus.\n1525\n:Totto di Niccolò dei Machiavelli is born. It is uncertain whether he was born to Marietta Corsini or Machiavelli's mistress, Barbara Salutati. Most likely named after Machiavelli's younger brother, Totto di Bernardo dei Machiavelli. Is mentioned as having an infection of his eyes in a letter by his father to his elder brother Guido from April 2, 1527, suggesting that he might have died soon afterwards due to a lack of further references. Piero is frequently referred to as the youngest of Machiavelli's children, further supporting this conjecture.\n1525\n:Visits Rome to present his finished Florentine Histories (Italian:Istorie fiorentine) to Pope Clement. Machiavelli's satirical play The Mandrake (La Mandragola) is performed and acclaimed in Venice, which he later visits on a mission to settle a trade dispute for the Wool Guild of Florence.\n1526\n:Report on the Fortifications of Florence (Relazione di una visita fatta per fortificare Firenze).\n1527\n:May: The city of Rome is sacked by the Imperial Army of chiefly Germans and Spaniards under the Duke of Bourbon, during the War of the League of Cognac (see the Italian Wars). The Medici are expelled from Florence, where the Republic adopts a new constitution.\n:21 June: Machiavelli dies and is buried in the basilica of Santa Croce, Florence.\n1530s\n1531–1532\n:Posthumous publication of The Prince, Discourses on Livy, and   Florentine Histories.\n(Dates in square brackets are conjectural)\nSee also\n* Timeline of Florence\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}