{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2002 Atlantic hurricane season\n\nThe 2002 Atlantic hurricane season was an average Atlantic hurricane season in which twelve named storms formed.|group=\"nb\"}} Although Tropical Storm Arthur formed on July&nbsp;14, the season officially began on June&nbsp;1 and ended on November&nbsp;30, dates that conventionally delimit the period of each year when most tropical cyclones develop in the Atlantic basin. The season's final storm, Tropical Depression Fourteen, dissipated on October&nbsp;16.\nThe season produced fourteen tropical depressions, of which twelve intensified into tropical storms, four became hurricanes, and two became major hurricanes.|group=\"nb\"}} The two most significant storms of the season, in terms of loss of life and damage, were hurricanes Isidore and Lili. Hurricane Isidore was an unusually large storm and attained maximum sustained winds of 125&nbsp;mph (205&nbsp;km/h), becoming one of only two major hurricanes during the season. Hurricane Lili was the strongest hurricane during the season, with winds reaching 145&nbsp;mph (230&nbsp;km/h) before moving ashore Louisiana as a much weaker system.\nThis timeline includes information that was not operationally released, meaning that data from post-storm reviews by the National Hurricane Center, such as a storm that was not operationally warned upon, has been included. This timeline documents tropical cyclone formations, strengthening, weakening, landfalls, extratropical transitions, and dissipations during the season.\nTimeline\nJune\n;June&nbsp;1\n*The 2002 Atlantic hurricane season officially begins. All other units are rounded to the nearest digit.|group=\"nb\"}} west-southwest of Hatteras, North Carolina.\n;July&nbsp;15\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Depression One intensifies into Tropical Storm Arthur.\n;July&nbsp;16\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Storm Arthur reaches its peak intensity with winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of 997&nbsp;mbar (hPa; 29.44&nbsp;inHg) roughly 350&nbsp;mi (560&nbsp;km) south of Nova Scotia.\n;July&nbsp;17\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT July&nbsp;16) – Tropical Storm Arthur transitions into an extratropical cyclone south of Newfoundland.\nAugust\n;August&nbsp;4\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Tropical Depression Two develops from an area of low pressure east of Louisiana.\n;August&nbsp;5\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT August&nbsp;4) – Tropical Depression Two intensifies into Tropical Storm Bertha.\n* 0100&nbsp;UTC (8:00&nbsp;p.m. CDT August&nbsp;4) – Tropical Storm Bertha reaches its peak intensity with winds of 40&nbsp;mph (65&nbsp;km/h) and a minimum barometric pressure of 1007&nbsp;mbar (hPa; 29.74&nbsp;inHg).\n* 0200&nbsp;UTC (9:00&nbsp;p.m. CDT August&nbsp;4) – Tropical Storm Bertha makes its first landfall near Boothville, Louisiana, with winds of 40&nbsp;mph (65&nbsp;km/h).\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT) – Tropical Storm Bertha weakens to a tropical depression over southeastern Louisiana.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Three develops from an area of low pressure roughly 150&nbsp;mi (240&nbsp;km) east-southeast of Charleston, South Carolina.\n;August&nbsp;6\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Three intensifies into Tropical Storm Cristobal.\n;August&nbsp;7\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT August&nbsp;6) – Tropical Storm Cristobal reaches its peak intensity with a minimum barometric pressure of 999&nbsp;mbar (hPa; 29.5&nbsp;inHg).\n;August&nbsp;8\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Storm Cristobal reaches its peak intensity with winds of 50&nbsp;mph (85&nbsp;km/h).\n;August&nbsp;9\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT) – Tropical Storm Cristobal is absorbed into a frontal zone roughly 300&nbsp;mi (480&nbsp;km) southeast of Cape Hatteras, North Carolina.\n* 0800&nbsp;UTC (3:00&nbsp;a.m. CDT) – Tropical Depression Bertha makes its second and final landfall near Griffins Point, Texas, with winds of 25&nbsp;mph (40&nbsp;km/h).\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Tropical Depression Bertha dissipates over southeastern Texas.\n;August&nbsp;29\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Depression Four develops from an area of low pressure roughly 550&nbsp;mi (890&nbsp;km) southwest of the westernmost Cape Verde Islands.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – Tropical Depression Four intensifies into Tropical Storm Dolly.\n;August&nbsp;30\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Storm Dolly reaches its peak intensity with winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of 997&nbsp;mbar (hPa; 29.44 inHg).\nSeptember\n; September&nbsp;1\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Five develops from an area of low pressure roughly 120&nbsp;mi (195&nbsp;km) east of Daytona Beach, Florida.\n; September&nbsp;2\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Depression Five intensifies into Tropical Storm Edouard.\n; September&nbsp;3\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Storm Edouard reaches its peak intensity with winds of 65&nbsp;mph (100&nbsp;km/h) and a minimum barometric pressure of 1002&nbsp;mbar (hPa; 29.59&nbsp;inHg).\n; September&nbsp;4\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Storm Dolly weakens to a tropical depression.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – Tropical Depression Dolly degenerates into a non-convective remnant low-pressure area.\n; September&nbsp;5\n* 0045&nbsp;UTC (8:45&nbsp;p.m. EDT September&nbsp;4) – Tropical Storm Edouard makes landfall near Ormond Beach, Florida, with winds of 40&nbsp;mph (65&nbsp;km/h).\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Storm Edouard weakens to a tropical depression over Florida.\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Tropical Depression Six develops from an area of low pressure roughly 85&nbsp;mi (140&nbsp;mi) southeast of Galveston, Texas.\n; September&nbsp;6\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT September&nbsp;5) – Tropical Depression Six intensifies into Tropical Storm Fay roughly 110&nbsp;mi (175&nbsp;km) southeast of Galveston, Texas.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Edouard dissipates south of the Florida Panhandle.\n; September&nbsp;7\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT September&nbsp;6) – Tropical Storm Fay reaches its peak intensity with winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of 998&nbsp;mbar (hPa; 29.47 inHg) roughly 125&nbsp;mi (205&nbsp;km) southeast of Galveston, Texas.\n* 0900&nbsp;UTC (4:00&nbsp;a.m. CDT) – Tropical Storm Fay makes landfall roughly 10&nbsp;mi (15&nbsp;km) east of Port O'Connor, Texas, with winds of 60&nbsp;mph (95&nbsp;km/h).\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT) – Tropical Storm Fay weakens to a tropical depression.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Depression Seven develops from an area of low pressure roughly 1155&nbsp;mi (1855&nbsp;km) east-southeast of Bermuda. Concurrently, the tropical depression also reaches its peak intensity with winds of 35&nbsp;mph (55&nbsp;km/h) and a minimum barometric pressure of 1013&nbsp;mbar (hPa; 29.9&nbsp;inHg).\n; September&nbsp;8\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT) – Tropical Depression Fay degenerates into a non-convective remnant area of low pressure over the mountainous terrain of Mexico.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Subtropical Depression Eight develops from an area of low pressure roughly 440&nbsp;mi (710&nbsp;km) south-southeast of Cape Hatteras, North Carolina.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – Tropical Depression Seven dissipates roughly 850&nbsp;mi (1370&nbsp;km) southeast of Bermuda.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Subtropical Depression Eight intensifies into Subtropical Storm Gustav, becoming the first subtropical storm to be assigned a name.\n; September&nbsp;10\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Subtropical Storm Gustav transitions into a tropical storm and is designated as Tropical Storm Gustav.\n; September&nbsp;11\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Storm Gustav intensifies into a Category&nbsp;1 hurricane on the Saffir–Simpson Hurricane Scale, becoming the first hurricane of the 2002 season.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Hurricane Gustav intensifies into a Category&nbsp;2 hurricane and reaches its peak intensity with winds of 100&nbsp;mph (155&nbsp;km/h).\n; September&nbsp;12\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT September&nbsp;11) – Hurricane Gustav weakens to a Category&nbsp;1 hurricane.\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT September&nbsp;11) – Tropical Depression Nine develops from an area of low pressure roughly 250&nbsp;mi (400&nbsp;km) south of Pensacola, Florida.\n* 0400&nbsp;UTC (12:00&nbsp;a.m. EDT) – Hurricane Gustav reaches its peak intensity with a minimum barometric pressure of 960&nbsp;mbar (hPa; 28.35 inHg).\n* 0430&nbsp;UTC (12:30&nbsp;a.m. AST) – Hurricane Gustav makes its first landfall on Cape Breton Island with winds of 80&nbsp;mph (130&nbsp;km/h).\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT) – Tropical Depression Nine intensifies into Tropical Storm Hanna roughly 225&nbsp;mi (360&nbsp;km) south of Pensacola, Florida.\n* 0900&nbsp;UTC (5:00&nbsp;a.m. AST) – Hurricane Gustav makes its second and final landfall near Rose Blanche – Harbour le Cou, Newfoundland, with winds of 75&nbsp;mph (120&nbsp;km/h).\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Hurricane Gustav transitions into an extratropical cyclone over Newfoundland.\n; September&nbsp;14\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT September&nbsp;13) – Tropical Storm Hanna reaches its peak intensity with winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of 1001&nbsp;mbar (hPa; 29.56&nbsp;inHg) roughly 60&nbsp;mi (95&nbsp;km) south of the mouth of the Mississippi River.\n* 0800&nbsp;UTC (3:00&nbsp;a.m. CDT) – Tropical Storm Hanna makes its first landfall near the mouth of the Mississippi River with winds of 60&nbsp;mph (95&nbsp;km/h).\n* 1500&nbsp;UTC (10:00&nbsp;a.m. CDT) – Tropical Storm Hanna makes its second and final landfall near the Alabama–Mississippi border with winds of 60&nbsp;mph (95&nbsp;km/h).\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Tropical Storm Hanna weakens to a tropical depression.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Ten develops from an area of low pressure near Trinidad and Tobago.\n; September&nbsp;15\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Hanna dissipates over Alabama.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Ten degenerates into a tropical wave in the eastern Caribbean.\n;September&nbsp;17\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Depression Ten regains tropical depression status roughly 120&nbsp;mi (195&nbsp;km) south of Kingston, Jamaica.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Depression Eleven develops from an area of low pressure roughly 620&nbsp;mi (1000&nbsp;km) east of Bermuda.\n;September&nbsp;18\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Depression Ten intensifies into Tropical Storm Isidore.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST) – Tropical Depression Eleven intensifies into Tropical Storm Josephine.\n;September&nbsp;19\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST) – Tropical Storm Josephine reaches its peak intensity with winds of 40&nbsp;mph (65&nbsp;km/h) and a minimum barometric pressure of 1009&nbsp;mbar (hPa; 29.81&nbsp;inHg).\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Storm Josephine transitions into an extratropical cyclone.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Storm Isidore intensifies into a Category&nbsp;1 hurricane.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – The extratropical remnants of Josephine merge with a larger extratropical cyclone.\n;September&nbsp;20\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Hurricane Isidore intensifies into a Category&nbsp;2 hurricane.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Hurricane Isidore weakens to a Category&nbsp;1 hurricane.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – Subtropical Depression Twelve develops from an area of low pressure roughly 715&nbsp;mi (1150&nbsp;km) east-southeast of Bermuda.\n* 2100&nbsp;UTC (5:00&nbsp;p.m. EDT) – Hurricane Isidore makes landfall at Cabo Frances, Cuba, with winds of 85&nbsp;mph (140&nbsp;km/h).\n;September&nbsp;21\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Hurricane Isidore regains Category&nbsp;2 hurricane status.\n* 0600&nbsp;UTC (2:00&nbsp;p.m. AST) – Subtropical Depression Twelve intensifies into Subtropical Storm Kyle roughly 680&nbsp;mi (1090&nbsp;km) east of Bermuda.\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT) – Hurricane Isidore intensifies into a Category&nbsp;3 hurricane, the first major hurricane of the season.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – Tropical Depression Thirteen develops from an area of low pressure roughly 900&nbsp;mi (1400&nbsp;km) east of the Windward Islands.\n;September&nbsp;22\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT) – Hurricane Isidore reaches its peak intensity with winds of 125&nbsp;mph (205&nbsp;km/h) and a minimum barometric pressure of 934&nbsp;mbar (hPa; 27.58 inHg).\n* 2100&nbsp;UTC (4:00&nbsp;p.m. CDT) – Hurricane Isidore makes landfall at Telchac Puerto, Yucatán, with winds of 125&nbsp;mph (205&nbsp;km/h).\n;September&nbsp;23\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST) – Subtropical Storm Kyle transitions into a tropical storm and is designated as Tropical Storm Kyle roughly 760&nbsp;mi (1220&nbsp;km) east of Bermuda.\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT September&nbsp;22) – Tropical Depression Thirteen intensifies into Tropical Storm Lili.\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT) – Hurricane Isidore weakens to a Category&nbsp;1 hurricane.\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT) – Hurricane Isidore weakens to a tropical storm over the Yucatán Peninsula.\n;September&nbsp;25\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Storm Kyle intensifies into a Category&nbsp;1 hurricane.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Storm Lili degenerates into a tropical wave.\n;September&nbsp;26\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT) – Tropical Storm Isidore makes landfall just west of Grand Isle, Louisiana, with winds of 65&nbsp;mph (100&nbsp;km/h).\n;September&nbsp;27\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT September&nbsp;26) – Tropical Storm Isidore weakens to a tropical depression.\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;26) – Hurricane Kyle reaches its peak intensity with winds of 85&nbsp;mph (140&nbsp;km/h) and a minimum barometric pressure of 980&nbsp;mbar (hPa; 28.94 inHg).\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT September&nbsp;26) – The remnants of Tropical Storm Lili regenerate into Tropical Depression Lili.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Depression Lili regains tropical storm status.\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Tropical Depression Isidore transitions into an extratropical cyclone over southwestern Pennsylvania.\n;September&nbsp;28\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Hurricane Kyle weakens to a tropical storm.\n;September&nbsp;30\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Storm Lili intensifies into a Category&nbsp;1 hurricane.\n* 1400&nbsp;UTC (10:00&nbsp;a.m. EDT) – Hurricane Lili makes a first landfall on Cayman Brac and Little Cayman, Cayman Islands, with winds of 75&nbsp;mph (120&nbsp;km/h).\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST) – Tropical Storm Kyle weakens to a tropical depression.\nOctober\n;October&nbsp;1\n* 1100&nbsp;UTC (7:00&nbsp;a.m. EDT) – Hurricane Lili intensifies into a Category&nbsp;2 hurricane and makes a second landfall on the coast of the Isle of Youth, Cuba, with winds of 105&nbsp;mph (165&nbsp;km/h).\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Depression Kyle regains tropical storm status.\n* 1400&nbsp;UTC (10:00&nbsp;a.m. EDT) – Hurricane Lili makes a third landfall near Pinar del Río Province, Cuba, with winds of 105&nbsp;mph (165&nbsp;km/h).\n;October&nbsp;2\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Hurricane Lili intensifies into a Category&nbsp;3 hurricane.\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Hurricane Lili intensifies into a Category&nbsp;4 hurricane.\n* 2013&nbsp;UTC (3:13&nbsp;p.m. CDT) – Hurricane Lili reaches its peak intensity with winds of 145&nbsp;mph (230&nbsp;km/h) and a minimum barometric pressure of 938&nbsp;mbar (hPa; 27.7&nbsp;inHg).\n;October&nbsp;3\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT) – Hurricane Lili weakens to a Category&nbsp;3 hurricane.\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT) – Hurricane Lili weakens to a Category&nbsp;1 hurricane.\n* 1300&nbsp;UTC (8:00&nbsp;a.m. CDT) – Hurricane Lili makes a fourth and final landfall near Intracoastal City, Louisiana, with winds of 90&nbsp;mph (150&nbsp;km/h).\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Hurricane Lili weakens to a tropical storm.\n;October&nbsp;4\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT) – Tropical Storm Lili weakens to a tropical depression.\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT) – Tropical Depression Lili becomes absorbed within a larger extratropical area of low pressure near the Tennessee–Arkansas border.\n;October&nbsp;5\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST) – Tropical Storm Kyle weakens to a tropical depression.\n;October&nbsp;6\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST) – Tropical Depression Kyle regains tropical storm status.\n;October&nbsp;8\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Storm Kyle weakens to a tropical depression.\n;October&nbsp;11\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Depression Kyle regains tropical storm status.\n* 1700&nbsp;UTC (1:00&nbsp;p.m. EDT) – Tropical Storm Kyle makes its first landfall near McClellanville, South Carolina, with winds of 40&nbsp;mph (65&nbsp;km/h).\n* 2200&nbsp;UTC (6:00&nbsp;p.m. EDT) – Tropical Storm Kyle makes its second and final landfall near Long Beach, North Carolina, with winds of 40&nbsp;mph  (65&nbsp;km/h).\n;October&nbsp;12\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;11) – Tropical Storm Kyle weakens to a tropical depression near Surf City, North Carolina.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT) – Tropical Depression Kyle regains tropical storm status over Pamlico Sound, North Carolina.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Storm Kyle merges with a cold front roughly  south-southwest of Nantucket, Massachusetts, making it the third longest-lived Atlantic tropical cyclone in recorded history.\n;October&nbsp;14\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT) – Tropical Depression Fourteen develops from an area of low pressure roughly 120&nbsp;mi (195&nbsp;km) north-northeast of Cabo Gracias a Dios.\n;October&nbsp;15\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT) – Tropical Depression Fourteen reaches its peak intensity with winds of 35&nbsp;mph (55&nbsp;km/h) and a minimum barometric pressure of 1002&nbsp;mbar (hPa; 29.59&nbsp;inHg).\n;October&nbsp;16\n* 1600&nbsp;UTC (12:00&nbsp;p.m. EDT) – Tropical Depression Fourteen makes landfall near Cienfuegos, Cuba, with winds of 30&nbsp;mph (45&nbsp;km/h).\n;October&nbsp;17\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;16) – Tropical Depression Fourteen is absorbed by a cold front over Cuba.\nNovember\n;November&nbsp;30\n*The 2002 Atlantic hurricane season officially ends.\nSee also\n*Lists of Atlantic hurricanes\n*Timeline of the 2002 Pacific hurricane season\nNotes\nReferences\nExternal links\n* [https://www.nhc.noaa.gov/archive/2002/ 2002 Tropical Cyclone Advisory Archive], National Hurricane Center and Central Pacific Hurricane Center\n* [https://www.ncdc.noaa.gov/sotc/tropical-cyclones/200213 Hurricanes and Tropical Storms – Annual 2002], National Centers for Environmental Information"
    }
  ]
}