{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Dire Dawa\n\nThis is chronology of Dire Dawa, a self-governing city in eastern Ethiopia, beginning with annexation from Emirate of Harar by Emperor Menelik II.\n* 1887 – Dire Dawa, a domain of Emirate of Harar, conquered by Emperor Menelik II and incorporated into the Ethiopian Empire.\n* 5 November 1896 – Menelik II accepted rename Dire Dawa to \"Addis Harar\" (New Harar).\n* 24 December 1902 – alongside Addis Ababa–Djibouiti railway cross in the location, the current Dire Dawa based its foundation. Mersha Nahu Senay became the first governor of Dire Dawa and its surroundings.\n* 1908 – the government of Ethiopia and Franco-Ethiopian Railway reorganized the original failed railway.\n*1909 – railway fully began after suspension due to financial and diplomatic reasons.\n*1909 – a French Capuchin Mission settled in Dire Dawa, by which Dire Dawa resembled \"French town\".\n*1917 – The railway successfully linked Dire Dawa to Addis Ababa.\n*7 June 1917 – the whole line of the railway halted because of civil conflict in 1916, which also allowed Dire Dawa to become trading town.\n*September 1916 – Dire Dawa was captured by troops belonging to Lij Iyasu.\n*1920s – southern eastern part of the town began developing mostly consisted of Oromo inhabitants while other Europeans played minor role. The population grew to 3,000 with total 20,000.\n*1928 – the Dire Dawa–Harar road was improved with shortening travel time to only a few hours.\n*1931 – Bank of Ethiopia opened its branch to Dire Dawa.\n*1934 – hospitals established one by the railway company other by the government.\n*6 May 1936 – General Graziani's force arrived the city reached the barbed wire fence.\n*9 May 1936 – the city was occupied by Italian troops coming from Harar.\n*29 March 1941 – the British troops started bomb to the town and was liberated by force from Harar.\n*1947 – after falling under British military administration, the city was handed back to the Ethiopian government.\n*1947 – the city was famed for soccer league, namely their team was participated in the Ethiopian Championship series. The Railroad Workers Syndicate of Dire Dawa, a labor union, was formed for welfare purposes.\n*1949 – Due to cooperation with the government, the union started strike against the imperial government who responded by brutally suppression seen as an act of insurrection or treason.\n*1955 – public address system was installed in the central square to receive and rebroadcast state radio transmissions.\n*March 1974 – as part of Ethiopian Revolution, the city suffered from unrest.  Six people were wounded by police officers fire. Many Europeans, Yemeni Arabs, and Indians left Dire Dawa and the Greek and Armenian churches were eventually closed due to dwindling membership.\n*3 February 1975 – the Derg announced that the Cotton Company of Ethiopia was among 14 textile enterprises to fully nationalized. The cement factory also nationalized.\n*August 1976 – the entire leadership of local branch of the teachers union was sacked for allegedly anti-revolutionary activities.\n*August 1977 – Dire Dawa played a role during the Ogaden War at the Battle of Dire Dawa, Somali troops attempted to capture the city, but the Ethiopian army was able to beat back the attacks.\n*May 1979 – 250 Oromos who detained in the prisons of Dire Dawa were executed by the Derg regime.\n*31 May 1991 – the Ethiopian People's Revolutionary Democratic Front (EPRDF) seized Dire Dawa and 100 people reportedly killed after their resistant by the EPRDF.\n*1991–1993 – there were series clashes between Issa and Gurgura Liberation Front and the Oromo Liberation Front owing to claiming the city.\n*1993 – Somali Region established to incorporate Dire Dawa despite opposed by Oromia Region authority. As a result, the government placed the city under its own jurisdiction to avoid territorial conflict.\n*24 June 2002 – small explosive was detonated at the headquarters of the Ethiopian Railway Commission in Dire Dawa by which the Oromo Liberation Front (OLF) claimed its responsibility for retaliation against the government.\n*2004 – Dire Dawa became chartered city during federal parliament Proclamation 416/2004.\n*August 2006 – the city was flooded when both Dechatu River and the Gorro River overflowed their banks, killing 200 people.\n*4 March 2009 – Overturned truck heading to Dengego to Dire Dawa killed 41 people and injured 50 people.\nReferences"
    }
  ]
}