{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Brussels\n\nThe following is a timeline of the history of Brussels, Belgium.\nPrehistory\n* 10,000–2600 BCE – Polished silex from the Mesolithic era are located in the Nekkersgat.\n* 5th–1st century BCE – A settlement from the La Tène culture is located on the / in Anderlecht.\n* 3000–2200 BCE – Settlements from the Michelsberg culture are located in the Sonian Forest.\n* 1000–800 BCE – Celtic tribes settle in what is now Brussels.\nRoman Period\nvilla in Jette, built 2nd century CE]]\n* A fairly important Roman settlement is in existence in Stalle.\n* 175 CE – A Roman villa is in existence in Laeken.\n* 2nd century CE – A  is constructed in Jette, located in today's .\n* 2nd–3rd century CE – A Roman villa is built on a former Neolithic settlement in Anderlecht, near the present-day /.\nMiddle Ages\n* 4th–6th centuries CE\n** Frankish tribes occupy territories between the Meuse and Scheldt rivers.\n** A Frankish tomb is built on the Zeecrabbeweg.\n* 500–700: A Merovingian cemetery containing over three hundred graves is located on the /.\n* 580 – Saint Gaugericus builds  on an island in the river Senne, laying the origin of the settlement which is to become Brussels.\n*  – Saint Alena dies in Forest.\n* 843 – 10 August: The region becomes part of Lotharingia after the signing of the Treaty of Verdun.\n* 870 – First mention of the  is made in the Treaty of Meerssen.\n* 959 – The city becomes part of Lower Lotharingia.\n* 977–979 – A castrum is constructed on Saint-Géry/Sint-Goriks Island.\n, traditionally considered the founder of what would become Brussels, ]]\n* 979 – Charles, Duke of Lower Lorraine, transfers the relics of Saint Gudula to the chapel built by Saint Gaugericus, marking the city's official founding.\n* 1001 – Otto, Duke of Lower Lorraine, becomes Count of Brussels.\n* 1012 – Saint Guy dies in Anderlecht on his return home from a pilgrimage to Jerusalem.\n* 1015–1020 – Oldest written record of the city is made by .\n* 1041–1047 – The Palace of Coudenberg begins construction.\n* 1047 – The relics of Saint Gudula are transferred from the Church of St. Gaugericus to the Church of St. Michael by Lambert II, Count of Leuven.\n* 1063–1100 – The city's first fortifications are built.\n* 1076–1078 – Lady Renilde, widow of Folcard, Lord of Anderlecht, establishes a chapter in Anderlecht and brings over the relics of Saint Guy.\n* 1095\n** Dieleghem Abbey is first attested.\n** The  is first recorded, possibly founded by Steppo de Brosele.\n* 1105 – Forest Abbey is founded.\n* 1125 – The  is first attested.\n* 1129 – The Lindekemale Mill is first attested.\n* 1135 – The city's seal is first attested, depicting the Archangel Michael robed, with outstretched wings, a halo, and the Latin inscription .\n* 1142 or 1147 – The  takes place.\n* 1150 –  is established as a leper colony, run by a community of lay brothers and sisters, outside the city's walls.\n* 1152 –  is first attested.\n* 1174 – The Grand-Place/Grote Markt is first attested as the  or .\n* 1183 – The Duchy of Brabant is formed after the merger of the Counties of Brussels and Leuven and the Landgraviate of Brabant.\n* 1187–1260 – Gerard of Brussels, a geometer and philosopher, authors .\n* 1190 – Richard I of England passes through the city.\n* 1195 – St. John's Clinic is established.\n* 1196 – La Cambre Abbey is founded by Benedictine noble .\n* 1209 – The  is first attested.\n* 1213\n** The Grand Royal and Noble Oath of the Crossbowmen of Our Lady of Sablon is established.\n** 9 August: The Meyboom is planted for the first time.\n* 1225 – The current Church of St. Michael and St. Gudula begins construction.\n* 1228 – Duke Henry the Courageous designates the Het Heideken area as common land.\n* 1229\n** The city establishes an account to collect revenues, including taxes, fines, and royalties, ensuring financial independence.\n** 10 June: Duke Henry the Courageous issues a  for the city.\n* 1238 – The Recollects establish a convent in the city.\n* 1250\n** The Great Beguinage of Brussels is formalised by Duke John the Victorious.\n** 11 June: Saint Alice dies in isolation from leprosy at La Cambre Abbey.\n* 1252 – The Beguinage of Anderlecht is founded.\n* 1253 – Karreveld Castle is first mentioned in a deed of donation by John the Victorious to his wife, Margaret.\n, 1257]]\n* 1258 – The  is first attested.\n* 1262 – The  is established by Adelaide of Burgundy, Duchess of Brabant.\n* 1265 – 19 February: Saint Boniface dies at La Cambre Abbey.\n* 1267 – Duke John the Victorious relocates the capital of the Duchy of Brabant from Leuven to the city.\n* 1270 – First mention of the ducal  is made.\n*  – Beghards first appear in the city.\n* 1282 – First mention of the Drapery Court and the  is made.\n* 1289 – The cloth guild is officially recognised by Duke John the Victorious.\n* 1290\n** Duke John the Victorious bans artisans from forming associations without prior approval from the aldermen and the amman.\n** 18 June: The hermit  is buried alive for theft and witchcraft, with a  later built on her burial site.\n* 1292 – Duke John the Victorious grants the city the right to collect taxes on crane use at the quay and on city gates rentes.\n* 1295\n** Duke John the Peaceful authorises aldermen to collect duty on beer as a town revenue.\n** Meulebeek (present-day Molenbeek-Saint-Jean) is part of the .\n* 1296 – 14 February: Obbrussel becomes part of the Coop.\n* 1301 – Schaerbeek becomes part of the Coop.\n* 1303 – 6 May: Following a rebellion sparked by patriciate efforts to join the Drapery Court, Duke John the Peaceful grants them the right through a formal privilege, marking the beginning of the .\n* 1304 – The Church of Our Lady of Victories at the Sablon is founded.\n* 1305 – Walter the Wild is killed by his cousin Joris van der Noot for their shared love for Goedele van der Zennen, and later lends his name to the .\n* 1306\n** 1 February: A quarrel between a commoner and a patrician sparks a riot and defies ducal authority.\n** Early February: Craftsmen draft a new constitution, but Duke John the Peaceful refuses to recognise it.\n** Mid-February: Duke John the Peaceful sides with the patricians, declaring virtual war on the craftsmen.\n** 19 March: The Guilds of  and  are first attested.\n** 1 May: The craftsmen are defeated in battle.\n** 12 June: The Seven Noble Houses of Brussels are first attested when Duke John the Peaceful authorises the magistrates to suppress unrest, disarming craftsmen, prohibiting guild meetings, and restoring the city government with seven aldermen chosen by the Noble Houses.\n* 1308 – The Meyboom is first attested.\n* 1312 – Etterbeek becomes part of the Coop.\n* 1315–1317 – The Great Famine ravages the region.\n* 1316 – A plague epidemic strikes the city's population.\n* 1318 – John of Ruusbroec becomes a parish priest at the Church of St. Michael and St. Gudula together with his uncle Jan Hinckaert.\n* 1320 – A horse market is first held on the Grand Sablon/Grote Zavel, continuing until 1754.\n* 1321 – Dry Borren is first attested as a hermitage.\n* 1328\n** The  is first attested.\n** The  is first attested suggesting an early presence of Romance-speakers in the city.\n* 1331 – Laeken becomes part of the Coop.\n* 1334 – The city sets up a financial structure with two treasurers overseeing accounts.\n* 1335 – 23 August: The Christian mystic Heilwige Bloemardinne, considered the city's first feminist, dies.\n* 1341 – An ordinance forbids defecation and urination in the streets under penalty of a fine, but it is widely ignored.\n* 1342 – The city bans the construction of thatched roofs to prevent fires.\n* 1344 – Willem van Duvenvoorde receives permission from the Diocese of Cambrai to add the  to the Inn of the Lek.\n* 1348 – The Ommegang begins as a Marian procession.\n* 1349\n** The Black Death arrives in the city.\n** September: A pogrom against the Jewish population takes place.\n* 1353\n** The city council decides to build a cloth hall to complement the Bread Hall and the Meat Hall.\n** A court of peacemakers for the settlement of disputes is established.\n* 1356\n** The Joyous Entry of Joanna and Wenceslaus into the city takes place.\n** 17 August: : Louis II, Count of Flanders defeats Joanna, Duchess of Brabant, who then besieges the city.\n** 24 October: The city is liberated by group of Brabantian patriots led by Everard 't Serclaes, Lord of Kruikenburg.\n** The expansion of the city's fortifications begins.\n* 1360 – 22 July:  occurs, inspired by  revolt in Leuven, as craftsmen take up arms and burn the , but the rebels are soon defeated by patricians, and stringent penal laws are enacted.\n* 1365 – The  is recognised.\n* 1367 – Rouge Cloître Abbey is founded.\n* 1368\n** Jan Collaey donates land near the  to the Alexians, on what is now the .\n** Moderate patricians begin implementing measures to grant the bourgeois greater participatory rights in the city government, as discontent and revolution continue to threaten.\nof the Jews accused of host desecration in Brussels, 22 May 1370]]\n* 1370 – 22 May: The Sacrament of Miracle occurs, killing 6–20, followed by the expulsion of the city's remaining Jewish population.\n* 1375 – 19 June: A ducal act requires all married or widowed men aged 28 or older to register in the city's books and designate affiliation with a specific Noble House.\n* 1380 – Geert Pipenpoy becomes the city's first mayor.\n* 1381 – The Grand Royal Oath of St. George of the Crossbowmen of Brussels and the Royal Grand Oath of the Archers of St. Sebastian are established by the Duchess of Brabant.\n* 1382 – After unrest in Leuven, hundreds of merchants and thousands of skilled craftsmen migrate to the city in one of its earliest large-scale migrations.\n* 1383 – The original Halle Gate is built.\n* 1388\n** 26 March: A military expedition heads to Gaasbeek Castle after Everard t'Serclaes, on his way from Ternat to the city, is mutilated by order of Sweder of Abcoude.\n** 31 March: Everard t'Serclaes dies at the  guildhall on the Grand-Place.\n* 1394 – Anderlecht and Forest become part of the Coop.\n* 1400 – Population: .\n* 1401 – The Town Hall begins construction on the Grand-Place.\n* 1402 – The Sacrament of Miracle is recognised by the church.\n* 1404 – 1 July: The  is established by Anthony, Duke of Brabant.\n* 1405 – A fire ravages the city.\n* 1406\n** 14 April: A fire destroys part of the Church of Our Lady of the Chapel and the surrounding neighbourhood.\n** 18 December: The Joyous Entry of Anthony the Great Bastard into the city takes place.\n* 1407 – A fire brigade, made up of craft guild members and locals, is in existence, though water is often in shortage despite a water service.\n* 1411 – 12 June: The Homines Intelligentiae are first mentioned in an ecclesiastical ruling by Pierre d'Ailly, and are prosecuted, resulting in the imprisonment and exile of their leader William of Hildernissen.\n* 1420\n** 5 February:  chamber of rhetoric is recognised by John IV, Duke of Brabant.\n** 30 September: Duke John IV flees the city after the States of Brabant appointed Philip of Saint Pol as .\n* 1421\n** 21 January: Duke John IV retakes the city with an army composed largely of German knights.\n** 27 January: The guilds occupy the Grand-Place and crowds demonstrate before the Coudenberg Palace in support of Philip of Saint Pol.\n** 29 January: The former Amman Jan Clutinc is decapitated, ducal household members arrested, and pro-John aldermen imprisoned or flee.\n** 11 February: The guilds, organised into the Nine Nations, join the Seven Noble Houses in city governance as part of democratic reforms.\n** 11 October: Duke John IV returns to the city.\n* 1422 – The  settle in the city.\n* 1424 – The city's aldermen issue the earliest known municipal regulation in the Low Countries on medicine and midwifery.\n* 1429 – Wein van Cotthem becomes chaplain of Dry Borren.\n* 1430 – 4 August: The city becomes part of the Burgundian State when it is inherited by Duke Philip the Good following the death of Duke Philip of Saint-Pol.\n* 1436 – Rogier van der Weyden is appointed city artist.\n* 1444 – 4 March: Count Charles the Bold lays the foundation stone of the right wing of the Town Hall.\n* 1448 – The  is decreed to be staged every year on the day of the procession on the .\n* 1452 – Manneken Pis is first mentioned as .\n* 1455\n** The Chapel of the Blessed Sacrament of the Miracle is built.\n** The Town Hall is completed.\n*1456 – 7 September: The  led by prior Hendrik van Loen is established.\n* 1457 – The Dominicans are authorised to establish a presence in the city and relocate to .\n* 1460–1486 – Adolph and Philip of Cleves settle in the  and transform it and adjacent properties into an extensive ensemble, comprising the current Hôtel Ravenstein.\n* 1461 – The legislative powers of the aldermen are reduced under the Sentence of Saint-Omer.\n* 1463 – The  is founded by William of Hulstbosch.\n* 1464 – Population: .\n* 1467 – 24 October: The Joyous Entry of Duke Charles the Bold into the city takes place.\n* 1473 – Disliking the city, Charles the Bold moves the Chamber of Accounts of Brabant to Mechelen, making it the financial and judicial capital.\npraying in front of the Church of St. Gudula, ]]\n* 1476–1476 – The city's first printing press is established by the Brethren of the Common Life.\n* 1477\n** The Habsburgs come to power in the Burgundian Netherlands, with the city as their capital.\n** March: A  under Willem van Marbais, Jan Bogaert and Willem van Ruysbroeck takes place.\n** The Harquebusiers of St. Christopher are established.\n** 11 February: Duchess Mary of Burgundy grants the Great Privilege, which restores the liberties of the States General abrogated by her father and grandfather.\n** 4 June: The Joyous Entry of Duchess Mary of Burgundy into the city takes place.\n* 1479 – 13 October:  chamber of rhetoric is first attested.\n* 1480 – The  is established.\n* 1486\n**  chamber of rhetoric is first attested following the Joyous Entry of Maximilian I, Holy Roman Emperor.\n** 6 May:  chamber of rhetoric is first attested.\n* 1487 – The  in  is founded by Nicolas de Vucht.\n* 1488\n** 18 September: Philip of Cleves enters the city through the Flanders Gate at the head of a French-Flemish army.\n** 20 September: The city proclaims the Peace of Bruges, officially joining the Flemish Revolt.\n** November: The city attempts to capture Beersel Castle but fails.\n* 1489\n** 23 January: An ordinance declares the city's support for Philip of Cleves and threatens sanctions against supporters of Maximilian I.\n** April: The city besieges and captures Beersel Castle; William of Ramilly and several soldiers are lynched at the Grand-Place.\n** 14 August: The  is signed, punishing the city and Leuven for their roles in the Flemish Revolt.\n* 1499 – 25 February: The  is established by members of De Lelie and De Violette.\n16th century\n* 1502–1503: Two preachers who condemn the veneration of the Virgin Mary are burned at the stake.\n* 1507 – 15 September:  chamber of rhetoric is established following the merger of De Lelie and De Violette, with  becoming its first factor.\n* 1511 – The Miracle of 1511 takes place.\n* 1513 – Adriaan Florensz Boeyens, the future Pope Adrian VI, is appointed dean of the chapter of St. Guido in Anderlecht.\n* 1515\n** King Henry VIII attempts to recruit several armourers from the city, but the local authorities prevent him.\n** 28 January: The Joyous Entry of Charles V, Holy Roman Emperor, and Philip the Prudent into the city takes place.\n* 1516\n**  is appointed the first master-general of the mails by Emperor Charles V and creates a postal link between the city and Vienna.\n** 4 December: The Treaty of Brussels is signed, ending the War of the League of Cambrai.\n* 1518 – 30 August: Lauken van Moeseke is decapitated for doubting the value of the sacraments.\n* 1521\n** Lutheran books are prohibited.\n** May–October: Erasmus moves to Anderlecht for health, political, and religious reasons and stays in the house of Canon Peter Wijchmans.\n* 1522\n** September: The  is built.\n** 8 February: The Treaty of Brussels between Charles V and Archduke Ferdinand, concerning the latter's sovereignty over the Austrian Hereditary Lands, is signed.\nin Brussels, 1 July 1523]]\n* 1523\n** January: Maximilianus Transylvanus publishes , a key source on the Magellan expedition.\n** 1 July: Jan van Essen and Hendrik Vos are burned at the stake at the Grand-Place, becoming the first victims of the Inquisition in the Netherlands.\n* 1526\n** Pronouncing Martin Luther's name is prohibited.\n** 20 October: A fire destroys three houses in the /.\n* 1527 – Several tapestry weavers, including Pieter de Pannemaker, are punished for attending sermons by the Lutheran Claes van der Elst.\n* 1528 – 15 September: , a collaborator of Jan van Essen and Hendrik Vos, dies in captivity.\n* 1530s – Munsterites and Mennonites arrive in the city.\n* 1531 – April: Governess Mary of Hungary enters the city with Charles V and makes the city the official capital of the Netherlands and permanent seat of the court.\n* 1536 – The original King's House is built on the Grand-Place for the Duke of Brabant.\n* 1539 – 3 January: The  is established in response to Charles V's 7 October 1531 edict, which banned begging and centralised town welfare revenue to combat pauperism.\n* 1543\n** Brussels lace is explicitly mentioned for the first time in a list of presents given to Princess Mary for New Year's.\n** Calvinists establish Dutch- and French-speaking communities in the city, the latter mostly composed of court nobility and the wealthy, meeting in secret conventicles.\n* 1544 – Andreas Vesalius moves into a large estate in , near today's .\n* 1547 – Municipal liberties are codified.\n* 1549 – 1 April: A grand tournament is held on  to mark the visit of Prince Philip during his tour of the Netherlands following his investiture.\n* 1550\n** The Granvelle Palace is built.\n** Construction of the Willebroek Canal begins, linking the city to the Rupel.\n** Education is available at five Latin schools.\n* 1554 – Margaretha von Waldeck, allegedly the inspiration for Snow White, died in the city, with chronicles suggesting she may have been poisoned with arsenic.\n* 1555 – 25 October: Charles V abdicates in the  of the Palace of Coudenberg.\n* 1556 – 7 January: A decree forbids wooden dwellings, but the law is not enforced.\n* 1559 – 12 April: Philip the Prudent establishes the Royal Library of the Low Countries, using the  as its core collection.\n* 1561 – 12 October: The city's port and the Willebroek Canal are opened.\n* 1564\n** Docks are constructed on the wasteland between the two city ramparts.\n** 16 November: Jan Pannant is executed at the Grand-Place using a breaking wheel for double homicide and theft, as later described in the diary of .\n* 1565 – 11 November: The wedding of Alexander Farnese, Duke of Parma, and Maria of Portugal, Hereditary Princess of Parma, takes place.\n* 1566\n** 5 April: The signatories of the  gain access to the Palace of Coudenberg to present it to Margaret of Parma.\n** 6 April: The  is held by the Compromise of Nobles in the .\n** June: Large preachings occur as iconoclasts wreak havoc, and Protestants throw the 15th-century Black Madonna statue into the Senne.\npresiding over the Council of Troubles in Brussels, 1567]]\n* 1567\n** 22 August: Fernando Álvarez de Toledo, 3rd Duke of Alba, arrives in the city.\n** 30 August: Margaret of Parma resigns as Governess of the Netherlands and flees the city.\n** 9 September: The Council of Troubles is established.\nand Horn in Brussels, 5 June 1568]]\n* 1568\n** 1 June: Eighteen signatories members the Compromise of Nobles are decapitated at the Peerdemerct.\n** 5 June: The Counts of Egmont and Horn are  at the Grand-Place.\n* 1569 – A knighting and jousting tournament held in honour of the Duke of Alva at the Grand-Place.\n* 1570 – 11 February: , the Provost of Justice, is hanged for abusing his power in the conviction of the Geuzen.\n* 1573 – Many Protestants return to the city after being executed and expelled.\n* 1574 – A pilgrim returning from Palestine notices a resemblance between the Valley of Josaphat and the Valley of the Roodebeek, renaming it and later erecting a column on the .\n* 1575\n** A plague outbreak kills thousands.\n** Protestants are allowed to worship publicly.\n* 1576 – 4 September: The  is founded following  of the Council of State and the Secret Council.\nof William the Silent into Brussels, 24 September 1577]]\n* 1577\n** 9 January: The First Union of Brussels is established by the States General of the Netherlands.\n** 24 July: The  occurs, ending the First Union of Brussels.\n** 10 December: The Second Union of Brussels is declared.\n** 24 September: The  into the city takes place.\n* 1579\n** The city joins the Union of Utrecht.\n** 6 June: The Great Beguinage is looted by Scottish auxiliary troops as part of the larger Beeldenstorm.\n** 25 July: A truce is declared between the city's religious groups, guaranteeing freedom of religion and assigning the Chapel Church to the Reformed Protestants.\n* 1580\n** 1 May: All public displays of Catholicism are banned.\n** 9–10 July: The  Halle under the command of .\n* 1581\n** Spanish troops under Alexander Farnese burn Ixelles to the ground.\n** 24 July: Catholic worship is banned in the city.\n* 1585 – 10 March: The  by the Army of Flanders.\n* 1587 – 20 July: During a mystery play performed by the Brethren of the Common Life, a lodge collapses, killing the author Petrus Fabri and alderman Eustachius Pipenpoy, and injuring several spectators.\n* 1589 – October: The city grants the Augustinians a tax exemption in exchange for holding mass at the Town Hall for three months each year and serving as firemen when needed.\n* 1590 – 31 March: The city decides to construct the , a complex featuring residential blocks, kitchens, a bakery, and cells for the mentally ill.\n* 1594\n** 30 January: The Joyous Entry of Archduke Ernest of Austria into the city takes place.\n** 21 December: Anna Utenhoven, arrested with Anna and Catharina Rampaerts, is found guilty of heresy and buried alive on the , becoming the last heretic executed in the Low Countries.\n* 1595\n** The Niederländische Postkurs postal service is established in the city.\n** 13 September: Josyne van Beethoven is burned at the stake at the Grand-Place for witchcraft.\n* 1598 – The Royal Guild of St. Sebastian of Schaerbeek is founded as a branch of the Royal Grand Oath of the Archers of St. Sebastian.\n* 1599\n** 13 July: An ordinance mandates that slackers are both to be branded and flogged.\n** 5 September: The Joyous Entry of Albert VII, Archduke of Austria, and Isabella Clara Eugenia into the city takes place.\n** 14 November: Joanne Berkeley is installed as the first abbess of the  by Archbishop Mathias Hovius.\n17th century\n* 1604 – 16 July: St. John Berchmans College is established.\n* 1607 – The Discalced Carmelite Convent is established by Ana de Jesús.\n* 1612 – Upon his death, Priest Nicaise Mozet establishes the  a small hermitage for women.\nat the Sablon/Zavel, 31 May 1615]]\n* 1616 – 1 September: The  is established.\n* 1618 – 28 September: The  opens.\n* 1619\n** Jérôme Duquesnoy is commissioned to recast Manneken Pis in bronze for 50 florins.\n** 12 July: A riot breaks out after the city imposes a tax on wine and beer (the gigot).\n** 16 December: Daniel Raessens is tasked with providing the pedestal for Manneken Pis for 180 florins.\n*  – The  is created near the / as a collection point for human and animal waste for rural disposal, while industrial waste is dumped into the Senne.\n* 1622 – The funeral of Archduke Albert VII takes place.\n* 1623\n** The  is established.\n** The Brotherhood of St. Hubertus is established.\n*1624 – The Brotherhood of St. Joseph is established.\n* 1625\n** The  opens to force beggars, slackers, and vagrants to produce textile goods, with Daniel Sirejacobs serving as its first director.\n** 24 November: The first postulants enter the .\n'', Jan Brueghel the Younger, ]]\n* 1631\n** The Brotherhoods of St. Eligius and St. Guido are established for the coachmen of the Court under the protection of the Infanta Isabella.\n** Most opponents of Cardinal Richelieu take refuge in the city, including the Dukes of Vendôme and Bouillon, as well as Marie de' Medici.\n* 1634 – In a sparsely populated area at the end of the , a house is constructed to isolate and care for plague sufferers.\n* 1638 – 12 May: The Royal Brotherhood of the Holy Name of Mary is established.\n* 1646\n** The  is founded.\n** 6 October: Purple rain falls on the city; the downpour elicits scientific examination and explanation.\n* 1648 – The  is established.\n* 1654 – The Barony of Jette is formed.\n* 1656 – During the Counter-Reformation, Protestants hold secret services until chapels open in the Dutch embassy and the English mission, allowing public worship.\n* 1657 – De Wijngaard theatre company is established, possibly out of 't Mariacranske.\n* 1659 – The Barony of Jette is elevated to a county.\n, Jan Baptist Bonnecroy, ]]\n* 1668\n** 7 June: The city enacts an ordinance to combat the Black Death and appoints a Plague Master to oversee the care of the sick.\n** 27 July: To prevent the spread of the Black Death, the city restricts movement to evenings, bans gatherings, and prohibits the sale of certain foods, while confiscating and destroying grain, flour, and meat.\n* 1669 – 13 October: The  is consecrated.\n* 1670 – 7 January: A posthumous mass is held in honour of the victims of the Black Death.\n* 1672 – The  is built.\n* 1675 – The Royal Military and Mathematics Academy of Brussels is established.\n* 1677 – Evere is incorporated into the Principality of Hornes after its lord, Eugene Maximilian of Hornes, is elevated to the rank of prince by King Charles II of Spain.\n* 1682 – 24 January: The Opéra du Quai au Foin'' opens as the first public theatre in the city.\n* 1684\n** French troops burn down Ixelles, Koekelberg, Molenbeek, Berchem, and Uccle.\n** 17 January – 400 French cavalrymen set fire to several dozen small houses in Ixelles.\n* 1686 – 3 September: The Palace of Thurn and Taxis on the Sablon hosts a grand banquet to celebrate the Holy League's victory in the Siege of Buda. Fireworks light up the Sablon, attracting a crowd.\n* 1690 – 11–12 October: A fire breaks out in  guildhall on the Grand-Place.\n* 1691 – The  settle in .\nin flames during the bombardment of Brussels, 13–15 August 1695]]\n* 1695\n** 13–15 August: The city is bombarded by the French, destroying a third of its buildings, including the Grand-Place.\n** 19 August: Manneken Pis is returned, with Latin verses, after citizens removed the statue to protect it during the bombardment.\n* 1696 – 7 November: The Tour du Miroir collapses.\n* 1697–1698: Reconstruction of the Grand-Place is largely completed.\n* 1698 – 1 May: Manneken Pis receives his first costume from Governor Maximilian II Emanuel of Bavaria.\n* 1699 – 17 December: The , a compendium of rights and privileges granted to the Nine Nations, is banned, sparking armed resistance met by Spanish and Bavarian battalions.\n* 1700\n** April: The  conflict ends.\n** 20 August: Governor Maximilian II Emmanuel issues the Additional Decree, tightening royal control and curbing local powers.\n** 17 October: The first Theatre of La Monnaie, then spelled La Monnoye, opens.\n18th century\n* 1701 – The Nassau Palace suffers extensive damage from a fire.\n* 1702\n** The Brotherhood of St. Aubert is established.\n** 22 February: The Joyous Entry of Philip V into the city takes place.\n* 1703 – 3 February: The Chamber of Commerce and Industry is founded by Isidro de la Cueva y Benavides, much to the displeasure of the Drapery Court.\n* 1705 – The  is built.\n* 1706 – 27 May: The English–Dutch army enters the city through the Laeken Gate after the French defeat at the Battle of Ramillies.\n* 1708 – 22–27 November: The city is attacked by the French, which it repels.\n* 1711 – 30 September: The Royal Academy of Fine Arts is established.\n* 1714\n** March 6: The Treaty of Rastatt is signed; the city becomes part of the Austrian Netherlands.\n** 25 July: The Belfry of Brussels collapses.\n* 1717\n** 14–18 April: Peter the Great visits the city.\n** 5 November: The Theatre of La Monnaie is publicly sold to Jean-Baptiste Meeûs.\n* 1719 – 19 September: François Anneessens is executed at the Grand-Place.\n* 1724 – March: The Senne floods: The lower city is 3 feet underwater.\n* 1731 – 3–4 February: The Palace of Coudenberg is destroyed by fire, killing 1.\n* 1733 – 10 February: The city instructs gravediggers to bury corpses at least three feet deep to prevent dogs from uncovering them and causing infections.\n* 1744 – Prince Charles Alexander of Lorraine enters the city.\n* 1745 – Manneken Pis is stolen by the English and taken to Geraardsbergen, later returned by its residents.\n, Louis-Nicolas van Blarenberghe, 1746]]\n* 1746 – 29 January–22 February: The city is besieged and captured by the French.\n* 1747 – King Louis XV gifts Manneken Pis his oldest surviving outfit and makes him a knight of the Royal and Military Order of Saint-Louis after his soldiers stole the statue.\n* 1749 – January: The city is returned to Austria with the rest of the Austrian Netherlands following the 1748 Treaty of Aix-la-Chapelle.\n* 1751 – The , gifted by Thomas Bruce, 2nd Earl of Ailesbury, is built.\n* 1755 – Population: 57,370.\n* 1762 – Despite official disapproval, 400 Protestant exiles arrive from Geneva.\n* 1767 – The first census of the inhabitants of the city occurs.\n* 1769 – Vanparys Confiserie is established by Felix Vanparys.\n* 1770 – The original pedestal of Manneken Pis'' is replaced with a stone niche intended for the / fountain.\n* 1771–1778 –  is first attested on the Ferraris map.\n* 1772\n** The Opéra flamand is established.\n** Faro is first attested.\n** 16 December: The Imperial and Royal Academy is established.\n* 1774 – The Rue Royale/Koningsstraat is laid out.\n* 1775\n** Brussels Park is laid out.\n** The Place des Martyrs/Martelaarsplein, then called the /, is laid out.\n* 1777 – 1 October: The  opens.\n* 1778 – The Palace of the Council of Brabant (present-day Palace of the Nation) begins construction.\n* 1779\n** The  is built.\n** Governor Charles Alexander hosts the first horse races outside the British Empire at the .\n* 1781 – Joseph II, Holy Roman Emperor visits the city.\n* 1782\n** The Place Royale/Koningsplein is laid out.\n** Emperor Joseph II orders the dismantling of the city's fortifications; the Fort of Monterey is sold and destroyed.\n** 1 May: The brothers Alexandre and Herman Bultos receive permission to construct the Royal Park Theatre as an annex to the Theatre of La Monnaie.\n* 1783\n** English residents establish an Anglican church.\n** The Royal Palace of Brussels begins construction.\n, then named Schonenberg, built in 1784]]\n* 1784\n** The city's gates are demolished, except for the Halle Gate and the Laeken Gate.\n** The Palace of Schonenberg (present-day Palace of Laeken) is built.\n* 1785 – The Concert Noble is founded by the Governors Albert Casimir and Maria Christina.\n* 1787\n** The Vauxhall opens.\n** 4 June: The deans of the Nine Nations call for a citizens' guard, and artisans, merchants, and residents wearing patriotic cockades rally in response.\n** 20 September: A fight erupts outside a café between guards and Austrian troops, killing one guard.\n** 21 September: At the guard's funeral, Austrian troops advance on the Church of St. Gaugericus, sparking street fighting as residents rush to the Grand-Place, build barricades, and force the Austrians to withdraw and annul unpopular decrees.\n** 29 October: The Church of St. James on Coudenberg is consecrated.\n* 1788 – 22 January: A day after his arrival, troops under General  open fire on an unarmed demonstration at the Grand-Place, killing several.\nand the Palace of the Council of Brabant'', Aurèle-Augustin Simons, 1789]]\n* 1789\n** Emperor Joseph II abolishes all provincial privileges, including the Joyous Entry, and announces he will rule alone, bypassing the States of Brabant.\n** The secret society Pro Aris et Focis is founded to prepare for the Brabant Revolution against Emperor Joseph II.\n** 8–9 December: Villagers around the city attack Austrian garrisons.\n** 10–12 December: The  takes place, marking the start of the Brabant Revolution in the city.\n** 18 December: A celebratory procession is held to mark the Austrians' retreat.\n* 1790\n** 10 January: The  proclaim the United Belgian States; Governors Albert Casimir and Maria Christina flee the city to Vienna.\n** 11 January: The city becomes the capital of the United Belgian States.\n** 6 October:  is lynched after insulting the Capuchin  during a Marian procession.\n** 2 December: The Austrians take the city back and pledge to reverse the reforms of Joseph II.\n* 1792\n** 13 November: The Battle of Anderlecht occurs between Habsburg Empire and the French First Republic.\n** 14 November: Following the French victory the previous day, General Charles-François Dumouriez enters the city to cheering crowds, as several Walloon soldiers join the French Army.\n** 15 December: A decree by the French National Convention dissolves local authorities, abolishes traditional taxes, and orders municipal governments to provide troops for France.\n** 29 December: Elections result in a majority for traditionalists, while democratic activists win seats in a provisional provincial assembly due to a single permitted polling station, the Cathedral of St. Michael and St. Gudula.\n* 1793\n** January: Street names are changed, symbols of royal authority removed, and religion is demeaned.\n** 27 February: Residents vote for union with France in French-supervised elections, while church statues are destroyed, archives burned, and homes looted.\n** 24 March: Promising to restore traditional institutions, the Austrians return to a warm welcome as supporters of the old provincial States, the nations, and the high clergy rally citizens against the French.\n** 9 August: An explosion of gunpowder-laden carts causes widespread destruction in Cureghem/Kuregem.\n* 1794: 9 July: French troops re-enter the city after the Austrian defeat at the Battle of Fleurus.\n* 1795 – 1 October: The city is formally annexed by France and becomes the chef-lieu of the department of the Dyle.\n* 1796\n** The Guilds of Brussels are suppressed.\n** La Cambre Abbey and Forest Abbey are abolished.\n** The Church of St. Gaugericus is demolished.\n** 17 June: The civil registry is introduced.\n* 1797\n** 31 May: The  is established, replacing the Old University of Leuven.\n** 4 September: The  is abolished, prompting protests from municipal authorities.\n** 17 December: Brussels Park is officially opened as a public park.\n* 1798\n** 27 May: The city renames streets with religious or monarchist connotations to more republican names, as required by the French administration.\n** 7 December: Prisoners of war from Hasselt, captured for participating in the Peasants' War, are paraded through the streets.\n* 1800\n** Population: 66,297.\n** 10 January: The  literary society is established.\n** 15 August: The  is established, marking the formation of Belgium's first professional firefighting unit.\n19th century\n20th century\n21st century\nEvolution of the Brussels map\n16th century\nFile:Brussel 1555 Deventer.jpg|1555\nFile:Guicciardini Map of Brussels.png|1567\n17th century\nFile:Theatrum Vrbium 00346 Brüssel.jpg|1610\nBrussel 1657 Janssonius.jpg|~1657\n18th century\nFile:LouisXIV maps1700 Bruxelles.jpg|~1700\nFile:Fricx-Harrewijn, Plan de la ville de Brusselles, 1711.png|~1711\nFile:Brussel 1740 Seutter.JPG|1740\nFile:Brussels map Rouge1745.jpg|~1745\nFile:Louis-André Dupuis, Plan topographique de la ville de Bruxelles et de ses environs, 1777.jpg|1777\n19th century\nFile:Brussel 1830.reduced.tif|1830\nFile:Brussels 1837.jpg|1837\nFile:1843 Plan de Bruxelles, by the Etablissement géographique de Bruxelles, from the Digital Commonwealth - commonwealth ht250704m.jpg|1843\nFile:Plan Instantané de la Ville de Bruxelles, 1875. 1876. - no-nb krt 00778.corrected.jpg|1876\nFile:Bruxelles et ses environs, Institut Cartographique Militaire, 1894 (cropped).jpg|1894\n20th century\nFile:Alfred Castaigne (1857-1930), Bruxelles et sa banlieue, 1900.png|1900\nFile:Brussels, map 1907.jpg|1907\nSee also\n* History of Brussels\n* List of mayors of the City of Brussels (largest municipality in the Brussels-Capital Region)\n* List of municipalities of the Brussels-Capital Region\n* Timeline of Belgian history\n* Timelines of other municipalities in Belgium: Antwerp, Bruges, Ghent, Leuven, Liège\nReferences\nBibliography\nIn English\n;Published in the 19th century\n*\n*\n*\n*\n*\n*\n*\n*\n*\n;Published in the 20th century\n*\n|hdl=2027/njp.32101065312876 |title-link=Chambers's Encyclopaedia }}\n*\n*\n|title-link=Catholic Encyclopedia }}\n*\n*\n;Published in the 21st century\n*\n*  - translation of \"[https://journals.openedition.org/brussels/1429 L’intégration des nouveaux arrivants à Bruxelles : un puzzle institutionnel et politique]\"\nIn other languages\n*\n*\n*\n*\n*\n*\nExternal links\n* Europeana. [https://www.europeana.eu/portal/search.html?query=brussels&rows=96 Items related to Brussels], various dates."
    }
  ]
}