{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2012 Atlantic hurricane season\n\nThe 2012 Atlantic hurricane season was an event in the annual hurricane season in the north Atlantic Ocean. For the third year in a row there were 19 named storms. The season officially began on June&nbsp;1, 2012, and ended on November&nbsp;30, 2012, dates that conventionally delimit the period of each year when most tropical cyclones develop in the Atlantic basin. Surprisingly, two preseason storms formed: Alberto on May&nbsp;19, and Beryl on May&nbsp;26. This was the first such occurrence since the 1951 season. The final storm to dissipate (second-to-last to become a named storm) was Sandy, on October&nbsp;29. Altogether, ten storms became hurricanes, of which two intensified into major hurricanes.|group=\"nb\"}}) and higher on the 5-level Saffir–Simpson wind speed scale are considered major hurricanes.|group=\"nb\"}}\nStorm impact during the season was widespread and ruinous, with the most significant storms in term of loss of life and damage being hurricanes Isaac and Sandy. A Category&nbsp;1 on the Saffir–Simpson hurricane wind scale, Isaac was a large system that moved ashore the coast of Louisiana on August&nbsp;12; the storm resulted in 41 deaths overall. Sandy, the second and final major hurricane of the season, was the largest Atlantic hurricane ever recorded, with a wind diameter of more than . The system moved ashore the southern coast of New Jersey as an extratropical cyclone in late October. During its duration as a tropical cyclone, Sandy caused at least $68 billion (2012 USD) in damage and 285 fatalities. Sandy is the second-costliest Atlantic hurricane in recorded history, surpassed only by Hurricane Katrina during the 2005 season.\nThis timeline includes information that was not operationally released, meaning that data from post-storm reviews by the National Hurricane Center, such as a storm that was not operationally warned upon, has been included. This timeline documents tropical cyclone formations, strengthening, weakening, landfalls, extratropical transitions, and dissipations during the season.\nBy convention, meteorologists use one time zone when issuing forecasts and making observations: Coordinated Universal Time (UTC), and also use the 24-hour clock (where 00:00 = midnight&nbsp;UTC). The National Hurricane Center uses both UTC&nbsp;and the time zone where the center of the tropical cyclone is currently located. The time zones utilized (east to west) prior to 2020 were: Atlantic, Eastern, and Central. In this timeline, all information is listed by UTC first with the respective regional time included in parentheses. Additionally, figures for maximum sustained winds and position estimates are rounded to the nearest 5&nbsp;units (knots, miles, or kilometers), following the convention used in the National Hurricane Center's products. Direct wind observations are rounded to the nearest whole number. Atmospheric pressures are listed to the nearest millibar and nearest hundredth of an inch of mercury.\nTimeline\nMay\n;May&nbsp;19\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT)&nbsp;– A tropical depression develops from an area of low pressure offshore the North Carolina–South Carolina border.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– The tropical depression intensifies into Tropical Storm Alberto.\n;May&nbsp;20\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT May&nbsp;19)&nbsp;– Tropical Storm Alberto attains its peak intensity with winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of 995&nbsp;mbar (hPa; 29.38&nbsp;inHg).\n;May&nbsp;22\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Alberto degenerates into a non-convective remnant area of low pressure a few hundred miles north of Bermuda.\n;May&nbsp;26\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT May&nbsp;25)&nbsp;– Subtropical Storm Beryl develops from an area of low pressure roughly  east of Jacksonville, Florida.\n;May&nbsp;27\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT)&nbsp;– Subtropical Storm Beryl transitions into a tropical storm.\n* 2300&nbsp;UTC (7:00&nbsp;p.m. EDT)&nbsp;– Tropical Storm Beryl attains its peak intensity with winds of 70&nbsp;mph (110&nbsp;km/h) and a minimum barometric pressure of 992&nbsp;mbar (hPa; 29.29&nbsp;inHg).\n;May&nbsp;28\n* 0410&nbsp;UTC (12:10&nbsp;a.m. EDT)&nbsp;– Tropical Storm Beryl makes landfall near Jacksonville Beach, Florida, with winds of 65&nbsp;mph (100&nbsp;km/h).\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Beryl weakens to a tropical depression.\n;May&nbsp;30\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT)&nbsp;– Tropical Depression Beryl regains tropical storm intensity roughly 190&nbsp;mi (305&nbsp;km) southwest of Wilmington, North Carolina.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT)&nbsp;– Tropical Depression Beryl degenerates into a non-convective remnant area of low pressure near the coast of North Carolina.\nJune\n;June&nbsp;1\n*The 2012 Atlantic hurricane season officially begins.\n;June&nbsp;18\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– A subtropical storm develops from an area of low pressure roughly  north-northeast of Bermuda.\n;June&nbsp;19\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– The subtropical storm transitions into Tropical Storm Chris.\n;June&nbsp;21\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Chris intensifies into a Category&nbsp;1 hurricane on the Saffir–Simpson hurricane wind scale, becoming the first of the 2012 season.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Chris attains its peak intensity with winds of 85&nbsp;mph (140&nbsp;km/h) and a minimum barometric pressure of 974&nbsp;mbar (hPa; 28.76&nbsp;inHg) roughly  southeast of Cape Race.\n;June&nbsp;22\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST June&nbsp;21)&nbsp;– Hurricane Chris weakens to a tropical storm.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Chris transitions into an extratropical cyclone roughly  east-southeast of Cape Race.\n;June&nbsp;23\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Debby develops from an area of low pressure roughly  south-southeast of the mouth of the Mississippi River.\n;June&nbsp;24\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT)&nbsp;– Tropical Storm Debby attains maximum sustained winds of 65&nbsp;mph (100&nbsp;km/h).\n;June&nbsp;25\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT June&nbsp;24)&nbsp;– Tropical Storm Debby attains its peak intensity with a minimum barometric pressure of 990&nbsp;mbar (hPa; 29.23&nbsp;inHg).\n;June&nbsp;26\n* 2100&nbsp;UTC (5:00&nbsp;p.m. EDT)&nbsp;– Tropical Storm Debby makes landfall near Steinhatchee, Florida, with winds of 40&nbsp;mph (65&nbsp;km/h).\n;June&nbsp;27\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT June&nbsp;26)&nbsp;– Tropical Storm Debby weakens to a tropical depression roughly  southwest of Gainesville, Florida.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT)&nbsp;– Tropical Storm Debby dissipates offshore the eastern coast of Florida.\nJuly\n*No tropical cyclones form in the Atlantic Ocean during the month of July.\nAugust\n;August&nbsp;1\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Five develops from an area of low pressure roughly  east of the Windward Islands.\n;August&nbsp;2\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Five intensifies into Tropical Storm Ernesto.\n;August&nbsp;3\n* 1200–1800&nbsp;UTC (8:00&nbsp;a.m. – 2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Ernesto crosses the Windward Islands into the eastern Caribbean Sea.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Depression Six develops from an area of low pressure roughly  south-southwest of the southernmost Cape Verde Islands.\n;August&nbsp;4\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Six intensifies into Tropical Storm Florence roughly  west of the southernmost Cape Verde Islands.\n;August&nbsp;5\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST August&nbsp;4)&nbsp;– Tropical Storm Florence attains its peak intensity with winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of 1002&nbsp;mbar (hPa; 29.59&nbsp;inHg).\n;August&nbsp;6\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Florence weakens to a tropical depression.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Florence degenerates into a non-convective remnant area of low pressure roughly midway between the Cape Verde Islands and the Lesser Antilles.\n;August&nbsp;7\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Ernesto intensifies into a Category&nbsp;1 hurricane roughly  east of Chetumal, Mexico.\n;August&nbsp;8\n* 0100&nbsp;UTC (8:00&nbsp;p.m. CDT August&nbsp;7)&nbsp;– Hurricane Ernesto makes its first landfall on Cayo Norte in Banco Chinchorro, Mexico, with winds of 90&nbsp;mph (150&nbsp;km/h).\n* 0315&nbsp;UTC (10:15&nbsp;p.m. CDT August&nbsp;7)&nbsp;– Hurricane Ernesto intensifies into a Category&nbsp;2 hurricane, attains its peak intensity with winds of 100&nbsp;mph (160&nbsp;km/h) and a minimum barometric pressure of 973&nbsp;mbar (hPa; 28.73&nbsp;inHg), and simultaneously makes its second landfall near Majaual, Mexico.\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT)&nbsp;– Hurricane Ernesto weakens to a tropical storm.\n* 1800–0000&nbsp;UTC (1:00–7:00&nbsp;p.m. CDT)&nbsp;– Tropical Storm Ernesto emerges into the Bay of Campeche.\n;August&nbsp;9\n* 1615&nbsp;UTC (11:15&nbsp;a.m. CDT)&nbsp;– Tropical Storm Ernesto makes its third and final landfall roughly  northwest of Coatzacoalcos, Mexico, with winds of 65&nbsp;mph (100&nbsp;km/h).\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Depression Seven develops from an area of low pressure roughly midway between the Cape Verde Islands and the Lesser Antilles.\n;August&nbsp;10\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT)&nbsp;– Tropical Storm Ernesto weakens to a tropical depression.\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT)&nbsp;– Tropical Depression Ernesto dissipates over the mountainous terrain of Mexico.\n;August&nbsp;11\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Seven degenerates into a tropical wave east of the Lesser Antilles.\n;August&nbsp;15\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Eight develops from an area of low pressure roughly  southeast of Bermuda.\n;August&nbsp;16\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST August&nbsp;15)&nbsp;– Tropical Depression Eight intensifies into Tropical Storm Gordon.\n;August&nbsp;17\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT)&nbsp;– The remnants of Tropical Depression Seven regenerate into a tropical depression roughly  southeast of Tampico, Mexico.\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT)&nbsp;– Tropical Depression Seven intensifies into Tropical Storm Helene and simultaneously attains its peak intensity with winds of 45&nbsp;mph (75&nbsp;km/h) and a minimum barometric pressure of 1004&nbsp;mbar (hPa; 29.65&nbsp;inHg).\n;August&nbsp;18\n* 0600&nbsp;UTC (1:00&nbsp;a.m. CDT)&nbsp;– Tropical Storm Helene weakens to a tropical depression.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Gordon intensifies into a Category&nbsp;1 hurricane roughly  west-southwest of the Azores.\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT)&nbsp;– Tropical Depression Helene makes landfall near Tampico, Mexico, with winds of 35&nbsp;mph (55&nbsp;km/h).\n;August&nbsp;19\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT August&nbsp;18)&nbsp;– Tropical Depression Helene degenerates into a non-convective remnant area of low pressure over the mountainous terrain of Mexico.\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST August&nbsp;18)&nbsp;– Hurricane Gordon attains its peak intensity with winds of 110&nbsp;mph (175&nbsp;km/h) and a minimum barometric pressure of 965&nbsp;mbar (hPa; 28.49&nbsp;inHg).\n;August&nbsp;20\n* 0530&nbsp;UTC (1:30&nbsp;a.m. AST)&nbsp;– Hurricane Gordon makes landfall on Santa Maria Island, Azores, with winds of 75&nbsp;mph (120&nbsp;km/h).\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Gordon weakens to a tropical storm.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Gordon degenerates into a non-convective remnant area of low pressure northeast of the Azores.\n;August&nbsp;21\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Nine develops from an area of low pressure roughly  east of the Lesser Antilles.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Depression Nine intensifies into Tropical Storm Isaac roughly  east of the Lesser Antilles.\n;August&nbsp;22\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Ten develops from an area of low pressure roughly  west-southwest of the Cape Verde Islands.\n* 1800–0000&nbsp;UTC August&nbsp;23 (2:00–8:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Isaac crosses the Windward Islands into the eastern Caribbean Sea.\n;August&nbsp;23\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Ten intensifies into Tropical Storm Joyce roughly  west of the Cape Verde Islands.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Joyce attains its peak intensity with winds of 40&nbsp;mph (65&nbsp;km/h) and a minimum barometric pressure of 1006&nbsp;mbar (hPa; 29.71&nbsp;inHg).\n;August&nbsp;24\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST August&nbsp;23)&nbsp;– Tropical Storm Joyce weakens to a tropical depression.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Joyce degenerates into a non-convective remnant area of low pressure.\n;August&nbsp;25\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Isaac makes its first landfall near Jacmel, Haiti, with winds of 65&nbsp;mph (100&nbsp;km/h).\n* 1500&nbsp;UTC (11:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Isaac makes its second landfall near Cajobabo, Guantánamo, Cuba, with winds of 60&nbsp;mph (95&nbsp;km/h).\n;August&nbsp;27\n* 0000–0600&nbsp;UTC (8:00&nbsp;p.m. August&nbsp;26–2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Isaac crosses the Straits of Florida into the Gulf of Mexico.\n;August&nbsp;28\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT)&nbsp;– Tropical Storm Isaac intensifies into a Category&nbsp;1 hurricane roughly  southeast of the mouth of the Mississippi River.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Depression Eleven develops from an area of low pressure roughly  southwest of the western Azores.\n;August&nbsp;29\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT August&nbsp;28)&nbsp;– Hurricane Isaac makes its third landfall at Southwest Pass at the mouth of the Mississippi River, with winds of 80&nbsp;mph (130&nbsp;km/h).\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST August&nbsp;28)&nbsp;– Tropical Depression Eleven intensifies into Tropical Storm Kirk.\n* 0300&nbsp;UTC (10:00&nbsp;a.m. CDT)&nbsp;– Hurricane Isaac attains its peak intensity with winds of 80&nbsp;mph (130&nbsp;km/h) and a minimum barometric pressure of 965&nbsp;mbar (hPa; 28.5&nbsp;inHg).\n* 0800&nbsp;UTC (3:00&nbsp;a.m. CDT)&nbsp;– Hurricane Isaac makes its fourth and final landfall near Port Fourchon, Louisiana, with winds of 80&nbsp;mph (130&nbsp;km/h).\n* 1800&nbsp;UTC (1:00&nbsp;p.m. CDT)&nbsp;– Hurricane Isaac weakens to a tropical storm roughly  west-southwest of New Orleans, Louisiana.\n;August&nbsp;30\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST August&nbsp;29)&nbsp;– Tropical Depression Twelve develops from an area of low pressure roughly  east-southeast of the northern Leeward Islands.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Kirk intensifies into a Category&nbsp;1 hurricane.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Depression Twelve intensifies into Tropical Storm Leslie.\n;August&nbsp;31\n* 0000&nbsp;UTC (7:00&nbsp;p.m. CDT August&nbsp;30)&nbsp;– Tropical Storm Isaac weakens to a tropical depression over southern Arkansas.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Hurricane Kirk intensifies into a Category&nbsp;2 hurricane and simultaneously attains its peak intensity with winds of 105&nbsp;mph (165&nbsp;km/h) and a minimum barometric pressure of 970&nbsp;mbar (hPa; 28.64&nbsp;inHg).\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Hurricane Kirk weakens to a Category&nbsp;1 hurricane.\nSeptember\n;September&nbsp;1\n* 1200&nbsp;UTC (7:00&nbsp;a.m. CDT)&nbsp;– Tropical Depression Isaac dissipates roughly  west-southwest of Jefferson City, Missouri.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Kirk weakens to a tropical storm.\n;September&nbsp;3\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;2)&nbsp;– Tropical Storm Kirk transitions into an extratropical cyclone roughly  north of the Azores.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Thirteen develops from an area of low pressure.\n;September&nbsp;4\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Thirteen intensifies into Tropical Storm Michael roughly  southwest of the Azores.\n;September&nbsp;5\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Leslie intensifies into a Category&nbsp;1 hurricane.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Leslie attains maximum sustained winds of 80&nbsp;mph (130&nbsp;km/h) roughly  south-southeast of Bermuda.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Michael intensifies into a Category&nbsp;1 hurricane.\n;September&nbsp;6\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Hurricane Michael intensifies into a Category&nbsp;2 hurricane.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Michael intensifies into a Category&nbsp;3 hurricane, the first major hurricane of the season, and simultaneously attains its peak intensity with winds of 115&nbsp;mph (185&nbsp;km/h) and a minimum barometric pressure of 964&nbsp;mbar (hPa; 28.47&nbsp;inHg).\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Hurricane Michael weakens to a Category&nbsp;2 hurricane.\n;September&nbsp;7\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Leslie weakens to a tropical storm.\n;September&nbsp;8\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;7)&nbsp;– Hurricane Michael weakens to a Category&nbsp;1 hurricane.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Michael re-intensifies into a Category&nbsp;2 hurricane.\n;September&nbsp;9\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Hurricane Michael weakens to a Category&nbsp;1 for a second time.\n;September&nbsp;10\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Leslie re-intensifies into a Category&nbsp;1 hurricane.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Fourteen develops from an area of low pressure roughly  west of the Cape Verde Islands.\n;September&nbsp;11\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;10)&nbsp;– Hurricane Michael weakens to a tropical storm.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Hurricane Leslie attains its peak intensity with a minimum barometric pressure of 968&nbsp;mbar (hPa; 28.58&nbsp;inHg).\n* 0900&nbsp;UTC (5:00&nbsp;a.m. AST)&nbsp;– Hurricane Leslie transitions into an extratropical cyclone roughly  southwest of St. Lawrence, Newfoundland.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Michael degenerates into a non-convective remnant area of low pressure roughly 1150&nbsp;mi (1850&nbsp;km) northeast of Bermuda.\n;September&nbsp;12\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;11)&nbsp;– Tropical Depression Fourteen intensifies into Tropical Storm Nadine.\n;September&nbsp;14\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Nadine intensifies into a Category&nbsp;1 hurricane.\n;September&nbsp;17\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;16)&nbsp;– Hurricane Nadine weakens to a tropical storm.\n;September&nbsp;21\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Nadine degenerates into a non-tropical area of low pressure roughly  south-southwest of Santa Maria Island.\n;September&nbsp;23\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST September&nbsp;22)&nbsp;– The remnants of Tropical Storm Nadine regenerate into a tropical storm south of the Azores.\n;September&nbsp;28\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Nadine intensifies into a Category&nbsp;1 hurricane for a second time.\n;September&nbsp;30\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Nadine attains its peak intensity with winds of 90&nbsp;mph (150&nbsp;km/h) and a minimum barometric pressure of 978&nbsp;mbar (hPa; 28.88&nbsp;inHg) roughly  west-southwest of Flores Island, Azores.\nOctober\n;October&nbsp;1\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Nadine weakens to a tropical storm.\n;October&nbsp;3\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Depression Fifteen develops from an area of low pressure roughly  west of the Cape Verde Islands.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Depression Fifteen intensifies into Tropical Storm Oscar.\n;October&nbsp;4\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST October&nbsp;3)&nbsp;– Tropical Storm Nadine degenerates into a non-convective remnant area of low pressure roughly  southwest of the central Azores.\n;October&nbsp;5\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Oscar attains its peak intensity with winds of 50&nbsp;mph (85&nbsp;km/h) and a minimum barometric pressure of 994&nbsp;mbar (hPa; 29.35&nbsp;inHg).\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Oscar dissipates over the central Atlantic Ocean.\n;October&nbsp;11\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;10)&nbsp;– Tropical Depression Sixteen develops from an area of low pressure.\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT)&nbsp;– Tropical Depression Sixteen intensifies into Tropical Storm Patty roughly  east-northeast of San Salvador, Bahamas.\n;October&nbsp;12\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;11)&nbsp;– Tropical Storm Patty attains its peak intensity with winds of 45&nbsp;mph (75&nbsp;km/h) and a minimum barometric pressure of 1005&nbsp;mbar (hPa; 29.68&nbsp;inHg).\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Rafael develops from an area of low pressure roughly  south-southeast of St. Croix, U.S. Virgin Islands.\n;October&nbsp;13\n* 0600&nbsp;UTC (2:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Patty weakens to a tropical depression.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Depression Patty dissipates northeast of the Bahamas.\n;October&nbsp;14\n* 0000–0600&nbsp;UTC (8:00&nbsp;p.m.&nbsp;October&nbsp;13–2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Rafael crosses the Leeward Islands into the western Atlantic Ocean.\n;October&nbsp;15\n* 0600&nbsp;UTC (2:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Rafael intensifies into a Category&nbsp;1 hurricane roughly  south of Bermuda.\n;October&nbsp;16\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Hurricane Rafael attains its peak intensity with winds of 90&nbsp;mph (150&nbsp;km/h) and a minimum barometric pressure of 969&nbsp;mbar (hPa; 28.61&nbsp;inHg) roughly  south of Bermuda.\n;October&nbsp;17\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Hurricane Rafael transitions into an extratropical cyclone several hundred miles southeast of Nova Scotia.\n;October&nbsp;22\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Depression Eighteen develops from an area of low pressure roughly  south-southwest of Kingston, Jamaica.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT)&nbsp;– Tropical Depression Eighteen intensifies into Tropical Storm Sandy.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Depression Nineteen develops from an area of low pressure roughly  east-northeast of the northern Leeward Islands.\n;October&nbsp;24\n* 0000&nbsp;UTC (8:00&nbsp;p.m. AST October&nbsp;23)&nbsp;– Tropical Depression Nineteen intensifies into Tropical Storm Tony.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Sandy intensifies into a Category&nbsp;1 hurricane roughly  south of Kingston, Jamaica.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. AST)&nbsp;– Tropical Storm Tony attains its peak intensity with winds of 50&nbsp;mph (85&nbsp;km/h) and a minimum barometric pressure of 1000&nbsp;mbar (hPa; 29.53&nbsp;inHg) roughly midway between the northern Leeward Islands and the Azores.\n* 1900&nbsp;UTC (3:00&nbsp;p.m. EDT)&nbsp;– Hurricane Sandy makes its first landfall near Bull Bay, Jamaica, with winds of 85&nbsp;mph (140&nbsp;km/h).\n;October&nbsp;25\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;24)&nbsp;– Hurricane Sandy intensifies into a Category&nbsp;2 hurricane.\n* 0525&nbsp;UTC (1:25&nbsp;a.m. EDT)&nbsp;– Hurricane Sandy intensifies into a Category&nbsp;3 hurricane and simultaneously makes its second landfall roughly  west of Santiago de Cuba, Cuba, with winds of 115&nbsp;mph (185&nbsp;km/h).\n* 0900–1200&nbsp;UTC (5:00–8:00&nbsp;a.m. EDT)&nbsp;– Hurricane Sandy crosses Cuba into the Bahamas.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. AST)&nbsp;– Tropical Storm Tony transitions into an extratropical cyclone.\n* 0900&nbsp;UTC (5:00&nbsp;a.m. EDT)&nbsp;– Hurricane Sandy weakens to a Category&nbsp;2 hurricane.\n;October&nbsp;26\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;25)&nbsp;– Hurricane Sandy weakens to a Category&nbsp;1 hurricane.\n;October&nbsp;27\n* 0000&nbsp;UTC (8:00&nbsp;p.m. EDT October&nbsp;26)&nbsp;– Hurricane Sandy weakens to a tropical storm.\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Tropical Storm Sandy re-intensifies into a Category&nbsp;1 hurricane roughly  north-northeast of the Abaco Islands.\n;October&nbsp;29\n* 1200&nbsp;UTC (8:00&nbsp;a.m. EDT)&nbsp;– Hurricane Sandy re-intensifies into a Category&nbsp;2 hurricane roughly  southeast of Atlantic City, New Jersey.\n* 1800&nbsp;UTC (2:00&nbsp;p.m. EDT)&nbsp;– Hurricane Sandy weakens to a Category&nbsp;1 hurricane for a second time and simultaneously attains its peak intensity with a minimum barometric pressure of 940&nbsp;mbar (hPa; 27.76&nbsp;inHg).\n* 2100&nbsp;UTC (5:00&nbsp;p.m. EDT)&nbsp;– Hurricane Sandy transitions into an extratropical cyclone roughly  southeast of Atlantic City, New Jersey.\n* 2330&nbsp;UTC (7:30&nbsp;p.m. EDT)&nbsp;– Hurricane Sandy made landfall as a hybrid subtropical storm near Brigantine, New Jersey, with winds of 80&nbsp;mph (130&nbsp;km/h). thus being given the name \"Superstorm Sandy.\"\nNovember\n*No tropical cyclones form in the Atlantic Ocean during the month of November.\n;November&nbsp;30\n*The 2012 Atlantic hurricane season officially ends.\nSee also\n*Lists of Atlantic hurricanes\n*Timeline of the 2012 Pacific hurricane season\nNotes\nReferences\nExternal links\n* [https://www.nhc.noaa.gov/archive/2012/ 2012 Tropical Cyclone Advisory Archive], National Hurricane Center and Central Pacific Hurricane Center\n* [https://www.ncdc.noaa.gov/sotc/tropical-cyclones/201213 Hurricanes and Tropical Storms – Annual 2012], National Centers for Environmental Information"
    }
  ]
}