{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Samarkand\n\nThe following is a timeline of the history of the city of Samarkand, Uzbekistan.\nPrior to 14th century\nHere is the translation into English:\n* 8th century BC - the foundation of the ancient settlement of Afrasiab.\n* 329 BCE - City sacked by Alexander the Great.\n* 260 CE - Sassanians in power (approximate date).\n* 712 - City taken by forces of Umayyad Caliphate under Qutayba ibn Muslim.\n* 751 - Papermaking begins.\n* 806 - Led by Rafi ibn al-Layth, Samarkand revolted against Ali ibn Isa ibn Mahan, Governor of Khurasan due to his oppressive taxation.\n* 819 - Samanid rule of Samarkand begins. Nuh ibn Asad was appointed authority over the city of Samarkand by Caliph Al-Ma'mun's governor of Khurasan, Ghassan ibn 'Abbad, as a reward for his support against the revolt.\n* 841/842- After the death of Nuh ibn Asad, Abdallah, the governor of Khurasan, appointed two of Nuh's brothers, Yahya and Ahmad, to jointly rule over Samarkand.\n* 864/865 - Upon his father Ahmad's death, Nasr I inherits Samarkand.\n* 859 - Rudaki Samarkandi the father of Persian poetry, was born, in the village of rudak.\n* 892 - Isma'il ibn Ahmad, Nasr's brother, moves the capital to Bukhara after Nasr's death.\n* 914 - Nasr II becomes amir of the Samanids after his father Ahmad Samani dies, sparking a revolt in Samarkand, led by his great-uncle Ishaq ibn Ahmad.\n* 991 - Fa'iq is given governorship of Samarkand by Samanid amir Nuh II.\n* 999 - Isma'il Muntasir, son of Nuh II, briefly recaptures Samarkand from the Karakhanids before having to abandon it to flee from them, thus definitively ending the Samanid rule of Samarkand.\n* 1000 - Karakhanid Nasr ibn Ali, is given the large central area of Transoxiana, including Samarkand and Bukhara as an appanage (approximate date).\n* 1052 -  Tamghach Khan Ibrahim, son of Nasr, won control of a large part of Transoxania, and made Samarkand the capital.\n* 1066 - Afrosiab madrasa built by Ibrahim.\n* 1089 - During the reign of Ibrahim's grandson Ahmad ibn Khidr, at the request of the ulama of Transoxiana, the Seljuks entered and took control of Samarkand, together with the domains belonging to the Western Khanate. The Western Karakhanids Khanate became a vassal of the Seljuks.\n* 1141 - After Yelü Dashi's victory over the Seljuks in the Battle of Qatwan north of Samarkand, the Karakhanids became vassals of the Kara-Khitan Khanate. Yelü Dashi spent ninety days in Samarkand, accepting the loyalty of Muslim nobles and appointing Ibrahim Tabghach Khan as the new ruler of Samarkand.\n* 1158 - Khwarezm-shah Il-Arslan besieged the Karakhanids in Samarkand at the behest of the Qarluks who had been persecuted by them. In the end a peace was mediated where Chaghrï Khan was forced to take back the Qarluk leaders and restore them to their former positions.\n* 1210 - Ala ad-Din Muhammad II, Shah of the Khwarezmian Empire takes Samarkand.\n* 1212 - Supported by Uthman Ulugh Sultan, its last Kara-Khanid ruler, the city of Samarkand revolted, killing 8,000-10,000 Khwarezmians living there. Muhammad, in retaliation, sacked the city and executed 10,000 citizens of Samarkand, including Uthman.\n* 1221 - City besieged by forces of Mongol Genghis Khan.\n14th-19th centuries\n* 1340s - Khodja-Akhmad Mausoleum built in Shah-i-Zinda necropolis.\n* 1365 - Uprising against Mongol control.\n* 1369 - Timur made it his residence.\n* 1370\n** City becomes capital of Timurid Empire.\n** Population: 150,000.\n* 1388 - College of Bibikhanum built.\n* 1405\n** Bibi-Khanym Mosque and Gur-e Amir (tomb) built.\n** Timurid capital relocated from Samarkand to Herat (approximate date).\n* 1420 - Ulugh Beg Madrasah built in the Registan.\n* 1429 - Ulugh Beg Observatory built.\n* 1434 - Mosque of Ulug-Beg built in the Registan.\n* 1437 - Zij-i Sultani astronomical work published.\n* 1464 - Ishrat Khana Tomb built.\n* 1494 - Siege of Samarkand (1494).\n* 1497 - Siege of Samarkand (1497).\n* 1500 - City taken by Uzbeks of Muhammad Shaybani.\n* 1501 - Siege of Samarkand (1501).\n* 1599 - Ashtarkhanids of Bukhara in power.\n* 1616 - Mosque of Shir-Dar built in the Registan.\n* 1636 - Sher-Dor Madrasah built in the Registan.\n* 1660 - Tilya-Kori Madrasah built in the Registan.\n* 1740 - Capture of Samarkand by Nader Shah Afshar\n* 1756 - Manghyts of Bukhara in power.\n* 1868 - Russia in power.\n* 1882 - Citadel built.\n* 1885 - Population: 33,117.\n* 1886 - City becomes capital of Samarkand Oblast of Russian Turkestan.\n* 1888 - Trans-Caspian railway begins operating.\n* 1895 - Tashkent-Samarkand railway begins operating.\n* 1897 - Population: 54,900.\n* 1900 - Population: 58,194.\n20th century\n* 1913 - Population: 97,600.\n* 1917 - After the Russian Revolution of 1917, a Turkestan Autonomous Soviet Socialist Republic (Turkestan ASSR) within the Russian Socialist Federative Soviet Republic was created in Soviet Central Asia (excluding modern-day Kazakhstan).\n* 1919 - Hazrat-i Khizr Mosque restored.\n* 1924 - After the foundation of the Soviet Union the Turkestan Autonomous Soviet Socialist Republic was split into the Turkmen Soviet Socialist Republic (Turkmenistan) and Uzbek Soviet Socialist Republic (Uzbekistan).\n* 1925 - City becomes capital of Uzbek Soviet Socialist Republic.\n* 1930 - Uzbek capital relocated from Samarkand to Tashkent.\n* 1963 - Dynamo Samarkand Stadium opens.\n* 1965 - Population: 233,000.\n* 1970 - Ulugh Beg Observatory Museum built.\n* 1974 - Bibi-Khanym Mosque reconstruction begins.\n* 1985 - Population: 371,000 (estimate).\n* 1991 - August 31 Uzbekistan declares independence.\n* 1996 - Samarkand Challenger tennis tournament begins.\n21st century\n* 2001 - Population: 361,339.\n* 2018 - Population: 529,633 (estimate).\nSee also\n* Samarkand history\n* Timeline of Tashkent\nReferences\nBibliography\n;Published in 19th century\n*\n*\n*\n*\n*\n*\n*\n*\n*\n;Published in 20th century\n*\n*  |short= 1}}\n*\n*\n*\n}}\n*\n;Published in 21st century\n*\nExternal links"
    }
  ]
}