{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of paleontology in Michigan\n\nThis timeline of paleontology in Michigan is a chronologically ordered list events in the history of paleontological research occurring within or conducted by people from the U.S. state of Michigan.\n19th century\n'' skeleton.]]\n1830s\n1839\n* The state's first scientifically documented American mastodon remains were discovered.\n1870s\n1877\n* Five Pleistocene peccaries (Platygonus compressus) were discovered in an Ionia County peat bog located near the town of Belding. The find was credited to L. N. Tuttle and the specimens are now catalogued as UMMP 7325.\n20th century\n1900s\n1903\n* Wagner reported Tuttle's peccaries to the scientific literature.\n1910s\npenis bones from Alaska.]]\n1914\n* Ezra Smith made another interesting Pleistocene-aged discovery, finding the fossil penis bone of a Late Pleistocene walrus seven miles northwest of Gaylord. The specimen was referred to the genus Odobenus and is now catalogued as UMMAA 490.\n1920s\n1923\n* O. P. Hay reported the presence of two identifiable species and one indeterminate form of mammoth whose fossils had been found in Michigan.\n1925\n* Hinsdale reported Smith's walrus penis bone to the scientific literature.\n.]]\n1927\n* Excavations for a new schoolhouse in Oscoda turned up a Late Pleistocene fossil rib that may have belonged to a bowhead whale of the genus Balaena. The specimen  is now catalogued as UMMP 11008.\n1930s\n1930\n* Hussey publish the first scientific paper on the Michiganian whale fossils curated by the University of Michigan Museum of Paleontology.\n1940s\n1940\n* MacAlpin calculated that a total of 117 American mastodon specimens had been discovered in Michigan.\n1949\n* October: A third lower premolar from a Pleistocene elk was discovered in Berrien County.\n1950s\n1953\n* Handley tentatively referred the rib discovered in Oscoda during the 1927 schoolhouse excavation to the genus Balaena. He also reported the discovery of an Arkonan-aged rorqual rib of the genus Balaenoptera. The fossil had been discovered upright in the sand during the excavation of a cellar in Genesee County. Handley also reported the discovery of another walrus fossil, a skull catalogued as UMMP 32453 found in a Makinac Island gravel deposit. Handley also reported the discovery of sperm whale ribs and a vertebra from Lenawee County.\n1960s\n1961\n* August: Larry Kickels collected the third right upper molar of a Jefferson mammoth from a gravel layer 100 feet below the surface of Berrien County, near the town of Watervliet.\n1962\n* September 18 Larry Kramer discovered a lower mastodon molar now catalogued as GRPM 12540 in Paris Township along Buck Creek.\n* Skeels reported that since MacAlpin's 1940 review of Michigan mastodon discoveries 49 new finds had been made. He also performed the first census of local mammoth remains, noting that 32 Jefferson mammoths had been discovered in Michigan.\n* Hatt also formally described a partial mastodon skull now catalogued as CIPS 827 which had been discovered in Pontiac.\n* Fossils of a Jefferson mammoth were discovered in Gratiot County.\n1963\n* Oltz and Kapp reported the 1962 Gratiot County mammoth discovery to the scientific literature.\n* Hatt reported the discovery of a mammoth molar in Oakland County to the scientific literature.\n1964\n* May:  Fred Berndt discovered lower jaw fragments and the second right molar of a lower mastodon jaw, in Lincoln Township. The remains are now catalogued as UMMP 49425.\n1965\n* The Petoskey stone, which is made of fossil coral, was designated the state stone of Michigan.\n21st century\n2000s\n2002\n* The American mastodon, Mammut americanum was designated the Michigan state fossil.\nSee also\n* Paleontology in Michigan\nReferences\nWorks cited\n*"
    }
  ]
}