{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2011 Norway attacks\n\nThe 2011 Norway attacks were a bombing in Oslo and a series of shootings at Utøya on Friday, 22 July 2011. The first attack was a bomb exploding in Regjeringskvartalet, the executive government quarter of Oslo, and the second an attack on a youth camp organized by the youth organization (AUF) of the Norwegian Labour Party (AP) on the island of Utøya in Tyrifjorden, Buskerud.\nThe following is a timeline of the attacks, their background and aftermath. All times are in Norwegian Time (CEST or UTC+02).\nBackground\n1999\nAnders Behring Breivik is initially inspired to his actions by the Kosovo War and the 1999 NATO bombing of Yugoslavia, and Norway's involvement in this. Breivik saw the war as an attack on Serbia's attempt \"to drive Islam out by deporting the Albanian Muslims back to Albania.\"\n2002\nBreivik claims to have taken part in the founding meeting, in London, of the international organisation \"Pauperes commilitones Christi Templique Solomonici\", a resurrection of the medieval Knights Templar. It is unclear if this organisation exists, or is a figment of Breivik's imagination.\n2006\nTo save money for financing the attack, Breivik terminates the lease on his apartment and moves in with his mother, all the while keeping his plans a secret to everybody.\n2009\nBreivik establishes the company Geofarms, supposedly to farm vegetables and root crops.\n2010\nBreivik visits Prague in an attempt to buy illegal weapons. The attempt is a failure, and Breivik decides to obtain weapons through legal channels instead.\n2011\nApril:\n*Breivik rents a farm in Åsta in Innlandet, ostensibly to perform farming.\n*He tries to buy a significant amount of fertiliser at a store in Oslo, but fails to find the correct type. According to the store assistant, he was in the company of a friend when trying to make the purchase.\n*The Norwegian Police Security Service register Breivik making a purchase of certain chemicals from Poland. Due to the low value of the purchase, no action is taken.\nMay:\n*Breivik buys a large quantity of fertiliser at a local store in Rena.\n22 July 2011\n15:00\n15:13:23: A white Volkswagen Crafter was registered by surveillance cameras when entering Grubbegata from Grensen.\n15:13:43: The car stops 200 meters before the H block. The car remains here with the hazard lights on for 1 minute and 54 seconds.\n15:15:39: The driver starts driving the last 200 meters to the H block.\n15:16:07: The driver turns into the parking lot in front of the main government building. He completely ignores the \"No entry\" sign.\n15:16:30: The driver parks the car in front of the main entrance.\n15:16:46: The driver opens the front door of the car.\n15:17:02: The driver steps out of the car. He was standing outside the car for 7 seconds.\n15:17:09: The driver quickly walks away towards Hammersborg torg, where he had a silver Fiat Doblo parked.\n15:18:30: A witness sees what he first describes as a suspicious-looking man leaving Regjeringskvartalet (the Government quarter), in downtown Oslo. Seconds later he hears the man unlock a car at Hammersborg torg, and sees a glimpse of the driver when he drives the car towards the traffic in the one-way street, Møllergata. He finds the event suspicious and takes note of the car's registration number.\n15:25:22: A bomb placed in the Volkswagen Crafter explodes in Grubbegata, near the offices of the Prime Minister, and several other governmental buildings.\n15:26: Police receive first reports of the explosion.\n15:28: First police patrol arrives at the scene; soon afterwards, the scene is filled with emergency vehicles.\n15:58: It is confirmed that Prime Minister Jens Stoltenberg is not among the victims of the attack. Shortly later, it becomes clear that no government ministers are injured.\n16:00\n16:30: The participants at the summer camp of the Workers' Youth League (a youth movement associated with the Norwegian Labour Party) on Utøya gather in the camp's main house to be informed about the event.\n16:52: The Fiat Doblo passes a traffic camera that measures average speeds at Næss Camping. It takes 3 minutes to drive the distance from Næss Camping to Utøykaia.\n16:55: At approximately 16:55, Anders Behring Breivik, disguised in police uniform, arrives in a Fiat Doblo at the ferry landing Utøykaia in Tyrifjorden, a lake some  northwest of Oslo. From here he was transported by the ferry MS Thorbjørn to Utøya.\n17:00\n17:18: Breivik arrives at Utøya.\n17:22: The first shot is fired.\n17:24: The Emergency medical services (AMK) in Drammen is informed about the shooting.\n17:25: The police in Oslo are informed about the shooting.\n17:26: The local police in Hønefoss learn about the shooting.\n17:30: Delta, a police tactical unit situated in Oslo, is dispatched from Oslo to Utøya.\n17:33: The first police patrol leaves Hønefoss.\n17:38: The local police officially ask the Oslo police district for assistance.\n17:50: The police patrol from Hønefoss arrives at Utøykaia, but the officers have to wait for a suitable craft before they can cross over to Utøya.\n18:00\n18:01: Breivik calls 112 (emergency telephone number) to surrender, hangs up, and continues to kill people.\n18:09: Delta arrives, but are also forced to wait for a boat. The boat that is finally provided is too small for the number of personnel and amount of equipment, and the engine stops during the crossing. The team transfer over into two privately owned open console boats.\n18:25: Delta arrives on Utøya and go ashore.\n18:26: Breivik calls 112 again to surrender and hangs up.\n18:34: Breivik does not resist arrest, and is apprehended by the police.\nReferences\nExternal links\n*[https://www.bbc.co.uk/news/world-europe-14260297 Timeline] from BBC\n*[https://web.archive.org/web/20121025064923/http://edition.cnn.com/2011/WORLD/europe/07/24/norway.terror.timeline/index.html?hpt=hp_t1 Timeline] from CNN\n*[http://www.dagbladet.no/2011/07/24/nyheter/terrorangrep/utoya/17437691/ Timeline] from Dagbladet\n*[http://www.nrk.no/nyheter/1.7724894 Timeline] from the Norwegian Broadcasting Corporation\n*[http://www.vg.no/nyheter/innenriks/oslobomben/slik-skjedde-angrepene.php \"Slik skjedde angrepene\"] (How the attacks occurred), Verdens Gang\n*[http://www.aftenposten.no/nyheter/iriks/article4181314.ece \"Alt om tragedien\"] (All about the tragedy), Aftenposten"
    }
  ]
}