{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Israeli–Palestinian conflict in July–December 2015\n\nList of violent events related to the Israeli-Palestinian conflict occurring in the second half of 2015.\n2015\nJuly\nFrom June 30 to July 6, 13 Palestinians, including 2 children, were injured by Israeli forces across the West Bank, half during some 55 search and arrest operations in Ad Duheisha refugee camp (Bethlehem), Beit Ummar (Hebron), Tell (Nablus) and Al Jalazun refugee camp (Ramallah). 79 Palestinians were arrested. On 5 occasions Israeli forces fired towards Gazans in the Access Restricted Areas. One incursion, 150&nbsp;metres inside the Strip was reported. Settlers attacked Palestinians or damaged their property on 7 occasions, injuring three people. Trees in Burin were damaged. In 4 incidents, settlers injured 4 Palestinians in attacks on vehicles near Sheikh Jarrah. In one incident a woman miscarried. Three incidents of physical assault took place in Ras Karkar (Ramallah), Marda (Salfit), and the Old City of Jerusalem. Over the week 7–13 July, 9 Palestinians, including three children, were injured by Israeli forces, which also conducted 52 search-and-arrest operations resulting in 71 arrests in the West Bank. In the 2&nbsp;weeks from 14 to 27 July, 3 Palestinian civilians were shot with live ammunition and died during search and arrest operations in the West Bank, and a total of 66 Palestinians, including five children and five women, were injured. 2 Palestinian fishermen were shot for sailing near or in the ARA zone, as was a 14-year-old who, according to Palestinians, was playing with other children within 50&nbsp;meters of the Separation Barrier. 7 settler attacks on Palestinians or their property, and 5 Palestinian attacks on settlers and their property, were registered. From 28 July-3 August, 94 Palestinians, including 26 children were injured, mostly in protests following the Duma arson attack. Israeli forces fired 13 times towards civilians in the Restricted Areas. 10 structures were demolished in Silwan and Beit Hanina for lacking Israeli permits. 5 settlers attacks on Palestinians or their property were recorded, including a reported running over of a Palestinian fireman trying to extinguish a fire at Beit Hagai. 7 cases of Palestinians throwing stones or Molotov cocktails at settler cars and houses.\n* 1 July\n** The family of Uday Abu Jamal, one of the perpetrators of the 2014 Jerusalem synagogue attack were expelled from their home in the East Jerusalem neighbourhood of Jabel Mukaber and the building was sealed. The home was slated for demolition in November 2014, but the family appealed. B'Tselem declared that punitive house demolitions are \"fundamentally wrong\" and contravene \"basic moral standards by punishing people for the misdeeds of others.\" The International Red Cross provided the family with a tent in which to live, pitched on their property. Israel demolished it the following week, on June 7.\n* 2 July\n** Three Palestinians were shot and injured in a predawn detention raid by Israeli forces on the Duheisha refugee camp, in clashes after 2 young men had been arrested. One of those detained, Waleed Shuhada al-Jafari (23) is the brother of Jihad al-Jafri, shot dead by Israeli forces on 24 February during a similar predawn raid.\n* 3 July\n** Muhammad al-Kasbah (17) from the Qalandia Refugee Camp was shot dead, reportedly by Israeli Binjamin Brigade Commander, Col. Israel Shomer, with two bullets to the head and chest. The incident occurred as a Binyamin infantry brigade vehicle passed the village of Al-Ram in the direction of the Qalandia checkpoint. Israeli reports state he, and others, were throwing stones at a military vehicle, in an ambush, that the windshield was damaged and that the commander got out of his car and shot the youth, assessing that his own life was at risk. al-Kasbah was reportedly warned not to get closer, and shot when he kept approaching. He was the third son of the family to be killed, two brothers having died during the Al Aqsa Intifada. Palestinian reports said he was shot while trying to climb the Separation Wall to reach the Al-Aqsa mosque. He was the 15th Palestinian shot dead since January. A military investigation was established. Video of the incident revealed on 13 of July casts doubts of both versions. The boy is seen running to the jeep and throwing a rcck. It also shows Kasbah running away and a police officer chasing him, after which he was shot in the back. The Israeli military investigation was closed with the verdict  that Shomer had fired into the air and towards the assailant's legs, but that 'due to the reality of the operational situation,' al-Kasbah died. B'Tselem called the decision 'a whitewash'.\n** Settlers, reportedly from Yitzhar, are said to have thrown rocks at Palestinian vehicles at the Yitzhar road junction. Several vehicles, including one belonging to Thaer Khalil, director of appeals prosecution in the West Bank, were smashed.\n** A Palestinian woman was injured when Palestinian cars were hit with rocks thrown by Jews by the Tomb of Simeon the Just near Sheikh Jarrah in East Jerusalem.\n* 6 July\n** Firas Mujahid (45) filed a complaint to Israeli police that he had had stones thrown at him and his companions, and was then struck in the head with a rod, after he, his brother and a friend were insulted by Israelis while walking along East Jerusalem's Musrara Street. Mujahid was hospitalized after Israeli police called an ambulance. His brother, the friend and some Israelis were arrested, and the Palestinians were later released on bail.\n** A Palestinian, Baraa Muhammad al-Rimhi (16), was shot with a rubber-coated steel bullet by Israeli forces during a raid on the al-Jalazone Refugee Camp. The IDF stated that during a routine operation, stones were thrown at them, and after warnings, when an \"improvised explosive device\" was thrown, they made a hit. Another young man, Muhammad Safi (20) was arrested.\n* 10 July\n** Amjad Farouq Abu Khalid (17) was shot in the leg by a rubber-coated steel bullet as Israeli forces dispersed the weekly protest march at Kafr Qaddum village near Qalqiliya in the occupied West Bank. The area was also reportedly dowsed with skunk spray. The village had been declared a 'closed military zone' at dawn, and neither journalists nor international activists were permitted entry.\n* 12 July\n**  Nafiz Dmeiri (55), a deaf and mute tailor, lost an eye when he was hit in the face, according to an Israel source apparently by a sponge grenade while inside a grocery store, according to Palestyinian sources by a sponge-tipped bullet where he had taken shelter as Israeli police clashed with stone-throwers at the Shuafat Refugee Camp. A store camera captured the incident on video. Another Palestinian suffered a chest wound from Israeli fire during the same clashes, which ensued after Israeli undercover forces raided a clothing store and arrested a Palestinian.\n* 15 July\n** A young Palestinian woman, reportedly a minor, was arrested after lightly injuring an Israeli soldier with a stab wound to his back near the Israeli settlement of Nahliel, north of Ramallah.\n* 16 July\n** In response to a rocket fired from Gaza which hit open ground south of Ashkelon in the early hours, the IAF launched a strike against 'terrorist infrastructure', a watchtower and a training camp, in the Gaza Strip reprisal. No injuries were reported.\n* 17 July\n** Muhammad Halayqa (17) of Ash-Shuyukh was shot in the foot with a rubber-coated steel bullet during an Israeli raid on the family home to arrest his older brother.\n** About 20 Palestinians from Ras al-Amud threw fireworks, Molotov cocktails and stones at Jewish homes in the East Jerusalem neighborhood of Ma'ale HaZeitim.\n** Mansour Abu Taima (14) was shot in the left foot, reportedly by live fire, by Israeli forces firing into the Gaza Strip town of Abasan al-Kabira east of Khan Younis.\n* 21 July\n** A Palestinian fisherman in his 20s was shot with live fire in the back off the northwest coast of Gaza by Israeli naval forces. He also suffered several wounds to his hand from rubber-coated bullets. He was hospitalized in critical condition. An Israeli spokesman said the shooting occurred after warning shots were fired when a fishing vessel deviated from the designated fishing zone.\n* 22 July\n** Muhammad Ahmad Alawneh (21) was shot in the chest with live ammunition during Israeli clashes with residents of Birqin west of Jenin, in what Israeli described as a search-and arrest operation. He later succumbed to his wounds, the 16th Palestinian to die since January.\n* 23 July\n** Falah Hamdi Zamel Abumaria (53) was shot dead and his two sons were wounded when Israeli forces raided their home in Beit Ummar. Palestinian witnesses said Abu Maria was shot twice in the chest while trying to assist his son Mohammad (22) who had been wounded twice in the pelvis. Another son, Ahmad (25) was also wounded reportedly by bullet shrapnel in the chest. An Israeli spokesman said the incident occurred during an arrest raid when a 'violent mob' threw stones, injuring a soldier with a rock. A Euro-Mediterranean Human Rights Monitor describes it as one of 8 instances of arbitrary killing by Israeli forces in 2015, and states that Abumaria had thrown a pottery vase at soldiers from his balcony when they wounded his son, and was shot 3 times in the chest and denied emergency care when ambulances arrived.\n** Israeli forces injured eight Palestinians in the West Bank town of Beit Ummar as clashes erupted in the wake of the funeral of Falah Abu Maria, shot earlier that day. Israeli fire also reportedly shattered the rear window of a Palestinian ambulance as it drove away.\n* 26 July\n** 70 Israeli settlers guarded by 100-150 troops entered the Al.Aqsa compound through the Moroccan Gate. Palestinians youths had barricaded themselves in Al-Aqsa mosque overnight, with an armoury of stones and fireworks, reportedly in preparation to disrupt Jewish visits to the site for Tisha B'Av prayers. Jewish prayer is not allowed at the site. Israeli forces stormed the mosque.19 Al-Aqsa mosque guards and 4 Israeli policemen were injured during the clashes.\n** Israeli settlers filled in an ancient agricultural well at Deir Istiya, near the Israeli settlements of Revava and Yaqiri.\n* 27 July\n** Abu Latifa (18) of Qalandiya Refugee Camp became the 18th Palestinian to be killed by the IDF this year when Israeli forces raided the camp at dawn to arrest him, purportedly for planning a 'terror attack in Israel'. According to the Israeli version, he was shot in the leg while fleeing and fell to his death from a rooftop. According to his family and local sources, the incident occurred when police broke into his home to arrest him and he was shot while fleeing. According to his family he was shot in the foot, arrested alive and then shot in the chest. He further claimed he did not die after as a result of a fall from a rooftop.\n** After Latif's funeral, clashes erupted between Israeli forces and Palestinians throwing stones and bottles and 14 Palestinians were injured, 6 by live fire\n** Muhammad Husam Barakat (38), a bus-driver for the Israeli Kavim transport company, was attacked by two passengers who had boarded the vehicle at Beitar Illit, after refusing to pay the fare at journey's end at Sheikh Jarrah\n** Abd al-Karim Aziz al-Haddad (15) of Jerusalem's Old Quarter's al-Saadiyyeh neighborhood, suffered internal bleeding after reportedly being beaten up at a police station after Israeli forces had arrested him in his home, where he was under house arrest. He was accused of not having kept obeyed the home arrest order.\n* 28 July\n** 4 stores in Silwan, 2 the property of Khalil al-Abbasi in the Ayn al-Lawza area, and 2 belonging to Iyad al-Abbasi in the Ayn al-Foka area, were razed by Israeli bulldozers, apparently for lacking building permits.\n* 31 July\n** In what was described as a price tag attack in the wake of the government bulldozing of 2 apartments in the settlement of Beit El, a move opposed by settlers, masked assailants broke the windows of two houses in the village of Duma and threw firebombs inside at around 2 am., after the family had returned home from a visit with relatives. Ali Saad Dawabsha, 1 and a half years old, was burnt alive. Her mother Riham (27) suffered third-degree burns to 90% of her body, her father Saad (32)  suffered burns to 80% of his body. Her brother Ahmed was also injured, when a firebomb was thrown into the family bedroom. Witnesses said 2 masked arsonists were seen outside watching as the family burned. The second house, owned by Maamoon Rashid Dawabsha, was also damaged by firebombs. Graffiti reading \"revenge\" and \"long live the Messiah\" were scrawled on walls. Locals said they saw 4 settlers flee towards the nearby Israeli settlement of Ma'ale Efrayim. The event revived memories of the burning to death of Muhammad Abu Khdeir, the fatal killings of 4 Palestinians by Israeli forces in recent weeks and the Palestinian shooting of Malakhi Rosenfeld (26)  a month earlier. In the same assault, the home of Maamoon Rashid Dawabsha was also firebombed.\n** Shots were fired at an Israeli settler's car travelling near Duma during the funeral service for Ali Saad Dawabsha. The fire was returned. No injuries were reported.\n** Mohammad Hamid al-Masri (17)  was shot dead by Israeli forces at Beit Lahiya in northern Gaza near the Border Separation Barrier. A second Palestinian was moderately wounded. An Israeli spokesman said they had ignored warnings to stop, and had been shot in the lower extremities, after which they moved off.\n** Israeli forces shot Laith al-Khaldi (17) from the al-Jalazone Refugee Camp. near Ramallah, at the Atara checkpoint. He later died from his wounds, having been shot in the chest. An Israeli spokesperson said a Palestinian suspect had been shot while throwing a molotov cocktail.\nAugust\n* 3 August\n** A Palestinian man, stopped for a security check at the Zaatara checkpoint, was shot in the lower extremities as he attempted to flee. According to Ynet report, soldiers fired gunshots into the air before he was shot.\n** Unknown assailants threw a firebomb at a car driven by a 27-year-old Israeli woman in Beit Hanina neighbourhood of East Jerusalem. She received first and second-degree burns on 15% of her body, and her car careened into another vehicle injuring the driver.\n** Witnesses claimed that Israeli settlers threw rocks at a Palestinian taxi driven by Moussa Othman near a turn in the area named Oyoun al-Haramieh.\n* 4 August\n** Israeli forces razed two dunams (0.49 acres) of vegetables, and destroyed irrigation pipes, belonging to Ahmad Barghash al-Shawahin, in the Izeima district of southern Hebron.\n** Two Palestinians, Muammad Badran and Suliman abu-Mayyala, were reportedly injured by a sharp implement wielded by an Israeli in a clash when worshippers intervened to prevent the raising of an Israeli flag on the Temple Mount.\n* 5 August\n** Israel I forces demolished 18 Palestinian homes and agricultural stores in 3 hamlets, al-Aqaba, Khirbet al-Yirza and al-Miteh in the northern Jordan Valley of the West Bank for lack of Israeli permits. Locals claim no prior warning was given. In Aqabah Rashid Dabak and Khaled Subih's homes were razed. The demolitions brought to 260 the number of Palestinian dwellings destroyed by Israel since the beginning of 2015.\n* 6 August\n** 4 Palestinians, all from the same family -  Bakr Hasan Abu Naqira, Abdul-Rahman Abu Naqira, Ahmad Hasan Abu Naqira, and Hassan Ahmad Abu Naqira - were killed, and at least 29 were wounded when, according to \"Ma'an\" and \"Haaretz\", Israeli ordnance, one of 7,000 left in the Gaza Strip from the 2014 Israel-Gaza war, blew up as rubble was being cleared from a house, owned by Sheikh Attia Abu-Nakira, a senior member of Hamas military wing, in the southern Gaza Strip. But according to \"The Guardian\", there were also \"suspicions that the house or a nearby property may have been used to store explosives or rockets. Gaza's interior ministry's spokesman said: \"We can't give a clear reason for what happened\", adding that \"an investigation was under way\".\n** Two Israeli soldiers were wounded seriously, another lightly in a suspected car hit-and-run attack on Route 60 near Israeli settlement of Shiloh. An attacker, Mohammed Badwan (48) from Biddu village east of Ramallah, was shot 4 times by a fourth soldier.\n* 7 August\n** A Gaza launched mortar hit Israeli territory in open ground near Kibbutz Re'im.\n** From 2 to 4 Palestinians were injured during an Israeli retaliatory strike on a Hamas military post near Nuseirat refugee camp in the central Gaza Strip. Hamas said two of its members had been lightly wounded.\n* 8 August\n** A Palestinian boy, Mahir Shatat (14) was shot in the cheek by Israeli live fire near Beit Hanoun in the Gaza Strip. The reason given was that he was observed approaching the Separation Border Barrier.\n* 9 August\n** Palestinian sources claim that Israeli settlers from Har Bracha set fire to hundreds of acres of land west of Burin, while Yitzhar settlers set an area south of Burin alight, the fire spreading towards Einabus.\n** A Palestinian, Anas Muntaser Taha (20) of Qutna, was shot dead after stabbing an Israeli man, Yehuda Ben Moyal (26) of Modi'in Illit, several times at a gas station near Ofer security checkpoint. Ben-Moyal was hospitalized with light to moderate wounds. The victim complained that other Palestinians present did not intervene to help him. IDF spokesman Peter Lerner said however that Arab employees at the site had alerted the IDF of the incident.\n* 10 August\n** Adnan Abdullah's home in the village of Deir Ballut, one of 60 houses in the Khallat Qaswal area located in Area C, was bulldozed for being constructed without an Israeli permit.\n** 2 Palestinian homes and a barn, belonging to Rajeh Farhan al-Samamreh, were demolished in the Hebron village of Rahwa by Israeli forces. The structures were home to 24 people, mostly children. It would appear they lacked Israeli permits.\n* 11 August\n** According to Palestinian reports settlers threw Molotov cocktails into a public park in Qaryut, near Nablus. Another attempt to attack land in Beita was reportedly undertaken but beaten off.\n** Israeli bulldozers razed a three-storey building, containing two meeting halls and four offices and extending over 220 square meters owned by Mazin Abu Diab in the industrial zone of Qalandiya. The owner said the building was originally constructed in 1971 and a 100-metre extension added in 2013, for which he tried, but failed to obtain Israeli permits. 80% of the zone is in Area C.\n* 13 August\n** A Bedouin tent near Kafr Malik village in northern Ramallah was torched. Jewish settlers are suspected as the perpetrators: price tag graffiti were sprayed nearby. It had been the primary lodging of Yousef Kaba'ane, his wife and eight children until a week earlier.\n** The house of Mousa Salim Hasan in Tuqu village on the outskirts of Bethlehem, Muhammad Majid Dabash's home in the village of Harmala, and the outer wall of Khalaf al-Himri's home in Za'atara were demolished by Israeli forces.\n** A Palestinian contractor Loay Bakri (31) suffered a broken hand when assaulted by 6 youths, wielding steel rods bars, while fixing a traffic light in the settlement of Pisgat Ze'ev. Two Israeli minors were later detained by police.\n* 15 August\n** A Palestinian from Beit 'Anan stabbed and lightly wounded an Israeli soldier near Beit Ur al-Tahta and Beit Horon on route 443 in the West Bank. The Palestinian was arrested after being shot in the shoulder. Israeli reports say he asked for water before attacking the soldier, and motivated his gesture as a result of having been beaten by his father during a quarrel earlier that morning.\n** A Palestinian, Ahmad Kamil Rafeeq al-Taj (16), was shot and died of multiple wounds after stabbing a Border Police officer near Beita. The soldier suffered a light wound to the shoulder.\n* 16 August\n** Muhammad Mustafa Najjar (19) was moderately injured when a car allegedly driven by a settler hit him in the village of Yatma. The vehicle fled the scene.\n* 17 August\n** A Palestinian man, Mohammed Bassam al-Atrash (Amsha) (26)  of Kafr Ra'i (Jenin) was shot dead after he reportedly approached Border Police officers at Tapuah Junction (Za'atara checkpoint) and asked for medical assistance, and then pulled out a knife and stabbed a Border Police officer, who was lightly wounded. A Euro-Mediterranean Human Rights Monitor report cites this as one of 8 cases of arbitrary violence by Israeli soldiers, noting that eyewitnesses did not see any knives, and Israel has refused to produce evidence it says it possesses to that effect.\n** Israeli forces Monday uprooted trees reportedly on privately owned Palestinian land in the Bir Onah area of Beit Jala. The plots affected by the bulldozing of an area of some 30 dunams were those of the Al-Shatla, Abu Eid, Abu Ghattas, Abu Saada, Khaliliya, and Abu Mohor families. The purpose of the bulldozing was to create a Separation Barrier.\n** Israeli bulldozers razed structures belonging to more than 20 families of the Jahalin Bedouin community in the Khan al-Ahmar area east of Jerusalem.\n* 18 August 2015\n** Israeli bulldozers bulldozed 12 tents housing the al-Rashayda and al-Taamra families in the al-Fasayel area near Jericho. In a similar operation several structures were demolished in al-Maaber near Jericho, for a total of 22 structures, including animal pens. 79 Palestinians, including 49 children were left homeless, and their flocks without shelter, in the searing heat as a result. The UN Office for the Coordination of Humanitarian Affairs (UNOCHA) and the UN agency for Palestinian refugees (UNRWA) stated that, 'this is the largest number of Palestinians displaced in the West Bank in one day in nearly three years.'\n** A Palestinian woman, and 4 teenagers, 3 Jordanians and one Israeli, suffered bruises in rock attacks on a bus and two cars in east Jerusalem's A-Tur neighborhood on the Mount of Olives. According to a police report, the attack took place at night when Palestinian youths threw a barrage of rocks at the vehicles without provocation, shattering the bus's and both cars' windshields. Original reports stated that the 3 teenagers were Jewish Israelis.\n* 19 August\n** Israeli bulldozers demolished a 6 apartment 3-story building belonging to the Tawtah and al-Tawatnji families under construction in Wadi al-Joz, East Jerusalem. The residences were razed for lack of an Israeli construction permit. According to the Tawatah family, Construction began 9&nbsp;months earlier on the basis of lower apartments built 80&nbsp;years ago.\n** An Israeli soldier was moderately injured after a Palestinian threw explosives at an IDF position, the Patriarch's Way security checkpoint, near Beit Jala south of Jerusalem.\n** A two-year old Israeli girl was injured by glass fragments to her face when Palestinians threw stones at the vehicle she was traveling in with her father on Route 45 between Jerusalem and Tel Aviv. The father was hurt in the shoulder but did not require medical treatment. Another vehicle was also targeted by the assailants, who caused damage to the car and lightly wounded the driver who did not need medical treatment. The area has been the site of multiple similar attacks in the past.\n** Israeli forces demolished the homes of two families, numbering 11, including 7 minors, in Khirbet Einun. A sheep pen was also razed. A further home to a family of 8 was razed in the nearby Khirbet a-Deir community. The dwellings lacked Israeli permits. 31 Aids groups, including Oxfam and Amnesty International, using UN figures, protested what they called the \"surge\" of \"wanton destruction\" in Area C West Bank demolitions of Palestinian housing, which had left 132 Palestinians homeless after 63 houses and other structures had been razed in one week.\n* 21 August\n** 4 Palestinians, among them 3 children, were wounded by rubber-coated steel bullets used to disperse protesters at the weekly demonstration in the village of Kafr Qaddum against the confiscation of over 10% of village land, according to the Jerusalem Applied Research Institute, for the establishment of 4 Jewish-only settlements - Kedumim, Kedumim Zefon, Jit, and Givat HaMerkaziz. Those injured were Abd al-Rahim Abd al-Salam (6) hit in the shoulder: Moussa Abd al-Lateef (13), shot in the hand: Jamil Helmi (17) wounded in the thigh, and Odai Qaddumi, struck in the hands and stomach.\n* 22 August\n** Israeli settlers from Esh Kodesh reportedly attacked Palestinians farming their land in the Buslata area east of Qusra. Some injuries among Palestinians were reported when Israeli forces intervened and fired tear gas canisters and rubber-coated steel bullets.\n** Mahmoud Ahmad Othman (32)from the village of Majdal Bani Fadil was reportedly beaten up by settlers who stopped their car to do so at a crossroads near Yatma.\n* 25 August\n** Two houses belonging to Muhammad and Khalid al-Abbasi in the al-Muroj area of Jabal al-Mukabir, East Jerusalem, were demolished for lacking Israeli construction permits. It is the 19th demolition of Palestinian residences in East Jerusalem this year.\n* 26 August\n** 9 tine shacks, including 2 homes and 7 commercial stores (grocery, car wash, and furniture store), were razed by Israeli forces in al-Eizariya for lack of permits. Sami Abu Ghaliya, who with his family of 6 was left homeless, is a Fatah official representing Bedouin tribes outside Jerusalem owned some of the buildings.\n** An axe-wielding man attacked a group of Border Policemen near Damascus Gate in Jerusalem's Old City. While the officers worked to neutralize the suspect, he managed to stab one Israeli officer and lightly wound him in the leg. An attacker, 56-year-old Palestinian from Hebron, was apprehended. He had previously been released in 2013 in the third phase of the Gilad Shalit prisoner exchange after being imprisoned for murdering Menahem Stern in 1989.\n** A molotov cocktail hit one of several Israeli jeeps in At-Tur neighbourhood in East Jerusalem. Police were not injured, but the flames engulfed other vehicles.\n* 27 August\n** After a Gaza rocket was fired and landed near the border fence, on open ground open in the Eshkol Regional Council area, Israeli aircraft struck a Hamas weapons manufacturing site in the Gaza Strip.\n* 28 August\n** Deyaa Shtewei (36) was shot in the foot with live ammunition during the weekly protest at Kafr Qaddum. Demonstrators were also sprayed with Skunk.\n** Journalist Mohammad Basman Yasin received a leg wound from a rubber-coated steel bullet in a demonstration at Bil'in\n** A Palestinian child, Salam Basim, was shot in the foot by a rubber-coated bullet in Nabi Salih. Palestinian sources also claim that Israeli forces assaulted a child, Mohammad Basim, who had his arm broken two days earlier in a raid, was assaulted and his mother Nariman, and Nawal al-Tamimi beaten. Pictures of an incident of a child been detained by a soldier went viral on the internet, according to Ynet.\n** Palestinian youths torched an Israeli's car in the al-Tur neighborhood of East Jerusalem. The car reportedly belonged to settlers in what a Palestinian source described as an illegal outpost' near al-Khalwa Street. No one was injured.\n* 29 August\n** One Israeli soldier sustained a light injury to his foot by a Palestinian car that allegedly tried to run over soldiers at Ari Junction, south of Hebron. IDF troops fired on a car, but it \"managed to drive away\".\n** 4 youths were injured by rubber-coated steel bullets when clashes broke out after Israeli forces raided the village of Tell. Those injured were Amir Basil al-Hindi (19), shot in the head: Yahya Abdul-Karim (21) in the hand: Anas Yousif Hamdi (21) in the foot, and Ahmad Abdul-Fattah Asidi (21) in the thigh.\n* 30 August\n** An Israeli settler (46) from Kedumim suffered a light arm injury when his vehicle was fired on from a passing car at the Jit Junction west of Nablus. \"The shooter or shooters fled the scene\".\n* 31 August\n** 25 structures of the al-Khdeirat Bedouin community near the village of Jaba northeast of Jerusalem were demolished for lack of Israeli permits by Israeli forces leaving 11 families and about 100 people homeless, among them 70 children.\n** During an Israeli incursion into Jenin involving 40 military vehicles, the object of which was to arrest Bassem al-Saadi, a senior Islamic Jihad official, clashes broke out when Israeli troops also surrounded the family house of Abu al-Hija (Alhaija), said to have links to Hamas. Hundreds of Palestinians threw rocks and Molotov cocktails during the incident. Saadi evaded arrest, being outside his home at the time, though Palestinian reports state a rocket was fired at the residence. At least 5 Palestinians were reportedly injured by rubber bullets, or tear gas, while some estimates ran as high as 20. Initial IDF reports said the troops had been fired on: later versions stated that gunfire had been heard. One Israeli Border policeman from the Yamam unit was moderately wounded, whether by Palestinian shooting or friendly fire, as Ynet reported, is unknown but under investigation. Haaretz reported a preliminary analysis suggested he was probably wounded by friendly fire. Israeli forces are said to have acted after repeatedly calling on the residents to surrender, and arrested Majdi Abu al-Hija, his brother Alaa, his 15-year-old son, and his mother, and then demolished their home.\nSeptember\n* 2 September\n** A Palestinian from Gaza was shot in the leg while either entering Israel or approaching a border sea fence off the coast of northern Gaza. Israeli sources say he was warned before being shot in the lower extremities. The man was evacuated for treatment to Barzilai Medical Center in Ashkelon.\n** A bullet from Gaza shattered the window of a Jewish home in Kibbutz Netiv Ha'asarah and hit the television while 2 Jewish children were watching it.\n** Palestinians accused Israeli settlers from Kedumim of having vandalized the electricity transmission lines into their village of Kafr Qaddum\n** Tombstones in the Mount of Olives Jewish Cemetery were desecrated and set on fire. A nationalistic motive is suspected. It has a \"long been targeted by Arab teens who vandalize graves. Many visitors were \"forced to retain security escorts provided by the Ministry of Housing and Construction to visit the grave-sites\" because of chronic rock attacks.\n** Israeli police and firefighters were attacked by local Palestinians throwing rocks after saving a Palestinian family from a fire in the Isawiya neighborhood (East Jerusalem).\n** A Palestinian was shot and moderately wounded after \"attempting to throw an explosive at Israeli security forces near Bethlehem\". The explosive was neutralized by Israeli bomb squad personnel.\n* 3 September\n** A Palestinian boy, Anan Faris Malash (15) allegedly threw a Molotov cocktail at Israeli soldiers during their raid on the Aida Refugee Camp outside of Bethlehem. He was arrested after he was shot in his leg.\n** After gunfire from Gaza hit 3 houses in the Netiv HaAsara kibbutz, the Israeli Airforce launched 2 missiles at the Falasteen al-Qassam Brigades military site in the northern Gaza Strip. The IDF's initial assessment had been that the gunfire, from a Hamas training base, was accidental.\n** A Palestinian child, Bilal Abu Amro (11) was shot in the thigh by Israeli forces while out at sea with his father, a fisherman, reportedly near Beit Lahiya.\n** 5 American yeshiva students were attacked after accidentally driving into Hebron, with stones and Molotov cocktails. Their car was set alight and two were lightly injured. They were sheltered for 40&nbsp;minutes by a local Palestinian, Fayez Abu Hamdiyeh who called in the police.\n* 4 September\n** According to Israeli sources, shots were fired at a military watchtower in the checkpoint from the al-Ram neighborhood. A Palestinian youth was wounded by live fire during clashes broken out in the subsequent Israeli raid on the Qalandiya refugee camp.\n* 7 September\n** 6 Palestinians were injured when clashes broke out after an Israeli checkpoint was set up in the Ras al-Amud quarter of Silwan. Zaki al-Razim (34) was reportedly struck by a Jeep.\n* 11 September\n** Israeli forces took over the Kafr Qaddum home of Abd al-Latif al-Qaddumi, the head of the Palestinian Authority police in Nablus, evicted his wife and children and turned it into a military outpost.\n** 4 Palestinian youths were injured by sponge bullets as Israeli forces clashes with demonstrators at the weekly protest march as Kafr Qaddum. Yusif Shtewei (24) was shot in the head with a sponge bullet. Aus Amer (2), Odai Sameer (23) and Muhammad Aqel (18) were wounded in their lower extremities.\n** According to the Wadi Hilweh Information Center, Zaid Abu Qweidir (8) was attacked by a settler in Silwan in the Batn al-Hawa area. The incident led to clashes between local Palestinians and settlers, who used pepper spray on the former, 15 of whom reportedly were injured.\n* 13 September\n** During clashes on the Temple Mount on the eve of Rosh HaShanah between Israeli police and Palestinians, According to Israeli accounts, acting on information from house searches in East Jerusalem which turned up pipe bombs suggesting to them that some Palestinians involved had withdrawn into the compound and intended attacking Israeli visitors the following day, police stormed the site and countered the throwing of stones and fireworks by sealing the Al-Aqsa mosque and firing into it. According to Palestinian accounts, the banning of Mourabitoun sentinels from the site raised tensions and the police had entered shortly after dawn prayer and fired rubber-coated steel bullets and stun grenades into or within the mosque. Several Palestinians were injured, including a boy, Anas Siyam, shot in the chest with a sponge bullet.\n** In the 2015 Rosh HaShanah death by stone-throwing, rocks thrown by Palestinians hit a car driven by Alexander Levlovich (64), the car spun out of control, and crashed. The driver died of his injuries, and two passengers were lightly injured. The group was returning home from a Rosh HaShanah dinner. Though reports of rock-throwing were numerous, initial testimonies from passengers suggested that the driver had 'convulsed' before he lost control of the vehicle. Later reports attributed the cause of the incident to rock-throwing. 4 Palestinians, Muhammad Salah Muhammad Abu Kaf (18), Walid Fares Mustafa Atrash (18), and Abed Muhammad Abed Rabo Dawiat (17), all of Sur Baher in East Jerusalem, were arrested on suspicion of being the authors of the attack, and were reported as having admitted to the crime.\n* 15 September\n** 36 Palestinians were treated for injuries from stun grenades, tear gas canisters, and rubber-coated steel bullets when Israeli forces clashed on the Haram al-Sharif/Temple Mount, during the 3rd day of clashes. The Waqf said the Israeli forces had penetrated the southern mosque as far as Saladin's Minbar (pulpit) and witnesses said that stun grenades had set fire by the mosque's Bab al-Janaez (funerals door). A 14-year-old boy, shot in the head by a rubber-coated steel bullet, required 10 stitches. 5 Israeli officers required treatment.\n* 17 September\n** Anas Muhammad Saleh ( 17) received a shot wound in the thigh near the Aida refugee camp in Bethlehem.\n** An Israeli bus was pelted with stones and then set on fire with a Molotov cocktail. The driver who left the bus sustained light injuries. In a separate incident, another Israeli bus driver sustained injuries in a stone-throwing attack that damaged the windshield of his vehicle near the Palestinian village of Hizma.\n** After a firebomb was thrown at an Israeli military vehicle at a military checkpoint near the settlement of Itamar, Ahmad Izzat Khatatbeh ( 26), a deaf man, of the village of Beit Furik, reportedly a suspect in the incident, was shot at the Beit Furik checkpoint by soldiers three times from behind and wounded in the shoulder and pelvis and remained in a critical condition. He died a week later in hospital. The IDF stated that he was shot because he represented \"a clear and present danger\" to civilian passersby\". According to Gideon Levy, it was late at night, civilians are not known to have been present; he was deaf and could not heed calls to stop, and  he was returning home after shopping for clothes in Nablus for the Eid al-Adha holiday. Soldiers stopped an ambulance from picking him up for an hour, while he was still wounded. His death was compared to that of Naama and Eitam Henkin near the same checkpoint some weeks later. A further suspect was arrested.\n** A number of Palestinian youths were suspected of throwing stones and a Molotov cocktail at an Israeli bus in the East Jerusalem neighborhood of Ras al-Amud. The vehicle caught fire, but The Palestinian driver managed to flee.\n* 18 September\n** Four Israeli border policemen were wounded by Palestinians who hurled Molotov cocktails and fired gunshots in Armon Hanatziv, a neighbourhood of southern East Jerusalem. The police said that Palestinians in the area set tires and garbage cans on fire, blocking roadways. When the officers tried to re-open the artery to allow for traffic to flow freely, they were ambushed with firebombs. One security officer was listed in moderate-to-serious condition after sustaining wounds to his lower extremities. Another officer was treated for wounds to his hand, while the other two suffered light burns.\n** In clashes between Israeli police and Palestinians protesting restrictions on attendance at the Al-Aqsa mosque across East Jerusalem, at Jabal al-Mukabbir Isawiya, Shufat Refugee Camp, At-Tur, Silwan, Al-Eizariya, al-Suwwana and Wadi al-Joz from several to dozens of Palestinians were injured and 11 arrested. Ther al-Fasfous, spokesman for Fatah at Shuafat was injured by live fire; a boy at At-Tur was wounded by a rubber-coated bullet shot to the head; a woman was hit with a stun grenade in the Hosh Saida alley at Wadi al-Joz. A Palestinian was shot by live fire in Silwad, where family members of the Muammar Ayyad household required hospital treatment when their house was broken into. 15 Palestinians were injured, 6 of whom from live fire, and the rest with rubber bullets, during clashes near the Ofer detention center. 3 Palestinians were shot by rubber-coated bullets near the Qalandiya military checkpoint in a protest after prayers. Mohammad Abdullah (13), Nasser Barham (46) and Bashar Shtewei (45)  received gunshot wounds at the weekly protest march in the village of Kafr Qaddum, while 15 others were wounded by rubber bullets. A spokesman there, Murad Shtewei, said his wife, children and father had been pepper-sprayed when the house was seized, its windows smashed and their home turned into a military base. In the village of Aboud a Palestinian was reportedly wounded by a.22 caliber gunshot. According to Ma'an News Ahmad al-Muti (13) was shot in the leg at a Bethlehem protest with a dumdum bullet, arrested and handcuffed to an Israeli hospital bed. IDF sources stated he was hit for throwing stone. His lawyer said the incident occurred as he was taking his brother to hospital. Doctors decided to amputate Al-Nuti's leg on the 29 September.\n** A rocket fired from the Gaza Strip landed close to an empty bus near Sderot, damaging the vehicle.\n* 19 September\n** In a retaliatory strike, the IAF Iaunched several raids. The first targeted a radio tower at the former headquarters of the Israeli Civil Administration before the 2005 Israeli disengagement from the Gaza Strip. One person was injured. 2 missiles struck Beit Hanoun, while a third hit the al-Qassam Brigade-run Abu Jarad military training camp in Zaytoun.\n** Abdullah Haitham Abbas (14) was shot in the thigh by live fire by Israeli forces in the village of Kfar Qaddum whose main street to Nablus has been closed off for 13&nbsp;years. Israeli sources say they were quelling a 'riot' in which rocks were thrown and burning tyres rolled and confirmed a 'hit' with.22 caliber rounds.\n** A car driven by Ammar Naim Sarkaji was allegedly shot at on the road from Beit Dajan to Nablus from a car with Israeli license plates near the settlement of Elon Moreh. No injurfies were reported.\n* 20 September\n** A Palestinian boy (13) had his skull fractured from a rubber-coated steel bullet fired by Israeli forces during clashes in a search-and-arrest raid in the East Jerusalem neighborhood of al-Issawiya.\n* 21 September\n** 2,000 Israelis visiting Joseph's Tomb in Nablus were attacked by 60 Palestinians who threw stones, Molotov cocktails and rolled rubber tires. An Israeli soldier sustained light injuries during clashes with Palestinians.\n** 4 Israeli military bulldozers made an incursion into the Gaza strip and leveled agricultural land near Jabaliya.\n** A rocket, the 11th since January 2015, was fired from Gaza into southern Israel, exploding in an open field The rocket landed in the Ashkelon Region. No damage was caused.\n* 22 September\n** Diyaa Abdul-Halim Talahmah/Diaa Talhama (21) died during clashes with Israeli forces in Khursa, near Hebron. Reports of the cause of death are contradictory. According to Palestinian sources, he was shot dead by Israeli forces in the village of Khursa, near Hebron. According to the IDF, troops investigating a report of a road blockaded by rocks heard an explosion and found a body, suggesting that the man had died when an IED device had blown up prematurely when the suspect attempted to hurl it at an IDF vehicle. According to the Israeli newspaper Haaretz he was shot dead when IDF soldiers suspected he was trying to throw an IED their way.\n** Hadeel al-Hashlamon (18) was shot 10 times in Hebron, lacked medical assistance for a half-hour, and expired several hours later, at 4 p.m. in Shaare Zedek Medical Center in Jerusalem. Accounts are contradictory. Two bystanders witnessed the event: a Brazilian human rights activist, Marcel, and a Tel Rumeida resident, Fawaz Abu Aysha. The Westerner said that she appeared to be trying to open her purse. According to Israeli spokesmen, she was shot while trying to stab Israeli soldiers. A metal detector is said to have gone off when she passed the \"Kikar Hashoter\" checkpoint by the entrance of Hebron's al-Shuhada street. Soldiers claim she refused to heed a warning shot, and was shot in the legs when she drew a knife. When she attempted to raise the knife again, she was shot again. A photo on Palestinian media shows her kneeling as a soldier aims his rifle at her. The Israel account is that she hadn't at that point yet pulled out a knife. Fawaz Abu Aysha said the woman did not understand the Hebrew shouted at her, that as they shot at her feet she seemed in a state of shock, that she moved back when a gate was opened to allow her to retreat, a small gate inside the checkpoint so that she could back away from the soldiers. At the time of the shooting, a metre high barrier stood before her and the checkpoint soldiers. Other soldiers rushed in, shot her in the left, then the right leg, and then fired 6/7 bullets into her chest and stomach. Amnesty International judged it to be an example of an extrajudicial killing, while B'Tselem said arresting the woman was an option and the killing was disproportionate. The woman was, for B'Tselem, holding a knife, froze at the Israeli orders and then started to leave the checkpoint with a 1.2&nbsp;meter metal barrier between her and the soldiers, who then shot her. The Euro-Mediterranean Human Rights Monitor group cites the case as one of 8 instances of the arbitrary use of structural violence, in an extrajudicial execution, by Israeli forces. They claim she refused inspection by males, and requested a woman soldier to conduct it, and note Israel has refused to release its own video evidence.\n* 25 September\n** Maram Abed al-Latif al-Qaddumi (either 3 or 7), the daughter of Colonel Abd al-Latif al-Qaddumi, was reportedly shot in the head by a rubber-coated steel bullet while standing on a balcony in her home. The father was reportedly also shot in the head as he attempted to take her to hospital by car. Qaddumi's house had been sequestered, and the family evicted, on 11 September for a temporary Israel military outpost. An Israeli spokesman repudiated the claim, stating that an investigation indicated the injuries had been caused by Palestinian stone-throwing. The incident is believed to have occurred on Friday as Israeli forces mustered to disperse the weekly protests at road closures in the village of Kafr Qaddum.\n** 3 Palestinians were shot in the legs by live fire during clashes with Israeli forces at Tuqu near Bethlehem.\n** 2 AFP journalists were assaulted and their equipment destroyed by Israeli soldiers when they were filming the funeral of Ahmed Khatatbeh at Beit Furik.The IDF regarded the actions as \"grave\" and subsequently imposed disciplinary measures on the commander, who was suspended.\n* 28 September\n** 22 Palestinians were reportedly injured in clashes with Israeli forces at Al-Aqsa. 3 required hospitalization after being hit by rubber bullets. According to Israel, young protesters sleep inside the mosque, ready to harass Jewish visits. Palestinians fear the uptick in Jewish visits will lead to a change in the rules regarding the site.\n* 29 September\n** 12 Palestinians were wounded, 3 reportedly by live ammunition, in clashes with Israeli forces dispersing a protest attended by roughly 300 Palestinians near the settlement of Beit El and north of el-Bireh, near Ramallah.\n** A rocket was fired from the Gaza Strip towards Ashdod around 10:45 pm and was intercepted by Iron Dome. A militant Salafist group, the Sheikh Omar Hadid Brigade, claim responsibility, stating that it was in response to the killing earlier of Hadeel Hashlomon in Hebron.\n* 30 September\n** The IAF launched airstrikes against 4 sites run by the Hamas armed wing, the Izz ad-Din al-Qassam Brigades.\nOctober\nIn the context of tensions over the status of the Temple Mount (Haram al Sharif), a wave of stabbing incidents occurred, with lone wolf Palestinians often using low-tech means, household items like kitchen knives, screwdrivers and, in one case, a vegetable peeler, to attack Israelis. Cars to ram pedestrians, and also guns and a machete-like weapon were also used. According to Peter Beaumont, \"one unnamed officer told the Israeli columnist Nahum Barnea\" about unprecedented scale of \"violence of Jews against Arabs. [...] Violence spurs counter-violence\". The number of Palestinians injured in October was estimated to be 8,262. Of these 2,617 were shot, 760 by live fire, 1,857 by rubber-coated steel bullets. 5,399 Palestinians required treatment for excessive tear gas inhalation, and a further 246 were injured with other means, through assault or from burns from tear gas canisters. Of 69 Palestinians killed, 26 were so during clashes, and 46 were shot during attacks, attempted attacks or alleged attacks against Israelis.\n* \"The violence of Jews against Arabs this time has reached a scale the likes of which we cannot remember,\" one unnamed officer told the Israeli columnist Nahum Barnea in Yedioth Ahronoth last week. \"Israelis uprooted hundreds of the Arabs' olive trees, demolished houses, vandalised cars. Violence spurs counter-violence.\" OCHA reported that over the week 29 September-5 October, 794 Palestinians had been injured in the West Bank and east Jerusalem:10% from live fire, 25% from rubber bullets. The Palestinian red Crescent Society treated 1,298 people injured by Israeli forces over the period 2–7 October. 75 had been shot by live ammunition, 344 by rubber-coated steel bullets. 20 suffered from severe beatings.20 Red Crescent ambulances had been attacked by settlers or soldiers or subject to checkpoint delays over the same period. The Palestinian Ministry of Health calculated from its hospital registries that, from October 1, 165 had been hit by live fire, and 375 had been injured by rubber-coated metal bullets. A further 150 had received treatment in Jerusalem's Al-Maqassad hospital for wounds from one or the other type of ammunition. AI said a huge surge in settler violence. The Palestinian NGO Al-Haq documented 28 instances from 28 September to 4 October, ranging from stone-throwing, beatings, burning crops, to gunfire. On several occasions Israeli forces present had refrained from intervening, according to Yesh Din.\n* 29 September-5 October\nIn the week from September 29 to October 5, 4 Israeli settlers were killed by Palestinians, and four Palestinians, one of whom perpetrated the killing of 2 Israelis, and one of whom was a child, were killed. 7 Israelis were injured by Molotov- and rock-throwing and one vehicle was damaged. 794 Palestinians were injured in clashes with Israeli forces, 10% by live ammunition and 35% by rubber bullets. One Israeli security officer was hurt. 110 search-and-arrest operations were conducted by Israel in the West Bank.155t >Palestinians, 14 children, were arrested. Settlers attacked Palestinians or their property on 29 occasions, engaging in shooting, physical assault, throwing stones and Molotov cocktails, and property arson, with 14 vehicles and 250 trees damaged. Armed groups in Gaza launched several missiles towards Israel, while 9 Palestinians were arrested trying to enter Israel.\n* 1 October\nIn the context of tensions over the status of the Temple Mount / Haram al Sharif, a wave of stabbing incidents occurred, with lone wolf Palestinians using low-tech means, household items like kitchen knives, screwdrivers and, in one case, a vegetable peeler, to attack Israelis. Israeli security sources also noted an unprecedented uptick in Jewish extremist violence as contributing factors to the escalation. OCHA reported that over the week 29 September-5 October, 794 Palestinians had been injured in the West Bank and east Jerusalem:10% from live fire, 25% from rubber bullets. The Palestinian red Crescent Society treated 1,298 people injured by Israeli forces over the period 2–7 October. 75 had been shot by live ammunition, 344 by rubber-coated steel bullets. 20 suffered from severe beatings.20 Red Crescent ambulances had been attacked by settlers or soldiers or subject to checkpoint delays over the same period. The Palestinian Ministry of Health calculated from its hospital registries that, from October 1, 165 had been hit by live fire, and 375 had been injured by rubber-coated metal bullets. A further 150 had received treatment in Jerusalem's Al-Maqassad hospital for wounds from one or the other type of ammunition. AI said a huge surge in settler violence. The Palestinian NGO Al-Haq documented 28 instances from 28 September to 4 October, ranging from stone throwing, beatings, burning crops, to gunfire. On several occasions Israeli forces present had refrained from intervening, according to Yesh Din.\n* According to Israeli sources, Erica Marom (28), \"a producer for the BBC in Israel who lives in Tekoa, suffered cuts to her legs from broken glass; her 6-month-old baby was also treated\" after dozens of 8- to 10-year-old Palestinian children threw rocks at the car. \"They used the blocks used to build houses, and it's only a miracle nothing happened. I was in fear of my life, but I left my hands on the steering wheel and we continued to drive\", her husband Moshe said. Clashes started afterwards, when the Tekoa settlement's security coordinator \"fired warning shots in the air, dispersing the crowd\". According to initial Palestinian reports, a settler believed to be a woman fired on a school in Tuqu', and locals responded by throwing rocks at the departing car, lightly hurting the alleged perpetrator, thought to be from the settlement of Tekoa. It is claimed settlers then blocked the main road between Bethlehem and Hebron in the southern occupied West Bank. The IDF intervened and dispersed the Palestinians. Samih Ali Abed Sabah (28) was subsequently shot in the thigh by live fire for, according to Israeli reports, being the 'main instigator' and refusing to disperse.\n** A Jewish Israeli couple, Eitam and Na'ama Henkin from the settlement of Neria, were murdered in a drive-by shooting assault between Itamar and Elon Moreh near Beit Furik. The woman died immediately, the husband, despite critical wounds, managed to get out of the car and urge his children to flee and hide. Their four children, between the ages of 4&nbsp;months and 9&nbsp;years, survived uninjured, but are under treatment for shock. The murderers were said to have stopped to \"verify\" the kill before speeding off to a nearby village. Hamas spokesman praised the attack as heroic and called for further such attacks. The Popular Resistance Committees also \"blessed\" the murder as a 'natural response' to \"Israeli crimes.\" A small Fatah-affiliated armed group, the Abd al-Qader al-Husseini Brigades, claimed responsibility. The incident was compared by Gideon Levy to the shooting of Ahmed Khatatbeh on the same road a few days earlier. On 5 October, Israeli security forces arrested what it called a 5-man \"Hamas cell\" in Nablus for the murders, stating that they had confessed to the killings. Amnesty International noted that the arresting body has for many years tortured suspects with impunity. The suspects are Ragheb Ahmad Muhammad Aliwi the leader, Yahia Muhammad Naif Abdullah Hajj Hamad, the assassin;Samir Zahir Ibrahim Kusah, the driver; Karem Lufti Fatahi Razek, the gunman wounded by 'friendly fire' from another member of the cell, and Zir Ziad Jamal Amar, who cased the site for the attack.\n** Settler disturbances broke out overnight in what were described as price tag assaults. A Palestinian car was torched in Beitillu; settlers rallied outside Huwara, smashing several cars at the nearby checkpoint. A raid was conducted on Burin, a house stoned in Beitin and a Palestinian intelligence commander was injured when his vehicle was hit by rocks near Beit Furik. 15 Palestinian vehicles, including an ambulance, were damaged.\n** According to B'Tselem, which supported its claims by video evidence, in the wake of the Henkin murders, settler attacks, often supported by Israeli troops, on Palestinians and their lands became widespread throughout the West Bank over the following days. Soldiers deployed crowd-control weaponry against Palestinians throwing stones to resist the rampages.\n* 2 October\n** Israeli settlers torched dozens of olive trees on the property of Um Ayman Sufian near the village of Burin, and endeavoured to set fire to her house before they were driven off, and the fire extinguished.\n** Settlers also set fire to agricultural lands at Huwara village.\n** Walid Khalid Qawwar, (35) from Aida refugee camp sustained shrapnel injuries when settlers reportedly opened fire at a major crossroads in the Gush Etzion settlement bloc\n** 3 Palestinian medics, Dr. Samel al-Att, nurse Murad al-Qatuni, and anesthetist Samer Habash were injured by settler rock throwing which struck their ambulance as they drove near the settlement of Kfar Tapuach.\n** A Red Crescent ambulance was attacked by Israeli troops in Isawiya village, East Jerusalem, to arrest an injured Palestinian inside the vehicle.\n* 3 October\n** Israeli forces shot 10 Palestinians with live fire in the legs or stomach during raids in the ad-Daheya neighborhood of Nablus, on a mission to search for the perpetrators of the murders of Eitam and Na'ama Henkin. Nazmi Hattab was shot with live ammunition in the chest. 4 others were reportedly beaten up.\n** According to Maan, a Palestinian child, Yousef Bayan al-Tabib (6) of the village of Izbeit at-Tabib 6&nbsp;miles east of Qalqiliya, was critically wounded in the stomach. \"Local reports say\" a settler is suspected, a person reportedly stopping his car to shoot the child, who was standing on the side of the road.\n*** Later Ma'an has changed its title to 'Family: Israeli settler shoots, injures 6-year-old Palestinian' after on IDF investigation, it emerged that the family had lied: the child was wounded \"while playing with a gun owned by his brother, a Palestinian police officer\" and \"the family invented the story... to protect their older son and additionally to get a paycheck... as victims of terror at the hands of Jewish settlers\".\n** An empty IDF military vehicle in the vicinity of Hebron was torched by a firebomb.\n** An Israeli suffered light wounds when his car was stoned by unknown attackers in the West Bank.\n** An Israeli ambulance on an evacuation mission was stoned but managed to reach the hospital.\n** 3 members of an ultra-Orthodox family, Aharon Bennett/Benita (24), of the settlement of Beitar Illit, his wife Adele (22) and one of their two children were attacked in a combined stabbing and shooting assault in Jerusalem near the Lions' Gate in the Old Quarter. The assailant was Muhannad Shafeq Hallabi (19) a Palestinian law student at Al-Quds University from al-Bireh near Ramallah. According to police, his friend Abed al-Aziz Mari, of Abu Dis, planned the attack after Israeli police had blocked them from praying at Al-Aqsa mosque, Mari then purchasing the knife Hallabi used. Versions vary. One man, Nehemia Lavi (41), a retired rabbi for the IDF and rabbi at the Ateret Yerushalayim Yeshiva in East Jerusalem, had in one report intervened, gun in hand, to stop the assailant, who, after stabbing Lavi seized his gun and shot the others, a couple. Lavi pronounced dead on arrival in hospital. Another version says Hallabi first stabbed the baby's father, Aharon, and took the gun from him to shoot at tourists close by. Bennett died of wounds later in hospital, and his wife who, though stabbed, managed to run and alert Border police, was in critical condition, and her 2-year-old infant, Natan, was also lightly injured with a gunshot wound to the leg. The presumed killer was shot dead by police. On Facebook the day before, Halabi expressed his conviction Palestinians would not put up with Israeli attacks on the Temple Mount and that a Third Intifada had already begun. This was one of a flurry of posts advocating violence against Israeli citizens and soldiers following the death on September 22 of a fellow student and friend, Diaa Talhama. That night, as his parents looked on shocked, youths danced and praised his memory before the family home at Surda. Islamic Jihad issued a statement praising the attack, stating Hallabi was an activist Islamic Jihad's student group, but did not claim responsibility, while Hamas praised the attack.\n** According to A. Hass, soon after settlers, reportedly from the Har Brakha and Yitzhar settlements, attacked the village of Burin, torching agricultural fields and groves.\n* 4 October\n** Overnight from 3 to 4 October, \"shortly after the terror attack, in which a Palestinian stabbed to death two Jews\", central Jerusalem was scoured by mobs seeking to identify and attack Palestinians. Hundred of people, mostly youths, but including Ben-Zion Gopstein, Lehava militants and Baruch Marzel, gathered at Zion Square ran amok shouting 'Death to Arabs' slogans and looking for Palestinians: a kitchen worker and taxi driver were attacked; Palestinian sanitation workers required a police escort; a Palestinian woman in the \"Medabrim Bakikar\" dialogue group in Zion square was threatened; an attempt was made to penetrate the Muslim quarter.\n** At around 4 a.m. a 15-year-old Israeli, Moshe Malka, was stabbed, reportedly, by Fadi Samir Mustafa Alloun (Alon, Aloon) (19) from the East Jerusalem Arab neighborhood of al-Isawiya, who tried to flee after stabbing, but was shot dead by Israeli police officers. The incidents occurred in the Musrara neighbourhood. Alloun had earlier written on his Facebook page:\"Either martyrdom or victory\". 20 youths in his quarter had been wounded in clashes with Israeli police earlier. The family insists he was caught up in a settler rampage. One relative said he was on his way to work in a bakery. His father, saying his son had gone jogging at the time and citing a video and witnesses, said Alloun had been surrounded by settlers threatening to kill him, and was shot while fleeing for police protection, as the latter were egged on by bystanders. Both the Euro-Mediterranean Human Rights Monitor and Amnesty International stated his death appears to be an extrajudicial killing.\n** At dawn, Israel forces broke into the Jenin Refugee Camp and fired a missile at the home of an Izz ad-Din al-Qassam Brigades militant Qays a-Sa'adi. The Law missile destroyed the house: it is not yet ascertained whether the target was inside the residence or not, but he was arrested and a sizeable cache of weapons sequestered, on 27 October. 55 Palestinians were injured duringt the incident, 11 of them by live ammunition. A Palestinian, Karam al-Masri (23), hospitalized with an arm fracture 2&nbsp;days earlier, was seized and dragged from the local hospital by IDF troops disguised as Arabs who also reportedly smashed video surveillance cameras. It emerged on 5 October that the man seized in the hospital, identified as Karem Lufti Fatahi Razek, was arrested on suspicion of being involved in the murders of Naama and Eitam Henkin, and his injury the result of friendly fire during the assassination.\n** The Palestinian Red Crescent declared an emergency after declaring that its staff and ambulances had been attacked by Israeli soldiers and settlers 14 times over the preceding 3&nbsp;days.\n** An ambulance at Jalazone Refugee Camp was shot up and two volunteers accompanying wounded.\n** A Palestinian reporter, Hanaa Mahameed working for the Al Maydeen network, was reportedly injured by stun grenade shrapnel as she was broadcasting clashes in Issawiya.\n** According to the Red Crescent society, of the 220 Palestinians injured during clashes over the 24-hour period of Saturday and Sunday, at least 96 Palestinians had been wounded by Israeli gunfire, 28 with live rounds, 68 with rubber-coated steel bullets. Other Palestinian sources put the figure for Palestinian wounded at over 100.\n** A Palestinian youth was shot in the leg, allegedly for stone-throwing in Isawiya, East Jerusalem. He fled before Israeli forces could apprehend him.\n** 3 Palestinians were shot outside the campus of Al-Quds University in Abu Dis with rubber-coated steel bullets. The Palestinian Red Crescent Society reported that one of its ambulance crews was attacked by soldiers as it attended to the injured.\n** An Israeli military vehicle was firebombed outside Hebron, at Halhul. An Israeli military post was hit with an IED outside Beit Ummar, and al-Arrub refugee camp was closed after youths threw stones at a military vehicle.\n** Among several separate incidents reportedly involving settler attacks, Jasir Hazazi (65) an elderly guard at the al-Baraka park in Yatta was assaulted by settlers. Also solar panels were smashed at a village east of Yatta. The car of a Palestinian doctor Imad Abu Iram, had its windows smashed by settlers at Reef Junction near the village of Zif. The home of Kayid Daana in Wadi al-Hussein near Kiryat Arba was stormed by settlers and similar attacks were reported in Hebron's Salayma neighborhood.\n** 2 rockets were fired from the Gaza Strip towards Israel. One landed within the Strip, the other on open ground in the Eshkol Regional Council.\n** Huthayfa Othman Suleiman (18) died after being shot in the chest in clashes with Israeli soldiers at Bal'a, while 3 or 4 others were also wounded by live fire, Omar Jadba in the abdomen and legs, and the others two in the lower extremities. 6 were wounded by rubber coated steel bullets. The Palestinian head of state Mahmoud Abbas formally asked the UN to provide Palestinians with protection from what he termed 'Israeli aggression'.\n** A ban, which did not apply to Israelis or foreign tourists, was imposed on non-resident Palestinians, excepting businessmen and students, from entering the Old City of Jerusalem for two days. Palestinians under 50 were banned from praying at the Al-Aqsa mosque. Amnesty International stated that this measure violated the right to Freedom of movement guaranteed by Article 12 of the International Covenant on Civil and Political Rights.\n* 5 October\n** Overnight, at 2:30 am., the Israeli Air Force retaliated for the rocket fired from Gaza by launching a strike that hit a Hamas training camp in the northern Gaza Strip.\n** Two Palestinians Adham Musallam (13) of Hebron and Muhammad al-Tarayra (24) of Bani Naim were reportedly assaulted at al-Arrub refugee camp by settlers and required hospitalization.The IDF subsequently announced it would close off the camp because of stone-throwing at settlers' vehicles.\n** In the morning 8 Palestinians were shot by rubber-coated bullets, 5 at a demonstration in Ramallah.\n** A 12-year-old boy, Abed al-Rahman Shadi Obeidallah/Abed a-Rahman Abdallah, was critically injured with a wound near the heart by Israeli troops at Aida Refugee Camp. He died shortly afterwards in hospital. The day after, the IDF admitted it had made a mistake, giving two alternative versions. Either they had targeted someone standing near him, or a bullet fired at his legs missed the target and \"ricocheted\" into his chest. B'Tselem replied that the rifle in question, a Ruger was furnished with a telescopic sight, and was fired in broad daylight at the two targets who stood some 70&nbsp;metres away. Amnesty International said an investigation was required to determine if this killing which it defined as 'unlawful', was an extrajudicial execution. Another youth (11) standing next to Obeidallah, was shot in the leg during the same clashes. Youths from the camp set fire to the Israeli watchtower from which they believe the sniper had fired.\n** In dispersing a protest at Obeidallah's killing at the northern entrance to Bethlehem, Israeli forces shot one youth in the head with a rubber-coated steel bullet, while another was wounded with a live round to his leg.\n** 2 women were pelted with stones, and one was lightly injured, on the Hass Promenade near the East Talpiot. A Palestinian suspect was arrested.\n** Several Palestinian vehicles were pelted with rocks by Jews near Ramat Shlomo, and one ultra-Orthodox suspect was arrested.\n** The Palestinian Red Crescent Society was reported as estimating that 395-456 Palestinians had been injured in clashes with Israeli forces in the preceding 24&nbsp;hour period. 32-36 were wounded by live ammunition, and 118-136 by rubber coated steel bullets; 243 by the effects of tear gas inhalation, and 11 in clashes with Israeli security forces.\n** In clashes in the Bab al-Zawiya area of central Hebron, Israeli forces shot 9 people with rubber-coated steel bullets, injuring one critically in the head.\n** A Palestinian youth was shot in the chest in clashes at Beit Hanina and left in a critical condition. His death later in the evening brought the total of teenagers killed by Israeli forces in the last 24&nbsp;hours to 3.\n** 30-35 youths were reportedly shot with rubber-coated steel bullets in Shuafat. One was wounded in the genitals.\n* 6 October-12 October\nThroughout the week in the Palestinian territories and Israel, 23 Palestinians were killed by Israeli fire, and 2,311 Palestinians were injured, the highest number since OCHA began compiling statistics in 2005. In a sharp uptick of Palestinian attacks 32 Israelis also suffered injuries: 13 stabbing or alleged stabbing attacks occurred, injuring 19 Israelis, including 2 children, and 5 security officers, while 8 Palestinian assailants were killed, and another 3 injured. In the West Bank West 2,071 Palestinians, including at least 170 children, and 13 Israeli officers were injured. 13%  were wounds caused by lived ammunition, the rest by sponge bullets and tear gas. In the Gaza Strip 9 Palestinian civilians, including one child, were shot dead by Israeli fire, and another 237, including 31 children, injured during protests between 9–10 October. 13 Palestinians, including 3 children, were injured in 8 settler attacks.\n* 6 October\n** Overnight 6 Palestinians were shot with live ammunition and rubber-coated steel bullets in clashes with Israeli forces at al-Bireh, near Ramallah and the Israeli settlement of Beit El. One of the wounded at Ramallah was a research assistant for Human Rights Watch, who had observed Palestine throwing stones and firing guns a few hours before. When she was shot, at 1:30&nbsp;a.m. the demonstration had turned peaceful: the closest Israeli soldiers were 500&nbsp;metres away and she was wearing a flak jacket marked \"press.\" 3 bullets rubber-coated steel bullets of the type were used: 2 struck her flak jacket, one ricocheting into her jaw. A third either grazed her hand or exploded nearby causing a shrapel wound.\n** 2 Palestinians were shot in the head with 0.22 ammunition, and a third in the leg, by Israeli forces in Bethlehem during clashes in the wake of the funeral of Abed al-Rahman Obeidallah. Another 7 were injured by rubber-coated steel bullets.\n** Settlers reportedly stoned Mahmoud Khalil Abu Qubita's house west of Yatta, smashing the windows and injuring his son Osama (10) in the head. The child required hospitalization.\n** Palestinian rock throwers in the Israeli city of Jaffa injured lightly 6 policemen, and damaged A bus and vehicle.\n** Israel demolished 2 family homes in Jabel Mukaber, and sealed another in At Tur, in what Amnesty International called Collective punishment since terrorists lived there. 13 people (seven children) were left homeless. In two of the demolitions, the explosions caused severe damage to 3 contiguous homes, making them uninhabitable, bringing the number of Palestinians without a domicile as a result of the actions to 30, including 20 children.\n** The Red Crescent and Palestinian Authority Ministry of Health stated that over 129 Palestinians had been injured in clashes with Israeli troops throughout Tuesday, 8 from live ammunition and a further 23 from rubber-coated steel bullets. The Red Crescent also registered a complaint that from Friday to Tuesday Israeli forces had attacked their emergency relief teams 27 times, injuring 17 staff and damaging 10 ambulances.\n** Ansar 'Aasi (25), while watching clashes from the store where he is employed in Bireh, was kicked and assaulted with rifles by soldiers who arrested him. His injuries required hospitalization. Soldiers testified he was a stone thrower. Only the examination of the shop's video footage absolved him of the accusations. He was released after 5&nbsp;days' detention.\n* According to B'Tselem, over a period of 5&nbsp;days, from the 6–10 October, IDF soldiers stood by or provided military backing for settlers from Kiryat Arba as they repeatedly attacked with stone- and bottle-throwing houses in the Palestinian neighborhood of Wadi a-Nasarah in Hebron and threw stones and glass bottles at the houses by the fence. Settler attacks intensified when 2 Israelis were subject to stabbing attacks in Hebron.\n* 7 October\n** 2 Palestinians throwing rocks on the road between the settlements of Tekoa and Har Homa damaged 7 cars. One incident near the Beit Sahour checkpoint resulted in the smashing of a windscreen by youths directly jumping on the car, and a light injury to the driver, Rivi Lev Ohayon (38) from Tekoa, who stated that an attempt had been made to \"lynch\" her. The two were shot and wounded by Israeli civilians nearby, outside the village of Dar Salah: Mujahid Naem Abu-Sarhan (18) in the chest and Suhaib Ibrahim Hasasna (18) in the leg. Both are from the town of al-Ubeidiya.\n** A Palestinian woman Shuroq Salah Dwayat (18) of Sur Baher was shot four times in the upper body that left her in a serious condition. Israeli police allege that she stabbed an Israeli man (36) in Hagai street near the Lions' Gate in the Old City of Jerusalem, wounding him twice in the back, after which he responded by opening fire at her. The victim, Daniel, says that a friend of his held the woman after the stabs, enabling him to recover and shoot her. Palestinian eyewitnesses' accounts have contradicted this allegation, asserting that she \"did not carry a knife, or a weapon, and that the Israeli assailant was harassing and insulting her, near Bab al-Majles (The Council Gate) before removing her hijab, covering her head, and shot her when she tried to push him away.\" Her family's home was raided by Israeli forces and were evicted.\n** Amjad Hatem al-Jundi (24) was shot dead after he stabbed an Israeli soldier in Kiryat Gat, stole his rifle, after lightly wounding the soldier in the head, and fled. He is said to have broken into a woman's apartment and tried to kill her but the rifle had no cartridges left. Local soldiers arrived and reportedly shot him when he apparently opened fire on them.\n** Palestinian stone-throwers damaged an Israeli car traveling near the settlement of Carmel.\n** According to the Red Crescent, over 288 Palestinians were injured in clashes with Israeli forces on Wednesday: 10 with live ammunition, 89 with rubber-coated steel bullets (), and 189 from tear gas inhalation. A Birzeit University student, Ahmad Ahmad, was critically injured by a rubber-coated bullet shot to the head, and later died of his wound. Israeli sources stated they are investigating to see whether the cause of his death was from gunfire or stone-throwing.\n** A Palestinian was shot and moderately wounded at a checkpoint near the settlement of Ma'ale Adumim. Israel sources say either that he attempted to crash the checkpoint to run over Israeli guards on duty there, or that the car appeared to be approaching with intent to injure soldiers. The incident is under investigation since it is not quite clear whether or not the driver intended to attack the post.\n** A Palestinian Tamer Younis Ahmed Vareidat (25) from ad-Dhahiriya stabbed an Israeli on Jabotinsky Street in Petah Tikva, lightly wounding him, before being overpowered and arrested.\n** A Palestinian youth (15) was arrested after reportedly trying to stab Israeli police in Abu Tor.\n* 8 October\n** A Palestinian youth Subhi Ibrahim Abu Khalifeh (19) stabbed a Haredi (25) in the neck at the French Hill neighbourhood of East Jerusalem. The assailant was arrested.\n** A Palestinian stabbed 4 people in front of the IDF headquarters in Tel Aviv with a screwdriver, wounding one moderately, and the others lightly. He was shot dead by an IAF officer.\n** A Palestinian stabbed a settler Meir Pavlovsky (30) inside the settlement of Kiryat Arba and fled to Hebron. Pavlovsky was wounded in the stomach and shoulder and required several surgical interventions. A suspect was arrested in Hebron in April 2016.\n** A Palestinian stabbed an Israeli soldier (20)in the chest in Afula. The victim was in moderate condition. The Palestinian was arrested.\n** Abed al-Kader Jamal of Qalansawe, while visiting Netanya with friends, was set upon by dozens of Israeli Jews who had coordinated through social media a foray to assault Arabs, was stabbed in the leg and thrashed with sticks and chairs. He was saved by a local Jew, Maimon Haimi, who initially took him for a terrorist, tackled him and then, realizing he was a victim, protected him with his body. 5 Israelis were arrested some days later for the assault.\n** A Palestinian youth Wissam Faraj (20) died after being shot in the heart by a dumdum bullet when Israeli forces raiding Shuafat to conduct a search of Subhi Ibrahim Abu Khalifeh's home encountered opposition from youths throwing stones and IEDs. 5 other Palestinian youths were shot by live fire, and a further 35 with rubber-coasted steel bullets.9 Israeli security personnel were injured.\n** A Palestinian in Nablus suffered moderate wounds when suspected settlers driving by threw stones at the Palestinian Minister for Communications.\n** A Palestinian child (9) was injured a stone struck the car he was in near the unauthorized Israeli outpost of Havat Gilad.\n** Ayub Abu Ajra (17) was shot in the foot with live fire at Bethlehem during clashes with Israeli forces. 3 others were injured by rubber-coated steel bullets.\n** The stabbing attack comes after reports that An Israeli group reportedly assaulted Palestinians in central Netanya, throwing chairs at them and shouting \"Death to Arabs\".\n** 9 Palestinians were injured by live fire at al-Bireh, and another 30 with rubber-coated steel bullets, in clashes with Israeli forces. Two soldiers were injured by rock throwers.\n** Ibrahim Ahmad Mustafa Aoud (27) was critically injured in clashes at Beit Ummar after being struck in the head by a rubber-coated steel bullet. He died of his wound on Saturday evening 10 October.\n** Tha'er Abughazaleh (19) was shot dead reportedly after he stabbed an Israeli soldier and 3 others. Israeli sources state that he was fleeing. According to Euro-Mediterranean Human Rights Monitor, photographic evidence suggests he was shot in the head at point-blank range.\n* 9 October\n** 4 Palestinian Bedouin workers were stabbed by an Israeli youth (17) in Dimona. One (35) was a labourer, and the other 3 municipal workers. Two were lightly injured, and another two were diagnosed as having moderate to serious wounds. The perpetrator is described as having a psychiatric history, and as believing that all Arabs are terrorists. One of the victims, Eid al-Hawashla (44) said an Israeli guard present at the scene with a drawn gun, did not fire but simply warned the assailant to back off.\n** An Israel youth (16) was stabbed on Shmuel Hanavi Street in Jerusalem. The assailant fled. Police later detained a suspect, a Palestinian youth (18) from Hebron,\n** A Palestinian Mohammad Al-Jabari (19) reportedly stabbed a police officer in his limbs in Kiryat Arba, and then attempted to wrest his gun from him. Other officers present shot him dead adjacent to Hebron. The officer was lightly wounded and the stabber was shot and killed by other officers. 11 others were injured, three shot in the feet with live ammunition. A Kiryat Arba settler apparently threw a piece of pork on al-Jabari as he lay wounded. In an Islamic belief, this would deny the person Allah's blessing in the afterworld.\n** An Israeli Arab woman Israa Abed (30) was shot and seriously wounded after, according to initial reports, she tried to stab an Israeli security guard at the Central Bus Stop in Afula. The case against the woman as a terrorist was dismissed by Israel's Justice Ministry 3&nbsp;weeks later, when it ruled, on the basis of a video, she had no intent to injure any Israeli, but rather have herself killed by an Israeli soldier in order to suicide heroically. She is still liable to criminal charges. A video of the incident shows the woman holding something in her hand. She is surrounded by several soldiers, instructed her in Hebrew and English to put down her weapon, and then shot her in the lower body. According to Ma'an News Agency she did not seem to pose a threat to the heavily armed soldiers at the time. According to Jonathan Cook, the object she was waving might have been a pair of glasses, which are captured being kicked away by a video taken at the time. Her family said she suffered from mental health problems. Euro-Mediterranean Human Rights Monitor cites it as one of 8 cases of arbitrary shooting by Israeli forces in 2015.\n** Israeli forces, firing across the border into Gaza, shot 7 Palestinians dead, and wounded from 35 to 60/145 others, 10 seriously, who were engaged in a demonstration 50&nbsp;metres from the Israel-Gaza border, east of Shujaiyya and west of the Nahal Oz kibbutz. The 3 killed near Shujaiyya were Ahmad al-Harbawi (20) from the Nuseirat Refugee Camp, Abedal-Wahidi (20), and Shadi Hussam Dawla (20). Muhammad al-Raqeb (15) and Ziad Nabil Sharaf (20) were shot dead near Khan Younis as was Adnan Moussa Abu Elayyan (22) with a shot to the head. Israeli sources confirmed 5 live fire \"hits\"  aimed at what they described as the \"instigators\" in a crowd of 200 Gazans who approached the border and threw rocks and rolled burning tires towards the border fence. 4 teenagers were also arrested during the clashes. One, Muhsin Ramadan al-Azzazi (14), an eighth-grade student from al-Bureij Refugee Camp, later sentenced in January 2016 to 6 months imprisonment by an Israeli court, told his lawyer that on the day, he was seized by 3 soldiers, forced to strip at gunpoint, handcuffed and blindfolded, and, once inside a military vehicle, subject to beatings in which he sustained broken teeth, a shoulder wound, causing him to vomit blood.\n** 5 Israelis including 3 children were injured when their car crashed after being pelted by Palestinian stone throwers.\n** 3 soldiers were lightly injured by stones thrown at Nabi Salih and near Rachel's Tomb\n** Numerous clashes with Israeli forces in the Hebron region broke out. In Beit Ummar, 17 Palestinian were reportedly injured, including 3 from live fire. Ibrahim Ahmad Mustafa Awad (29) was shot in the head by a rubber-coated steel bullet, and remained in critical condition. Muhammad Khalid Issa Adi (17), Hamzeh Samir Sadeq Abu Maria (16) and Majd al-Alami (15) were wounded by live fire.\n** The village of Yanun was subject to a settler attack, successfully warded off. 50 settlers from the Elon Moreh settlement reportedly attacked a farming zone east of Rujeib village, and destroyed dozens of olive trees.\n** Clashes took place, with large-scale protests by Palestinians within Israel, esp. in Nazareth, Sakhnin and Kfar Kanna. Police shot a man holding a firebomb in the leg in At-Tur, East Jerusalem. 2 firebombs were thrown at vehicles on route 65 between 'Ara and Ar'ara.\n** According to the Palestinian Ministry of Health, Palestinian casualties from October 1 through to October 9 amounted to 14 killed and 1,000 injured by Israel forces. On the 9 alone 7 had been killed, and 200 wounded with live and rubber-coated steel bullets,\n** 6 Palestinians were shot by live fire and a further 22 with rubber-coated steel bullets near the Beit El settlement.\n** Ahmad Salah (24) was shot dead by Israeli police at Shuafat Refugee Camp.\n** In Bethlehem, I Palestinian was shot with live ammunition in the foot, and 5 were wounded with rubber-coated steel bullets.\n** At Kafr Qaddum 3 Palestinians were shot by live fire in the stomach and feet.\n** 6 Palestinians were reportedly beaten by Israeli forces and settlers in Beit Furik, and one is said to have suffered a head fracture.\n** In Jenin, live ammunition struck 9 Palestinians in the feet. A further two, one of whom was shot in the neck, were injured by rubber-coated steel bullets.\n** Amnesty International in a press release, calling on both sides to end the attacks on civilians in the escalation since October 1, condemned 'the widespread use of excessive force' against Palestinian demonstrators, and Israel's failure to protect Palestinians from settlers attacks. It also urged the international community to address 'the repression, discrimination and dispossession that are inherent in Israel's illegal settlement project in the OPT, beginning by insisting that Israel halts construction in and expansion of settlements.'\n** An Israeli woman reported being shot at while driving her car near the settlement of Karnei Shomron.\n* 10 October\n** Undercover Israeli forces in a night raid shot a Palestinian in the village of Barta'a. Local sources claim the man was shot while in a parked car. The youth in the car sustained minor injuries, while 4 other men in the vehicle were arrested.\n** A 25-year-old Palestinian who reportedly fired on Israeli Border police during clashes at the Shuafat Refugee Camp overnight involving the throwing of stones and Molotov cocktails was shot and critically wounded, and died later in the morning.\n** A Palestinian armed with a knife and gun reportedly endeavouring to infiltrate a settlement near Hebron was \"neutralized\" at around 3 am.\n** A rocket from Gaza fell over the border fence in the Eshkol Regional Council next to the border fence with Gaza\n** Two Israelis aged 62 and 65, were stabbed by a Palestinian youth Ishak Badran (16) of Kafr 'Aqab while they were returning from prayers at their local synagogue in Jerusalem. The youth was shot dead after reportedly advancing towards Israeli policemen with a knife in hand and refusing to halt when warned to do so.\n** An Israeli journalist, (35), was shot by a rubber-coated steel bullet as police dispersed a crowd of Palestinians at the Damascus gate.\n** A Palestinian youth Muhammad Saed Ali (19) of Shuafat stabbed 3 policemen and was, in turn, shot dead, on Sultan Suliman Street near the Damascus Gate. Haaretz reported he stabbed the officers, one in the neck, after being asked for his identification papers in the neck. Friendly fire from other officers reportedly not only killed the youth but wounded 2 other officers, one of whom had earlier been stabbed.\n** Israeli Border police shot dead 2 Palestinian boys in Gaza. The victims were Marwan Barbakh (13) and Khalil Othman (15). Both were participating in a protest east of Khan Younis in the Gaza Strip.\n** The firing of rubber-coated steel bullets by Israeli forces wounded 7 Palestinians during clashes near Bab al-Zawiya in the Hebron governorate.\n** 4 Palestinians were wounded by.22 bullets at clashes near Ramallah, leaving one in a critical condition.\n** 10 Palestinians, 8 Bir Zeit students and 2 local journalists, were wounded by rubber-coated steel bullets in clashes with Israeli forces near the settlement of Beit El.\n** Sponge bullets wounded several Palestinians in clashes with police at Sultan Suliman Street in East Jerusalem.\n** A Jew was beaten up by other Jews when they took him for an Arab. The incident occurred in Jerusalem.\n** A rocket fired from the Gaza Strip was shot down by the Iron Dome anti-missile system at 11 pm.\n** Settlers reportedly attacked the al-Salayma, Abu al-Hussein, Ras Jabir and Jabal Juhar neighbourhoods in Hebron. In the ensuing clashes, a 14-year-old settler was struck in the head by a rock, and some Palestinian youths wounded by rubber-coated steel bullets.\n** A Palestinian youth was shot in the foot during clashes near the Khursa crossroads south of Dura village. Palestinians say stones and Molotov cocktails were throw. Israeli sources state they responded to gunfire.\n** Overnight a 700 strong mob of La Familia soccer fans and Lehava supporters scoured Jerusalem, questioning staff in stores, for Arabs to attack, while chanting \"death to Arabs\", \"may your village burn,\" and \"Mohammad is dead\". A Palestinian taxi driver was attacked.\n* 11 October\n** A rocket fired from Gaza landed in open land in the Eshkol Regional Council of southern Israel. Reportedly, no one was injured. In response, an Israeli Air Force strike struck what it identified as 2 Hamas weapon manufacturing facilities in the northern Gaza Strip.\n** An Israeli airstrike on Zeitoun near the al-Maslakh mosque in southern Gaza city, in one version, or in the Mughraga area in another, either hit or caused a house to collapse, killing a pregnant mother Nour Rasmi Hassan (30) and her daughter Rahaf Yahya Hassan (2), and injuring the husband Yahya and their 5-year-old boy. Another 5 civilians were injured. The house lay 300&nbsp;meters from the Badr training site of the Izz ad-Din al-Qassam Brigades. Investigations by several Human Rights NGOs later reported that the missiles had struck the home directly, and not some missile production facility, as reported by the official Israeli statement.\n** A 35-year-old Palestinian woman from Jericho, but resident in East Jerusalem. according to an official Israeli account activated what was first reported to be a pipe bomb when her car was pulled over for a security check on Route 437 between the settlement of Ma'ale Adumim and the a-Zaim checkpoint. The incident occurred as the policeman went to get a fire extinguisher. She was critically injured with severe burns all over her body. The officer was lightly injured, receiving burns to the face. Later Israeli reports were corrected to specify that the cause of the explosion was a gas canister. Shin Bet said she carried letters praising Palestinian \"martyrs.\" According to a Palestinian eyewitness, the woman, accompanied by her child, had an electrical problem that sparked a fire in the car. Panicking, she pulled over while screaming, and the airbag, activated, powdering the car. In this version, the police officer impeded the woman from fleeing her car. There is apparently no sign of damage from an explosion on the vehicle's windows.\n** An Israeli officer was lightly injured in a stone-throwing incident in Abu Dis near East Jerusalem.\n** A 25-year-old Israeli was lightly injured by a stone-throwing incident in the A-Zaim security checkpoint.\n** A bus driver was lightly wounded in a rock-throwing incident in Tel Mond.\n** Over 20 Palestinians, 13 hit by live ammunition, were injured by Israeli fire in clashes near the Palestine Technical University in Tulkarem.\n** Rami Swidan, a cameraman for the Ma'an News Agency was shot in the leg by live fire while filming clashes at the Huwara checkpoint. 6 other Palestinians were also hit by live fire at the site.\n** The total Palestinian casualties from live fire and rubber-coated bullets in clashes at the Huwara checkpoint and Abu Dis was estimated from 53 to 70 by mid afternoon Palestinian reports say Israel soldiers fired directly into the crowd and critically wounded 3 protesters.\n** Ahmad Sharaka (13) was critically wounded by a shot in the neck with a live round by Israeli forces near al-Bireh.\n** An Israeli Arab Ala Mhamed Zwid, (20) from Umm al-Fahm rammed his car into 2 soldiers at a bus stop, got out and stabbed of them, critically wounding her (19), and also stabbing a 15-year-old girl who was moderately wounded, and a 45-year-old man. The incident took place at the Alon Junction on Route 65 at a large shopping center near Gan Shmuel outside Hadera in northern Israel. The assailant was arrested.\n* 12 October\n** A Palestinian Mustafa Adel al-Khatib (18) from the East Jerusalem neighborhood of Jabel Mukaber was shot dead near Lion's Gate after reportedly being asked by Israeli police to take his hands out of his pocket. He complied by pulling out a knife. Israel media report he stabbed a soldier's vest. Palestinian sources say witnesses deny he had stabbed anyone when he was shot.\n** A Palestinian girl Marah Bakeer (16/17) from Beit Hanina allegedly stabbed 1 or 2 Israelis outside a police station in Sheikh Jarrah or alternatively, at Ammunition Hill the girl is said to have aroused suspicions on Bar Lev Street, was asked to stop, turned round and stabbed the policeman who shot her. She is in moderate condition. According to Palestinian accounts, the girl was returning from school with a friend, when they were cursed by a settler at a traffic light, who then chased both to the Sheikh Jarrah bus stop, where he repeated that the girl was a terrorist armed with a knife, who had tried to stab him. Police present then shot her 4 times as she protested her innocence. Euro-Mediterranean Human Rights Monitor cites it as one of 8 cases of arbitrary shooting by Israeli forces in 2015.\n** At around 3.30 pm, 2 Israelis were stabbed in the Israeli settlement of Pisgat Ze'ev in East Jerusalem by 2 Palestinians: a man (28) was seriously wounded near Hanayadot Street and a boy (13) on his bike was critically wounded. The 2 assailants, cousins, were Hassan Khaled Mahayna (Manasra) (15) Ahmed Saleh Mahayan (Manasra) (13) from Beit Hanina, and tried to escape towards Moshe Dayan Street when Ahmed was knocked down by a car in pursuit, and Hassan, while holding a knife was shot by a policeman, after reportedly refusing to stop, as he advanced towards police. Ahmed was abused by passersby as he lay bleeding profusely from a head wound. A Palestinian source stated that a video shows David Red Star ambulance crew in the scene refraining from applying first aid, as an Israeli shouted \"Die, Die.\" Mahmoud Abbas stated that Israel is responsible for the \"execution of our children in cold blood as they did with the child Ahmed Manasra.\" Manasra was found alive in an Israeli hospital the next day, and suffering from a light wound to the head. Israeli Physicians for Human Rights criticized this public use of an image of a minor in hospital and the practice of being handcuffed to one's bed. The Israeli police released footage of the attack after Palestinians claimed two young terrorists were innocent. The manner of his treatment after being run over has been described as one of 8 documented cases of the arbitrary use of violence by Israeli forces in 2015. Ahmed Manasra's lawyer, Leah Tsemel, says her client had not wounded anyone and had set out with his older cousin after agreeing they would not harm older Jews, women or children, and had yelled \"haram\"(prohibited) when the other attacked Naor, the Jewish boy.\n** 2 Gazan Palestinians were shot with live ammunition when Israeli forces repulsed an attempt to breach the Border fence near al-Bureij refugee camp\n** A Palestinian was shot dead after reportedly trying to snatch a soldier's gun off him on a bus travelling under the Chords Bridge in northwest Jerusalem. When he failed to seize the rifle, he tried to stab the soldier. The soldier suffered a light wound. According to Ynet, the Palestinian entered the bus and sat beside the soldier. He tried to choke the soldier, then stabbed him and tried to wrest his gun. A policeman and two civilians intervened, one with nunchucks to make him lose his grip on a weapon. Another police team entered, and the Palestinian grabbed an officer's gun that had fallen on the floor and tried to cock it. At this point, another officer shot him dead.\n** 25 Palestinians were shot by live ammunition in the West Bank during the day, two by settlers. 18 were shot in the Nablus area, and 4 in Ramallah, during clashes. The 2 settler shootings relate to incidents in the Tulkarem and Hebron districts.\n* 13–18 October\nIn the week from 13 to 19 of October 16 Palestinians and 3 Israelis were killed, 1,970 Palestinians and 19 Israelis were injured, bringing the number of fatalities since October 1 to 43 Palestinians, and 7 Israelis, and the number of injured roughly 5,100 Palestinians and 70 Israelis. In 12 stabbing or alleged stabbings, 3 Israelis were killed and 16 wounded, while 10 Palestinian suspects were killed, and 3 wounded.1,917 Palestinians, (among them 223 children) suffered injuries in clashes. Two attempts were made by Palestinians to burn Joseph's Tomb. 7demolition orders were issued against Palestinian homes associated with youths who had engaged in terrorism, and 3 Palestinian families were evicted from their homes by settlers under police guard over disputed land claims. 8 settler attacks resulted in injuries to 9 Palestinians. Israeli forces penetrated the Gaza Strip on 6 occasions to level ground\n* 13 October\n** A Palestinian (22) from East Jerusalem stabbed an Israeli man in Raanana. The perpetrator was arrested after a severe beating.\n** 2015 Jerusalem bus attack: 3 civilians murdered,  16 others were wounded when 2 Palestinians attacked commuters inside a bus at Jerusalem's Armon HaNatziv neighborhood. One of the two immediate victims was Haim Haviv (78) from Jerusalem. His wife Shoshana was seriously wounded. One of those critically wounded, Richard Lakin (76), later died of his injuries on October 27. Lakin had been a volunteer for the Yad b'yad Israeli-Palestinian educational initiative. According to the indictment, when the accused, Bilal Abu Ghanem and Bahaa Elayyan, thought there were enough passengers on board, Elayyan signaled to Ghanem to open fire. He started shooting while Elayyan began to stab passengers. When Ghanem ran out of bullets, he tried to strangle another passenger. Ghanem (21) from Jabel Mukaber, had been a supporter of Hamas for several years when Elayyan reportedly contacted him on October 12, telling him that he had obtained NIS 20,000 to carry out an attack against Jews. Bahaa Elayyan's family received a demolition order for their home, located on the second floor of a three-story apartment, on November 12. On appeal, Israeli courts overturned the decision. On 15 December, a demolition order was issued affecting not only his house but the entire building, which houses 25 people, on the grounds that all apartments were built without an Israeli permit.\n** A second incident took place in Ra'anana, when an East Jerusalem Palestinian wounded 4 people at bus stop outside the Beit Loewenstein Rehabilitation Center on Jerusalem Street. He was subdued and arrested while fleeing, after a car ran into him.\n** Alaa Abu Jamal, an Israeli Arab resident of Jabel Mukaber in East Jerusalem, drove into a bus stop on Malkhei Yisrael Street in Geula, West Jerusalem, killing Rabbi Yeshayahu Krishevsky (60) and injuring one other pedestrian. Both were hacked by the terrorist, wielding a machete, after they had been hit by his car. He in turn was shot and critically wounded. The killer was reportedly related to the 2 terrorists who carried out the Har Nof synagogue massacre in 2014.\n** One Jewish Israeli stabbed another, Uri Rezken, 4 times in the back while the latter was stacking shelves in a supermarket in Kiryat Ata, near Haifa. The assailant screamed \"You deserve it, you deserve it. You are bastard Arabs, ' and persisted despite Rezken's protestations that he was a Jew.\n** Mutaz Ibrahim Zawahreh (27) of Duheisha refugee camp was shot in the chest by live fire and killed in northern Bethlehem during clashes with an estimated 500 rock throwers. An Israeli spokesman said the hit had thwarted the throwing of a Molotov cocktail at soldiers. Palestinian sources say he had indeed thrown a Molotov cocktail 'on the helmeted head' of an Israeli soldier hours earlier. They add that he was then targeted some hours later, while far from Israeli troops, during a lull in clashes, for this reason.\n** According to the Palestinian Ministry of Health, 33 Palestinians were injured, 9 by live fire, in clashes at Ramallah, Bethlehem, Nablus and Hebron.\n** Some 50 Palestinians were injured during demonstrations in both Beit Hanoun and al-Bureij Refugee Camp. Five were injured, on critically, in Beit Hanoun from fire directed from military watchtowers on the border.\n* 14 October\n** Basil Bassam Ragheb Sidr (20) of Hebron was shot dead after reportedly either attacking Israeli forces or being identified by them as acting suspiciously and then drawing a knife at the Damascus Gate. According to video evidence, he appears to have been shot, some 14 times, while running away from police, with a knife and mobile phone in hand.\n** Israeli Border police shot and injured at least 3 Palestinians in the Gaza Strip, east of the al-Bureij refugee camp.\n** Settlers from Yitzhar reportedly injured 4 Palestinians and one foreigner by throwing rocks. The incident occurred while the villagers of Burin were gathering the olive harvest in the Jabal Suliman area. Dozens of acres of olive groves were reported to have been set fire to in the Burin Huwara area.\n** A Palestinian terrorist, Ahmad Shaaban (23) from the Ras al-Amud neighborhood stabbed and moderately-to-seriously wounded a 60-70&nbsp;year-old Israeli woman while she was attempting to board a bus on Yaffo Street in Jerusalem. The attacker was neutralized by a police officer who was near the scene and shot him after seeing him with a knife. Shaaban had been released several months ago after serving a 3-year sentence for a case involving a confrontation with Israeli settlers.\n** Palestinians threw a molotov cocktail near the Sha'ar Binyamin settlement. There were no injuries.\n* 15 October\n** Riyad Ibrahim Dar Youssef (46)of Al-Janiya died of a heart attack after being hospitalized the day before, for injuries his family claim he sustained the day before. According to his family, he had been assaulted by Israeli soldiers on returning home after a day's work picking olives. An Israel spokesman confirmed vehicles had been stopped in the area but denied any assault had taken place.\n** 9 Palestinians were injured by rubber-coated steel bullets near Bireh while demonstrating outside the settlement of Beit El. One of the nine was hospitalized after being shot in the head.\n** Palestinian youths, using Molotov cocktails, set fire to parts of Joseph's Tomb in Nablus. PA firemen extinguished the blaze.\n* 16 October\n** Makarim Wibisono, United Nations Special Rapporteur on the Palestinian territories expressed concern at the excessive use of force by Israel.\n** A Palestinian man Eyad Khalil Awawdeh (26) disguised as a TV cameraman stabbed a soldier near the settlement of Kiryat Arba in Hebron. The soldier suffered moderate wounds. The assailant was shot dead. An eyewitness alleged the settlers handed out sweets after the incident. Palestinians report soldiers hindered access by Red Crescent medicos to the man, after he had been shot.\n** 2 Palestinians were shot dead in the Gaza Strip by Israeli forces when they were trying to break through the Gaza fence to enter in Israeli territory. Yahiya Abd al-Qader Farhat (24) of Shuja'iyya was shot with a bullet to the head. Mahmoud Hatim Hmeid (22), was also killed east of Shuja'iyya. A further 11 were wounded by live fire.\n** Jihad Hanani (19) was shot dead in clashes with Israeli troops at Beit Furik.\n** Shawiq Jamal Jabr (37) died from wounds he received while protesting in the Gaza Strip a week earlier.\n** Police arrested six Israeli Arabs for throwing rocks on Highway 6.\n** A bus was destroyed by a Molotov cocktail in northern West Bank. The driver, who sustained light injuries, managed to escape the burning vehicle.\n** Shots were fired at IDF forces amid Palestinian riots on Gaza border, without causing injuries.\n* 17 October\n** Fadil Qawasmi (18) was shot dead on Shuhada Street in Hebron near Beit Haddassah. by an Israeli settler, reportedly for trying to stab someone. Apart from the suspect, no one was injured. An eyewitness to the incident, Mufeed Sharbati, was arrested some time later, and his a laptop, a video camera, and a photo camera were confiscated after video footage taken in the immediate aftermath of the shooting was released on the Internet. Ahmad Amr, the media coordinator of Hebron's Youth Against Settlements, was also arrested for the same reason, had all of the video material in his possession erased and, reportedly warned by Israeli security officers to stop filming matters.\n** Ahmad Hajis Uweisat (16) of Jabel Mukaber was shot dead in East Jerusalem's Armon Hanatziv settlement after allegedly trying to stab a soldier. According to Ynet, a bicyclist, observing what he thought was the boy's suspicious manner of carrying a bag, -he held the bag 'away from his body'-  alerted police who tracked him down, and began to check his documents. He is alleged to have pulled out a large knife and injured a policeman in the hand, upon which he was shot dead.\n** Bayan Ayman Abd al-Hadi al-Esseili (17) was shot dead near Hebron's Wadi al-Ghrus area, contiguous to the settlement of Kiryat Arba, after reportedly trying to stab an Israeli soldier. The Border policeman suffered a slight injury to her hand. The incidents come as B'Tselem raised suspicions that Israel was condoning \"extrajudicial killings\" by both civilians and soldiers to kill Palestinians who no longer pose a threat.\n** A Palestinian Tareq Netsha (16) died of his wounds after being shot, for allegedly wounding an Israeli soldier in the shoulder with a knife on Shuhada Street in Hebron.\n** A Palestinian was shot dead at Qalandiya checkpoint for stabbing a border policeman. Reportedly he stabbed once, and was shot, and was shot a second time after drawing a second knife.\n* 18 October\n** According to Palestinian reports, some hundreds of settlers from Kiryat Arba attacked with stones and firebombs the Hebron neighbourhoods of Wad al-Haseen and Wad al-Nasara contiguous to the settlement.3 people were injured, one man and two minors, one of whom, Muhammad (17) was reportedly struck in the chest by a Molotov. The attack was reportedly made by cutting the blockade fence that separates the two communities, and, according to local Palestinians, was conducted in the presence and with the assistance of Israeli military units.\n** Five Israelis were beaten up by Palestinians when, in contravention of an Israeli military order, 30 of them in 7 vehicles went to Joseph's tomb at 2 a.m. in order to paint the compound after it was burned three days before. Contacted by PA security forces, the Israeli military intervened and arrested them.\n** A Palestinian youth sustained moderate injuries when wounded by a teargas grenade that struck his head in clashes with Israeli forces at Dar Salah village, east of Bethlehem\n** At Beer Sheva's Central Bus Terminal an Israeli soldier, Omri Levi (19), was shot dead and 11 Israelis were wounded when an Israeli Bedouin gunman, Muhannad al-Aqabi (21) from the Negev town of Hura, opened fire. Two victims were critically wounded, and 3 seriously wounded. Soldiers who were already at the station on their way home or to their bases opened fire at the terrorist, who escaped from the bus terminal and was then shot dead after a gun fight with security forces who arrived at the scene. An Eritrean, Haftom Zerhom from the Ein HaBesor kibbutz, in Be'er Sheva to renew his work permit, was wrongly suspected of being involved, was shot, and then shot and wounded several times again while crawling away. He was surrounded by a crowd, spat on, cursed, kicked in the head and beaten, while medical assistance was denied him by a crowd chanting \"Death to Arabs\".\n* 19–18 October\nIn the week 20-26 of October, 15 Palestinians were killed and 1,261 Palestinian were injured. 20 Israelis were injured in the same period. 4 Palestinians were killed as Israelis dispersed protests, and one man from Gaza was shot dead after reportedly observing the border with Israeli through binoculars, some 300&nbsp;yards away. 7 Israeli settler attacks on Palestinians or their property took place, injuring 4. 3 attacks targeted the olive harvesters, with a 20-year-old man shot multiple times in Sa'ir near the settlement of Asfar; settlers assaulted a 14-year-old in Ya'bad and a 74-year-old man in Deir al-Hatab. Apart from stabbings and car rammings, 4 Israeli settlers were injured in 2 Palestinians stone/Molotov throwing attacks on vehicles.\n* 19 October\n** Jamal Muhannad Hajahja (18)was shot with live fire in the leg in clashes at Tuqu near Bethlehem. Israeli spokesmen say stones were being thrown at passing traffic.\n** 9 members of Abdullah Abu Nab's family were left homeless when settlers, assisted by the army, evicted them from their homes, where they were tenants, in the Batn al-Hawa area of the Palestinian neighbourhood of Silwan in East Jerusalem. The eviction is based on a claim that the properties belonged to Yemenite Jews before 1948.\n** A Palestinian woman (65)  of Isawiya died on the way to hospital, when the ambulance was delayed an hour at a new checkpoint, after her home was suffused with tear gas.\n* 20 October\n** An Israeli soldier was lightly wounded, suffered scratches when a Palestinian, Udaay Hashim al-Masalma (24) reportedly tried to stab him during clashes at Beit Awwa, west of Hebron. Israeli sources say the incident occurred near the settlement of Negohot, and the assailant threw himself at troops. The suspect in turn was shot dead with a bullet to the head.\n** A settler from Kiryat Arba, Avraham Asher Hasano (50), was killed when he was run over by a truck near Fawwar after he exited his car, which had been struck by rocks, and perhaps with a gun on him. The truck-driver, from ad-Dhahiriya, turned himself in to Palestinian police, saying it was an accident. The driver was charged with manslaughter in April 2016.\n** A Palestinian, Hamzeh Moussa al-Imla (25) from Beit Ula, is reported to have rammed his car into Israelis at a bus stop at the Gush Etzion junction. 2 Israelis were injured, one lightly, the other moderately. He is said also either to have tried to stab people after getting out of his car, or to have been found with a knife on him.\n** 9 Gazan Palestinians were wounded by live fire, and one Ahmad al-Sarhi (27), was shot dead. 6 were wounded east of the al-Bureij refugee camp, and a further 3 were wounded near the Eretz Crossing.\n** 9 West Bank Palestinians were wounded by live fire, 3 in Bireh and 2 in Ni'lin.\n** Bashar Nidal al-Jabari (15) and Hussam Jamil al-Jabari (17) were shot dead at a checkpoint near the Rajabi house close to Kiryat Arba. It is alleged one of the two tried to stab a soldier. A soldier lightly wounded.\n* 21 October\n** Istabraq Ahmad Noor (15) from the village of Madama was shot near the settlement of Yitzhar. She was reportedly carrying a knife 10&nbsp;metres from the settlement fence, was chased and shot in the hand.\n** Hashem al-Azzeh (54) a physician of Tel Rumeida, died of excessive tear gas inhalation. An ambulance was unable to pass Israeli checkpoints to reach him when he suffered chest pains at home. He walked to the Bab al-Zawiya checkpoint, was stopped by soldiers and inhaled tear gas from the clashes there. The man had a history of cardiac problems.\n** Luay Faisal Ubeid (36) of Isawiya had his eye gouged out by a rubber-coated steel bullet when he was shot, according to his testimony, after hearing explosions, and peering out from his balcony.\n** A Palestinian Mutaz Atallah Qassem (22) critically wounded an Israeli female combat soldier by stabbing her in the neck, near Binyamin. A second soldier then shot the man dead, reportedly as he rushed towards her brandishing a knife.\n** A 20-year-old Gazan Palestinian was shot with live fire in the foot in clashes east of al-Buriej refugee camp. Israeli reports state the incident occurred when a group tried to breach the border barrier.\n** 4 Israeli soldiers were hit by a Palestinian driving his car near the Israeli settlement bloc of Gush Etzion and Beit Ummar. One suffered moderate to serious injuries, the others were lightly wounded. The Palestinian was shot.\n** A rocket fired from Gaza struck land in the Shaar Negev regional council zone.\n** A Jew, a 28-year-old yeshiva student, mistaken for a terrorist, was shot dead in Jerusalem. According to the police, after asking two soldiers for their IDs, and being requested in turn to give his, he punched them and tried to seize a gun. He was shot by a guard, and the soldiers then 'conducted secondary fire'. Only on examination of his identity card did it emerge that he was a Jew. He apparently identified himself as a member of ISIS.\n** Israeli forces uprooted olive and pine trees, many in the cemetery in the Aida refugee camp near the Bilal Bin Rabah Mosque, close to Rachel's Tomb. Graves were also reported destroyed.\n* 22 October\n** Mekdad Mohammed Ibrahim Alehih (21) and Mahmoud Khaled Mahmoud Ghneimat (20) of Surif stabbed an 18-year-old yeshiva student at a bus stop in Beit Shemesh. They were blocked from boarding a children's bus, and by a police officer. One died, the other is in critical condition. The yeshiva student sustained moderate injuries with stab wounds to the chest. One source says the two attempted to enter a synagogue, and were shot on stabbing a man in the street; another stated they were shot after a woman notified police the two were stalking her and a friend; eyewitnesses reportedly state that the terrorist were shot 20&nbsp;minutes after the stabbing, and not immediately.\n** A Palestinian reportedly tried to stab an IDF soldier near the Hassam Shoter checkpoint in Tel Rumeida. He escaped.\n** Israeli forces shot 3 Palestinians with live ammunition east of Bureij Refugee Camp in the Gaza Strip, in the context of border clashes. One Palestinian was wounded by live fire in the West Bank and a further 10 by rubber-coated bullets.\n* 23 October 2015.\n** Musab Muhammad Ghneimat (16) from Surif was shot after stabbing an Israeli soldier supervising Palestinian access to their lands near the Gush Etzion settlement block.\n** 4 members of a settler family were injured by a Molotiv cocktail thrown at their car as they drove down Route 60, near the settlement of Beit El. The parents, a brother and sister suffered light burns to their extremities. The youngest, a 4-year-old girl, suffered burns to her upper body, and was moderately injured. 3 suspects Khaled Badha (43) from the Kedura refugee camp in Ramallah,  Abdel Majid Badra (27) from Beituniah, in the central West Bank; and Louie Nimr (34) of the el-Amari refugee camp, were arrested in early November 2016 on suspicion of involvement in the incident.\n** Rabbi Arik Ascherman of Rabbis for Human Rights was kicked, beaten and threatened by a knife-wielding settler when he intervened to stop him from stealing olives and to put out a fire that had been lit on Palestinian land near the illegal Israeli outpost of Gideonim. A police spokesman said the incident was a provocation by \"left-wing activists and anarchists.\"\n** On a day proclaimed as a \"Day of Rage\", Israeli actions during clashes resulted in injuries to some 290 Palestinians, according to the Red Crescent Society. 43, 12 of whom in Hebron, were wounded by live fire, and 44 with rubber-coated steel bullets.\n** Yahya Karira (20) a Gazan from Tuffah, who had been shot in the head by Israeli forces in clashes a week before in Nahal Oz in the eastern Gaza Strip, died in hospital. I Gazan was shot in the foot with live fire, and a further 2 with rubber-coated steel bullets, east of Shuja'iyya, while in the north 2 Gazans were shot by live bullets in the feet, and 1 took a rubber-coated steel bullet wound to the head. Live fire wounded 4 in Khan Younis and 1 near Beit Hanoun.\n** Alaa Khalil Sabah Hashah (16) was shot dead when he allegedly drew a knife at the Humwara checkpoint. He was shot 10 times, and a young Palestinian girl seated in a car nearby, was critically wounded in the head from the Israeli crossfire. She expired on December 16.\n* 24 October\n** A Palestinian youth, either Mohammed Zakarneh of Qabatiya or Ahmad Muhammad Said Kamil (16/18), was shot dead after an alleged stabbing attempt at the Gilboa/al-Jalama military checkpoint north of Jenin. Eyewitnesses claim no such attempt was made. Israeli sources say the youth pretended to sell chocolates and then rushed the checkpoint with a knife.\n** Khalil Hassan Abu Obeid (25) of Gaza became the 17th Gazan to be shot dead since October when he died of wounds sustained during clashes with Israeli troops near Khan Younis some days earlier.\n* 25 October\n** An Israeli settler, Israel Ben-Aharon (58), was stabbed and hospitalized with a light to moderate wound to the chest from a stabbing at the Metzad Junction in the Wadi Sair area near the Gush Etzion settlement. According to Haaretz, he stopped his car after two Palestinian men threw rocks at his vehicle and then opened fire on attackers, \"but it is unclear whether he hit any of the men\". According to Palestinian security sources, Azzam Azmi Shalalda (20) of Sa'ir was shot on his property 4 times and left in critical condition as he drove to Metzad for help. The attacker's knife was found at the scene. Reports of the incident are confused. One report says a Palestinian attacked a settler with a knife and that the assailant fled the scene before the shooting occurred. Another report says the settler was stabbed after leaving his car to confront Palestinian stone-throwers, who had injured him in pelting the vehicle, and that the settler managed to wound him before the latter fled the scene. The assailant was reportedly dressed as an ultra-Orthodox Jew. Palestinian witnesses said Azzam was not the assailant but had been working his fields. The IDF estimates that he was involved in stone-throwing. On November 12, Azzam was arrested in a night raid on a Hebron hospital, during which soldiers shot his cousin dead.\n** A Palestinian stabbed an Israeli near the Israeli settlement of Ariel.\n** According to Israeli reports, a Palestinian girl Dania Irsheid (17) drew a knife when asked to identify herself and tried to stab an officer at the Tzalbanit checkpoint in Hebron, near the Cave of the Patriarchs. She was shot dead after Israeli soldier shot into the air asking her to take the knife from her bag, and moments later she \"was on the ground, bleeding\". According to one unnamed Palestinian eyewitness standing 4&nbsp;metres behind the schoolgirl in the line, soldiers checked her school satchel, and found nothing; she passed a metal detector, was asked where her knife was, she protested she had none, then they fired between her legs, and terrified, she stepped back, raising her arms, and protesting she had no knife. At that point she was shot dead with 8-19 bullets. The New York Times, citing the Associated Press, reported that the girl had tried to stab the police officer. Issa Amro, director of a local NGO, Youth Against Settlements, has asked the IDF to release its videos of the incident, since the whole zone is covered by several CCTV surveillance cameras. Amnesty International, citing it under instances of the use of intentional lethal force used without justification, noted she had passed one metal detector, two revolving gates at a first checkpoint, and then at a second checkpoint was inspected by 5 border policemen, who searched her bag and yelling at here to show her knife. She was shot several times while her hands were raised. Even had she possessed a knife, one was shown near the body, AI argued, eyewitness. accounts suggest she posed no threat, and the killing was 'absolutely unjustified'. Israel rejected the Amnesty report as \"fundamentally flawed in its methodologies, in its facts, in its legal analysis and in its conclusions.\"\n* 26 October\n** Elon Moreh settlers stoned farmers in the Azmut and Deir al-Hatab areas east of Nablus, forcing them to abandon their agricultural labour. Hajj Tawfiq (66) was attacked and moderately injured in the same assault.\n** Raed Saket Abdul-Rahim Jaradat (22) from Sa'ir stabbed a 19-year-old Israeli soldier at the Beit Einun junction north of Hebron, or near Kiryat Arba and was, in turn, shot dead. The soldier was wounded and in a serious condition.t\n** Just prior to 3pm on Monday, a Palestinian Saad Muhammad Youssef al-Atrash (19) was reported as having tried to stab another Israeli soldier in Hebron. He was \"neutralized\", and no one else was harmed. According to Amnesty International, Atrash's death was an 'egregious' example of killing with lethal intent. al-Atrash, they report, was shot as he attempted to take his ID card from his pocket, as requested. An eyewitness watching the events unfold from her balcony said he had posed no threat when he was shot several times, and left to bleed profusely for 40&nbsp;minutes. The Palestinian eyewitness also stated a knife was then placed in the dying man's hand. Israel rejected the Amnesty report as \"fundamentally flawed\".\n** Iyad Rawhi Jaradat was shot dead, with a bullet to the brain, in Beit Einun as he participated in a march to the home of Raed Jaradat, during which clashes broke out with Israeli forces.An Israeli spokesman said the main instigator was shot with a rubber-coated steel bullet and fell and hit his head.\n* 27 October\n** According to the Red Crescent Society 143 Palestinians were injured in clashes with Israeli troops in the West Bank. 22, according to the Palestinian Ministry of Health 27, were wounded by live fire, and a further 50 by rubber-coated steel bullets. 20 were said by the PMH to have been wounded in clashes in Hebron, and another 7 at Bireh. The clashes in Hebron arouse during a march protesting against Israel's refusal to hand over the bodies of 11 Hebronites killed over recent weeks. A Palestinian child was reportedly shot in the head and critically wounded by a sponge bullet in Tulkarem.\n** An Israeli soldier (19) was wounded in a stabbing incident at a stop for hitchhikers in the Gush Etzion settlement bloc. Two Palestinians, Shadi Nabil Abd al-Muti Dweik (22), and Shabaan Abu Shkeidem (17), apparently responsible for the knifing, were shot dead by Corporal T.\n** Hammam Said (23) was shot dead by Israeli forces near Tel Rumeida area of Hebron. It is alleged that he attempted to stab soldiers.\n** Islam Rafiq Hammad Ibeido (23) was shot dead in the Tel Rumeida area Hebron after Israeli soldiers alleged he attacked them with a knife. Palestinian witnesses claim a knife was planted near him afterwards, that he was shot 11 times, and that soldiers blocked ambulances from reaching him.\n** A Palestinian allegedly lightly wounded an Israeli woman with a knife at the Rami Levi supermarket in the settlement of Gush Etzion.\n** A Palestinian was moderately wounded by a bullet to the leg during protests near Bureij Refugee Camp and the Border with Israel, in the Gaza Strip.\n* 29 October\n** Palestinian sources state that delays to ambulances caused at Israeli checkpoints and road blocks contributed to the death of Nadim Shqeirat (52), who had suffered a heart attack in the Jabal Mukaber neighborhood of East Jerusalem.\n** Mahdi Mohammad Ramadan al-Muhtasib (22) of Hebron was shot dead after reportedly stabbing at a soldier, and then attacking another. The soldier suffered a cut to his face.\n** Another Palestinian, Farouk Abdel Qader Omar Sidr (19), according to Israeli sources attempted to stab a person on Shuhada Street near the settlement Beit Hadassah in Hebron, and was shot dead by soldiers of the Givati Brigade. One local said he was shot while descending a staircase. residents complain that Israeli soldiers have been threatening Palestinian residents of the street with death unless they evacuate.\n* 30 October\n** Ramadan Mohammad Faisal Thawabta (8&nbsp;months) died, according to Palestinian doctors, from the effects of tear gas inhalation in the village of Beit Fajjar village during clashes between the Israeli army and Palestinians, Israeli spokesmen rebuffed the claim.\n** Two Palestinians are reported to have tried to stab an Israeli border policeman at the Tappuah, / Zatara, checkpoint. They were both shot. Qassem Mahmoud Sabaneh (20)from Jenin. Died immediately, the other was arrested in a critical condition.\n** Ahmad Hamada Qneibi (23) of Kafr Aqab stabbed an Israeli, leaving him moderately wounded, near the Ammunition Hill light rail station in Sheikh Jarrah, East Jerusalem and was shot dead. One Israeli nearby was wounded by friendly fire.\n** 16 Palestinians were wounded by live fire, and a further 39 injured. 8 were shot with live fire at al-Balou' neighborhood in northern al-Bireh near Ramallah, and another 8 in Hebron.\n** A military jeep ran down a fleeing Palestinian stone/mototov cocktail thrower in Bireh. Israeli spokesman protested that video reportage was truncated, and that the youth hit by the jeep had a petrol bomb in his hand\n** 17 Gazan Palestinians were wounded by Israeli live fire on protesters near the border fence.\n* 31 October\n** Mahmoud Talal Mahmoud Nazzal (18) of Qabatiya was shot dead after reportedly attempting to stab an Israeli guard at al-Jalama military checkpoint.\n** Farmers in Burin were blocked from harvesting their olives by settlers, who reportedly also stole olives and agricultural equipment in the Bab Sanna area of Burin,\n** 2 Gazan Palestinians were wounded by live fire east of the Bureij Refugee Camp while demonstrating near the Border fence.\nNovember\n* 1 November\n** A Palestinian was shot dead after an alleged stabbing attempt in what Israeli sources called a \"violent riot\" in Beit Einun.\n** Three Israeli Border officers were injured when a Palestinian car struck them near Beit Einun. Two of the officers were lightly wounded, one was in moderate condition. The driver fled and later turned himself in. Israeli sources say the ramming was deliberate.\n* 2 November\n** Ahmed Awad Abu al-Rub (16) of Qabatiya was shot dead 150&nbsp;yards north of the Jalama checkpoint after being approached by soldiers who considered he and another Palestinian were behaving suspiciously. Israeli sources said he pulled out a knife, and was shot after ignoring warnings to lay down the weapon.\n** A Palestinian was assaulted and arrested for refusing a body search involving stripping, in East Jerusalem.\n** Imad al-Tarde (19) from Kfar Tapuach near Hebron stabbed at least three Israelis near a bus station in Rishon Lezion. An 80-year-old woman was in serious condition\n** Ziyad Ridha (22) from Balaa village east of Tulkarem stabbed and severely wounded a 70-year-old Israeli at Netanya\n** 8 Palestinians were wounded by live fire in Qutna village, when clashes broke out with Israeli forces in the wake of a funeral for 2 Palestinians shot dead earlier this month.\n** 21 Palestinian students were wounded by rubber-coated steel bullets during a commemorative protest for Dia Talahmeh at Abu Dis' Al-Quds Open University campus.\n* 3 November\n** The secretary-general of the Palestinian Democratic Union in Tulkarem, Mirvat Abu Shanab, was hit with a rubber-coated steel bullet in her leg.\n** Beituniya city, Israeli forces shot and injured two Palestinians with live bullets and four more with rubber-coated steel bullets\n** Israeli forces shot and injured a young Palestinian protester with live fire during clashes just east of al-Breij refugee camp along Israel's border fence.\n** Ayman Ahmad Hmeidat was shot in the shoulder by live fire in clashes involving stone-throwing with Israeli forces at Beit Ummar.\n* 4 November\n** A 22-year-old Palestinian from Tulkarem rammed his car into a Border policeman, Benjamin Yaakovovich (19), leaving him in critical condition, and a further Israeli injured near The attack took place on route 60 near Halhul. The driver was shot dead. Yaakovovich died of his injuries on the 8th of November.\n** According to Palestinians, the village of Qusra was subject to an assault by settlers, after the attack was repelled, the IDF intervened and at least 14 Palestinians were shot and injured with rubber-coated steel bullets.\n* 5 November\n** Malik Talal al-Shareef (25) was shot dead by a \"Corporal T\", after allegedly attempting to stab people at crowded bus station in the Gush Etzion settlement bloc. Corporal T, with 2&nbsp;months service, also shot two others suspected assailants earlier on October 17, and has been hailed as The Terminator.\n* 6 November\n** 4 Palestinians were shot by 0.22 bullets in the legs, and one suffered a head wound from a rubber-coated steel bullet, during clashes in Hebron after prayers and involving stone-throwing, after Israeli forces had surrounded the Wasaya al-Rasoul mosque\n** Tharwat al-Sharawi (72) was shot dead after allegedly attempting to drive her car into Israeli soldiers near Halhul. Her husband Fouad Al-Sharawi, was killed during the Ist Intifada. Two youths standing nearby at a gas station were injured moderately by shrapnel from the gunfire. Her son said his mother was driving to lunch at her sister's in Ras-al-Jura and had dropped into the gas station to refuel. A GoPro video taken by a soldier present at the scene was leaked to the press, and, according to Palestinians, shows that the woman had no intention of hurting soldiers but was summarily executed. The car apparently drove fairly slowly in a lane on a road closed to traffic where soldiers were standing. 2 soldiers backed away as the car passed and then soldiers open fire. Later a knife was found in the woman's hand bag.\n** A settler (40) was seriously wounded in a stabbing attack at a Rami Levi supermarket in the Israeli settlement of the Shaar Binyamin industrial zone. The attacker fled the scene, and later declared his identity as Baraa Issa on a website.\n** Salameh Moussa Abu Jame (23) was shot dead by Israeli forces near Khan Younis in the Gaza Strip.\n** Sniper fire from a Palestinian neighbourhood in Hebron wounded 2 teenagers, aged 16 and 18, at the Cave of the Patriarchs, who were there as part of the special ten days a year in which the entire site is open only to Jewish worshipers. The site is normally divided into sections for Muslim and Jewish worshipers, and is also open only to Muslim worshipers on ten other days. In late February 2016, two Palestinian brothers, Nasser Faisal Muhammad Badwi(23) and Akram Faisal Muhammad Badwi(33) were arrested on suspicion of being behind the attacks. Their motivation was apparently linked to the death of Tharwat al-Sharawi (72) earlier that day at Halhul (see above).\n** An Israeli soldier was seriously wounded at Beit Einun junction north of Hebron. A 16-year-old from Bani Naim was arrested and reportedly confessed.\n* 7 November\n** A Palestinian was shot in the leg with a live round east of Bureij Refugee Camp when groups of Gazans marched towards the border and threw stones at Israeli forces.\n* 8 November\n** A Palestinian woman, Hilwa Salim Darwish, from Husan stabbed an Israeli security guard at the Israeli settlement of Beitar Illit. He shot her and the woman remains in a critical condition. The guard was lightly injured.\n** A Palestinian, Sulaiman Aqel Muhammad Shahin(22) of Bireh rammed his car into a group of Israelis, 3 of whom suffered injuries, one critically. The incident occurred near the Tapuah Junction south of Nablus. The assailant was shot dead, while a fourth Israeli was injured by friendly fire.\n** A 48-year-old Israeli was stabbed, as he stopped to do some shopping in Nabi Ilyas near the settlement of Alfei Menashe, and suffered severe injuries though he managed to reach Ariel junction where he was evacuated.\n** A rocket fired from the Gaza Strip landed in open ground in the Sha'ar HaNegev Regional Council area.\n* 9 November\n** In response to the rocket attack the Israeli Air Force struck a Hamas position located between Rafah and Khan Younis.\n** A Palestinian woman Rasha Muhammad Oweisi (24) approached cars at 7 a.m. at the Eliyahu military checkpoint north of the settlement of Alfei Menashe. She was asked to stop and, ignoring warning shots, and then was shot dead when she drew a knife from a bag. A note of apology to her family found in her bag adds that:\"I'm doing this with a clear head. I can't bear what I see and I can't suffer anymore.\"\n** According to Palestinian officials, a settler from the settlement of Ma'ale Levona stepped out of his car and fired with a machine-gun on Palestinian olive pickers near Al-Lubban ash-Sharqiya south of Nablus.\n** 5 students of the Palestine Technical University in Tulkarem were wounded by live fire, and a further 13 were shot by rubber-coated steel bullets in clashes with Israeli forces, when the latter raided the campus library and engineering department. 50 suffered from tear-gas intoxication.\n* 10 November\n** An Israeli security officer was moderately injured when he was stabbed by 2 Palestinian teenage cousins, Muawiya Alqam (14) and Ali Alqam (12) (otherwise referred to as Ahmad Ali (14) and AliIhab Hassab Ali(12)) from the Shuafat Refugee Camp. The incident occurred on Jerusalem's light rail in Pisgat Ze'ev. Police shot the 11&nbsp;year-old, who remains in a critical condition, and passengers made a citizens' arrest of the 14-year-old. East Jerusalemites say that their actions were inspired by watching a leaked video of a weeping Ahmed Manasra, a 13-year-old suspected of a similar knifing attack on a Jewish boy and another Israeli, subjected to aggressive Israeli police interrogation.\n** A Palestinian, Muhammad Nimr (37) from Isawiya, attempted to stab two Israelis at the Damascus Gate but was foiled when a policeman shot him 6 times. The assailant died.\n** Sadeq Ziad Gharbiyeh (16) from the town of Sanur allegedly tried to stab an Israeli guard at the Container checkpoint near Abu Dis. He was shot dead when he approached the guard reportedly with a knife. His parents thought he was at school in Jenin. The driver of a shared taxi that Sadeq was traveling in told Ma'an that the teenager had dropped his phone at the checkpoint, stepped out and gestured to indicate what had happened, and was then taken to the other side of the checkpoint, and shot. His father is a Jenin Hamas leader, briefly exiled in Lebanon in 1992.\n** A Palestinian was shot after reportedly entering the Israeli settlement of Teqoa and \"lung(ing) at people with a knife.\"\n* 11 November\n** 11 Palestinians were wounded by Israeli live fire during a search-and-arrest operation, which was met by stone-throwing in Qalandiya Refugee Camp\n* 12 November\n** In a raid on Hebron's al-Ahli hospital at 3 a.m., an Israeli undercover unit of 20-30 soldiers, some dressed as women, shot dead Abdullah Azzam Shalaldah (28) from the village of Sa'ir. The Israeli forces were engaged in an arrest detail, which aimed to detain his cousin Azzam Ezzat Shalaldah (20), whom they suspected of being implicated in a stabbing attack on an Israeli settler in Gush Etzion on October 25. According to Palestinian reports, Abdullah, who was visiting with relatives his cousin, was shot several times as he emerged from the bathroom, where he had washed himself in preparation for dawn prayers. Israeli sources say he attacked the soldiers. The family says he fought them off when they tried to arrest his cousin. The hospital manager, Jehad Shawar, said the soldiers held staff at gunpoint, and shot Abdullah as he emerged from the toilet, once in the head, once in the chest and three times in the body. Normally in conflicts hospitals are considered protected locations, also for enemy combatants, and Physicians for Human Rights–Israel stated that Israel is repeatedly violating the convention. Amnesty International defined the incident as a possible extrajudicial execution.\n* 13 November\n** Issa al-Shalaldah (22), shot on the 12 during clashes at the Beit Einun junction in Sa'ir. He was a cousin of Abdullah Shalaldah, shot dead in the same hospital where Issa died. The incident occurred following the funeral of his cousin.\n** Israeli live fire wounded 11 Palestinians at Bireh, a further 3 in Hebron, and 2 in Qalqiliya, while 14 others were wounded by rubber-coated steel bullets.\n** Palestinians fired on Israeli care carrying 7 people, and two settlers from Kiryat Arba were killed, one an 18-year-old youth and the other a 40-year-old man, near the settlement of Otniel west of Yatta. A youth suffered a slight wound to his foot and a woman was also lightly injured. Netanyahu accused the Palestinian Red Crescent Society of acting against \"human and civilized norms\" after a Palestinian ambulance, which was the first responder to arrive at the scene of the attack, didn't offer assistance to the victims. Dvir Litman, 16, who was lightly wounded by the Palestinian gunmen, complained about the ambulance's actions after the emergency call he made.\n** Hassan Jihad al-Baw (23) was shot through the heart during clashes with Israeli forces at Halhul.\n** Lafi Yusif Awad (22) was critically wounded and died shortly after when Israeli forces shot him during clashes in the village of Budrus\n* 14 November\n** Israel demolished 4 homes, 3 in Nablus and one in Silwad, of Palestinians alleged to be involved in killing Israelils\n* 15 November\n** Hammad Abdul-Hamid Sleibi and his family were forced by Israeli forces to abandon their olive picking on the family's orchards outside Beit Ummar. Soldiers reportedly intervened after the family had been told by guards from the settlement of Bat Ayin to leave.\n** A Palestinian toddler, Adel Khader Shahin (2)  from Bir Nabala, was run over by an Israeli military jeep. An Israeli spokesmen said the incident was minor and unintentional.\n** 6 Palestinians were shot in clashes with Israeli forces in the Balou area of Bireh. 2 were wounded by live fire, the other 4 by rubber-coated steel bullets.\n* 16 November\n** Laith Shu'any (Manasra) (20), and Ahmad Abu al-Aish (28) were shot dead in the Qalandiya Refugee Camp. A 3rd Palestinian Yusuf Abu Latifa (17) was critically wounded. Shu'any was shot by a sniper while on a roof with his uncle who insists he was unarmed. He died after a half-hour checkpoint delay before a Palestinian ambulance could be reached. The incidents occurred when Israeli forces raided the camp to demolish the home of Muhammad Abu Shahin, alleged to be involved in a killing of Danny Gonen at Dolev on June 19. According to Israeli sources, the men were shot when Palestinians fired on the soldiers. The explosion destroying Shahin's house damaged 9 other apartments nearby.\n** 2 Palestinian fishermen from Gaza were wounded by Israeli fire off Beit Lahiya. Israeli sources say they deviated from the areas Israel designates for Gazan fishing.\n** Three corrugated metal houses belonging to Muhammad Abed al-Fattah al-Shaladah, housing 15 Palestinians, together with a sheep barn, were demolished by Israeli forces in the Khirbet Jurat al-Kheil and al-Qanub areas east of Sa'ir. They lacked Israeli building permits.\n** 8 Palestinians were shot with live rounds in the Ramallah district, in clashes that involved exchanges of fire from both sides. The incidents occurred during the funeral of the two Palestinians killed earlier in the day.\n* 17 November\n** A Gazan was wounded by Israeli live fire directed at the Bureij Refugee Camp.\n* 18 November\n** After a Gaza rocket landed near the border, the Israeli Air Force struck 2 Hamas sites in western Gaza City. Nearby homes suffered collateral damage.\n* 19 November\n** In a raid on Duheisha Refugee Camp to arrest Muhammad Nidal Abu Akar (22)reportedly involving the ransacking of 20 homes, 2 Palestinian youths were wounded by Israeli fire when clashes broke out.\n** An unidentified Palestinian teenager was shot in the stomach and pelvis by Israeli forces during clashes at Abu Dis.\n** Two Israeli soldiers suffered from tear gas inhalation when a Palestinian hurled a tear gas canister at Abu a-Reesh military checkpoint, and a further soldier was hit by shrapnel from an IED thrown at the same checkpoint. In response the zone around the Tariq Ibn Zaid school was doused with tear gas and skunk and students were unable to access the school.\n** 2 Israelis were murdered and two more injured by a knife-wielding Palestinian man from Dura while they were coming out from a synagogue service inside the Panorama building on Ben Tsavi street in Tel Aviv.\n** 3 Civilians, one American, one Israeli, and one Palestinian were killed in a drive-by shooting at a checkpoint near the settlement of Gush Etzion. From 5 to 10 Israelis were reportedly injured, 2 seriously. Two suspects were arrested. Amnesty International condemned Palestinian attacks against Israeli civilians on both sides of the Green Line.\n* 20 November\n** Israeli forces injured or wounded roughly 156 Palestinians, 69 with live fire and 54 from rubber-coated steel bullets in clashes.33 Palestinians in Gaza were shot, 2 critically, with live fire near Shuja'iyya and Bureij Refugee Camp. Palestinians report that in clashes in the Ras al-Jura area, north of Hebron, Israeli troops used 3 Palestinian vehicles, with the passengers inside, as cover as stones were thrown their way, the passengers only being allowed to leave after some hours.\n** Muhammad Shaker al-Tarda (18), a Hebronite Palestinian working illegally in Israel, stabbed and wounded four Israelis on King David Street in the Israeli city of Kiryat Gat. The man was arrested some hours later. A Bedouin who happened to be nearby suffered a severe beating from a group of Israelis in the vicinity of the attack, and also required hospitalization.\n** Two Palestinian youths, Ayham Deriyya and Younis Munir Bani Fadil, allegedly throwing rocks at the checkpoint which blocks their village, were shot near Aqraba.\n** Hamada Abd al-Aziz Atwani (27), from Al-Jiftlik, but working in Israel, was shot and wounded after rushing back from Israel, where he was employed, through the Seam Zone.at the Israeli checkpoint of Oranit crossing. in the Qalqiliya district. He had been alerted by his family that his father had just died in a Nablus hospital, and had left Israel in haste to reach the hospital in the West Bank.\n** 150 homes were ransacked by Israeli troops in search and arrest operations in the Hebron district villages of Beit Awwa, Surif], al-Kassara, Ash-Shuyukh, Idhna, Bani Na'im, At-Tabaqa, as Beit Ummar and Arrub Refugee Camp. There were reports of property seized during the raids, including a reported 800 grams of gold from the family home off Mahmoud Yassin al-Sweti in Beit Awwa.\n* 22 November\n** A Palestinian girl, Ashraqat Taha Ahmad Qatanani from Nablus (16), was run over by a car driven by Gershon Mesika, the former head of the Samaria regional council, who then emerged from a car and shot her dead. Mesika explained that she intended carrying out an attack on the Huwara checkpoint.\n** The vehicle of Palestinian taxi driver Shadi Hassib (32) of Bireh collided with another car. It is alleged that he then exited his vehicle with a knife in hand, near the Israeli settlement of Kfar Adumim. A settler shot him dead. An Israeli suffered a scratch on his hand.\n** Issa Thawabta (34) from Beit Fajjar stabbed to death an Israeli woman, Hadar Buchris (21), near the Gush Etzion settlement bloc. Israel, in retaliation, barred the roughly 2,000 Palestinians working in the settlements from accessing their places of employment in the settlements.\n* 23 November\n** A rocket fired from Gaza landed on open ground in the Eshkol regional council.\n** An Israeli settler was hit by a car near the settlement of Shavei Shomron, near Nablus. He was lightly injured. Whether the incident was deliberate or accidental is unknown.\n** Two Palestinian girls, Hadeel Wajih Awwad (14) of Qalandiya refugee camp and her cousin Norhan Awwad (16) of the village of Kafr 'Aqab were shot, the younger one fatally, after a stabbing attack using scissors at the Mahane Yehuda Market on Jaffa Street in central Jerusalem. Initial media reports that 2 Israelis had been stabbed later turned out to refer to 70&nbsp;year-old Palestinian Yusuf Al-Harub from Bethlehem, who had been stabbed lightly in the neck, and an Israeli guard (27) shot in the hand, perhaps by a ricochet from friendly fire. A jeweler nearby, David Ashur, stopped an assault on a passing Israeli by hitting one girl with a chair, and shooting the other. In the video, according to Uri Avnery, the girl brandishing the knife  was shot by a soldier who then ran up and  killed her while she lay helpless on the ground. The dead girl's brother Mahmoud Awwad died in 2013, some months after being wounded by Israeli forces in a clash within the refugee camp, and she had decided to undertake the attack to revenge him.\n** Ahmad Jamal Taha (16) from Qutna stabbed to death an Israeli soldier, Ziv Mizrahi (20), at a gas station on Route 443 west of Ramallah, and injured one other. He was in turn killed by security forces.\n* 24 November\n** Over 30 settlers from Yitzhar reportedly set fire to olive trees and attacked Palestinians harvesting their olives at the al-Mayadeen area of village of Burin.\n** In a military incursion into the Gaza Strip, that penetrated up to 300&nbsp;metres, Israeli bulldozers created earth mounds, reportedly denying to the farmer-owners access to their agricultural plots\n** Palestinian gunmen fired on a settler's car near the settlement of Ofra. Bullet hole damage was attested. I\n** An Israeli settler (26) was injured when rocks were thrown at his car, near the Atarot settlement, on Route 433 west of Ramallah\n* 25 November\n** A Palestinian sniper fired at an Israeli settler's car near Ibrahimi mosque at the Cave of the Patriarchs in Hebron, damaging it.\n** Ibrahim Abdul-Halim Dawood (16) died. He had been shot in the heart two weeks earlier by Israeli forces in clashes near Ramallah.\n** Muhammad Ismail Shubaki ( 19) of Fawwar Refugee Camp, a student at a Palestine Technical College, was shot and critically wounded after stabbing and seriously wounding a 20-year-old Israeli soldier at the al-Fawwar junction, south of Hebron\n** Israel confiscated 8 buses from the Nablus-based al-Tamimi bus company, on the grounds that protesters had been transported by the vehicles to demonstrations.\n* 26 November\n** One Palestinian was shot in the stomach, another wounded and dozens suffered from tear gas inhalation when residents of Fawwar suffered from tear gas while opposing an Israeli military unit that entered the town to examine the house of Muhammad Ismail Shubaki.\n** A Palestinian reportedly exited a taxi and attempted to stab an Israeli soldier at the Za'atara (Tappuah) military checkpoint south of Nablus. He was shot several times, and died of his wounds.\n** Yahya Yusri Taha (21) died from an Israeli gunshot wound in the head during clashes that erupted when Israeli forces conducted a search and arrest raid on Qatanna. According to Palestinian reports, Israeli soldiers deny him emergency treatment from Palestinian ambulances for roughly an hour and a half\n** Samer Seresi (51) left his car and, brandishing a knife, attacked Border police stationed at an intersection in the northern West Bank. He was shot dead, No soldier was injured.\n** Khalid Mahmoud al-Jawabreh (27) was shot twice in the stomach by Israel forces clashing with residents of Arroub Refugee Camp, and later died of his wounds.,\n* 27 November\n** A 16-year-old Israeli Palestinian from Abu Snan repeatedly stabbed a Border Guard an Israeli Arab Christian from Fassuta at the Nahariya bus stop. The officer struck him on the head with his pistol, and the youth fled. The guard sustained moderate injuries. The incident, initially described nationalistically motivated, was later called criminal in nature, the youth suffering from mental upset at the death of a friend over a month earlier.\n** Fadi Hassib (30) from al-Bireh drove a car, hired the day before, at a bus stop near the settlement of Ma'ale Adumim striking its protective barrier and lightly injuring two soldiers. The assailant was killed.\n** At around 12:30pm, Omar ah- Zaakik (19) from Beit Ummar. rammed his car into 5 IDF troops at the entrance to the Beit Ummar refugee camp near Kiryat Arba. The senior officer sustained light wounds, while the other 4 soldiers were moderately injured.\n* 28 November\n** Three Palestinians were shot, Majid Jomaa(46), shot in the back, Mohammad Shtewei (26), in the thigh, and Ayman Rafiq( 40), in the leg during clashes when Israeli border police intervened with live fire to disperse at protest at Kafr Qaddum.\n** Two Palestinians were wounded by Israeli live rounds in clashes at the Huwwara checkpoint south of Nablus.\n* 29 November\n** Baseem Abdul-Rahman Mustafa Salah (38) of Nablus stabbed a Border policeman in the neck near Hagai Street in Jerusalem. The policeman (20) was moderately wounded. Salah was shot dead, after being hit by 11 bullets.\n** A Nepalese foreign worker in Israel, Hisorai Taplaya (31), was wounded at a bus stop on Shamgar street in Jerusalem when a 17-year-old Palestinian stabbed her in the back with a knife.\n** Israeli forces shot 5 Palestinian youths, and one elderly man with live fire in the al-Balou area of Bireh. A sixth man, reportedly driving by and not involved in the clashes, was shot in the eye with a rubber-coated steel bullet.\n** 8 Palestinian students, were shot with live fire, one in the stomach and 7 in their legs, in clashes with Israeli forces on the campus of al-Khadouri University in Tulkarem, also known as Palestine Technical University.\n** Ayman Samih al-Abbasi (17) died from a shot in the chest at the Ras al-Amoud area of Silwan. Israeli police said 10 Molotov cocktails had been thrown at police patrols in the area.\nDecember\n* 1 December\n** A young Palestinian woman, Maram Ramiz Hassouna (19), from Rafidia in Nablus was shot dead by an Israeli officer at a checkpoint near the settlement of Einav. The officer said she posed an immediate danger to him, and tried to stab him. She had made a similar attempt at the same checkpoint 2&nbsp;years earlier.\n** A Palestinian boy, Mamoun al-Khatib (16) from the village of al-Dawha was shot dead by Israeli policemen when he allegedly attempted to stab a pedestrian in the settlement bloc of Gush Etzion.\n** 3 Palestinians were shot by Israeli forces in the Tel Rumeida area of Hebron. One suffered two gunshot wounds to the stomach. An Israeli spokesman said Molotov cocktails had been thrown in the area.\n** Several patients required treatment after Israeli troops fired tear-gas canisters inside of the al-Makassed hospital's pediatric and intensive care departments in East Jerusalem, as the troops pursued a youth suspected of throwing a Molotov cocktail.\n* 2 December\n** 13 Palestinians in Shuafat Refugee Camp were shot by rubber-coated steel bullets in clashes that erupted with Israeli forces who entered the camp to demolish the home of Ibrahim al-Akkari, who had carried out a murderous attack in Jerusalem in 2014. A further 30 people had to be treated for severe tear gas inhalation.\n** An elderly Palestinian was shot in the neck in Bureij Refugee Camp by live Israeli fire from the border, and left in a critical condition.\n* 3 December\n** Mazin Hasan Ureiba from Abu Dis, an officer serving in the Palestinian Authority general intelligence service, was shot dead by Israeli police after either exiting his car or driving by and firing at Israeli soldiers at the Hizma military checkpoint. A soldier was wounded in the hand, and, reportedly, an Israeli civilian nearby suffered moderate wounds. Later reports state that the civilian was a Palestinian bystander, Khalid Yacub abu Jibna (47) of Sheikh Jarrah who was shot in the back by Israeli live fire and remained in critical condition. Ureiba's father was jailed for 5&nbsp;years for a knifing in Jerusalem in 1992, and his nephew was killed when he stabbed someone in Jaffa Street in 2002.\n** A 21-year-old Palestinian from the village of al-Ubeidiya was shot dead after stabbing an Israeli policeman seated in a car on HaNevi'im Street near the Damascus Gate in Jerusalem. A Palestinian medic from a clinic in the area provided first aid until Israeli services arrived. The officer's injuries, a stab wound in the hand and a bullet in the leg, were said to be moderate. The bullet wound to the leg was reportedly caused by friendly fire from police shooting the Palestinian assailant, according to Channel 2 news.\n* 4 December\n** Israeli forces shot 4 Palestinians with sponge bullets while dispersing the weekly protest march in the West Bank village of Bil'in. One of those hit was shot in the head and required hospitalization.\n** Three Palestinians were wounded by Israeli live fire in clashes outside the Ofer detention center in the West Bank. A further 6 were hit by rubber-coated steel bullets.\n** Israeli military vehicles were fired on while patrolling the Gaza border.\n** Israeli sealed the eastern entrance to the Muslim-Christian village of Aboud after killing a resident, Abed al-Rahman Barghouthi, whom they claim tried to stab a soldier.\n* 5 December\n** Israeli military vehicles were fired on while patrolling the Gaza border.\n** Aqel Ramzi (16) was shot in the thigh by live fire when Israeli forces clashed with protesters in the village of Kafr Qaddum.\n** A 21-year-old Palestinian from Beit Hanina was shot dead after allegedly running over an Israeli and wounding a soldier with a knife in West Jerusalem's Romema neighborhood. Both Israelis suffered very light wounds, and one may have been injured by a car while fleeing the scene.\n** Dozens of children in several Hebron schools required medical treatment after Israeli forces fired tear gas at multiple schools in the area. Muhammad Abd al-Hafith Murrar (14) was reportedly beaten and then arrested\n* 6 December\n** Muhammad Hamadna al-Imor (18) of Beit Furik was shot in the back by Israeli forces who entered the village searching for stone-throwers.\n** Israeli forces shot a child in Silwad village. He was hospitalized with a wound to the abdomen, in critical condition\n** A Gazan was shot in the stomach during clashes with Israeli troops on the border east of Buriej refugee camp in the Gaza Strip.\n** 3 Palestinians were shot with live ammunition during clashes with Israeli forces elsewhere in the West Bank.\n* 7 December\n** The Tunis military training ground in the Zeitoun neighborhood of Gaza City was struck by 2 Israeli missiles, reportedly in response to incidents of gunfire on Israeli vehicles over 4–5 December.\n** Ihab Fathi Miswadi(Ihab Zakariya Maswada( (21) stabbed and critically wounded an Israeli settler, Genady Kofman (41) of Kiryat Arba, near the Cave of the Patriarchs/ Ibrahimi Mosque in Hebron's Old City. Israeli soldiers shot him dead. Kofman later died of his wounds on 30 December.\n** The Department of Prisoner Affairs of the Palestinian Authority charged that Israel had tortured Wasim Marouf, suspected of a stabbing attack, while he was detained in prison. The man, reportedly suffering from epilepsy, mental illness, and gangrene on the right side of his body, was found during an inspection to have 28 cigarette burns on his hands, chest and back.\n* 8 December\n** A 10-year-old Palestinian child was shot by Israeli forces in the stomach, and was in serious condition, during clashes in the al-Jalazun refugee camp\n** Malik Akram Shahin (19) was shot dead with a bullet to the forehead by Israeli forces in a dawn raid on the Duheisha Refugee Camp. Medical sources say the bullet used was a dum-dum cartridge banned under international law. Israeli spokesman said the forces opened fire when pipe bombs and Molotovs were thrown their way.\n** Israeli forces shot one youth in the leg with live fire, and another in the thigh in the wake of Malik Akram Shahin's funeral, when clashes broke out. A Palestinian medic at work at the scene suffered a head wound when struck by a tear gas canister. Several others were shot by rubber-coated steel bullets.\n** Israeli forces occupied 8.4 acres of land owned by Muneer Ismail, destroyed his large greenhouse and uprooted 200 olive trees in Izbet Shofa near Tulkarem. The owner estimated damages at $25,794 The reason reportedly given was that the land had not been cultivated for more than 15&nbsp;years.\n* December 9\n** In an overnight raid to arrest Iyad Maslamani, a leader of the political group Democratic Front for the Liberation of Palestine, a shoot-out ensued in Tubas and Israeli troops wounded Ahmad Hreish (22), Muhammad Hamzeh (20), and Muhannad Maslamani (46). The last named was shot in the stomach and was in a critical condition.\n** In a raid on the village of Sa'ir, the home of Jawad Hasan al-Froukh (27), who had been shot some days earlier, was ransacked and he was arrested, one of between 16 and 31 detentions on Wednesday.\n** Abd al-Rahman Maswada stabbed two Israelis near the Beit Hadassah checkpoint in Hebron. One soldier suffered moderate wounds to his chest while a settler, the son of former Bayit Yehudi MK, Orit Strook, sustained a light leg wound, while reportedly trying to tackle the assailant. Maswada was a cousin of Ihab Maswada, who was shot dead after conducting a similar attack two days earlier.\n** An Israeli couple, Shaul Nir, a convicted terrorist who militated in the Jewish Underground, and his wife Rachel, both in their sixties, was wounded in a drive-by shooting near Tulkarem. The man was in serious condition with a head injury perhaps from the crash, and he suffered gunshot wounds to his limbs, while his wife sustained light injuries in her limbs.\n* December 10\n** When students at the Palestine Technical University in Tulkarem clashed with Israeli troops who had set up a military camp on the campus grounds, 7 students were shot in the leg with live fire, while another 2 were injured by rubber-coated steel bullets, one suffering a knee fracture.\n** Four Israelis were injured on a road leading to the West Bank settlement of Beit Aryeh-Ofarim when a car rammed them as they were carrying out a road-security mission. A 19-year-old soldier was hospitalized with moderate-to-serious wounds while the other three were only lightly injured. Police found the attacker's vehicle abandoned with an M-16 rifle and a stun grenade inside. A suspect, Muhammad Abdelhalim Abdel al-Hamid Salem (37), was arrested the day after in Salfit.\n* 11 December\n** It was revealed that Israel had declared as its state land several dunams (7.4 acres) of private Palestinian property belonging to the villages of Jinsafut and Deir Istiya.\n** Israeli forces shot 5 Palestinian during clashes after they raided Ramallah just before dawn.\n** 4 Palestinians were wounded by live fire and nine others were hit with rubber-coated steel bullets in clashes with Israeli troops in Silwad.\n** I Palestinian was shot by live fire, and 5 more by rubber-coated steel bullets in a demonstration outside Ofer detention center.\n** 3 demonstrators were injured by rubber-coated steel bullets in the village of Ni'lin.\n** Palestinian photographer Hamde Abu Rahma was shot in the chest, the fourth time he has been shot at, while covering a demonstration in Bil'in. He claims the fire was personally directed at him.\n** 3 protesters were shot in the foot with live fire, and a further demonstrator was hit by a rubber-coated steel bullet in clashes at Bethlehem.\n** A Palestinian gunman was shot when he exchanged fire with Israeli troops near al-Jalama checkpoint outside of Jenin.\n** Uday Irsheid (24) was critically wounded and later expired after being shot in the chest by Israeli troops just outside Hebron. The death took place during clashes, after a march began to commemorate the founding of Hamas, in the Ras al-Jura area. His sister Dania had been shot dead by Israeli troops on October 25 in a killing Amnesty International decried as \"unlawful\". A further 9 Palestinians were shot by live fire, and 3 by rubber-coated steel bullets.\n** Omar al-Hroub (55) of the village of Deir Sammit was shot dead near Halhul after allegedly trying to hit Israeli troops with his car\n** Sami Shawqi Madhi (41) from Gaza was shot dead by Israeli forces with a bullet wound to the chest. A further 58 Palestinians were reportedly injured by Israeli fire from the border, as they demonstrated against the fence.\n* 12 December\n** Israeli forces shot 3 Palestinians with live fire and another 16 with rubber-coated steel bullets during clashes in the village of Bireh.\n** A 17-year-old Palestinian youth, Raed Hussam, was wounded in the thigh by Israeli fire in Kafr Qaddum.\n* 13 December\n** A Palestinian farmer in his 20s was shot in the legs by Israeli soldiers firing into the Strip from the Kerem Shalom military post.\n** Settlers took over, under Israeli guard, an historic home located on private Palestinian property and proceeded to refurbish the structure, in the al-Masudiyya area outside the village of Burqa. The settlers claim the land is theirs, though an outpost had been recently dismantled and the Palestinian authority had built a children's park on the same site.\n** Lama Munthir Hafith al-Bakri (16) was shot and seriously wounded when she allegedly tried to stab a settler pedestrian in Hebron, at the Givat Ramot neighborhood by Kiryat Arba.\n* 14 December\n** Israel helicopters struck 2 sites in Gaza before dawn, one in the al-Sudaniya district. The strikes were in response to a rocket fired into southern Israel.\n** Issa Hashah (18) was shot in the thigh when Israeli forces put down clashes that erupted when a group of Jews were escorted at night to a visit at Joseph's Tomb.\n** Abdel-Muhsen Hassuneh ( 21) of Beit Hanina in East Jerusalem wounded 11 people by ramming his car into a bus stop. He was shot dead.\n* 15 December\n** 10 Palestinian youths were shot by Israeli forces using live fire and rubber-coated steel bullets during raids into the Duheishah Refugee Camp when clashes broke out in al-Duheisha refugee camp near Bethlehem, locals told Ma'an\n** 2 Palestinians were killed by Israeli forces in a pre-dawn raid on Qalandiya Refugee Camp. Ahmad Jahajha (20), was a student of media at al-Asriyya College in Ramallah, was shot dead after reportedly attempting to ram his car into a squad of soldiers. A relative of Jahajha, Yunis Jahajha (19) was shot dead by Israeli Border Police in a raid on the same refugee camp 2&nbsp;years earlier. Hikmat Hamdan (29) from nearby Bireh was also shot dead, after he too allegedly drove his car at a group of soldiers inside the same camp. A further 4 camp residents were injured by live fire. 3 Israeli soldiers suffered light injuries, all from friendly fire.\n** 15 students were shot by Israeli troops, on the campus of Tulkarem Technical University. 5 were shot with live fire, 10 with rubber-coated steel bullets.\n** Samah Abd al-Mumen (18) died. She had been caught in crossfire on 23 October when Israeli troops shot Alaa Khalil Sabah Hashah, after he drew a knife at the Huwara checkpoint.al-Mumen was seated in a car nearby at the time.\n** Israeli troops shot and wounded in the leg and hand a 20-year-old Gazan farmer near the Sofa crossing south east of Khan Younis.\n* 17 December\n** Ayman Ameen Hassan al-Khatib (19)  was shot and arrested by Israeli troops in an overnight raid on Bethlehem's al-Obayat village.\n** A Palestinian was shot when he was approaching soldiers with a drawn knife at the Huwara checkpoint. No Israelis were injured.\n** Video was released showing Anat Cohen, a Hebron settler, assaulting a human rights activist trying to film IDF and settler behaviour in Hebron. The incident occurred 6&nbsp;weeks earlier.\n** Israel forces entered the Gaza Stripa and leveled land with bulldozers near the Deir al-Balah refugee camp. During the operation, they reportedly shot 3 Palestinians.\n** A rocket from the Gaza Strip hit open ground in southern Israel.\n** Abdullah Hussein Nasasra (15) of Beit Furik was shot dead after he reportedly tried to stab an Israeli soldier stationed at the Huwwara military checkpoint.\n* 18 December\n** Two Israeli Palestinian women were, according to their own testimony, arrested, handcuffed, chatted up and beaten when they enquired about a delay at the checkpoint to Ma'ale Adumim, where they were driving to purchase material for a beauty shop.An Israeli spokesperson said the officers involved 'behaved impeccably' and that the women had been obstructive.\n** 96 Palestinians were shot on Friday in clashes in the occupied territories with Israeli forces. Incidents occurred at the Beit Einun junction, Beit Furik, Halhul bridge, Sinjil, Beit Ummar, Tuqu', and the entrance of Bethlehem.\n** Several Israeli bulldozers penetrated the Gaza Strip and scoured the al-Qarrara area inside Khan Younis.\n** A Palestinian protester was shot in the head by Israeli forces at Beit Einun junction east of Hebron, and is in critical condition.\n** According to Israeli sources, a Palestinian from  Turmus Ayya rammed his car into concrete blocks at the Qalandiya crossing and ran towards Israeli soldiers, who wounded him when he refused to stop.\n** A Palestinian, Muhammad Abd al-Rahman Ayyad (21), tried to make a car attack at Silwad, was preemptively identified as having a terrorist intent, and was shot dead by troops firing from the cover of a concrete obstacle. He left a will before embarking on the attack.\n** Mahmoud Faisal Bsharat (20), from the village of Tammum, stabbed 3 Israelis in Ra'anana north of Tel Aviv, leaving one moderately, and 2 lightly injured.\n** Mahmoud Muhammad Saed al-Agha (20) was shot dead by Israeli forces in clashes near Khan Younis in the Gaza Strip. A further 31 were shot by live fire and 9 by rubber-coated steel bullets.\n** Nashaat Jamal Asfour (33) of Sinjil was killed by Israeli forces with an explosive dumdum bullet in the chest.\n* 19 December\n** A 17-year-old Palestinian youth was shot in the thigh by Israeli forces in Kafr Qaddum.\n** Israeli forces, raiding the village of Tammum to arrest Mahmoud Bsharat, shot 1 youth with live fire, and another 3 with rubber-coated steel bullets when clashes broke out.\n** According to Palestinian reports, clashes broke out between Israeli troops stationed at the Qalandiya checkpoint and Palestinian gunmen. Israeli reports said armed Palestinians fired on an Israeli pillbox at a checkpoint. A Palestinian girl, Fidaa Sheiki (14) was wounded in the abdomen while inside her house. Another teenager suffered a wound to his hand. According to an Israeli spokesperson, the Israeli troops did not respond to the fire.\n* 20 December\n** A 35-year-old woman from a village near Hebron was shot in the head with a rubber-coated steel bullet after attempting to stab an Israeli soldier in Shuhada Street.  A second Palestinian was also shot when he reportedly tried to assist the wounded woman.\n** 9 students were shot by Israeli forces on the campus of Tulkarem Technical University in clashes over the establishment of an Israeli military outpost on the grounds. 4 were hit in the legs by live fire, and five by rubber-coated steel bullets.\n** Ahmad Jamal Qantawi (14) was shot by live fire in the stomach, leg and hand by Israeli forces near Silwad.\n* 21 December\n** A Palestinian woman was shot by  Israeli forces with live fire near Khan Younis. Palestinian sources say she was working agricultural land, while Israeli sources say she was shot after nearing the border fence and refusing to obey orders to moved off.\n* 22 December\n** 3 Gazan youths were shot by Israeli forces near Bureiji Refugee Camp.\n** 2 Palestinians were reportedly assaulted at a  checkpoint set up at the entrance to Silwad. One of them Muhammad Nitham Hamed, was left in critical condition.\n** The home of  Hussein al-Najjar (30) in Beitillu was vandalized, reportedly by settlers, who drew graffiti and threw tear gas bombs inside. Al-Najjar, his wife and their 9-month-old son Karam suffered from the fumes and were rescued by neighbours who broke in and evacuated the family. The graffiti read:' revenge\" and \"hello from the detainees of Zion\".'\n** 50 olive tree saplings planted by Majed Samih Daraghmeh near al-Lubban ashSharqiya were uprooted by settlers.\n* 23 December\n** 14 Gaza fisherman were arrested by Israeli marine forces and their boats seized and taken to the port of Ashdod.\n** Israeli forces penetrated into the Gaza Strip and bulldozed land near Bureij Refugee Camp.\n** After stabbing 2 Israelis at the Jaffa Gate in, Issa Assaf and Anan Abu Habsa, both from Qalandiya Refugee Camp were killed Jerusalem. A third Israeli was critically wounded, and later died, from friendly fire. The other two suffered from moderate to serious injuries.\n** For the 3rd day in a row, Israeli planes sprayed pesticide on agricultural crops inside the Gaza border, killing off crops. In one affected area at al-Qarrara east of Khan Younis, Saleh al-Najjar lost 7.4 acres of spinach and peas, and Wael al-Shami lost crops of parley and beans. The Wadi al-Salqa area in east central Gaza was also affected. A Red Cross inspection concluded reportedly that 371 acres in central Gaza and 50 acres in eastern Khan Younis had been damaged by the Israeli pesticide spraying.\n** 13 Palestinians were shot by Israeli forces near Ramallah. 9 were shot in the lower limbs during a raid on the home of home of Ahmad Jaber Abu Alia in al-Mughayyir.A further 4 teenagers were shot in Hizma. Tear gas canisters were fired into the premises of Beit Ummar's Zahrat al-Madaim School, and many schoolgirls were affected by tear-gas inhalation.\n* 24 December\n** Wisam Abu Ghwaila (22) of Qalandiya  drove his car at soldiers posted near the Geva Binyamin settlement and the Palestinian village of Al-Ram. One Israeli soldier suffered very light injuries. Ghwalla was shot dead.\n** Muhammad Zahran Abdul-Halim Zahran (22) of Kafr ad-Dik stabbed 2 Israeli security guards at the Ariel settlement, north of Salfit. One soldier sustained serious injury from a stab wound in the upper torso, while the female soldier was moderately wounded. Zahran was shot dead.\n** Eiad Jamal Issa Ideis (25) of  Yatta approached Israeli soldiers at a Hebron checkpoint wielding a screwdriver, and was shot dead.\n** Bilal Zayed (23) was shot dead by Israeli forces in Qalandiya Refugee Camp during clashes when troops on a search and arrest mission encountered hostile resistance.\n* 24 December\n** Hani Rafiq Wahdan (22) was killed by Israeli forces with a live bullet to the head near Shuja'iyya.  Nine others were hit by live fire. 1p other Gazans were wounded by Israeli fire on the same day.\n** In clashes with Israeli troops, 4 Gazans were injured, one being shot in the chest,  near the al-Bureij refugee camp.\n** 6 Gazans were shot in the al-Faraheen area,  east of Khan Younis, and another close to the Erez crossing.\n** Mahdia Mohammad Ibrahim Hammad was shot dead while her car approached an Israel checkpoint near Silwad. Border police stated that they acted when the vehicle approached quickly. Palestinian eyewitnesses say she was driving at normal speed and killed 30 metres from the checkpoint.\n* 25 December\n** Mus'ab Mahmoud al-Ghazali (26) a scrap-metal collector from Silwan in East Jerusalem was shot dead after reportedly pulling a knife when stopped by mounted policemen and asked for his identification papers near Allenby Square/Tzahal Square. Police allege he was following a Jewish couple in a suspicious manner. An eyewitness says he was sitting on a bench when approached by the police, and shot several times when, told to stand up,  he raised his hands in the air. The witness said he hadn't seen any knife. His family said he suffered from mental disabilities, and was a student at the Al-Nur School for people with handicaps.\n* 26 December\n** Maher al-Jabi (56) was shot and critically wounded when he raced past several vehicles and rammed his car into s military police bloc at the Huwara checkpoint. He died while being evacuated to hospital.  An Israeli soldier suffered light injuries.\n* 27 December\n** Saed Muhammad Qumbuz (30 ) from al-Eizariya stabbed a 21-year-old  Israeli soldier on Yirmiyahu Street behind  Jerusalem's Central Bus Station. The soldier was in moderate condition. The assailant was arrested.\n** Muhammad Rafiq Hussien Sabana (17) and Noor al-Deen Muhammad Abdul-Qadir Sabana (23) of Huwara were shot dead after stabbing an Israeli soldier in the face in their village. Another Israeli soldier was wounded by friendly fire.\n** A Palestinian from Bireh was arrested in the Muristan area of Old Jerusalem when he allegedly tried to stab Israeli policemen who stopped him and examined his documents.\n** 3 Palestinians were shot with rubber-coated steel bullets at Azzun, when Israeli forces intervened in a protest at the northern entrance to the village over the arrest of Kreman Akram Sweidan (15) who had been detained near a nearby settlement for allegedly possessing a knife.\n* 28 December\n** Yousif Abu Sbeikha al-Buheiri (48) from the al-Maghazi refugee camp  died from wounds sustained on the 25 December when Israeli forces fired on protesters near the Gaza/Israeli border.\n** 2 Palestinians were shot as Israeli forces conducted a search and arrest mission, ransacking several houses, inside the  Qalandiya Refugee Camp.\n* 29 December\n** Israeli forces raided the offices of the Bethlehem Orphans Charity, which cares for 1,200 children but also looks after Prisoners Welfare, at 2.40 am.. Doors were smashed and the contents of two safes, once broken into, were confiscated. The centre is run by the Palestinian Authority.\n** Israeli forces broke into the offices of the Ahrar Center for Prisoners Studies and Human Rights in Nablus, confiscating computers, fax machines, and all files and documents regarding Palestinian prisoners detained by Israeli. A sign was left ordering the centre to stay shut until further notice.\n** Israeli forces shot 24 people with rubber-coated steel bullets in the wake of clashes at the funeral of Mazin Hasan, which took place at Abu Dis.\n** Israel revealed it planned to classify as Israeli state land  and confiscate 123 acres controlled by the Palestinian Authority and belonging to the villages of Jurish and Qusra. The area is under olive tree cultivation and has a well used for local irrigation. Palestinians believe the intention is to incorporate the land in the settlement of Migdalim.\n** A Palestinian father in Hebron reported that his children had been molested by Baruch Marzel. According to Raed Abu Irmeileh, his daughter, Dana, required hospital care after falling when Marzel chased her near the Ibrahimi mosque. He added that his son Hutasem (10), together with two brothers Nabil al-Rajabi (14) and Farhat Nader al-Rajabi (10) had also been assaulted.\n** Three Palestinians were wounded when clashes in Beit Duqqu broke out as Israeli forces searched the area for three gunmen who had earlier fired at a  military outpost and then fled in a car. One youth was shot and arrested, for reportedly holding a Molotov cocktail. Two other villagers were also injured by Israeli live fire.\n* 30 December\n** Genady Kofman, an Israeli settler in Kiryat Arba, died of wounds received when he was attacked by a Palestinian on December 7.\n* 31 December\n** Hassan Ali Hassan Bozor (22) from the West Bank town of Arraba was shot dead after ramming his car into the Israeli checkpoint of Huwara, moderately injuring one soldier.\n** Shadi al-Ghabeesh (38) succumbed to wounds, after he had been released from hospital where he had been treated after being shot by Israeli forces in al-Jalazone refugee camp on 4 December.\n** Land belonging to Ismail Abed Rabbu al-Shalaldehin the Wadi Sair area of eastern Hebron was expropriated and razed by bulldozers. It is believed that Israel intends using the confiscated property, close to the  Asfar settlement, which is also reportedly built on Sair village lands, to build a permanent military watchtower and checkpoint.\nSee also\n* Israeli–Palestinian conflict\n* 2015–2016 wave of violence in the Israeli–Palestinian conflict\n* Palestinian rocket attacks on Israel\n* Terrorism in Israel\n* Israeli Settlement\n* House demolition in the Israeli–Palestinian conflict\n* List of Israeli price tag attacks\nReferences"
    }
  ]
}