{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Mozart's Requiem\n\nThe composition of Mozart's unfinished Requiem, K. 626, his last work, is surrounded by the following events.\nBefore 1791\n* 2 January 1772: Mozart participates in the premiere of Michael Haydn's Requiem in C minor.\n* 21 September 1784: Birth of Mozart's older son, Karl Thomas Mozart.\n* 20 April 1789: Mozart visits Leipzig where he studied works by Bach.\n* December 1790: Mozart completes his string quintet in D (K. 593) and the Adagio and Allegro in F minor for a mechanical organ (K. 594). These are his first works in a new burst of creativity after a very low production of works in 1790.\n1791\n* 5 January: Mozart completes his last piano concerto, in B (K. 595).\n* 14 January: Mozart completes three German songs (K. 596–8).\n* January–March: Mozart composes mostly dance music (K. 599–611).\n* 14 February: Anna, Count von Walsegg's wife, dies at the age of 20.\n* 3 March: Mozart completes the Fantasia in F minor for a mechanical organ (K. 608).\n* 8 March: Mozart completes the bass aria Per questa bella mano (K. 612).\n* March: Mozart completes the Variations in F on \"Ein Weib ist das herrlichste Ding\" (K. 613).\n* 12 April: Mozart completes his last string quintet, in E (K. 614).\n* 4 May: Mozart completes the Andante in F for a small mechanical organ (K. 616).\n* 23 May: Mozart completes the Adagio and Rondo for glass harmonica, flute, oboe, viola and cello, his last chamber work (K. 617).\n* 17 June: Mozart completes the motet Ave verum corpus (K. 618).\n* July: Mozart completes the cantata Die ihr des unermeßlichen Weltalls (K. 619).\n* mid-July: A messenger (probably Franz Anton Leitgeb, the count's steward) arrives with note asking Mozart to write a Requiem mass.\n* mid-July: Commission from Domenico Guardasoni, impresario of the Prague National Theatre to compose the opera, La clemenza di Tito (K. 621), for the festivities surrounding the coronation on September 6 of Leopold II as King of Bohemia.\n* 26 July: Birth of Mozart's younger son, Franz Xaver Wolfgang Mozart.\n* August: Mozart works mainly on La clemenza di Tito; completed by 5 September.\n* 25 August: Mozart leaves for Prague.\n* 6 September: Mozart conducts premiere of La clemenza di Tito.\n* mid-September – 28 September: Revision and completion of The Magic Flute (K. 620).\n* 30 September: Premiere of The Magic Flute.\n* 7 October: Mozart completes his Clarinet Concerto in A major (K. 622).\n* 8 October – 20 November: Mozart works on the Requiem and a cantata (K. 623).\n* 15 November: Mozart completes the cantata.\n* 20 November: Mozart is confined to bed due to his illness.\n* 5 December: Mozart dies shortly after midnight.\n* 7 December: Burial in St. Marx Cemetery.\n* 5 December – 10 December: Kyrie from Requiem completed by unknown musician (once identified as Mozart's pupil Franz Jakob Freystädtler, although this attribution is not generally accepted now)\n* 10 December: Requiem (probably only Introitus and Kyrie) is performed in St. Michael's Church, Vienna, for a memorial for Mozart by the staff of the Theater auf der Wieden.\n* 21 December: Joseph Leopold Eybler receives score of Requiem from Mozart's widow, Constanze, promising to complete it by mid-Lent (mid-March) of next year. He later gives up and returns the score to Constanze, who turns it to Süssmayr to complete.\nAfter 1791\n* Early March 1792: Probably the time Süssmayr finished the Requiem.\n* 2 January 1793: Performance of Requiem for Constanze's benefit arranged by Gottfried van Swieten.\n* Early December 1793: Requiem is delivered to the Count.\n* 14 December 1793: Requiem is performed in memory of the count's wife in the Cistercian Neukloster Abbey at Wiener-Neustadt.\n* 14 February 1794: Requiem is performed again in Patronat Church Maria Schutz in Semmering.\n* 1799: Breitkopf & Härtel publishes the Requiem.\n* 1800 or later: Walsegg receives leaves 1 through 10 of the autograph (Introitus and Kyrie).\n* Autumn 1800: Abbé Maximilian Stadler compares all known manuscript copies (including Walsegg's) and editions of the score, notes copying errors, and determines precisely which parts of the Requiem were written by Mozart.\n* After 1802: Abbé Stadler receives leaves 11 through 32 (Dies irae to Confutatis) of Mozart's Requiem autograph from Constanze. Later Eybler would receive leaves 33 to 46, the Lacrymosa through Hostias.\n* 17 September 1803: Süssmayr dies of tuberculosis and is buried in an unmarked grave in the St. Marx Cemetery.\n* 1825: Gottfried Weber writes an article in the music journal Cäcilia calling Mozart's Requiem a spurious work.\n* 5 December 1826: On the 35th anniversary of his father's death, Franz Xaver Wolfgang Mozart conducts Mozart's Requiem at St. George's Ukrainian Greek Catholic Cathedral in Lemberg (today Lviv, Ukraine).\n* 11 November 1827: Count Walsegg dies. Karl Haag, a musician formerly in Walsegg's service, receives his score (Mozart's autograph of the Introitus and Kyrie; the rest a copy by Süssmayr) and when he dies, he wills it to Katharina Adelpoller.\n* 1831: Abbé Stadler gives the leaves of the Requiem autograph in his possession to the Imperial Court Library.\n* 1833: Eybler suffers a stroke while conducting a performance of Mozart's Requiem. The leaves of the Requiem autograph in his possession are turned over to the Imperial Court Library.\n* 8 November 1833: Abbé Stadler dies.\n* 1838: Count Moritz von Dietrichstein asks Nowack, formerly an employee of Walsegg, to search among Haag's possessions for six Mozart string quartets that may have been given to Walsegg. Nowack does not find them but discovers Walsegg's score of Mozart's Requiem. The Imperial Court Library pays Adelpoller 50 ducats for the score.\n* 21 September 1839: Gottfried Weber dies.\n* 15 December 1840: François Habeneck conducts the Paris Opera in a performance of the Requiem at the reburial of Napoleon I.\n* 6 March 1842: Constanze Mozart dies.\n* 29 July 1844: Franz Xaver Wolfgang Mozart dies.\n* 24 July 1846: Eybler dies.\nUse in other funerals and memorial services\n19th-century musicians whose funerals or memorial services used Mozart's Requiem included Carl Fasch (1800); Giovanni Punto (1803); Joseph Haydn (1809); Jan Ladislav Dussek (1812); Giovanni Paisiello (1816); Andreas Romberg (1821); Johann Gottfried Schicht (1823); Carl Maria von Weber (1826); Ludwig van Beethoven (1827); Franz Schubert (1828); Alexandre-Étienne Choron (1834); Mme Blasis (1838); Ludwig Berger (1839); Frédéric Chopin (1849); Luigi Lablache (1858); Gioachino Rossini (1868); Hector Berlioz (1869); and Charles Hallé (1895).\n19th-century artists whose funerals or memorial services used Mozart's Requiem included Friedrich Schiller (1805); Heinrich Joseph von Collin (1811);  (1812); Johann Wolfgang von Goethe (1832); and Peter von Cornelius (1867).\nAmong other 19th-century figures whose funerals or memorial services used Mozart's Requiem included Carl Wilhelm Müller (1801); Jean Lannes, 1st Duc de Montebello (1810); Princess Charlotte of Wales (1817); Maria Isabel of Portugal (1819); August Hermann Niemeyer (1828); Thomas Weld (1837); Napoleon (1840); John England (1842); John Fane, 11th Earl of Westmorland (1860); and Nicholas Wiseman (1865).\nIn 1989, Mozart's Requiem was used for the Requiem Mass of Zita of Bourbon-Parma, Empress-Consort of Austria and Queen Consort of Hungary.\nReferences"
    }
  ]
}