{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Israeli–Palestinian conflict in 2005\n\n}}\nThis page is a partial listing of incidents of violence in the Israeli-Palestinian conflict in 2005.\nCumulative total\nSince the beginning of the Intifada to April 9, 2005:\n* 3,225 Palestinians were killed by Israelis (3,135 by military in the territories, 54 by military inside Israel, 34 by settlers in the territories)\n* 950 Israelis were killed by Palestinians (431 inside Israel, 218 settlers, 218 soldiers on duty)\nAccording to the Israeli Ministry of Foreign Affairs, 1058 people were killed by Palestinian violence.\nJanuary\n* January 1: Israeli forces are believed to have killed four Palestinian, one of whom was killed in the el-Salam quarter of Rafah and two by helicopter gunship missile strike in Rafah.\n* January 2: One Israeli civilian was seriously wounded when a Palestinian mortar shell hit the Erez crossing.\n* January 2: One woman was lightly injured when a barrage of Qassam rockets hit Sderot.\n* January 2: Vladimir Rubin, a 66-year-old security guard of the natural reserve of Beit Guvrin was shot dead. The al-Aqsa Martyrs' Brigades claimed responsibility.\n* January 4: 7 Palestinians are killed by a tank shell in Beit Lahia in the northern Gaza Strip. The IDF claim 6 of them were armed militants who were launching mortars shells and Qassam rocket, and that in addition to the shell hit a Qassam rocket exploded and caused extra damage to civilians. Palestinians claim that they were all civilians - from the same family - who were working in the greenhouses.\n* January 4: Two Israeli children were injured when a Palestinian mortar shell landed near a school bus.\n* January 5: 12 soldier are wounded, when a Qassam rocket hit a base near the Gaze-Israeli border.\n* January 6: One Hamas activist was shot dead by Israeli soldiers while he was infiltrating the Ganei Tal settlement in Gush Katif in the Gaza Strip.\n* January 7: One Israeli was killed and four Israelis were wounded in a shooting attack in the West Bank. In Gaza, two Palestinians were killed.\n* January 8: One Palestinian policeman was shot dead by Israeli forces at a roadblock in southern Gaza.\n* January 11: Nissim Arviv, 26, dies from his wounds, after being struck by a Palestinian mortar in the Erez crossing nine days ago.\n* January 12: Gideon Rivlin, 50, a father of five, is killed and 4 Israeli soldiers are wounded in an attack by 3 Palestinian militants who detonated a roadside bomb near the Morag settlement greenhouse in Gush Katif. IDF forces returned fire and killed two of the attackers. The Palestinian Islamic Jihad claimed responsibility.\n* January 12: Two Palestinians were shot dead near Ramallah on the West Bank in an exchange of fire with Israeli soldiers.\n* January 13: Two Palestinian suicide bombers explode themselves and a truck laden with explosives in the Karni crossing - a terminal in the eastern Gaza Strip allowing Palestinian merchants to export goods. At least 6 civilians, all Israelis, were killed and about 10-20 were wounded in the attack. The six were Hertzle Shlomo (50), Ivan Shmilov (53), Dror Gazari (31) from Sderot, Ofer Tiri (23) of Ashkelon, Muna'am Abu-Sabia (33) of Daburyia and Ibrahim Kahili (46) of Um al-Ghanem. Palestinian militants launched mortar shells and automatic weapons fire against ambulances who came to evacuate the wounded and treat the casualties. Fatah's al-Aqsa Martyrs' Brigades, Hamas and The Popular Resistance Committees claimed joint responsibility. About 3 militants were killed during the attack. Palestinian President-elect Mahmoud Abbas is the chairman of Fatah.\n* January 15: Eight Palestinian militants have been killed in three separate clashes in the Gaza Strip: 4 were killed in al-Zaytoun neighborhood, a Hamas stronghold in Gaza City, 2 were killed in Rafah and other 2 were killed near Kissufim junction.\n* January 15: At noon, an Israeli child living in a settlement was injured by a Qassam rocket, losing his hand. In the afternoon, a Qassam rocket hit Sderot and wounded 6 people. An Israeli 17-year-old girl, Ayala Abukasis, suffered critical wounds. Hamas claimed responsibility.\n* January 18: A Palestinian suicide bomber killed one security officer and wounded six Israelis in Gush Katif junction located in the Gaza Strip. Hamas claimed responsibility.\n* January 21: Ayala 'Chaya' Abukasis, 17, who sustained critical wounds from a Qassam rocket on January 15 when she tried to shield her 10-year-old brother from the rocket, died from her wounds in the Soroka hospital.\n* January 31: 2 people suffered shock injuries as 7 mortar shells hit Neve Dekalim settlement in the Gaza Strip. Hamas claimed responsibility and say the shooting was revenge for the killing of a 10-year-old girl in Rafah earlier this morning. Palestinians initially claimed she was killed by an IDF tank shell but it was later revealed that she was killed by Palestinian pilgrims, who shot spontaneously into the air.\n* According to Haaretz, 53 Palestinians were killed during January, 23 of them were civilians.\nFebruary\n* February 3: 6 Israeli soldiers were hurt in two separate incidents southwest to Hebron and in the Gaza Strip, when Palestinian gunmen opened fire on their cars. In the Gaza Strip, Givati Brigade soldiers returned fire and killed the militant. The Fatah's al-Aqsa Martyrs' Brigades claimed responsibility.\n* February 25 - February 26: Stage Club bombing: A Palestinian suicide bomber exploded himself at the entrance of the near-coast \"Stage\" club in Tel Aviv, killing at least 5 Israelis and wounding about 50 more. Responsibility is claimed by Palestinian Islamic Jihad and Fatah's al-Aqsa Martyrs' Brigades. The al-Aqsa Brigades said that Hizbullah was involved in the attack. All three groups subsequently deny responsibility. However, on the 26th, the Islamic Jihad HQ in Damascus, Syria claimed responsibility.\n* February 28: Two Israelis are wounded by a Palestinian shooting attack eastern to the city of Modi'in.\n* According to Haaretz, 5 Israelis and 8 Palestinians were killed in February. At least 4 Palestinians were combatants and 2 died from injuries sustained months ago.\nMarch\n* March 7: Two Israeli soldiers were shot and injured in Hebron, one seriously.\n* March 10: Israeli troops kill Mohammed Abu Hazneh, a member of Palestinian Islamic Jihad and one of the plotter of the Stage Club suicide bombing. After he shot and killed a K9 dog, the troops bulldozed his house, crushing him to death.\n* March 20: Three Israeli soldiers and one police officer are wounded (two of them seriously) after they were shot by Palestinians in Ramallah. They entered the city by accident during a search for stolen cars. The Fatah's al-Aqsa Martyrs' Brigades claim responsibility.\nApril\n* April 5: One Israeli citizen is shot in the chest and critically wounded in the settlement of Morag (northwest to Rafah). The Popular Resistance Committees claimed responsibility.\n* April 7: A Qassam rocket hits a cemetery in Sderot, but causes no casualties.\n* April 9: Israeli soldiers shot dead three Palestinian teenagers on the edge of Rafah refugee camp in southern Gaza. Palestinians said the boys were trying to retrieve a football. Israeli radio reported that Palestinian security services notified Israel they had detained two boys who were not hit by IDF fire, and that the group of five youths were smugglers. The IDF said it would investigate the incident.\n* April 18: Two Israelis, one engineering NCO and one civilian, were wounded by a Palestinian sniper in an attack on Philadelphi Route of southern Gaza. The Popular Resistance Committees claimed responsibility.\n* April 21: Three Israeli soldiers were hurt in a blast when their jeep went on an IED roadside bomb, near Karni crossing, on the edge of the Gaza Strip.\n* April 22 and April 23: A Qassam rocket was launched toward the northern Gaza community. No casualties were reported. Also, Palestinian militants stabbed a soldier near Ganim settlement, injuring him moderately.\n* April 25: Tsiki Eyal, 23, an Israel reserve soldier was killed in Hebron, in an incident involving a running Palestinian car. Initial reports said an Israeli reserves soldier was killed, when he was run over by a Palestinian car in Hebron. Soldiers at the scene opened fire and killed the fleeing driver. Autopsy found bullets remain in the soldier's head, suggesting the soldier was hit by his comrades after they opened fire on the fleeing car. Recent reports say that the driver was unarmed and did not have ties to any militant organization. It is still unclear whether the incident was a deliberate attack by the driver or a combination of a dark night and misunderstanding that caused a fatal accident.\nMay\n* May 2: Following an Israeli raid on the Palestinian city of Tulkarm, one Israeli soldier and one Islamic Jihad leader are killed. The soldier is killed in a gunfight with 3 members of Palestinian Islamic Jihad. The three were suspected to have been a part of the cell which was involved in Tel Aviv \"Stage\" club bombing in February 2005. Shafiq Abdul Rani, the leader of the Jihad cell in Tulkarm was killed and another militant was arrested.\n* May 5: Israeli soldiers open fire on a group of stone-throwing teenagers, killing two.\n* May 16: A Palestinian was killed after he tried to stab a soldier.\n* May 16: Four Israeli construction workers were injured by a Palestinian anti-tank rocket attack on Philadelphi Route.\n* May 18: It was the peak of a sharp increase in violence in the Gaza Strip after Palestinian factions shelled Israeli settlements and towns with more than 31 mortar shells and Qassam rockets. Two Hamas militants were killed this day: one in Rafah while trying to plant a bomb, and one in Khan Yunis while trying to launch a mortar shell. Palestinian claim that the Khan Yunis mortar squad was hit by a missile fired from an unmanned drone. Israel refused to comment.\n* May 20: A major attack on an Israeli settlement was thwarted. 3-4 Palestinian militants sneaked into an abandoned UNRWA structure watching over the Kfar Darom settlement and started to bombard the settlement with mortar shells and anti-tank missiles. IDF and MAGAV forces returned fire, killing one militant and chasing off the rest. Hamas claimed joint responsibility with the Fatah's Al Aqsa Martyrs' Brigades and the Popular Resistance Committees.\n* May 28: A Hamas militant was killed after a rocket he was handling has misfired.\n* May 28: Three Palestinian gunmen opened fire on an Israeli base near Jenin. Soldiers returned fire, wounding the three. They were arrested and taken into medical treatment. Later, one of the militants died from his wounds.\n* May 29: a Palestinian is shot dead by Israeli soldiers after he tried to stab them in Hebron. A soldier called him to stop and fired warning shots but he kept advancing toward them, drawing a 12-cm dagger.\n* May 29: Two Al-Aqsa Martyrs' Brigades militants were killed in the Gaza Strip after a bomb they made exploded prematurely.\n* According to Haaretz, at least 9 Palestinian militants were killed during May. Some were killed by IDF fire and others by premature detonations of the explosives they were handling.\nJune\n* June 7: A day of violence erupts in the Gaza Strip and West Bank.\n** It begins with a barrage of three Qassam rockets on Sderot, severely damaging one house. Hamas claimed responsibility.\n** Israeli soldiers kill senior Islamic Jihad militant Marwah Kamil after he fired on troops that attempted to arrest him. The operation took place under heavy fire exchanges, in which another Palestinian gunman was killed and an IDF officer was wounded by a grenade. An IDF Caterpillar D9 started to demolish Kamil's house after he shot at troops, killing him.\n** A Qassam rocket hit the Ganey Tal and killed 3 workers: 2 Palestinians and a Chinese citizen. Another 6 workers were wounded. The Islamic Jihad claimed responsibility.\n** A total of 9 Qassam rockets, 5 mortar shells, and 5 anti-tank missiles were fired upon Israeli settlements.\n* June 18: A militant attack on the Kfar Darom settlement is foiled. Four militants from the Fatah and the Islamic Jihad tried to infiltrate the settlement but were noticed by IDF soldiers. The soldiers opened fire and killed 1 or 2 militants. Earlier in the morning, two Palestinian teenagers were arrested while trying to smuggle weapons.\n* June 19:\n** One Israeli soldier is killed and 2 construction workers are injured after Palestinian militants fired anti-tank missile at them in the Philadelphi Route. The soldiers returned fire and managed to kill one of the attackers. The Islamic Jihad and the Fatah's Abu-Reish Brigades claimed responsibility.\n** At the Huwwara Checkpoint near Nablus, another Palestinian teenager was caught smuggling five pipe bombs in a wooden box. Palestinian sources identified the boy as 16-year-old Khalil Mohammed Hashash.\n* June 20:\n** One Israeli is killed in a West Bank ambush after Palestinian gunmen shot his car. The Islamic Jihad claimed responsibility.\n** A Palestinian female suicide bomber was caught in the Erez Crossing, carrying explosives and a detonator in her underwear. She planned to carry out a suicide bombing attack in the Soroka hospital where she received medical treatment and was scheduled for a doctor's appointment. The woman was identified as Wafa Samir Ibrahim Bass and said she was sent by the Al-Aqsa Martyrs' Brigades.\n* June 24: An Israeli teenager, Avichay Levi (17), is killed and four others are injured after a drive-by shooting attack from a Palestinian car in Beit Haggai junction south of Hebron. The Fatah's al-Aqsa Martyrs' Brigades claimed responsibility.\n* June 26: Avi Mantzur (16), who was critically injured in the June 24 Beit Haggai attack, dies from his wounds.\n* According to Haaretz, 5 Israelis and 7 Palestinians were killed in June. Three of the Israelis killed were civilians, one was a soldier that was killed by Hizbullah. Four of the Palestinians killed were armed militants; one was killed when he tried to infiltrate through the Gaza Strip barrier. Two more Palestinians were killed by a Qassam rocket fired by Palestinians; this attack also killed a Chinese worker.\nJuly\n* July 9: Israeli security guard shoots a fifteen-year-old Palestinian boy by the name of Muheeb Ahmad Assi near the village of Beit Lakiya. Palestinians were not allowed near the boy until over an hour had passed, by which point he had bled to death, doctors said.\n* July 12: Palestinian militants carried out two suicide bombings against Israel. A car bomb was detonated near a school in the Shavey Shomron settlement, but failed to cause casualties, though the bomber was seriously injured. In Netanya, a suicide bomber exploded himself near HaSharon Mall, killing at least four women (including two friends aged 16) and one male. The Palestinian Islamic Jihad claimed responsibility.\n* July 14: One Israeli woman was killed after the Palestinian militant groups Hamas and Fatah's al-Aqsa Martyrs' Brigades fired more than a dozen Qassam rockets over Israeli settlements inside and outside the Gaza Strip. The woman, aged 22, was killed by a direct hit from a rocket in Netiv Ha'asara, a moshav north of the Gaza Strip.\n* July 15: Seven Hamas militants were killed by Israeli Air Force targeted strikes. The attacks came after Hamas and Fatah launched more than two dozen Qassam rockets over Israeli settlements, killing one woman and jeopardizing the Sharem al-Sheikh truce.\n* July 17:\n** Two Hamas mortars injure five residents of the Israeli settlement Neve Dekalim in the Gaza Strip. Four Qassam rockets land in Israeli territory but no injuries are reported. An Israeli missile attack on a car in Beit Lahiya misses the two men in the car but seriously wounds a Palestinian bystander.\n** An Israeli army sniper kills Said Seyam, 30, in Khan Yunis. The sniper, operating from an observation tower at the Israeli settlement of Ganei Tal, shoots Seyam in the neck while he is standing outside his home.\n* July 24: Two Israeli civilians, an elderly married couple, were slain by a Palestinian shooting attack on Kisufim road in the Gaza Strip. The Fatah's al-Aqsa Martyrs' Brigades, the Popular Resistance Committees and the Islamic Jihad claimed responsibility for the attack. IDF Engineering forces managed to kill the two militants. The attack came after a Palestinian suicide bomber from Jebaliya, sent by Fatah, was caught near Kibbutz Nir Am outside the Gaza Strip.\n* According to Haaretz, 8 Israelis and 22 Palestinians were killed by each other in July. On the Israeli side, all 8 were killed in attacks on civilians. On the Palestinian side, about 16 militants and 6 civilians were killed.\nAugust\n* August 4: Eden Natan-Zada, an AWOL Israeli soldier, opens fire on a bus in Shefa-Amr, murdering two Christian and two Muslim Israeli Arab civilians, before being killed himself.\n* August 17: 2005 Shiloh shooting; four Palestinians are killed by an Israeli who wanted to disrupt the Israeli disengagement from Gaza.\n* August 24:\n** Israeli troops kill five suspected militants in a raid in Tulkarem, the West Bank.\n** A Palestinian stabs two Orthodox Jews in Jerusalem, killing one and injuring the other.\n* August 28: A Palestinian suicide bomber blows up outside a bus station in Beersheba, seriously wounding two security guards.\nSeptember\n* September 6: Israeli troops fire on Palestinians marching to the evacuated Neve Dekalim settlement in Gaza, killing one and wounding two.\n* September 8: Israeli troops open fire on two Palestinians nearing the evacuated Rafiah Yam settlement in Gaza, killing one.\n* September 21: Kidnapping and murder of Sasson Nuriel.\n* September 23, 2005 Jabalia Camp incident: an explosion or series of explosions during a Hamas rally or parade killed 19 Palestinians. Hamas accused Israel of an airstrike causing the blast; Israel denied that; Fatah claimed that the explosion(s) were accidentally caused by Hamas; Hamas denied that.\nOctober\n* October 16: 2 drive-by shootings in the West Bank after a reasonably peaceful time in the region, the first in Gush Etzion junction near Hebron killing 3 Israeli civilians and wounding 3, the second in Alie junction in Binyamin settlement causing one teenager to be seriously wounded. Al Aqsa Martyrs Brigade claims responsibility and said the attack was in response to military actions in the region. The encirclement of Palestinian cities in the West Bank was reactivated following the attacks. Unrelated to the attacks, a Palestinian militant was killed during an IDF operation that day.\n* October 20: 15-year-old Palestinian youth killed by IDF forces west of Bethlehem. The IDF claims that the 15-year-old boy was throwing a Molotov cocktail on a passing Israeli car.\n* October 21: Two armed Palestinians were killed in the west bank in an exchange of fire with IDF forces. While the IDF claims the Palestinians were armed militants who opened fire, Palestinian security officials said the men were unarmed and were shot by IDF for throwing stones at a passing IDF jeep.\n* October 22: A Palestinian youngster was killed by IDF forces, near the settlement of Halamish in the West Bank. According to IDF officials, 2 Palestinians were placing a suspicious object on the road, thought to be placing a bomb, the soldiers fired on the 2 Palestinians wounding one of them who later died of his wounds. The object was later discovered as a mock-bomb.\n* October 23: IDF kills leading militant Louie Sa'adi on a raid in Tul Karem, a Palestinian city in the West Bank. Sa'adi is a senior Islamic Jihad member responsible for several militant attacks on Israel. A second armed militant, a senior Fatah member was also killed during the operation.\n* October 26: 5 Israelis killed and 30 wounded in a suicide bombing in Hadera's open-air market. Islamic Jihad claimed responsibility for the attack, saying it was in retaliation for the killing of Louie Sa'adi, an Islamic Jihad commander who was killed during an operation by IDF forces on October 23. It is the first suicide bombing in Israel since August 28 when a suicide bombing wounded 20 in Be'er Sheva's central bus station.\n* October 27: Following an attack of IAF aircraft in Gaza, two Palestinian militants who belong to the Islamic Jihad organization and 5 civilians were killed. The attack was part of an Israeli operation in the West Bank and Gaza, against militant infrastructure, mainly the Islamic Jihad, who were responsible for the suicide bombing in Hadera the day before.IDF also deployed forces near the Gaza strip in preparation for a possible launch of Qassam rockets into Israel following the attack.\nDecember\n* December 5 -Third HaSharon Mall suicide bombing: A suicide bomber killed himself and at least five Israelis in a shopping mall in Netanya. Both Islamic Jihad and Al Aqsa Martyrs' Brigades claimed responsibility. In a phone call to the Associated Press, Islamic Jihad identified the bomber as Lotfi Abu Saada, from the village of Illar between the West Bank towns of Tulkaram and Jenin.\nSee also\n* Israel-Gaza conflict\nReferences"
    }
  ]
}