{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Yemeni history\n\nThis is a timeline of Yemeni history, comprising important legal and territorial changes and political events in Yemen and its predecessor states. To understand the context to these events, see History of Yemen. See also the List of rulers of Saba and Himyar, the list of Imams of Yemen and the list of presidents of Yemen.\n23rd century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 2300 BC || || According to some legends, the Arabs of the south unite under the leadership of Qahtan.\n|}\n21st century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 2100 BC || || To the East of Qahtan A'ad settles Oman.\n|}\nCenturies: 20th BC19th BC18th BC17th BC16th BC15th BC14th BC13th BC12th BC11th BC10th BC9th BC8th BC7th BC6th BC5th BC4th BC3rd BC2nd BC1st BC\n16th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1600 BC || || The Qahtanis began to move to the Tihama coasts and the lowlands. A tradeline began to flourish along the red Sea Tihama coasts. During this period the Qahtanis began to settle in small trading colonies in neighboring East Africa.\n|}\n12th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1200 BC || || The Sabaean Kingdom came into existence.\n|}\n9th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 900 BC || || The Qahtanis began using a variant of the Phoenician script; this will lead to the recording of South Arabian history from this point onwards.\n|}\n8th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"5\" valign=\"top\" | 800 BC || || Ma'een kingdom builds its capital in Baraqish.\n|-\n| || The Sabeans build their capital on the edge of the mountains regions in Sirwah.\n|-\n| || The Qatabanians rise as Sabean vassals in the region known now (AD 1990) as central and east Yemen.\n|-\n| || Hadhramawt rise as Sabean vassal kingdom in the region known now (AD 1990) as eastern Yemen.\n|-\n| || Awsan appears as independent nation in a region that will partly controlled by the Qatabanians.\n|-\n| 719 BC || || The temple of Marib is finished.\n|-\n| 718 BC || || War between Ma'een and the Sabeans.\n|-\n| 716 BC || || After securing their borders with Ma'een the Sabeans moved their capital to the more accessible Marib.\n|-\n| rowspan=\"2\" valign=\"top\" | 715 BC || || The Sabeans control the trade line and started recording diplomatic relationships with Assyria.\n|-\n| || Sumhu`alay Yanuf and his son Yatha`amar Bayyin complete building the Marib Dam.\n|}\n7th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 700 BC || || The Qatabanians build Timna and rebel against the authority of Saba.\n|-\n| 675 BC || || Karib'il Watar defeats the rebellion and brings all of South Arabia under the Sabean rule.\n|}\n6th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 600 BC || || Saba reaches its height of power and extends its hegemony across the Red sea establishing the Dm't Kingdom, this will be the nucleus of the Semitic culture of East Africa. Although it is not the first attempt of the Qahtanis to expand their rule to the African coast.\n|}\n5th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"3\" valign=\"top\" | 500 BC || || The Dam of Marib breaks, Saba suffers from drought and rebellions.\n|-\n| || The Ma'een kingdom allied with the Qatabanians and Hadramites rebel against Saba and gain their independence.\n|-\n| || Ma'een establishes itself as the dominant kingdom in the north of Yemen, extending its authority on the northern Red Sea coasts, and establishes military/trading colonies as far as Sinai.\n|}\n4th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 370 BC || || Qahtani tribes attack the Persians out of Musqat in the Eastern tip of the Arabian peninsula. From that time on Qahtanis replaced the Ancient Arabs 'Ad in Oman.\n|}\n2nd century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 110 BC || || Himyar rises against Qataban.\n|}\n1st century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"4\" valign=\"top\" | 100 BC || || Ma'een declines gradually mainly due to the Roman control of the new sea trade routes.\n|-\n| || Himyar starts expanding on the expense of the war-torn kingdom of Saba.\n|-\n| || The remains of the Qhatani Jurhum tribe integrate their lineage under Nizar bin Ma'ad bin Adnan. From this point on they become the Adnanites.\n|-\n| || Himyar allied itself with most of the Qahatni tribes of the lowlands and central highlands, annexing most of Saba and Southern Qataban, but Hadhramout repels them.\n|-\n| rowspan=\"2\" valign=\"top\" | 25 BC || || The Romans encouraged by the civil war in South Arabia attempt to invade the region, but fail to survive the Arabian desert.\n|-\n| || Sabean civil war, Himyar closes in on Saba and takes over most of the Sabean central highlands, red sea coasts territory. Saba breaks into two smaller states in the northern highlands and the desert region around the capital Marib.\n|}\nCenturies: 1st2nd3rd4th5th6th7th8th - 9th - 10th - 11th - 12th - 13th - 14th - 15th - 16th - 17th - 18th - 19th - 20th\n1st century AD\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 100 || || The Kingdom of Aksum dominates East Africa and takesover the Sabean trading/military colonies.\n|-\n| || The Kahlan tribes remain as the only tribes still loyal to the Sabean state at Marib, Kahlan tribes cornered in the area between Sana'a and Marib in the north of Yemen.\n|}\n2nd century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"4\" valign=\"top\" | 200 || || Jews settle Yemen.\n|-\n| || Himyar captures most of Qataban.\n|-\n| || Himyar annexes the Sabean state of Marib.\n|-\n| || After the loss of Marib Saba, Kahlans septs Azd, Hamdan, Lakhm, Tai headed north except for the Hashid and Bakil tribes of Hamdan of Gurat Saba () and Kindah in the Ramlah Desert.\n|}\n3rd century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 211 || || Hadhramout allies itself with Qataban and Aksum attacking Himyar from the West and the east.\n|-\n| 217 || || While the Himyarites are fighting the Hadhramout/Qataban alliance in the east, the Aksumites capture the Himyarite capital Zafar.\n|-\n| 221 || || Hadhramout annexes Qataban and reaches its height of power.\n|-\n| 222 || || The Aksumites attempt to capture Hadhramout from the coast.\n|-\n| 225 || || During the reign of Sha`irum Awtar the Himyarites/Sabeans attack the Kingdom of Hadhramout from the East and capture their capital.\n|-\n| 227 || || The Gurat Sabeans and Himyar ally themselves against the Aksumites and retake Zafar. The Aksumites lose all their territories in South Arabia except for Tihama.\n|-\n| rowspan=\"2\" valign=\"top\" | 229 || || Himyar recaptures Southern Tihama and controls the Major East African ports across from Muza'a. The Aksumites keep the Northern strip of Tihama.\n|-\n| || The Kahlani Imran bin Azd branch expel the Persians from Oman.\n|-\n| 231 || || The Kahlani Jifna bin Azd branch settles Syria and Lakhm settles Mesopotamia.\n|-\n| 280 || || Himyar annexes the last Sabean enclave to its Kingdom.\n|-\n| 300 || || Himyar annexes Hadhramout expanding its borders to Dhofar Oman. to the East of their borders the Azd bin Imran (Azd Uman).\n|}\n4th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 320 || || Himyar annexes Socotra.\n|-\n| 325 || || From Al-Ramlah in Yemen, Shiekh of Kindah makes alliances with Adnani tribes of Najd.\n|-\n| 390 || || Abu-Kariba Asad King of Himyar converts to Judaism and spreads the religion in the region.\n|}\n5th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 425 || || Himyar appoints Akil al-Murar ibn Amr as the first Hujr of its Northern Kindite colonies.\n|-\n| 480 || || Amr al-Mansur ibn Hudjr rises his status to the king (vassal to Himyar) and bring the Northern part of the Arabian peninsula under Himyarite control.\n|-\n| rowspan=\"2\" valign=\"top\" | 500 || || Christianity spreads in Najran/Tihama strip an area still allied to the Christian Aksum kingdom.\n|-\n| || Two Jews from Yathrib travel to Himyar in the hope of converting the people of Himyar to Judaism.\n|}\n6th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 523 || || King Dhu Nuwas converts to Judaism, he begins a campaign to convert the Himyarites into Judaism.  Himyarites convert in big numbers except in Najran.\n|-\n| rowspan=\"2\" valign=\"top\" | 525 || || At this time Himyar included all the Arabian Peninsula (via Kindah) and he was angered by the Najrani chief refusal to leave Christianity. Dhu Nawas took Najran and massacred 20,000 Najrani Christians.\n|-\n| || The Christian Aksumites defeat Dhu Nawas and annex Himyar, starting a period of persecution against the Yemenite Jews. A third of the population of Yemenite Jews is exiled to Aksum.\n|-\n| rowspan=\"2\" valign=\"top\" | 570 || || The Dam of Marib broke for the third and final time, triggering another migration of Yemeni tribes. The Qur'an itself refers to the collapse of the Marib Dam as a punishment on the Sabaeans for their ungratefulness to God.\n|-\n| || Under Khosrau I, Persian forces expel the Aksumites with the help of Dhu Yazin. Persians later assassinate Dhu Yazin and try to establish their rule over all Yemen, but they fail and a number of autonomous kingdoms are established.\n|}\n7th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 628 || || The final Persian governor of Yemen, Badhan, converted to Islam, thus nominally submitting the entirety of Yemen to the new faith.\n|-\n| 632 || || Al-Aswad al-Ansi proclaims himself prophet and attracts a large following. He captures Sana'a, but is killed by the Persian  shortly after.\n|-\n| 660 || || Yemen is captured by the pro-Umayyad forces during the First Fitna.\n|-\n| 686 || || Kharijites under Najda ibn Amir attack Yemen during the Second Fitna.\n|-\n| 687 || || Kharijite attacks continue, and Sana'a is forced to submit to Najda ibn Amir.\n|-\n|}\n8th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 740 || || Imam Zayd ibn Ali, founder of Fiver Islam leads revolt in Kufa against Umayyads. The revolt is brutally crushed and Zayd killed. Some followers remained in Medina, when Imam Al-Hadi Yahya would bring Zaidiyyah to Sa'dah in the thirteenth century.\n|}\n9th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n|893 || || Imam al-Hadi ila'l-Haqq Yahya arrives in Yemen for the first time.\n|-\n| 897 || || Establishment of the Zaydi imamate under al-Hadi at Saada.\n|}\n12th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n|1165\n|\n|Mass conversions from Judaism to Islam.\n|-\n| 1173 || || Saladin annexes both the Hejaz and Yemen to his Ayyubid sultanate.\n|}\n13th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1229 || || The Rasulid dynasty rules Yemen until 1454.\n|}\n16th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1514 || || In response to Portuguese occupation of Kamaran island, a fleet from the Mamluk Sultanate attack and occupy the western and southern shores of the Timurid territory in Yemen.\n|-\n| 1517 || || Ottomans capture Egypt and eliminate the Mamluk dynasty, then move on to Yemen, where they occupy Aden.  Sana'a and the rest of Yemen remain under the Zaidi dynasty.\n|-\n| 1538 || August || Admiral Sulayman Pasha captures Aden for Sultan Suleiman the Magnificent in order to provide an Ottoman base for raids against Portuguese possessions on the western coast of the Indian subcontinent.\n|-\n| 1540 || || Residents of Aden rise up against the Ottomans, slaughter the garrison and invite Portuguese protection. The Portuguese stay until driven out by the Ottoman fleet under Admiral Peri Pasha.\n|-\n| 1595 || || Imam Al-Qasim ibn Muhammad begins a rebellion against the Ottomans that would last for 30 years.\n|}\n17th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1618 || || British establish a \"factory\" (trading post) at Mocha on the Red Sea coast.\n|-\n| 1630 || || The East India Company begins trade in coffee from Mocha, which held a monopoly on the plant at the time.\n|-\n| 1635 || || The Ottomans are expelled from Yemen.\n|}\n18th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1728 || || Fadl ibn Ali, chief of the Abdali tribe, declares Lahej an independent sultanate.\n|-\n| 1735 || || Fadl ibn Ali's forces capture Aden and make it part of the Sultanate of Lahej.\n|-\n| 1785 || || Americans begin to compete with British for the coffee trade from Mocha and by 1800 would become the main exporters of Yemen's most important article of foreign trade.\n|}\n19th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1837 || || Forces of Muhammad Ali, nominally the Egyptian vassal of the Ottoman Empire, occupy Ta'izz. The British warn him against further military movements.\n|-\n| 1839 || || In response to an incident in which Arab traders plundered a British vessel, Captain Haines sailed against Aden and finding resistance bombards then occupies it for the East India Company's Bombay Presidency, requiring the Sultan of Lahej to accept British protection. Aden will serve as a major refueling port when the Suez Canal opens in 1869.\n|-\n| 1849 || || Ottomans establish presence on the Red Sea coast, but the Ottoman force sent to take Sana'a is massacred after accepting invitation to enter the city.\n|-\n| 1850s || || Beginning of \"the time of corruption\", which would last until the end of the century. Zaidis lost major ports to other tribes; widespread food shortages; rivalry for the imamate; with Qāsimī rule collapsing, Turkish incursions into the highlands meet with support.\n|-\n| 1872 || || Ottomans occupy the northern Yemen, taking Sana'a and spreading out southward around Taiz. Imam Al-Mutawakkil al-Muhsin withdraws to the north.\n|}\n20th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1904 || || Yahya Muhammad Hamid ed-Din, a descendant of Imam al-Qasim, becomes Imam and takes regnal name of al-Mutawakkil 'ala Allah (\"He who relies on God\").\n|-\n| rowspan=\"2\" | 1911 || January || At a time when the Ottoman Empire was trying to pacify Albania and was facing hostile moves by Italy against Libya, both Imam Yahya and Muhammad ibn Ali al-Idrisi, Emir of Asir rose up against the Turks, causing the Ottomans to send 30,000 troops from Libya to respond. Forced to fight in the highlands, Yemen became \"the graveyard of the Turks.\"\n|-\n| October || Treaty of Daan: When war with Italy broke out, the Ottomans were forced to accept Zaidi autonomy in the highlands, while remaining in possession of the Red Sea coast. Turkey also provided financial aid to Imam Yahya. The agreement, which conceded most of the demands Imam Yahya had been making since 1908, stopped the almost continuous war between the Turks and Zaidis, even though the Ottoman parliament did not ratify it until 1913.\n|-\n| 1914 || March || Anglo-Turkish Treaty on boundaries concludes work of Anglo-Turkish Boundary Commission which had begun in 1902. The powers agree on division between their respective realms in Yemen, a division that would more-or-less later serve as the boundary between North and South Yemen.\n|-\n| 1918 ||Early December|| Turkish governor of Yemen informs Imam Yahya that \"Franks\" (the European allies) had overrun Anatolia and that the Ottomans would be forced to withdraw from Yemen. Through a series of alliances, tribal wars and intrigues Yahya would consolidate Zaidi hold over to the south of Sa'da (including Sana'a) and would begin moving north against the Idrisi state of Asir.\n|-\n| 1926 || September 2 || Treaty of friendship between Italy and Imam Yahya. Italy becomes the first power to recognize Yahya as King of Yemen.\n|-\n| 1934 || February 11 || Treaty of Sana'a between Yemen and Great Britain. The parties agree on a modus vivendi without resolving claims of sovereignty on either side.\n|-\n| 1934 || May 20 || Treaty of Taif ends brief border war between Al-Saud and Yemen. Yemen cedes Asir to Saudi Arabia.\n|-\n| 1944 || June || Having fled the court of the Crown Prince in Ta'izz, Ahmad Muhammad Numan, Muhammad Mahmud al-Zabayri and Zayd al-Mawshki arrive in Aden where later that year they would form the Free Yemeni Party.\n|-\n| 1946 || March 4 || The United States recognizes the Kingdom of Yemen by letter from President Harry S. Truman to Imam Yahya, providing for the appointment of an American Special Diplomatic Mission to the Kingdom.\n|-\n| 1948 ||February 17 || Yahya assassinated. He would be succeeded by his son Ahmad who rallied northern tribesmen to defeat nationalist opponents of feudal rule.\n|-\n| 1947 ||December 2-4 || Anti-Jewish pogrom in Aden. 82 Jews were killed and 76 were injured by Arabic nationalists.\n|-\n| 1955 || March 31-April 1 || Army officers who objected to Imam Ahmad's conservative rule, especially his harsh and summary punishments, laid siege to the Elurdhi fortress in Taiz while the Imam was inside. The Imam's brothers supported the coup attempt with Emir Abdullah bin Yahyi (purportedly reformist minded) accepting the army's call to replace Ahmad and Emir Abbas telegraphed support from Sana'a. Crown prince al-Badr rallied tribal support and Liberals (local and emigres in Cairo) among others supported him. The siege was raised and Ahmad restored on April 5, and both Abdullah and Abbas were executed.\n|-\n| 1956 || April 21 || Jiddah Pact: Imam Ahmad, Premier Nasser (of Egypt) and King Saud (of Saudi Arabia) sign pace in Jeddah pledging the armies of all three would be placed under a single command to repel invasion. Nasser expressed his goal to \"spoil British imperialist plans in the Middle East,\" but Egypt had no then pending dispute with Britain unlike Yemen (which disputed the border with Aden and the ownership of the Red Sea island of Kamana) and Saudi Arabia (which Britain accused of fomenting anti-British sentiment among tribes on their border).\n|-\n| rowspan=\"2\" | 1958 || March 8 || As a concession to pro-Nasserite opinion and to avoid Egyptian aid to republican opposition, Yemen enters loose federation with the United Arab Republic to form the United Arab States. The signing ceremony took place in Damascus between Egypt's President Nasser and crown prince Muhammad al-Badr.\n|-\n| April || Aden's colonial governor Sir William Luce warns British government against too hasty a withdrawal from Aden citing the possible hostile threat of Egypt and the Soviet Union aiding Yemen in securing domination over Aden.\n|-\n| rowspan=\"3\" | 1959 || February 11 || Six West Aden protectorate states (but not the colony of Aden itself) join the Federation of Arab Emirates of the South and the Federation and Britain signed a \"Treaty of Friendship and Protection,\" which detailed plans for British financial and military assistance.\n|-\n| April || Imam Ahmad, gravely ill, departs for Italy for treatment. Muhammad al-Badr left in charge brings in Egyptian development experts and rattles sabers against Britain in Aden.\n|-\n| August 13 || Sana'a Radio broadcasts a message from Imam Ahmad that he had returned and had discovered plots. He said that there would be some whose \"heads would be cut off\" and others' \"heads and legs would be cut off.\" Suspecting that Egypt was supporting republicans within Yemen, Ahmad sent many Egyptian civil, educational and military advisers back to Cairo and stopped the work of others.\n|-\n| rowspan=\"4\" | 1962 ||September 18|| Imam Ahmad dies. Crown prince al-Badr succeeds him, unopposed.\n|-\n| rowspan=\"2\" | September 26 || A federation of South Arabia formed, uniting Aden and the federated hinterlands under British auspices.\n|-\n| During the night, the building in which Imam al-Badr worked was surrounded and shelled by tanks. Egypt-backed Junior army officers seize power and proclaim the Yemen Arab Republic, sparking an eight-year civil war between royalists supported by Saudi Arabia and republicans backed by Egypt. The British government, though divided, decides to support the royalists.\n|-\n| November || Egypt announces the formation of the National Liberation Army to free southern Yemen from British rule.\n|-\n| 1963 ||October 14|| Two nationalist groups, the Front for the Liberation of Occupied South Yemen and the National Liberation Front begin an armed revolt (Aden Emergency) against British control in South Yemen. Fighting began in Radfan, but the British quickly subdued it.\n|-\n| 1965 || June || Britain invokes emergency powers to deal with increasing unrest in Aden.\n|-\n| 1966 || February || Britain announces (in a reversal) that Aden was not vital to its commercial security and would be abandoned (naval base and all) by 1968.\n|-\n| 1967 ||November 30 || South Yemen granted independence by Great Britain and begins a socialist experiment.\n|-\n| 1986 || January 13 || Gangland-style assassination attempt by the guard of South Yemen President Ali Nasser Mohammed al-Hassani on his rivals in the 15-member Politboro, killing Vice President Ali Antar and sparking gun fight among Politboro members. Twelve days of street fighting in Aden followed until the hard-line Marxists gained control and President Hassani was driven into exile.\n|-\n| 1989 || February 16 || Heads of states of Egypt, Iraq, Jordan and Yemen announce form Baghdad the formation of the Arab Cooperation Council.\n|-\n| rowspan=\"2\" | 1990 ||May 22 || Yemeni unification.\n|-\n|August 6|| Yemen abstains from UN Security Council resolutions authorizing military action against Iraq (as a result of its invasion of Kuwait). As a result, 800,000 Yemeni workers are expelled from Saudi Arabia and Kuwait.\n|-\n| 1994 || May 5|| Southern Yemen attempts to secede, sparking a civil war, which is brought to an end in July when northern forces capture Aden.\n|-\n| 1999 || September 23 || Ali Abdullah Saleh receives 99.3% of the vote in the first presidential election by universal suffrage.\n|-\n|}\n21st century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 2000 || October 12 || While refueling at a water-borne platform off the port of Aden, the USS Cole, a guided-missile  destroyer, was attacked by terrorist affiliated with Al-Qaeda who detonated C-4 plastic explosives to tear a whole in the hull, killing 17 soldiers. The next day a bomb exploded at the British embassy in Sana'a but resulted in no casualties.\n|-\n| rowspan=\"2\" | 2004 || June 18 || Police crack down on Zaidi demonstrators in capital and arrest large numbers. Fearing the followers of Hussein Badreddin al-Houthi to be an imminent treat and using claims that they were setting up unlicensed religious centers and engaging in violent demonstrations against the US and Israel, President Selah sends troops to northern province of Sa'ada to locate Sheikh al-Houthi and his followers. Resistance by Houti followers triggers Shia insurgency.\n|-\n| September 10 || Yemen interior and defense ministries announce that Sheikh al-Houthi had been killed with a number of his aides. The government earlier claimed that it had \"crushed\" the Houthi rebellion, but the conflict would continue until the present,\"characterized by continuous fighting of varying intensity, punctuated by multiple ceasefires and mediation attempts\" (the government counted six phases of \"active fighting\" by 2010).\n|-\n| 2009 || Week of December 13 || US begins air strikes on suspected Al-Qaeda personnel and locations at the request of Yemen government.\n|-\n| 2010 || October 29 || Two packages, each containing a bomb consisting of 300 to 400 grams (11–14 oz) of plastic explosives and a detonating mechanism, were found on separate cargo planes in transport from Yemen to the United States, an incident since referred to as \"the October 2010 (Yemen) incident\".\n|-\n| rowspan=\"4\" | 2011 || March 18 || Jumaa al-Karama (Friday of Dignity): Massacre of protestors against President Ali Abdullah Saleh leads to massive protests and the revolution that would end his 22-year rule.\n|-\n| June 3|| After months of peaceful protest against his rule, President Saleh narrowly survives an attack by mortar against a mosque at the presidential compound.\n|-\n| November 23 || In ceremony in Riyadh President Saleh and opposition politicians sign Gulf Cooperation Council brokered deal, whereby President Saleh would step down, transfer executive power to Vice President Hadi and a national unity cabinet would be formed.\n|-\n| December 7 || Pursuant to November 23 agreement, Yemen forms unity government under Prime Minister Mohammed Basindawa made up balanced between the ruling General People's Congress Party and the opposition.\n|-\n| 2012 || February 21 || In election to replace President Saleh, Vice President Abdrabbuh Mansur Hadi receives 99.6% of the vote in uncontested race. Despite lack of choice, turnout said to be higher than expected.\n|-\n| 2013 || March 18 || National Dialogue, a conference brokered by the Gulf Cooperation Council and endorsed by the United Nations and made up of over 500 delegates representing the wide array of the political spectrum conveneded to draft a new constitution for Yemen, begins. President Hadi says that the unrest in the south is the most difficult issue before them.\n|-\n| rowspan=\"2\" | 2014 || September 21 || Houthi rebels sign peace agreement brokered by UN envoy Jamal Benomar designed to give the rebels participation in new government and result in withdrawal of rebel military forces from Sana'a. The next day the rebel forces consolidated their hold on the capital.\n|-\n| October 9 || Hours after Houthis force Prime Minister-designate Ahmed Awad bin Mubarak to turn down post, suicide bomber detonates bomb near Tahir Square in Sana'a just as a Houthi rally was to begin. Al-Qaeda in the Arabian Peninsula takes credit for the attack.\n|-\n| rowspan=\"3\" | 2015 || January 22 || Following resignation of cabinet and prime minister Khaled Bahah Yemen's president Abd Rabbuh Mansur Hadi resigns in the face of control of the capital by rebel Huthi forces, which had besieged his residence and abducted his chief of staff, Ahmed Awad bin Mubarak.\n|-\n| February 6 || Houthi rebels announce that they have dissolved parliament and installed a five-member \"presidential council\" which will form a transitional government to govern for two years which would include a transitional national council of 551 members. The UN refused to acknowledge the \"unilateral\" announcement.\n|-\n| March 25 || At a new conference by its ambassador to the US, Saudi Arabia announces the beginning of \"Operation Storm of Resolve\" involving airstrikes against Houthi rebel targets in and near Sana'a. Saudi Arabian television reported that the UAE, Bahrain, Kuwait, Qatar, Jordan, Morocco and Sudan were sending aircraft, and Egypt, Jordan, Sudan and Pakistan were willing to send ground troops. The US said it was providing \"logistical and intelligence support\".\n|-\n|2016\n|early October\n|A cholera outbreak began predominantly in Sanaa, and killed more than 4000 people by 2022.\n|-\n|2017\n|December 4\n| Ali Abdullah Saleh killed two days after publicly breaking with the Houthis.  Aides said he died after an explosion at his home in Sanaa; the Houthis said they had killed him in an ambush in the desert.\n|-\n|}\nSee also\n* Timeline of Aden\n* Timeline of Sanaa\nReferences\n* Andrey Korotayev. [http://cliodynamics.ru/index.php?option=com_content&task=view&id=324&Itemid=70 Social History of Yemen. Moscow: URSS, 2006].\n* Original text from [https://web.archive.org/web/20020404025855/http://www.state.gov/r/pa/ei/bgn/5302.htm#history U.S. State Dept. Country Study]\n* (1): DAUM, W. (ed.): Yemen. 3000 years of art and civilisation in Arabia Felix., Innsbruck / Frankfurt am Main / Amsterdam [1988]. pp.&nbsp;53–4.\n* [https://web.archive.org/web/20060823035154/http://www.utcyemen.com/UTC_history.htm  History of Yemen]\n* [https://web.archive.org/web/20070928152602/http://thearabhistory.com/qahtan History of Qahtan]\n* [http://www.metmuseum.org/toah/ht/04/wap/ht04wap.htm   Timeline of Art History of Arabia including Yemen (The Metropolitan Museum of Art). ]\n* [http://www.saudiaramcoworld.com/issue/197802/a.dam.at.marib.htm A Dam at Marib]\n* [http://www.derjemen.de/ Das Fenster zum Jemen (German)]\n* [https://web.archive.org/web/20120205195337/http://www.i3mainz.fh-mainz.de/dipl/d5_10/Geschichte.htm Geschichte des Jemen (German)]\n* [https://web.archive.org/web/20080212020702/http://www.al-bab.com/yemen/hist/hist.htm History of Yemen]\nSources\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}