{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of intercommunal conflict in Mandatory Palestine\n\nThis is a timeline of intercommunal conflict in Mandatory Palestine.\nBackground\n1881\n* The first wave of Jews arrive in Ottoman Syria in the First Aliyah after Zionism itself began some time in the 1850s\n1897\n* At the First Zionist Congress, held from August 29 to 31 in Basel, Switzerland, the World Zionist Organization was founded.\n1901\n*The Sursock Purchase: The Jewish Colonisation Association makes its first major purchase in the north of Palestine in an acquisition of 31,500 dunums (acres) of land near Tiberias from the Sursock family. This will go on to become one of the largest land purchases for the purposes of colonisation within Palestine.\n1907\n* September 28 - Founding of Bar-Giora an underground Zionist militia, in Jaffa.\n1908\n* First edition of Al-Karmil, an anti-Zionist newspaper, published in Haifa.\n1909\n* April 12 - founding of Hashomer, Zionist defence militia and precursor of the Hagana\n1910\n* The Fula affair: Elias Sursock sold 10,000 dunums around the village of al-Fula, the Palestinian peasants inhabiting the land petitioned the Ottoman government for assistance, but were ultimately unsuccessful and expelled by the Hashomer paramilitary group. This marks one of the first expulsions of Palestinians.\n1911\n* Muslim intellectuals and politicians from throughout the Levant formed al-Fatat (\"the Young Arab Society\"), a small Arab nationalist club in Paris. They also requested that Arab conscripts to the Ottoman army not be required to serve in non-Arab regions except in time of war. However, as the Ottoman authorities cracked down on the organization's activities and members, al-Fatat went underground and demanded the complete independence and unity of the Arab provinces.\n* January/February - The new Young Turk authorities allow Zionist groups to purchase land in Ottoman Syria.\n* January - First edition of the Arabic-language newspaper Filastin published in Jaffa.\n1913\n* Moshe Barsky falls victim to Arab Bedouin raiders, becoming the first Kibbutz movement member to be killed by Arab violence.\n1915\n*July 14 - First letter between the British Government and the Governor of Mecca. The exchange became known as the McMahon–Hussein Correspondence promises an Arab state in the Middle East in return for revolt against the Turks. That Palestine was part of this deal was confirmed during a 1918 War Cabinet meeting but later denied by the British government.\n1916\n*January 30 - Final letter of the McMahon–Hussein Correspondence sent to the Governor of Mecca.\n*May 16 - The Sykes–Picot Agreement was signed between Britain, France and Russia, in which it was agreed in the event of a successful conclusion of the war the former Ottoman lands incorporating very roughly, modern Iraq, Jordan and much of Israel, would be controlled by Britain; France would take control of what is today Lebanon, Syria, part of Turkey, part of northern Iraq, and a small section of northern Israel. Russia would take large areas of Eastern Turkey and Istanbul.\n*June 10 - Beginning of the Arab Revolt against the Young Turk regime in Constantinople.\n1917\n*November 2 - Balfour Declaration: British Foreign Secretary Arthur James Balfour sends a letter to Lord Rothschild, President of the Zionist Federation, declaring his government would \"view with favour the establishment in Palestine of a national home for the Jewish people\".\n*December 9 - Following an offensive lasting three weeks, an officer in the British Army accepts the surrender of Jerusalem from the town's mayor, Hussein al-Husayni.\n1918\n*April 14 - Zionist Commission arrives in Mandatory Palestine.\n*May 8 - First Muslim-Christian Association established in Jaffa.\n*September - General Allenby completes the British conquest of Palestine.\n*December 18 - the Palestine Land Development Company (PLDC) purchased 71,356 more dunams of land in the Jezreel Valley, including Tel Adashim, from Nagib and Albert Sursock of the Sursock family. The Ottomans had previously refused to authorize numerous sales, such that the Sursocks were unable to sell significant land to Jewish purchasers prior to World War I.\n1919\n*The American sponsored King–Crane Commission delivers its report to the Paris Peace Conference.\n*Haj Amin al-Husseini founded the Jerusalem branch of the Syrian-based 'Arab Club' (El-Nadi al-arabi), which then vied with the Nashashibi-sponsored 'Literary Club' (Al-Muntada al-Adabi) for influence over public opinion, and he soon became its president.\n* January 18 - Faisal–Weizmann Agreement between Emir Faisal (son of the King of Hejaz, Sharif of Mecca Sayyid Hussein bin Ali), and Chaim Weizmann (later President of the World Zionist Organization).\n* January 27 - First Palestine Arab Congress held in Jerusalem.\n* January 30 - The Supreme Council of the Peace Conference decided that the Ottoman Empire's Arab-dominated provinces would not be returned to Turkey.\n* February 3 - The Zionist Organisation submits its plan for implementation of the Balfour Declaration and urges the selection of Great Britain as Mandatory for Palestine.\nIntercommunal violence in Mandatory Palestine\n1920\n* With the promulgation of the first Land Transfer Ordinance, and the reopening of the land registries, the Ottoman restrictions on foreign purchase of lands in Palestine are completely done away with.\n* February 27 - Over one thousand protesters take part in an Arab nationalist demonstration in Jerusalem carrying banners bearing the slogans \"Stop Zionist Immigration\" and \"Our Country For Us\" – a reference to Aliyah, the Zionist immigration coming mostly from Eastern Europe. Meanwhile, Arab nationalists in Damascus are pushing for the establishment of Arab Greater Syria.\n* March 1 - Jewish settlements in the Upper Galilee were attacked by Arab forces as part of the Franco-Syrian War. Joseph Trumpeldor was among 8 who died defending Tel Hai.\n* March 7 - Faisal proclaimed king of the Arab Kingdom of Syria.\n* March 8 - A second large Arab nationalist demonstration takes place in Jerusalem.\n* April 4–7 - The 1920 Palestine riots – violent 4-day riot against the Jews in Jerusalem's Old City. al-Husseini was charged with inciting the Arab crowds with an inflammatory speech and sentenced by military court held in camera (private) to ten years imprisonment in absentia, since he had already violated his bail by fleeing to Transjordan to avoid arrest. Zionist leader Ze'ev Jabotinsky was sentenced to 15 years in prison for the possession of weapons.\n* May 31 - Second Palestine Arab Congress.\n* June 12 - Establishment of Haganah – a Jewish defense force.\n* July 1 - Herbert Samuel sworn in as first High Commissioner. He announces the establishment of an Advisory Council consisting of 20 members: 10 British officials, 4 Muslims, 3 Christians and 3 Jews.\n* July 1 - Palin Commission reports on the rioting that occurred in April.\n* December 4 - Third Palestine Arab Congress.\n1921\n* Between 1921 and 1925, 80,000 acres (320&nbsp;km2) of land in the Jezreel Valley is bought up by the American Zion Commonwealth (AZC) for about nearly three-quarters of a million pounds as part of the Sursock Purchases. Under British Mandate, the land laws were rewritten, and the Palestinian farmers in the region were deemed tenant farmers by the British authorities, and the rights of the new owners to displace its population is upheld. In total 1,746 families were displaced from 240,000 dunums of land; Despite this however, some of the native inhabitants refused to leave peaceably, and had to be expelled by force by the British colonial police.  The dispossessed would flee to shantytowns on the edges of Jaffa and Haifa.\n* David Ben-Gurion appointed secretary of the Jewish labour organisation Histadrut.\n* March - Haganah, the Jewish underground military organisation, established.\n* March 21 - Secretary of State for the Colonies, Winston Churchill, visits Jerusalem. Installs Abdullah Hussein as ruler of Transjordan.\n* May 1–7 - Jaffa riots resulted in the deaths of 47 Jews and 48 Arabs, with 146 Jews and 73 Arabs being wounded. Most Arab casualties resulted from clashes with British forces attempting to restore order. Thousands of Jewish residents of Jaffa fled for Tel Aviv and were temporarily housed in tent camps on the beach.\n* May 8 - The High Commissioner appoints Amin al-Husseini as Mufti of Jerusalem. al-Husseini turns from Damascus-oriented Pan-Arabism to a specifically Palestinian ideology centered on Jerusalem, which sought to block Jewish immigration to Mandatory Palestine. The frustration of pan-Arab aspirations lent an Islamic colour to the struggle for independence, and increasing resort to the idea of restoring the land to Dar al-Islam.\n* May - Fourth Palestine Arab Congress agrees to send a delegation to London.\n* October - The Haycraft Commission of Inquiry publishes its report into the Jaffa riots concluding that they were spontaneous rather than premeditated.\n* December - The Mandate authorities issue an order creating a Supreme Muslim Council to administer Muslim owned charitable properties, Awqaf, and appoint (or dismiss) judges and officials in the Sharia courts.\n1922\n* February - A delegation of Palestinian Arab leaders, led by Musa al-Husayni, informs Winston Churchill at the Colonial Office that they cannot accept the Mandate or the Balfour Declaration and demand their national independence.\n* June 3 - The Churchill White Paper, 1922 clarifies the British position regarding Mandatory Palestine.\n* June 30 - The United States Senate and House of Representatives adopt a joint resolution favouring \"the establishment in Palestine of a national home for the Jewish people.\"\n* July 24 - The League of Nations approves the draft British Mandate for Palestine.\n* August 10 - The British authorities announce the setting up of a Legislative Council consisting of 11 British official and 12 elected members: 8 Muslims, 2 Christians and 2 Jews.\n* August 22 - Fifth Palestine Arab Congress.\n* September 16 - The Council of the League of Nations accepts the British Transjordan memorandum defining the limits of Trans-Jordan and excluding that territory from the provisions in the Mandate concerning the Jewish national home.\n* October - First British census of the population of Mandatory Palestine.\n1923\n* Elections for the proposed Legislative Council fail due to the extent of the Palestinian Arab boycott. An attempt is made to expand the Advisory Council but this also fails when only three Palestinian Arabs could be found who were willing to join.\n* June 16 - Sixth Palestine Arab Congress.\n* September 29 - British Mandate for Palestine and Mandate for Syria and the Lebanon come into operation.\n* October 4 - Secretary of State for the Colonies, the Duke of Devonshire, proposes the setting up of an Arab Agency to have equivalent status to the Jewish Agency.\n* December 11 - Arab Agency unanimously rejected by Palestinian Arab leaders.\n1924\n* Collective Responsibility Ordinance issued giving powers of collective punishment in rural areas. Introduced to combat feuding between communities. The powers included application of fines and demolition of houses.\n1925\n* Zeev Jabotinsky founds the Revisionist Party in Paris committed to the establishment of a Jewish state in Palestine and Transjordan by military means.\n* August 25 - Herbert Onslow Plumer becomes High Commissioner.\n* November - General strike in support of the Syria revolt.\n* December 6 - Elections held for the second Jewish Assembly of Representatives.\n1926\n* British garrison in Mandatory Palestine reduced to one RAF squadron and 2 companies of armoured cars.\n* March - General strike called in protest of the visit of the French High Commissioner of Syria, Henry de Jouvenel. Great Syrian Revolt continued in neighbouring French Mandate.\n1928\n* Muslim Brotherhood formed in Egypt. Promoted Islam as the basis of society. Became politicized after 1938, rejecting Westernization, modernization, secularization.\n* June 20 - Seventh Palestine Arab Congress.\n* December 6 - Sir John Chancellor becomes High Commissioner.\n1929\n* The 1929 Palestine riots erupt due to a dispute between Muslims and Jews over access to the Western Wall. 133 Jews killed and 339 wounded; 116 Arabs killed and 232 wounded.\n**1929 Hebron massacre: 67 Jews are massacred by Arabs. Many incidents of rape, torture, and mutilation are reported.\n* Following the riots the British authorities agree to officially recognize the Executive Committee of the Palestine Arab Congress as representatives of Palestinian Arab opinion and to invite them to give evidence to the Commission of Inquiry.\n1930\n* A fourth Palestinian Arab Delegation travels to London.\n* The British enlarge their garrison in Mandatory Palestine: They have two infantry battalions, 2 RAF squadrons and 4 squadrons of armoured cars. The Palestine Police Force is re-organised by Sir Herbert Dowbiggin and isolated Jewish settlements are given arms caches to be used if under attack.\n* The Black Hand Islamist group, led by Syrian sheikh Izz ad-Din al-Qassam, begins a campaign against Jewish civilians and the British in Mandatory Palestine.\n* May 12 - The Palestinian Arab delegation announce that the British Government has rejected their demands for the end to Jewish immigration, an end to land sales to Jews and the establishing of a democratic government in Palestine.\n* August 6 - The Jewish Agency is officially recognized by the British Government.\n* October 20 - In reaction to the disturbances of 1929, the Passfield White Paper and the Hope Simpson Royal Commission recommend limiting Jewish immigration.\n* December - The International Wailing Wall Commission confirms Muslim property rights over the area.\n1931\n* Irgun Zvai Leumi (National Military Organisation) founded by the Revisionists with Zeev Jabotinsky as commander-in-chief.\n* January 5 - Elections held for the third Jewish Assembly of Representatives.\n* February 14 - Prime Minister Ramsay MacDonald sends a letter to Chaim Weizmann qualifying some of the proposals in the Passfield White Paper. The letter becomes known as the \"Black Letter\" amongst Palestinian Arabs.\n* April 11 - Three members of kibbutz Yagur were killed by members of a local Arab gang.\n* August - Demonstrations in Nablus against the storing of weapons in isolated Jewish settlements are broken up by police baton charges.\n* November 18 - Second British census of the population of Mandatory Palestine.\n* November 20 - Sir Arthur Wauchope becomes High Commissioner.\n* December 16 - The Mufti of Jerusalem, Amin al-Husseini, chairs a Muslim Congress in Jerusalem which is attended by 145 delegates from all parts of the Islamic world.\n1932\nThe Congress Executive of Nationalist Youth established.\n1933\n* The Nazi Party comes to power in Germany.\n* October 27 - Following the discovery in Jaffa harbour of a large shipment of weapons destined for an address in Tel Aviv the Arab Executive calls a general strike. A demonstration in Jaffa led by the president of the Executive, Musa al-Husayni, turns into a riot in which a crowd of several thousand attacked the small force of policemen, who responded with baton charges and gunfire. 26 demonstrators and one policeman were killed. Amongst the 187 injured was 80-year-old Musa al-Husayni, who never recovered and died the following year. There followed six weeks of rioting in all the major towns in which 24 civilians are killed. The disorders were suppressed by the police, not the army. They are different from earlier disturbances in that the targets were British Government institutions rather than Jews.\n* November 25 - All the major Palestinian Arab political parties, with the exception of Istiqlal, address a memo to the High Commissioner calling for democratic government, prohibition of the sale of Arab land to Jews, and the cessation of Jewish immigration.\n1934\n* February - Special commission of enquiry, chaired by Sir William Murison, publishes its report into the 1933 disturbances.\n* December 2 - The National Defence Party founded.\n1935\n* David Ben-Gurion becomes chairman of the Jewish Agency.\n* March 27 - Palestine Arab Party established.\n* June 23 - Reform Party established.\n* October 5 - National Bloc established.\n* October - The Revisionists quit the World Zionist Organization and establish the New Zionist Organisation.\n* November 20 - Izz ad-Din al-Qassam is killed by the British.\n1936\n* April 15 - Following the murder of 3 Jews in a robbery incident near Tulkarm, 2 Arabs are murdered near Petah Tikva.\n* April 17 - During the funeral in Tel Aviv of one of the Jewish victims serious rioting breaks out in which 3 Jews are murdered. The Mandate authorities bring in Emergency Regulations by proclamation and curfews are imposed across Mandatory Palestine.\n* April 20 - An Arab National Committee is formed in Nablus, subsequently other committees are formed in all the Arab towns and villages.\n* April 21 - Five main Palestinian Arab political parties call for a general strike.\n* April 25 - Arab Higher Committee established. It consists of members from all the Arab political parties, including Istiqlal and is led by Haj Amin al-Husseini. The committee calls for the strike to continue indefinitely.\n* May 6 - A meeting of the National Committees in Jerusalem announces a tax strike.\n* May 11 - British army reinforcements arrive from Egypt and Malta.\n* May/June - Jaffa port is closed, there are sporadic attacks on the railways and Jewish settlements. Armed bands appear in the hill country.\n* June 17 to 29 - large areas of Jaffa demolished by British Army.\n* August - Attempts by Amir Abdullah and Nuri Pasha fail to calm the situation in Mandatory Palestine. There is an increase in the number of attacks on Palestinian Jews, and on the oil pipeline and the railways. In mid-August Jewish acts of retaliation begin.\n* August 25 - Fawzi al-Qawuqji enters Mandatory Palestine with 150 volunteer Arab fighters.\nSeptember 7 - An additional division of British troops arrives. General Dill becomes supreme military commander.\n* September 22 - The British army launches an offensive against Arab rebels.\n* October 11 - Ibn Saud, Amir Abdullah and King Ghazi appeal to the Arab Higher Committee to call off the strike.\n* November - The Arab Higher Committee calls an end to the strike. Casualty figures taken from hospital records give the number of people killed during the six months of disturbances as: 195 Arabs, 80 Jews, 21 Army, 16 Police and Frontier Police, and 2 non-Arab Christians. In addition over 1,000 Arab rebels were killed.\n1937\n* The mainstream Jewish paramilitary organization, the Haganah, maintains an official policy of restraint.\n* July - The Peel Commission proposes a partition plan for Mandatory Palestine, rejected by the Arab leadership. The 2 main Jewish leaders, Chaim Weizmann and Ben Gurion had convinced the Zionist Congress to approve equivocally the Peel recommendations as a basis for more negotiation.\n* October 1 - British authorities ban all Arab nationalist political organisations, including the Arab Higher Committee. Much of the rebel Arab leadership is exiled. Mufti al-Husseini escapes to the Kingdom of Iraq.\n* November 14 -A breakaway group from the Haganah, the Irgun adopts a policy of retaliation and revenge involving the planting of bombs in crowded Arab areas.\n1938\n* April – August: The Woodhead Commission reverses the Peel Commission's findings, considers two alternative partition plans, known as Plan B (map) and Plan C (map), and reports in November that partition was impracticable.\n* October 2 - Tiberias massacre. Arab rioters kill 19 Jews, including 11 children, and set fire to synagogues and Jewish homes.\n1939\n* February – March 17 - The St. James Conference ends without reaching an agreement.\n* May 17 - The White Paper of 1939 calls for the creation of a unified Palestinian state. Even though the White Paper states its commitment to the Balfour Declaration, it imposed very substantial limits to both Jewish immigration (restricting it to only 75,000 over the next 5 years), and Jewish ability to purchase land.\n* June 19 - Twenty Arabs were killed by Jews who mounted explosives on a donkey at a marketplace in Haifa.\n* June 29 - Thirteen Arabs were killed in multiple shootings during a one-hour period.\n* September 1 - The Second World War erupts. The Haganah begins the smuggling of Jews from Europe to Mandatory Palestine to provide refuge from the Holocaust. Arab leaders are split: while some assist the Allies, others like Iraqi Rashid Ali and the Iraqi-based Palestinian Amin al-Husseini assist the Axis. Many of the Middle Eastern Jewish communities are hit by pro-Axis Arab regimes, and the early stage of Jewish exodus from Arab countries begins. Most Jewish and Arab Palestinian militant groups attain the policy of cease fire with each other and with the British.\n1940\n* Lehi (also known as the Stern Gang) – the most radical Jewish organization splits from Irgun.\n1941\n* October 11 - The exiled Arab Palestinian leader Haj Amin al-Husseini arrives in Rome with an attempt to form close ties with the Axis powers. al-Husseini meets Benito Mussolini.\n* November 27 -  al-Husseini arrives in Germany for a meeting with Adolf Hitler. He would remain in Berlin until the end of the war, playing a major role in formation of Muslim Waffen SS units and active work preventing thousands of Jewish refugees to escape the Nazis and reach Palestine.\n1942\n* Biltmore Conference, New York - for the first time, Zionists call for an independent state instead of a national home - cannot rely on Britain.\n* February 12 - Avraham Stern leader of the extremist Lehi group shot dead by British police whilst being arrested.\n* August 2 - British form the Palestine Regiment, consisted of 3 Jewish and 1 Arab battalions, which assist the British forces in North Africa against the Axis.\n1944\n* February 12 - After a period of reconciliation with the British, the Irgun launches a bomb attack on British immigration offices in Mandatory Palestine, no casualties reported. Soon after Lehi also renews its anti-British attacks.\n* October - Operation ATLAS. A joint German-Arab commando unit of 5 men, under the auspices of the Palestinian Arab leader Amin al-Husseini, was dispatched to disseminate violence between Jews and Arabs in Mandatory Palestine. The parachutists' team members were caught, after they were rebuffed by the local Palestinian population, near Jericho by Jordanian and British Police forces.\n* Irgun resumes operations against the British, after realizing the World War II is nearing its end; it still restrains itself of attacking British military, not to impact the war efforts of the allies.\n* November 6 - Minister-Resident for the Middle East, Walter Guinness assassinated by Lehi.\n* November - the Palestine Regiment is reformed into the larger unit named the Jewish Brigade, which utilizes Jewish symbols. It participates in invasion of the Allies into Italy.\n1945\n* May 8 - Nazi Germany surrendered to the Allies. Haj Amin al-Husseini is imprisoned by the French, but eventually escapes to Egypt.\n* Arab League formed to strengthen political, cultural, social, and economic goals of members, and to mediate disputes.  Later added military defense coordination.\n1946\n* May 1 - The Anglo-American Committee of Inquiry proposed admission of 100,000 Jewish refugees into the Mandate.\n* July 22 - King David Hotel blown up by Irgun. 91 people of various nationalities were killed, and 46 were injured.\n1947\n* February 18 - Great Britain announces intention to hand the Mandate to the United Nations.\n* March 1–17 - Martial law is imposed after IZL and LHI launched large scale attacks against British targets. Twenty British personnel were killed on the 1 March. In total, 15 British soldiers and 15 civilians were killed and 60 British soldiers and 30 civilians were wounded from 1 March to 13 March.\n* May 15 - United Nations Special Committee on Palestine (UNSCOP) is created.\n* September 3 - The majority of the members of UNSCOP, in Chapter VI of its report to UNGA, proposes the partition of Palestine into \"an independent Arab State, an independent Jewish State, and the City of Jerusalem\".\n* November 19 - the Shubaki family assassination - the Lehi execute five members of the Shubaki family, having suspected one of the family to have been an informant for the British police\n* November 29 - With a two-thirds majority vote, the UN General Assembly adopts a resolution recommending the adoption and implementation of a plan to partition the British Mandate of Palestine into \"Independent Arab and Jewish States\" and a \"Special International Regime for the City of Jerusalem\" administered by the United Nations.\n*November 30 - Following the vote on the Partition Plan, Palestinian Arabs react violently and fighting broke out in what became known as the \"Civil war\".\n*November 30 - the Fajja bus attacks\n*December 2–5 - 1947 Jerusalem riots. The Arab Higher Committee declared a strike and public protest of the vote. Arabs marching to Zion Square on December 2 were stopped by the British, and the Arabs instead turned towards the commercial center of the City where many buildings and shops were attacked. Violence continued for two more days, with Arabs and Jewish attacking each other. 70 Jews and 50 Arabs are killed.\n*December 30 - Haifa Oil Refinery massacre. Irgun militants hurl two bombs into a crowd of Arab workers from a passing vehicle, killing 6 workers and wounding 42, damaging the relative peace between the two groups in Haifa. Later that day the Arab crowd protested and broke into the refinery compound, killing 39 Jews and wounding 49. Skirmishes continued in Haifa and around the region.\n*December 31 - January 1 - Balad al-Shaykh massacre. The Palmach, an arm of the Haganah, attacked the town while the residents were asleep, firing from the slopes of Mount Carmel, in retaliation for the killing of 39 Jews during the Haifa Oil Refinery massacre the day before, 30 December 1947.\n1948\n*January 4 -  Lehi set off a truck bomb outside Jaffa's Town Hall, killing 26 civilians.\n*January 6 - Semiramis Hotel bombing carried out by Haganah.\n*January 16 - 35 members of the Haganah killed attempting to carry supplies across country to Kfar Etzion.\n*Winter and Spring - \"Battle of the Roads\". The Arab League sponsored Arab Liberation Army, composed of Palestinian Arabs and Arabs from other Middle Eastern countries, attacked Jewish communities in Mandatory Palestine, and Jewish traffic on major roads.\n*February 14 - 60 Arab villagers are killed by Palmach at Sa'sa'. Palmach sources report a battle with major casualties.\n*February 22 - In an operation organized by Abd al-Qadir al-Husayni with the help of British deserters, bombs placed in stolen British vehicles were exploded beside the Atlantic and Amdursky Hotels in Ben Yehuda Street, Jerusalem, which housed Palmach troops.  However the troops were away on operations and almost all of the 58 dead and 32 seriously wounded were civilians.  During the following week, Irgun and Lehi fighters killed 44 British troops and police in revenge.\n*By late March 1948, the vital road that connected Tel Aviv to western Jerusalem, where about 16% of all Jews in the Mandatory Palestine lived, was cut off and under siege.\n*March 27 - 47 members of a Haganah convoy killed near the village of al-Kabri.\n*April 6 - Operation Nachshon. The Haganah decided to launch a major military counteroffensive to break the siege of Jerusalem. On April 6 the Haganah and its strike force, the Palmach, in an offensive to secure strategic points, took al-Qastal, an important roadside town 2 kilometers west of Deir Yassin.\n*April 9 - Deir Yassin massacre. Around 120 fighters from Irgun and Lehi Zionist paramilitary groups attacked Deir Yassin near Jerusalem, a Palestinian Arab village of roughly 600 people. The assault occurred as Jewish militia sought to relieve Arab siege of Jews in Jerusalem. Around 107 villagers were killed during and after the battle for the village, including women and children—some were shot, while others died when hand grenades were thrown into their homes. 4 among the Irgun and Lehi forces were killed too.\n*April 13 - Hadassah medical convoy massacre. Claimed as retribution for the Deir Yassin massacre, Arab protesters attack a large convoy, mostly of unarmed Jewish doctors, and some military personnel set off carrying patients, equipment, and supplies, travel from Jerusalem to the besieged hospital which treated the majority of Jewish residents in Jerusalem. 79 Jews are killed. Road attacks continue and convoys were unable to reach the hospital for a week.\n*April 22 - Operation Yiftach launched, leading to the conquest of northeastern Galilee between the Lebanese and Syrian frontiers.\n*April 23 - Arab quarters of Haifa taken by the Haganah.\n*May 13 - Kfar Etzion massacre was an act committed by Arab forces, after the surrender of the Jewish village to Arab Legion. Out of 133 Jewish villagers and defenders, 129 were murdered in the massacre, 4 survived. Bodies were left unburied until January 1949. 320 prisoners from the Etzion settlements were taken to the \"Jordan POW camp at Mafrak\", including 85 women.\n*September 17 - United Nations Mediator in Palestine, Folke Bernadotte, assassinated by Lehi.\nAftermath\nReferences"
    }
  ]
}