{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 1998 Atlantic hurricane season\n\nThe 1998 Atlantic hurricane season was an event in the annual tropical cyclone season in the north Atlantic Ocean. This Atlantic hurricane season saw an above-average number of named tropical storms,|group=\"nb\"}} and included a single-day record for number of hurricanes simultaneously in progress, with four active on September&nbsp;25: Georges, Ivan, Jeanne and Karl. The season officially began on June&nbsp;1, 1998 and ended on November&nbsp;30, 1998. These dates, adopted by convention, historically describe the period in each year when most tropical systems form. Even so, this season's first storm, Tropical Storm Alex, did not form until July&nbsp;27, while its last, Hurricane Nicole, dissipated on December&nbsp;1.\nAltogether, 14 tropical storms formed during the season, including 10 hurricanes of which three intensified into major hurricanes.) and higher on the 5-level Saffir–Simpson wind speed scale are considered major hurricanes.|group=\"nb\"}} Ten of these storms formed during a five week period at the height of the season, August&nbsp;19 – September&nbsp;23. The two most significant storms of the season, in terms of loss of life and damage, were hurricanes Georges and Mitch. Georges moved from the Caribbean Sea to the Gulf of Mexico and ultimately to the United States Gulf Coast, resulting extensive damage and a large number of fatalities, especially in Haiti and the Dominican Republic. Mitch formed over the southwestern Caribbean Sea and then moved slowly over Central America, causing catastrophic flooding and leaving more than 11,000 people dead, making it the second deadliest Atlantic hurricane in history after the Great Hurricane of 1780. Following the 1998 season, the names Georges and Mitch were retired from reuse in the North Atlantic by the World Meteorological Organization.\nThis timeline documents tropical cyclone formations, strengthening, weakening, landfalls, extratropical transitions, and dissipations during the season. It includes information that was not released throughout the season, meaning that data from post-storm reviews by the National Hurricane Center, such as a storm that was not initially warned upon, has been included.\nBy convention, meteorologists use one time zone when issuing forecasts and making observations: Coordinated Universal Time (UTC), and also use the 24-hour clock (where 00:00 = midnight UTC). In this time line, all information is listed by UTC first with the respective local time included in parentheses.\nTimeline\nJune\nJune 1\n* The 1998 Atlantic hurricane season officially begins.\nJuly\nat peak intensity on July&nbsp;31|alt=Satellite image of the relatively weak Tropical Storm Alex]]\nJuly 27\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Depression One develops from a tropical wave about  south-southwest of Cape Verde.\nJuly 29\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, July&nbsp;28)Tropical Depression One strengthens and becomes Tropical Storm Alex.\nJuly 31\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, July&nbsp;30)Tropical Storm Alex attains its peak intensity east of the Lesser Antilles with maximum sustained winds of 50&nbsp;mph (85&nbsp;km/h) and a minimum barometric pressure of .\nAugust\nAugust 2\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Alex weakens to a tropical depression and later dissipates northeast of Saint Martin.\nAugust 19\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Depression Two develops from a tropical wave while located several hundred miles east of the Leeward Islands.\nAugust 20\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Depression Two strengthens and becomes Tropical Storm Bonnie about  east of the northern Leeward Islands.\nAugust 21\n*06:00&nbsp;UTC (1:00&nbsp;a.m. CDT)Tropical Depression Three develops in the Gulf of Mexico about 315&nbsp;miles (505&nbsp;km) southeast of the south Texas coast.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Depression Three strengthens and becomes Tropical Storm Charley about  east of Brownsville, Texas.\nAugust 22\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, August&nbsp;21)Tropical Storm Bonnie attains Category&nbsp;1 hurricane strength about 240&nbsp;mi (385&nbsp;km) east of Turks Island.\n*06:00&nbsp;UTC (1:00&nbsp;a.m. CDT)Tropical Storm Charley attains its peak intensity with maximum sustained winds of 70&nbsp;mph (110&nbsp;km/h) and a minimum barometric pressure of .\n*10:00&nbsp;UTC (5:00&nbsp;a.m. CDT)Tropical Storm Charley makes landfall near Port Aransas, Texas with winds of 45&nbsp;mph (70&nbsp;km/h).\n*18:00&nbsp;UTC (2:00&nbsp;p.m. EDT)Hurricane Bonnie strengthens to a Category&nbsp;2 hurricane north-northeast of Turk Island.\n*15:00&nbsp;UTC (10:00&nbsp;a.m. CDT)Tropical Storm Charley weakens to a tropical depression about  north of Alice International Airport Texas), and subsequently dissipates.\nAugust 23\n*12:00&nbsp;UTC (8:00&nbsp;a.m. EDT)Hurricane Bonnie strengthens to a Category&nbsp;3 hurricane about  east of San Salvador Island, Bahamas.\nnear peak intensity on August&nbsp;24]]\nAugust 24\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;23)Hurricane Bonnie attains its peak intensity with maximum sustained winds of 115&nbsp;mph (185&nbsp;km/h) and a minimum barometric pressure of .\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Tropical Depression Four develops from a tropical wave while located about  west-southwest of Cape Verde.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Depression Four strengthens east of the Lesser Antilles and becomes Tropical Storm Danielle.\nAugust 25\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Storm Danielle strengthens to a Category&nbsp;1 hurricane.\nAugust 26\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Danielle strengthens to a Category&nbsp;2 hurricane about  east of the Leeward Islands, and simultaneously attains its maximum sustained wind speed of 105&nbsp;mph (165&nbsp;km/h).\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Danielle weakens to a Category&nbsp;1 hurricane.\n]]\nAugust 27\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;26)Hurricane Bonnie weakens to a Category&nbsp;2 hurricane.\n*04:00&nbsp;UTC (12:00&nbsp;a.m. EDT)Hurricane Bonnie makes landfall near Wilmington, North Carolina with winds of 110&nbsp;mph (175&nbsp;km/h).\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Danielle restrengthens to a Category&nbsp;2 hurricane.\n*12:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Danielle again attains its maximum sustained winds of 105&nbsp;mph (165&nbsp;km/h).\n*12:00&nbsp;UTC (8&nbsp;a.m. EDT)Hurricane Bonnie weakens to a Category&nbsp;1 hurricane over land near New Bern, North Carolina.\n*17:00&nbsp;UTC (1&nbsp;p.m. EDT)Hurricane Bonnie weakens to a tropical storm over land about  south-southeast of Elizabeth City, North Carolina.\nAugust 28\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;27)Tropical Storm Bonnie restrengthens to a Category&nbsp;1 hurricane as it moves off the coast and over the Outer Banks near Manteo, North Carolina.\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, August&nbsp;27)Hurricane Danielle weakens to a Category&nbsp;1 hurricane while well to the north of the Leeward Islands.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. EDT)Hurricane Bonnie weakens to a tropical storm about  east-southeast of Wallops Island, Virginia.\nAugust 30\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Bonnie transitions into an extratropical cyclone south-southeast of Cape Race, Newfoundland and is subsequently absorbed by a front.\nAugust 31\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Hurricane Danielle restrengthens to a Category&nbsp;2 hurricane and simultaneously attains its maximum sustained wind speed of 105&nbsp;mph (165&nbsp;km/h) while northeast of Great Abaco Island, Bahamas.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Tropical Depression Five develops from a tropical wave in the Gulf of Mexico roughly halfway between Mérida, Yucatán and Tampico, Tamaulipas.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Depression Five strengthens and becomes Tropical Storm Earl about  south-southwest of New Orleans, Louisiana.\nSeptember\nSeptember 2\nnear peak intensity on September&nbsp;2|alt=Satellite image of Hurricane Earl, a somewhat disorganized tropical cyclone in the northeastern Gulf of Mexico]]\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Danielle weakens to a Category&nbsp;1 hurricane.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Tropical Storm Earl strengthens into a Category&nbsp;1 hurricane about  south-southeast of New Orleans.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Hurricane Earl strengthens into a Category&nbsp;2 hurricane and simultaneously attains its maximum sustained wind speed of 100&nbsp;mph (155&nbsp;km/h).\nSeptember 3\n*00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, September&nbsp;2)Hurricane Earl attains its minimum barometric pressure of  as it weakens slightly to a Category&nbsp;1 hurricane.\n*06:00&nbsp;UTC (1:00&nbsp;a.m. CDT)Hurricane Earl makes landfall near Panama City, Florida with winds of 80&nbsp;mph (130&nbsp;km/h).\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Danielle attains its minimum barometric pressure of .\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Hurricane Earl weakens to a tropical storm over land about  south of Albany, Georgia.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Storm Earl transitions into an extratropical cyclone over central Georgia, and subsequently, after moving northeastward away from the U.S. southeast coast and then crossing over Newfoundland, is absorbed by the extratropical cyclone that was Hurricane Danielle.\nSeptember 4\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;3)Hurricane Danielle transitions into an extratropical cyclone while centered 230&nbsp;miles (370&nbsp;km) south of Cape Race, Newfoundland and subsequently merges with another extratropical low.\nSeptember 8\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Depression Six develops from a broad area of low pressure while located about  east-southeast of Brownsville, Texas.\nSeptember 9\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Depression Six strengthens and becomes Tropical Storm Frances.\nSeptember 11\n*00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, September&nbsp;10)Tropical Storm Frances attains its maximum sustained wind speed of 65&nbsp;mph (100&nbsp;km/h).\n*06:00&nbsp;UTC (1:00&nbsp;a.m. CDT)Tropical Storm Frances attains its minimum pressure of  and simultaneously makes landfall just north of Corpus Christi, Texas with winds of 50&nbsp;mph (85&nbsp;km/h).\nSeptember 12\n*00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, September&nbsp;11)Tropical Storm Frances weakens to a tropical depression about  northeast of Victoria, Texas.\nSeptember 13\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Depression Frances degenerates into a remnant low pressure center over North Texas.\nSeptember 15\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Depression Seven develops from a tropical wave while located about  south-southwest of Cape Verde.\nSeptember 16\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Depression Seven strengthens into Tropical Storm Georges about  west-southwest of the Cape Verde Islands.\nSeptember 17\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Tropical Depression Eight develops from a tropical wave while located in the north-central Gulf of Mexico.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Georges strengthens into a Category&nbsp;1 hurricane east of the Lesser Antilles.\nSeptember 18\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Hurricane Georges strengthens into a Category&nbsp;2 hurricane.\nat peak intensity as a high-end Category&nbsp;4 hurricane on September&nbsp;19|alt=Satellite image of Hurricane Georges, a strong tropical cyclone, near peak intensity]]\nSeptember 19\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;18)Tropical Depression Nine develops from a tropical wave while located about  southwest of Cape Verde.\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Hurricane Georges strengthens into a Category&nbsp;3 hurricane about  east of the Lesser Antilles.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Tropical Depression Eight strengthens into Tropical Storm Hermine.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Georges strengthens into a Category&nbsp;4 hurricane.\nSeptember 20\n*00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, September 19)Tropical Storm Hermine attains its peak intensity with maximum sustained winds of 45&nbsp;mph (75&nbsp;km/h) and a minimum barometric pressure of .\n*05:00&nbsp;UTC (12:00&nbsp;a.m. CDT)Tropical Storm Hermine makes landfall near Cocodrie, Louisiana with winds of 40&nbsp;mph (65&nbsp;km/h).\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Georges attains its peak intensity about  east of Guadeloupe with winds of 155&nbsp;mph (250&nbsp;km/h) and a minimum pressure of .\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Tropical Storm Hermine weakens to a tropical depression about  northwest of New Orleans, Louisiana.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Depression Nine strengthens into Tropical Storm Ivan west of the Cape Verde Islands.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. CDT)Tropical Depression Hermine dissipates over southeastern Mississippi.\n|alt=Storm path of Hurricane Jeanne. It starts near the west coast of Africa and curves in a wide half-circle course in the eastern Atlantic, with the storm becoming extratropical near the Azores]]\nSeptember 21\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September 20)Hurricane Georges weakens to a Category&nbsp;3 hurricane about  east-southeast of Antigua.\n*04:00&nbsp;UTC (12:00&nbsp;a.m. AST)Hurricane Georges makes landfall near Falmouth, Antigua with winds of 115&nbsp;mph (185&nbsp;km/h).\n*06:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Depression Ten develops from a tropical wave while located about  southwest of the coast of Guinea-Bissau.\n*08:00&nbsp;UTC (4:00&nbsp;a.m. AST)Hurricane Georges makes landfall near Basseterre, St. Kitts with winds of 115&nbsp;mph (185&nbsp;km/h).\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Depression Ten strengthens into Tropical Storm Jeanne.\n*22:00&nbsp;UTC (6:00&nbsp;p.m. AST)Hurricane Georges makes landfall near Fajardo, Puerto Rico with winds of 115&nbsp;mph (185&nbsp;km/h).\nSeptember 22\n*05:00&nbsp;UTC (1:00&nbsp;a.m. AST)Hurricane Georges moves off shore over Mona Passage about  west-southwest of Mayagüez, Puerto Rico as a Category&nbsp;2 hurricane.\n*12:30&nbsp;UTC (8:30&nbsp;a.m. AST)Hurricane Georges restrengthens to a Category&nbsp;3 hurricane and makes landfall about  east of Santo Domingo, Dominican Republic with winds of 120&nbsp;mph (195&nbsp;km/h).\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST) Hurricane Georges weakens to a Category&nbsp;2 hurricane over land just north of Santo Domingo.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Jeanne strengthens into a Category&nbsp;1 hurricane about  southwest of the Cape Verde Islands.\nSeptember 23\n*09:00&nbsp;UTC (5:00&nbsp;a.m. EDT)Hurricane Georges emerges over the waters of the Windward Passage west of Gonaïves, Haiti as a Category&nbsp;1 hurricane.\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Depression Eleven develops from a low pressure area while located about  west-northwest of Bermuda.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Ivan strengthens into a Category&nbsp;1 hurricane southwest of the Azores.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Jeanne strengthens into a Category&nbsp;2 hurricane west of the Cape Verde Islands..\n*21:30&nbsp;UTC (5:30&nbsp;p.m. AST)Hurricane Georges makes landfall about  east of Guantanamo Bay, Cuba with winds of 75&nbsp;mph (120&nbsp;km/h).\nSeptember 24\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;23)Tropical Depression Eleven strengthens into Tropical Storm Karl northeast of Bermuda.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. EDT)Hurricane Georges emerges into the Straits of Florida near Cayo Coco along the north coast of Cuba as a Category&nbsp;1 hurricane.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Jeanne attains its peak intensity  west of the westernmost Cape Verde Islands with maximum sustained winds of 105&nbsp;mph (170&nbsp;km/h) and a minimum barometric pressure of .\nSeptember 25\n*06:00&nbsp;UTC (2:00&nbsp;a.m. EDT)Hurricane Georges restrengthens to a Category&nbsp;2 hurricane southeast of Key West, Florida.\n*12:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Karl strengthens into a Category&nbsp;1 hurricane west-southwest of the Azores.\n*15:30&nbsp;UTC (11:30&nbsp;a.m. EDT)Hurricane Georges makes landfall on Key West with winds of 105&nbsp;mph (165&nbsp;km/h).\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Jeanne weakens to a Category&nbsp;1 hurricane west of the Cape Verde Islands.\nSeptember 26\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Hurricane Ivan attains its peak intensity about  west of the Azores Islands with maximum sustained winds of 90&nbsp;mph (150&nbsp;km/h) and a minimum barometric pressure of .\nSeptember 27\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;26)Hurricane Ivan weakens to a tropical storm northwest of Lajes, Azores Islands.\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;26)Hurricane Karl strengthens into a Category&nbsp;2 hurricane and simultaneously attains its peak intensity about  east-northeast of Bermuda with maximum sustained winds of 105&nbsp;mph (170&nbsp;km/h) and a minimum barometric pressure of .\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Tropical Storm Ivan transitions into an extratropical cyclone north of the Azores.\n*12:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Karl weakens to a Category&nbsp;1 hurricane west of the Azores.\nSeptember 28\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, September&nbsp;27)Hurricane Karl weakens to a tropical storm  west-northwest of the Western Azores.\n*06:00&nbsp;UTC (2&nbsp;a.m. AST)Tropical Storm Karl transitions into an extratropical cyclone.\n*11:30&nbsp;UTC (6:30&nbsp;a.m. CDT)Hurricane Georges makes landfall in Biloxi, Mississippi with winds of 105&nbsp;mph (165&nbsp;km/h).\n*18:00&nbsp;UTC (1&nbsp;p.m. CDT)Hurricane Georges weakens to a Category&nbsp;1 hurricane just north of Biloxi.\nSeptember 29\n*00:00&nbsp;UTC (7:00&nbsp;p.m. CDT, September&nbsp;28)Hurricane Georges weakens to a tropical storm about  north of Biloxi.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. CDT)Tropical Storm Georges weakens to a tropical depression about  north-northeast of Mobile, Alabama.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Hurricane Jeanne weakens to a tropical storm west-southwest of the Azores.\nSeptember 30\n*21:00&nbsp;UTC (5:00&nbsp;p.m. AST)Tropical Storm Jeanne weakens to a tropical depression about  south of Horta, Azores.\nOctober\nOctober 1\n*0600&nbsp;UTC (2:00&nbsp;a.m. AST)Tropical Depression Jeanne transitions into an extratropical cyclone east of the Central Azores and subsequently dissipates.\n*12:00&nbsp;UTC (8:00&nbsp;a.m. EDT)Tropical Depression Georges dissipates over the Atlantic coast near Jacksonville, Florida.\n|alt=1998 storm path of Hurricane Lisa in the eastern Atlantic Ocean]]\nOctober 5\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, October&nbsp;4)Tropical Depression Twelve develops from a tropical wave while located about halfway between Cape Verde and the Lesser Antilles.\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Tropical Depression Twelve strengthens into Tropical Storm Lisa.\nOctober 9\n*12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Tropical Storm Lisa strengthens into a Category&nbsp;1 hurricane and simultaneously attains its peak intensity with maximum sustained winds of 75&nbsp;mph (120&nbsp;km/h) and a minimum barometric pressure of .\n*21:00&nbsp;UTC (5:00&nbsp;p.m. AST)Hurricane Lisa becoming extratropical about  northwest of the Western Azores, and later merges with an extratropical frontal system.\nOctober 22\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, October&nbsp;21)Tropical Depression Thirteen develops from a tropical wave while located about 415&nbsp;miles (660&nbsp;km) south of Kingston, Jamaica.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. EDT)Tropical Depression Thirteen strengthens and becomes Tropical Storm Mitch about 260&nbsp;miles (420&nbsp;km) east-southeast of San Andrés Island, Colombia.\nOctober 24\n*06:00&nbsp;UTC (2:00&nbsp;a.m. EDT)Tropical Storm Mitch strengthens into a Category&nbsp;1 hurricane about 295&nbsp;miles (475&nbsp;km) south-southwest of Kingston, Jamaica.\n*18:00&nbsp;UTC (2:00&nbsp;p.m. EDT)Hurricane Mitch strengthens into a Category&nbsp;2 hurricane about 215&nbsp;miles (345&nbsp;km) south-southwest of Kingston.\nshortly after peak intensity as a powerful Category&nbsp;5 hurricane on October&nbsp;26|alt=Satellite image of Hurricane Mitch as a Category 5 hurricane in the western Caribbean Sea]]\nOctober 25\n*00:00&nbsp;UTC (8:00&nbsp;p.m. EDT, October&nbsp;24)Hurricane Mitch strengthens into a Category&nbsp;3 hurricane.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. EST)Hurricane Mitch strengthens into a Category&nbsp;4 hurricane.\nOctober 26\n*12:00&nbsp;UTC (7:00&nbsp;a.m. EST)Hurricane Mitch strengthens into a Category&nbsp;5 hurricane.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. EST)Hurricane Mitch attains its peak intensity about 60&nbsp;miles (97&nbsp;km) southeast of Great Swan Island, Honduras, with sustained winds of 180&nbsp;mph (285&nbsp;km/h) and a minimum pressure of .\nOctober 28\n*06:00&nbsp;UTC (1:00&nbsp;a.m. EST)Hurricane Mitch weakens to a Category&nbsp;4 hurricane very near the island of Guanaja and about 35&nbsp;miles (55&nbsp;km) north of the coast of mainland Honduras.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. EST)Hurricane Mitch weakens to a Category&nbsp;3 hurricane while meandering east-southeast of Guanaja.\nOctober 29\n*00:00&nbsp;UTC (7:00&nbsp;p.m. EST, October&nbsp;28)Hurricane Mitch weakens to a Category&nbsp;2 hurricane about  east of the island of Roatán and about  north of the coast of Honduras.\n*06:00&nbsp;UTC (1:00&nbsp;a.m. EST)Hurricane Mitch weakens to a Category&nbsp;1 hurricane while remaining virtually stationary east of Roatán.\n*12:00&nbsp;UTC (7:00&nbsp;a.m. EST)Hurricane Mitch makes landfall on the mainland coast of Honduras about  east of La Ceiba with sustained winds of 80&nbsp;mph (130&nbsp;km/h).\n*18:00&nbsp;UTC (1:00&nbsp;p.m. EST) Hurricane Mitch weakens to a tropical storm along the coast near Limón.\nOctober 31\n*15:00&nbsp;UTC (9:00&nbsp;a.m. CST)Tropical Storm Mitch weakens to a tropical depression inland about  south of Santa Rosa de Copán, Honduras.\nNovember\nNovember 1\n*21:00&nbsp;UTC (3:00&nbsp;p.m. CST, November&nbsp;1)Tropical Depression Mitch dissipates into an area of low pressure near Tapachula, Chiapas along the Guatemala–Mexico border.\nNovember 3\n*18:00&nbsp;UTC (12:00&nbsp;p.m. CST) The area of low pressure re-generated into Tropical Storm Mitch after emerging into the Bay of Campeche.\nto the southwest of the Azores on November&nbsp;30|alt=Satellite image of Hurricane Nicole, a moderate Category 1 hurricane]]\nNovember 4\n*02:00&nbsp;UTC (8:00&nbsp;p.m. CST, November&nbsp;3)Tropical Storm Mitch makes landfall about  north-northeast of Campeche, Campeche with winds of 40&nbsp;mph (65&nbsp;km/h).\n*06:00&nbsp;UTC (12:00&nbsp;a.m. CST)Tropical Storm Mitch weakens to a tropical depression over the Yucatán Peninsula.\n*12:00&nbsp;UTC (6:00&nbsp;a.m. CST)Tropical Depression Mitch re-strengthens into a tropical storm after emerging into the Gulf of Mexico.\nNovember 5\n*11:00&nbsp;UTC (6:00&nbsp;a.m. EST)Tropical Storm Mitch makes landfall about  west of Naples, Florida with winds of 65&nbsp;mph (100&nbsp;km/h).\n*15:00&nbsp;UTC (10:00&nbsp;a.m. EST)Tropical Storm Mitch nears the east coast of Florida just north of Jupiter.\n*18:00&nbsp;UTC (1:00&nbsp;p.m. EST)Tropical Storm Mitch transitions into an extratropical cyclone about  north of Grand Bahama Island, Bahamas.\nNovember 24\n*00:00&nbsp;UTC (8:00&nbsp;p.m. AST, November&nbsp;23)Tropical Depression Fourteen develops from a strong frontal low pressure area near the Canary Islands.\n*06:00&nbsp;UTC (2:00&nbsp;a.m. AST)Tropical Depression Fourteen strengthens into Tropical Storm Nicole.\nNovember 26\n*09:00&nbsp;UTC (5:00&nbsp;a.m. AST)Tropical Storm Nicole weakens to a tropical depression about  west-southwest of La Palma, Canary Islands.\nNovember 27\n*18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Depression Nicole re-strengthens into a tropical storm about  west-southwest of the Canary Islands.\nNovember 30\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, November&nbsp;29)Tropical Storm Nicole strengthens into a Category&nbsp;1 hurricane southwest of the Azores.\n* The 1998 Atlantic hurricane season officially ends.\nDecember\nDecember 1\n* 00:00&nbsp;UTC (8:00&nbsp;p.m. AST, November&nbsp;30)Hurricane Nicole attains its peak intensity with maximum sustained winds of 85&nbsp;mph (140&nbsp;km/h) and a minimum barometric pressure of .\n* 12:00&nbsp;UTC (8:00&nbsp;a.m. AST)Hurricane Nicole weakens to a tropical storm.\n* 18:00&nbsp;UTC (2:00&nbsp;p.m. AST)Tropical Storm Nicole transitions into an extratropical cyclone northwest of the Azores.\nSee also\n* Lists of Atlantic hurricanes\nNotes\nReferences\nFurther reading\n*\nExternal links\n* [https://www.nhc.noaa.gov/archive/1998/ 1998 Tropical Cyclone Advisory Archive], National Hurricane Center and Central Pacific Hurricane Center"
    }
  ]
}