{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Halifax, Nova Scotia history\n\nThis timeline of the history of the Halifax Regional Municipality documents all events that had happened in Halifax, Nova Scotia, Canada, including historical events in the former city of Dartmouth, the Town of Bedford and Halifax County. Events date back to the early 18th century and continue until the present in chronological order.\nIn this timeline, the name Halifax refers to former city of Halifax in events listed before 1996.\n18th century\n*1713 – The Treaty of Utrecht.\n*1713–1749 – Between the Treaty of Utrecht in 1713 and 1749, no serious attempts were made by Great Britain to colonise Nova Scotia, aside from its presence at Annapolis Royal and infrequent sea and land patrols.\n*1717 – France began a 20-year effort to build a large fortified seaport at Louisbourg on present-day Cape Breton Island which was intended as a naval base for protecting the entrance to the Gulf of St. Lawrence and extensive fishing grounds on the Grand Banks.\n*1745 – Fortress of Louisbourg fell to a New England-led force.\n*1746 – Admiral Jean-Batiste, De Roye de la Rochefoucauld, Duc d'Anville, was dispatched by the King of France in command of the Duc d’Anville Expedition. He was dispatched to undermine the English position in the new world, specifically at Louisbourg, Annapolis Royal, and most likely the eastern seaboard of the Thirteen Colonies.\n*1749 – Halifax was founded on June 21 and shortly after Father Le Loutre's War begins with Mi'kmaq Raid on Dartmouth (1749)\n* 1749 - Fort Sackville established\n*1750 – Halifax Farmers' Market founded.\n*1750 – Dartmouth founded, raids on Dartmouth, raids on Halifax (see Father Le Loutre's War)\n*1751 - Raid on Dartmouth (1751); raids on Halifax (see Father Le Loutre's War)\n*1752 – Halifax Gazette founded.\n*1753 - Mi'kmaq raid on Halifax (see Father Le Loutre's War)\n*1754 - On January 14, creation of the Union Fire-Club, the first organized fire company in Canada.\n*1758 – Halifax provided the base for the capture of Louisbourg and operated as a major naval base for the remainder of the war.\n*1758 – The Sambro Island Lighthouse was constructed at the harbour entrance to develop the port city's merchant and naval shipping.\n*1759 – A permanent Naval Yard was established.\n*1768 - HMS Halifax built, the first warship constructed in Halifax.\n*1775 – The government did not have enough money to pay for oil for the Sambro lighthouse. The militia was unable to maintain a guard, and was disbanded.\n*1775 – Provisions were so scarce during the winter of 1775 that Quebec had to send flour to feed the town.  While Halifax was remote from the troubles in the rest of the American colonies, martial law was declared in November 1775 to combat lawlessness.\n*1776 – On March 30, General William Howe arrived, having been driven from Boston by rebel forces. He brought with him 200 officers, 3000 men, and over 4,000 loyalist refugees, and demanded housing and provisions for all.\n*1782 Naval battle off Halifax\n* 1793 - Population: 4,000 people (approximate).\n*1794 – By 1794, Prince Edward, Duke of Kent, was sent to take command of Nova Scotia.\n*1800 – Though the Duke left in 1800, the city's prosperity continued to grow throughout the Napoleonic Wars and War of 1812.\n19th century\n*1802 – Saint Mary's University was founded as an elementary school. Saint Mary's was upgraded to a college following the establishment of Dalhousie in 1818; both were initially located in the downtown central business district before relocating to the then-outskirts of the city in the south end near the Northwest Arm.\n*1812 – Although Halifax was never attacked during the War of 1812, due to the overwhelming military presence in the city, many Naval engagements occurred off the Halifax station. Most dramatic was the victory of the Halifax-based British frigate HMS Shannon which captured the American frigate USS Chesapeake and brought her to Halifax as prize. As well, an invasion force which attacked Washington in 1813, and burned the Capitol and White House was sent from Halifax.\n*1815 – In the peace after 1815, the city suffered an economic malaise for a few years, aggravated by the move of the Royal Naval yard to Bermuda in 1818.\n*1818 - Dalhousie University was first established as a non-sectarian college in 1818 by the Lieutenant-Governor of Nova Scotia, George Ramsay, 9th Earl of Dalhousie.\n*1842 – The incorporation of the City of Halifax, followed by the direct election of civic politicians by Haligonians.\n*1842 – Halifax became a hotbed of political activism as the winds of responsible government swept British North America during the 1840s, following the rebellions against oligarchies in the colonies of Upper and Lower Canada.\n*1848 – The first instance of responsible government in the British Empire was achieved by the colony of Nova Scotia in January–February 1848 through the efforts of Howe.\n*1868–1875 – The leaders of the fight for responsible or self-government later took up the Anti-Confederation fight, the movement that from 1866 to 1875 tried to keep Nova Scotia out of Confederation.\n*1850s – Howe was a heavy promoter of railway technology, having been a key instigator in the founding of the Nova Scotia Railway, which ran from Richmond in the city's north end to the Minas Basin at Windsor and to Truro and on to Pictou on the Northumberland Strait.\n*1870s – Halifax became linked by rail to Moncton and Saint John through the Intercolonial Railway and on into Quebec and New England, not to mention numerous rural areas in Nova Scotia.\n*1887 – The Victorian College of Art was founded (later to become the Nova Scotia College of Art and Design.)\n*1896 – Halifax Armoury opened.\n20th century\n*1901 – Halifax and Southwestern Railway opened.\n*1906 – After confederation Halifax retained its British military garrison until British troops were replaced by the Canadian army in 1906. The British Royal Navy remained until 1910 when the newly created Royal Canadian Navy took over the Naval Dockyard.\n*1912 - Halifax responded to the tragedy of the RMS Titanic disaster, serving as a hub for recovery operations of the bodies still floating in the North Atlantic. John Snow & Son Undertakers on Argyle Street helped to bury the bodies, 150 in all were interred in the city's cemeteries, 121 of them at Fairview Lawn Cemetery.\n*1914 – Halifax began playing a major role in the First World War, both as the departure point for Canadian Soldiers heading overseas, and as an assembly point for all convoys (a responsibility which would be placed on the city again during WW2).\n*1917 – In November, a subway system was presented to City Hall, but the city did not pursue the scheme.\n*1917 – Halifax Explosion occurred on December 6.\n*1920s – War Plan Red, a military strategy developed by the United States Army during the mid-1920s and officially withdrawn in 1939, involved an occupation of Halifax by US forces following a poison gas first strike, to deny the British a major naval base and cut links between Britain and Canada.\n*1928 – Halifax Forum built.\n*1930s – The harbour's strategic location made the city the base for the famous and successful salvage tug Foundation Franklin which brought lucrative salvage jobs to the city in the 1930s.\n*1945 – Halifax Riot on VE Day.\n*1958 – Halifax Grammar School established.\n*1960 – Halifax Stanfield International Airport built.\n*1969 – The late 1960s was a period of significant change and expansion of the city when surrounding areas of Halifax County were amalgamated into Halifax: Rockingham, Clayton Park, Fairview, Armdale, and Spryfield were all added in 1969.\n*1974–2008 – The Daily News (Halifax) published.\n*1981 – Metro Transit (Halifax) founded.\n*1988–1993 – Halifax Citadels operated.\n*1995 – The city hosted the G8 summit of the world's major economic powers.\n*1995 – An Act to Incorporate the Halifax Regional Municipality received Royal Assent in the provincial legislature and the Halifax Regional Municipality was created in 1996.\n*1996 – Halifax Regional Municipality, or \"HRM\" (as it is commonly called) was created on April 1, 1996.\n*1996 – Halifax Regional Fire and Emergency created.\n21st century\n*2001 – The United Nations report has called for reparations be paid to the Black community of Africville. During the 1960s and 1970s period of expansion and urban renewal, the Black community of Africville was demolished and its residents displaced to clear land for industrial use as well as for the A. Murray MacKay Bridge.\n*2010 - Africville Apology\nSee also\n*List of years in Canada\n*List of people from the Halifax Regional Municipality\nNotes"
    }
  ]
}