{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the January 2025 Richmond water crisis\n\n| Location = Greater Richmond Region\n}}\n|raw=}}\nIn January 2025, the city of Richmond, Virginia and its surrounding localities suffered water distribution outages due to a blizzard which impacted much of the United States. The issues started on the morning of Monday, January 6, and were mostly resolved by Saturday, January 11. The localities' water systems are interconnected, meaning that problems in Richmond City led to problems across the region. Richmond was the most impacted, followed by Henrico to the immediate north. Henrico is bordered on the north by Hanover County and on the west by Goochland County, which also faced some impacts. Chesterfield County, to the south of Richmond, was impacted very little, as they were able to effectively switch water sources and have very few customers who directly receive water from the city.\nThe event was preceded by multiple issues, including many years of flooding at the plant, and followed by multiple issues, including an over-application of fluoride in April; another instance of low water pressure, this time due to raw water intake filters getting clogged, in May; and a major water main break that impacted service in Henrico County and lead to the declaration of a state of emergency.\nDuring the crisis itself, boil-water advisories were issued for all of Richmond and Henrico, parts of Hanover and Goochland, and for 27 people in Chesterfield. These regional partners had to adapt by shutting off their own water supply from Richmond, which caused impacts there, particularly in Henrico County.\nCommunication issues between the city and Henrico County, and between the city and its water customers, contributed to response difficulties. Impacts were widely felt, with hospitals, schools, and sporting events being among those facing cancellations and service interruptions. Cooperation among localities and between localities and the private sector helped to mitigate some of the issues.\nThe event had political implications, because the Virginia General Assembly had to recess until Monday, January 13; they had originally been scheduled to start their session on Wednesday. Governor Glenn Youngkin activated the Virginia National Guard, which was made easier because of the state of emergency that had been declared earlier in the week. He called for an after-action review to more fully understand the crisis. Further, Jason Miyares, the Attorney General of Virginia, said that he would aggressively prosecute price gouging. The outage happened roughly a week into newly elected mayor Danny Avula's administration, and multiple commentators discussed his performance.\nFull water service was returned by Thursday and Friday, January 9 and 10, but the boil-water advisory was not lifted until the afternoon of Saturday,  January 11 due to testing requirements mandated by the Virginia Department of Health's (VDH) Office of Drinking Water (ODW). These were also required for Henrico County.\nMultiple state regulators and outside reviewers pointed to a lack of speedy information-sharing as contributing to the crisis, and the crisis put the issue at the head of legislators' minds, although people had brought up the issue beforehand.\nMultiple internal and external investigations were held to determine the causes of the crisis and the next steps for the affected localities, the region as a whole, and the state. Richmond's audit identified infrastructure, communication, and planning struggles as the main cause of the crisis. The reports of Hanover and Henrico focused on how communication failures from the city hampered their ability to respond.\nJanuary 5–6, 2025 United States blizzard\nThe City of Richmond had declared a State of Emergency in preparation for the storm, as had the Commonwealth of Virginia.\nThe only preparation taken by staff at the plant was fueling their vehicles, fueling the backup generators, and filling chemical tanks. The generators were verified to be operation during a pre-storm check on January 4.\nThe snow storm ended up being 2 inches.\nMonday, January 6 incident start\nThe incident started in the early morning of Monday, January 6. Reports vary as to the exact nature of failures at the plant. The variation especially depends on the sources' publication date, as new information has continued to come to light. The timeline is somewhat unclear.\nDuring previous crises, workers with specialized expertise in electrical and control systems had been assigned to the plant for overnight shifts, but this did not happen on the night before the crisis. Two maintenance staff were assigned to overnight snow removal, but one went home early. April Bingham, the former Richmond Director of Public Utilities, had been on vacation from December 20th to January 5th.\nAt 4:25 am on Monday, January 6, a power bump was experienced at Richmond city's water treatment plant on Douglasdale Road, which was related to the larger power issues experienced across the region as a result of the January 5–6, 2025 blizzard across the United States. A work order was sent in for this issue at 4:42 am. The work order stated that the \"VFDs\" would restart, reach 20% speed, shut off, and then start the cycle again.\nAt 5:45 or 5:50 am, a full power outage occurred. The bus tie and switchgear failed in their task of transferring to the other power source; the switchgear had a faulty coil. An employee's email noted that there was no power at the plant, and that battery power was low. An electrical supervisor was called in, but there was no one at the plant with electrical expertise. However, a plant electrician arrived early for their 6:00 am shift, but it was unclear if that electrician was trained in manually starting the generators or switching between power feeds. It was later found that the work of replacing the switchgear had started in 2022, but had not been completed.\nBy 5:55 am, the plant was flooded. Filter gallery valves became stuck, allowing water to flood into the basement where the electrical and computer equipment was located. A later report said that water reached a depth of up to 12 to 13 feet in some areas in less than 12 minutes.\nAt 6:30 am, an employee sent an email stating that \"effluent flow\" was going over; where it was going over is unclear, as the email had been partially redacted.\nAt 6:50 am, Dominion Energy was notified that power had gone out. At 6:55 am, Bingham was contacted by the plant's superintendent to say that the plant had lost power, and thus its water-production capabilities, and that crews were responding to assess and repair the damage. The superintendent headed in, with an ETA less than 30 minutes. Bingham reached out to the counties to cut back on demand.\nWhen power was lost, a process at the plant failed as it tried to transfer to a secondary Dominion Energy source. A plant electrician chose to manually complete this process, rather than activating backup generators. The HNTB report said that this would have been the correct decision, had the staff member been trained correctly; employees were fearful that further damage might be caused to electrical equipment if the generators were turned on while the Dominion feed was still active. In a press briefing, Avula stated that he didn't know when the plant electrician had arrived. Further, only 3 operators were present at the plant at the time of the outage, none of them electrical employees.\nAt around 7:00 am, Bingham directed a staffer to not post anything about the plant's issues.\nAt 7:05 am, power was restored by the electrical supervisor. At 7:09 am, the water plant superintendent sent a text to Bingham stating that the generators were on, the surrounding counties had been notified, and that additional time would be needed to assess the situation and respond to it.\nAt 7:16 am, power had been restored, but the plant's maintenance engineer said that they were dealing with a flooding issue.\nThe plant's IT system did not reconnect to servers after a reboot, which was crucial for plan operations. Earlier reports indicated that this is when critical damage was caused to the IT system, called SCADA. The system had battery backup power, called an Uninterruptible power supply (UPS), but, concurrently with the manual switch to the power system, that went offline before full power was restored. An RVAMag report said that the IT battery backup system ran out too quickly, after about an hour into the two-hour power loss. Also at this time, a Chesterfield County official reached out to Bingham to see if the city needed assistance in working with Dominion Energy to prioritize issues at the plant; she stated that electricians were at the plant and that backup generators were functioning. This contradicts what Avula said later about the generators not being turned on; the Richmonder reports that his explanation was correct and that it was unclear why the texts incorrectly reported the situation; city officials declined to answer questions relating to this inconsistency.\nEarly reports indicated that backup generators turned on, but a separate battery backup and a redundant system both failed. Also, two other backup batteries were offline at the time. Additional reports indicated that the generators were intended as replacements for the battery, and had to be manually activated; Richmond officials declined to answer when asked by CBS 6 News the length of time between the backup batteries failing and the generators being turned on. Further, Mayor Avula said that a failure in a redundant system caused the plant to flood, damaging equipment.\nAvula reported that workers were in the basement and trying to pump water out. He said that there was a delay of a couple of hours between the power outage to the time that water started building up in the facility. Water was flowing into the basement at a rate of around 42,000 gallons per minute, whereas the city's dewatering pumps could each only handle 1,700 gallons per minute.\nNot all plant employees had radios, leading to confusion during repairs as to which employees were where. Further, power restorations were done haphazardly, without workers being notified. The division between operations and maintenance staff led to communications issues, as operations staff felt helpless and that the best course of action would be to let the maintenance staff handle the situation. The after-action report notes that the decision to transfer the power source from the primary to the secondary was correct and would have been effective, had trained staff been at the plant.\nBingham arrived at the facility around 8:00 am.\nMonday, January 6\nChesterfield County reported that its Utilities Department was notified at approximately 7 am on Monday, January 6 of the situation and asked to limit water usage from the city. Henrico was also notified at around 7am. The county began the process of transitioning off of that supply to help the city maintain its water pressure, which is a standard response by the department in these types of situations. It augmented its supply by pulling more water from the Appomattox River Water Authority.\nAvula stresses that initial communication happened at around 9:00 am, but the HNTB report says that this was only to notify them of a temporary power loss and not the actual dire nature of the situation at the plant.\nAs of 9:39 am, power had been restored to the plant. The surrounding counties of Hanover, Henrico, and Chesterfield chose to disconnect themselves from the city's water system in order to help preserve water for the city.\nAt 10 am, Bingham was told by an employee that a boil-water advisory would be necessary.\nFor the next several hours, crews focused on getting the plant's computer and mechanical systems back in operation. Water consumption increased and the city's reservoir dropped noticeably. Some city residents began to notice major issues with water pressure. City officials chose to not issue a boil-water advisory at this time because they hoped that it would not be necessary.\nAt 11:51 am, Bingham sent a text about a possible water-boil notice, but said that she was hopeful that the city could refill its reservoir and avoid further issues by restoring service at the plant. Avula and his team seemed unaware of the importance of the situation at the plant until later on this day.\nA regional telephone call occurred at around 2:45 pm in which surrounding localities were made aware of the extreme nature of the situation: that the water plant remained offline and that city water tank reserves were continuing to decline. Henrico County officials urged the city to notify the public as soon as possible; some Richmond residents reported lower or no water pressure before the official announcement of problems at the plant.  Chesterfield County isolated its water distribution system from the city's supply by shutting down all three interconnection points between its water supply and the city's. The process was completed by 4:00 pm.\nThe VDH reached out to the city around 2:50 pm, after hearing about the situation from a third party.\nAt around 3:00 pm, as Avula and his team became more aware of the situation, he sent a text to a state health official to ask for assistance with mass communication specifically to the restaurant community.\nSafe water continued to flow to water customers until around 4:30. At 4:26 pm, the city announced an immediate boil-water advisory, which had not happened in the city since Hurricane Isabel in 2003. City residents were also asked to try and conserve as much water as possible. According to Mayor Avula, the communication delay came from a desire to contact regional stakeholders before informing city residents and to give people accurate information. Bingham said in the [https://www.rva.gov/press-releases-and-announcements/news/city-richmond-issues-immediate-boil-water-advisory-and press release] that her team was working to bring the water system back online, along with the support of others. 230,000 people had been reported to have been experiencing very low water pressure before the city was placed on the advisory. Multiple officials inquired to Bingham about rumors circulating on social media about low water pressure. The first water-crisis-related post to WebEOC was made around this time.\nAt 5:15 pm, Mayor Avula held an emergency news conference. He announced that they had cleared out the facility's flooding and that eight filters were operational. He also announced his intention to resume producing water later that evening and restore pressure by 10:00 pm.\nAt 5:30 pm, a VDH official arrived at the plant; the city had not reported its issues to the state office, which had learned about the crisis from a \"third party.\" The official was not able to make contact with anyone at the plant or gain access until 6:50 pm.\nAt 8:30 pm, Bingham texted interim city Chief Administrative Officer Sabrina Joy-Hogg that she had contacted the neighboring counties requesting assistance with the SCADA system and that she was losing confidence in their SCADA contractor.\nOn Monday evening, John Littel, Governor Youngkin's chief of staff, informed Avula that Youngkin was calling the chairman of General Electric (GE) after Avula reported that a GE subsidiary, GE Vernova, had made the software. Both GE and Dominion offered assistance with the SCADA system. Also on Monday evening, the county managers of both Chesterfield and Henrico, along with former mayor Levar Stoney, texted Avula offering assistance with the situation.\nAt 10:52 pm, Bingham texted Joy-Hogg once more that no progress had yet been made with the SCADA system.\nBefore midnight, the city provided an update, saying that the issues still had not been fixed and that Mayor Avula was going to spend the night at the water plant to oversee restoration efforts.\nChesterfield County minor boil-water advisory\nOn the evening of Monday, January 6, the Chesterfield Utilities Department delivered by hand 27 notifications to customers near the Chesterfield-Richmond line that received water directly from the city's water distribution system. These customers were informed to follow the boil-water and conservation advisories issued by the city. They were unable to be supplied by the county's water distribution system because of geographic constraints and pressure concerns.\nHenrico pressure loss\nChan said that communication from the city was normally much better, to include timely notifications about regular maintenance, and that when unexplained issues started arising without communication from the city, they knew that something was wrong.\nHenrico's quick rerouting of water services from the city's water facility worked briefly until an overnight Sandston water main break, took pressure from the water lines in eastern Henrico, especially in the Sandston and White Oak areas. The break was located near the Antioch Recreational Community Pool and occurred overnight. Essentially, leaks in the system were caused as water rushed the system towards open valves leading to Richmond, which cut off water service to large parts of northern and eastern Henrico.\nRichmond DPU communication issues\nAt the same time the crisis was unfolding on Monday morning, DPU was also facing issues with its call center. Given that the city had closed its offices on Monday for the snowstorm, the DPU offices should have activated their outgoing call message. Yet, text message and email evidence shows that, while the issue was brought up with DPU and Department of Information Technology (DIT) officials around 7pm on Saturday, the issue was not fixed until 8:40 am Monday.\nAdditionally, optimism among officials regarding their ability to return the plant to operational status, along with not immediately grasping the magnitude of the problem, led to a slowness in communicating water issues to residents, although the city began receiving calls and emails around 3pm. Call center officials were soon told to stop scheduling service orders due to the plant's failure.\nTuesday, January 7\nOn Tuesday, January 7, 24 hours after the failure of the city water plant, Hanover County's storage tanks, which were supplying Mechanicsville, ran out. Meanwhile, Ashland's demands increased and the Doswell plant was unable to provide additional water, despite maximizing its production.\nAt 8:15 am, the mayor reported that they had had the most positive step of the last 12 hours which was the fact that two pumps had started actively running and that one of the tanks was actively being filled; additionally, computer systems had been restored. However, water service was still not restored for much of the city.\nAt 12:33 pm, the city announced that water production had been restored, but that it would be several hours before pressure returned to normal levels, and that the boil-water advisory would remain in effect.\nIn the afternoon, Youngkin called Vithoulkas to offer assistance, but he almost didn't answer the phone because he didn't recognize the number.\nElectrical panel failure\nAt 6:20 pm, city officials reported that the plant experienced an electrical failure, which extended the timeline for the restoration of water service. The failure forced a system reset. Initially, engineers employed by the city believed that the malfunction would not cause significant delays, but further analysis revealed the presence of a more complex issue, requiring additional time and resources.\nIn a statement, Avula said that service teams remained on duty 24/7 to re-pressurize the water system and restore water distribution throughout the city.\nHanover boil-water advisory\nHanover County officials placed those portions of the county east of Interstate 95 under a boil water advisory. However, residents in Doswell were exempt. Residents west of the interstate are also asked to continue to conserve water; residents of the Town of Ashland were also asked to continue conserving water. Officials said that the order was a precaution due to low water pressure. According to the county, the order was to remain in effect until 48 hours after Richmond's water service is fully restored.\nResidents on Aqua Virginia systems were encouraged to contact them for updates.\nHenrico pressure\nPressure was expected to be restored to eastern and northern the afternoon of Tuesday, January 7. However, this was not the case.\nIn the afternoon, Henrico workers were able to repair the Sandston break, but realized shortly after that a number of valves in the county water system would need to be closed or reversed to allow water to flow in a new direction before the system could be re-energized. According to County Manager John Vithoulkas, that process had to be extremely slow, because going too fast puts the pipe at risk of exploding.\nOn the night of January 7, Henrico crews finished closing two large valves to push water from Western to eastern Henrico, which did succeed in pushing more water to the eastern end of the county, but was still insufficient in providing full water service to eastern residents.\nMany of the Henrico workers involved had been working for 14 or 15 hours, spending most of that time in freezing temperatures.\nWednesday, January 8\nJanuary 7 and 8 were the peaks of Henrico's water issues, with roughly 24,000 customers being without water.\nAt 9:30 am on Wednesday, January 8, Avula reported that 3 pumps were up and running, 12 filters had become operational, and that water was starting to fill the reservoir. He said that a return to partial pressure was possible as the day went on. The city's plant then began to fill the Church Hill water tank; one of its roles is to serve eastern Henrico's Elko region.\nHanover County reported, given the filling of the reservoir, which provides water service to the affected Mechanicsville area, their hope that water service would be returned by late afternoon into early evening.\nIn an afternoon press conference, Mayor Avula said that the plant was producing 69 million gallons per day. He said that once water levels and the city's main reservoir were able to stay above 10 feet, testing could begin to ensure that the water was safe for human consumption. Regulations require the water system to pass two rounds of 24-hour testing at least 16 hours apart before the boil-water advisory can be lifted. He repeated the request to Richmonders to use their water sparingly. He said that 5 pumps and 15 filters were then operational. The city conducted its first bacteriological test of water in the water plant, which came back clean.\nAt 5:45 pm, Hanover County reported that they were optimistic that water service would be fully restored to areas east of Interstate 95 by Thursday, January 9. According to Matt Longshore, Hanover Director of Public Utilities, water pressure began returning to affected Hanover homes on this day and that progress would continue throughout the night and into the next day as pipelines were refilled.\nAt 8:30 pm, Hanover's water pumps were turned on.\nThe water service of about 6,000 Henrico customers had been restored since January 6, but roughly another 23,000 remained without service. Chan indicated that customers could expect to hear gurgling, see discoloration or frothy and aerated water, or experience mineralization, which he said was normal and not something to be alarmed by; he said that customers experiencing this should flush their faucets by running them for a few minutes.\nHenrico boil-water advisory\nVDH issued a boil-water advisory in Eastern Henrico as residents started getting water again after the pressure drop, which county officials extended to all of its water customers due to the interconnected nature of its systems. At the Tuckahoe Area Library, county manager John Vithoulkas said in a press conference that the VDH did not realize that once water is in their system, there would be no way to prevent water in Eastern Henrico from going to Western Henrico.\" The department expected advisories region-wide to be in effect through January 9.\nPublic utilities director Bentley Chan said that the boil water advisory was a precaution for anything that may come through the \"first push\" of water. He said that Henrico is not required to conduct the same tests within Its distribution system as the city's water plant, but may choose to do so.\nGoochland and Aqua Virginia boil-water advisory\nA boil-water advisory was issued for residents of Goochland County's eastern end, an area that receives its water from Henrico County. This includes residents in the James River Estates and Pagebrook subdivisions in its Eastern End, who are customers of Aqua Virginia.\nFurther, some customers of Aqua Virginia in Hanover County, who connect to County water, were encouraged to boil their water; this includes the Holly Ridge, Mayfield Farms, and Burnside subdivisions; it is unclear when these recommendations were made.\nHenrico interconnect closure\nThroughout the morning, Henrico crews blocked off any remaining interconnects between the city of Richmond and Henrico. While there was no risk of contaminated water coming into the Henrico system from those valves previously, since the county was now attempting to restore pressure in its own water system, it had been losing water through those valves into the city.\nIt was believed that Henrico customers would be able to have access to water by the morning, but this turned out to be untrue. After crews finished closing the remaining large water valves, they realized that 14 other, smaller interconnect valves along the Henrico-Richmond line had to be closed as well. These valves will eventually have to be returned to their normal state one at a time, but this will not impact service.\nHenrico pressure zone maintenance\nOnce the Richmond-Henrico interconnect valves were closed, Henrico Public Utilities crews began working on filling up the Laburnum/Azalea pressure zone with water from the Greater Hermitage Zone. Once that is complete, water will be fed from there into the Greater Eubank Zone. However, the process may be lengthy, because there has never before been the need to send this level of water from western to eastern Henrico.\nHowever, the process was tedious, and water was slow in refilling the affected areas.\" Thus, the county returned to its strategy of getting water from the city.\nThursday, January 9\nAt 5:45 am on Thursday, January 9, the city announced that it would provide an update on water issues at 9:30 am, but later rescheduled this press conference for noon.\nJust before 9:00 am, city officials reported that the city reservoir was almost full, at 17 feet, and that 8 out of 9 water zones were back in service, with 9 zones being the target.They announced that testing would commence when the ninth zone reaches its desired threshold.\nMuch of Henrico's Route 5 corridor near the city line, along with Highland Springs and Sandston near Richmond International Airport, remained without water, although some Highland Springs residents did report a slow trickle of water. Customers living farther east along Route 5 near I-295 reported at least low water pressure. Additionally, residents along South Laburnum Avenue near Nine Mile Road, in the Central Gardens community, and in the Glen Lea area reported having low or full water pressure.\nAt 9:55 am, Hanover county officials said that the water system was almost back to normal, but that a boil-water advisory was expected to last until early in the weekend. Water testing began this day and it was expected to take up to 48 hours for the advisory to be lifted.\nIn the morning, Henrico's Varina District Supervisor, Tyrone Nelson, posted a video to social media announcing that the 23,000 customers in Eastern and Northern Henrico could be receiving water on this day unless something unforeseen happened. He said that water had begun reaching many affected communities in eastern and northern Henrico on the night of January 8. He further stated that those county residents previously without water would see their water returning on this day. Residents may experience trickles of water flow gurgling in the pipes, or air pressure. He said that in twelve hours, the county would be in a much better place than it was now. The boil-water advisory was planned to remain for all of Thursday.\nAlso in the morning, VDH called the affected localities and shortened its required waiting period between water system tests from 24 hours to 16 hours for the city and surrounding localities.\nBefore noon, officials in Hanover reported that water services had been restored to residents east of Interstate 95. Their boil-water advisory stayed in effect for those east of I-95 and is planned to remain so for the next 48 hours. Hanover Director of Public Utilities Matt Longshore said that any water discoloration noticed by residents is normal. To solve discoloration, Longshore recommended that customers flush their service line with an outside faucet, then flushing each indoor fixture with cold water, one at a time, until it ran clear. Residents were encouraged to continue to conserve water as full pressure was restored.\nBetween 11 am and 12 pm, tests of water within the city's distribution center were conducted. If those tests, along with tests conducted 16 hours later, were clean, the city planned to lift its boil-water advisory sometime Friday, January 10.\nAt noon, city officials said that water pressure had been fully restored and that the city reservoir had filled to its maximum of 18 feet. He announced that additional personnel would be at the plant to prepare for the winter storm that was expected for January 10, including technicians, mechanics, electricians, and engineers; battery backups and generators were also tested at the plant ahead of the winter storm. Avula also announced that officials had decided to postpone billing for water services in January.\nThe news of Richmond's restored water pressure news meant that Henrico was closer to an end to the crisis. Henrico Public Utilities Director Bentley Chan said that the city was supplying 6 million gallons of water per day to the county, which is about half of its normal rate. While the water was lower in terms of pressure and flow, it was moving at a higher rate of speed than expected.\nEarly in the afternoon, the first Hanover water sample was sent to a state-certified laboratory once water service was restored. The next round of testing was set for early afternoon on January 10.\nThe water service of many Henrico residents' water was restored by this day.\nIt was announced that the Henrico boil-water advisory was likely to extend to Saturday, January 11 because Henrico planned to conduct its own tests on the water system, primarily in the areas served by the city's water supply. The second test, a bacteriological one, is planned to be undertaken January 10, while the first was done on this day; pipes were tested for both chlorine and bacteria. Officials said that residents should see water flow return throughout the day, although they encouraged residents to remain patient and limit water use to mitigate possible high demand. Six locations in Eastern Henrico and one in the West End were tested for chlorine.\nLate in the evening, Henrico's first round of chlorine tests came back clean. Bacteriological tests require a 24 hour waiting period in the laboratory; samples are incubated to see if any bacterial growth occurs; if none occurs, the sample, and thus the water, is identified as safe. The incubation involves emptying a packet of Colisure reagent into a vial of water and placing it in an incubation machine at  for 24 hours; the mixture will be identified as safe if the mixture turns bright yellow. The water-quality tests were being conducted in coordination with VDH.\nHenrico water main break\n2 additional water main pipes burst in Henrico County on this day, bringing the total over the week to 3.\nAt 9:27 am, an article was published by NBC 12 describing how a water main break closed part of westbound Monument Avenue at the intersection with Bremo Road. It was unclear whether this issue was related to the broader water outage. Officials were unable to provide an estimated time of repair at the time of publishing. Traffic was closed on westbound Monument between Bremo and Devers Roads. Roughly 40 customers were impacted, but not nearby St. Mary's Hospital, which has water. The Henrico Citizen published that the break should be repaired by the evening of this day.\nOfficials also reported a break at Thalbro and Staples Mill Road. It was unclear if this break was related to the outage. Officials completed repairs on the night of Thursday, January 9. It was indicated that the cold temperatures of the week, possibly in concert with efforts to move water to eastern Henrico, led to the break. The break was longitudinal in nature, requiring workers to cut an entire section out and replace it.\nFriday, January 10\nOvernight, Henrico's Public Utilities department filled its above-ground water storage tanks, a move intended to provide a buffer against pressure losses due to expected surges in water use.\nAt 10 am on Friday, January 10, Henrico conducted its second set of bacteriological tests. Officials said that all customers' water pressure should return to normal on this day. Henrico's boil-water advisory was planned to be lifted Saturday, January 10. Hanover and Richmond also reported that their initial water tests found no harmful contaminants, although the boil-water advisory remains in effect due to the need to complete additional testing 16 hours after the first round.\nAt 11:15 am, Henrico began its final water test.\nAt 2pm, city officials closed City Hall due to an unexpected drop in water pressure, although they said that it was not indicative of larger water distribution system issues.\nLate into the day, clean results from Henrico's water bacteria tests became available.\nSaturday, January 11\nOn Saturday, January 11, officials from all the affected counties announced an end to the boil-water advisory due to testing showing clean results on all VDH-regulated indicators. Mayor Avula said that water coming out of faucets might still be cloudy due to air bubbles trapped in the distribution system, but that the water was still safe to drink.\nAt 2:10 pm, Goochland was made aware of issues with water pressure in its eastern end and announced its intention to investigate. At 4:25, it was found that residents' flushing of their lines caused massive water pressure issues. Water conservation in the area was encouraged.\nMonday, January 13\nAs of Monday, January 13, 68 water mains had broken across the region, due to cold temperatures and the stress imposed on the water system because of the crisis. Hanover experienced 1 break, the city experienced 22, and Henrico experienced 45. In Henrico's case, the return of warmer water to the cold pipes shocked them, which, in combination with air bubbles, created a \"water hammer\" effect, which significantly damaged the pipes. The large number of breaks in the county was due to the county's rerouting of water.\nTuesday, January 14 and later events\nAround 3 pm on Tuesday, January 14, the city reported that its reservoir was at normal operating levels.\nAt 8:30 pm, the city released a statement saying that a \"finish water pump\" had failed, but that three main finish pumps and two auxiliary pumps were still working. The plant was producing 68 million gallons of water, which was higher than normal for the time of year. Another auxiliary pump was being sent to the plant to support operations. Additionally, another UPS system had been installed and tested at the plant.\nHanover and Henrico said that they were \"monitoring\" the plant's operations.\nHenrico officials said that the cloudy water that some residents were reporting was not cause for concern, as their flushing of the water system created extra pressure, leading to air bubbles that could flow to customers and cause cloudiness.\nAfter the crisis, it was found that some employees, some of whom had been temporarily transferred from the wastewater plant, had worked for 21 consecutive days without a day off.\nReferences"
    }
  ]
}