{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of race relations and policing in Minneapolis–Saint Paul\n\nThe following is a timeline of race relations and policing in Minneapolis–Saint Paul, providing details with a history of policing in the Twin Cities in the U.S. state of Minnesota from the nineteenth century to the present day. The Hennepin County Sheriff's Office,  with its headquarters in downtown Minneapolis, is one of the \"largest law enforcement agencies in Minnesota\" with  division and unit facilities throughout Hennepin County. Twin cities, Saint Paul and Minneapolis, have their own police departments, the Minneapolis Police Department, which was established in 1867 and the Saint Paul Police Department. A union for rank and file officers in Minneapolis—the Police Officers Federation of Minneapolis (the Federation)—was established in 1917.\nSince its establishment in 1867, the Minneapolis Police Department has had 52 Chiefs of Police.\nThe current and 54th chief of policewho began his term in November 2022is Brian O'Hara, who succeeded Medaria Arradondothe first African American to serve as chief of the Minneapolis Police Department. O’Hara was the first police chief to be appointed after the murder of George Floyd.\nAn investigative division within the Minneapolis Department of Civil Rightsthe Office of Police Conduct Review (OPCR)reviews cases of alleged violation of MPD policies by police officers including \"use of excessive force, inappropriate language or attitude, harassment, and discrimination.\"\nTimeline\nNineteenth century\n*March 9, 1867: In response to a request from the mayor of Minneapolis for a police force, on March 9, 1867, four officers were appointed to the Minneapolis Police Department. The MPD was established shortly after the end of the   American Civil War (1861 – 1865), an internal war pitting the northern United States against the southern United States —the Confederacy—primarily fought over the enslavement of black people. The Dakota War which was part of the Sioux Wars and the American Civil War, had ended in 1862. At that time, the population of Minneapolis was about 5,000.\n*1867–1917: In the early years newly elected mayors would fire MPD officers and replace them with \"friends, family, and their supporters,\" according to Fossum's 1996 History of the Minneapolis Police Department.\n*1890: Augustine E. Costello published his History of the Fire and Police Departments of Minneapolis: Their Origin, Progress, and Development.\n*1892: The first Minnesota African-American police officer was James H. Burrell, who joined the St. Paul Police Department in 1892.\nTwentieth century\n*January 7, 1901: A. A. Ames (1842 – 1911) began his final term as mayor of Minneapolis. He appointed his brother, Colonel Fred W. Ames as chief of police and a former gambler, Norman W. King as detective. The Minneapolis Police force was transformed into Ames' army. The police would put pressure on criminal organizations and Ames' people would take money from various criminal activities in the city all with the knowledge of local citizens. By 1902, Ames was drinking heavily and people working under him were fighting among themselves. Extortion schemes increased. Attempts by the Hennepin County sheriff to crack down on the widespread criminal activities were quashed, but even average citizens were aware of the city's descent into corruption.\n*April 1902: A grand jury was drawn composed of \"unselected citizens\" with Hovey C. Clarke, local businessman, as foreman. They \"received no special instructions from the bench\" and the county prosecutor put only routine work before the grand jury. Clarke dismissed the county prosecutor when he refused to investigate A. A. Ames and his brother, Fred. Clarke hired private investigators to gather evidence on Ames, his brother, and those who worked with them. Initially Ames was convicted, but the case was overturned by the Minnesota Supreme Court.\n*1902: Alderman Percy Jones as acting mayor removed all of police officers that Ames had hired and replaced them with the police officers that Ames had previously fired. Jones appointed a \"church deacon and personal friend to be chief of police.\" Jones also stated that There would \"be no gambling, with police connivance, in the city of Minneapolis during his term of office.\"\n** By 1902, while Mayor Ames was still in office, the MPD had become infamous in the United States for the boldness of its corruption and crimes. By 1902 The MPD had five precincts and one paddy wagon. When the Citizens' Alliance was established, the MPD would \"harass, infiltrate, and attack labor unions\" on behalf of the Alliance.\n*1909: A chapter of the National Association for the Advancement of Colored People (NAACP) was established in the Twin Cities.\n*1913–1915: According to the Twin Cities PBS May 4, 2007 report, with the rise of the steel industry in Minnesota and the lack of workers during World War I, the steel plant lured \"blacks from the cotton fields of the South\" with the offer of good wages. Working-class immigrants and whites felt that their jobs were threatened, as large numbers of newly arrived African Americans from the South, who were part of the Great Migration  to the industrial North, competed for the lower-grade jobs.\n*1917: The MPD celebrated its 50th anniversary. By 1910, the population of Minneapolis was 301,408 making it the 18th largest city in the United States. Historian Michael Fossum, described the MPD in 1917 as 300 officers \"without training exerting control over 300,000.\"\n*1917: During the 1917 Streetcar strikes the Hennepin County Sheriff's Office,  in the city of Minneapolis, the county seat, deputized the private army which the Citizens' Alliance had formed. They were armed with bayonets and rifle against the strikers. The Alliance army was supported by the local police. The local Minneapolis Alliance was sponsored by the Commercial Club and other business leaders, The Citizens' Alliance groups in Minneapolis were composed of smaller local associations that united in the belief that organized labor was \"evil and un-American.\" In a 1903 address at the Minneapolis Commercial Club, David M. Parry, the first president of the Citizens' Industrial Alliance, said that \"we should endeavor to strike at the root of the matter, and that is to be found in the wide spread socialistic sentiment among certain classes of people.\"\n*The union for the MPD—Police Officers Federation of Minneapolis (the Federation)—was established, in spite of the MPD's opposition to labor unions.  The Federation became part of the American Federation of Labor.\n*June 15, 1920: In her 2013 publication, The Ku Klux Klan in Minnesota, author Elizabeth Hatle wrote that Ku Klux Klan had emerged in Minnesota in the wake of the June 15, 1920 lynchings of three African-American circus workers, Elias Clayton, Elmer Jackson, and Isaac McGhie in Duluth, Minnesota by a white mob of thousands. Although there was no evidence, the three had been accused and arrested for an alleged rape and robbery of a nineteen-year-old woman.\n*June 20, 1922: An ad in the Minnesota Messenger announced a \"Citizens Meeting For Public Safety\" at the Elks’ Hall on June 25 inviting  \"the clergy and all prominent Negroes.\" The headline read \"Negroes Protest against Police Atrocities in the City.\" By 1922, \"popular support for the Ku Klux Klan was surging\" in Minneapolis. Following the meeting, the NAACP met with city officials including Mayor George E. Leach. In 1923 Leach was a KKK target.\n*1920s: Hennepin County, Minnesota jurors were \"essentially creatures\" of the Citizens Alliance. Grand jurors were selected from a list of 200, that had been provided by district court judges. CCA members and their wives predominated. The Citizens Alliance promoted Open shop  and strongly opposed labor union's support of Closed shop, where union membership is a requirement of employment.\n*1920–1933: During prohibition, the Minnesota Supreme Court disallowed convictions of alcohol possessions, with the exception of those directly involved in selling alcohol.\n*July 20, 1934: During the Minneapolis general strike of 1934 which lasted from May 20 to August 22, an incident known as the Battle of Bloody Friday took place. The Minneapolis Police Department shot at truck drivers who were on strike. They injured 67 picketers and killing two strikers, John Belor and Henry Ness.  The MPD had allegedly \"mobilized 700 private citizens and confronted thousands of striking truck drivers.\n*1945: Prior to his election as mayor of Minneapolis, Hubert Humphrey appointed Bradshaw Mintener as chair of a 12-person committee to choose a new police chief who would \"act decisively against organized crime, enforce the law evenly, bring down the high rate of crime and juvenile delinquency, and reform the corrupt police department.\"\n**During his mayoral campaign, Humphrey assured the influential newspaper and magazine publisher, John Cowles Sr., that he was \"determined to rid Minneapolis of its Syndicate and Corruption, who along with Chicago gangsters, ran the city's flourishing gambling, prostitution, and illegal liquor sales operations and fed the culture of corruption in the police department.\" During his mayoral campaign he had promised \"action on civil rights.\"\n**July 2: Humphrey began his 3-year term as mayor. When he left his mayoral office in 1948, he served as Senator and later vice-president of the United States, Hubert Humphrey.  At that time police officers Minneapolis Police Department (MPD) were only required to have a grade eight education. Humphrey tried to bring \"professional standards\" to the \"inbred, under-educated police force,\" and raised \"hiring standards and annual pay.\" As mayor, he started sending police officers to the University of Minnesota for training in what was then called \"human relations.\" In August, MPD officers \"arrested, jailed and interrogated\" two black women who had refused to comply with police orders for men to \"produce their draft cards\" and for women to \"open up their purses\" at Dreamland Café. Humphrey personally drove directly to the police station and had the women released that evening. One of the jailed women worked for the Minnesota Spokesman-Recorder, a black newspaper that had been founded in 1934. She contacted Spokesman-Recorders founder, editor and publisher, Cecil Newman. Newman contacted Hubert Humphrey, the newly elected mayor of Minneapolis who had promised \"action on civil rights,\" Newman had was Humphrey's friend and had supported his bid for election. By the time he left the office of mayor after three years, he had \"made great progress in Minneapolis in parts of his civil rights agenda,\" he but he had \"never came close to reforming the police department,\" according to The Washington Post.\n** Mintener's committee chose Ed Ryan as Chief of Police, replacing Elmer F. Hillner, who had served from 1943 to 1944. Ryan remained as Chief of Police for one year and was replaced by G.W. MacLean in 1946.\n*July 21, 1967: Against the backdrop of the 1960s Civil Rights Movement and Ghetto riots, during the Long, hot summer of 1967, Minneapolis Mayor Arthur Naftalin and Governor Harold LeVander called in 600 National Guard troops to quell the violence including looting and fires, that had erupted in areas of north Minneapolis. Across the United States, the most destructive riots of the summer of 1967 took place in July, in Newark, New Jersey, and Detroit, Michigan. There were riots in July 1967 in Minneapolis and Birmingham, Chicago, New York City, Milwaukee, Minneapolis, New Britain, Rochester, Plainfield, and Toledo. The 1968 Kerner Commission report, which had been ordered by then President Lyndon B. Johnson said that in their \"investigation of the 1967 riot cities establishes that virtually every major episode of violence was foreshadowed by an accumulation of unresolved grievances and by widespread dissatisfaction among Negroes with the unwillingness or inability of local government to respond. Overcoming these conditions is essential for community support of law enforcement and civil order.\"\n*1971: When W. Harry Davis (1923–2006)—a civil rights leader and activist, who had served on the \"Minneapolis school board for 20 years, and founded the Minneapolis Urban Coalition\"—ran for mayor of Minneapolis, his \"house was observed by uniformed police officers 24 hours a day.\"\n*1975: Minneapolis City Council established a \"civil rights commission to investigate civilian discrimination complaints\".\n*1980–1989: Tony Bouza served for three terms as MDP chief of police. Donald Fraser, who was mayor of Minneapolis from 1980 until 1994,. responded to scandals that took place during the tenure of then Police Chief Elmer C. Nordlund (1978–79). Fraser hired Bouza, who was an \"outsider\", as a reformer and Bouza \"frequently butted heads with members of the Minneapolis force\". In his 2013 book—''Expert Witness: Breaking the Policemen's Blue Code of Silence, Bouza share stories of \"alleged deceit, misconduct and corruption\" by what he described as the \"2-percenters\"—the \"misfits in every agency I have worked,\" that he described as the \"thumpers, grafters, malingerers, psychos, alcoholics, women beaters, and bullies.\"  He focused his \"reform efforts\" on the 2-percenters and apologized to the 98 percenters—the police officers who \"try to do their job\"  and who are at times, \"heroic and brilliant.\" Bouza said that the police \"control the underclass,\" which is \"reflected in their relationship to blacks.\" Bouza said that African Americans are \"targets of stop and frisk and other abuses.\"\n*1989: John Laux began his five-year term as MPD chief. He resigned in 1994 to join the Bloomington Police Department.  In the summer of 1994, following a \"series of racial incidents involving Minneapolis police officers,\" Laux told a Star Tribune reporter'' that he was having difficulty understanding \"what prompted so much crazy behavior by so many officers in such a short period of time.\" Incidents included \"an altercation between an officer and black college students at a motel,\" and a \"botched drug raid that killed an older black couple.\" In response to this incidents, Laux \"instituted race-sensitivity training, including some things that had never been tried before.\" He also worked on improving the MPD's \"bad image\" by focusing on talking to local community groups in many \"church basements.\" Laux also consulted other police chiefs in other cities to learn from their expertise. During his five-year term race relations did not improve in spite of his efforts. Laux told a Star reporter in a 2013 interview that the racial distrust was largely out of the control of the chief of police. In response to criticism that Laux had been \"too lax in disciplining officers,\" Layx said that he had been \"hamstrung by process\" in which discipline was reduced to the \"artificial means\" of 'Have my lawyer talk to your lawyer.'\n*September 25, 1992: MPD officer, Jerry Haaf, who had served on the force for thirty years and was retiring from in three months, was shot in the back \"execution-style\" by four gang members in a south Minneapolis Pizza Shack while on his morning coffee break. The men who killed him had allegedly been \"looking for revenge against the Minneapolis Police Department.\" They received life sentences. A September 9, 2002 Minnesota Public Radio report in Haaf's memory, said that \"Haaf's killing came during a low point in police-minority relations at home and nationally.\" The 1992 Los Angeles riots began on April 29, after a trial jury acquitted four officers of the Los Angeles Police Department (LAPD) for usage of excessive force in the arrest and beating of Rodney King. The incident was videotaped and widely shared in TV broadcasts. At the time of Haaf's killing, gangs in Minneapolis were trading \"gunfire daily\" and \"rumors of Minneapolis police misconduct were rampant.\" According to MPR, \"the police administration was at a loss for how to gain the trust of the city's minority residents.\"\n*1991: Minneapolis had the most successful citizen complaint mediation program according to the 2002 edition of Mediating Citizen Complaints Against Police Officers: A Guide For Police and Community Leaders. The creation of the 2002 Guide  was funded by a grant from the United States Department of Justice's (DOJ)  Office of Community Oriented Policing Services (COPS). The Chief of the Minneapolis Police Department, Robert Olson, Pat Hughes and the Minneapolis Police Civilian Review Authority (CRA) staff members, as well Minneapolis Mediation Program mediators participated in the development of the Guide.\n*1993: The Minneapolis Star Tribune reported that police officers have the legal right to use of force.\n*1994–2002: Robert Olson served as Chief of the MPD until his dismissal through federal mediation in 2002.\n*1999: John Delmonico served as president of the Police Officers Federation of Minneapolis (the Federation) from 1999 to 2015,  representing the \"city's rank-and-file officers.\"\nTwenty-first century\n*2001: Communities United Against Police Brutality (CUAPB), which was established, was critical of the 2003 Mediation Agreement between the City of Minneapolis and  federal mediators, who had come together to \"discuss police misconduct.\" Initially, the city refused to do so in spite of the Jordan riot.\n*2002: William McManus began his terms as MPD chief of police. He resigned in 2006 when he joined the San Antonio Police Department.\n*March 2002: A MPD police officer shot and killed a \"machete-wielding Somali man.\"\n**Riots broke out in north Minneapolis in response to the March 2002 shooting death.\n*2003: The MPD \"entered into a federal mediation agreement with the U.S. Justice Department\" to address a number of police issues including \"use of force, diversity and race relations.\" The mediation agreement was intended to \"soothe community tensions\".\n*2005: The Minnesota Legislature 2005 introduced laws to \"improve coordination of gang and drug enforcement efforts\" throughout Minnesota. As part of this \"reorganization\" the state-level Metro Gang Strike Force (2005 - 2009). The legislature had created the state-level Gang and Drug Oversight Council, the \"Council\" (2005 - 2010) to \"establish and supervise multi-jurisdictional task forces and strike forces\" across Minnesota. The Minnesota Gang Strike Force was dissolved at this time. The council had 32 voting members including the Attorney General, chiefs of police selected by the Minnesota Chiefs of Police Association, sheriffs, representative from the Federal Bureau of Investigation, United States Drug Enforcement Administration, Minnesota Tribal Law Enforcement Association, and others.\n*2006: Bob Kroll, who has been a police officer with the Minneapolis Police Department since 1989, was appointed as Federation vice president after having served on the board of directors in 1996.\n**Over 41,593 inmates were book by the Hennepin County Sheriff's Office.\n*2007: By 2007 the Minneapolis-based Hennepin County Sheriff's Office with its headquarters in downtown Minneapolis, was one of the \"largest law enforcement agencies in Minnesota.\" The Sheriff's Office had \"division and unit facilities spread\" throughout Hennepin County. At the time, the Office had a $69&nbsp;million operational budget.\n**Tim Dolan was sworn in as MPD chief of police during a period when the city was experiencing a high homicide rate.\n**Five African-American police officers, including Medaria Arradondo, who had served as a MPD officer since 1989, starting in the Fourth Precinct to become inspector for the First Precinct, sued the department alleging discrimination in promotions, pay, and discipline,  and won. The city settled for $740,000.\n*2009: West St. Paul Police Chief Bud Shaver was chairman of the Metro Gang Strike Force Advisory Board. They submitted their final annual report in February 2009.\n**May 20: The Office of the Legislative Auditor (OLA) submitted their Metro Gang Strike Force Special Review.\n**May: Former attorney general Andrew Luger and former FBI agent John Egelhof were tasked by Michael Campion, Commissioner of the Department of Public Safety, to form a review panel on the Metro Gang Strike Force (MGSF) in response to the negative May 20, 2009 OLA review.\n**Issues identified by the Minnesota Office of Justice Programs (OJP)  staff, the Office of the Legislative Auditor (OLA) and the Luger-Egelhof Report were addressed by the Gang and Drug Oversight Council (\"Council\").\n*2010: A Minneapolis police officer's body-worn camera (BWC) captured evidence that raised concerns that 28-year old David Smith had died of suffocation during a struggle with MPD officers, that took place at the downtown YMCA in 2010. Smith had a history of mental illness. Smith's family's lawyers—the Minneapolis law firm of Gaskins Bennett Birrell Schupp—successfully sued Minneapolis for $3.075&nbsp;million in 2013, the \"second-largest for police misconduct\" in the history of Minneapolis. The officers used the \"controversial\" police technique called  \"prone restraint\" or \"positional asphyxia\", in which officers \"forced Smith onto his stomach, then placed a knee in his back and held him down for about four minutes, which the family attorneys said made it impossible for him to breathe.\"\n**The Minnesota Legislature repealed the Gang and Drug Oversight Council.\n*2012: Janeé Harteau began her term as MPD Chief. She was the first \"female, openly gay, and Native American\" chief in the history of Minneapolis.\n**October The Office of Police Conduct Review (OPCR), a division within the Minneapolis Department of Civil Rights began a process of investigating cases where police have allegedly violated MPD policy, such as \"use of excessive force, inappropriate language or attitude, harassment, and discrimination.\"\n*December 2012: As newly appointed head of the Internal Affairs Unit,  Medaria Arradondo was responsible for investigation of allegations of officer misconduct.\n*2014: Then president of the Federation of police, Delmonico said in an ABC interview that a photo of Mayor Hodges with a black constituent, Navell Gordon, shows her \"throwing up gang signs\" of a \"north-side gang\" and questioned if this \"could incite gang violence in the city?\"\n*October 12:\n*2015: In Minneapolis, the \"duty to intervene\" policy was enacted as one of the police reforms introduced following the 2015 police shooting of Clark. \"Duty to intervene\"when an officer saw a colleague doing something to endanger a member of the publicwas one of the newly introduced policies considered to be \"key to the swift firing and arrest of the four officers\" in the 2020 Floyd case.  Minneapolis city council member, Alondra Cano, said that the reforms had not worked since \"none of the officers took the initiative to follow the policy to intervene.\" Cano said in 2020, that \"it just became really clear to me that this system wasn't going to work, no matter how much we threw at it.\"\n**January: Two St. Paul police officers Dan Peck and Jeremy Doverspike shot and killed 24-year-old Marcus Golden. In response, there were protests by the National Association for the Advancement of Colored People  (NAACP) and also called for a federal investigation. A \"secret grand jury\" decided that they would not lay any charges against the police officers. The grand jury did not present a police report or autopsy results.\n**May: Bob Kroll won his first two-year term as president of the Police Officers Federation of Minneapolis.\n**November 15, 2015: Two MPD officers, Mark Ringgenberg and Dustin Schwarze were involved in the shooting death of Jamar Clark, a 24-year-old African-American man who died as a result of the shooting. Ringgenberg and Schwarze were placed on paid administrative leave. In response to Clark's death, Black Lives Matter organized protests outside the Fourth Precinct police station that lasted for 18 days, as well as other protests and demonstrations in and around Minneapolis. Kroll, as the newly elected president of the Police Officers Federation, criticized the way in which Mayor Betsy Hodges and Chief Janeé Harteau handled the protests. Kroll defended the officers' actions during the shooting, adding that they had no previous disciplinary issues.\n*2016: By 2016, the Police Officers Federation of Minneapolis had approximately 800 members and Kroll was president.\n**July 5: Police officer shot and killed Philando Castile after pulling over his car. The St. Anthony police officer, Jeronimo Yanez, was acquitted of manslaughter.\n**March 30: Hennepin County Attorney Mike Freeman announced that no charges would be filed against Ringgenberg and Schwarze. Freeman said that cases concerning officer-involved shootings would no longer be heard before grand juries. Minneapolis activist, Tyrone Williams \"helped coordinate the 18-day occupation of Minneapolis' Fourth Precinct police station\" in 2015. The NAACP demanded an independent investigation.\n*2017: Medaria Arradondo began his term as Chief of MPD, who is a fifth-generation Minnesota resident, is the first African American to serve as chief of the Minneapolis Police Department. It was during his tenure that the use of officer body camera became mandatory\n**mid-2017: MPD Chief Janee Harteau resigned shortly after the shooting of Justine Damond by Mohammed Noor who was a MPD officer at the time of Damand's death.\n*July 15, 2017: Officer-involved shooting\n*2007–2017: Minneapolis \"paid out $2.1&nbsp;million\" from 2007 to 2017, to \"settle misconduct lawsuits involving police officers from the Third Precinct station in south Minneapolis.\n*2018: Staff report on Minneapolis Police Department (MPD) involvement in pre-hospital sedation (2018-00754).\n**Office of Police Conduct Review Report on Ketamine Use\n**According to the New York Times Black activists in Minneapolis released a report in 2018 that said that the \"oppression of poor people and black people was baked into the very founding of the department in 1867.\" Police reform has roiled politics in the city for years, and politicians who have been seen as slow to reform have been defeated. But only recently have calls to dismantle the police been widely embraced by white leaders in the city.\n**January: Chief Arradondo banned Philadelphia-style tailgating during Super Bowl LII.\n**August: Arradondo ended the practice of low-level marijuana stings—\"pot stings\"—that allegedly targeted African Americans.\n*2019\n**January: Dave Hutchinson won in the 2018 election for Hennepin County Sheriff. His term ended January 7, 2019. He replaced Richard W. Stanek who was Sheriff for 12&nbsp;years. The Sheriff's office, which is at Minneapolis City Hall, has an annual budget of about $125&nbsp;million. The Office works with \"three dozen state legislators, two members of Congress and 45 city mayors\" and has 840 staff members.\n**April 3: Thirty-three year old Minneapolis activist, Tyrone Williams, was killed in front of his mother's home by Strickland-Green in Minneapolis' north side. Williams, a father of four, was the \"brother of former City Council candidate and NAACP activist Raeisha Williams.\"\n**April: In a series of texts, Mayor Betsy Hodges blocked then police Chief Janeé Harteau's decision to appoint John Delmonico as inspector of the Fourth Precinct.  Delmonico had served as President of the police union. Mayor Hodges described Delmonico as \"untrustworthy\" and \"racist.\" Delmonica was passed over for the appointment, sued Hodges for defamation and lost.\n**June 23: Officer-involved shooting\n**August 31: MPD Cases 18-293415 and 18-294338\n**November: A MPD officer of the 4th Precinct Inspector decorated a Christmas tree  \"with a pack of Newport cigarettes, beer cans, police tape and a cup from Popeyes fast-food chain,\" mocking \"precinct's largely African-American population.\"\n**November 9: officer-involved shooting\n**November 30: Under Mayor Jacob Frey, the Minneapolis City Council's Budget Committee voted 9–2 to make changes to the city's budget by shifting \"$1&nbsp;million from MPD to violence prevention and other community initiatives.\"\n*2019\n*August 2: Officer-involved shooting\n*April: Hennepin County Attorney Mike Freeman led the prosecution of former MPD officer Mohamed Noor who was convicted in April of the July 2017 murder and manslaughter of Justine Ruszczyk Damond. Damond had called 911 to report a possible rape, and had approached Noor in his squad car minutes later.  Damond's murder \"made international headlines\".\n**Steve Fletcher, a Minneapolis City Council member, successfully pushed redirecting \"funding for eight new police officers into a new office for violence prevention.\"\n*December 15: During an incident described as an \"Officer Involved Shooting\" situation in which Chiasher Fong Vue, 52, of 3114 Thomas Avenue North died, MPD Sergeant Troy Carlson and MPD Officers Donnell Crayton, Daniel Ledman, Kyle Pond, Travis Williams, Jason Wolff, Aaron Womble, Toua Yang discharged their firearms and Officer Andrew Reed discharged less lethal munitions. The incident was investigated by the Minnesota Department of Public Safety Bureau of Criminal Apprehension (BCA) and all officers involved were placed on administrative leave.\n*2020\n**May\n***May 25: The in-custody murder of George Floyd by Minneapolis police officers was clearly captured in a bystander's viral video shared globally. His murder sparked racial justice protests which spread quickly to over 2,000 cities across the country and more than 60 countries worldwidethe scale and impact of which have been compared to the Civil Rights movement\", Against the backdrop of ongoing racial tensions and the COVID-19 pandemic, a \"perfect storm\" was created, resulting in unpredented support for the Black Lives Matter movement and demands for police reform and racial justice.\n***May 26: After an \"in custody death\" involving MPD officers on the 3700 block of Chicago Avenue South, the Minnesota Department of Public Safety Bureau of Criminal Apprehension (BCA) and the Hennepin County Medical Examiner's Office investigated. The results of their review will be examined by the Hennepin County Attorney's Office and by the FBI, which is \"conducting a separate federal civil rights investigation at the request of the Minneapolis Police Department.\"\n***May 27: Texts and e-mails obtained from Minneapolis by the Minnesota Star Tribune through public records requests in August 2020, show Minneapolis Mayor Jacob Frey called Minnesota Governor Tim Walz on May 27 to request the National Guard to assist the municipality, after peaceful protests evolved into a dangerous situation, resulting in extensive damage to private property. The office of the Governor said these initial phone calls from the Mayor's office were insufficient, as the activation of the National Guard required a detailed official written request on the part of the municipality. Frey maintains he provided timely information and requests to state officials. Troops were not fully deployed until May 28, after significant damage had occurred.\n***May 28: Governor Walz signed Executive Order 20-65 which activated the National Guard in response to the civil unrest. The EO implemented a temporary nighttime curfew and authorized the National Guard to assist local law enforcement in protecting public safety and maintaining peace.\n***May 29: Protesters entered the MPD's Third Precinct station, which had been vacated by police. A fire destroyed the building.\n***May 31: In response to George Floyd's murder, MPD Chief Arradondo fired all four officers involved. He directly addressed the family of George Floyd, stating that his position is that all four officers involved are at fault and he was awaiting charges from the county attorney and/or FBI.\n***May: In a letter to the rank and file members of the MPD union, the Federation president, Kroll, said that police officers had been made \"scapegoats\" and criticized the way the city's \"liberal leadership\" had handled the riots caused by Floyd's murder. Kroll says the city's leaders are \"anti-police\" and have not provided the MPD with \"needed resources and manpower\".\n**June\n***June 3: Governor Walz announced that the Minnesota Human Rights Department will launch a probe into the \"Minneapolis police policies and procedures over the past 10 years to determine whether the department has engaged in discriminatory practices toward people of color.\" Human Rights Commissioner Rebecca Lucero, who will lead the investigation, said the Commission \"will work with city leaders to try to make some quick changes.\" A potential consent decree which will be \"enforced by the courts\" will be part of a longer process.\n****In the wake of Floyd's murder, calls were raised to \"change the funding mechanisms for police departments.\" Minneapolis City Council member, Steven Fletcher suggested a move to defund the police— to \"disband the MPD and start fresh with a community-oriented, non-violent public safety and outreach capacity.\"\n***June 4: Council member Jeremiah Ellison said on Twitter that it is \"past due to \"dismantle\" the MPD, and to \"dramatically rethink how we approach public safety and emergency response.\"\n***June 5: The Hill reported that lawmakers Ilhan Omar U.S. Representative representing  and Alexandria Ocasio-Cortez  called to reduce the budgets of police departments. The New York Times reported that a number of Minneapolis \"elected officials\"—including four members of City Council, \"civic leaders and residents\" called on the city to dismantle the MPD and \"re-imagine the way policing works\" in the wake of the George Floyd's murder by police and the ensuing protests. According to the New York Times, the unrest is national with many \"calling\" to \"defund, downsize or abolish police departments.\" The Times said that elected officials have very \"few levers\" over the police, as they are \"frequently shielded by powerful unions and labor arbitrators who reinstate officers fired for misconduct.\" Minneapolis City Council said that a possible solution would be to implement a program, like Cahoots, already successfully deployed in Eugene Oregon since 1989.  Cahoots is a \"nonprofit mobile crisis intervention program\" in Eugene that handles 24,000 \"mental health calls\" a year representing 20 percent of Eugene's 911 calls. It costs about $2&nbsp;million, which is much less than a police department would cost.\n***June 6: The call to \"defund the police\" has earned widespread support as a rally cry at the protests in the wake of Floyd's murder. The Guardian described how defunding police departments can refer to reinvesting funds elsewhere to protect people with mental health issues and people of colour.\n***June 8: A temporary Hennepin County District Court court order requested by the Minnesota Department of Human Rights resulted in both the City of Minneapolis and the MPD incorporating all the changes \"identified in the court order into their policies, ordinances, and procedures.\" This included a \"complete ban, without exception, on the use of chokeholds and neck restraints.\"\n**August 26: False rumors about the suicide of a homicide suspect who was being pursued by police forces led to a riot on August 26–27. At the time, the homicide was the 52nd of the year in the city. Many of the city's residents were still on edge from the murder of George Floyd the previous May; the police department had mischaracterized Chauvin's murder of Floyd as a death following \"medical distress\" in early statements about the incident. Demonstrators reacting to news of a new shooting death, that video later showed was a suicide, did not trust initial police accounts of the incident. Many stores and business were looted and vandalized, and several fires were reported. Two Minneapolis police officers were seriously injured during the unrest.\n*2021\n**July: Leneal Frazier, an innocent bystander, was killed in a car crash caused by Minneapolis police officer Brian Cummings. The night of July 6, Cummings was pursuing a suspected thief at a high rate of speed when he crashed into Frazier's vehicle. Cummings faced several criminal charges for operating his vehicle negligently, and in 2023 he pleaded guilty to vehicular homicide and received nine-month prison sentence.\n*2022\n**February: Following the killing of Amir Locke,  a 22-year-old Black American man, by a member of the Minneapolis Police Department, inside his apartment while police were executing a no-knock search warrant in a homicide investigation, of which Locke was not a suspect Minnesota Attorney General declined to file criminal charges against the officer in their April 6, 2022 report.\n**April 27: Following a two-year long state investigation, Minnesota's Department of Human Rights found that the municipal police department \"engages in a pattern of race discrimination\". The probe began on May 25, 2020, following the murder of George Floyd by then-Officer Derek Chauvin, who was convicted of murder in the spring of 2021. Investigators examined \"traffic stops, searches, arrests and uses of force\" and reviewed police department policies and training programs. Minneapolis policing practices are also under investigation by the U.S. Department of Justice. Mayor Jacob Frey said the report's findings were \"repugnant\" and \"horrific\" and evoked \"outrage\".\n*November\n**November 3: In a unanimous vote, the Minneapolis City Council confirmed the appointment of Brian O'Hara as Chief of Police succeeding Medaria Arradondo, who served in that position during the crises surrounding the 2020 murder of George Floyd.\n*2023\n**June 16 In response to George Floyd's murder, a multiyear federal investigation was undertaken, resulting in a \"scathing 89-page report\" made public on June 16, 2023. Speaking to the media on June 16 US Attorney General Merrick B. Garland, said that George Floyd's \"death has had an irrevocable impact on the Minneapolis community, on our country and around the world.\" He said that the federal investigation revealed \"patterns and practices\" that \"made what happened to George Floyd possible.\" At the June 16 news conference, Minneapolis officials said that they would work with the federal Justice Department to reach a consent decree—an MPD police department \"overhaul agreement\" monitored by the federal court that would \"force specific changes\".\nSee also\n* Hennepin County Sheriff's Office\n* Minneapolis Police Department\n* List of killings by law enforcement officers in Minnesota\n* List of Minneapolis Chiefs of Police\n* 2020–2022 Minneapolis–Saint Paul racial unrest\n* Aftermath of the George Floyd protests in Minneapolis–Saint Paul\n* Protests in Minneapolis regarding the trial of Derek Chauvin\n* Consent decree\nReferences\nFurther reading\n*"
    }
  ]
}