{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Woodrow Wilson presidency\n\nThe presidency of Woodrow Wilson began on March 4, 1913, when Woodrow Wilson was inaugurated as the 28th president of the United States, and ended on March 4, 1921.\n1913\n* March 4 – First inauguration of Woodrow Wilson\n* March 5 - William Jennings Bryan is sworn in as the 41st United States Secretary of State, Josephus Daniels is sworn in as the 41st United States Secretary of the Navy, and William C. Redfield is sworn in as the 1st United States Secretary of Commerce.\n* April 8 - Wilson addresses a joint session of Congress regarding adjusting tariff duties. It is the first time a President addressed Congress personally since John Adams in 1800.\n* May 31 - The Seventeenth Amendment is ratified\n* October 3 - Wilson signs the Underwood Tariff and the Revenue Act of 1913\n* December 23 - Wilson signs the Federal Reserve Act\n1914\n* July 28 - Austria-Hungary declares war on the Kingdom of Serbia, beginning World War I\n* October 15 - Wilson signs the Clayton Antitrust Act\n* November 3 - The 1914 elections take place\n1915\n* May 7 - A German submarine sinks the RMS Lusitania\n1916\n* January 1 - President Wilson and First Lady Edith Wilson hold their first public reception since the couple wed at the Homestend Hotel in Hot Springs, Virginia.\n* January 2 - Associate Justice of the United States Joseph Rucker Lamar dies from gradual liver failure in Washington, D.C. during the evening.\n* January 12 - Secretary of State Lansing reports that President Wilson warning Americans to leave Mexico continues as the administration's viewpoint on the country.\n* January 13 - President Wilson announces his intent to continue his \"watchful waiting\" policy in regards to Mexico and that the eighteen Americans recently executed there \"were specifically warned not to go to Mexico.\"\n* January 16 - A memorandum is made public in which Secretary of State Lansing requests the American Institute of International Law to compose a study on neutral duties and rights during times of war.\n* January 18 - President Wilson's wishes to appoint Dixon C. Williams to solve the Chicago postmaster problem become public.\n* January 27 - President Wilson gives a speech to the Seventh Annual Dinner of the Railway Business Association during a New York appearance, speaking about America and its army.\n* January 29 - President Wilson delivers an address in Cleveland, Ohio on the bravery of the US and how it affects foreign policy.\n* January 31 - President Wilson delivers a military address in Milwaukee.\n* February 1 - President Wilson delivers a speech in Des Moines, Iowa on guarding the honor of the US when it is questioned.\n* February 2 - President Wilson gives an address to 10,000 people in Kansas City, Missouri, calling for Americans to support his attempts to protect lives and internationally preserve commerce.\n* February 3 - United States Secretary of State Robert Lansing delivers dispatches on foreign affairs to President Wilson.\n* February 4 - The Senate votes 52 to 21 in favor of the Philippine Independence bill during the night hours.\n* November 1 - President Wilson delivers a speech in Buffalo, New York on his intention for the US to battle for its representations.\n* November 2 - President Wilson spends the day campaigning in New York, delivering a speech in the afternoon and three in the night.\n* November 7 – Wilson defeats Republican Charles Evans Hughes in the 1916 presidential election.\n* November 9 - Secretary of State Lansing admits the grave state of the financial situation in Mexico as well as its military, the first instance of someone from the Wilson administration confirming a poor status in Mexico since the beginning of the Mexico-America conference.\n* November 10 - Wilson delivers his first public speech since the election in Wilmington, Massachusetts.\n* December 2 - Two men are arrested on charges of trying to murder President Wilson. President Wilson delivers a speech at the banquet celebrating the illumination of the Statue of Liberty in New York City.\n* December 30 - President Wilson meets with Senator Francis G. Newlands for discussions on the passage of anti-strike legislation in Washington.\n1917\n* March 3 - Arthur Zimmermann admits the authenticity of the Zimmermann Telegram\n* March 4 - Second inauguration of Woodrow Wilson\n* April 6 - Wilson signs the 1917 United States declaration of war on Germany, beginning the U.S. involvement in World War I\n1918\n* November 5 - The 1918 elections take place\n* November 11 - Germany signs the Armistice of 11 November 1918, ending World War I\n1919\n* January 16 - The Eighteenth Amendment is ratified\n* January 19 - The Paris Peace Conference begins to meet\n* June 2 - Anarchists detonate eight bombs in eight U.S. cities, marking the height of the 1919 United States anarchist bombings\n* June 28 - Signing of the Treaty of Versailles\n* October 2 - Wilson suffers a debilitating stroke which largely incapacitates him for the rest of his presidency\n1920\n* January - the economic Depression of 1920–21, in some ways worse than the Great Depression.\n* January 17 - The Eighteenth Amendment comes into force, beginning the era of Prohibition\n* August 18 - The Nineteenth Amendment is ratified\n* November 2 - Republican Warren G. Harding wins the 1920 presidential election\n1921\n* March 4 – Warren G. Harding is inaugurated as the 29th president of the United States, at noon EST.\nSee also\n* Timeline of the William Howard Taft presidency, for his predecessor\n* Timeline of the Warren G. Harding presidency, for his successor\nReferences\nExternal links\n* [https://millercenter.org/president/woodrow-wilson/key-events Miller Center Wilson Presidential Timeline]"
    }
  ]
}