{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Argentine Civil Wars\n\nGobierno del Cerrito\nSupported by:\n| combatant2        =  Unitarians\n* State of Buenos Aires Colorados\n* Gobierno de la Defensa\nSupported by:\nBritish Empire\nFrance\n| combatant3        =\n| commander1        =  Juan Manuel de Rosas   Manuel Dorrego  Justo José de Urquiza   Francisco Ramírez  Facundo Quiroga Chacho Peñaloza22px Manuel Oribe\n| commander2        =  Bartolomé Mitre Bernardino Rivadavia Juan Lavalle José María Paz  Domingo Faustino Sarmiento  Fructuoso Rivera\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n}}\nThe Argentine Civil Wars were a series of internecine wars that took place in Argentina from 1814 to 1876. These conflicts were separate from the Argentine War of Independence (1810 — 1820), though they first arose during this period.\nThe main antagonists were, on a geographical level, Buenos Aires Province against the other provinces of modern Argentina, and on a political level, the Federal Party against the Unitarian Party. The central cause of the conflict was the excessive centralism advanced by Buenos Aires leaders and, for a long period, the monopoly on the use of the Port of Buenos Aires as the sole means for international commerce. Other participants at specific times included Uruguay, and the British and French empires, notably in the French blockade of the Río de la Plata of 1838 and in the Anglo-French blockade of the Río de la Plata that ended in 1850.\nTimeline\n1829\n* Juan Manuel de Rosas and Juan Lavalle sign the Cañuelas Pact.\n* Juan Manuel de Rosas is elected governor of Buenos Aires.\n1830\n* José María Paz defeats Facundo Quiroga in the battle of Oncativo.\n* Paz establish the Unitarian League.\n* Buenos Aires, Entre Ríos and Santa Fe sign the Federal Pact.\n1831\n* Mendoza and Córdoba join the Federal Pact.\n1832\n* Santiago del Estero, La Rioja, Tucumán, Salta, San Luis, Catamarca and San Juan join the Federal Pact.\n* Rosas declines a reelection as governor, the legislature elects Juan Ramón Balcarce.\n1833\n* Rosas starts the first conquest of the desert.\n* Revolution of the Restorers against Balcarce. Juan José Viamonte replaces him as governor.\n1834\n* Viamonte resigns, and Manuel Vicente Maza replaces him.\n1835\n* Facundo Quiroga is murdered in Córdoba.\n* Juan Manuel de Rosas is appointed governor, with the sum of public power.\n* Rosas established the Customs Law\n1836\n* Fructuoso Rivera starts a rebellion against Uruguayan president Manuel Oribe. Birth of the two main Uruguayan parties: Colorados (for Rivera) and Blancos (for Oribe).\n1837\n* Argentina joins the War of the Confederation.\n* Execution of the Reinafé brothers, accused of murder of Quiroga.\n1838\n* France imposes the French blockade of the Río de la Plata to Buenos Aires\n* Rivera ousted Oribe from power, becoming the new president of Uruguay\n* Death of Estanislao López, governor of Santa Fe.\n* Murder of Alejandro Heredia, governor of Tucuman\n1839\n* Rivera declares war to Argentina\n* Berón de Estrada, governor of Corrientes, declares war to Rosas. He was defeated by Echagüe at Pago Largo.\n* Juan Lavalle invades Entre Ríos\n* Failed conspiracy of Ramón Maza against Rosas. The Mazorca kills Manuel Maza during the conflict.\n* Revolution of the \"Libres del Sur\"\n1840\n* Juan Lavalle is defeated by Pascual Echagüe in Entre Ríos at the Battle of Don Cristóbal (10 April 1840) and the Battle of Sauce Grande (16 July 1840).\n* José María Paz is appointed head of the forces of Corrientes\n* France lifts the blockade\n* Manuel Oribe defeats Lavalle in Córdoba in the Battle of Quebracho Herrado\n* Domingo Faustino Sarmiento moves to Chile.\n1841\n* Ángel Pacheco defeats José María Vilela in the Battle of San Cala\n* Unitarian victory in the Battle of Angaco\n* Oribe defeats Lavalle in the battle of Famaillá.\n* Aráoz de Lamadrid is defeated in the Battle of Rodeo del Medio\n* Unitarian victory in the Battle of Caaguazú\n* Lavalle dies in Jujuy, in a confusing episode\n* Justo José de Urquiza is appointed governor of Entre Ríos.\nBibliography\n*"
    }
  ]
}