{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of BBC Parliament\n\nThis is a timeline of the notable events relating to BBC Parliament, its predecessor The Parliamentary Channel and earlier events related to the televising of Parliament in the UK.\n1980s\n*1985\n**23 January – Television coverage of proceedings in the House of Lords begins.\n*1986\n** 9 June – The BBC launches its first parliamentary review programme when the first edition of The Lords This Week (renamed The Week in the Lords later in 1986) is shown on BBC2.\n*1987\n** No events.\n*1988\n** 9 February – MPs vote in favour of allowing television cameras into the House of Commons.\n*1989\n**21 November – Television coverage of proceedings in the House of Commons begins.\n1990s\n*1990\n**No events.\n*1991\n**United Artists Programming initiates a trial project to provide highlights of debates from Parliament in a programme called Yesterday in the Commons to cable networks across the UK.\n*1992\n**13 January – Following on from the success of Yesterday in the Commons, United Artists Cable launches a full time channel providing live and recorded coverage of the British Parliament called The Parliamentary Channel.\n*1993\n** 1 January – Euronews is launched and cable companies show the pan-European news channel during overnight downtime of The Parliamentary Channel, and throughout the periods when The Parliamentary Channel is not broadcasting.\n*1994\n**No events.\n*1995\n** 27 September – The BBC begins regular Digital Audio Broadcasting, from the Crystal Palace transmitting station. Among the channels offered is a relay of events in Parliament.\n* 1996\n** No events.\n* 1997\n** No events.\n* 1998\n** 23 September – Following its purchase of The Parliamentary Channel, the BBC launches BBC Parliament on digital satellite and analogue cable with an audio feed of the channel on DAB.\n** 15 November – The public launch of digital terrestrial TV in the UK takes place. BBC Parliament is carried but due to bandwidth issues, the channel is broadcast in sound only.\n*1999\n**No events.\n2000s\n*2000\n**14 November – The audio service broadcast via DAB closes.\n* 2001\n** No events.\n* 2002\n** 3 June – BBC Parliament broadcasts archived programming for the first time when it reruns the BBC's coverage of the  Queen's Coronation as part of the Golden Jubilee Weekend.\n**7 September – Following the success of its rerun of the BBC's coverage of the Queen's Coronation, BBC Parliament replays coverage of archive BBC general election coverage for the first time. The first to be shown is the coverage of the results of the 1979 general election and the following day the channel shows the results programme of the 1997 general election. These reruns have subsequently been a mainstay of the channel and are usually shown to coincide with anniversaries of their original transmissions.\n** 30 October – A visual feed of BBC Parliament begins broadcasting on digital terrestrial television, having previously only been available as an audio-only service. However capacity limitations mean that the picture is squeezed into just one quarter of the screen with associated text filling the rest of the screen.\n* 2003\n** No events.\n* 2004\n** No events.\n*2005\n** late January – BBC Parliament rebroadcasts a state funeral for the first time when it shows full archive coverage of the state funeral of Sir Winston Churchill to mark the 40th anniversary of the death of Winston Churchill. BBC parliament shows the coverage again a decade later to mark the 50th anniversary of his death.\n** 5 May – Instead of simulcasting the network coverage of the results of the 2005 United Kingdom general election, BBC Parliament airs BBC Scotland's result night coverage.  Two days later, the channel broadcasts a full rerun of the network coverage. This establishes a pattern that BBC Parliament has followed at all subsequent general elections.\n** 5 June – BBC Parliament broadcasts its first theme night of archive programming, to mark the 30th anniversary of the first referendum over Europe by reshowing interviews with the two main party leaders, and broadcasting the two hours of the Referendum results coverage which the BBC retains in its archives.\n* 2006\n**13 November – BBC Parliament broadcasts in full screen format for the first time on the Freeview service, having previously only been available in quarter screen format. The BBC eventually found the bandwidth to make the channel full-screen after receiving \"thousands of angry and perplexed e-mails and letters\", not to mention questions asked by MPs in the Houses of Parliament itself.\n* 2007\n** 1 April – BBC Parliament marks an anniversary of Britain going to war for the first time when it shows Falklands Night to mark the 25th anniversary of the outbreak of the Falklands War. Programming included the BBC's original television news bulletins and reports from the period, alongside editions of Newsnight and excerpts of debates from Question Time. Falklands Night is repeated to coincide with the end of the conflict.\n* 2008\n** August – BBC Parliament is removed from Freeview for the duration of the 2008 Summer Olympics to provide space to provide an additional BBC Red Button option for Freeview users.\n* 2009\n** April – BBC Parliament's idents are changed. They retain the Big Ben motif which had been the theme of the set of idents which had been used since the channel's launch a decade earlier.\n2010s\n*2010\n** No events.\n*2011\n** In House is broadcast for the first time. A replacement of A-Z of Westminster, the new programme is similar in function to its predecessor and seeks to explain some of the strange procedures that occur in Parliament.\n** 26 February – BBC Parliament broadcasts simulcasts Irish public broadcaster RTÉ's general election results programme of the 2011 Irish general election.\n*2012\n** 27 July–12 August – BBC Parliament is removed from Freeview for the duration of the 2012 Summer Olympics on Freeview in post-digital switchover areas to enable BBC Three to broadcast 24 hours a day.\n*2013\n**14 February – After a four-year hiatus, BBC Parliament resumes broadcasting theme nights of archive programming when it broadcasts an evening of selected archive programmes under the title Harold Wilson Night.\n*2014\n** No events.\n*2015\n** No events.\n*2016\n** 5 September – BBC Two begins broadcasting BBC Parliament during its overnight downtime. However it was short-lived and was soon discontinued.\n**10 October – The channel receives a new look and new idents, its first revamp since 2009. The idents based on clock workings, with colours and images derived from the flags and assemblies of the British home countries and the European Parliament.\n*2017\n**12 May – To mark the 80th anniversary of the coronation of King George VI, BBC Parliament shows Pathe's original coverage of the coronation and Pathe's colour film of the coronation processions to and from Westminster Abbey. This is the first time that BBC Parliament has used Pathe's archive to form the bulk of an archive broadcast.\n*2018\n**12 July – The BBC announces cut-backs to BBC Parliament. The channel will now close down in the weeks when no UK parliamentary bodies are in session and all programmes made especially for the channel will end.\n**10 October – The BBC announces it has reversed the planned cuts to the output of BBC Parliament.\n*2019\n**3 June – For the first time, BBC Parliament broadcasts a rerun of BBC coverage of an American election when it shows the BBC's coverage of the results of the 2016 United States presidential election. It is timed to coincide with Donald Trump's state visit to Britain.\n**September/October – BBC Parliament broadcasts the Party conference season for the final time because, by the time the next conferences take place, the channel will have ended its wider political coverage.\n2020s\n*2020\n**15 July – The BBC announces that it will “no longer commission most of the other bespoke programmes we currently make for BBC Parliament, although we will continue to draw on our archive to broadcast our popular historical election coverage.” This is part of plans the BBC set out at the start of the year to modernise BBC News against the backdrop of having to find £80 million of savings.\n**30 and 31 October – BBC Parliament broadcasts archive programming for the final time when it rebroadcasts the BBC's coverage of the results of the February 1974 and October 1974.\n*2021\n**22 February – BBC Parliament adopts a new on-screen look and graphics to be more in style with the current BBC news programmes. There are no changes to the idents used or to the music used between programmes.\n**26 July-31 August – Instead of broadcasting highlights from the previous Parliamentary term during Parliamentary recesses, BBC Parliament simulcasts the BBC News Channel for the first time during a parliamentary recess. Since then, the News Chanel has been broadcast on the channel during the Christmas, Easter and summer recesses, meaning that the channel is now effectively off-air at these times.\n** 31 August – The cutbacks announced last year see BBC Parliament relaunched as a channel which only provides unedited live and recorded coverage from Westminster and the devolved chambers. Consequently, the channel's wider political coverage, its archive reruns and its bespoke highlights programmes end.\n*2022\n**12 April – BBC Parliament starts broadcasting in high definition, initially only on the Virgin Media platform.\n**14-19 September – BBC Parliament broadcasts a continuous live feed of the Queen's lying in state at Westminster Hall allowing people who cannot make the trip to London to pay their respects virtually. Since the Queen's death on the 8th, the channel had carried the BBC News Channel apart from when the various Parliaments and Assemblies were in session to pay tributes to The Queen.\n*2023\n** No events.\n*2024\n** 4 July – BBC Parliament broadcasts the BBC News Channel feed to cover the results of the 2024 general election. Previously, the channel had broadcast BBC Scotland's election results programme, having done so since 2005.\n*2025\n** 26 March – BBC Parliament's on-air look is refreshed.\nReferences"
    }
  ]
}