{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of pre–United States history\n\nThis section of the timeline of United States history concerns events from before the lead up to the American Revolution ().\nAntiquity\n* 27,000–12,000 years ago – Humans cross the Beringia land bridge into North and then South America. Dates of earliest migration to the Americas is highly debated.\n*c. 15,500 year old arrowhead; oldest verified arrowhead in the Americas, found in Texas.\n*c. 11,500 BCE – Start of Clovis Culture in North America.\n*c. 10,200 BCE – Cooper Bison skull is painted with a red zigzag in present-day Oklahoma, becoming the oldest known painted object in North America.\n*c. 9500 BC – Cordilleran and Laurentide Ice Sheets retreat enough to open a habitable ice-free corridor through the northern half of the continent (North America) along the eastern flank of the Rocky Mountains.\n*c. 1000 BCE-1000 CE – Woodland Period of Pre-Columbian Native Americans in Eastern America.\n*200 CE – Pyramid of the Sun built near modern-day Mexico City.\n*250–900 CE – Classic Period of the Maya Civilization\n*600 CE – Emergence of Mississippian culture in North America.\n988–1490\n* 986 – Norsemen settle Greenland and Bjarni Herjólfsson sights coast of North American mainland, but doesn't land (see also Norse colonization of the Americas).\n* : Norse settle briefly in L'Anse aux Meadows in Newfoundland.\n* c. 1100 – Oraibi was founded the year of 1128 CE, making it one of the oldest continuously inhabited settlements within the United States.\n*c. 1100-1200 – Cahokia near modern-day St. Louis reaches its apex population\n*c. 1190 – Construction begins on the Cliff Palace by Ancestral Puebloans in modern-day Colorado\n*c. 1325 – Tenochtitlan founded as part of the Aztec Empire\n*c. 1400 – Beginning of the European Age of Discovery.\n* : Norse colony in Greenland dies out.\n* 1473 – João Vaz Corte-Real perhaps reaches Newfoundland; writes about the \"Land of Cod fish\" in his journal.\n* 1479 - Treaty of Toledo ends the War of the Castilian Succession.  Portugal won the exclusive right of navigating, conquering and trading in all the Atlantic Ocean south of the Canary Islands, forcing Spain to sail west to India.\n**\n* before 1492 – Population estimates in the New World before European contact may be as high as 112 million people.\n1492–1499\n, depicts Christopher Columbus landing in the New World.]]\n*1492 – Christopher Columbus, financed by Spain, lands on the island of San Salvador in the Bahamas, discovering the New World for Europe.\n*1496 – Santo Domingo, the oldest continuously inhabited European settlement in the Americas, is settled.\n*1497 – John Cabot lands in Newfoundland, beginning the British colonial presence in Continental North America.\n1500–1599\n* 1500 – Disappearance of Mississippian culture.\n*1503 – Jaragua massacre\n*1504 – Higüey massacre\n*1507 – A new world map by Martin Waldseemuller names the continents of the New World \"America\" in honor of Amerigo Vespucci.\n*1508 – First European colony and oldest known European settlement in a United States territory is founded at Caparra, Puerto Rico, by Juan Ponce de León.\n*1512 – Laws of Burgos\n*1513 – Vasco Núñez de Balboa crosses isthmus of Panama, sees the Pacific Ocean.\n*1517 – Protestant reformation\n*1520s – Spanish begin the conquest of Aztec civilization.\n*1521 – Hernán Cortés conquered the Aztec empire.\n*1524 – Giovanni da Verrazzano, working for France, explores coastline from present-day Maine to North Carolina.\n*1526 – Lucas Vázquez de Ayllón briefly establishes the failed settlement of San Miguel de Gualdape in South Carolina, the first site of enslavement of Africans in North America and of the first slave rebellion.\n*1534 – Jacques Cartier plants a cross on the Gaspé Peninsula (modern Quebec) and claimed the land for France.\n*1539 – Hernando de Soto had 200 executed, in what was to be called Napituca Massacre.\n*1540 – Francisco Vázquez de Coronado is infamous for the Tiguex Massacres, after seizing the houses, food and clothing of the Tiwa Puebloans and raped their people, his army found themselves in conflict with the Rio Grande natives, which led to the brutal Tiguex War.\n*1540 – Pedro de Tovar comes in contact with the Hopi people at Oraibi as part of the expedition led by Francisco Vázquez de Coronado\n*1541 – Hernando de Soto discovers the Mississippi River, strengthening Spanish claims to the interior of North America.\n*1562 – Jean Ribault, leaves France with 150 colonists for the New World, establishing Charlesfort on Parris Island in South Carolina, which was abandoned several years later.\n*1564 – French Fort Caroline established on the banks of the St. Johns River, Florida; Colonized by huguenots, sacked by Pedro Menéndez de Avilés in 1565.\n*1565 – Admiral Pedro Menéndez de Avilés founds St. Augustine, Florida, the earliest successful Spanish/European settlement in the future continental United States.\n*1570s – Iroquois Confederacy founded.\n*1579 – Francis Drake claims the lands of California for England and Queen Elizabeth I, landing in Drake's Bay and naming it New Albion.\n*1585 – Sir Walter Raleigh founds Roanoke Colony, the first English settlement in the New World, though he never set foot in it.\n*1587 – Virginia Dare was born on Roanoke, making her the first English child known to be born in the New World. The first Asians to set foot on what would be the United States occurred when Filipino sailors arrived in Spanish ships at Morro Bay, California; see Landing of the first Filipinos.\n*1588 – First battle of the English against the Spanish Armada begins, leading to their defeat and the lessening of Spain's influence in the New World and the rise of English influence in the Americas.\n*1590 – Roanoke Colony found deserted.\n*1599 – Juan de Oñate and Vicente de Zaldívar committed the Ácoma Massacre killing approximately 500 warriors and 300 civilians of the Acoma Pueblos. And committed the Sandia Mountains massacre, killing 900 Tompiro Indians. King Philip III later punished Oñate for his cruelty.\n1600–1699\n1600s\n*1602 – Bartholomew Gosnold is the first Englishman to land on the New England coast, exploring and naming Cape Cod and Martha's Vineyard.\n*1605 –  First capital of Acadia (French) was established as Port-Royal in modern-day Nova Scotia; it lasted until 1613. George Weymouth explores New England.\n*1606 – The joint-stock company Virginia Company of London is founded and granted a Royal Charter by James I to settle in the New World.\n*1607 – Establishment of Jamestown, the first permanent English settlement in the Americas. The short lived Popham Colony founded in Maine by the Virginia Company of Plymouth.\n*1608 – Founding of Quebec (Habitation de Québec) by Samuel de Champlain.\n*1609 – Henry Hudson explores the Hudson River and Delaware Bay for the Dutch.\n*1609–10 – The Starving Time at Jamestown.\n1610s\n*1610 – Santa Fe, New Mexico established by Spain\n*1612 – The Dutch establish a fur trading center with the Native Americans on Manhattan Island.\n*1614 – Dutch claim New Netherland. John Rolfe successfully harvests tobacco in Jamestown, Virginia, ensuring the colony's success.\n*1615 – Fort Nassau (North River) founded near Albany, New York.\n*1617–19 – Smallpox kills roughly 90% of the Massachusetts Bay Indians\n*1619 – First enslaved Africans to the North American colonies arrived in Jamestown, Virginia aboard the White Lion. The House of Burgesses, the first democratically elected legislative body in English North America was formed in Jamestown.\n*1619 – Squanto return to northeast America after living in England.\n1620s\n'' in Plymouth.]]\n*1620 – Mayflower Compact signed. Plymouth Colony is founded in what would be Massachusetts, by the Plymouth Company.\n*1621 – Anthony Johnson is held as an Indentured servant in the Colony of Virginia.\n*1622 – Indian massacre of 1622 in Virginia.\n*1624 – King James I revokes the Virginia Company's charter, and Virginia becomes a royal colony. Foundation of New Amsterdam by the Dutch West India Company; would later be renamed New York.\n*1625 – King James I dies; King Charles I becomes King of England\n*1628 – Massachusetts Bay Colony founded.\n1630s\n, the founder of Maryland]]\n*1630 – Winthrop Fleet to Massachusetts Bay Colony. Manor of Rensselaerswyck founded. Boston founded.\n*1632 – Province of Maryland founded.\n*1634 – Theologian Roger Williams banished from Massachusetts Bay Colony.\n*1636 – Connecticut Colony founded by Thomas Hooker.\n*1636 – Colony of Rhode Island and Providence Plantations founded by Roger Williams.\n*1636 – Harvard College founded.\n*\n*1637 – New Haven Colony founded.\n*1638 – The Free Grace Controversy ended, when Anne Hutchinson was banished from the Massachusetts Bay Colony.\n*1638 – Roger Williams founded the First Baptist Church in America.\n*1638 – Pequot War ends in New England. New Sweden established around the southern Delaware River by Peter Minuit.\n*1639 – Fundamental Agreement of the New Haven Colony signed. Fundamental Orders of Connecticut adopted and the Crown formally recognizes the Virginia Assembly.\n1640s\n*1640 – French and Iroquois Wars escalate to full warfare.\n*1640 – Virginia courts sentence John Punch a black indentured servant to life of servitude for running away from an abusive plantation owner Hugh Gwyn.\n*1642 – Beginning of the English Civil War. Montreal founded.\n*1643 – New England Confederation created.\n*1643–1645 – Kieft's War in New Netherland.\n*1644–1646 – Third Anglo–Powhatan War\n*1649 – Maryland Toleration Act. Execution of King Charles I and the establishment of Commonwealth in England.\n1650s\n*1651 – In the wake of the English Civil War, Virginia acknowledges the authority of the Parliament of England.\n*1655 – New Sweden becomes incorporated into the Dutch colony of New Netherland\n*1655 – John Casor was declared a slave for life after Anthony Johnson, a free black man, sued Robert Parker for stolen services.\n*1656 – Elizabeth Key Grinstead was one of the first black people to sue for freedom for alleged slavery and win.\n*1656 – First Quakers arrive in New England.\n*1655 – Peach War\n*1658 – Death of Oliver Cromwell\n*1659–1663 – Esopus Wars\n1660s\n*1660 – Commonwealth of England collapses, Charles II is restored to the throne.\n*1660 – The Royal African Company is founded.\n*1662 – The Virginia Colony passed a law incorporating the principal of partus sequitur ventrem, ruling that children of enslaved mothers would be born into slavery, regardless of their father's race or status\n*\n*1662 – Halfway Covenant adopted.\n*1663 – The Rhode Island Royal Charter provided recognition to the Colony of Rhode Island and Providence Plantation, and outlined many freedoms including freedom of religion and acknowledged Indian rights to the soil.\n*1663 – King Charles II grants charter for a new colony, (Province of Carolina).\n*1663 – Gloucester County, Virginia Revolt\n*1664 – New Amsterdam captured by the English at the start of the Second Anglo-Dutch War. New Jersey and New York established as Proprietary Colonies of England.\n*1665 – The Duke's Laws are issued.\n*1667 – New Netherland ceded to England under Treaty of Breda.\n*1667 – Virginia law enacted, declaring that baptism of slaves does not exempt them from bondage.\n*1669 – Virginia law enacted, that killing one's own enslaved people was not a felony.\n*1669 – The Fundamental Constitutions of Carolina are drawn up.\n*1669–1670 – John Lederer of Virginia explores the Appalachian Mountains.\n1670s\n*1670 – Charles Town (Charleston) founded in present-day South Carolina.\n*1671 – The Batts-Fallam expedition sponsored by Abraham Wood reaches the New River (West Virginia).\n*1672 – Blue Laws enacted in Connecticut.\n*1672–73 – Louis Jolliet and Jacques Marquette explore the Illinois Country.\n*1674 – New Netherland permanently relinquished to English with Treaty of Westminster.\n*1675 – King Philip's War (1675–76) in New England.\n*1676 – Bacon's Rebellion in Virginia; Bacon writes the \"Declaration of the People of Virginia\".\n*1677 – Colonists in North Carolina rebel against Thomas Colepeper, 2nd Baron Colepeper. Edmund Andros, Governor of New York, negotiates the Covenant Chain with the Iroquois. Province of Maine absorbed by Massachusetts Bay Colony.\n*1679 – War between the Westo and colonial South Carolina results in the destruction of the Westo. The Province of New Hampshire is created out of the Massachusetts Bay Colony by royal decree from King Charles II.\n1680s\n*1680 - Pueblo Revolution\n*1681 – William Penn receives a royal charter from Charles II to establish Pennsylvania.\n*1682 – René-Robert Cavelier, Sieur de La Salle explored the Ohio River Valley and the Mississippi River Valley, and he claimed the entire territory for France as far south as the Gulf of Mexico. William Penn publishes \"Frame of Government of Pennsylvania\" that provides for a precursor of a bicameral government. Philadelphia founded.\n*1685 – Charles II dies and his brother the Duke of York becomes King James II. Fort St. Louis (French colonization of Texas) established near Arenosa Creek on Matagorda Bay by French explorer Robert Cavelier de La Salle; the fort was abandoned in 1688.\n*1686 – Arkansas Post established by Henri de Tonti as the first European settlement in the lower Mississippi River Valley.\n*1688 - The first recorded formal protest against slavery, the 1688 Germantown Quaker Petition Against Slavery.\n*1688–97 – King William's War, the North American theater of the Nine Years' War.\n*1688 – The Glorious Revolution occurs; King James II flees to France and is replaced by William and Mary of Orange.\n*1689 – The English Parliament presents the English Bill of Rights to William and Mary and is later used as one of the models for the United States Bill of Rights. The Boston Revolt and Leisler's Rebellion occurs. Toleration Act 1688 is passed by Parliament which gives limited freedom of religion to all English subject.\n1690s\n*c. 1690 – Spanish authorities, concerned that France posed a competitive threat, constructed several missions in East Texas; see Spanish Missions in Texas.\n*1690 – The first newspaper issue in the English colonies is published in Boston, the Public Occurrences.\n*1692 – Salem Witch Trials\n*1693 – College of William & Mary founded in Williamsburg, Virginia. Rice culture introduced in the Province of Carolina.\n*1694 – Mary II dies, William III takes sole rule over England.\n*1696 – Cahokia, Illinois established by French missionaries from Quebec and is one of the earliest permanent settlements in the region.\n*1697 – The Treaty of Ryswick ends King William's War and restores all colonial possessions to pre-war ownership.\n*1698 – The Parliament of England's Trade with Africa Act 1697 comes into effect, ending the Royal African Company's monopoly on English trade with Africa, including the Atlantic slave trade. The act, which was passed in part due to heavy pressure from merchants in England's American colonies, results in the number of Africans transported to the American colonies being increased from 5,000 to 45,000 per annum.\n*1699 – Capital of Virginia moved from Jamestown to Williamsburg; Jamestown is slowly abandoned. The Wool Act forbade the export of wool from the American colonies. Free blacks ordered to leave the Colony of Virginia.\n1700–1759\n1700s\n*1700 – José Romo de Vivar becomes one of the earliest European (Spanish) settlers in the future state of Arizona.\n*1701 – The Collegiate school at Saybrook is founded in Connecticut; it will later be renamed as Yale College. Delaware Colony granted charter, separating it from Pennsylvania.\n*1702 – William III dies, is succeeded by Queen Anne. Queen Anne's War (War of the Spanish Succession) begins. East Jersey and West Jersey become crown colonies. Mobile, Alabama founded.\n*1703 – Kaskaskia, Illinois established as a small mission station for the French.\n*1704 – The first regular newspaper publishes its initial edition in Boston, the News-Letter and was begun by John Campbell. The Province of Carolina allows the arming of the enslaved population during time of war.\n*1705 – The House of Burgesses passes the Virginia Slave Codes of 1705.\n*1706 – Benjamin Franklin born in Boston. Albuquerque founded and named for the viceroy of New Spain, Francisco Fernández de la Cueva, 10th Duke of Alburquerque.\n1710s\n*1710 – Francis Nicholson takes Port Royal.\n*1711–15 – North Carolina fights the Tuscarora War with the Tuscarora people.\n*1712 – New York Slave Revolt of 1712.\n*1713 – The Treaty of Utrecht is signed, bringing an end to Queen Anne's War; England gains Nova Scotia.\n*1714 – Queen Anne dies; succeeded by George I. Natchitoches established by Louis Juchereau de St. Denis, making it the oldest permanent European settlement in the modern state of Louisiana.\n*1715 – South Carolina begins the Yamasee War.\n*1718 – Mission San Antonio de Valero (The Alamo) built as the first Spanish mission along the San Antonio River. New Orleans founded by the French. Blackbeard is killed in battle by lieutenant Robert Maynard in the waters off the Province of North Carolina.\n1720s\n*1723 – The House of Burgesses passes an act to deal with slave rebellions. The French establish Fort Orleans along the Missouri River near Brunswick, Missouri.\n*1725 – Father Rale's War (1722–25)\n*1727 – George I dies, is succeeded by George II. British construct Fort Oswego.\n*1729 – Province of Carolina proprietors sell out to Crown. City of Baltimore founded.\n1730s\n*c. 1730 – For the first time, the majority of the enslaved population in Chesapeake, Virginia were born in the Americas.\n*1732 – The Province of Georgia is founded by General James Oglethorpe. Where slavery was prohibited.\n*1735 – John Peter Zenger is found innocent of libel by the New York City trial on August 4.\n*1737 – Benjamin Lay writes All Slave-Keepers That Keep the Innocent in Bondage, Apostates. Published by Benjamin Franklin in Philadelphia.\n*1739 – The Stono Rebellion in the Province of South Carolina is crushed.\n*1739-40 – George Whitefield begins his travels throughout the colonies. His message of everyday Christians having a personal connection with God resonates and begins the First Great Awakening.\n1740s\n*1740 – The Plantation Act 1740 is passed to encourage immigration to the Thirteen Colonies and regularize the colonial naturalization procedures. Battle of Cartagena de Indias, where the colonists are called \"Americans\" for the first time. James Oglethorpe fails to take St. Augustine.  South Carolina enacts the Negro Act of 1740.\n*1741 – The New York Conspiracy of 1741 is suppressed.\n*1744 – King George's War (1744–48)\n*1745 – New Englanders take Louisbourg.\n*1746 – Princeton University founded, with Jonathan Dickinson as its first president.\n*1747 – Founding of the Ohio Company.\n*1749 – Province of Georgia overturns its ban on slavery. Father Le Loutre's War (1749–55)\n1750s\n*c. 1750 – Population of the Thirteen Colonies is roughly 1.5 million.\n*1750 – Thomas Walker passes through the Cumberland Gap.\n*1751 – The ban on slavery was lifted after 19 years in the Province of Georgia.\n*1752 – Benjamin Kent represented slaves in court against their masters in Massachusetts.\n*1754 – French and Indian War begins, which was a theater of the Seven Years' War; first engagement at the Battle of Jumonville Glen. Albany Congress, in which a \"Union of Colonies\" is proposed. Columbia University founded as King's College by George II Royal Charter.\n*1757 – Siege of Fort William Henry.\n*1758 – Siege of Louisbourg; Battle of Fort Frontenac; Battle of Fort Duquesne.  The first black Baptist church is founded in Lunenburg, Virginia.\n*1759 – Quebec is taken, British victory assured in French and Indian War.\n:See Timeline of the American Revolution for events starting from 1760.\nSee also\n* Timeline of the colonization of North America\n* Colonial history of the United States\n* Timeline of United States history\n* Timeline of the American Revolution\nReferences"
    }
  ]
}