{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of modern Armenian history\n\nOttoman rule and transition from Iranian to Russian rule (1804–1914)\nin 1827 by the Russian forces marked the transition of Persian rule to Russian rule of Eastern Armenia]]\n]]\n]]\n*1804: Russo-Persian War begins\n*1813 October 24: Treaty of Gulistan, Karabakh becomes part of the Russian Empire\n*1815: Lazaryan School opened in Moscow\n*1824 October 1: Nersisyan School opened in Tiflis\n*1825 December 14: Decembrist revolt in Saint Petersburg\n*1826: Russo-Persian War begins\n*1827 October 27: Russians capture Erivan\n*1828 February 21: Treaty of Turkmenchay, most of Eastern Armenia becomes part of the Russian Empire\n*1828–1829: Over 50,000 Armenians from Ottoman Empire and Iran migrate to Russian Armenia\n*1828 October 9: Khachatur Abovian and Friedrich Parrot reach the summit of Mount Ararat for the first time\n*1836: Polozhenie (Statute) decree allows Armenian language schools in the Russian Empire, regulates the Armenian church\n*1840: Armenian Oblast disintegrated\n*1848 April 14: Khachatur Abovian disappears\n*1850: Erivan Governorate established\n*1858: Wounds of Armenia published in Tiflis\nArmenian national liberation movement\n*1862 August 2: Zeytun uprising\n*1863: Armenian National Constitution\n*1872: Mshak starts to be published in Tiflis\n*1874: Gevorkian Theological Seminary opened in Ejmiatsin\n*1878: Russo-Turkish War begins, Kars becomes part of Russia, Kars Oblast established\n*1878 March 3: Treaty of San Stefano\n*1878, June 13 – July 13: Congress of Berlin\n*1881 March 1: Alexander II of Russia assassinated by anarchists, Alexander III of Russia becomes emperor\n*1882: Armenian newspapers and schools closed in the Russian Empire\n*1885: Armenakan Party founded in Van\n*1887: Social Democrat Hunchakian Party founded in Geneva, Switzerland\n*1888 April 25: Raffi dies in Tiflis\nArmed movement (1889–1907)\n*1889 May: Bashkale clash\n*1890: Armenian Revolutionary Federation founded in Tiflis\n*1890 September 27: Gugunian Expedition\n*1892: Mkrtich Khrimian becomes Catholicos of All Armenians\n*1894 October 20: Nicholas II becomes Emperor of Russia\n*1894: First Sasun Resistance\n*1894–1896: Hamidian massacres\n*1895 October: Zeitun Rebellion begins\n*1896 June 3–11: Defense of Van\n*1896 August 26: Ottoman Bank Takeover\n*1897 July 25–27: Khanasor Expedition\n*1901 November: Battle of Holy Apostles Monastery\n*1903 June 12: depriving the Armenian Church of the right of administering its own property\n*1904: Second Sasun Resistance\n*1905 January 22: Revolution of 1905 starts in Russia\n*1905–1906: Armenian–Tatar massacres of 1905–1906\n*1905 July 21: Yıldız assassination attempt in Constantinople\n*1906 March: 1906 Russian legislative election\n*1907 May: Battle of Sulukh with the Kurds, Kevork Chavush killed.\n*1907 October 27: Mkrtich Khrimian dies\nSecond Constitution Era (1908–1914)\n*1908 July 3: Young Turk Revolution began.\n*1908 July 24: Abdül Hamid II announced restoration of the constitution.\n*1909 March 31: 31 March Incident\n*1909 April: Adana massacre\n*1909 April 27: Abdul Hamid II deposed from power\n*1911: George V becomes Catholicos of All Armenians\n*1912 January: Over 150 members of the Armenian elite arrested for \"revolutionary\" activities in Russia.\n*1914 February: Armenian reform package\nWorld War I and Armenian genocide (1914–1918)\n]]\nin 1915–1918.]]\n*1914 June 28: Gavrilo Princip assassinated the Archduke Franz Ferdinand of Austria in Sarajevo, Bosnia\n*1914 July 28: Austria-Hungary declares war on Serbia, start of the Great War\n*1914 August 2: Germany attacks Belgium, declares war on Russia; Armenian congress at Erzurum\n*1914 November 1: Bergmann Offensive, the start of World War I in the Caucasus\n*1915 January 17: Russians capture Sarikamish\n*1915 January 18: Russians capture Ardahan\n*1915 March: Zeitun Resistance\n*1915 April 24: Hundreds of Armenian intellectuals deported from Constantinople into central Anatolia.\n*1915 April–May: Defense of Van (1915)\n*1915 May 27: Tehcir Law. The mass deportation of Ottoman Empire's Armenian population begins.\n*1915 June: Shabin-Karahisar uprising, Musa Dagh Resistance\n*1915 July 26: Russians capture Manzikert\n*1915 September–October: Urfa Resistance\n*1916 February: Russians capture Erzurum\n*1916 April 15: Russians capture Trebizond\n*1916 July: Russians capture Erzincan\n*1916 August: Russians capture Bitlis\n*1917 February 23: Russian Revolution begins, Russian forces start to retreat.\n*1917 November 7: Bolshevik rule established in Russia.\n*1917 December 5: Armistice of Erzincan between Bolshevik Russian and the Ottoman Empire.\n*1918 February: Turks recapture Erzurum\n*1918 March: Turks recapture Van\n*1918 March 3: Treaty of Brest-Litovsk Bolshevik Russia, Germany, Austria and the Ottoman Empire.\n*1918 April 25: Turks captures Kars\n*1918 May 26: Ottoman armies stopped at the Battle of Sardarabad.\nFirst Republic of Armenia (1918–1920)\n*1918 May 28: Republic of Armenia declared by the Armenian National Council in Tiflis.\n*1918 June 4: Treaty of Batum\n*1918 October 30: Armistice of Mudros\n*1918 November 13: Allied Occupation of Constantinople begins.\n*1919 January; Republic of Armenia establishes de facto control over former Kars Oblast after the Ottomans retreat.\n*1919 January 29: Aram Manukian, the founder of the Republic of Armenia, dies in Yerevan.\n*1919 May 28: United Armenia proclaimed in Yerevan\n*1919 June 26: Treaty of Versailles\n*1919 July 5: Turkish Courts-Martial sentenced Talaat Pasha, Enver Pasha, Djemal Pasha Nazım Bey to death. [http://www.armenian-genocide.org/Affirmation.237/current_category.50/affirmation_detail.html]\n*1920 May: May uprising\n*1920 August 10: Treaty of Sèvres\n*1920 September 29: Turks capture Sarikamish\n*1920 October 30: Turks capture Kars\n*1920 November 7: Turks capture Alexandropol\n*1920 November 22: US President Woodrow Wilson signs the arbitral award, establishing the border between Turkey and Armenia, Western Armenia de jure part of the Republic of Armenia.\n*1920 November 29: Soviet army invades Armenia, end of Armenian independence.\nSoviet Armenia and the Armenian diaspora (1920–1991)\n}}\nInterwar period (1920–1938)\n*1920 December 2: Treaty of Alexandropol\n*1921 February–April: February Uprising\n*1921 March 15: One of the three main Armenian genocide organizers, Talaat Pasha, killed by Soghomon Tehlirian in Berlin\n*1921 March 16: Treaty of Moscow\n*1921 July 13: Republic of Mountainous Armenia falls\n*1921 October 13: Treaty of Kars\n*1922 July 21: One of the three main Armenian genocide organizers, Djemal Pasha, killed by Armenian nationalists in Tiflis\n*1922 September: Great Fire of Smyrna\n*1923 March 23: Hovhannes Tumanyan dies in Moscow\n*1923 July 7: Nagorno-Karabakh Autonomous Oblast established\n*1924 January 31: 1924 Soviet Constitution\n*1927 August 31: Andranik Ozanian dies in California\n*1930: Holy See of Cilicia moved to Lebanon\n*1931 August 27: 1931 Zangezur earthquake\n*1933 December 24: Archbishop Leon Tourian assassinated by ARF members in New York\n*1935 October 22: Komitas Vardapet dies in Paris\n*1936–1938: The Great Purge in Armenia, see Armenian victims of the Great Purge\n*1936 July 9: Armenian First Secretary Aghasi Khanjian killed by Lavrentiy Beria\n*1937 September 23: Grigory Arutinov becomes the First Secretary of the Communist Party of Armenia until 1953\n*1937 November 27: Yeghishe Charents dies in Yerevan prison\n, Chief of Staff of the Navy Ivan Isakov, Chief Marshal of the Mechanized Forces Hamazasp Babadzhanian, Marshal of Aviation Sergei Khudyakov.]]\nWorld War II (1939–1945)\n*1939 September 1: Germany invades Poland, World War II starts\n*1941 June 22: Germany invades the Soviet Union, Operation Barbarossa starts. An estimated 300 to 500,000 Armenians served in the war, almost half of whom did not return.\n*1941 August 23: Battle of Stalingrad begins\n*1945 April 30: Reichstag captured by the Soviet army, military defeat of the Third Reich\n*1945 May 9: Germany unconditionally surrenders\nCold War (1946–1987)\n*1949 April 4: NATO established\n*1953 March 5: Joseph Stalin dies\n*1953 September 14: Nikita Khrushchev becomes the First Secretary of the Communist Party of the Soviet Union\n*1954 March 11: Anastas Mikoyan calls for the rehabilitation of Charents in Yerevan, beginning the Khrushchev Thaw and de-Stalinization in Armenia\n*1955 May 14: Warsaw Pact established\n*1955 September 6–7: Istanbul pogrom\n*1955 December 21: Garegin Nzhdeh dies in Moscow\n*1956: Holy See of Cilicia breaks away from the Mother See of Holy Etchmiadzin\n*1957 October 17: Avetik Isahakyan dies in Yerevan\n*1958 September 2: Soviet MiG-17 pilots shot down a US Air Force C-130 aircraft over Soviet Armenia with 17 crewman aboard, after the aircraft inadvertently penetrated denied airspace. It crashed near the village of Sasnashen, 34 miles northwest of Yerevan.\n]]\n*1964: Leonid Brezhnev becomes leader of the Soviet Union, start of the Stagnation era\n*1965 April 24: Up to few hundred thousands of people demonstrate in Yerevan for the 50th anniversary of the Armenian genocide\n*1966 April 24: National United Party, a secret nationalist party, founded in Yerevan\n*1966: Anton Kochinyan becomes the First Secretary of the Communist Party of Armenia until 1974\n*1967 November 29: Tsitsernakaberd, the official Armenian genocide memorial opened in Yerevan [http://www.genocide-museum.am/arm/Description_and_history.php]\n*1971 June 17: Paruyr Sevak dies in Yerevan.\n*1972 May 5: Martiros Saryan dies in Yerevan.\n*1973 January 27: Kourken Yanigian assassinates Los Angeles Turkish consul general and vice-consul in Santa Barbara, California.\n*1974: Karen Demirchyan becomes the First secretary of the Communist Party of Armenia until 1988.\n*1975: Armenian Secret Army for the Liberation of Armenia founded in Beirut, Lebanon.\n*1977 January 8: Moscow bombings, allegedly, by the National United Party.\n*1978 May 1: Aram Khachaturian dies in Moscow.\ncarried out a number of armed attacks on Turkish embassies around the world in the 1980s.]]\n*1981 March 21: Arpa-Sevan tunnel put into use.\n*1981 May 18: William Saroyan dies in Fresno, California\n*1981 September 24–25: Turkish consulate attack in Paris by ASALA\n*1982 August 7: Esenboğa International Airport attack by ASALA\n*1982 November 10: Brezhnev dies\n*1982 November 12: Yuri Andropov becomes General Secretary of the Communist Party of the Soviet Union\n*1983 July 15: 1983 Orly Airport attack by ASALA\n*1983 July 27: Turkish embassy attack in Lisbon by the Armenian Revolutionary Army\n*1984 February 9: Andropov dies\n*1984 February 13: Konstantin Chernenko becomes General Secretary of the Communist Party of the Soviet Union\n*1984 March 24: Hovhannes Shiraz dies in Yerevan\n*1984 May 3: Alfortville Armenian Genocide Memorial Bombing by Turkish nationalists\n*1985 March 10: Chernenko dies\n*1985 March 11: Mikhail Gorbachev becomes General Secretary of the Communist Party of the Soviet Union, era of perestroika and glasnost begin\n*1987 June 18: European Parliament recognizes the Armenian genocide, condemns the Turkish denial.\nKarabakh conflict and independence of Armenia (1987–present)\nwith the Armenian forces establishing de facto control on the disputed area]]\n]]\nled the Armenian forces during the First Nagorno-Karabakh war ]]\n*1987 September: the Union for National Self-Determination, the first non-Communist party, founded in Yerevan by Paruyr Hayrikyan.\n*1987 October 18: A minor rally on Freedom Square, Yerevan for the unification of Karabakh with Armenia.\n*1988 February 12: First protests in Stepanakert.\n*1988 February 18–26: Major demonstrations held in Yerevan demanding the unification of Karabakh with Armenia.\n*1988 February 20: NKAO Supreme Council issued a request to transfer the region to Soviet Armenia.\n*1988 February 22–23: Local Armenians and Azerbaijanis clash in Askeran, resulting in several deaths.\n*1988 February 27–29: Sumgait pogrom starts, Armenians of Azerbaijani start to leave in large numbers\n*1988 March 9: Gorbachev meets with the leaders of Armenia and Azerbaijan Karen Demirchyan and Kamran Baghirov in Moscow to discuss the public demands of unification of Armenia and Karabakh.\n*1988 March 22: Over 100,000 people discontented with the tendencies demonstrate in Yerevan.\n*1988 March 23: The Soviet Supreme Soviet rejects the demand of NKAO Regional Party. On March 25 Gorbachev rejects Armenian claims, forbade demonstrations in Yerevan.\n*1988 March 26: Despite not being authorized by the Moscow government, tens of thousands demonstrate in Yerevan.\n*1988 March 30: NKAO Communist Party adopts a resolution demanding unification.\n*1988 May 21: Karen Demirchyan resigns.\n*1988 May 28: Flag of Armenia first raised in front of Matenadaran.\n*1988 June 15: Soviet Armenian Supreme Council votes in favor of the unification of NKAO.\n*1988 June 17: Soviet Azerbaijani Supreme Council opposes the transfer of NKAO to Armenia.\n*1988 June 28–29: Conference of the Communist Party of the Soviet Union disapproves Armenian claims to NKAO.\n*1988 July 5: Soviet troops confronted by protesters in Zvartnots Airport, one man left dead, tens injured.\n*1988 July 12: NKAO Soviet Council votes in favor of unification with Armenia.\n*1988 July 18: Soviet Supreme Council refuses Armenian claims.\n*1988 July 21: Paruyr Hayrikyan deported to Ethiopia.\n*1988 fall: Around 150,000 Azerbaijanis of Armenia start to leave in large numbers.\n*1988 September: State of emergency declared in Stepanakert after Armenian and Azerbaijanis clash.\n*1988 November: Kirovabad pogrom\n*1988 November 22: Soviet Armenian Supreme Council recognizes the Armenian genocide.\n*1988 November 24: State of emergency declared in Yerevan.\n*1988 December 7: Spitak earthquake.\n*1988 December 10: Karabakh Committee members arrested, sent to Moscow.\n*1989 March 16:  Metsamor Nuclear Power Plant shut down.\n*1989 May 31: Karabakh Committee members freed.\n*1989 December 1: Soviet Armenian Supreme Council and NKAO Supreme Council declare the unification of the two entities [http://www.encyclopedia.am/pages.php?bId=2&hId=1389]\n*1990 January 13–19: Pogrom of Armenians in Baku.\n*1990 May 20: 1990 Armenian parliamentary election, pro-independence members form majority.\n*1990 August 4: Levon Ter-Petrosyan elected chairman of the Supreme Council, de facto leader of Armenia.\n*1990 August 23: Soviet Armenian Supreme Council declares sovereignty.\n*1991 April 30 – May 15: Soviet and Azeri forces deport thousands of Armenian from Shahumyan during Operation Ring.\n*1991 August 19–21: 1991 Soviet coup d'état attempt in Moscow\n*1991 September 2: Nagorno-Karabakh Republic proclaimed in Stepanakert.\n*1991 September 21: Armenians vote in favor of independence from the Soviet Union.\n*1991 September 23: Armenian Supreme Council proclaims independence\nLevon Ter-Petrosyan presidency (1991–1998)\n*1991 October 17: Levon Ter-Petrosyan elected first president of Armenia.\n*1991 December 10: Nagorno-Karabakh independence referendum\n*1991 December 26: Soviet Union officially dissolved\n*1992 January 6: Nagorno Karabakh Republic parliament declared independence.\n*1992 January 30: Armenia admitted into the Organization for Security and Co-operation in Europe (OSCE).\n*1992 February 18: Armenia joins the Commonwealth of Independent States as a founding member.\n*1992 February 25–26: First Nagorno-Karabakh War: Khojaly Massacre\n*1992 March 2: Armenia becomes a member of the United Nations and the UN's Eastern European Group.\n*1992 April 10: First Nagorno-Karabakh War: Maraga Massacre\n*1992 May 8–9: First Nagorno-Karabakh War: Armenian forces capture Shusha.\n*1992 May 18: First Nagorno-Karabakh War: Armenian forces take over Lachin\n*1992 May 28: Armenia becomes a member of the International Monetary Fund\n*1992 June 4: Armenia joins the Organization of the Black Sea Economic Cooperation as a founding member.\n*1992 June 13–14: First Nagorno-Karabakh War: Azerbaijani forces take over Shahumyan.\n*1992 September 16: Armenia becomes a full member of the World Bank.\n*1993 April 3: First Nagorno-Karabakh War: Armenian forces take over Kelbajar.\n*1993 April: Turkey closes the border with Armenia.\n*1993 June–August: First Nagorno-Karabakh War: Armenian forces take over Aghdam, Fizuli, Jebrayil, Zangelan.\n*1993 November 22: Armenian dram put into circulation.\n*1994 March 17: Iranian Air Force C-130 shot down by Armenian forces in Karabakh \"by mistake\".\n*1994 May 5: First Nagorno-Karabakh War: Bishkek Protocol ends the war with Armenian forces establishing de facto control over Nagorno-Karabakh and several adjacent Azerbaijani districts.\n*1994 September 4: 1994 Bagratashen bombing: 14 dead and 46 injured\n*1994 October 5: Armenia joins NATO's Partnership for Peace.\n*1994 December 28: Main opposition party Armenian Revolutionary Federation banned by President Ter-Petrosyan and leaders arrested until February 1998\n*1995 April: Armenian Genocide Museum-Institute opened in Yerevan\n*1995 July 5: 1995 Armenian parliamentary election and 1995 Armenian constitutional referendum. Denounced by opposition and international observers.\n*1995 November 5: Metsamor Nuclear Power Plant reopened\n*1996 September 15 – October 2: 32nd Chess Olympiad held in Yerevan\n*1996 September 22: Levon Ter-Petrosyan reelected president, opposition disputes results, international organizations denounce the process.\n*1996 September 23–26: Post-election protests led by Vazgen Manukyan, during which the protesters occupy the National Assembly building.\n*1997: Armenia becomes a member of the Black Sea Trade and Development Bank\n*1997 March 20: Robert Kocharyan becomes Prime Minister of Armenia\n*1997 May: Armenia joins the Euro-Atlantic Partnership Council\n*1998 February 3: Levon Ter-Petrosyan resigns\nRobert Kocharyan presidency (1998–2008)\n]]\n*1998 March 16, 30: Robert Kocharyan elected president, opposition rejects the results.\n*1998 August 17: 1998 Russian financial crisis\n*1999 May 30: Unity bloc wins plurality to Armenian parliament. Vazgen Sargsyan becomes Prime Minister, Karen Demirchyan elected National Assembly Speaker on June 11.\n*1999 July 1: The EU-Armenia Partnership and Cooperation Agreement enters into force.\n*1999 August 28 – September 5: First Pan-Armenian Games held in Yerevan.\n*1999 September 21: Military parade held in Yerevan.\n*1999 September 22–23: First Armenia-Diaspora Conference held in Yerevan.\n*1999 October 27: Armenian parliament shooting, Prime Minister Vazgen Sargsyan, National Assembly Speaker Karen Demirchyan and six other assassinated by an armed group led by Nairi Hunanyan in the Armenian parliament building in Yerevan.\n*2000 March 22: Former NKR Defence Minister General Samvel Babayan leads an unsuccessful assassination attempt against president Arkadi Ghukasyan in Stepanakert.\n*2000 April 4: Former Interior Minister Vano Siradeghyan leaves Armenia while police investigates charges on him for murder.\n*2001 January 25: Armenia becomes a member of the Council of Europe.\n*2001 September 25: Pope John Paul II visits Armenia to participate on the celebrations of 1,700th anniversary of the adoption of Christianity as a national religion in Armenia.\n*2001 September 25: Poghos Poghosyan, a Georgian citizen of Armenian origin, killed in central Yerevan by President Kocharyan's bodyguards.\n*2002 May 27–28: Second Armenia-Diaspora Conference held in Yerevan.\n*2003 February 5: Armenia became a member of the World Trade Organization (WTO)\n*2003 February 19, March 5: Robert Kocharyan reelected president, opposition disputes results\n*2003 May 25: Parliamentary election, Republican Party of Armenia wins plurality, opposition disputes results.\n*2003 December 2: Nairi Hunanyan and four others perpetrators of the 1999 parliament shooting sentenced to life imprisonment.\n*2004: Armenia is granted Observer Status in the Arab League.\n*2004 February 19: Gurgen Margaryan assassinated by Ramil Safarov in Budapest, Hungary.\n*2004 April 12–13: Tens of thousands of protesters, demanding resignation of President Kocharyan, clash with police on Baghramyan Avenue, many left injured.\n*2004 April 26: Vorotan-Sevan tunnel inaugurated.\n*2005: Armenia becomes a member of the Asian Development Bank.\n*2005 May 28: Around 250,000 participate in the Dance of Unity around Mount Aragats, in a mass display of national unity.\n*2005 November 27: Constitutional referendum in Armenia approved by 94.5%.\n*2006: Armenia joins Eurocontrol.\n*2006 May 3: Armavia Flight 967 crashed near Sochi, Russia with 113 fatalities.\n*2006 August 25: Writer and activist Silva Kaputikyan dies in Yerevan.\n*2006 September 18–20: Third Armenia-Diaspora Conference held in Yerevan.\n*2006 September 21: Military parade held in Yerevan.\n*2007 January 19: Hrant Dink assassinated in Istanbul.\n*2007 March 19: Iran–Armenia gas pipeline officially opened by Presidents Mahmoud Ahmadinejad and Robert Kocharyan.\n*2007 March 25: Prime Minister Andranik Margaryan dies of a heart attack.\n*2007 May 12: Parliamentary election, Republican Party of Armenia wins plurality, opposition denounces results.\n*2007 June 27: The Russian military base in Akhalkalaki officially transferred to Georgia.\n*2007 September 21: Levon Ter-Petrosyan returns into politics, criticizes the Kocharyan regime.\n*2007 October 10: United States House Committee on Foreign Affairs voted for recognition of the Armenian genocide. Turkey recalls its ambassador.\nSerzh Sargsyan presidency (2008–2018)\n]]\n*2008: Armenia becomes a Dialogue Partner of the Shanghai Cooperation Organisation.\n*2008 February 19: Serzh Sargsyan elected president with 52.8% of the total vote, opposition disputes results.\n*2008 February 20 – March 2: Presidential election runner-up Levon Ter-Petrosyan leads a series of protests in Yerevan. Post-election protests end with 10 deaths (8 civilian, 2 law enforcing agents). President Kocharyan announces, National Assembly approves state of emergency in Yerevan. Army forces remain in the city until March 21, 2008.\n*2008 August 1: Armenian National Congress, a coalition of 18 opposition parties, led by Levon Ter-Petrosyan founded.\n*2008 August 7–16: Russia–Georgia war\n*2008 September 6: Abdullah Gül visits Yerevan to watch the game between Armenia and Turkey national football teams.\n*2009: Economy of Armenia declines 15% as a results of the 2008 financial crisis.\n*2009: Armenia joins the Eurasian Development Bank.\n*2009 May 7: Armenia becomes a member of the EU's Eastern Partnership.\n*2009 May 31: Republican Party wins majority in the first Yerevan City Council election, opposition disputes results.\n*2009 July 15: Caspian Airlines Flight 7908 crashed near Qazvin, Iran with 168 fatalities, including 40 Armenian citizens.\n*2009 October 9: Armenian Revolutionary Federation marches 60,000 people in Yerevan against the Turkish-Armenian protocols.\n*2009 October 10: Armenia and Turkey  sign accords for normalization of relations in Zürich, Switzerland.\n*2010 March 4: United States House Committee on Foreign Affairs voted for recognition of the Armenian genocide.\n*2010 April 22: President Serzh Sargsyan suspends the Armenian-Turkish protocols from the National Assembly.\n*2010 June 9: Areni-1 shoe, found in 2008, confirmed to be the oldest piece of leather footwear in the world.\n*2010 August 20: Armenia and Russia sign a pact extending the stationing of the Russian base in Gyumri for 25 years, to 2044.\n*2010 September 11: Armenian company Grand Candy makes the biggest chocolate bar in the world.\n*2010 September 19: Liturgy held at the Cathedral of the Holy Cross on Akdamar Island, Lake Van, Turkey for the first time since 1915.\n*2010 October 16: Wings of Tatev, the longest reversible aerial tramway in the world, opened in southern Armenia.\n*2011: Armenia joins the Euronest Parliamentary Assembly.\n*2011 January 10: Areni-1 winery, discovered in Armenia's Vayots Dzor province in 2007, confirmed to be the oldest winery in the world.\n*2011 March 17: For the first time since March 2008, the opposition holds a rally at Freedom Square.\n*2011 September 21: Military parade held in Yerevan on the 20th anniversary of Armenia's independence from the Soviet Union.\n*2011 October: Armenia becomes an Observer Member of the EU's Energy Community.\n*2011 December 3: Junior Eurovision Song Contest 2011 held in Yerevan.\n*2011 December 21: French National Assembly approves the Armenian genocide denial law. Turkey recalls their ambassadors from France, lists several trade, military and political sanctions on France.\n*2012: Yerevan the World Book Capital.\n*2012 January 22: French Senate approves the Armenian genocide denial law.\n*2012 February 28: Constitutional Council of France overturns the Armenian genocide denial law.\n*2012 May 6: Republican Party wins majority to the Armenian parliament, opposition disputes results.\n*2012 August 31: Ramil Safarov extradited to Azerbaijan, Armenia cuts diplomatic relations with Hungary.\n*2013 February 18: Serzh Sargsyan reelected president, opposition disputes results.\n*2013 February 19 – April 9: Mass protests against the presidential election results, led by official runner-up Raffi Hovannisian. The demonstrations reached their climax and effectively ended on April 9 when a clash between the police and opposition protesters took place on Yerevan's Baghramyan Avenue.\n*2013 May 6: Republican Party wins absolute majority to the Yerevan city council, opposition disputes results.\n*2013 July 20–25: Mass protests in Yerevan result in cancellation of transportation fare increase.\n*2013 September 3: President Serzh Sargsyan announced in Moscow that Armenia will join the Customs Union of Belarus, Kazakhstan and Russia despite the fact that Armenia was expected to sign a European Union Association Agreement and a Deep and Comprehensive Free Trade Area Agreement with the EU at the Eastern Partnership Summit in November. Experts describe this move as an unexpected U-turn, citing apparent pressure from Russia.\n*2014 April 3–13: Prime Minister Tigran Sargsyan resigned and replaced by Hovik Abrahamyan.\n*2014 October 10: President Serzh Sargsyan signed a corresponding accession treaty in Minsk with the presidents of Russia, Belarus and Kazakhstan to Eurasian Economic Union.\n*2014 December 4: The National Assembly ratifies the Eurasian Economic Union treaty with 103 in favor, 7 against, and 1 abstention.\n*2015 January 1: Armenia officially joins the Eurasian Economic Union.\n*2015 January 12: Seven people are killed in Gyumri. The suspect, Valery Permyakov, a serviceman of the Russian military base in Gyumri is apprehended by the Russian border guards and is transferred to the base, triggering anti-government and anti-Russian rallies in Gyumri and Yerevan.\n*2015 March: Armenia hosts the 4th Euronest Parliamentary Assembly.\n*2015 April 24: 100th anniversary of the Armenian genocide was commemorated worldwide.\n*2015 December 6: A constitutional referendum\n*2016 April 1–5: 2016 Nagorno-Karabakh clashes: Clashes occur along the Nagorno-Karabakh line of contact with the Artsakh Defense Army, backed by the Armenian Armed Forces, on one side and the Azerbaijani Armed Forces on the other.\n*2017 February 27: Armenia and the EU ratify the Armenia-EU Comprehensive and Enhanced Partnership Agreement in Brussels.\n*2017 April 2: 2017 Armenian parliamentary election\n*2017 May 17: The Federation of Euro-Asian Stock Exchanges moves its headquarters to Armenia.\nNikol Pashinyan premiership (2018–present)\n]]\n]]\n*2018 March 2: 2018 Armenian presidential election\n*2018 March 31: Protests in Armenia start over Serzh Sargsyan becoming prime minister.\n*2018 April 23: Serzh Sargsyan resigns.\n*2018 May 8: Nikol Pashinyan assumes power and promises anti-corruption and pro-democratic reforms following the 2018 Armenian revolution.\n*2018 May 28: 100th Anniversary of the First Republic of Armenia celebrated.\n*2018 October 11: Armenia hosts the 17th Summit of the Organisation internationale de la Francophonie in Yerevan.\n*2018 November: The Parliamentary Assembly of the Organization of the Black Sea Economic Cooperation was held in Yerevan.\n*2018 December 9: 2018 Armenian parliamentary election\n*2019 June: Armenia hosts the [https://summitofminds.com/ Summit of Minds] international conference.\n*2019 July 10: Armenia becomes an Observer Member of the Pacific Alliance.\n*2019 July 14: Armenia hosts the 2019 UEFA European Under-19 Championship.\n*2019 August 6: The 7th Pan-Armenian Games begins.\n*2019 October 1: Armenia hosts Eurasian Union Summit in Yerevan.\n*2019 October 6: Armenia hosts the World Congress on Information Technology.\n*2019 November 5: The CSTO Parliamentary Assembly was held in Yerevan.\n*2020 September 27: 2020 Nagorno-Karabakh War: Deadly clashes erupt in Nagorno-Karabakh between Armenian and Azerbaijani forces. Armenia, Azerbaijan, and the Republic of Artsakh introduced martial law and mobilized forces.\n*2020 November 10: Armenia and Azerbaijan sign a Russia-brokered ceasefire agreement, ending the 44 day war.\n*2021 March 1: The Armenia-EU Comprehensive and Enhanced Partnership Agreement is entered into force.\n*2021 June 20: Nikol Pashinyan's Civil Contract wins a majority in the National Assembly following the 2021 Armenian parliamentary elections.\n*2021 November 15: Armenia joins the European Common Aviation Area.\n*2021: Armenia hosted the European Bank for Reconstruction and Development Annual Board of Directors Summit.\n*2022 May 23: Armenia hosts the 2022 European Amateur Boxing Championships in Yerevan.\n*2022 July 10: Armenia hosted the 33rd International Biology Olympiad.\n*2022 September 5: Armenia hosted the sixth Starmus Festival.\n*2022 October 6: Prime Minister Nikol Pashinyan participates in the 1st European Political Community Summit held in Prague.\n*2022: Armenia hosted the 67th World Tourism Organization Commission for Europe meeting.\n*2022 December 11: Armenia hosted the 20th Junior Eurovision Song Contest in Yerevan.\n*2022 December 19: The European Union Monitoring Capacity to Armenia completed its two month long mandate.\n*2023 February 20: The European Union Mission in Armenia launched its operations.\n*2023 April 15: The 2023 European Weightlifting Championships were held in Yerevan.\n*2023 November: Armenia joins the International Solar Alliance.\n*2024 March 12: The European Parliament passed a resolution confirming Armenia met Maastricht Treaty Article 49 requirements and that the country may apply for EU membership.\n*2024 June 12: Armenia joins the Artemis Accords.\n*2025 January 14: Armenia and the United States sign the Armenia–United States Strategic Partnership Charter in Washington, D.C.\n*2025 February 12: Armenia's parliament approved a bill officially endorsing Armenia's EU accession.\nPredicted and scheduled events\n*2026: Metsamor Nuclear Power Plant to be shut down, a new nuclear power plant to be opened in Armenia.\n*2026: Next Armenian parliamentary elections are scheduled to be held.\nSee also\n* Timeline of Armenian history\n* Timeline of Artsakh history\n* Timeline of Yerevan\nReferences\n;Specific\n;General\n*\n* }}\n*\n* |isbn=978-0253073556}}\nFurther reading\n*\nExternal links\n*"
    }
  ]
}