{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Official Irish Republican Army actions\n\nThis is a timeline of actions by the Official Irish Republican Army (Official IRA or OIRA), an Irish republican & Marxist-Leninist paramilitary group. Most of these actions took place as part of a Guerrilla campaign against the British Army & Royal Ulster Constabulary and internal Irish Republican feuds with the Provisional IRA & Irish National Liberation Army from the early 1970s - to the mid-1970s during the most violent phase of \"the Troubles\" in Northern Ireland.\nTimeline of attacks & actions\n1969\n*28 December - The Irish Republican Army split into the Marxist-Leninist Official IRA on one side & the more militant traditional Republican Provisional IRA on the other side.\n1970\n*3-5 July - Twelve Volunteers from the Provisional IRA & 90 Volunteers from the Official IRA's Belfast Brigade battled the British Army during the Falls Curfew. Four civilians were killed by the British Army, several IRA Volunteers injured & 18 British soldiers were also injured during the battle.\n*June - August - An Official IRA active service unit based in London, England carried out a series of armed bank robberies during the summer of 1970 to raise funds for the OIRA. Kieran Conway who in 1974 left the OIRA over their ceasefire and became a PIRA Volunteer was a member of this unit.\n1971\n*8 March - After a gun battle between the Officials & Provisionals, the OIRA Volunteers shot dead the Provisional IRA's Belfast D Company commander Charlie Hughes (a cousin of Brendan Hughes, one of the Republican leaders of the 1980 Hunger Strike) and injured Tom Cahill, a nephew of veteran Irish Republican, Joe Cahill. Tensions between the two factions would lead to more bloodshed a few years later. See: Official & Provisional IRA feud\n*22 May - The first British soldier to die at the hands of the Official IRA, Robert Bankier of the Royal Green Jackets was killed by a unit led by Joe McCann. McCann's unit opened fire on a passing British mobile patrol near Cromac Square, hitting the patrol from both sides. He was the fourth British soldier to die on active service and the seventh overall since the conflict began.\n*2 July - The OIRA bombed the British Ministry of Social Security in South Mall, Cork, claiming the premises was used to recruit former British soldiers for the British Army.\n*2 July - An OIRA unit bombed an electrical transformer station at the Mogul Mines in the Silvermines mountains in County Tipperary. This was in support of mine workers who were striking at the time. Volunteer Martin O'Leary sustained injuries whilst planting the explosives, and later died of his injuries on July 6.\n*10 July - The OIRA ambushed a British Army mobile patrol in Leeson Street in West Belfast. Two soldiers and two civilians were slightly hurt.\n*9 - 10 August 1971 - During the introduction of Internment without trial OIRA Staff Captain Joe McCann led a small unit that held off a large number of British troops (reported 600 soldiers) for a number of hours to let people evade capture in the Markets area of Belfast.\n*14 August - An Official IRA sniper shot dead British soldier John Robinson (21) while he was on mobile patrol in Butler Street, Ardoyne, Belfast during riots in the aftermath of internment.\n*31 August - The OIRA opened fire on a group of British soldiers in a bar in Belfast city centre, injuring one.\n*4 September - The OIRA killed a British soldier who was part of a mobile patrol in a land mine attack near Newry.\n*14 September - A OIRA sniper shot dead a British soldier in the Creggan area of Derry.\n*20 September - The OIRA shot and seriously wounded a British soldier at an observation post at the Foyle Road, Derry.\n*23 September 1971 - Official IRA Volunteers Curry Rose (18) and Gerard O'Hare (17) were both killed in a premature bomb explosion while preparing a bomb in a house in Merrion Street, along the Lower Falls.\n*4 October - A British soldier was killed in an OIRA bomb attack on an Army base in Cuppar Street, Belfast.\n*29 October - The OIRA attempted to kidnap Speaker of the Stormont House of Commons, Major Ivan Neill, at his manor home in Rostrevor near Newry. The attempt was foiled by the British Army and RUC but the OIRA unit escaped.\n*3 December - The OIRA bombed the home of Lord-lieutenant Basil McFarland in Derry. The OIRA stated it was retaliation for the wrecking of homes in Nationalist areas by the British Army.\n*9 December - The OIRA targeted a sustained burst of automatic fire at a Royal Marines APC and Land Rover in Newry, seriously injuring one soldier. Four civilians in a nearby bus were also injured.\n*12 December - A three-man active service unit of the OIRA assassinated Stormont Senator and UUP member John Barnhill when they shot him dead during an attack on his Brickfield home in near Strabane, Tyrone. Barnhill's home was destroyed by a bomb during the attack.\n*30 December - OIRA members raided the offices of the Housing Executive in Derry and destroyed files in a bonfire on the Creggan estate.\n*30 December - The OIRA burnt down the Rostrevor, County Down, home of Ivan Neil, Speaker of the House of Commons of Northern Ireland.\n1972\n*13 January - A Royal Marines Sioux helicopter was fired at and hit in Derry while supporting a British Army patrol pursuing a gunman, which had then been engaged by members of both the Official and Provisional IRA. The aircraft flew back to its base and landed safely.\n*30 January - It is claimed by eyewitnesses during Bloody Sunday in The Bogside in Derry that an OIRA Volunteer returned a single shot at the Paratroopers who had already opened fire.\n*30 January - The OIRA stated that in retaliation for the killing of several civilians earlier that day, OIRA volunteers engaged British soldiers in Derry and a volunteer had been shot in the leg and neck.\n*31 January - The OIRA shot and injured the former Unionist mayor of Lurgan, Alexander Greer, and burnt down his house.\n*6 February - A former member of the British Army's Parachute Regiment was found just inside the South Armagh border. The killing was blamed on the OIRA.\n*13 February - The OIRA abducted and shot dead a British soldier from the Royal Army Ordnance Corps, his body was found near Newtownbutler.\n*22 February - An OIRA unit exploded a bomb at Aldershot Barrack in Hampshire, England, killing 7 civilians.\n*23 February - The OIRA bombed a British Army post in Dungiven, County Londonderry. A British soldier inside escaped with only minor injuries and shock.\n*25 February - In Russell Street, Armagh two OIRA Volunteers fired shots from a Thompson SMG seriously injuring Stormont Minister & security spokesman John Taylor of the UUP.\n*29 February - The OIRA shot dead an RUC officer outside a factory in Newry. He died on the 2 March.\n*3 March - The OIRA bombed the council office in Cookstown, County Tyrone.\n*4 March - The OIRA killed a former UDR soldier in Derry.\n*5 March - The OIRA reported jointly carrying out a landmine and gun attack with PIRA on a British Army patrol led by a Ferret armoured car in Barley Lane, Newry.\n*12 March - A OIRA sniper shot dead a Catholic civilian during a sniper attack on British Army base in the Falls Road, Belfast.\n*24 March - The OIRA engaged the British Army in a two-hour long gun battle in the Creggan area of Derry. Hundreds of rounds were fired and a British officer described it as the most intense shootout in city up to that point. Staff of nearby St. Peter's school condemned the British Army for firing several shots into their school, despite there being no gunmen present.\n*10 April - Two British soldiers were killed in an OIRA bomb attack in Rosemount, Derry.\n*15 April - OIRA Belfast Commander Joe McCann was shot dead in the Markets area of Belfast. His funeral was attended by over 5,000 people.\n*15 April - A British soldier was shot dead in an OIRA sniper attack in Divis Street, Lower Falls, Belfast. Two other British soldiers were seriously injured.\n*16 April - A British soldier was shot dead in an OIRA sniper attack in Bishops Street, Derry.\n*16 April - A British soldier was ambushed outside his base and shot dead by the OIRA in the Brandywell area of Derry.\n*16 April - Two British soldiers were wounded in an ambush in Newry, County Armagh.\n*24 April - A supermarkets in Lisglynn, County Armagh was bombed and the owner was shot but not seriously injured. The Official IRA was blamed.\n*21 May - The OIRA shot dead a soldier, Ranger William Best (19) who was home on leave, his body was found in William Street, Derry. There was anger from the Nationalist community against the OIRA over this killing.\n*13 - 14 May - OIRA Volunteers joined forces with the Provisional IRA during the Battle at Springmartin.\n*29 May - The OIRA called an offensive ceasefire.\n*9 - 14 July - Various units from the Official IRA Belfast Brigade took part in the Battle of Lenadoon.\n*9 July - British snipers shot dead a member of the OIRA's Youth Wing David McCafferty (15) along with four other people in Ballymurphy, west Belfast. See: Springhill Massacre.\n*10 July - OIRA units were involved in a ten-hour long gun battle with the UDA in the Lower Falls area of Belfast.\n*11 July - A Volunteer from the OIRA Youth Wing Gerard Doherty (16) was shot dead in his house by the British Army in Belfast.\n*14 July - OIRA Volunteer Edward Brady was shot dead by the British Army during a gun battle in Ardoyne, Belfast.\n*16 July - A Volunteer from the OIRA Youth Wing Tobias Molloy died after being shot by the British Army with a rubber bullet in Strabane, County Tyrone. British soldiers fired rubber bullets at the funeral cortege; that same night the OIRA shot a British soldier in retaliation.\n*25 July - The OIRA shot dead UDA member James Kenna at the junction of Roden Street & Clifford Street in Belfast. He was reportedly part of a Loyalist mob attempting to invade a Catholic area.\n*30 September - A female OIRA Volunteer Patricia McKay was shot dead by the British Army during an attack on an Army barracks.\n*16 October - Two OIRA Volunteers were shot dead by the British Army a VCP in Coagh, County Tyrone.\n*5 December - The OIRA carried out several mortar attacks using newly developed launchers on British Army bases in Northern Ireland. Several of the devices either missed their target or failed to explode. A British soldier was killed when a shell detonated while he was examining one of the mortars in Kitchen Hill in Lurgan. The OIRA did not claim responsibility for the attacks.\n*15 December - A RUC officer was shot dead by OIRA volunteers near Kilwilkie gardens, Lurgan, Armagh.\n*15 December - A off-duty UDR soldier was shot dead as he left his workplace near Moy Road, Armagh.\n1973\n*February–March - The OIRA carried out over a dozen retaliatory attacks against British security forces after the British Army shot dead 12-year-old Kevin Heatley near his home in Derrybeg, Newry, County Down on 28 February.\n*8 March - The South Armagh Battalion of the OIRA claimed responsibility for a booby-trap bomb which exploded at a derelict home in Mullaghbawn, seriously wounding three British soldiers. One (Joseph Leahy) died two days later. The OIRA said it was retaliation for the killing of 12-year-old  Kevin Heatley in Newry on February 28.\n*7 April - British Soldiers in concealed positions opened fire on an OIRA unit after an attack on a British Army patrol in Ogle Street, Armagh, killing OIRA Volunteer James McGerrigan (17) and wounding another. The OIRA strenuously denied the men were armed or had attacked the patrol.\n*9 April - The British Army shot dead OIRA Volunteer Anthony Hughes (20) while moving weapons out from his house in Culdee Terrace, Armagh. In retaliation for this and the Armagh shooting the OIRA carried out attacks in Armagh, Newry, Lurgan, Derry, and Belfast in the weeks that followed.\n*14 April - The UVF shot dead OIRA Volunteer Robert Millen on the Ormeau Road, Belfast.\n*27 April - A bomb attached to a UDR soldier's car exploded in Gough Barracks, Armagh, injuring nine people and damaging or destroying over twenty parked vehicles.\n*27 April - A OIRA sniper shot dead a British soldier in the Creggan, Derry.\n*1 May - The OIRA claimed to have injured two British soldiers in a shooting incident in the Gobnascale area of Derry.\n*18 June - OIRA members, after forcing their way into Ross' Mill on Odessa Street, Belfast and staging a protest over working conditions, planted a bomb under the manager's car. The blast bomb didn't explode but an incendiary component destroyed the vehicle.\n*21 June - The OIRA shot dead a Protestant civilian David Walker (16) near the entrance of the Falls Road, Belfast.\n*6 July - Patrick Bracken (27) an OIRA volunteer was shot dead by the UVF along the Falls Road, Belfast\n*8 July - The OIRA lobbed a nail bomb at the British Army during unrest at Dunmore Avenue, Derry, injuring three soldiers.\n*25 September - Seamus Larkin (34) an ex-OIRA Volunteer was shot dead by the OIRA near Killean, County Armagh. Part of internal feud.\n*5 November - The OIRA was blamed for a  bomb that wrecked a milking parlour on the estate of Sir Richard Keane at Belmont, Capoquin, County Waterford. The blast followed threats related to a dispute between Sir Richard and his 65 tenants in Cappoquin over ground rents.\n*18 November - The OIRA announced they were establishing auxiliary defence groups to guard Nationalist areas against sectarian attacks by Loyalist paramilitaries. Around this time a secret squad to carry out revenge attacks was also formed. The grouping never claimed responsibility and was kept unknown even within the OIRA.\n1974\n*1 January - The OIRA shot and wounded a man in a punishment attack in Michael Mallon Park, Newry. An OIRA statement alleged the man had assault one of their volunteers at a New Year's dance at Warrenpoint, County Down.\n*11 January - The OIRA killed two civilians (John Dunn and Cecilia Byrne) who worked as cleaning contractors for the British Army when they exploded a bomb under their car as they left Ebrington British Army base near the Waterside, Derry. The OIRA denied responsibility for the attack, and a sympathy notice appeared in The Irish News from the Co-ordinating Committee of Andersonstown Republican Clubs, the OIRA's political wing.\n*13 January - The OIRA shot dead a civilian (Christopher Daly) whom they accused of arms dealing at Balholm Drive, Ardoyne, Belfast.\n*15 May - The British Army shot dead two OIRA Volunteers (Colman Rowntree and Martin McAlinden) after they caught them planting a landmine near Ballyholland close to Newry, Down. No firearms were found at the scene, although a significant quantity of bomb-making material was recovered.\n*18 May - The OIRA shot a British soldier and injured another in William Street, Newry, immediately after the funerals of the two OIRA volunteers who died on 15 May. Five more attacks were carried out against the British Army in the week that followed.\n*24 May - The OIRA claimed responsibility for shots fired at the British Army at Downshire Road, Newry.\n*25 May - The OIRA claimed responsibility for shots fired at the British Army in the Derrybeg Estate, Newry.\n*28 May - The OIRA claimed responsibility for shots fired at the British Army at Merchant's Quay, Newry.\n*1 June - The OIRA claimed responsibility for shots fired at the British Army at River Street, Newry.\n*2 June - Paul Tinnelly (34) a former OIRA Volunteer and founder of the short-lived paramilitary group \"Tinnelly's Brigade\" was shot dead by the OIRA in Rostrevor, Down.\n*5 August - a Catholic civilian (Martha Lavery, 66) was shot dead by the British Army during a gun battle with the OIRA in the Ardoyne area of Belfast.\n*19 August - The OIRA claimed responsibility for shooting two youths in a punishment shooting in the Bogside area of Derry. In response the Provisional IRA issued warning that they wouldn't tolerate organisations not involved in an \"official\" campaign against the British Government carrying out such actions.\n*26 August - The OIRA claimed to have carried out several recent attacks on the British Army in the Newry area, according to an article in an OIRA-affiliated magazine.\n*6 September - The OIRA shot dead a RUC officer during a robbery on an Ulster Bank in Rathcole, Newtownabbey, Antrim.\n*18 September - Patrick McGreevey (15) a Volunteer in the OIRA's Youth Wing was shot dead by the UVF in Clifton Street, Belfast.\n*16 October - The OIRA reported firing on British soldiers in the Camlough Road/Monaghan Street area of Newry and claimed to have seriously wounded one soldier. An hour later in the Water Street area the OIRA claimed to have injured another British soldier.\n*21 October - The OIRA reported carrying out several shooting attacks in Newry and claimed to have critically injured a British soldier. These attacks and others the OIRA stated were retaliation for mistreatment of prisoners at Long Kesh, brutality by British security forces in Newry, and the killing by the British Army of sixteen-year-old Michael Hughes..\n*10 November - The OIRA and PIRA exchanged fire in the Bawnmore area of Newtonabbey on the outskirts of Belfast. A follow-up search by the British Army recovered a revolver and ammunition.\n*8 December - There was a split in the Official Republican Movement when a large group led by Seamus Costello left and formed the Irish Republican Socialist Party and the Irish National Liberation Army in the Spa Hotel, Dublin.\n1975\n*20 February 1975 - A feud between the OIRA and the newly formed Irish National Liberation Army (INLA) began when OIRA Volunteers from the Belfast Brigade shot dead Hugh Ferguson (19), then chairman of Whiterock IRSP. The feud lasted until 5 June 1975 and all the killings by both sides happened in Belfast.\n*25 February - The INLA using the cover name People's Liberation Army (PLA) shot dead OIRA Volunteer Paul Fox (25). Part of INLA/OIRA feud.\n*1 March - the INLA shot and wounded OIRA leader Sean Garland. The attack happened in the Ballymurphy area of Belfast; part of the feud.\n*6 April - the OIRA shot dead INLA volunteer Daniel Loughran on Albert Street, Belfast; part of the feud.\n*12 April - the INLA shot dead OIRA volunteer Paul Crawford on Falls Road; part of the feud.\n*28 April - the INLA shot dead OIRA volunteer and Belfast Brigade Commander Billy McMillen on Falls Road, part of the feud.\n*21 May - The OIRA shot and wounded a British soldier at Sugar Island in Newry, claiming retaliation for the shooting of two protestors by the British Army. Shots were also fired at the police station. He was reportedly the first British soldier shot since the Provisional IRA's 1975 ceasefire began.\n*5 June - the Official IRA shot dead INLA volunteer Brendan McNamee on Stewartstown Road, Belfast.\n*10 June - The OIRA shot dead Saor Éire Volunteer Larry White (25) in County Cork.\n*17 July - The OIRA shot and injured a British soldier in the Newry area.\n*19 July - Unionist politician Glenn Barr claimed that the OIRA and PIRA had united to launch attacks on the Scots Guards regiment of the British Army in the Falls Road area of Belfast. The OIRA denied collaborating with the PIRA but stated they reserved the right under the terms of their 1972 ceasefire to \"take action in defense and retaliation.\"\n*19 July - The OIRA shot and injured a British soldier in the Newry area. The OIRA on 22 July claimed the attack and another two days previously were retaliation for the harassment of locals by the Green Howards regiment.\n* 9–10 August - Republican paramilitaries, including the Official IRA, reportedly united to defend the Divis Flats complex in West Belfast from a loyalist incursion following sustained fire from loyalist gunmen. There were also several exchanges of fire between republicans and the British Army across West Belfast. Two Catholic children were killed in the fighting.\n*10 October - The OIRA shot dead a civilian during an armed robbery on his workplace in Whiterock, Belfast.\n*12 October - \"The Third Battalion\" of the South Down-South Armagh Brigade of the OIRA reported a shooting attack on a British Army observation post overlooking Carrickasticken Road lasting twenty minutes and claimed two hits. The attack was claimed to be retaliation for the destruction roads and bridges by the British Army.\n*19 October - A civilian died two weeks after being shot by the OIRA along Cabra Road, Dublin.\n*29 October 1975 - The Provisional IRA (PIRA) shot and killed OIRA Volunteer Robert Elliman (27), in McKenna's Bar in the Markets area of Belfast. This was the start of a new PIRA/OIRA feud, which would eleven dead and over fifty injured.\n*31 October - Thomas Berry (27), a Volunteer of the OIRA, was shot dead by the PIRA outside Sean Martin's Gaelic Athletic Association (GAA) Club in the Short Strand, Belfast.\n*31 October - In a revenge attack the OIRA shot dead a senior PIRA Volunteer Sean McCusker (40) in the New Lodge Road, Belfast for the recent killings of the OIRA Volunteers.\n*9 November - The PIRA shot dead OIRA Volunteer along the New Lodge, Belfast.\n*11 November - The OIRA shot dead a civilian who they mistook as a member of the PIRA along the Lower Falls, Belfast. Part of PIRA/OIRA feud.\n*11 November - The PIRA shot dead OIRA Volunteer John Brown (25) at his home in Cooke Place, Belfast. Part of PIRA/OIRA feud.\n*12 November - The OIRA shot dead civilian and Chairman of the Falls Road Taxi Association Michael Duggan (32) for its links to the PIRA in Hawthorne, Belfast. Part of PIRA/OIRA feud.\n1976\n*18 February - A Sinn Féin member Paul Best (19) died three months after being shot by the OIRA in Turf Lodge, Belfast. Part of the PIRA/OIRA feud.\n*June - The OIRA reported firing on a helicopter of the British Army's Royal Scots Regiment in the Newry area, scoring a direct hit.\n*June - The OIRA reported a sniping attack on a British Army mobile patrol in Canal Street, Newry.\n*June - The OIRA reported a sniping attack on a British Army mobile patrol in Bridge Street, Newry, claiming to have hit a vehicle and forcing a crash.\n*13 July - Gerard Gilmore (19) an OIRA Volunteer was shot dead by Loyalist paramilitaries near Greencastle, Belfast, no specific group claimed responsibility for the killing but it is believed the UVF carried it out.\n*23 July - The OIRA reported a sniping attack on a British Army mobile patrol on Camlough Road, Newry, claiming \"one hit, possibly two\".\n*23 July - The OIRA reported a sniping attack on a British Army mobile patrol in Kiln Street, Newry, claiming to have hit a vehicle.\n*24 July - The OIRA reported a sniping attack on sentry at UDR Centre, Downshire Road, Newry, claiming at least one hit and that fire was returned.\n*3 August - A UDR officer was shot and injured as he drove to work on the Dublin Road, Newry. In June 1977 an RUC detective stated in court the OIRA carried out the attack. However, the South Down-South Armagh Command of the OIRA issued a statement asserting the OIRA was not involved and the attack was carried out and claimed by the Provisional IRA. UDR captain Ivan Toombs was later murdered by the Provisional IRA in 1981.\n*6 August - The OIRA reported a \"prolonged attack\" on mobile patrols at UDR Centre, Downshire Road, Newry, \"believed two hits\" and fire was returned.\n*9 August - Six gunmen engaged the British Army and RUC in a two-hour gun battle in the Bawnmore estate in North Belfast, amidst widespread unrest in the city. An RUC spokesman described the incident as \"hot and heavy\" and it was believed the Provisional IRA were involved. However, they were actually OIRA members, reportedly using \"brand new\" AK-47 rifles. The OIRA were also responsible for gun attacks on British soldiers on the Falls Road that same week.\n*24 August - An OIRA sniper shot and seriously injured a British soldier standing in a Land Rover in the Ballymurphy area of Belfast.\n*27 August - The OIRA in South Down and South Armagh claimed responsibility for seven gun attacks against the British Army in the previous three months, stating they were in retaliation for the \"extreme brutality\" of the 3rd Parachute Regiment stationed in the area.\n1977\n*20 January - The OIRA in South Down reported three recent shooting attacks on the Royal Marines Commandos in Newry; in Hill Street, Barcroft Park and Abbey Way. The OIRA claimed casualties in each incident and that they were a response to \"brutality\" from the Royal Marines against residents.\n*10 April - The PIRA shot dead a civilian (John Shortt) in the Turf Lodge, Belfast. The intended target was an OIRA volunteer who was a relative of the civilian killed.\n*27 July - The PIRA shot dead a Republican Clubs member (a group with close links to the OIRA) in the New Lodge, Belfast. Part of a renewed PIRA/OIRA feud.\n*27 July - In retaliation for the killing of a Republican Clubs member the OIRA tried to kill a Sinn Féin member but shot dead the brother of the intended target. Part of PIRA/OIRA feud.\n*27 July - The OIRA shot dead PIRA volunteer Thomas Toland (31) in the Ballymurphy area of Belfast. Part of PIRA/OIRA feud.\n*27 July - The OIRA shot dead a civilian in his house in Andersonstown, Belfast, the previous occupant of the house was the intended target. Part of PIRA/OIRA feud.\n*5 October - The OIRA shot dead former OIRA Volunteer, and the then-current leader of the INLA & IRSP Seamus Costello in Northbrook Avenue, Dublin. Part of INLA/OIRA feud.\n1978\n*4 September - OIRA volunteers fired several shots at Gardaí during a robbery on a dairy at Tramore Road, Cork before surrendering.\n1979\n*9 June - The UDA shot dead Joseph McKee (33) an OIRA Volunteer inside a shop in Castle Street, Belfast.\n*10 September - A group of OIRA Volunteers badly beat a civilian man to death in the Ballymurphy area of Belfast.\n1980\n*September - The OIRA opened fire on rioters near the Divis Flats, Belfast during disturbances related to the ongoing H-Block protests. A youth was hit in the head and seriously wounded.\n1982\n*4 June - The INLA shot dead OIRA volunteer James Flynn (37) on North Strand Road, Dublin. End of the INLA/OIRA feud.\n1990\n*30 July - A member of the Provisional IRA was shot and injured and another had his arm broken during clashes with the OIRA in the Markets area of Belfast. In response the PIRA moved large numbers of its members into the area, while 30-40 members of the Workers Party/OIRA barricaded themselves inside the social club where the fighting began, for days afterwards. Sinn Féin sources alleged the OIRA were threatening to shoot a \"public and prominent member\" of the party.\n*24 November - The OIRA allegedly attempted to abduct a former Provisional IRA prisoner at gunpoint from a pub in the Twinbrook area of Belfast, following an argument. In the brawl that followed an OIRA revolver was lost and an OIRA member beaten unconscious.\n1992\n*22 February - There was a split in the Workers' Party (long believed to be the political wing of the OIRA) when Proinsias de Rossa failed to get assurance that the Workers' Party had severed all links with the Official IRA.\n*17 October - the OIRA carried out a series of orchestrated attacks on members of the Provisional IRA in Belfast. OIRA gunmen first tried to kill a man in the Albert Street area of the Lower Falls. OIRA members then opened fire in a bookmakers in the Markets area of Belfast, wounding the intended target and a 78-year-old man who tried to intervene. Gunmen also forced their way into the home of a senior Provisional IRA man in the Clondard area but missed him. That night OIRA gunmen attacked a taxi depot in West Belfast but failed to breach a backroom where staff were taking cover. The follow morning OIRA members broke into a house in Twinbrook and put a gun to the head a householder before realising they had made a mistake. Allegedly, the attacks were spurred by a PIRA quadruple punishment shooting on a former Workers' Party member accused of anti-social behaviour.\n1993\n*29 August - gunshots were exchanged between the Provisional and the Official IRA in the Markets area of Belfast.\n1995\nSome members of the OIRA broke away to form the Official Republican Movement (ORM). The ORM members were angry with the lack of support the Workers Party gave to OIRA prisoners.\n1997\n*6 January - A man was shot in the leg as so-called \"punishment attack\" in West Belfast. It's claimed Volunteers from the OIRA carried out the attack.\n*6 August - A Taxi driver was shot in the legs in another \"punishment attack\", people claimed the OIRA were responsible for the attack.\n1998\n*11 June - Shots were fired at a Sinn Féin election worker in south Belfast. Sinn Féin claimed the attack was carried out by the Official IRA.\n2014\n*July - The Official IRA Command Staff Belfast announced that they would retaliate against individuals using the organization's name to threaten people in different parts of Belfast and that the OIRA is not defunct and \"...not engaging militarily in any way...\".\nSee also\nFurther reading\n*[http://news.bbc.co.uk/onthisday/hi/dates/stories/may/30/newsid_2973000/2973759.stm \"Official IRA declares ceasefire\"]. BBC News, 30 May 1972.\nReferences"
    }
  ]
}