{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of British diplomatic history\n\nThis timeline covers the main points of British (and English) foreign policy from 1485 to the early 21st century.\n16th century\n* Henry VII becomes king (1485–1509), founding the Tudor dynasty and ending the long civil war called \"Wars of the Roses\". His foreign policy involves an alliance with Spain, cemented by the marriage of his son Arthur, Prince of Wales to the Spanish princess Catherine of Aragon. However, after 5 months, Arthur dies at the age of 15. Henry VII reverses the Plantagenet policy of acquiring more French territory; he generally pursues a more defensive, Anglo-centric policy\n* 1485–1509: The king promotes the woolen trade with Netherlands; helps English merchants compete with the Hanseatic League; sends John Cabot to explore the New World (1497); launches the Royal Navy\n* 1489–91: England sends three expensive military expeditions to keep Brittany out of French control, but fails.\n* 1502: Treaty of \"perpetual peace\" signed with Scotland. The marriage of King James IV of Scotland to Margaret Tudor will eventually lead to the Stuart succession to the English throne.\n* 1509–47: Henry VIII becomes king; he revives the old claim to the French throne but France is now a more powerful country and the English control is limited to Calais\n* 1511–16: War of the League of Cambrai allied with Spain against France; on losing side.\n* 1513: English defeat & kill King James IV of Scotland at Battle of Flodden Field; he was allied with France.\n* 1520: 7 June: Henry VIII meets with Francis I of France near Calais at the extravagant \"Field of the Cloth of Gold\"; no alliance results.\n* 1521–26: Italian War of 1521–26 allied with Spain against France; on winning side\n* 1525: Queen Catherine does not produce the male heir the king demands, so he decides on a divorce (which angers Spain).\n* 1526–30: War of the League of Cognac, allied with France; Spain wins\n* 1533: Henry VIII severs ties with Rome because of marriage issue; and declares himself head of the English church; Catholic Spain supports the Pope.\n* 1533: Pope Clement VII excommunicates Henry and annuls his divorce from Catharine\n* 1542: War with Scotland. James V defeated at the Battle of Solway Moss\n* 1551–59: Italian War of 1551–59; allied with Spain against France; on winning side\n* 1553–58: Mary I is queen; she promotes Catholicism and an alliance with Catholic Spain\n* 1554: Mary I marries Prince Philip of Spain, the king of Spain (1556–98).  \"The Spanish marriage\" was unpopular even though Philip was to have little or no power. However he pushes Mary into alliance with Spain in a war with France that resulted in the loss of Calais in 1558\n* 1558–1603: Elizabeth I as Queen; Sir William Cecil (baron Burleigh, 1571) serves as chief advisor; they avoid European wars. Her spymaster Sir Francis Walsingham thwarts numerous plots supported by Spain or France to assassinate the Queen. The long-term English goal becomes a united and Protestant British Isles, through conquest of Ireland and alliance with Scotland. Defence is the mission of a strengthened Royal Navy.\n* 1573: Convention of Nymegen a treaty with Spain promising to end support for raids on Spanish shipping by English privateers such as Drake and Hawkins.\n* 1580–1620s: English merchants form the Levant Company to promote trade with Ottoman Empire; they build a presence in Istanbul and trade grew as the Turks bought arms and cloth.\n* 1585: By the Treaty of Nonsuch with the Netherlands, England supported the Dutch revolt against Spain with soldiers and money. Spain decides this means war and prepares an armada to invade England.\n* 1585–1604: Anglo-Spanish War (1585–1604) was an undeclared intermittent naval conflict; English strategy focused on raids on ports such as Cadiz, and seizure of Spanish merchant ships because it was much cheaper than land forces—using privateers (\"Sea Dogs\") who turned a large profit when they captured prizes—let the naval warfare pay for itself.\n* 1588: Massive Spanish invasion thwarted by destruction of Spanish Armada; it is celebrated for centuries as a decisive defeat for England's Catholic enemy.\n17th century\n* 1603–1714 was the Stuart period\n* 1603: James VI of Scotland crowned King of England (as James I of England (1603–25), marking a permanent union of the two thrones\n* 1604: King James achieves peace with Spain in Treaty of London; both sides will no longer support rebellions\n)]]\n* 1613: James marries his daughter Elizabeth to Frederick V, Elector Palatine, leader of the Protestant Union of German princes. James associates his kingdoms with the anti-Habsburg forces with this marriage.\n* 1613–20: Netherlands becomes England's major rival in trade, fishing, and whaling. The Dutch form alliances with Sweden and the Hanseatic League; England counters with an alliance with Denmark\n* 1610s: English involvement with Russia; strengthens the Muscovy Company, which has a monopoly on trade with Russia. In 1613 it obtains a monopoly on whaling in Spitsbergen. A Russian embassy comes to London in 1613.\n* 1613: The English captain John Saris arrives at Hirado, Japan, with the intent of establishing a trading factory. He met with Tokugawa Ieyasu. However, during the ten-year activity of the company between 1613 and 1623, only four English ships brought cargoes directly from London to Japan.\n* 1623: The Amboyna massacre occurs in Japan. England closes its commercial base at Hirado. The relationship ends for more than two centuries.\n* 1624–25: The king turns to France after negotiations with Spain for a marriage to the infanta had stalled. With religion closely tied to politics, France demanded an end to the persecution of Catholics in England as a condition for the marriage. The negotiations fail.\n* 1627–28: English attempt to aid besieged Huguenots in the Siege of La Rochelle, but fail. This is the only major English contribution to the Thirty Years' War.\n* 1639–40: Bishops' Wars with Scotland\n* 1642: English Civil War begins see Timeline of the English Civil War and Wars of the Three Kingdoms\n* 1652–54: First Anglo-Dutch War\n* 1654–60: Anglo-Spanish War (1654–60)\n* 1657: Alliance with France signed against Spain.\n* 1661: King Louis XIV of France begins his personal reign, taking control of the state. Louis as the leader of the most powerful nation in western Europe begins a policy of aggressively asserting French interests and expanding the borders of France. Until his death in 1715, France's hegemonic aspirations are the principle driving drive in diplomacy in western Europe.\n* 1665–67: Second Anglo-Dutch War.\n* 1665: Charles II of Spain begins his reign. The last of the Spanish Habsburgs. As Carlos is childless with no Spanish relatives and as he is very sickly, his expected death raises the highly controversial issue of succession to the Spanish throne.  The main candidates for the Spanish succession are the French Bourbons and the Austrian Habsburgs.\n* 1667: War of Devolution. France attacks Spain and occupies much of the Spanish Netherlands and the Franche-Comté. The prospect that France might annexe the entire Spanish Netherlands is viewed as a threat in London.\n* 1667: Treaty of Breda ends of the Dutch war. It is a major turning point after which mercantilism ceased to dominate Anglo-Dutch relations.\n* 1668: Triple Alliance of England, Sweden and the United Provinces formed to oppose France. Spain is defeated, but the threat that the Triple Alliance might intervene on Spain's side forces the French to make peace. Louis annexes less Spanish territory than what he planned on. The French decide that the Dutch will be their next target, and accordingly Louis seeks to break up the Triple Alliance by bidding for English and Swedish friendship.\n* 1670: Treaty of Dover. Secret Anglo-French alliance formed. In exchange for French subsidies and a promise to send an army to England should another civil war break out between king and Parliament, Charles II agrees to convert to Catholicism and to fight with France against the Dutch. Until the Glorious Revolution of 1688, England was a close ally of France.\n* 1672–74: Third Anglo-Dutch War begins.\n* 1673: Revelation of the pro-Catholic Secret Treaty of Dover causes public backlash against the war and the Crown.\n* 1688–89: William of Orange invades from the Netherlands as King James II flees; becomes William III; called the Glorious Revolution Louis continues to recognise the deposed James II/VII, who takes refuge in France and is promoted by France as the legitimate king of England, a policy known as Jacobitism. French support was a major factor in British diplomacy until the mid-18th century. William allows James and his family to escape after being captured as the threat of a Jacobite restoration supported by France forces gives those who supported the Glorious Revolution a vested interest in ensuring that England is not defeated by France, and James is restored. Parliament accordingly votes for all the war taxes William requests. From William's viewpoint, James is more useful as king in exile in France than as a prisoner in the Tower of London.\n* 12 May 1689: Reflecting the changed foreign policy orientation caused by the Glorious Revolution, William has England join the anti-French League of Augsburg and declare war on France (as a stadtholder of the United Provinces, William had already declared war on France on 26 November 1688.).\n* 1689–97: War of the Grand Alliance with France; also called  \"Nine Years War\" or \"War of the League of Augsburg\" or \" King William's War\"\n* 1697–98: During the Grand Embassy of Peter I the Russian tsar visited England for three months; improved relations and learned the best new technology especially regarding ships and navigation.\n* 11 October 1698: Treaty signed between France, England, the Dutch Republic and the Holy Roman Emperor proposing three-fold division of Spain after the soon to be expected death of Carlos II between the French Bourbons, the Austrian Habsburgs and the Bavarian Wittelsbachs. The largest portion of the Spanish realms are to go to Josef Ferdinand of Bavaria. The treaty is undermined when Josef Ferdinand dies in 1699.\n1700–1789\n* 25 March 1700: Another partition treaty signed between France, England and the United Provinces concerning the Spanish succession with the Bourbons receiving Naples, Sicily, Milan and the Spanish fortresses in Tuscany and the rest of the Spanish realms going to the Austrian Habsburgs. The proposed partition breaks down when the Holy Roman Emperor Leopold I insists that the entire Spanish empire go to his son Archduke Karl.\n* 1 November 1700: Carlos II of Spain dies, leaves the entire Spanish succession to Duke Philippe of Anjou, the second son of the Dauphin who becomes King Felipe V of Spain. King Louis XIV of France issues letters patent explicitly stating that Philip is in the line of succession to the French throne, creates the possibility of France and Spain uniting to become a Catholic super-state that would dominate Europe. Additionally, Louis takes the opportunity to remind the world that he recognizes the Catholic the Old Pretender as King James III of England/James VIII of Scotland. Louis's actions which are seen as very threatening to England and all but guarantee a war.\n* 1701–15: War of the Spanish Succession against France and Spain, in \"Grand Alliance\" with Austria, Prussia and the Dutch Republic. Britain fights in support of the Habsburg Archduke Karl of Austria's claim to the Spanish throne.\n* 15 May 1702: War declared against France.\n* 1704: Gibraltar captured on 4 August by the combined Dutch and British fleets; becomes British naval bastion into the 21st century.\n* 1704: An English and Dutch army under John Churchill, 1st Duke of Marlborough defeats the army of Louis XIV of France at Battle of Blenheim in Bavaria.\n* 1706–07: The Treaty of Union merges Scotland into Britain; the Kingdom of Great Britain comes into being on 1 May 1707. Scots play an increasingly major role in the British Empire.\n* 1708: Louis XIV sues for peace. The French agree to the Allied demand that the Archduke Karl become King of Spain, but the talks break down over the Allied demand that Louis send an army to Spain to depose his grandson Philip.\n* 12 June 1709: Louis XIV says he was willing to concede to the Allied demands over the Spanish succession, but rejected the demand that he send an army to Spain to depose as an insult to French national honour. French win the moral high ground as many people in France, Britain and elsewhere see the demand that Louis depose Philip to be outrageous. New French commander Marshal Claude Louis Hector de Villars appointed to oppose Marlborough, proves to be the ablest French general of the war.\n* 11 September 1709: Bloody Battle of Malplaquet. Marlborough victorious over Villars, but Malplaquet is a Pyrrhic victory with the British losing twice what the French suffered. Public opinion in Britain turns against the war after Malplaquet. Vigorous attacks by the Tory opposition on the Whig government for the war, its support of \"Butcher Marlborough\" and widespread corruption in regards to war contracts.\n* 2 October–16 November 1710: General election results in a landslide victory for the Tories on a peace platform.\n* 17 April 1711: Holy Roman Emperor Josef I dies, and his younger brother the Archduke Karl is elected his successor. Queen Anne and her ministers see no point to continuing the war as allowing Karl to become King of Spain would create a Habsburg super-state which would be just as much a potential danger as a Bourbon super-state.\n* 8 October 1711: British and French governments sign the \"London Preliminaries\" to a peace treaty.\n* 29 January 1712: Peace conference opens in Utrecht.\n* May 1712: Queen Anne issues \"Restraining Orders\" that forbid the British Army to fight the French unless attacked. Britain effectively withdraws the war.\n* 11, April 1713: Treaty of Utrecht, ends War of the Spanish Succession and gives Britain territorial gains, especially Gibraltar, Acadia. Newfoundland, and the land surrounding Hudson Bay. The lower Great Lakes-Ohio area became a free trade zone. Philip stays on the Spanish throne, but is excluded from the French succession. The Spanish Netherlands becomes the Austrian Netherlands. Having strategically important Low Countries under Bourbon control is seen as a threat to Britain.\n* 1714: The Elector of Hanover becomes king of Great Britain as George I; start of the Hanoverian dynasty.\n* 1714–17, 1731–1730: Charles Townshend, 2nd Viscount Townshend largely sets foreign policy as Secretary of State for the Northern Department; after 1726 displaced by Robert Walpole\n* 1715: Death of King Louis XIV in France. Regency of Duke of Orleans pursues policy of peace and friendship towards Britain.\n* 1718–20: War of the Quadruple Alliance against Spain.\n* 1719: Failed Spanish invasion in support of Jacobites; Spanish fleet dispersed by storms. Spanish troops landed in Scotland but are defeated at Battle of Glen Shiel.\n* 1719: King George I orders Royal Navy into action against Sweden as part of the Great Northern War. The use of British power to further Hanoverian goals is deeply unpopular with public opinion.\n* 1721: Peace signed with Sweden.\n* 1722–42: Sir Robert Walpole as (in effect) the Prime Minister. He takes charge of foreign policy around 1726; Britain pursues policy of peace and non-intervention in European conflicts.\n* 1739–42: War of Jenkins' Ear begins with Spain over smuggling and trade. Public opinion demanded it over Walpole's opposition; he fell from power. The war was inconclusive and expensive; it hurt legitimate trade. It merged into the War of the Austrian Succession in 1740.\n* 1740–48: War of the Austrian Succession begins, which merges into war with Spain. Britain fights against France and Spain in support of Austria and its new Queen Maria Theresa.\n* 1744: Large-scale French invasion attempt on southern England with Charles Edward Stuart stopped by storms, France declares war.\n* 1746: 16 April: Battle of Culloden in Scotland. Final victory of Hanoverians over Jacobites supported by France\n* 1748: Treaty of Aix-la-Chapelle (1748) ends War of Austrian Succession. The war was indecisive and the \"peace\" was an armed truce.\n* 1754: Undeclared war between France and Britain begins in North America, known as the French and Indian War in the United States. Fighting breaks out in the Ohio river valley between Franco-Indian and British and colonial American forces.\n* 1756: Westminster Convention signed between Britain and Prussia. Part of the Diplomatic Revolution that saw Britain drop long-standing ally Austria in favour of Prussia.\n* 1756–63 Seven Years' War, Britain, Prussia, and Hanover against France, Austria, the Russian Empire, Sweden, and Saxony. Major battles in Europe and North America; the East India Company also in involved in the Third Carnatic War (1756–1763) in India. Britain victorious and takes control of all of Canada; France seeks revenge.\n* 1775–83: American Revolutionary War as Thirteen Colonies revolt; Britain has no major allies.\n* 1776: Royal governors expelled from Thirteen United Colonies; they vote independence as the United States of America on 2 July; Declaration of Independence adopted on 4 July; France ships arms to Americans\n* 1777: France decides to recognise America in December after British invasion army from Canada surrenders to Americans at the Battle of Saratoga in New York; French goal is revenge from defeat in 1763\n* 1778: Treaty of Allies. US and France form military alliance against Britain. The military and naval strengths of the two sides of the war are now about equal.\n* 1778: Carlisle Peace Commission offers Americans all the terms they sought in 1775, but not independence; rejected\n* 1779: Spain enters the war as an ally of France (but not of US)\n* 1780: Russian Empire proclaims \"armed neutrality\" which helps France & the US and hurts the British cause\n* 1780–81: Russia and Austria propose peace terms; rejected by US\n* 1781: At peace negotiations in Paris, Congress insists on independence; all else is negotiable; British policy is to help US at expense of France\n* 1783: Treaty of Paris ends Revolutionary War; British give generous terms to US with boundaries as British North America on north, Mississippi River on west, Florida on south. Britain gives East and West Florida to Spain\n* 1784: Britain allows trade with America but forbid some American food exports to West Indies; British exports to America reach £3.7 million, imports only £750,000\n* 1784: Pitt's India Act re-organised the British East India Company to minimise corruption; it centralised British rule by increasing the power of the Governor-General\n* 1785: Congress appoints John Adams as minister to Court of St James's\n1789–1815\n* 1789–1815: The French Revolution polarized British political opinion in the 1790s, with conservatives outraged at killing of the king, the expulsion of the nobles, and the Reign of Terror.  Britain was at war against France almost continuously from 1793 until the final defeat of Napoleon in 1815. Its strategy was to mobilize and fund the coalition against France. William Pitt the Younger was the dominant leader until his death in 1806. At home, conservatives castigated every radical opinion as \"Jacobin\" (in reference to the leaders of the Terror), warning that radicalism threatened an upheaval of British society.\n* 1791–92: Government rejects intervention in French Revolution. Reasons are based on realism not ideology and are to avoid French attacks on the Austrian Netherlands; to not worsen the fragile status of King Louis XVI; and to prevent formation of a strong Continental league.\n* 1792–1799: French Revolutionary Wars\n* 1792–97: War of the First Coalition: Prussia and Austria joined after 1793 by Britain, Spain, the Netherlands, Sardinia, Naples, and Tuscany against French Republic.\n* 1792: Austria and Prussia invade France. The French defeat the invaders and then go on the offensive by invading the Austria Netherlands (modern Belgium) in late 1792. This causes grave tension with Britain as it was British policy to ensure that France could not control the \"narrow seas\" by keeping the French out of the Low Countries.\n* 1792: In India, victory over Tipu Sultan in Third Anglo-Mysore War; cession of one half of Mysore to the British and their allies.\n* 1793: France declares war on Britain.\n* 1794: Jay Treaty with the United States and normalizes trade; British withdraws from forts in Northwest Territory; decade of peace with U.S.  France is angered seeing a violation of its 1777 treaty with the U.S.\n* 1802–03: Peace of Amiens allows 13 months of peace with France.\n* 1803:  Napoleonic Wars (1803–1815) against France\n* 1803–06: War of the Third Coalition: Napoleon closes out the Holy Roman Empire.\n* 1803: By the Anglo-Russian agreement, Britain pays a subsidy of £1.5 million for every 100,000 Russian soldiers in the field.  Subsidies also went to Austria and other allies.\n* 1804: Pitt organized the Third Coalition'' against Napoleon; it last until 1806 and was marked by mostly French victories\n* 1805: Decisive defeat of the French navy at the Battle of Trafalgar by Nelson; end of invasion threats\n* 1806–07: Britain leads the Fourth Coalition in alliance with Prussia, Russia, Saxony, and Sweden. Napoleon leads France to victory at numerous major battles, notably Battle of Jena–Auerstedt)\n* 1807: Britain makes the international slave trade criminal; Slave Trade Act 1807; US criminalizes the international slave trade at the same time.\n* 1808–14: Peninsular War against Napoleonic forces in Spain; result is victory under the Duke of Wellington\n* 1809–15: Royal Navy defeats French and seizes Ionian Islands. British gain them in 1815 and designate a new colony, United States of the Ionian Islands. It was ceded to Greece in 1864.\n* 1812–15: US declares War of 1812 over national honour, neutral rights at sea, British support for western Indians.\n* 1813: Napoleon defeated at Battle of the Nations; British gains and threatens France\n* 1814: France invaded; Napoleon abdicates and Congress of Vienna convenes\n* 1814: Anglo-Nepalese War (1814–1816)\n* 1815: With the War of 1812 against the U.S. a military draw, the British abandon their First Nation allies and agree at the Treaty of Ghent to restore the prewar status quo; thus begins a permanent peace along the US-Canada border, marred only by occasional small, unauthorised raids\n* 1815: Napoleon returns and for 100 days is again a threat; he is defeated at the Battle of Waterloo and exiled to a distant island; the Napoleonic Wars end, marking the start of the Britain's Imperial Century, 1815–1914.\n* 1815: Second Kandyan War (1815) – in Ceylon (now Sri Lanka)\n1815–1860\n* 1814–22: Castlereagh as Secretary of State for Foreign Affairs (foreign minister) works with the Congress of Vienna to provide a peace in Europe consistent with the conservative mood of the day. His Congress system sees the main powers meeting every two years or so to collectively manage European affairs. It resolves the Polish-Saxon crisis at Vienna and the question of Greek independence at Laibach. The following ten years saw five European Congresses where disputes were resolved with a diminishing degree of effectiveness. Finally, by 1822, the whole system had collapsed. During this period, Russia emerges as Britain's main enemy, mostly because of tensions associated with the Eastern Question. Anglo-Russian rivalry only ends in the early 20th century.\n* 1817: Third Anglo-Maratha War (1817–1818) – India\n* 1818: Rush–Bagot Treaty with the United States ends incipient naval race on the Great Lakes. Both powers impose limitations on how many warships they will maintain on the Great Lakes.\n* 1822–27: George Canning in charge of foreign policy, avoids co-operation with European powers; supports the United States (Monroe Doctrine) to preserve newly independent Latin American states; goal is to prevent French influence and allow British merchants access to the opening markets. Temperley summarizes Canning's policies, which formed the basis of British foreign policy for decades:\n::non-intervention; no European police system; every nation for itself, and God for us all; balance of power; respect for facts, not for abstract theories; respect for treaty rights, but caution in extending them … a republic is as good a member of the comity of nations as a monarch. 'England not Europe.' 'Our foreign policy cannot be conducted against the will of the nation.' 'Europe's domain extends to the shores of the Atlantic, England's begins there.'\n* 1821–32: Britain supports Greece in the Greek War of Independence from the Ottoman Empire; the 1832 Treaty of Constantinople is ratified at the London Conference of 1832.\n* 1824: Anglo-Dutch Treaty of 1824 is signed.\n* 1824: First Anglo-Burmese War (1824–1826) in Burma\n* 1830–65: Lord Palmerston dominates British foreign policy; his goal was to keep Britain dominant by maintaining the balance of power in Europe; he tried to keep autocratic nations like Russia in check; he supported liberal regimes because they led to greater stability in the international system.\n* 1833: Slavery Abolition Act 1833 frees slaves in Empire; the owners (who mostly reside in Britain) are paid £20 million.\n* 1839: Treaty of London. Britain, Germany and other powers guarantee the neutrality of Belgium; Germany violated it in 1914, so Britain declared war.\n* 1839: Syrian War (1839–40)\n* 1839–42: First Anglo-Afghan War\n* 1840: Oriental Crisis. The ambitions of Muhammad Ali, the more or less independent Ottoman governor of Egypt supported by France to take over the Ottoman Empire nearly causes an Anglo-French war.\n* 1842: Treaty of Nanking follows military victory in First Opium War with China (1839 to 1842). It opens trade, cedes territory (especially Hong Kong), fixes Chinese tariffs at a low rate, grants extraterritorial rights to foreigners, and provides both a most favoured nation clause, as well as diplomatic representation.\n* 1845: Blockade of the Río de la Plata. To block the ambitions of the Argentine dictator Juan Manuel de Rosas to take over Uruguay, Britain and France impose a five-year blockade on the Río de la Plata.\n* 1845: Oregon boundary dispute threatens war with the United States.\n* 1846: Oregon Treaty ends dispute with the United States. Border between British North American and the United States settled on the 49th parallel.\n* 1846: The Corn Laws are repealed; free trade in grain\n* 1848–49. Second Sikh war; the British East India Company subjugates the Sikh Empire, and annexes Punjab\n* 1852: Second Burmese war; British Burma annexed; the remainder of Burma is annexed after the Third Anglo-Burmese War in 1885.\n* 1853–56: Crimean War with Russia. British policy, in league with France, is to protect the decaying Ottoman Empire from Russian advances. The war itself is largely fought on the Crimean peninsula in southern Russia, and is mishandled by both sides. British naval success in the Baltic forces Russia to sue for peace; it demilitarises the Black Sea, ensuring British dominance of the eastern Mediterranean.\n* 1856: Second Opium War with China.\n* 1857: Indian Mutiny suppressed\n* 1858: The government of India transferred to the crown; the government appoints a viceroy.\n* 1858: The Anglo-Japanese Treaty of Amity and Commerce is signed.\n* 1860: Treaty of Tientsin and Convention of Peking. End of war with China. Deeper British commercial involvement in China.\n1860–1896\n* 1860–70: The British government gives moral and diplomatic support to the \"Risorgimento\" (Unification of Italy creation of the modern Italian state against considerable international opposition. The famed hero of unification, Giuseppe Garibaldi was widely celebrated in Britain.\n* 1861: Britain, Spain and France land forces in Mexico to demand repayment. Britain and Spain withdraw but France escalates and takes control of Mexico.\n* 1861–65: Neutrality in American Civil War, although Prime Minister Palmerston favours the Confederacy and is tempted to recognise the Confederacy, which would lead to war with US.\n* 1861: War scare over Trent Affair resolved when US releases Confederate diplomats seized from a British ship.\n* 1864: Britain avoids involvement in the War between Denmark on the one side and Prussia and Austria regarding the Schleswig-Holstein question.\n* 1865: Anglo-Moroccan Accords signed by John Drummond-Hay helps preserve Moroccan independence during the Scramble for Africa but reduces the sultanate's customs and royal trade monopolies.\n* 1867: British North America Act, 1867, creates Canada, a federation with internal self-government; foreign and defence matters handled by London. The long-term goal is for Canada to pay for its own defence.\n* 1868 to 1881: Gladstone formulates a moralistic policy regarding Afghanistan.\n* 1871: Taking advantage of France's distress, Russia abrogates the 1856 Treaty of Paris and remilitarises the Black Sea.  The action is approved at the London Convention of 1871. Revival of rivalry with Russia in the Near East.\n* 1871: Treaty of Washington with the United States, sets up arbitration that settles the Alabama Claims in 1872 in US favour.\n* 1871: The unification of Germany following its defeat of France leads the government to expand the Army, and put Edward Cardwell in charge of modernizing the forces.\n* 1873: The Imperial College of Engineering opens in Tokyo with Henry Dyer as principal; Japan studies and copies British technology and business methods\n* 1874–80: The Conservative government of Benjamin Disraeli scored a number of achievements. In 1875 came the purchase of the controlling shares in the Suez Canal company. By negotiations, Russia gave up substantial gains in the Balkans and a foothold in the Mediterranean. Britain gains control of Cyprus from the Ottomans as a naval base covering the Eastern Mediterranean. In exchange, Britain guaranteed the Asiatic territories of the Ottoman Empire. Britain did not do well in conflicts in Afghanistan and South Africa.\n* 1875–1900: Britain joins in the Scramble for Africa with major gains in East Africa, South Africa, and West Africa, and keeps \"temporary\" control of Egypt.\n* 1875–98: Tensions with France were high over African colonies. At the Fashoda Incident in 1898 fighting was possible, but France retreated and tensions ended.\n* 1875: The British government  purchases the Suez Canal shares from the almost bankrupt khedive of Egypt, Isma'il Pasha. French investors own the majority of shares.\n* 1875–78: Prime Minister Benjamin Disraeli works during the Near East crisis to diminish rival Russian interests in the Ottoman Empire. He gained what he wanted at the Congress of Berlin (1878), but did not find a solution to the Eastern Question in the Balkans.\n* 1876: Bulgarian Horrors causes outrage in Britain. Gladstone stages nationwide speaking tour attacking Disraeli government for its support of the Turks.\n* 1877–78: Russian-Turkish War ends in a Russian victory. The Treaty of San Stefano is widely seen as an unacceptable increase in Russian power in the Balkans.\n* 1878: Widespread \"jingoism\" celebrates sending a British fleet into Turkish waters to counter the advance of Russia.\n* 1878: Treaty of Berlin gives Britain possession of Cyprus.  Britain leases Cyprus from Turkey in order to block possible Russian expansion. In 1914 Britain annexed Cyprus and made it a crown colony in 1927. Disraeli boasts that he secured \"Peace with honour\" as well as Cyprus.\n* 1879: Egypt goes bankrupt. Loss of Egyptian financial independence to a consortium of European bankers. Evelyn Baring sent to reorganise the Egyptian government in order that Egypt could pay off its debts.\n* 1879: Anglo-Zulu War. British forward policy in South Africa aiming at complete control of the country as Britain wishes to maintain control over the alternative Cape route in case the Suez Canal should not be available.\n* 1880: Foreign policy is a major issue in the British general election, helping Liberals under Gladstone to defeat Disraeli's Conservative Party by a landslide.\n* 1880–81: First Boer War; Britain defeated by the South African Republic of the Afrikaners\n* 1880s: Gladstone calls for a \"Concert of Europe\" – a peaceful European order that overcomes traditional rivalries by emphasising co-operation over conflict, mutual trust over suspicion. He proposes that the rule of law should supplant the reign of force and beggar-thy-neighbor policies. However, he was outmaneuvered by Bismarck's system of \"realpolitik\" using manipulated alliances and antagonisms.\n* 1881: Pretoria Convention ends war with the Transvaal and Orange Free State. Henceforward, the Boer republics are independent with a vague British claim of suzerainty. Source of much future tension as the Boer republics see themselves as completely independent states while Britain does not.\n* 1882: Uprising in Egypt led by Ahmed Orabi against the foreign control of the government. British take control of Egypt after a war (although it remains nominally part of Ottoman Empire).\n* 1883: United Kingdom–Korea Treaty of 1883 is signed.\n* 1883–1907: Lord Cromer rules Egypt as consul general\n* 1885: The Panjdeh incident causes a war scare with Russia.\n* 1885–1902:  Historians agree that Lord Salisbury as foreign minister and prime minister was a strong and effective leader in foreign affairs.  He had a superb grasp of the issues, and proved:\n::a patient, pragmatic practitioner, with a keen understanding of Britain's historic interests....He oversaw the partition of Africa, the emergence of Germany and the United States as imperial powers, and the transfer of British attention from the Dardanelles to Suez without provoking a serious confrontation of the great powers.\n* 1886: Witwatersrand Gold Rush. Gold is discovered in the Transvaal. The new wealth of the South African Republic threatens to undermine the assumptions behind the Pretoria convention as it was felt that the two Boer republics were too small and weak to threaten British rule over the Cape Colony and Natal, and thus British control over the Cape route to India. Now with gold being mined in the Witwatersrand, the South African Republic uses its new wealth to go on an arms-buying spree in Europe, which potentially could threaten the British position in South Africa. Renewed British push to bring all of southern Africa under its control.\n* 1887: To protect the Suez Canal and the sea lanes to India and Asia, Prime Minister Salisbury signs the Mediterranean Agreements (March and December 1887) with Italy and Austria. This aligns Britain indirectly with Germany and the Triple Alliance.\n* 1889: Salisbury increases he dominance of the Royal navy through the Naval Defence Act 1889, with an extra £20 million for ten new battleships, thirty-eight new cruisers, eighteen new torpedo boats and four new fast gunboats.\n* 1890–96: Britain suffers a series of diplomatic reverses, including the abandonment of the Congo treaty with Belgium; the French conquest of Madagascar; the collaboration of France, Russia and Germany in the Far East; the Venezuela crisis with United States; the Armenian massacres in the Ottoman Empire; the emerging alliance between France and Russia; and the debacle of the Jameson Raid; debates focus on Britain's lack of allies.\n* 1890–1902: Salisbury promotes a policy of Splendid isolation with no formal allies.\n* 1890: The South African Republic passes a law that disenfranchised most of the uitlanders as foreign, mostly British workers in the Transvaal's gold fields are known. The uitlander issue becomes a major source of strain and tension in the following decade.\n* 1890: Heligoland–Zanzibar Treaty with Germany. Britain gains the German colony of Zanzibar while giving up a small strategic island off the German coast, and agrees on boundaries in Africa.\n* 1895: Venezuela Crisis. Border dispute with Venezuela causes major Anglo-American crisis when the United States intervenes to take Venezuela's side. It was resolved through arbitration and was last crisis that threatened war with the United States.\n* 1894–96:  Britain puts pressure on Turkey to stop its mistreatment of Christians. A series of escalating atrocities against the Armenians living in Turkey causes public outrage in Britain. All efforts to coordinate sanctions or punishments with the other Powers fail, and the Armenians get no help.\n* 1895–96: Jameson Raid. Botched attempt at a coup to overthrow President Paul Kruger of the South African Republic, instigated by Cecil Rhodes. The result was to strengthen Afrikaner nationalism and embarrass Britain.\n* 1896: January – Germany's Kaiser Wilhelm escalated tensions with his Kruger telegram of January 1896 congratulating President Kruger of the Transvaal for beating off the Jameson raid. German officials in Berlin had managed to stop the Kaiser from proposing a German protectorate over the Transvaal. The telegram backfired, as the British began to see Germany as a major threat and moved to friendlier relationships with France.\n1897–1919\n* 1897: Admiral Alfred von Tirpitz appointed German Naval Secretary of State; beginning of the transformation of German Navy from small, coastal defence force to a fleet meant to challenge British naval power. Tirpitz calls for Riskflotte (Risk Fleet) that would make it too risky for Britain to take on Germany as part of wider bid to alter the international balance of power decisively in the Reich\"s favour.\n* 1897: German Foreign Secretary Bernhard von Bülow calls for Weltpolitik (World politics). New policy of Germany to assert its claim to be a global as opposed to a European power. Germany abandons Bismarck-era policy of being a conservative power committed to upholding the status quo, and instead becomes a revisionist power intent on challenging and upsetting international order.  It was now the policy of Germany to assert its claim to be a global power.  The long-run result was the inability of Britain and Germany to be friends or to form an alliance.\n* 1898: First Navy Law passed in Germany that commits the Reich to building up its fleet to achieve Tirpitz's vision.\n* 1898: Convention for the Extension of Hong Kong Territory with China.\n* 1898: Anglo-Egyptian control over Sudan established.\n* 1898: Fashoda Incident threatens war with France over control of upper Nile River (in present-day eastern South Sudan); the French back down. The long-term British goal is to link South Africa to Egypt with the Cape to Cairo Railway. It would facilitate governance, give rapid mobility to the military, promote settlement and foster trade. Most of the railway is eventually built, but there were gaps.\n* 1898: Spanish–American War. Britain maintains pro-American neutrality. Anglo-American relations began to improve markedly at the end of the 19th century.\n* 1899: Britain endorses the \"Open Door Policy\" allowing the world access to Chinese markets.\n* 1899: Bloemfontein Conference between Alfred Milner, the British High Commissioner for South Africa and President Paul Kruger of the Transvaal. Principal issue the status of the uitlanders and the English language together with Milner's demand that the Transvaal's sovereignty be sharply reduced. Conference ends in failure.\n* 1899: Colonial Secretary Joseph Chamberlain's offer of an alliance with Germany is refused by Berlin.\n* 1899: Beginning of the Second Boer War when the Transvaal (South African Republic) declares war on Britain.\n* 1899: The first Hague Conference was a major effort to codify the rules for international peace. It set up machinery to help resolve international disputes. Britain and Russia used its procedures in resolving the Dogger Bank incident of 1904. It established a Permanent Court of Arbitration. It did little to slow the arms race in Europe. Its declaration banning the use of poison gas was simply ignored.\n* 1900: British forces join in international rescue in Peking, China, & suppress the anti-Western Boxer Rebellion.\n* 1900: Second Navy Law passed in Germany calling for huge increase in the size of the German Navy.\n* 1901: Hay–Pauncefote Treaty with US nullifies Clayton–Bulwer Treaty of 1850; allows U.S. to build the Panama Canal & guarantees open passage for any nation. Panama Canal opens in 1914.\n* 1902: Lenient Treaty of Vereeniging. Boer War ends in a British victory; Transvaal and Orange Free State are annexed and in 1910 become part of Union of South Africa. Boer leaders especially Jan Smuts accepted as British leaders.\nand Marianne happily dancing together, celebrating the new spirit of co-operation in the \"entente cordiale\"]]\n* 1902: Reports from Captain Watson, naval attaché to Germany indicate that the German build-up that had begun in 1898 is intended to build a fleet meant to challenge British sea power. Beginning of the Anglo-German naval race.\n* 1902: The Anglo-Japanese Alliance is signed; in 1905 it is renewed and expanded; it is not renewed in 1923.\n* 1903: King Edward VII, new to the throne but long familiar with France, makes a highly successful visit to Paris, turning hostility into friendship.\n* 1903: Younghusband expedition to Tibet. Britain invades Tibet to counter supposed Russian influence at the court of the Dalai Lama that seems to be threatening India.\n* 1904: Beginning of the Russo-Japanese War. Britain supports Japan while France and Germany support Russia. Britain shares signet (signals intelligence) with Japan against Russia. Due to shared intelligence with Japan, British decision-makers increasingly come to the conclusion that Germany is supporting Russia as part of a bid to disturb the balance of power in Europe.\n* 1904: 8 April. Three agreements with France (\"Entente cordiale\") end many points of friction. France recognises British control over Egypt, while Britain reciprocates regarding France in Morocco. France drops exclusive fishery rights on the shores of Newfoundland and in return receives an indemnity and territory in Gambia (Senegal) and Nigeria. Britain drops complaints regarding the French customs régime in Madagascar. Spheres of influence are defines in Siam (Thailand). Issues regarding New Hebrides are settled in 1906. Which means doing we see its rights in Egypt, it became possible for the British to significantly extend their control. The Entente was negotiated between the French foreign minister, Théophile Delcassé, and the British foreign secretary, Lord Lansdowne.\n* 1904: Convention with Tibet allowing a British trade mission to be established and is intended to pull Tibet within the British sphere of influence.\n* 1904: Dogger Bank incident. Russian Baltic fleet en route to Korea to fight Japan accidentally fires on British fishing trawlers. Britain and Russia almost go to war. Crisis ends when Russia apologises and pays compensation.\n* 1905: First Moroccan Crisis. Germany threatens war with France in an attempt to break entente cordiale. Britain makes it clear that in the event of a German attack on France, Britain will intervene on France's side.\n* 1905: Persian Constitutional Revolution causes tension with Russia. Britain supports Persian liberals while Russia supports the Shah.\n* 1906: Algeciras Conference ends the Moroccan Crisis in a diplomatic defeat for Germany as France took the dominant role in North Africa.  The Crisis brought London and Paris much closer and set up the presumption they would be allies if Germany attacked either one.\n* 1906: Britain reacted to Germany's accelerated naval arms race by major innovations, especially those developed by Lord Fisher.  The launch of  rendered all other battleships technically obsolete and marked British success in maintaining both qualitative and quantitative lead in the naval race with Germany.\n* 1906: Third Navy Law passed in Germany. Germany plans to build \"all big gun\" ships of its own to keep up with Britain in the naval race.\nof 1882–1914, shown in red.]]\n* 1907: Anglo-Russian Entente was achieved and outstanding disputes between Britain and Russia settled. It ended The Great Game regarding control of Tibet, Persia, and Afghanistan.\n* 1907: Triple Entente with France and Russia, stands opposed to the Triple Alliance of Germany, Austria and Italy.\n* 1908: Fourth Navy Law passed in Germany; British popular response was a clamour for more warship construction under the slogan \"We want eight and won't wait\" when it appears that Germany is winning the naval race.\n* 1911: Reports from Captain Watson, naval attaché to Germany indicate growing power and efficiency of German warships, heavy guns and sailors.\n* 1911: Agadir Crisis France strong-armed itself into seizing more control over Morocco. The German Foreign Minister Alfred von Kiderlen-Waechter was not opposed to these moves, but he felt Germany was entitled to some compensation elsewhere in Africa. He sent a small warship, made saber-rattling threats, and whipped up anger among German nationalists.  France and Germany soon agreed on a compromise.  However, the British cabinet was alarmed at Germany's aggressiveness toward France.  David Lloyd George made a dramatic \"Mansion House\" speech that denounced the German move an intolerable humiliation. There was talk of war, and Germany backed down. Relations with Berlin remained sour.\n* 1911: Reciprocity treaty lowering tariffs between Canada and US fails on surge of pro-British, anti-American sentiments led by Conservative Party.\n* 1912: Fifth Navy Law passed in Germany Expanding the German fleet as a threat to the Royal Navy's control of the seas.\n* 1912: Haldane Mission to Germany. Richard Haldane visits Berlin to meet with high officials in an attempt to end the naval race with Germany. Haldane's offer of a \"naval holiday\" in building warships ends in failure when the Germans attempt to link a \"naval holiday\" with a British promise to remain neutral if Germany should attack France; Admiral Tirpitz orders further naval construction.\n* 1914: July Crisis triggered when Austria-Hungary submits ultimatum to Serbia containing terms meant to inspire rejection. Foreign Secretary Edward Grey tries hard to maintain peace and mediate a compromise, but falls short.\n* 1914: 4 August- The king, in the name of Britain and his Empire declares war on Germany and Austria following German violation of the neurality of Belgium.\n* 1914: Stalemate on Western Front, but Britain & dominions seize the overseas German colonies\n* 1915: British passenger liner  torpedoed without warning by German submarine and sinks in 18 minutes; 1,200 dead. Germany violated international law by not allowing passengers to escape.\n* 1915: Treaty of London brings Italy into the war on the Allied state. Italy is secretly promised major gains at the expense of Austria-Hungary.\n* 1916: Sykes–Picot Agreement is signed. Britain and France decide on spheres of influence if the Ottoman Empire should come to an end.\n* 1917: 7 April. US declares war on Germany and Austria; does not actually join Allies and remains independent force; sends token army in 1917. A major factor in bringing the United States into war is the Zimmermann Telegram, a German proposal for anti-American alliances with Mexico and Japan that was intercepted, decoded and leaked by the British.\n* 1917: Balfour Declaration is issued giving British support for a Jewish \"national home\" in Palestine.\n* 1918: Britain accepts the Fourteen Points, the American statement of war aims.\n* 1918: Beginning of British intervention in the Russian Civil War. After the end of World War I, Britain will be the biggest supporter of the Russian White forces.\n* 1918: November. Britain and Allies defeat Germany, Austria-Hungary and Turkey; their empires dissolved (along with Russian Empire)\n* 1919: Treaty of Versailles Prime Minister David Lloyd George was a key negotiator. In the Khaki Election of 1918, coming days after the Allied victory over Germany, Lloyd George promised to impose a harsh treaty on Germany. At the Versailles Conference, however, he took a much more moderate approach. France and Italy however demanded and achieved harsh terms, including German admission of guilt for starting the war (which humiliated Germany), and a demand that Germany pay the entire Allied cost of the war, including veterans' benefits and interest.\n* 1919: League of Nations formed, with Britain an active member, along with the Dominions and India\n1920–1934\n* 1919: Greco-Turkish War begins. Britain was chief supporter of Greece, but it did poorly.\n* 1919: War Secretary Winston Churchill introduces the Ten Year Rule that military spending is to be based on the assumption that there will be no major war for the next ten years. The Ten Year Rule leads to a huge decline in military spending.\n* 1920: Leonid Krasin visits London to meet Lloyd George. First official contact between Soviet Russia and Britain.\n* 1921: Anglo-Soviet Trade Agreement is signed. First treaty between Britain and Soviet Russia.\n* 1921: Franklin-Bouillon Agreement is signed. France supports Turkey in the Greco-Turkish War while Britain continues to support Greece.\n* 1922: Washington Naval Conference concluding in the Four-Power Treaty, Five-Power Treaty, and Nine-Power Treaty; major naval disarmament for 10 years with sharp reduction of all major navies. Britain abandons claim to have navy \"second to none\", and recognises United States Navy as equal. The costs of naval races with the U.S. and Japan are prohibitively expensive for a British economy weakened by World War I. The relative naval strengths of the major powers are fixed at GB = 5, US = 5, Japan = 3, France = 1.75, Italy = 1.75. Britain does not build up to its allowed maximum. The powers will abide by the treaty for ten years, then begin a naval arms race.\n* 1922: League of Nation awards Britain a mandate to control Palestine, which it had conquered from the Ottoman Empire in 1917. The mandate lasts until 1948.\n* 1922: Genoa conference. Britain clashes openly with France over the amount of reparations to be collected from Germany.\n* 1922: Alliance with Japan ends; Canada and Australia disliked the treaty, as did the U.S.\n* 1922: Chanak Crisis. Britain almost goes to war with Turkey. Some of the Dominions refuse to promise to war if Britain does, which comes as a major shock in Whitehall. The intention of Lloyd George to go to war with Turkey causes the downfall of his government.\n* 1923: The British government renegotiated its £978 million war debt to the US Treasury by promising regular payments of £34 million for ten years then £40 million for 52 years. The idea was for the US to loan money to Germany, which in turn paid reparations to Britain, which in turn paid off its loans from the US government. In 1931 all German payments ended, and in 1932 Britain suspended its payments to the US. All the First World War debts were finally repaid after 1945.\n* 1923: France occupies the Ruhr following German default in reparations. Britain wanted Germany's economy to revive, so could make reparation payments and increased trade. France rejected Britain's argument, and along with Belgium occupied the Ruhr 1922–25. British policy was then uncertain, until it hit on the idea of inviting the Americans to resolve the problem, which was done with the Dawes Plan.\n* 1923: Treaty of Lausanne with Turkey. Britain was forced to make major concessions to the Turks as compared to the previous Treaty of Sèvres of 1920.\n* 1924: London conference between Labour Prime Minister Ramsay MacDonald and French Premier Édouard Herriot. Britain forced France to reduce the amount of reparations to be collected from Germany. The British diplomat Sir Eric Phipps commented that \"The London Conference was for the French 'man in the street' one long Calvary as he saw M. Herriot abandoning one by one the cherished possessions of French preponderance on the Reparations Commission, the right of sanctions in the event of German default, the economic occupation of the Ruhr, the French-Belgian railroad Régie, and finally, the military occupation of the Ruhr within a year\".\n* 1924: The Geneva Protocol, (Protocol for the pacific settlement of international disputes) was a proposal to the League of Nations presented by Prime Minister Ramsay MacDonald, and his French counterpart Édouard Herriot. It set up compulsory arbitration of disputes, and a created a method to determine who was the aggressor in international conflicts. All legal disputes between nations would be submitted to the World Court. It called for a disarmament conference in 1925. Any government which refused to comply in a dispute would be named an aggressor. Any victim of aggression was to receive immediate assistance from the League members. McDonald lost power and the new Conservatives government condemned the proposal, fearing it would lead to conflict with the United States. Washington also opposed it, and so did all the British dominions. The proposal was tabled in 1925 and never went into effect.\n* 1924: Labour government establishes diplomatic relations with Soviet Russia.\n* 1925: Locarno Treaties normalise the status of Germany, although the provisions of the Versailles Treaty still apply; begins a decade of British efforts to stabilise a new European status quo, hoping that stability, plus trade, would prevent another war.\n* 1926: Dispute with Turkey over Mosul ends. Turkey ends claim to Mosul region of Iraq.\n* 1927: British police raid ARCOS office in London. Relations with the Soviet Union are broken off following discovery of the Soviet spy ring operating out of the ARCOS building.\n* 1929: MacDonald's Labour government restores relations with the Soviet Union.\n* 1929: MacDonald visits the United States; first visit to the US by a sitting British Prime Minister.\n* 1929–31: Labour Foreign Minister Arthur Henderson gives strong support to League of Nations.\n* 1931: Statute of Westminster recognises the full independence to the Dominions.\n* 1932: British policy in the Far East faces a crisis in 1932, when the Japanese attacked Shanghai.  Of all British foreign investment, 6% is in China and two-thirds of that is in Shanghai.  As a result, the Ten Year Rule is dropped. (It said the military planning should assume that no war would take place in the next ten years.) The Cabinet authorises a modest increase in the Royal Navy budget based on the assumption that there might a war with Japan sometime within the next decade, through constraints imposed by the Great Depression limit how much money will be spent. Beginning of British rearmament.\n* 1932: Britain suspends its World War I debt payments to the United States.\n* 1934: A secret report by the Defence Requirements Committee identifies Germany as the \"ultimate potential enemy\"; calls for Continental expeditionary force of five mechanised divisions and fourteen infantry divisions. Budget restraints prevent formation of this large force.\n* 1934: Beginning of the \"air panic\" of 1934–35, where exaggerated claims of German air strength are made in the British press. Royal Air Force becomes the main beneficiary of rearmament.\n1935–1945\n* 1935: The Peace Ballot is held with 11.5 million votes cast. The strong affirmative vote was ambiguous and the campaign was distorted by bias. Political leaders ignored it as an expression of wishful thinking rather than a serious statement of foreign policy.\n* 1935: Stresa Front formed following summit between Prime Minister Ramsay MacDonald, French Premier Pierre Laval and Italian Prime Minister Benito Mussolini vaguely sought to oppose any challenge to the Treaty of Versailles via force. Mussolini mistakenly feels that Britain has no interest in Ethiopia.\n* 1935: Anglo-German Naval Agreement signed in London. It is meant to avoid a repeat of the pre-1914 Anglo-German naval race.\n* 1935: Italy invades Ethiopia. Beginning of a crisis in Anglo-Italian relations as Britain makes half-hearted attempts to uphold collective security. Mussolini threatens of war against Britain.\n* 1935: Election of 1935 takes place. Government of Stanley Baldwin is returned to power with a promise to uphold collective security.\n* 1935: Hoare–Laval Pact with France proposes to appease Italy and evades League sanctions against Italy for invading Ethiopia. The proposal was approved by the cabinet but public reaction is highly negative and Foreign Minister Samuel Hoare is forced to resign, replaced by Anthony Eden.\n* 1936: Remilitarization of the Rhineland. Germany remilitarises the German Rhineland in explicit violation of the Versailles and Locarno treaties which said the area had to remain without soldiers. The Baldwin government protested, but valued peace highly and did not take action.  France had sufficient military superiority to expel Germany from the Rhineland but instead chose to follow Britain and do nothing. It lacked confidence in its military and feared another costly war.\n* 1936–39: British opinion is deeply split on the Spanish Civil War with the government tending to favour the right-wing Nationalists while intellectuals and unions favoured the Republic because it was anti-Fascist. Communists were leaders in protest efforts, and enlisted 2500 British and Irish volunteers go to Spain to fight for the Republic; 500 were killed. The government joins major powers in proclaiming neutrality and opposes arms shipments to either side, fearing the war might spread. Nevertheless, Germany and Italy supply the Nationalists and the USSR supplies the Republicans. The Nationalists under Francisco Franco are completely victorious in 1939.\n* 1937: Japanese planes attack British gunboats in the Yangtze River and machine-gun the car of the British Ambassador to China, Sir Hughe Knatchbull-Hugessen, who is badly injured. As these attacks occurred at the same time as the sinking of USS Panay, Britain suggests that an Anglo-American blockade of Japan as a response. The American President Franklin Roosevelt refuses the British offer and instead accepts Japanese apology, through he does allow the secret Anglo-American naval talks to begin in early 1938.\n* 1938: Mexican oil expropriation. The government of Lázaro Cárdenas nationalises land owned by British oil companies in Mexico.\n* 1938: Anglo-Italian Easter Accords are signed. Britain tries to restore relations with Italy.\n* 1938: Foreign Secretary Anthony Eden used secret intelligence reports to conclude Italy was an enemy.  He resigned in protest over Prime Minister Neville Chamberlain's moving closer to Italy to block Germany.\n* 1938: Hitler threatens war over the alleged mistreatment of ethnic Germans in the Sudetenland, a part of Czechoslovakia. Intense appeasement efforts by Britain and France to avoid war by concessions to Germany. Czechoslovakia is not consulted.\n* 1938: Britain and France signed the Munich Agreement with Nazi Germany. Prime Minister Neville Chamberlain promises it means \"peace in our time.\" Historians differ sharply; some argue the appeasement was cowardice; others argue it saved Britain, which was not prepared for war with Germany.\n* 1939: 15 March - Appeasement policy ends as Germany seizes all of Czechoslovakia\n* 1939: 31 March - Prime Minister Chamberlain issues \"guarantee\" of Polish independence in the House of Commons in co-operation with France; they will go to war should Polish independence be threatened.\n* 1939: Tientsin Incident. Britain and Japan almost to war when Japan blockades British concession in Tianjin, China.\n* 1939: Britain signs a defence treaty with Poland, guaranteeing its boundaries against German threats.\n* 1939: 1 September - Germany invades Poland; Britain and France declare war on 3 September.\n* 1939–40: \"Phoney war\" with little action on the Western Front\n* 1940: British army trapped and narrowly escapes at Dunkirk.\n* 1940: September - Britain trades bases on its colonies in the Western Hemisphere for destroyers from the United States.  The destroyers were used to defend convoys. The colonies were used as bargaining counters to secure American friendship and to minimize creeping American influence.\n* 1941: January – Britain informs the United States that unless aid is offered, Britain will be bankrupt later that year.\n* 1941: The United States begins Lend-Lease to support Allied war effort; $31.4 billion is given away to Britain and  $11.3 billion to the Soviet Union. Canada in a separate programs gives $4.7 billion. Unlike American aid in 1917–18, Lend Lease is not a loan and does not have to be repaid.\n* 1941, 22 June – Germany launched Operation Barbarossa invading the USSR, which became one of the Allies of World War II fighting against the Axis powers.\n* 1941: Prime Minister Churchill agrees on Atlantic Charter with President Roosevelt.\n* 1941: The Anglo-Soviet invasion of Iran occupied a neutral country on pretext that Iran didn't let go of German advisors in Iran.\n* 1941–45: The Arctic convoys transported supplies Britain gave without charge to the USSR during the war.\n* 1941: Japan attacks the United States, Britain and the Netherlands. Japanese seize Hong Kong, Brunei, Malaya, Sabah, Sarawak, Singapore, and Burma; Gross mistreatment of prisoners of war.\n* 1942: Britain and USSR agree that after victory Poland's boundaries would be moved westward, so that the USSR took over lands in the east while Poland gained lands in the west that had been under German control. They agreed on the \"Curzon Line\" as the boundary between Poland and the Soviet Union and the Oder-Neisse line would become the new boundary between Germany and Poland. The proposed changes angered the Polish government in exile in London, which was not consulted.\n* 1943: A. J. P. Taylor asserts, \"1943 was the year when world leadership moved from Great Britain to the United States.\"\n* 1943: The Casablanca Conference in Morocco, 14–23 January, brought together Churchill, Roosevelt and Charles de Gaulle. The Allies announced a policy of \"unconditional surrender\" from the Axis powers.\n* 1943: August - Quebec Conference (\"Quadrant\"). Combined Chiefs (US and UK) agree on 29 divisions to land in France in Operation Overlord in May 1944. Plans also discussed re landings in southern France, and operations in Burma, China and Pacific, and to share atomic bomb project.\n* 1943: An agreement is signed ending all British extraterritorial rights in China.\n* 1944: Argentina refused to go along with the American anti-German policies. Washington responded by trying to shut down Argentine exports. In 1944 President Franklin Roosevelt asked Prime Minister Winston Churchill to stop buying Argentine beef and grain. Churchill refused, saying the food was urgently needed.\n* 1944 September – Churchill and Roosevelt and Combined Chiefs meet in Second Quebec Conference (\"Octagon\"). Discussion of Pacific strategy; agreement (later revoked) on Morgenthau Plan to demilitarise Germany.\n* 1944: October – Churchill and Foreign Minister Eden meet in Moscow with Stalin and his foreign minister Vyacheslav Molotov. They planned who would control what in postwar Eastern Europe. They agreed to give 90% of the influence in Greece to Britain and 90% in Romania to Russia. Russia gained an 80%/20% division in Bulgaria and Hungary. There was a 50/50 division in Yugoslavia, and no Russian share in Italy.\n* 1944: December - Battle of Athens. British troops battle the Communist ELAS forces for control of Athens.\n1945–1989\n* 1944–47: The Jewish insurgency in Palestine as Jews confront Arabs and British in quest for independent Israel in Palestine, for which Britain holds the League of nations mandate.\n* 1945: World War II ends. Victory over Germany and Japan. Britain is financially exhausted as Lend Lease aid from the US suddenly ends in August. An \"Age of Austerity\" and cutbacks begins.\n* 1945–46: Parliament approves a $3.75 billion low-interest loan from the US Treasury in 1946, plus $1.2 billion from Canada.\n* 1945–57: Despite tight budgets Britain uses cultural diplomacy in the Middle East. The British Council, the BBC and the official overseas information services mobilises pro-democracy organisations and educational exchanges, as well as magazines, book distribution, and films industry to bolster British prestige and promote democracy.\n* 1946: UKUSA Agreement on continuing war-time signet work between the United States and the United Kingdom.\n* 1947: The government decides in secret to build an atomic bomb.\n* 1947: Government informs the United States that Britain cannot afford to subsidise the Greek government in its Greek Civil War against Communist guerrillas.\n* 1947–48: Britain withdraws from the Palestine Mandate it held since 1920 and turns the issue over to the U.N. Financial exhaustion was a main reason, but also strategic concerns, for its involvement was alienating Arab nations whose good will was desired.\n* 1948–49: The Berlin Blockade threatens Britain's status in West Berlin. The RAF plays a major role in the Berlin Airlift and the Soviets finally relent.\n* 1948–60: Malayan Emergency, a civil war against the Communist-led Malayan National Liberation Army (MNLA); Britain is victorious in the end.\n* 1949: Britain becomes founding member of NATO.\n* 1949: Amethyst incident. Frigate HMS Amethyst is fired upon by Chinese Communists on the Yangtze River.\n* 1950: Britain recognises China in January, over American objections.\n* 1950–53: Britain fights under the UN flag in the Korean War against Communist forces from North Korea and China.\n* 1951: Britain strenuously opposes use of nuclear weapons in Korea as discussed by the US\n* 1951: Egypt renounces the 1936 treaty. Egyptians begin guerrilla attacks against the British Suez Canal base. Low-level warfare between British forces and the Egyptians for next several years.\n* 1951: Abadan Crisis. The government of Mohammad Mosaddegh in Iran nationalises the Anglo-Iranian Oil Company.\n* 1952: In response to Egyptian attacks, British forces storm and take a police station in Ismaïlia. The Ismaïlia incident ignites anti-British rioting all over Egypt.\n* 1953: American and British intelligence agencies support coup in Iran.\n* 1954: Prime Minister Churchill refuses a French request to intervene in Vietnam.\n* 1954: Treaty signed with Egypt ending the British Suez Canal base.\n* 1955: Geneva summit attended by Prime Minister Anthony Eden. Last time that a British Prime Minister attended a summit of the super-powers.\n* 1955–63: Yemen emerges as a trouble spot in an old-rich region where the Soviets sponsor a revolt. Civil war erupts in 1962 as Britain tries to protect its colony in Aden.\n* 1955: Baghdad Pact signed. Alliance intended to maintain British influence in the Near East.\n* 1956: In the Suez Crisis Egypt nationalised the Suez Canal, a vital waterway carrying most of Europe's oil from the Middle East. Britain and France, in league with Israel, invaded to seize the canal and overthrow President Nasser. The United States strenuously objected, using heavy diplomatic and financial pressure to force the invaders to withdraw. British policy had four goals: to control the Suez Canal; ensure the flow of oil; remove Nasser; and keep the Soviets out of the Middle East. It failed on all four.\n* 1958–60: As the anti-nuclear movement gains momentum, Britain, the US and the USSR suspend nuclear tests and hold test ban talks in Geneva. However Prime Minister Harold Macmillan decides not to criticise French nuclear tests in 1960. His goals were to gain French support for Britain's joining the European Economic Community, and also French backing for a four-power summit to promote détente.\n* 1958: Anglo-American nuclear treaty establishes basis for co-operation on nuclear weapons development.\n* 1958: Britain sends troops to Jordan to restore order following riots against pro-British King Hussein.\n* 1959–60: Zürich and London Agreement between Britain, Greece and Turkey grants independence to Cyprus.\n* 1960: Prime Minister Harold Macmillan gives \"wind of change\" speech in South Africa. It signals an intention to soon grant independence to the remaining colonies in Asia, the Caribbean and Africa.\n* 1961: Britain sends troops to Kuwait following threats by Iraqi leader Abd al-Karim Qasim that he will invade Kuwait. Iraq is deterred from invading.\n* 1962–66: Indonesian confrontation. Britain fights undeclared war against Indonesia in defence of Malaysia.\n* 1968: Britain announces withdrawal of military forces \"East of Suez\".\n* 1971: In a reversal of the withdrawal of military forces \"east of Suez\", Britain signs the Five Power Defence Arrangements with Australia, New Zealand, Malaysia and Singapore. The alliance is intended to protect Singapore and Malaysia from Indonesia.\n* 1972: Ugandan dictator Idi Amin expels the so-called \"Asians\", Ugandans of South Asian background, most of whom hold British pass-ports and come to Britain.\n* 1973: Britain joins European Community after France blocked its first application in 1961.\n* 1974: Turkey invades Cyprus. Britain is obliged to defend Cyprus under 1960 treaty, but chooses not to.\n* 1976: Britain needs bail-out by the IMF to avoid defaulting on debts.\n* 1979: Strongly protests Soviet invasion of Afghanistan\n* 1980: Death of a Princess airs in Britain. Saudi Arabia breaks relations with Britain over the airing of the film, which it is claimed was insulting towards the House of Saud. Relations restored later that year.\n* 1982: Victory in War with Argentina over Falkland Islands\n* 1984: Murder of Yvonne Fletcher. British policewoman killed by Libyan diplomat. Britain breaks relations with Libya.\n* 1984: Thatcher wins rebate from European Union.\n* 1984: Signs treaty with China to return Hong Kong in 1997.\n* 1986: Hindawi affair. Britain breaks diplomatic relations with Syria after it emerges that Syria was involved in an attempt to bomb El Air flight out of London.\n* 1989: Ruhollah Khomeini issues a fatwa sentencing British author Salman Rushdie to death. Britain breaks diplomatic relations with Iran.\nSince 1990\n* 1989: Collapse of Communist control in Eastern Europe\n* 1990: Thatcher sends troops to Middle East following Iraqi invasion of Kuwait.\n* 1990: Two plus four treaty restores full sovereignty to Germany and ends British occupation rights that had existed since 1945.\n* 1991: Britain fights in Gulf War against Iraq.\n* 1991: Cold War ends as Communism in USSR ends and the USSR is broken up\n* 1992: Black Wednesday. Britain forced out of the European Exchange Rate Mechanism.\n* 1994: Relations restored with Iran.\n* 1997–2007: Prime Minister Tony Blair built his foreign policy on two traditional principles (close ties with US and EU) and a new activist philosophy of 'interventionism'. and the 2003 Iraq War.}}\n* 2001: Britain joins war on terror.\n* 2001–14: British combat forces with NATO in Afghanistan; a few hundred troops remain to provide training until 2016.\n* 2016: P5+1 and EU implement a deal with Iran intended to prevent the country gaining access to nuclear weapons.\n* 2016: The United Kingdom votes for \"Brexit\" to leave the European Union\n* 2016: David Cameron resigns as Prime Minister following his defeat in the Brexit referendum. He was succeeded by Conservative Theresa May.\n* 2019: Britain impounds an Iranian oil tanker in Gibraltar. In retaliation Iran seizes two British oil tankers.\n* 2020: The United Kingdom leaves the European Union after 47 years of membership to the bloc.\n* 2021: The United Kingdom co-founds AUKUS with Australia and the United States.\n* 2022: The United Kingdom signs defence pacts with Finland and Sweden in response to the Russian invasion of Ukraine.\n*2022: The United Kingdom and Mauritius enter sovereignty negotiations over the Chagos archipelago.\n*2023: Japan and the UK sign a Reciprocal Access Agreement allowing each other to deploy troops in each other's countries.\nProminent diplomats\nSee the full list at Secretary of State for Foreign and Commonwealth Affairs.\n* Earl of Clarendon (1800–70), foreign secretary (1865–66, 1868–1870).\n* 1st Earl Granville (1773–1846), known as Viscount Granville from 1815 to 1833, and as Earl Granville from 1833 to 1836; diplomat.\n* 2nd Earl Granville (1815–1891), Liberal statesman and diplomat; known for his pacific stewardship of Britain's external relations, 1870–74 and 1880–85, in co-operation with Prime Minister Gladstone.\n* Lord Palmerston (1784–1865), Whig/Liberal foreign minister or prime minister (1830–1865 with interruptions).\n* Lord Salisbury (1830–1903), Conservative foreign minister and/or prime minister (1878–1902 with interruptions).\n* Joseph Chamberlain, (1836–1914), Liberal Unionist Secretary of State for the Colonies (1895–1903).\nSee also\n* History of the foreign relations of the United Kingdom\n* American Revolution\n* Anglophobia\n* British Empire\n** Historiography of the British Empire\n* British military history\n** List of wars involving England, before 1707\n** List of wars involving Great Britain\n* English colonial empire\n* History of England\n* History of the Royal Navy\n* History of the United Kingdom, since 1707\n* International relations 1648-1814\n* International relations of the Great Powers (1814–1919)\n* Diplomatic history of World War I\n* International relations (1919–1939)\n* Diplomatic history of World War II\n* Cold War\n* Foreign relations of the United Kingdom\n** Belgium–United Kingdom relations\n** Canada–United Kingdom relations\n** China–United Kingdom relations\n** Denmark–United Kingdom relations\n** Egypt–United Kingdom relations\n** France–United Kingdom relations\n** Germany–United Kingdom relations\n** Greece–United Kingdom relations\n** Indonesia–United Kingdom relations\n** Iran–United Kingdom relations\n** Israel–United Kingdom relations\n** Italy–United Kingdom relations\n** Japan–United Kingdom relations\n** Latin America–United Kingdom relations\n*** Argentina–United Kingdom relations\n*** Brazil–United Kingdom relations\n*** Cuba–United Kingdom relations\n*** Mexico–United Kingdom relations\n** Netherlands–United Kingdom relations\n** Poland–United Kingdom relations\n** Portugal–United Kingdom relations\n** Serbia–United Kingdom relations\n** Turkey–United Kingdom relations\n** United Kingdom–United States relations\n** United Kingdom and the United Nations\nNotes\nReferences\nBibliography\nEuropean diplomacy\n* Albrecht-Carrié, René. A Diplomatic History of Europe Since the Congress of Vienna (1958), 736pp, basic introduction 1815–1955\n* Black, Jeremy.  European International Relations, 1648–1815 (2002)\n* Kennedy, Paul. The Rise and Fall of the Great Powers: Economic Change and Military Conflict from 1500 to 2000 (1989), very wide-ranging, with much on economic power\n* Langer, William. An Encyclopedia of World History (5th ed. 1973), very detailed outline\n* Langer, William L.  European Alliances and Alignments, 1871–1890 (2nd ed. 1950); advanced analysis with extensive coverage of British diplomacy\n* Langer, William L.  The Diplomacy of Imperialism 1890–1902 (2 vol, 1935); advanced analysis with extensive coverage of British diplomacy\n*  Macmillan, Margaret. The War That Ended Peace: The Road to 1914 (2013) covers origins of First World War 1890s to 1914; see esp. ch 2, 5, 6, 7\n* Mckay, Derek and H.M. Scott. The Rise of the Great Powers 1648: 1815 (1983)\n* Mowat, R. B. A History of European Diplomacy 1815–1914 (1922), basic introduction; [https://archive.org/details/cu31924014618643 online free]\n*  Schroeder, Paul W. The Transformation of European Politics 1763–1848 (1996); advanced analysis with extensive coverage of British diplomacy\n* Steiner, Zara. The Lights that Failed: European International History 1919–1933 (2007)\n* Steiner, Zara. The Triumph of the Dark: European International History 1933–1939 (2011)\n* Taylor, A.J.P.  The Struggle for Mastery in Europe: 1848–1918 (1954), advanced analysis with extensive coverage of British diplomacy\nBritish diplomacy\n* Black, Jeremy. A military history of Britain: from 1775 to the present (2008)\n* Cannon, John, ed. The Oxford Companion to British History (2003)\n* Johnson, Douglas, et al.  Britain and France: Ten Centuries (1980)\n* Mulligan, William, and Brendan Simms, eds. The Primacy of Foreign Policy in British History, 1660–2000(Palgrave Macmillan; 2011) 345 pages\n*  timeline pp xix to xxxi\n* Otte, T.G. The Makers of British Foreign Policy: From Pitt to Thatcher (2002)\nTo 1814\n* Beem, Charles.  The Foreign Relations of Elizabeth I (2011)\n* Black, Jeremy.  A System of Ambition?: British Foreign Policy 1660–1793 (1991)\n* Black, Jeremy. America or Europe? British Foreign Policy, 1739–63 (1998) [https://archive.today/20130104123338/http://www.questia.com/PM.qst?a=o&d=103389992 online edition]\n* Black, Jeremy, ed.  Knights Errant and True Englishmen: British Foreign Policy, 1660–1800 (2003) [https://web.archive.org/web/20100420055859/http://www.questia.com/PM.qst?a=o online edition]\n* Dickinson, H. T., ed. Britain and the French Revolution, 1789–1815 (1989).\n* Doran, Susan. England and Europe 1485–1603 (2nd ed 1996). [https://books.google.com/books?hl=en&lr=lang_en|lang_fr&id=_ttcAgAAQBAJ&oi excerpt]\n* Feiling, Keith.  British Foreign Policy, 1660–1672 (1930) [https://web.archive.org/web/20160304042850/https://www.questia.com/library/3406867/british-foreign-policy-1660-1672 online]\n* Hammer, Paul E.J. ''Elizabeth's wars: war, government and society in Tudor England, 1544–1604 (2003).\n* Horn, David Bayne. Great Britain and Europe in the eighteenth century (1967), Covers relations with France, the Dutch, Austria, Prussia, lesser states of Germany, Russia, Poland, Scandinavia, Spain, Portugal, Barbary states, Switzerland, Italian states, Turkey\n* Howat, G.M.D. Stuart and Cromwellian foreign policy (1974).\n* Jones, J. R. Britain and the World, 1649–1815'' (1980)\n* Lorimer, Joyce. \"The failure of the English Guiana ventures 1595–1667 and James I's foreign policy.\" The Journal of Imperial and Commonwealth History 21.1 (1993): 1–30.\n* Morrill, John, ed. The Oxford Illustrated History of Tudor and Stuart Britain (2000), pp 397–432.\n* Murdoch, Steve. Britain, Denmark-Norway and the House of Stuart, 1603–1660: A Diplomatic and Military Analysis (Tuckwell Press Ltd, 2000).\n* Ward A.W., ed. The Cambridge History of British Foreign Policy 1783–1919 Vol I 1789–1815 (1922) [https://archive.org/download/in.ernet.dli.2015.20686/2015.20686.The-Cambridge-History-Of-British-Foreign-Pocily-1783---1919-Vol-i-1939_text.pdf  v1 online]\n* Wernham, R.B. Before the Armada: the Growth of English Foreign Policy, 1485–1588 (1966)\n1815–1965\n* Anderson, Frank Maloy, and Amos Shartle Hershey, eds. Handbook for the Diplomatic History of Europe, Asia, and Africa, 1870–1914 (1918) [https://archive.org/details/handbookfordipl01hersgoog online]\n* Bartlett, Christopher John. Defence and diplomacy: Britain and the Great Powers, 1815–1914 (Manchester UP, 1993).\n* Bartlett, C. J. British Foreign Policy in the Twentieth Century (1989)\n* Bourne, Kenneth. The foreign policy of Victorian England, 1830–1902 (Oxford UP, 1970.) pp 195–504 are  \"Selected documents\"\n* Bright, J. Franck. A History of England. Period 4: Growth of Democracy: Victoria 1837–1880 (1893) [https://books.google.com/books?id=9CJAAQAAMAAJ  online] 608pp; highly detailed diplomatic narrative\n* Bright, J. Franck. A History of England: Period V. Imperial Reaction Victoria 1880–1901 (vol 5, 1904); detailed diplomatic narrative; 295pp; [https://books.google.com/books?id=mocPAAAAYAAJ&pg=PP15 online]; also  [http://ebook.lib.hku.hk/CADAL/B31388875V5/   another copy]\n* Brown, Peter. Palmerston: A Biography (2011)\n* Cain, P. J. and A. G. Hopkins. British Imperialism: Innovation and Expansion 1688–1914 (2nd ed. 1993)\n* Dilks, David. ''Retreat from Power: 1906–39 v. 1: Studies in Britain's Foreign Policy of the Twentieth Century (1981); Retreat from Power: After 1939 v. 2 (1981)\n*  Dimbleby, David, and David Reynolds. An Ocean Apart: The Relationship Between Britain and America in the Twentieth Century (1988)\n* Dixon, Peter. Canning: Politician and Statesman (1976).\n* Doerr, Paul W. British Foreign Policy, 1919–1939 (Manchester UP, 1998), university-level textbook.\n* Ensor, R. C. K.  England, 1870–1914 (1936) [https://archive.org/details/in.ernet.dli.2015.49856 online]\n* Farmer Alan. British Foreign and Imperial Affairs 1919–39 (2000), textbook\n* Feiling, Keith. The Life of Neville Chamberlain (1947) [https://archive.org/details/in.ernet.dli.2015.176384 online]\n* Gilmour, David. Curzon: Imperial Statesman (1994) Curzon was a top level official 1895–1923.\n* Goldstein and Brian McKercher, eds. Power and Stability: British Foreign Policy, 1865–1965  (2003), essays by scholars\n* Gooch, G.P. Before the war: studies in diplomacy (vol 1 1936) pp 1–86 [https://archive.org/details/in.ernet.dli.2015.2275 online] on Landsdowne\n* Goodlad, Graham D. British Foreign and Imperial Policy 1865–1919 (1999).\n* Hayes, Paul. Modern British Foreign Policy: The 19th Century 1814–80 (1975)\n* Holland, Robert. The pursuit of greatness: Britain and the world role, 1900–1970 (1991)\n* Johnson, Gaynor, ed. The Foreign Office and British Diplomacy in the Twentieth Century (2005)\n* Kennedy, Paul. The Realities Behind Diplomacy: Background Influences on British External Policy, 1865–1980 (1981).  416 pp.\n* Kennedy, Paul. \"The Tradition of Appeasement in British Foreign Policy 1865-1939\" British Journal of International Studies (1976) 2#3 pp.&nbsp;195–215 [http://www.jstor.com/stable/20096775 online]\n* Laszlo, Peter, and Martyn Rady, British-Hungarian Relations Since 1848 (2004), 366pp; include Austro-Hungarian Empire\n* Lowe, C.J.  The reluctant imperialists: British foreign policy, 1878–1902 (1969) 257pp plus 150 pp of documents\n* Lowe, C.J. and Michael L. Dockrill.  Mirage of Power: 1902–14 v. 1: British Foreign Policy (1972); Mirage of Power: 1914–22 v. 2: British Foreign Policy (1972); Mirage of Power: The Documents v. 3: British Foreign Policy (1972); vol 1–2 are text, vol 3 = primary sources\n* Lowe, John. Britain and Foreign Affairs 1815–1885: Europe and Overseas (1998)\n* Mahajan, Sneh. British Foreign Policy, 1874–1914: The Role of India (2002)\n* Matzke, Rebecca Berens. . Deterrence through Strength: British Naval Power and Foreign Policy under Pax Britannica (2011)\n* Medlicott, W.N. British Foreign Policy Since Versailles, 1919–63 (1968), basic survey [https://archive.org/details/in.ernet.dli.2015.84320 online]\n* Murray, Gilbert. The Foreign Policy of Sir Edward Grey, 1906–1915 (1915) 128pp, by a top aide\n* Neilson, Keith. Britain and the Last Tsar: British Policy and Russia, 1894–1917 (1995)\n* Otte, Thomas G. The Foreign Office Mind: The Making of British Foreign Policy, 1865–1914'' (2011)\n* Penson, Lillian M. \"The Principles and Methods of Lord Salisbury's Foreign Policy.\" Cambridge Historical Journal 5#1 (1935): 87–106. [https://www.jstor.org/stable/3020834 online].\n* Pribram, A.F.  England and the International Policy of the European Great Powers, 1871–1914 (1931)\n* Reynolds, David.  Britannia Overruled: British Policy and World Power in the Twentieth Century (2nd ed. 2000), major survey of British foreign policy\n* Reynolds, David.  From World War to Cold War: Churchill, Roosevelt, and the International History of the 1940s (2006)\n* Sanders, David. Losing an Empire, Finding a Role: British Foreign Policy Since 1945 (1990) broad coverage of all topics in British foreign policy\n*  Seton-Watson, R. W. Britain in Europe, 1789–1914, a survey of foreign policy (1937) useful overview [https://archive.org/details/in.ernet.dli.2015.190051 online]\n* Smith, Tony. The Pattern of Imperialism: The United States, Great Britain and the Late-Industrializing World Since 1815 (1981).\n* Somervell, D.C. The Reign of King George V, (1936) 550pp; covers 1910–35; [https://archive.org/details/in.ernet.dli.2015.176466 online free]\n*\n* Vickers, Rhiannon. ''The Evolution of Labour's Foreign Policy, 1900–51 (2003)\n* Ward A.W., ed. The Cambridge History of British Foreign Policy 1783–1919 Vol II 1815–1866 (1922); old highly detailed classic; [https://archive.org/details/in.ernet.dli.2015.66600 v2 online]\n** Ward A.W., ed. The Cambridge History of British Foreign Policy 1783–1919 Vol III 1866–1919 (1923) [https://archive.org/details/in.ernet.dli.2015.66601  v3 online]\n* Webster, Charles. The Foreign Policy of Palmerston (2v. 1951)\n* Weigall, David. Britain and the World, 1815–1986: A Dictionary of International relations (1989)\n* Williams, Chris, ed. A Companion to 19th-Century Britain (2006). Chapters 1 to 4, pp 15–92; historiographical essays.\n* Woodward, E. L. The Age of Reform: 1815–1870 (1954) comprehensive survey [https://archive.org/details/in.ernet.dli.2015.179823 online]\nRecent\n* Blair, Tony. A Journey: My Political Life (2010)\n* Campbell, John. Margaret Thatcher; Volume Two: The Iron Lady (Pimlico, 2003)\n* Casey, Terrence. The Blair Legacy: Politics, Policy, Governance, and Foreign Affairs (2009)\n* Daddow, Oliver, and Jamie Gaskarth, eds. British foreign policy: the New Labour years (Palgrave, 2011)\n* Dickie, John. The New Mandarins: How British Foreign Policy Works (2004)\n* Dumbrell, John. A special relationship: Anglo-American relations from the cold war to Iraq (2006)\n* Finlan, Alastair. Contemporary Military Strategy and the Global War on Terror: US and UK Armed Forces in Afghanistan and Iraq 2001–2012 (2014)\n*\n* Lane, Ann. Strategy, Diplomacy and UK Foreign Policy (Palgrave Macmillan, 2010)\n* Lunn, Jon, Vaughne Miller, Ben Smith. \"British foreign policy since 1997 – Commons Library Research Paper RP08/56\" (UK House of Commons, 2008) 123pp [http://www.parliament.uk/briefing-papers/RP08-56.pdf online]\n* Northedge, F.S. Descent From Power British Foreign Policy 1945–1973 (1974) [https://archive.org/details/in.ernet.dli.2015.117738  online]\n* Reynolds, David.  Britannia Overruled: British Policy and World Power in the Twentieth Century (2nd ed. 2000), major survey of British foreign policy to 1999\n* Williams, Paul. British Foreign Policy under New Labour (2005)\nPrimary sources\n* Bourne, Kenneth. The foreign policy of Victorian England, 1830–1902 (Oxford UP, 1970.) pp 195–504 are  \"Selected documents\". [https://archive.org/details/foreignpolicyofv0000bour online]\n* Gooch, G.P. and Harold Temperley, eds. British documents on the origins of the war, 1898–1914 (11 vol. ) [https://archive.org/search.php?query=creator%3A%28gooch%20%20temperley%29 online]\n** v. i The end of British isolation – v.2. The Anglo-Japanese Alliance and the Franco-British Entente – v.3. The testing of the Entente, 1904-6 – v.4. The Anglo-Russian rapprochement, 1903-7 – v.5. The Near East, 1903-9 – v.6. Anglo-German tension. Armaments and negotiation, 1907–12 – v.7. The Agadir crisis – v.8. Arbitration, neutrality and security – v.9. The Balkan wars, pt.1–2 – v.10, pt.1. The Near and Middle East on the eve of war. pt.2. The last years of peace – v.11. The outbreak of war V.3. The testing of the Entente, 1904-6 – v.4. The Anglo-Russian rapprochement, 1903-7 – v.5. The Near East, 1903-9 – v.6. Anglo-German tension. Armaments and negotiation, 1907–12 – v.7. The Agadir crisis – v.8. Arbitration, neutrality and security – v.9. The Balkan wars, pt.1–2 – v.10, pt.1. The Near and Middle East on the eve of war. pt.2. The last years of peace –   v.11. The outbreak of war.\n* Joll, James, ed. Britain and Europe 1793–1940 (1967); 390pp of documents\n* Jones, Edgar Rees, ed. Selected speeches on British foreign policy, 1738–1914 (1914). [https://www.amazon.com/Selected-Speeches-British-Foreign-1738-1914-ebook/dp/B008400H7O/  online free]\n* Lowe, C.J. The reluctant imperialists: British foreign policy, 1878–1902 (1969) 257pp plus 150 pp of documents\n* Lowe, C.J. and Michael L. Dockrill, eds. Mirage of Power: The Documents v. 3: British Foreign Policy (1972); vol 3 = primary sources 1902–1922\n* Scott, James Brown, ed., Diplomatic Documents Relating to the Outbreak of the European War (1916) [https://archive.org/details/diplomaticdocum00scotgoog  online]\n* Temperley, Harold, and Lillian M. Penson, eds. Foundations of British Foreign Policy from Pitt (1792) to Salisbury (1902); Or, Documents, Old and New (1938), 612pp [https://web.archive.org/web/20160304062935/https://www.questia.com/library/91479755/foundations-of-british-foreign-policy-from-pitt-1792 online]\n* Wiener, Joel H. ed. Great Britain: Foreign Policy and the Span of Empire, 1689–1971: A Documentary History'' (4 vol 1972) [https://web.archive.org/web/20130608114412/http://www.questia.com/library/6963234/great-britain-foreign-policy-and-the-span-of-empire vol 1 online]; [https://web.archive.org/web/20131225101158/http://www.questia.com/library/120074154/great-britain-foreign-policy-and-the-span-of-empire vol 2 online]; [https://www.questia.com/library/120073878/great-britain-foreign-policy-and-the-span-of-empire vol 3]; [https://web.archive.org/web/20130201050348/http://www.questia.com/library/120073810/great-britain-foreign-policy-and-the-span-of-empire vol 4] 4 vol. 3400 pages"
    }
  ]
}