{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of online advertising\n\nThis page is a timeline of online advertising. Major launches, milestones and other major events are included.\nOverview\n{| class=\"wikitable\"\n!Decade\n!Description\n|-\n|Late 1970s–\n1980s\n|Much of online advertising during this time period is done through Email, in the form of spamming. Such activities have continued to this day, but became much more common after the ban against the commercial use of the internet was lifted in 1991.\n|-\n|1990s–\n2000s\n|With people now having their own websites, banner ads are used as a source of income to pay for these websites and as side money. Companies like Prodigy, Global Network Navigator (GNN), and HotWired are pioneers in the business of online advertising.\n|-\n|2000s–\n2010s\n|As more companies capable of providing advertising services emerge, several major successful companies such as Google, Facebook, Yahoo!, Microsoft, and AOL begin to dominate the market.\n|}\nTimeline\n{| class=\"wikitable sortable\"\n!Year\n!Month and date\n!Event type\n!Advertisement type\n!Description\n|-\n|1978\n|May 3\n|Milestone\n|Email marketing\n|The first instance of email spam is sent, the purpose of which is advertising.\n|-\n|1980\n|\n|Launch\n|N/A\n|Usenet, a popular discussion forum, launches, and is occasionally overwhelmed with advertising spam posts.\n|-\n|1984\n|\n|Launch\n|Banner advertising\n|Prodigy launches, offering one of the first online advertising services; although these ads are always in the same spot on the screen, and are non-clickable.\n|-\n|1991\n|March\n|Milestone\n|N/A\n|The ban on commercial use on the NSFNET is lifted by the National Science Foundation (NSF).\n|-\n|1992\n|July\n|Milestone\n|Sponsorship\n|The online newsletter TidBITS launches a sponsorship program in which companies paid to provide information via an email auto-responder to pre-Web users.\n|-\n|1993\n|\n|Launch\n|Banner advertising\n|GNN, one of the first web publication and web advertising services, is launched by O'Reilly Media.\n|-\n|1994\n|\n|Milestone\n|Banner advertising\n|The first ever clickable advertisement is sold to a Silicon Valley law firm by GNN.\n|-\n|1994\n|\n|Launch\n|N/A\n|HotWired, the first commercial web magazine, launches.\n|-\n|1994\n|October 27\n|Milestone\n|Banner advertising\n|The first ever banner is sold to AT&T, and is visible on the first issue of HotWired.\n|-\n|1995\n|May\n|Acquisition\n|Banner advertising\n|GNN is acquired by AOL for $11 million.\n|-\n|1996\n|\n|Launch\n|Ad serving\n|DoubleClick, an online advertising company, launches.\n|-\n|1996\n|July\n|Launch, Milestone\n|Search advertising\n|Yahoo! launches the very first search ads in their search engine.\n|-\n|1997\n|\n|Invention\n|Pop-up ads\n|Pop-up ads are invented by Ethan Zuckerman, and considered to be a more aggressive and disliked advertising strategy.\n|-\n|1998\n|September 4\n|Launch\n|N/A\n|Google, an online search engine, launches.\n|-\n|1998\n|\n|Invention, Launch, Milestone\n|Ad exchange\n|OpenX, one of the first ad exchanges, launches as an open source project.\n|-\n|1998\n|\n|Launch\n|Search advertising\n|GoTo (now Yahoo! Search Marketing), a search engine which offers search advertising, launches.\n|-\n|1999\n|\n|Defunction\n|N/A\n|HotWired is shut down after its domain is re-purposed by Lycos.\n|-\n|2000\n|October 23\n|Launch\n|Search advertising\n|Google launches the AdWords service, which allows for advertising based on a user's browsing habits and their search keywords.\n|-\n|2002\n|\n|Invention, milestone\n|Pop-up ads\n|With the annoyance brought about by pop-up ads, many web browsers such as Firefox, Netscape, and Opera begin to roll out features to block these ads.\n|-\n|2003\n|October 7\n|Acquisition\n|Search advertising\n|Overture (formerly GoTo) is acquired by Yahoo! to enrich their search engine.\n|-\n|2004\n|February\n|Launch\n|Social media advertising\n|Facebook, the most popular social media network, launches.\n|-\n|2005\n|February 14\n|Launch\n|Banner advertising\n|YouTube, a popular video sharing website, launches.\n|-\n|2005\n|\n|Launch\n|Demand-side platform\n|Criteo, one of the first demand-side platforms, launches.\n|-\n|2006\n|October\n|Acquisition\n|N/A\n|YouTube is acquired by Google for $1.65 billion.\n|-\n|2006\n|\n|Invention, launch, milestone\n|Ad blocking\n|Adblock, an ad-blocking add-on for web browsers, is released.\n|-\n|2006\n|\n|Launch\n|Content discovery platform\n|Outbrain, an advertising company that powers external recirculation widgets, launches.\n|-\n|2006\n|August\n|Launch\n|Native advertising\n|YouTube launches its video advertising platform, which has a giant reach today.\n|-\n|2007\n|\n|Launch\n|Content discovery platform\n|Taboola, an advertising company that powers external recirculation widgets, launches.\n|-\n|2007\n|\n|Launch\n|Behavioral targeting, social media advertising\n|Facebook launches Beacon, an intricate advertising platform that tracks Facebook users' activities on websites outside of Facebook.\n|-\n|2007\n|April 14\n|Acquisition\n|Ad serving\n|Google acquires DoubleClick, an advertising platform, for $3.1 billion.\n|-\n|2007\n|May 18\n|Acquisition\n|Ad serving\n|Microsoft acquires AQuantive, an advertising platform, for $6.5 billion.\n|-\n|2007\n|\n|Launch\n|Demand-side platform\n|MediaMath, a demand-side platform, launches.\n|-\n|2008\n|March\n|Launch\n|Demand-side platform\n|Rocket Fuel Inc., a demand-side platform, launches.\n|-\n|2008\n|December\n|Invention/patent\n|Viewable impression\n|RealVu Inc.invents viewable impression\n|-\n|2008\n|\n|Launch\n|Ad blocking\n|Rick Petnel creates Easylist, one of the most popular filter lists available for ad-blocking web browser add-ons. The filter list Easylist Privacy is also available, and focuses on the blocking of web elements that may invade a user's privacy.\n|-\n|2009\n|September 18\n|Launch\n|Ad exchange\n|Google launches its own ad exchange platform with DoubleClick.\n|-\n|2009\n|September\n|Launch\n|MRC viewable impression accreditation\n|RealVu introduces the viewable impression invention to the MRC\n|-\n|2010\n|February 22\n|Launch\n|Ad serving\n|Google launches DoubleClick for Publishers (DFP), an advertising software as a service.\n|-\n|2010\n|April 12\n|Launch\n|Social media advertising\n|Twitter launches Promoted Tweets, which allows advertisers to pay for tweets to be shown in a user's feed.\n|-\n|2013\n|April 26\n|Acquisition\n|Ad serving\n|Facebook acquires Atlas Solutions from Microsoft for $100 million, in order to enrich its already bustling advertising platform.\n|-\n|2013\n|October\n|Launch\n|Social media advertising\n|Instagram, a popular image sharing platform, releases its feature of having sponsored posts appear on user's feeds.\n|-\n|2014\n|March 24\n|Launch\n|Social media advertising\n|Pinterest, a creative image sharing platform, launches its Promoted Pins service which allows for additional advertising in a user's feed.\n|-\n|2014\n|June 23\n|Launch\n|Ad blocking\n|UBlock Origin, an ad-blocking extension for web browsers, launches.\n|-\n|2014\n|November 14\n|Launch*\n|Ad serving\n|Facebook re-launches Atlas.\n|-\n|2016\n|June 14\n|Launch\n|Social media advertising\n|Snapchat, a popular messaging app, begins to include advertisements between user's \"stories\".\n|-\n|2016\n|August\n|Major event\n|Ad blocking\n|Facebook states that they will start blocking the use of ad blocking extensions, specifically Adblock Plus and Adblock. In response to this, these ad-blockers begin to block Facebook's blocking in a back-and-forth \"war\".\n|}\n(*) Such launches are not initial launches, but rather re-launches.\nSee also\n* Timeline of e-commerce\n* Online advertising\nReferences"
    }
  ]
}