{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of DC Comics (1930s)\n\nNational Comics Publications and All-American Publications, two precursors to DC Comics, were formed publishing American comic books such as superhero comics starting in the 1930s. Primary Comic book anthology titles created by the company  was More Fun Comics, Adventure Comics, Detective Comics, Action Comics, All-American Comics and Superman. Other companies like Quality Comics and Fawcett Comics  would  later be merged into DC.  Quality started by introducing comic books like Feature Comics and Smash Comics.\nDuring the period, National launched popular superhero / featured characters like Doctor Occult, Slam Bradley, Superman, Zatara, Tex Thompson, Crimson Avenger, Batman, Red Tornado and Sandman since their first appearance. Quality Comics also debuted Doll Man while Fox Feature Syndicate includes the introduction of the Blue Beetle in Mystery Men Comics.\nSuperman stories debuted major supporting characters of Superman, such as Lois Lane, Jimmy Olsen, Jor-El and Lara, Jonathan and Martha Kent along with one of the earliest supervillains  / Superman rogue, Ultra-Humanite. Also major fictional elements introduced in the Superman comics include the planet Krypton and the Kryptonian species, the city Metropolis and the newspaper tabloid, Daily Planet. Batman stories debuted major supporting characters of Batman such as James Gordon, Thomas and Martha Wayne along with Batman rogues like Joe Chill. Also major fictional elements introduced in the Batman comics include the fictional police department led by Gordon, the costume known as the Batsuit with weapons known as Batman's utility belt and the Batarang, an original version of two vehicles known as the Batmobile and the Batplane and the building called Wayne Manor.\nThe first media adaptions of DC were comic strips of Superman.\n1934\n*Autumn - National Comics Publications came to be as a precursor to DC Comics.\n1935\n*February - New Fun Comics, later retitled More Fun Comics series debuts.\n*October - The character Doctor Occult is debuted by Jerry Siegel and Joe Shuster.\n*December - New Comics, then New Adventure Comics and later Adventure Comics series debuts.\n1936\n* The character Scribbly was debuted by Sheldon Mayer.\n1937\n*March - Detective Comics series debuts. Slam Bradley was debuted by Malcom-Wheeler Nicholson, Jerry Siegel and Joe Shuster.\n*October - Quality Comics (which DC later obtains) comes to be. Feature Funnies, later retitled Feature Comics series was debuted by Quality Comics.\n1938\n* All-American Publications came to be.\n*June - Action Comics debuts with its historical first issue. The characters Superman, Clark Kent and Lois Lane are debuted by Jerry Siegel and Joe Shuster. Superman's origin, the planet Krypton and the Kryptonian species along with the Superman logo, the Daily Star and its editor George Taylor along with one of the first famous relationships in comics is debuted. The character Zatara is debuted by Fred Gaudineer. The  character Tex Thompson is debuted by Ken Fitch and Bernard Baily.\n*October - The characters Crimson Avenger was debuted by Jim Chambers.\n*November - An office boy later revealed to be Jimmy Olsen is debuted by Jerry Siegel and Joe Shuster.\n1939\n* January - A Superman comic strip series was published. The characters Jor-El and Lara were debuted by Jerry Siegel and Joe Shuster.\n* April - All-American Comics series was debuted. The character Hop Harrigan was debuted by Jon Plummer. The character Sandman is created by Gardner Fox and Bert Christman.\n* May - The comic book Detective Comics #27 debuted. The characters Batman and James Gordon were debuted by Bob Kane and Bill Finger. Other iconic debuts include the Batsuit and a version of the Batmobile.\n*June- The character Ma Hunkel (Who later becomes Red Tornado) is debuted by Sheldon Mayer. Wayne Manor was debuted by Bob Kane.\n* June - The character Ultra-Humanite is debuted by Jerry Siegel and Joe Shuster.\n* Summer - Superman'' series was released. The characters Jonathan and Martha Kent are introduced by Jerry Siegel and Joe Shuster.\n* July - Batman's utility belt was debuted by Gardner Fox.\n*August - The series Mystery Men Comics was debuted by Fox Feature Syndicate. The character Blue Beetle was introduced by Charles Nicholas Wojtkoski originally by Fox Feature Syndicate. Smash Comics title by Quality Comics debuts.\n* September - Metropolis was first named by Jerry Siegel and Joe Shuster. Julie Madison, the Batarang, the Batgyro was debuted by Gardner Fox, Bob Kane and Sheldon Moldoff.\n* November - Batman's origin introduces Batman's parents (Thomas Wayne and Martha Wayne) and their killer by Bob Kane, Bill Finger, Jerry Robinson and Gardner Fox. The Daily Planet was debuted by Jerry Siegel and Joe Shuster replacing the Daily Star.\n*December -The first Doll Man would debut by Will Eisner.\n*Fawcett Comics would be formed around sometime during 1939. Which would then be a rival of DC until later acquired by DC.\nSee also\n* Golden Age of Comic Books\nReferences"
    }
  ]
}