{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Galician history__disambig_1\n\nThe following is a history of Galicia, a subsection of the Iberian Peninsula.\nPaleolithic\n* 200th millennium BC – In the Paleolithic period the Neanderthal Man enters the Iberian Peninsula.\n* 70th millennium BC\n** Neanderthal Mousterian culture.\n** Beginning of the Last Ice Age.\n* 40th millennium BC\n** Beginning of the Upper Paleolithic.\n** The first large settlement of Europe by modern humans, nomadic hunter-gatherers coming from the steppes of Central Asia, characterized by the M173 mutation in the Y chromosome, defining them as a haplogroup R population. When the Ice Age reached its maximum extent, these modern humans took refuge in Southern Europe, namely in Iberia, and in the steppes of southern Ukraine and Russian Federation.\n* 30th millennium BC – Modern humans make way into the Iberian Peninsula, coming from southern France. Here, this genetically homogenous population (characterized by the M173 mutation in the Y chromosome), will develop the M343 mutation, giving rise to the R1b haplogroup, still dominant in modern Portuguese and Spanish populations.\n** Extinction of the Neanderthal Man in its last refuge – the west of Iberia\n* 15th millennium BC – Magdalenian cultural period in Europe.\nMesolithic\n* 10th millennium BC\n** The Allerød oscillation occurs, an interstadial deglaciation that weakens the rigorous conditions of the Ice Age.\n** End of Upper Palaeolithic and beginning of the Mesolithic period.\n** The populations sheltered in Iberia, descendants of the Cro-Magnon, given the deglaciation, migrate and recolonize all of Western Europe, thus spreading the R1b haplogroup populations (still dominant, in variant degrees, from Iberia to Scandinavia).\n** Azilian culture in southern France and northern Iberia (to the mouth of the Douro river).\nNeolithic\n* 5th millennium BC\n** Beginning of the Neolithic in the Iberian peninsula.\n** Autochthonous development of agriculture in Iberia.\n** Beginning of the Megalithic European culture, spreading to most of Europe\n** The nomadic hunter-gathereres of the R haplogroup (characterized by the M173 mutation in the Y chromosome) that had taken refuge during the Last Ice Age in the steppes of southern Ukraine and Russian Federation (and had developed the M17 mutation, originating the R1a Haplogroup), give rise to the Proto-Indo-European cultures (speakers of the predecessor of languages), such as the Kurgan culture.\n* 4th millennium BC - Inhabitants of the peninsular northwest build boats capable of crossing over ocean and colonize the British Isles. This event could be reflected in the legend of Breogán and his children.\nBronze Age\n* 1st millennium BC\n** First wave of migrations into Iberia, of the Urnfield culture (Oestrimni, speakers of the Proto-Celtic language).\n** Bronze culture (Celtic) in the northwest of Iberia (modern Galicia and northern Portugal), maintaining commercial relations with Brittany and the British Isles. Emergence of the Castro culture in this Iberian area.\nIron Age\n** The poem Ora Maritima, written by Avienius in the 4th century and based on the Massaliote Periplus of the 6th century BC, states that all of western Iberia was once called for the name of its people, the Oestrimini, which were replaced by an invasion of the Saephe or Ophis (meaning Serpent). From then on western Iberia would have been known as Ophiussa (Land of the Serpents). The poem probably translates  the impact of the Second wave of Celtic migrations in the 7th century BC. The poem also describes the various ethnic groups present at that time:\n*** The Saephe or Ophis, today seen as probably Hallstatt culture Celts, in all of western Iberia (modern Portugal) between the Douro and the Sado rivers.\n*** The Cempsi, probably Hallstatt culture Celts, in the Tagus mouth and the south up to the Algarve.\n*** The Cynetes or Cunetes in the extreme south and some cities along the Atlantic coast (such as Olissipo, modern Lisbon), probably autochthonous Iberian (even if strongly or totally celticized over the next centuries).\n*** The Dragani, Celt or Proto-Celt of the first wave, in the mountainous areas of Galicia, northern Portugal, Asturias and Cantabria.\n*** The Lusis, probably a first reference to the Lusitanians, similar to the Dragani (Celt or Proto-Celt of the first wave).\n* 5th century BC\n** Development of a 2nd Castro culture in Galicia and northern Portugal.\n* 4th century BC\n** The Celtic Calaicians or Gallaeci inhabit all the region above the Douro river (modern Galicia and northern Portugal).\nGallaecia province of the Roman Empire\n* 197 BC\n** In a first attempt of a Roman provincial administration in Hispania, Gaius Sempronius Tuditanus and M. Helvius divide the peninsula into Hispania Ulterior and Hispania Citerior (the one actually controlled by Rome). These two provinces were to be ruled by Governors with a mandate of one year.\n** Lusitania, Gallaecia and Asturias are included in the Roman province of Hispania Ulterior.\n* 139 BC\n** The Roman Senate deems Fabius Servilianus' actions unworthy of Rome, and sends Servilius Cipianus to defeat the rebellious tribes of Hispania.\n** In Hispania Ulterior, Servilius Cipianus, with the aid of Marcus Pompilius Lenas' armies, severely defeat the Lusitanians and oblige Viriathus to take refuge north of the Tagus river and surrender hostages, such as his son's father-in-law, Astolpas.\n** Servilius Cipianus armies also attack the Vettones and the Gallaecians.\n* 138 BC\n** First big Roman campaign deep inside present Portuguese territory led by Praetor Decimus Junius Brutus, governor of Hispania Ulterior. Decimus Junius Brutus, having at his back a pacified southern Lusitania (modern Alentejo and Algarve), established headquarters in the Valley of the Tagus (probably in the site of the Castle of Almourol) and had the allied city of Olissipo (modern Lisbon) fortified before advancing north, destroying settlements as he went.\n** The city of Olissipo sends men to fight alongside the Roman legions against the Celtic tribes of the Northwest.\n* 137 BC\n** Praetor Decimus Junius Brutus advances further north, mainly along the coastline, and establishes a fortified position in the area of modern Viseu.\n** The Roman legions cross the Douro river and enter the territory of the Gallaecians.\n** The Roman legions reluctantly cross the Lima (Lethes) river, only after Decimus Junius Brutus crossed alone and called for them, thus proving he had not been caused to lose his memory.\n* 136 BC\n** Roman legions under Praetor Decimus Junius Brutus reach the Minho river, but do not cross it for fear of losing their memories.\n** Decimus Junius Brutus lays siege and conquers the city of Talabriga, thus defeating the Gallaecians. After the military campaigns, the Roman legions departed south and left no garrisons.\n** The Roman Senate grants Praetor Decimus Junius Brutus the title Callaicus for his campaigns in Gallaecia.\n* 105–102 BC - After the Battle of Arausio, the Germanic Teutons and Cimbri plunder through all north Iberia as far as Gallaecia, before moving out and being defeated in the battles of Aquae Sextiae and Vercellae.\n* 96–94 BC - Publius Licinius Crassus, Governor of Hispania Ulterior, leads a military expedition to the Northwest and finds the source mines of tin.\n* 74 BC - Probable expedition to Cale (in Gallaecia, near the modern city of Porto?) promoted by Marcus Perperna Vento.\n* 61 BC\n** Julius Caesar is assigned to serve as the Propraetor governor of Hispania Ulterior.\n** Julius Caesar attacks the Lusitanian areas between the Tagus and the Douro rivers, from his headquarters in Scallabis (modern Santarém).\n** Julius Caesar personally conducts an important naval expedition to the shores of Gallaecia in which he would arrive to Brigantium (currently A Coruña).\n* 60 BC - Julius Caesar wins considerable victories over the Gallaecians and Lusitanians. During one of his victories, his men hailed him as Imperator in the field, which was a vital consideration in being eligible for a triumph back in Rome.\n* 27 BC\n** January 16 - Gaius Julius Caesar Octavianus becomes Roman Emperor as Caesar Augustus. Definitive end of the Roman Republic and establishment of the Roman Empire.\n** The Roman general and politician Marcus Vipsanius Agrippa divides all Hispania into 3 parts, Lusitania, Baetica and Tarraconensis.\n** The emperor Augustus returns to Hispania and makes a new administrative division, creating the province of Hispania Ulterior Lusitania, whose capital was to be Emerita Augusta (currently Mérida). Originally Lusitania included the territories of Asturias and Gallaecia, but these were later ceded to the jurisdiction of Provincia Tarraconensis and the former remained as Provincia Lusitania et Vettones.\n* 28–24 BC\n** Foundation of the Roman cities of Asturica Augusta (Astorga) and Bracara Augusta (Braga), to the north, and, to the south, Emerita Augusta (Mérida) (settled with the emeriti of the 5th and 10th legions).\n* 3rd century\n** Braga becomes an Episcopal Diocese.\n** after 211- The Emperor Caracalla makes a new administrative division which lasts only a short time. He splits Hispania Citerior again into two parts, creating the new provinces Hispania Nova Citerior and Asturiae-Calleciae (the later under governor Cerealis).\n* 238 -  The unified province Tarraconensis or Hispania Citerior is reestablished. Asturias and Gallaecia are again part of it.\nSuevi Kingdom of Gallaecia\n* 409 - Invasion of the NW of the Iberian peninsula (the Roman Gallaecia) by the Germanic Suevi (Quadi and Marcomanni) under king Hermeric. The Suevic Kingdom eventually received official recognition (Foedus) from the Romans for their settlement there in Gallaecia. It was the first kingdom separated from the Roman Empire that minted coins.\n* 411 - A treaty with Western Roman Emperor Flavius Augustus Honorius grants Lusitania to the Alans, Gallaecia to the Suevi and Hasdingi, and Baetica to the Silingi.\n* 415 - Baquiário, priest of Braga, writes his work De fide, where he retracts from Priscillianism heresy.\n* 417 - Balconius becomes bishop of Braga.\n* 419 - The Hasdingi Vandals attack the Suevi, these resist with Roman aid.\n* 428 - The Alans defeat the Suevi and the Romans at the Battle of Mérida.\n* 438 - Hermeric, the first Suevi king of Gallaecia, ratified the peace with the Galaicos people and, tired of fighting, abdicated in favor of his son Rechila.\n* 448 - Suevi king Rechila dies leaving a state in expansion to his son Rechiar who imposed his Catholic faith on the Suevi population.\n* 454 - The Ibero-Roman population ask for the help of King Theodoric II of the Visigoths against Suevi incursions.\n* 456\n** King Theodoric II of the Visigoths defeats the Suevi at the Battle of Orbigo and sacks their capital city Braga.\n** Suevi king Rechiar is executed and some candidates for the throne appear, grouped in two factions, those who follow Frantán and those who follow Aguiulfo (dependent of the Visigoths).  A division marked for the river Minius is noticed, probably a consequence of the two tribes, Quadi and Marcomanni, who constituted the Suevi nation.\n* 457 - Maldras becomes king of all the Suevi.\n* 459 - After the death of King Maldras of the Suevi, a new division appears between Frumar and Remismund.\n* 463 - Remismund unites the Suevi and becomes king.\n* 468\n** The Roman city of Conímbriga, near modern Coimbra, is sacked by the Suevi.\n** Lusídio, Roman governor of Lisbon, delivers the city to the Suevi.\n* 469 - Theodemund becomes King of the Suevi.\n* 470 - King Euric of the Visigoths conquers southern Gallaecia and Lusitania to the Suevi.\n* 501 - Council (Ecumenical Synod) of Braga.\n* 550\n** Karriarico becomes King of the Suevi.\n** Saint Martin of Dumes arrives in Suevish Gallaecia. Born in Pannonia, he was the foremost Iberian scholar of his time. He was given the church of Dume, where he built a monastery.\n* 559 - Theodemar becomes King of the Suevi.\n* 561 - Council (Ecumenical Synod) of Braga. The solemn conversion of the Suevi is proclaimed.\n* 562 - Saint Martin of Dumes becomes Bishop of Braga.\n* 569 - Council (Ecumenical Synod) of Lugo, which established the See of Britonia (Britonensis ecclesia) for Celtic migrants from post-Roman Britain.\n* 570\n** Miro becomes King of the Suevi.\n** King Liuvigild of the Visigoths begins military actions with the explicit purpose of conquering all of Hispania.\n* 572 - Council (Ecumenical Synod) of Braga.\n* 583 - Eboric (also called Eurico) becomes King of the Suevi.\n* 584\n** Andeca becomes King of the Suevi.\n** The Visigothic King Liuvigild invades the Suevic kingdom and finally defeats it.\n* 585 - Andeca, the last king of the Suevi, holds out for a year before surrendering to the Visigothic King Liuvigild. With his surrender, this branch of the Suevi vanished into the Visigothic kingdom.\nGallaecia province inside Visigothic Kingdom\n* 589 - Pantardus becomes bishop of Braga.\n* 633 - Julian becomes bishop of Braga.\n* 653 - Potamius becomes bishop of Braga.\n* 656 - St. Fructuosus of Dumes becomes bishop of Braga.\n* 663 - Council (Ecumenical Synod) of Braga.\n* 675\n** Leodegisius becomes bishop of Braga.\n** Council (Ecumenical Synod) of Braga.\n* 681 - Liuva becomes bishop of Braga.\n* 688 - Faustinus becomes bishop of Braga.\n* 693 - Félix becomes bishop of Braga.\nFélix of Braga was the last bishop of Braga to reside there until 1070, due to the Moorish invasion. His successors established themselves in Lugo (Galicia).\nKingdom of Asturias/Gallaecia\n* 711, March 15 – Islamic Umayyad Moors (mainly Berber with some Arab), faithful to the Emir of Damascus and under the Berber Tariq ibn Ziyad, invade and eventually conquer the Iberian Peninsula (Visigothic King Roderic is killed while opposing the invasion), except for the northernmost part - the Asturias. Resistance to Moorish occupation (Reconquista) starts from this stronghold.\n* 718 - Pelayo establishes the Kingdom of Asturias. This is considered to be the beginning of the Reconquista.\n* 722 -  A powerful Moorish force sent to conquer Asturias once and for all is defeated by king Pelayo at the Battle of Covadonga. Today, this is regarded as the first significant Christian victory of the Reconquista.\n* 737\n** King Pelayo of Asturias dies.\n** Favila, son of Pelayo, becomes King of Asturias.\n* 739\n** Alfonso, son of Peter of Cantabria, duke of Cantabria, and married to Ormesinda, daughter of Pelayo of Asturias, becomes King of Asturias.\n** the Moors are driven out of Galicia by Alfonso I of Asturias.\n* 774 - Silo becomes King of Asturias. In this period there is a lot of unrest in Galicia towards the rule of Asturias.\n* 791\n** Alfonso II becomes King of Asturias in Oviedo and conquers a number of Moorish strongholds and settles the lands south of the Douro river.\n** A Muslim force raids Galicia.\n* 794 - Asturians defeat the Muslims at the Battle of Lutos.\n* 813 - The grave of James the Apostle is \"discovered\" near Santiago de Compostela, in Galicia, beginning the cult of St. James that would unite Iberian Christians of many different petty kingdoms.\n* 844\n** Vikings raid the Galician estuaries and are defeated by Ramiro I of Asturias.  (The Vikings also raid the Muslim-controlled cities and regions to the south - Lisbon, Beja (Portugal) and the Algarve, and sack Seville.)\n** Battle of Clavijo, legendary battle between Christians led by Ramiro I of Asturias and Muslims, where St. James is said to have helped the Christian Army.\n* 850 - Ordonho I becomes King of Asturias in Oviedo. Beginning of Christian repopulation. Rise of the county of Castile.\n* 910 - Alfonso III of Asturias dies and his kingdom is divided among his 3 sons. The eldest son, Garcia became king of Leon but died shortly after in 914 without an heir. The second son Ordoño reigned Galicia since 910 and Kingdom of León after Garcia's death. The youngest son Fruela received Asturias\n* 913 - An expedition commanded by Ordoño II, then king of Galicia, into Muslim territory, rides Évora.\n* 914\n** Ordoño II of Galicia, becomes King of Kingdom of León, after the death of his brother García I of León.\n** The capital city of the Kingdom of Asturias is moved from Oviedo to León, from now on Kingdom of León.\nKingdom of Galicia inside Kingdom of León\n* 916 - Ordoño II of León is defeated by the Emir Abd-ar-Rahman III in Valdejunquera.\n* 924 - Fruela becomes King of León and Galicia, after the death of his brother, but died a year later.\n* 925\n** Alfonso Fróilaz son of Fruela, King of León and Galicia, Sancho I Ordóñez, Alfonso IV and Ramiro II,  the sons of Ordoño II of León, claimed to be the rightful heirs and rebelled against their nephew. With support of Jimeno of Navarre they drove Alfonso Fróilaz to the eastern borderlands of Asturias and divided the kingdom among themselves\n** Sancho I Ordoñez, son of Ordoño II of León, becomes king of Galicia until  his death in 929.\n** Alfonso IV becomes Kingdom of León.\n** Ramiro II, becomes King only of a lesser part of Asturias and was the first to bear the title King of Portuguese Land.\n* 929 - Alfonso IV becomes King of Galicia.\n* 931 - Alfonso IV resigned the crown to his brother Ramiro II in 931 and went into a religious house.\n* 932 - Alfonso IV took up arms with Fruela's sons Ordoño and Ramiro against his own brother Ramiro II, having repented of his renunciation of the world. He was defeated, blinded and sent back to die in the cloister of Sahagun.\n* 950 - Ordoño III becomes King of León.\n* 953 - Big Moorish incursion in Galicia.\n* 955 - Ordoño III of León attacks Lisbon.\n* 956 - Sancho I becomes King of León.\n* 958 - Sancho I of León is deposed and Ordoño IV becomes King of León.\n* 960 - Sancho I of León is reinstated as King of León.\n** Vikings raid Galicia and kill the bishop Sisenand of Santiago de Compostela in battle, but his successor St. Rudesind rallies the local forces and kills the Viking leader Gundered.\n* 967 - Ramiro III becomes King of León.\n* 971 - Another minor Viking raid in Galicia.\n* 982 - Bermudo II becomes King of Galicia and King of Portuguese Land after a joint rebellion against Ramiro III\n* 984 - Bermudo II becomes King of León, having been acclaimed by the counts of Galicia and anointed in Santiago de Compostela.\n* 987\n** Al-Mansur Ibn Abi Aamir seizes the castles north of the Douro river, and arrives at the city of Santiago de Compostela. The city had been evacuated and Al-Mansur burns it to the ground and destroys the Church of Santiago.\n** Count Gonçalo Mendes takes the personal title Magnus Dux Portucalensium (Grand-Duke of Portugal) and rebels against King Bermudo II of León, being defeated.\n* 999 - Alfonso V becomes King of León.\n* 1008 - Vikings raid Galicia, killing Count Mendo Gonçalves II of Portugal.\n* 1016 - Norman invaders ascend the Minho river and destroy Tui in Galicia.\n* 1028\n** Alfonso V, king of Asturias and León, lays siege to Viseu but is killed by an arrow shot from the walls.\n** Bermudo III, becomes King of León.\n* 1031\n** Sancho III of Navarre declares war on Bermudo III of León. Navarre, sometimes assisted by Galician rebels and Normans, ravages the lands around Lugo in Galicia.\n1032 Bermudo III of León, deprived of the capital city of Leon, retreated into Galicia.\n* 1034\n** The Leonese destroy a raiding force under Ismail ibn Abbad of Seville. Ismail ibn Abbad flees to Lisbon.\n** Gonçalo Trastemires - a Portuguese frontiersman - captures Montemor castle on the Mondego river.\n** By 1034, Sancho the Great of Navarre had incorporated Aragon, Sobrarbe, Barcelona, as well as Asturias, Kingdom of León and Castile, and he proclaims himself Rex Hispaniarum (\"King of all Spains\").\n* 1035\n** Sancho III of Navarre, Aragon and Castile dies and distributes his lands among his three sons; Castile and Aragon become kingdoms. Bermudo III of León is immediately received back into León and soon began a campaign to recover Castile.\n** Bermudo III of León defeats the Moors in César, in the Aveiro region.\n* 1037 – Ferdinand of Castile, son of Sancho III of Navarre, acquires the Kingdom of León in the Battle of Tamarón. The first Castilian king, Ferdinand I, defeats and kills his father-in-law, Bermudo III of León, thus inheriting his kingdom.\n* 1039 – Ferdinand I of Castille-León proclaims himself Emperor of all Hispania\n* 1060-1063 -  Council (Ecumenical Synod) of Santiago de Compostela.\n* 1063 - Ferdinand I of Castile-León divides his kingdom among his sons. Galicia is allotted to his son García.\n* 1065 -  Independence of the Kingdom of Galicia and Portugal is proclaimed under the rule of Garcia II of Galicia.\n* 1070 - Count Nuno Mendes of Portugal rises against King Garcia II of Galicia.\n* 1071 - Garcia II of Galicia becomes the first to use the title King of Portugal, when he defeats, in the Battle of Pedroso (near Braga), Count Nuno Mendes, last count of Portugal of the Vímara Peres House.\n* 1072 - Loss of independence of the Kingdom of Galicia and Portugal, forcibly reannexed by Garcia's brother king Alfonso VI of Castile.\n* 1077 - Alfonso VI of Castile and León proclaims himself Emperor of all Spains.\n* 1091- Alfonso VI of Castile gives his daughter Urraca of Castile in marriage to Raymond of Burgundy together with the fiefdom of Galicia.\n* 1102 - Diego Gemírez, Bishop of Santiago de Compostela, uses force to carry off the relics of St. Victor and St. Fructuosus of Dumes from Braga - recently reinstated as a Metropolitan See.\n* 1107 - Count Raymond of Burgundy dies. The Kingdom of Galicia passes on to his son Alfonso Raimúndez.\n* 1109 July 1 – Alfonso VI of Castile and León dies. Urraca of Castile, Count Raymond of Burgundy's widow,  is his only surviving legitimate child and marries King Alfonso I of Aragon.\n* 1120\n** Afonso Henriques takes sides with the Bishop of Braga against his mother Theresa, Countess of Portugal and her lover, the Count Fernão Peres de Trava of Galicia\n** The armies of Theresa, Countess of Portugal battle against the armies of Urraca of Castile.\n* 1129 - April 6, Afonso Henriques proclaims himself Prince of Portugal.\n* 1130\n** Prince Afonso Henriques invades Galicia.\n** Prince Afonso Henriques' mother, Theresa, Countess of Portugal, dies in Galicia.\nKingdom of Galicia inside Crown of Castile\n* 1528 - Xunta of the Kingdom of Galicia was created.\n* 1563 - A Coruña becomes capital of Galicia, when Philip II granted the city the headquarters of the captaincy and the audience\n* 1808 - Formation of the Xunta Suprema of the Kingdom of Galicia in order to defend the kingdom against the Napoleonic armies. Recovery of extraordinary powers of self-government.\n* 1800 - First newspaper of Galicia is published, El Catón Compostelano\n* 1809 - 16 January: Battle of Corunna.\n* 1833 - Regent María de las Mercedes of Bourbon-Two Sicilies signs the decree of the dissolution of the Xunta of the Kingdom of Galicia.\nKingdom of Spain / Republic of Spain / Francoist Spain\n* 1843 - Xunta Central de Galicia (Central Board of Galicia) was set up, chaired by Xosé María Suances, opposed to Baldomero Espartero's regency.\n* 1846 - Solís Uprising took place in Lugo, which dissolved the Provincial Council and the Provincial Council by organizing the Xunta Superior do Goberno de Galicia (Xunta Superior of the Government of Galicia=, chaired by Pío Rodríguez Terrazo and which would end with the execution of the Martyrs of Carral.\n* 1854 - Gas lighting network is created in A Coruña.\n* 1880s - Electric lighting network is created in A Coruña.\n* 1873 - First train line is inaugurated between Cornes (Santiago) and Carril (Vilagarcía)  September 15. Its later extension to Vigo and A Coruña would give rise to the Atlantic Axis.\n* 1875 - A Coruña-Lugo train begins circulation.\n* 1885 - A Coruña-Madrid train begins  circulation.\n* 1882 - La Voz de Galicia newspaper begins publication.\n* 1916 - Irmandades da Fala (political group) organized.\n* 1936 - Statute of Autonomy of Galicia of 1936 was voted and approved. It could never be implemented because of the Spanish Civil War\n* 1978 - Xunta de Galicia is designated as government of Galicia.\nAutonomy of Galicia inside Kingdom of Spain\n* 1981 - Statute of Autonomy of Galicia of 1981 was ratified\n* 1982 - Santiago de Compostela becomes capital of Galicia replacing A Coruña\n* 1992 - Aegean Sea tanker oil spill\n* 2001 - R (cable operator) begins operations and spreads fiber optic network across Galicia\n* 2002 - Prestige oil tanker sank off the coast of Galicia\nSee also\n* Timeline of A Coruña\n* Timeline of Vigo\nReferences\n}}"
    }
  ]
}