{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Mountain View, California\n\nThe following is a timeline of the history of the city of Mountain View, California, USA.\nPrior to 20th century\n* The Ohlone tribe inhabited the area, the Tamyen (Tamien, Thamien) people are associated with the Mountain View area.\n* 1777 - Mission Santa Clara de Asís is founded on January 12, and the land that is now Mountain View was used as pasture for sheep and cattle by the Mission Indians.\n* 1842 - Mexico grants 8,800 acre land (part of what is now part of Mountain View and Sunnyvale) to Francisco Estrada and his wife, Inez Castro.\n* 1844 - Mexico grants 1,700 acre land grant of Rancho Posolmi, (the Moffett Field area) is granted to local Native American Lupe Ynigo.\n* 1845 - The Rancho Pastoria de las Borregas (Ranch of the Ewe/Lamb Pasture) was a transferred land grant to Mariano Castro, after the death of his relative Francisco M. Estrada.\n* 1852 - Stagecoach service begins, and the first stop (near Grant Road and El Camino Real) is formed for service between San Francisco and San Jose. A settlement is formed around this stop.\n* 1854\n* 1858\n** The first public school opens on El Camino Real near present-day Calderon Street serving students from kindergarten to 8th grade.\n** Settlement named \"Mountain View\", naming is credited by local store-keeper and the first postmaster, Jacob Shumway.\n** Public school district opens.\n* 1867 - Rengstorff House (residence) built in Shoreline Park. First Catholic mission of Saint Joseph built under Rev. Fr. Joseph Bixio at El Camino Real and Grant (currently the site of a BMW dealership).\n* 1888 - Mountain View Register newspaper begins publication.\n* 1893 - Stanford University professors investigate the Castro Indian Mound, also known as Indian Hill, Secondino Robles (in the neighborhood that is now known as Monta Loma) to better understand local Native American customs.\n20th century\n* 1900 - Bank of Mountain View in business.\n* 1901 First Catholic pastor Rev. Fr. John J. Cullen assigned to Mountain View.\n* 1902\n** November 7: Mountain View incorporated.\n** November 7: Mountain View High School opens on El Camino Real and present-day Calderon Street.\n** \"Electric streetlights, telephone service and a municipal water system\" begin operating (approximate date).\n* 1904 - Seventh-day Adventist Pacific Press Publishing Association moves to town.\n* 1905\n** Mountain View Public Library established.\n** Farmers and Merchants Bank built.\n** Mariano Castro family donates land for Saint Joseph Parish. Concrete foundations poured at current location 582 Hope Street, at the corner of Castro Street.\n* 1906 - April 18: 1906 San Francisco earthquake.\n* 1909 - Town Hall built.\n* 1924 - The local high school is renamed to Mountain View Union High School and relocated to a larger campus on Castro Street, also serving the neighboring Los Altos and Whisman communities.\n* 1926 - Ambra Olive Oil Company of Mountain View is opened on 987 North Rengstorff Avenue. Founded by Mario Ambra (1887–1968), a native of Pachino, Italy, and his wife Rosaria (1890–1981).\n* 1928 - Saint Joseph Catholic Church burned down by arsonist.\n* 1929 - Saint Joseph Catholic Church rebuilt. Murray Harris pipe organ, with pipes cast before the Great Earthquake of 1906 was donated by Saint Ignatius Church in San Francisco.\n* 1930 - Mountain View Theater opens.\n* 1933 - US Naval Air Station, Moffet Field established.\n* 1934\n** Historic Adobe Building constructed.\n** Mountain View Buddhist Temple active.\n* 1940: the city became the home of the National Advisory Committee for Aeronautics (now the NASA Ames Research Center), influencing the city's development of its aerospace and electronics industries.\n* 1948 - Construction of Saint Joseph Catholic School on Miramonte Avenue under Rev. Fr. James Doyle.\n* 1950\n** Monte Vista Drive-In cinema in business.\n** Population: 6,563.\n* 1954 - Mountain View Historical Association formed.\n* 1955\n** February 24: Birth of Steve Jobs.\n** Mountain View Recreation Commission decided to name McKelvey Park, after John Addison McKelvey of the Mountain View Berry Farm.\n* 1956 - Beckman Instruments' Shockley Semiconductor Laboratory active.\n* 1957 - The construction of San Antonio Shopping Center begins.\n* 1959 - The Jobs family, including young Steve Jobs move to the Monta Loma neighborhood living at 286 Diablo Avenue.\n* 1960 - Population: 30,889.\n* 1964 - Moffett Drive-In Theatre opened\n* 1966 - Mayfield Mall opens (corner of Central Expressway and San Antonio Road)\n* 1967 - The Jobs family, including young Steve Jobs, move away from Mountain View to nearby Cupertino.\n* 1968 - Intel Corporation and Monolithic Memories in business.\n* 1970 - Regional Metropolitan Transportation Commission established.\n* 1972 - Judith Moss became Mountain View's first female councilmember.\n* 1975 - Old Mill Shopping Mall (shopping centre) in business.\n* 1979 - Kannon Do Zen Meditation Center building is founded.\n* 1981 - Mountain View Union High School closes, to be relocated and renamed.\n* 1982 - Grid Compass laptop computer introduced.\n* 1983\n** The Meadowlands garbage facility is closed, in order to restore wetlands\n** Mayfield Mall closes (corner of Central Expressway and San Antonio Road)\n* 1985\n** Actel Corporation and Century Cinema in business.\n** Moffett Drive-In Theatre closed and demolished\n* 1986 - Former Mayfield Mall location is converted into Hewlett Packard offices.\n* 1987 - Downtown Mountain View Station opens.\n* 1989\n** the Old Mill Shopping Mall closes\n** Stanford University surrenders the collected artifacts and remains from the Castro Shell Mound (the area is now known as the Monte Loma neighborhood) to the descendants, this includes 550 Ohlone Indian remains.\n* 1991\n** The Rengstorff House is fully restored\n** Marv Owen, a baseball player for the Detroit Tigers (1931–37), Chicago White Sox (1938-39) and Boston Red Sox (1940), died at age 85 at a nursing home in Mountain View.\n* 1993\n** The Peninsula Times-Tribune newspaper closes, paper served 10 local communities including Mountain View\n** Voice of Mountain View newspaper begins publication.\n** Anna Eshoo becomes U.S. representative for California's 14th congressional district.\n* 1994 - Santa Clara County government computer network begins operating.\n* 1995 - The Crossings, a housing community is built over the Old Mill Shopping Mall\n* 1996 - The Computer Museum (now called the Computer History Museum) moves part of the unused museum collection from Boston, Massachusetts to Mountain View and it's stored in a former Moffett Field building.\n* 1997 - City website online (approximate date).\n* 1999\n** The Computer Museum moves the remainder of the museum collection to Mountain View and renamed to The Computer Museum History Center.\n** Google Inc. in business.\n21st century\n* 2000 - Rosemary Stasek becomes mayor\n* 2001 - Mario Ambra becomes mayor\n* 2002\n** Computer History Museum opens at 1401 N. Shoreline Blvd.\n** Sally Lieber becomes mayor.\n** In April, Mario Ambra resigns from City Council after being found guilty for misconduct.\n* 2003 - Mike Kasperzak becomes mayor\n* 2004 - Matt Pear becomes mayor\n* 2005\n** Matt Neely becomes mayor\n** The old pump windmill is relocated to the Rengstorff House, formerly located at Mountain View Grant Road Farm.\n* 2006\n** Nick Galiotto becomes mayor\n** The Jehning Lock Museum opens at 175 Castro Street, featuring one of the largest collections of locks and keys.\n* 2007 - Laura Macias becomes the city's second Mexican-American woman to be mayor\n* 2008 - Tom Means becomes mayor\n* 2009 - Margaret Abe-Koga becomes Mountain View's first female Asian-American mayor\n* 2010\n** Population: 74,066.\n** Ronit Bryant becomes mayor\n* 2011\n** Jac Siegel becomes mayor\n** Dan Rich becomes city manager\n** The Computer History Museum reopens, after a two-year, $19 million remodel.\n* 2012 - Mike Kasperzak becomes mayor\n* 2013\n** John Inks becomes mayor\n** Google leases the former Mayfield Mall location (corner of Central Expressway and San Antonio Road)\n* 2014 - Chris Clark becomes mayor.\n* 2015 - John McAlister becomes mayor.\n* 2016\n** Patricia \"Pat\" Showalter becomes mayor.\n** Rent control approved.\n** November 13: Mountain View High School received national attention after placing History teacher Frank Navarro on administrative leave for allegedly drawing historical comparisons between Donald Trump and Adolf Hitler.\n* 2017\n** Ken Rosenberg becomes mayor\n** Rental Housing Committee appointed\n* 2018 - Lenny Siegel becomes mayor\n* 2019 - Lisa Matichak becomes mayor\n* 2020 - Margaret Abe-Koga becomes mayor\n* 2021 - Ellen Kamei becomes mayor\n* 2022 - Lucas Ramirez becomes mayor\n* 2023 - Alison Hicks becomes mayor\nSee also\n* History of Santa Clara County, California\n* Timeline of the San Francisco Bay Area\n* History of Google, headquartered in city\n* Timelines of other cities in the Northern California area of California: Fresno, Oakland, Sacramento, San Francisco, San Jose\nReferences\nBibliography\n*\n*\n*\n}}\n*\n}}\nExternal links\n*\n* [http://dp.la/search?utf8=✓&page_size=100&q=%22mountain+view%22+california Items related to Mountain View], various dates (via Digital Public Library of America)."
    }
  ]
}