{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Border Television\n\nThis is a timeline of the history of Border Television (now known as ITV Border). It provides the ITV service for most of Cumbria in England and the southern parts of Scotland.\n1960s\n*1960\n** Border Television is awarded the contract to provide an ITV service for the English counties of Westmorland and Cumberland and the south of Scotland. There had been one other applicant, from Solway Television.\n*1961\n** 1 September – Border Television launches. The station had planned to go on the air in February but construction problems with both transmitters resulted in delays until May. Border then asked for a further delay as it felt that launching over the Summer holiday period would affect advertising revenue.\n*1962\n** Border manages to achieve a profit in its first year of broadcasting.\n*1963\n** Border attracts a regional share of 60%. This success means that Border is able to pay off its start-up costs within two years of going on the air.\n* 1964\n** Border is given a three-year extension to its licence. This is later extended by a further year.\n*1965\n** 26 March – Border starts broadcasting to the Isle of Man.\n*1966\n** No events.\n* 1967\n** The Independent Television Authority renews Border's licence for a further seven years.\n* 1968\n** August – A technicians strike forces ITV off the air for several weeks although management did launch a temporary ITV Emergency National Service with no regional variations.\n* 1969\n** No events.\n1970s\n* 1970\n** No events.\n* 1971\n** 1 September – Border Television marks its tenth anniversary and begins broadcasting in colour, but initially only from Caldbeck.\n* 1972\n** 1 March – Colour transmissions begin from the Selkirk transmitter.\n** 16 October – Following a law change which removed all restrictions on broadcasting hours, ITV is able to launch an afternoon service and Border carves out a niche for itself by providing the network with afternoon quiz programmes, most notably Mr. and Mrs. which was hosted by Border TV's Assistant Controller of Programmes, Derek Batey.\n* 1973\n** Late 1973 – Border's local programmes are made in colour for the first time.\n* 1974\n** The 1974 franchise round sees no changes in ITV's contractors as it is felt that the huge cost in switching to colour television would have made the companies unable to compete against rivals in a franchise battle.\n* 1975\n** 4 September – Border announces that it may have to cut back on programme production following a substantial fall in net profits.\n* 1976\n** No events.\n* 1977\n** No events.\n* 1978\n** No events.\n* 1979\n** 10 August – The ten week ITV strike forces Border Television off the air. The strike ends on 24 October.\n1980s\n* 1980\n** No events.\n* 1981\n** October – Border announces a loss of £70,000 before tax. The financial situation had been so dire that Border had considered not reapplying for the renewal of its licence.\n* 1982\n** 1 January – The Kendal transmitter is transferred from Granada to Border.\n** November/December –  An industrial dispute forces Border to close for a month in a dispute over new technology which ended only after letters asking for an improvement in industrial relations were withdrawn.\n* 1983\n** 1 February – ITV's breakfast television service TV-am launches. Consequently, Border's broadcast day now begins at 9:25am.\n* 1984\n** No events.\n* 1985\n** 3 January – Border's last day of transmission using the 405-lines system.\n* 1986\n** No events.\n* 1987\n** 7 September – Following the transfer of ITV Schools to Channel 4, ITV provides a full morning programme schedule, with advertising, for the first time. The new service includes regular five-minute national and regional news bulletins.\n* 1988\n** 2 September – Border begins 24-hour broadcasting.\n* 1989\n** 13 February – For the first time, ITV starts broadcasting a national weather forecast. Previously, Border had aired its own regional weather forecast which they had broadcast at the end of their local news programmes and at closedown.\n** 1 September – ITV introduces its first official logo as part of an attempt to unify the network under one image whilst retaining regional identity. Border adopts the logo.\n** Border begins providing a sub-regional service for Scottish Borders viewers served by the Selkirk transmitter, consisting of a short opt-out during Lookaround each weeknight.\n1990s\n* 1990\n**Melvyn Bragg becomes chairman of Border Television. He had been deputy chairman since 1985.\n* 1991\n** 16 October – Border is unopposed in retaining its licence to broadcast, allowing it to bid only £52,000 a year (or £1,000 a week).\n* 1992\n** 7 September – Border stops using the 1989 corporate look and begins to use in-vision continuity more heavily.\n* 1993\n** 14 April – Border wins the licence to broadcast a radio service to northern Cumbria and south west Scotland. The station launches as CFM. Its studios are adjacent to those of the television station.\n**  December – Border branches out into radio when it was awarded the licence for a new regional radio station serving Central Scotland - Scot FM - in partnership with Grampian Television.  The station also wins the north east regional licence.\n* 1994\n** 1 September – Border's first regional radio station launches when 100–102 Century Radio begins broadcasting.\n** 5 September – Border updates its logo and presentation.\n** 16 September – In conjunction with Grampian Television, Border launches its second radio station - Scot FM.\n* 1995\n** May – Grampian buys Border's stake in Scot FM.\n** 1 September –  Less than a year after its last refresh, Border once again updates its logo and presentation.\n* 1996\n** No events.\n* 1997\n** 26 July – Border forms a subsidiary, Border Radio Holdings, for its radio business.\n** 23 September – Border's second regional radio station, Radio 106, launches.\n* 1998\n** April – Border's struggling East Midlands station Radio 106 is relaunched as Century 106.\n** 8 September –  Border's third regional radio station, Century 106, opens, broadcasting across north west England.\n** 15 November – The public launch of digital terrestrial TV in the UK takes place.\n* 1999\n** April – Border's sub-regional service for Scottish Borders viewers served by the Selkirk transmitter, consisting of a short opt-out during Lookaround each weeknight, is extended to cover Dumfries and Galloway and a dedicated Scottish news bulletin is introduced on weekday lunchtimes.\n** 8 November – A new, hearts-based on-air look is introduced.\n2000s\n* 2000\n** March –  Capital Radio buys Capital Radio Group, when Capital Radio Group bought Border Television.\n**April – New owners Capital sell Border Television to Granada Media Group.\n** August – Border begins to use the opt-out service to provide split coverage of sports and occasional political programming. The station also opens an Edinburgh bureau to provide coverage of the Scottish Parliament.\n* 2001\n** 11 August – ITV's main channel is rebranded as ITV1.\n* 2002\n** 28 October – On-air regional identities are dropped apart from when introducing regional programmes and Border is renamed ITV1 Border.\n* 2003\n** No events.\n* 2004\n** January – The final two remaining English ITV companies, Carlton and Granada, merge to create a single England and Wales ITV company called ITV plc.\n**31 October – The famous chopsticks logo is seen by viewers for the final time.\n* 2005\n** No events.\n* 2006\n** 13 December – The Berwick-upon-Tweed transmitter transfers to Tyne Tees as part of the preparations for the digital switchover of the Border region in 2008.\n* 2007\n** 14 November – The Eskdale Green, Gosforth and Whitehaven areas of Border's region becomes the first part of the UK to undergo digital switchover.\n* 2008\n** December – Border's non-news local programming in the England part of its region ends after Ofcom gives ITV permission to drastically cut back its regional programming. From 2009 the only regional programme is the monthly political discussion show.\n* 2009\n** 25 February – ITV makes major cutbacks to its regional broadcasts in England, the Border and Tyne Tees regions are merged to form ITV Tyne Tees & Border. Lookaround is no longer broadcast from Carlisle, instead it is transferred to the studios of Tyne Tees in Gateshead. All of the separate sub-regional news programmes are merged pan-regional programmes although more localised news continues to be broadcast as a brief opt-out during the early evening programme.\n**24 June – The Border region becomes the first in the UK to complete digital switchover.\n**15 July – Coverage of the Isle of Man is transferred from Border to Granada.\n2010s\n*2010\n** Border's studios in Carlisle are closed and subsequently demolished. However, an office for Border's news and advertising operations is opened in the Kingstown area of Carlisle with news reports being sent via file server to the ITV Tyne Tees & Border studios in Gateshead.\n*2011\n** No events.\n*2012\n** No events.\n*2013\n** 4 January – The Tyne-Tees news service is rebranded as ITV News Tyne Tees. and pan-regional bulletins are branded as ITV News Tyne Tees & Border\n** 23 July – Proposals to reintroduce full regional services for the Tyne Tees and Border regions were approved by OFCOM, effectively leading to a demerger of the Tyne Tees and Border services.\n** 16 September – Lookaround and ITV News Tyne Tees are restored as fully separate regional programmes on weekdays with shorter daytime and weekend bulletins reintroduced. Both programmes continue to be broadcast from Tyne Tees' Gateshead studios with extra journalists recruited for newsgathering in the Border region.\n*2014\n** 6 January – Following instructions from regulator Ofcom, ITV reopens Border's sub-regional service for southern Scotland.\n** 12 January – The relaunching of the Southern Scotland service sees the launch of a new magazine programme called Border Life and a news magazine programme called Representing Border.\nSee also\n* History of ITV\n* History of ITV television idents\n* Timeline of ITV\n* Timeline of television in Scotland\nReferences"
    }
  ]
}