{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of changes in the sport of athletics\n\nIn the course of its history, the sport of athletics (track and field) has undergone many changes. This article presents the changes to the rules of competition as well as to major events in the sport.\n1893\n• Batons start being used for relay races.\n1896\n• The first modern Olympic Games are held in Athens, Greece.\n1903\n• International Cross Country Championships is held for the first time. It will eventually transform into the World Athletics Cross Country Championships.\n1911\n• In Sweden, men's decathlon is held for the first time with today's ten events.\n1912\n• The 1912 Olympic Games are held introducing several new events. It is the first edition to feature the combined events in decathlon and pentathlon, as well as a cross-country race. This is also the only edition to feature two-handed throws (shot, discus and javelin), in which athlete would throw three times with one hand and three with the other with the best scores for each hand constituting the final result. In addition, standing high jump and long jump are held for the last time.\n• An intention to create the International Amateur Athletic Federation (IAAF) as the international governing body for the sport of athletics is expressed in Stockholm, Sweden, by delegates from 17 national federations.\n1914\n• A list of world records (men only) is officially published for the first time.\n1915\n• Decathlon scoring tables are adjusted basing the score of 1000 points for an event on the Olympic record as it stands that year.\n1920\n• At the 1920 Summer Olympics countries are limited to 4 athletes per event, down from 12.\n1922\n• 1922 Women's Olympiad in Monte Carlo is the first international athletics competition for women.\n• The first reported women's pentathlon is held at the Women's Olympiad. The events are: 60&nbsp;m, 300&nbsp;m, high jump, two-hand javelin, and two-hand shot.\n1924\n• The 1924 Olympic Games are the last edition to feature men's pentathlon. This will leave decathlon as the sole combined events fixture until women's pentathlon is introduced in 1964.\n1926\n• The Dutch Athletics Federation uses the first \"slow motion\" apparatus to judge photo finish and stop relying on human eye.\n• Exchange zones are introduced for relay races.\n1928\n• 1928 Olympic Games are the first to feature women's athletics. There are only five for this edition compared to 22 for men: the 100 metres, 800 metres, 4 × 100 metres relay, high jump and discus throw. The 800 metres will be subsequently viewed as too grueling for women and not featured again until 1960.\n1932\n• At the 1932 Summer Olympics countries are limited to 3 athletes per event, a standard which hold to this day at most major global championships.\n• The Games add two new events for women: javelin throw and 80 metres hurdles.\n1934\n• New decathlon scoring tables are implemented updating the points which were previously based on the 1912 world records.\n1938\n• 1938 European Championships feature women's athletics for the first time (although at a different venue than men's competition) adding three new events to the international programme: 200 metres, long jump and shot put.\n1948\n• The 1948 Olympic Games add three new events for women: 200 meters, long jump and shot put.\n1949\n• Women's pentathlon is changed to feature the following events: 80 metres hurdles, high jump, shot put, long jump and 200 metres.\n1952\n• New decathlon scoring tables are implemented taking into consideration improved postwar performances. The new tables give bigger points for a world record achievement, and in general cause a reduction of points for the same performances under the old tables.\n1954\n• New women's pentathlon scoring tables are implemented.\n• Women's 800 metres makes a return to international competitions at the 1954 European Athletics Championships having previously been dropped in 1928.\n1958\n• 1958 European Championships is the first major competition to see women compete in the 400 metres sprint.\n1961\n• The Lugano Trophy walking competition is introduced, the first event hosted solely by IAAF. It will evolve into IAAF World Race Walking Cup in 1979.\n1962\n• New decathlon scoring tables are implemented favouring well-rounded athletes over specialists in fewer events.\n1964\n• The 1964 Summer Olympics are the first to use automatic timing.\n1968\n• While timing to the 100th of a second had been experimented with for many years, the 1968 Summer Olympics were the first to use Fully Automatic Timing.\n• Anti-doping: The 1968 Summer Olympics were the first to do drug testing, though primarily these initial searches were for narcotics and stimulants.\n1969\n• Women switch from 80 to 100 metres hurdles. The first major event after the change is the 1969 European Championships. The same change is made to the women's pentathlon.\n• 1969 European Championships is also the first major competition to hold women's 1500 metres race and 4 × 400 metres relay.\n• The sectors for the discus and hammer throw are reduced from 60° to 45°.\n• When judging the photo finish, the athlete's neck is no longer considered part of the torso.\n• In pole vault, the pole is now allowed to pass under the bar.\n1971\n• New women's pentathlon scoring tables are implemented to account for the improvement in performances in the 1950s and 1960s.\n1973\n• The 800 metres race starts being run in lanes for the first 300 metres (first two curves and the first straight) instead of the 100 metres. This short lived rule was last applied globally at the 1976 Olympic Games.\n• International Cross Country Championships is transformed into World Cross Country Championships and its organisation transferred from the International Cross Country Championships to IAAF.\n1974\n• At the 1974 European Athletics Championships women compete in the 3000 metres for the first time at a major championship.\n1976\n• IAAF holds its first World Championships, although the 1976 edition is for one event only, men's 50 kilometres race walk, which was dropped from that year's Olympic Games. This will later evolve into the World Championships proper which will have the exact same athletics programme as the Olympics starting in 1983.\n• After the 1976 Olympics, women's pentathlon replaces the 200 metres sprint with an 800 metres race.\n1977\n• IAAF World Cup is held for the first time. The team competition would feature the United States, the top two nations in the preceding European Cup and continental teams comprising Africa, Asia, Oceania, the rest of the Americas, and the rest of Europe.\n• From now on, for races up to 400 metres, only electronically timed results are eligible for record purposes.\n1978\n• At the 1978 European Athletics Championships women compete in the 400 metres hurdles for the first time at a major championship.\n1980\n• 1980 World Championships in Athletics are held featuring only two events, which were not included in that year's Olympics programme, women's 400 metres hurdles and 3000 metres.\n• Female combined eventers start to switch from the pentathlon to the heptathlon. Though pentathlon is still held at the 1980 Summer Olympics, new competitions start replacing it with the seven-event variant. The first championship to feature the new event, which adds the 200 metres and javelin throw to the five pentathlon events, is the 1980 Pan American Junior Athletics Championships.\n1982\n• 1982 European Athletics Championships is the first major competition to feature women's marathon event.\n• IAAF approves athletes receiving compensation for their performance in a limited way, which is a first step towards accepting professionalism in the sport.\n1983\n• Full World Championships in Athletics are held for the first time. Its programme is identical to that of the Olympic Games while the previous two editions of the competition were meant only for events not present in the Olympic programme. The competition will be held quadrennially until 1991 when it will switch to biennial frequency.\n1984\n• New decathlon and heptathlon scoring tables are introduced to put more importance to field events the scoring of which was deemed too regressive in the previous tables compared to track events. From now on the tables will be used solely for combined events and not to compare individual performances. The tables will be slightly modified in 1998.\n1985\n• 1985 World Indoor Games are held, the first global indoor competition. They will become the IAAF World Indoor Championships in 1987.\n• 1985 European Cup is the first major competition to feature women's 10,000 metres. That year's IAAF World Cup is the first global competition to add it to the programme.\n1986\n• Men switch to the new model javelin with its centre of gravity moved forward, which results in shorter flight. Women will not make the same switch until 1999.\n• IAAF World Junior Championships in Athletics are held for the first time for athletes 19 years of age or younger.\n1987\n• The World Athletics Indoor Championships are officially held for the first time. This follows from the unofficial 1985 World Indoor Games.\n• Indoor as well as junior (U20) world records are officially published for the first time.\n1990\n• 1990 European Indoor Championships is the first major competition to feature women's triple jump although as an exhibition event.\n1994\n• 1994 Goodwill Games is the first major championship to feature women's pole vault. Another new event is women's 2000 metres steeplechase, later to be replaced with the standard 3000 metres version.\n1995\n• Women switch from 3000 to 5000 metres at major championships bringing men's and women's programmes closer together. The 3000 metres will now be run only sporadically at major outdoor events, most significantly at the European Cup.\n• 1995 South American Championships in Athletics is the first major event to hold women's hammer throw.\n1997\n• For the first time at the World Championships the defending champion from the previous edition gets the wild card to compete in the same event. This results in four athletes from one country taking part in certain events, which is one of the few differences between the World Championships and athletic competition at the Olympic Games.\n1998\n• The 1998 Goodwill Games are the first major championships to feature women's 3000 metres steeplechase.\n1999\n• Women switch to the new model javelin 13 years after their male counterparts.\n• Women's pole vault and hammer throw are added to the World Championships programme.\n• 20 kilometres walk becomes the official walking event for women at major championships replacing the 10 kilometres distance.\n• Biennial World Youth Championships in Athletics (renamed World U18 Championships in Athletics for the last edition) is introduced for athletes aged 18 or younger. The event will be discontinued in 2017.\n2001\n• IAAF changes the full form of its name from International Amateur Athletic Federation to International Association of Athletics Federations to reflect the sport moving away from amateurism to professionalism. The name will last until 2019 when it will rename again to World Athletics.\n2002\n• Junior (U20) male athletes start using lighter implements in throwing events. This remains unchanged for female athletes.\n2003\n• New false start rules is introduced allowing only one false start in a given heat without consequences regardless of who caused it. Previously each athlete could make one false start without being penalised.\n2005\n• Women's 3000 metres steeplechase is for the first time included in the World Championships programme.\n2006\n• The sprint hurdles height for junior (U20) male athletes is lowered from 106.7&nbsp;cm to 99.0&nbsp;cm. This remains unchanged for female athletes.\n2009\n• The new false start rule is introduced, causing the athlete to get immediately disqualified after just their false start. The previous rule allowed for one false start in a given heat without consequences to the athlete. The combined eventers are allowed one false start each without disqualification (previously two).\n2010\n• IAAF World Cup is rebranded as IAAF Continental Cup. The change sees the national teams removed, and team scoring incorporating both sexes. The competition will be discontinued after the 2018 edition.\n2013\n• Youth (U18) female athletes start using lighter implements in throwing events.\n2014\n• World Athletics Relays are held for the first time. This competition serves for qualification for global events such as World Championships or Olympic Games.\n2017\n• IAAF World U18 Championships in Athletics are held for the last time before being discontinued.\n• The mixed 4 × 400 metres relay event is introduced at senior level at the IAAF World Relays. Each teams consists of two women and two men who may start in an order of the team's choosing. The order of sexes will get fixed in 2022.\n2018\n• IAAF Continental Cup (previously World Cup) is held for the last time before being discontinued after 13 editions.\n2019\n• The International Association of Athletics Federations (IAAF) renames to World Athletics.\n2021\n• New more lenient rule on lane infringement allows the athlete to take a single step on the inner lane or on the curve without immediate disqualification. Previously any such step could lead to being disqualified.\n2023\n• On 1 November, World Athletics introduces a new \"short track\" concept, essentially renaming the \"indoor\" category to \"short track\" and thus allowing \"indoor\" records and competitions to be performed on any 200 metres track, regardless of whether or not it is \"indoors\".\nReferences"
    }
  ]
}