{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Pittsburgh\n\nThe following is a timeline of the history of the city of Pittsburgh, Pennsylvania, US.\n18th century\n* 1742\n** John Fraser is given what will become Braddock's Field.\n* 1754\n** February: Construction on Fort Prince George is started\n** April 18: Fort Prince George is surrendered.\n** April: Fort Duquesne established by French.\n* 1755\n** July 9: French and Indian forces defeat the British Army.\n* 1758\n** September 14: The Battle of Fort Duquesne takes place\n** November 25: British take Fort Duquesne, rename it Pittsburgh (variously spelled).\n** December 19: Construction on Mercer's Fort begun\n* 1760\n** Population: 464.\n* 1761\n** April 14: Census counts 332 people\n* 1763\n** June 22: Siege of Fort Pitt begins\n** August 20: Siege of Fort Pitt ends\n* 1764\n** The Fort Pitt Blockhouse is completed.\n* 1768\n** November 5: Fort Pitt is annexed into Pennsylvania with the signing of the Treaty of Fort Stanwix.\n* 1786\n** Gazette newspaper begins publication.\n* 1787\n** Pittsburgh Academy established.\n* 1788\n** Allegheny County is created from parts of Westmoreland and Washington counties. Allegheny County Sheriff's Office is established.\n** Town of Allegheny is laid out north of Pittsburgh.\n** September 17: Treaty of Fort Pitt is signed.\n** Mechanical Society organized.\n* 1792\n** Fort Pitt is abandoned by the U.S. Army.\n** Fort Lafayette is established.\n* 1793\n** September 12: The Pittsburgh Bureau of Fire is established.\n* 1794\n** Pittsburgh is incorporated as a borough.\n** The Pittsburgh Night Watchmen, the predecessor to the Pittsburgh Police Department is established.\n** August 1: Rebellious militiamen and farmers march on the city during the Whiskey Rebellion\n* 1797\n** August 3: Fort Pitt is officially decommissioned by the army and is subsequently demolished.\n* 1798\n** Gilkison Bookstore and Circulating Library in business.\n* 1800\n** Population: 1,565.\n19th century\n1800s-1840s\n* 1803\n** Fort Lafayette serves as a staging base for the Lewis and Clark Expedition.\n** McClurg iron foundry in business.\n* 1810\n** Eagle Fire Company formed.\n** Population: 4,768.\n* 1811\n** Pittsburgh Engine Company in business.\n* 1812\n** Fort Lafayette serves as a supply base for Commodore Oliver Hazard Perry.\n* 1813\n** Pittsburgh Humane Society and Chemical and Physiological Society established.\n* 1814\n** Fort Lafayette is abandoned.\n** Pittsburgh Permanent Library Company established.\n* 1816\n** March 18: Pittsburgh borough is incorporated as a city.\n** Ebenezer Denny becomes mayor.\n* 1820\n** Population: 7,248.\n* 1825\n** Pittsburgh Apprentices' Library founded.\n* 1828\n** Town of Allegheny incorporated as a borough.\n** City water pumping system put into effect for the Allegheny River.\n* 1829\n** City wards created: East, North, South, West.\n** Western Division Canal in operation.\n* 1830\n** Population: 12,542.\n* 1831\n** Theban Literary Society organized.\n* 1832\n** African Education Society founded.\n** The Flood of 1832.\n** Cholera outbreak.\n* 1833\n** Pittsburg Theater built.\n* 1835\n** Board of Trade created.\n* 1838\n** Pittsburg Institute of Arts and Sciences incorporated.\n* 1840\n** Allegheny borough incorporated as a city.\n** Pittsburgh and Beaver Canal opens.\n* 1841\n** Courthouse built on Grant Street.\n** State Convention of Colored Freemen held in city.\n* 1842\n** Sitdown strike by iron workers.\n* 1843\n** Roman Catholic Diocese of Pittsburgh established.\n* 1844\n** Allegheny Cemetery established.\n* 1845\n** April 10: Fire.\n** Delany's The Mystery newspaper begins publication.\n* 1846\n** Uptown becomes part of city.\n** Pittsburgh Dispatch newspaper begins publication.\n** Odeon Hall opens.\n* 1847\n** Young Men's Mercantile Library & Mechanics Institute established.\n** The Catholic Sisters of Mercy establish Mercy Hospital, the first hospital in Pittsburgh\n* 1849\n** St. Mary Cemetery established.\n** Horne's in business.\n** Manufacture of \"Kier's Rock Oil\" begins.\n1850s–1890s\n* 1851\n** Duff's Mercantile College and German Library Association established.\n** St. Peter's Episcopal Church built.\n* 1852\n** Pennsylvania Railroad begins operating, linking the city with Philadelphia.\n* 1854\n** Cholera outbreak.\n* 1856\n** February: An informal National Republican convention is held in the city.\n* 1857\n** The Pittsburgh Police Department is established.\n* 1859\n** Lawrenceville-Pittsburgh railway begins operating.\n** The first Sixth Street Bridge is created by John Roebling.\n* 1860 – Population: 49,221.\n* 1861\n** Jones and Laughlin Steel Company in business.\n** Rodef Shalom Congregation built.\n** The Iron City Brewing Company is established.\n* 1862\n** The Allegheny Arsenal explosion.\n* 1865\n** Pittsburgh and Steubenville Railroad begins operating.\n* 1868\n** City expands to the east by annexing the borough of Lawrenceville and the townships of Pitt, Oakland, Collins, Liberty, and Peebles.\n* 1869\n** December 11: Pennsylvania Female College founded.\n** Westinghouse Air Brake Company in business.\n* 1870\n** May 28: The Monongahela Incline opens\n* 1872\n** South Side becomes part of city.\n** Trinity Cathedral built.\n* 1873\n** Duquesne Club founded.\n* 1875\n** Edgar Thomson Steel Works in business near city.\n* 1876\n** February 2: The city loses its bid for a professional baseball franchise in the newly established National League.\n** February 22: The Allegheny Base Ball Club, the Pittsburgh area's first professional baseball team, is established.\n** Chamber of Commerce established.\n** Point Bridge opens.\n* 1877\n** February 20: The International Association for Professional Base Ball Players is founded in Pittsburgh.\n** Railroad strike.\n** Duquesne Incline funicular begins operating.\n* 1878\n** June 8: The Pittsburgh Allegheny professional baseball club folds.\n** Pittsburgh Catholic College of the Holy Ghost opens.\n** Homewood Cemetery is established.\n* 1879\n** ''Zion's Watch Tower begins publication.\n** \"Old Residents of Pittsburgh and Western Penna.\" established.\n* 1881\n** November 15: Federation of Organized Trades and Labor Unions formed at Turner Hall.\n** Population: 156,381.\n* 1882\n** The Allegheny baseball team (the later-named Pittsburgh Pirates) is established and begins play in the American Association.\n** Historical Society of Pittsburg and Western Pa. formed.\n* 1883\n** Smithfield Street Bridge opens.\n* 1884\n** Evening Penny Press'' newspaper begins publication.\n** August 22: Baseball's Chicago Browns of the Union Association relocate to Pittsburgh and become the Pittsburgh Stogies.\n** September 18: The Union Association's Pittsburgh Stogies disband.\n* 1885\n** Kaufmann's department store in business.\n** The Winter Garden opens\n* 1886\n** September: Racial unrest.\n** Westinghouse Electric Company in business.\n** Calvary Catholic Cemetery founded.\n** The Allegheny County Jail is constructed.\n* 1887\n** Baseball's Pittsburgh Alleghenys leave the American Association for the National League.\n** The Pittsburgh Keystones, a Negro league baseball club, begins play in the League of Colored Baseball Clubs; however, the league and team fold within a week.\n* 1888\n** Pittsburgh Reduction Co. (later Alcoa) in business.\n** Allegheny County Courthouse rebuilt.\n** September: Allegheny County centennial.\n* 1889\n** Schenley Park is created\n* 1890\n** Major League Baseball's Pittsburgh Burghers represent the city in short-lived Players' League.\n** The third Exposition Park opens.\n** The Allegheny Athletic Association and the Pittsburgh Athletic Club field their first American football teams.\n** September 1: The first triple-header in Major League Baseball history is played between the Brooklyn Bridegrooms and the (later named) Pittsburgh Pirates.\n** October 11: The Western University of Pennsylvania football team (later Pittsburgh Panthers) plays its first-ever game.\n** Schenley Park established.\n** H.J. Heinz Company in business.\n** National Slavonic Society headquartered in city.\n** Duquesne Traction Company is built as a trolley barn.\n* 1891\n** The newly created United States Board on Geographic Names adopts \"Pittsburg\" as its standard spelling of the name of Pittsburgh.\n** Dravo shipbuilder in business.\n** The National League's Pittsburgh baseball club gains the then-unofficial nickname \"Pirates\".\n** Duquesne University first fields its American football team.\n* 1892\n** Carnegie Steel Company in business.\n** St. Stanislaus Kostka Church built.\n** The third Sixth Street Bridge is built by engineer Theodore Cooper for the Union Bridge Company.\n** July 6: Homestead Steel Strike takes place.\n** Young Women's Christian Association of Pittsburg and Allegheny founded.\n** November 12: Pudge Heffelfinger becomes the first professional American football player, as a member of the Allegheny Athletic Association, in a game against the Pittsburgh Athletic Club.\n* 1893\n** Children's Home of Pittsburgh established.\n** Ben \"Sport\" Donnelly of the Allegheny Athletic Association becomes the first professional American football coach.\n** Grant Dibert of the Pittsburg Athletic Club becomes the first American football player to sign and be kept under to the first known professional football contract.\n* 1894\n** Fifth Avenue High School built.\n* 1895\n** Carnegie Museums and Carnegie Library of Pittsburgh founded.\n** Pittsburgh Arts Society founded.\n** May 29: Schenley Park Casino opens\n** September: The Duquesne Country and Athletic Club football team is formed.\n** December 30: The very first ice hockey game is played inside the city, held at the Schenley Park Casino.\n* 1896\n** Carnegie Museum of Natural History is established.\n** Homestead Library & Athletic Club is established.\n** November 17: The Pittsburgh-based Western Pennsylvania Hockey League began its inaugural season.\n** December 17: Schenley Park Casino is destroyed by fire.\n** December 18: Western Pennsylvania Hockey League suspends operations for the remainder of the season. No championship is awarded.\n** The Duquesne Traction Company is renovated and opens as the Duquesne Gardens.\n* 1897\n** Immaculate Heart of Mary Church dedicated.\n** Station Square first opens as the Pittsburgh & Lake Erie Railroad Complex.\n* 1898\n** William Chase Temple becomes the first-ever owner of an American football team when he takes over the payments of the Duquesne Country and Athletic Club team.\n** Pittsburgh & Lake Erie Railroad Station built.\n** Pittsburgh Zoo opens on Tuesday, 14 June 1898.\n** Kennywood Park opens\n** December 3: The Duquesne Country and Athletic Club defeats the Western Pennsylvania All-Stars in the very first all-star game for professional American football.\n** The Western Pennsylvania Hockey League is re-established and use the Duquesne Gardens as their venue. The Pittsburgh Athletic Club goes on win the league's first title.\n* 1899\n** April 4: the Duquesne Brewing Company is established.\n** Pittsburgh Brewing Company formed.\n** Pittsburgh Bankers ice hockey team is established.\n* 1900\n** March: Pittsburgh Athletic Club wins their second title in the Western Pennsylvania Hockey League.\n** Carnegie Technical Schools established.\n** The Duquesne Country and Athletic Club football team folds.\n** Homestead Library & Athletic Club football team wins the professional American football championship.\n** Population: 321,616.\n20th century\n1900s-1940s\n* 1901\n** Pittsburgh Athletic Club wins their third title in the Western Pennsylvania Hockey League.\n** The Pittsburgh Pirates win their first National League title.\n** November 30:  The Homestead Library & Athletic Club football team wins the professional football championship.\n* 1902\n** January 1: The Pittsburgh Railways Company is established.\n** Ice hockey's Pittsburgh Victorias are established\n** The Pittsburgh Keystones win the Western Pennsylvania Hockey League title.\n** Harry Peel, of the Pittsburgh Keystones admits that he was paid $35 a week to play in the Western Pennsylvania Hockey League, becoming one of the first openly professional ice hockey players.\n** Pittsburgh Railways Company and Children's Institute of Pittsburgh established.\n** Frick Building constructed.\n** The Pittsburgh Pirates win their second National League title.\n** November 29: The Pittsburg Stars win the first National Football League's championship.\n* 1903\n** The Pittsburgh Bankers win their first Western Pennsylvania Hockey League title.\n** Union Station, Wabash Tunnel, and McCreery's department store open.\n** The Pittsburgh Pirates win their third National League title.\n** October 1–13: The first modern World Series is played between the Pittsburgh Pirates and the Boston Americans.\n* 1904\n** January 17: The Pittsburgh Keystones withdrew from the Western Pennsylvania Hockey League.\n** The Pittsburgh Victorias win the title for the Western Pennsylvania Hockey League.\n** Wabash Bridge built.\n** Wabash Railroad begins operating.\n** July 31: Construction begins on Immaculate Heart of Mary Church\n** Gayety Theater opens.\n** The Western Pennsylvania Hockey League ceases operations.\n** The Pittsburgh Victorias cease operations.\n** The Pittsburgh Professionals becomes the city's representative in the International Professional Hockey League.\n* 1905\n** Nickelodeon opens.\n** December 3: Immaculate Heart of Mary Church opens\n* 1906\n** Saint Paul Cathedral built.\n** G. C. Murphy variety shop in business.\n* 1907\n** Allegheny becomes part of Pittsburgh.\n** Frank & Seder in business.\n** The Western Pennsylvania Hockey League is re-established\n** The Pittsburgh Lyceum ice hockey team is established.\n** December: The first known trade of professional hockey players takes place as the Pittsburgh Lyceum sends Harry Burgoyne to the Pittsburgh Bankers for Dutch Koch.\n* 1908\n** The Pittsburgh Bankers win their second title in the Western Pennsylvania Hockey League.\n** Beechview becomes part of city.\n** Pittsburgh Athletic Association organized.\n** December 23: The Pittsburgh Lyceum ice hockey team folds.\n* 1909\n** February: The Duquesne Athletic Club wins the 1908–09 season title in the Western Pennsylvania Hockey League, as the team and the league formally fold.\n** July–September: Pressed Steel Car Strike of 1909.\n** Pittsburgh Aero Club founded.\n** June 30: Forbes Field opens\n** October 16: Pittsburgh Pirates win the 1909 World Series\n* 1910\n** Economic Club of Pittsburgh active.\n** Soldiers and Sailors Memorial Hall dedicated.\n** May 10: The Pittsburgh Courier begins publication\n* 1911\n** Pittsburgh Public School District formed.\n** The Syria Mosque is constructed\n** July 19: the United States Geographic Board adopts \"Pittsburgh\" as its standard spelling of the city name, reversing its 20-year-old decision favoring  \"Pittsburg\".\n* 1912\n** Homestead Grays, a Negro league baseball team is formed.\n** The Pittsburgh Filipinos of the United States Baseball League were founded.\n* 1913\n** The  Pittsburgh Filipinos move to the Federal League and become the Pittsburgh Stogies.\n** April: Schoolchildren's protest.\n** Concordia Club building opens.\n* 1914\n** Regent Theatre opens.\n** Pittsburgh Stogies are renamed Pittsburgh Rebels.\n* 1915\n** The Pittsburgh Yellow Jackets are founded by Roy Schooley.\n** The Pittsburgh Rebels fold with the Federal League.\n** National Association for the Advancement of Colored People branch and Pittsburgh Musical Institute established.\n** July 5: Construction begins on the Pittsburgh City-County Building.\n** The Pittsburgh Panthers football team claim their first national championship.\n* 1916\n** William Penn Hotel in business.\n** The Pittsburgh Winter Garden begins hosting ice skating and ice hockey.\n** The Pittsburgh Panthers football team claim their second national championship.\n** October 26: The Syria Mosque opens.\n* 1917\n** Union Trust Building and Pittsburgh City-County Building open.\n** December: The Pittsburgh City-County Building is completed.\n* 1918\n** May 31: Czecho-Slovakia Agreement signed in Moose Hall.\n** The Pittsburgh Panthers football team claims its third national championship.\n* 1920\n** KDKA (AM) radio begins broadcasting.\n** October 2: The final triple-header in Major League Baseball history is played at Forbes Field.\n* 1921\n** Robert Morris University is established.\n** The Pittsburgh Keystones, a Negro league baseball team is revised and begins play.\n** American football's J.P. Rooneys, the forerunners to the modern-day Pittsburgh Steelers, are established as \"Hope-Harvey\" by Art Rooney.\n** August 8: The first part of the Boulevard of the Allies is dedicated.\n* 1922\n** The Negro league baseball's Pittsburgh Keystones cease operations.\n* 1923\n** The entire Boulevard of the Allies opened to traffic\n** Centre Avenue YMCA opens.\n* 1924\n** Liberty Tunnel and 40th Street Bridge open.\n* 1925\n** September 1: Pitt Stadium opens.\n** October 15: Pittsburgh Pirates win the 1925 World Series\n** Pittsburgh Pirates become the city's first club in the National Hockey League\n* 1926\n** University of Pittsburgh's Cathedral of Learning built.\n* 1927\n** Frick Park Loew's Penn Theater, and Point Bridge open.\n** The Pittsburgh Post-Gazette and Pittsburgh Sun-Telegraph are formed from four pre-existing newspapers.\n** Pittsburgh Symphony Society established.\n** The Sixth Street Bridge is demolished and rebuilt.\n** Pittsburgh Central Catholic High School opens.\n** November 14: Gas explosion.\n* 1928\n** February 27: The Benedum Center opens\n** Liberty Bridge opens.\n** Josh Gibson Field opens as Ammon Field.\n* 1929\n** Amateur Astronomers Association of Pittsburgh founded.\n** Koppers Tower built.\n** The Pittsburgh Panthers football team claim their fourth national championship.\n* 1930\n** Grant Building constructed.\n** March 18: Pittsburgh Pirates play their last hockey game.\n** July 18: The Homestead Grays and the Kansas City Monarchs play the first night baseball game in the city at Forbes Field.\n** The Pittsburgh Yellow Jackets are re-established\n** The first Crawford Grill is established.\n* 1931\n** Allegheny County Airport dedicated.\n** Federal Reserve Bank of Cleveland Pittsburgh Branch built.\n** Pittsburgh Crawfords, a Negro league baseball team is formed.\n** The Pittsburgh Panthers football team claim their fifth national championship.\n* 1932\n** January 13: In college basketball, the City Game is first played between Duquesne Dukes and the Pittsburgh Panthers\n** Allegheny County Police Department is established\n** Gulf Tower and West End Bridge built.\n** April 29: Greenlee Field opens\n* 1933\n** July 8: Pittsburgh Pirates football team is formed from members of the J.P. Rooneys and becomes as a member of the National Football League.\n** Primanti Brothers is established in the city's Strip District.\n** November 6: Pittsburgh mayoral election, 1933 held.\n** South Tenth Street Bridge opens.\n* 1934\n** United States Post Office and Courthouse built.\n** The Pittsburgh Panthers football team claim their sixth national championship.\n* 1935\n** The Monongahela Incline undergoes electrification.\n** May 25: Babe Ruth hits the final three home runs of his career as the Boston Braves lost to the Pirates, 11–7. His last home run cleared the right field stands roofline of Forbes Field, making him the first player to ever do so.\n** September 8: The Pittsburgh Shamrocks of the International Hockey League are established\n** The Pittsburgh Crawfords win their first Negro National League title\n* 1936\n** March: Flood.\n** The Detroit Olympics move to Pittsburgh becoming the Pittsburgh Hornets of the American Hockey League.\n** The  Pittsburgh Americans of the second American Football League is formed.\n** The Pittsburgh Crawfords win their second Negro National League title.\n** November 3: The  Pittsburgh Shamrocks of the International Hockey League end their operations.\n** The Pittsburgh Panthers football team claim their seventh national championship.\n** Dapper Dan Charities is founded by Pittsburgh Post-Gazette editor Al Abrams.\n* 1937\n** Ohio River flood of 1937.\n** The Pittsburgh Yellow Jackets fold for the final time.\n** October 22: The Pittsburgh Americans football franchise folds\n** November 20: The Homestead High-Level Bridge opens.\n** The Pittsburgh Panthers football team claim their eighth national championship.\n* 1938\n** The Pittsburgh Crawfords are sold and relocated to Toledo.\n** Greenlee Field is demolished.\n* 1939\n** The Dapper Dan Award is established.\n* 1940\n** American football's Pittsburgh Pirates are renamed the Pittsburgh Steelers.\n* 1941\n** Music Hall of the Winter Garden at Exposition Hall is demolished to secure scrap metal for the war effort during World War II.\n* 1942\n** United Steelworkers headquartered in city.\n** Machinery Hall of the Winter Garden at Exposition Hall is demolished to secure scrap metal for the war effort during World War II.\n* 1943\n** August: Due to manning shortages related to World War II, the Pittsburgh Steelers merge with the Philadelphia Eagles for the 1943 NFL season.\n** October 5: Homestead Grays win the 1943 Negro World Series baseball contest.\n** Crawford Grill number 2, opens on the corner of Wylie Avenue and Elmore Street\n* 1944\n** Allegheny Conference on Community Development established.\n** July 11: The 12th Major League Baseball All-Star Game is held at Forbes Field.\n** August 15: Due to manning shortages related to World War II, the Pittsburgh Steelers merge with the Chicago Cardinals for the 1944 NFL season.\n** September 24: Homestead Grays win the 1944 Negro World Series baseball contest.\n* 1945\n** Pittsburgh Youth Symphony Orchestra and Pittsburgh Foundation established.\n** Arts and Craft Center opens in Shadyside.\n* 1946\n** Power strike.\n** The Pittsburgh Ironmen of the Basketball Association of America (a forerunner of the National Basketball Association) begin play.\n** Pittsburgh Civic Light Opera established.\n* 1947\n**September 9: The Island Queen is destroyed in an explosion, killing 19, while docked in the Monongahela River.\n** The Pittsburgh Ironmen cease operations.\n* 1948\n** October 5: Homestead Grays win the 1948 Negro World Series.\n** Crawford Grill number 3, located on the corner of Bidwell Street and Pennsylvania Avenue, is established.\n1950s-1990s\n* 1950\n** Population: 676,806.\n* 1951\n** July 2: The Main Hall of the Winter Garden at Exposition Hall is demolished.\n** The first Crawford Grill is destroyed in a fire.\n** December 15: The Fitzgerald Field House opens on the University of Pittsburgh campus.\n(Spheniscus demersus) at the Penguin Point exhibit.  National Aviary (Pittsburgh Aviary-Conservatory)]]\n* 1952\n** The Pittsburgh Hornets won their first F. G. \"Teddy\" Oke Trophy, and their first Calder Cup.\n** Greater Pittsburgh Airport opens.\n** Pittsburgh Aviary-Conservatory built.\n* 1953\n** Pittsburgh Photographic Library created.\n** Alcoa Building constructed.\n* 1955\n** Mellon Square laid out.\n** The Pittsburgh Hornets win their second F. G. \"Teddy\" Oke Trophy and Calder Cup.\n** Crawford Grill number 3, located on the corner of Bidwell Street and Pennsylvania Avenue, formally closes.\n* 1956\n** January 10: The 3rd AHL All-Star Game is held at the Duquesne Gardens.\n** The Pittsburgh Hornets relocate to Rochester, New York, becoming the Rochester Americans.\n** Duquesne Gardens is demolished\n* 1957\n** Grant Street Station opens.\n** 26th Major League Baseball All-Star Game is played at Forbes Field.\n** August 28: Work begins on the Fort Pitt Tunnel\n** December 18: Shippingport Atomic Power Station commissioned near city.\n* 1958\n** WTAE-TV begins broadcasting.\n** March 12: Pittsburgh Civic Arena opens\n** The Gateway Clipper Fleet begins operations\n* 1959\n** June: WRRK first broadcasts, as WLOA-FM.\n** June 19: The Fort Pitt Bridge opens.\n** Three Rivers Arts Festival begins.\n** Pittsburgh Theological Seminary formed.\n* 1960\n** Point Park College opens\n** September 1: Fort Pitt Tunnel opens.\n** October 13: Pittsburgh Pirates win 1960 World Series baseball contest.\n** Original Hot Dog shop in business.\n* 1961\n** A second incarnation of the Pittsburgh Hornets is established for play in the American Hockey League.\n* 1962\n** May 10:  WDVE first airs, as KQV-FM.\n** Winky's restaurant in business.\n** The Pittsburgh Jewish Chronicle begins publication.\n* 1963\n** Eparchy of Pittsburgh of the Ruthenians active.\n* 1964\n** Port Authority of Allegheny County, Pittsburgh History and Landmarks Foundation, and Pittsburgh Stadium Authority established.\n* 1965\n** March 26: First Roundball Classic is played.\n* 1966\n** September: Community College of Allegheny County and Glenwood Bridge open.\n** October 22: The Pittsburgh Courier ceases publication.\n* 1967\n** On April 30: The Pittsburgh Hornets of the American Hockey League win their final Calder Cup and are soon afterwards disbanded.\n** June: Westinghouse Sign entered operation.\n** The Pittsburgh Penguins, the city's second team to play in the National Hockey League is formed.\n** The Pittsburgh Pipers of the American Basketball Association are formed as a charter franchise for the league.\n** Fiesta Theatre opens.\n* 1968\n** The Pittsburgh Pipers win the 1968 American Basketball Association title.\n** The Pittsburgh Pipers relocate to Minnesota, becoming the Minnesota Pipers.\n** February 19: Locally produced and nationally aired children's program ''Mister Rogers' Neighborhood premiers.\n* 1969\n** October 17: Fort Duquesne Bridge opens.\n** The Pittsburgh Pipers re-locate back to Pittsburgh\n* 1970\n** The Pittsburgh Pipers of the American Basketball Association  are renamed the Pittsburgh Condors.\n** Three Rivers Stadium opens.\n** U.S. Steel Tower built.\n** Population: 540,025.\n* 1971\n** October 17: Pittsburgh Pirates win 1971 World Series baseball contest.\n* 1972\n** June 1972: The American Basketball Association cancels the Pittsburgh Condors franchise.\n** The Duquesne Brewing Company is dissolved\n* 1974\n** The Pittsburgh Triangles are established and begin play in World TeamTennis.\n** July 23: 45th Major League Baseball All-Star Game is held at Three Rivers Stadium.\n** August: Point State Park opens\n* 1975\n** January 12: Pittsburgh Steelers win Super Bowl IX\n** February 1: PATrain Commuter Rail Service Begins.\n** The Pittsburgh Triangles win the World TeamTennis Championship\n** The Bulletin'' newspaper founded.\n* 1976\n** January 18: Pittsburgh Steelers win Super Bowl X\n** Dance Alloy troupe formed.\n** The Pittsburgh Panthers football team claim their ninth national championship.\n* 1977\n** Pittsburgh Triangles of World TeamTennis formally fold, as the Pennsylvania Keystones.\n** Mattress Factory (art gallery) founded.\n** Birmingham Bridge and East End Food Co-op open.\n** Sri Venkateswara Temple consecrated near city.\n** Pittsburgh Three Rivers Regatta begins.\n* 1979\n** January 21: January 18: Pittsburgh Steelers win Super Bowl XIII\n** Pamela's Diner in business.\n** The Pittsburgh Colts, a minor league professional football team, is established.\n** October 17: Pittsburgh Pirates win 1979 World Series baseball contest.\n* 1980\n** Pittsburgh Community Food Bank opens.\n** Population: 423,938.\n* 1981\n** William J. Coyne becomes Pennsylvania's 14th congressional district representative.\n** February 7: David L. Lawrence Convention Center built.\n* 1982\n** Three Rivers Film Festival begins.\n** Federated Tower built.\n** Soar (cognitive architecture) developed at Carnegie Mellon University.\n* 1983\n** March 7: The Pittsburgh Maulers of the United States Football League are founded\n**March 7: Petromark Industrial Plant Explosion In McKees Rocks (one person dead)\n** September 3: The inaugural Pittsburgh Vintage Grand Prix\n** Children's Museum of Pittsburgh established.\n** One Mellon Center and Oxford Centre built.\n* 1984\n** Pittsburgh Light Rail begins operating.\n** PPG Place dedicated.\n** Pittsburgh Cultural Trust formed.\n** October 26: The Pittsburgh Maulers of the United States Football League fold their operations\n* 1985\n** Pittsburgh Marathon and Pittsburgh Great Race begin.\n** September: Pittsburgh drug trials take place.\n* 1986\n** Penn Brewery in business.\n** April 13: Root Sports Pittsburgh first airs as the Pirates Cable Network and later KBL\n* 1987\n** June 19: The Pittsburgh Gladiators of the Arena Football League begin play.\n** August 1: The city hosts ArenaBowl I, the Pittsburgh Gladiators are defeated in the game, 45–16, by the Denver Dynamite.\n** September 25: The Benedum Center is restored.\n** Head of the Ohio regatta begins.\n** The Veterans Bridge opens.\n* 1988\n** May 6: Mayor Richard Caliguiri dies in office. Sophie Masloff becomes mayor.\n** November 11: The A.J. Palumbo Center opens\n* 1989\n** May 31: The Trib Total Media Amphitheatre first opens as the Melody Amphitheatre.\n** Sandcastle Waterpark opens\n** Pittsburgh mayoral election\n* 1990\n** January 21: The 41st National Hockey League All-Star Game is held at the Pittsburgh Civic Arena.\n** February 21: The  is transferred as an exhibit for the Carnegie Science Center.\n** Frick's Clayton house museum opens.\n** Population: 369,879.\n* 1991\n** Carnegie Science Center opens.\n** The Pittsburgh Gladiators relocate to Tampa, Florida, becoming the Tampa Bay Storm.\n** May 25: Pittsburgh Penguins win Stanley Cup.\n** August 27: The Syria Mosque is demolished\n* 1992\n** Transit strike.\n** Newspaper strike.\n** May 17: The Pittsburgh Press ceases operations as a print newspaper.\n** June 1: Pittsburgh Penguins win their second Stanley Cup.\n** The Greensburg Tribune-Review begins circulation into the Pittsburgh metro area, becoming the Pittsburgh Tribune-Review.\n* 1993\n** Wood Street Galleries open.\n** June 1993: Arthur J. Rooney Athletic Field opens\n* 1994\n** April: Final Roundball Classic is played in Pittsburgh.\n** The Pittsburgh Phantoms are established a play one season in Roller Hockey International before ceasing operations.\n** July 11: Major League Baseball Home Run Derby is held at Three Rivers Stadium.\n** July 12: 65th Major League Baseball All-Star Game is held at Three Rivers Stadium.\n** The Pittsburgh Piranhas begin play in the Continental Basketball Association\n** Andy Warhol Museum opens.\n** Thomas J. Murphy, Jr. becomes mayor.\n* 1995\n** The Pittsburgh Piranhas of the Continental Basketball Association folds.\n]]\n* 1996\n** January 28: The Dallas Cowboys defeat the Pittsburgh Steelers in Super Bowl XXX.\n** Heinz History Center opens.\n** Pittsburgh Parks Conservancy organized.\n* 1997\n** June 21: The 1997 NHL Entry Draft is held at the Pittsburgh Civic Arena.\n* 1998\n** City website online (approximate date).\n** Sustainable Pittsburgh established.\n** August 6: The Sixth Street Bridge is renamed the Roberto Clemente Bridge.\n** Fall: Westinghouse Sign demolished.\n* 1999\n** The Pittsburgh Riverhounds are established\n** December: Pitt Stadium is demolished.\n* 2000\n** UPMC Sports Performance Complex built.\n** Population: 334,563.\n21st century\n* 2001\n** February 11: Three Rivers Stadium is demolished\n** March 31: PNC Park opens.\n** August 18: Heinz Field opens.\n** August 31: Final episode of locally produced and nationally aired children's program, ''Mister Rogers' Neighborhood'' airs.\n** November 6: Pittsburgh mayoral election, 2001 held.\n* 2002\n** SouthSide Works opens.\n** Crawford Grill number 2, located on the corner of Wylie Avenue and Elmore Street, formally closes.\n** July 11: Homestead High-Level Bridge was renamed the Homestead Grays Bridge.\n** The Pittsburgh Passion, which is part of the Women's Football Alliance, is founded.\n* 2003\n** Tekkoshocon anime convention begins.\n* 2004\n** Pittsburgh Intergovernmental Cooperation Authority formed.\n* 2005\n** March 18: The Seventh Street Bridge is renamed the Andy Warhol Bridge.\n** I Heart PGH blog begins publication.\n** September 17: Joe Walton Stadium opens\n** November 8: Pittsburgh mayoral election, 2005 held.\n* 2006\n** February 6: The Pittsburgh Steelers win Super Bowl XL.\n** April 22: The Ninth Street Bridge is renamed the Rachel Carson Bridge.\n** July 9: All-Star Futures Game and the Taco Bell All-Star Legends and Celebrity Softball Game are played at PNC Park.\n** July 10: 2006 Major League Baseball Home Run Derby held at PNC Park\n** July 11: 77th Major League Baseball All-Star Game is held at PNC Park.\n** Carnegie Mellon University's Remaking Cities Institute established.\n** Bob O'Connor becomes mayor, succeeded by Luke Ravenstahl.\n** Anthrocon furry convention relocates to Pittsburgh.\n* 2007\n** November 6: Pittsburgh mayoral special election, 2007 held.\n* 2008\n** January 1: Pittsburgh Penguins win the first-ever NHL Winter Classic.\n** June 6: The Stanley Cup is first awarded in the city, at Mellon Arena, as the Detroit Red Wings defeat the Pittsburgh Penguins in the Stanley Cup Finals, 4 games to 2.\n** Duquesne Brewing Company is resurrected\n** Pittsburgh Riverhounds, a professional soccer team, begins play as a member of the USL's A-League\n* 2009\n** February 1: Pittsburgh Steelers win Super Bowl XLIII football contest.\n** April 4: 2009 shooting of Pittsburgh police officers.\n** April 11: Tea Party demonstration.\n** June 12: The Pittsburgh Penguins win their third Stanley Cup.\n** July: Iron City Brewing Company relocates most of its operations to Latrobe, Pennsylvania.\n** August 9: The Rivers Casino opens.\n** September: G-20 Summit on Financial Markets and the World Economy held.\n** HackPittsburgh workshop founded.\n* 2010\n** Bakery Square development and Consol Energy Center (arena) opens.\n** December: Stage AE opens\n** Population: 307,484.\n* 2011\n** January 1: The 2011 Winter Classic is held at Heinz Field.\n** February 6: The Green Bay Packers defeat the Pittsburgh Steelers, 31–25, in Super Bowl XLV.\n** Pittsburgh Power of the Arena Football League is established.\n** September 26: Pittsburgh Civic Arena is demolished.\n** November 14: The Pittsburgh Press is resurrected as an online newspaper by Block Communications.\n* 2012\n** Wigle Whiskey distillery in business.\n** March 23: North Shore Connector opens.\n** June 22–23: The 2012 NHL Entry Draft is held at the Consol Energy Center.\n** December 27–28: First Three Rivers Classic is played.\n* 2013\n** April 11–13: The 2013 Men's Frozen Four is held at Consol Energy Center.\n** April 13: Highmark Stadium opens\n** November 5: Pittsburgh mayoral election, 2013 held.\n* 2014\n** January 6: Bill Peduto becomes mayor, succeeding Luke Ravenstahl.\n** November 17: The Pittsburgh Power of the Arena Football League folds.\n* 2016\n** June 12: The Pittsburgh Penguins win their fourth Stanley Cup.\n* 2017\n** February 25: The 2017 NHL Stadium Series (sport event) is held at Heinz Field.\n** June 11: The Pittsburgh Penguins win their fifth Stanley Cup.\n* 2018\n** October 27: Pittsburgh synagogue shooting\n* 2022\n** January 3: Ed Gainey becomes mayor, the first African-American to be elected to the office\n** January 28: The Fern Hollow Bridge in Frick Park collapses, with some minor injuries but no fatalities, ahead of a visit by President Joseph Biden, who visits the site and pledges to repair any of the nation's bridges needing renovation.\nSee also\n* History of Pittsburgh\n* List of mayors of Pittsburgh\n* List of City of Pittsburgh historic designations\n*Timeline of women's suffrage in Pennsylvania\n;other cities in Pennsylvania\n* Timeline of Philadelphia\nReferences\nBibliography\nPublished in the 19th century\n1800s-1840s\n*\n*\n*\n*\n*\n**\n**\n** [https://archive.org/stream/harrissgeneralbu00harr#page/n5/mode/2up 1847 ed.]\n1850s-1890s\n*\n*\n**\n*\n*\n*\n*\n|author-link=George Henry Townsend }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n}}\n*\nPublished in the 20th century\n1900s-1940s\n*\n*\n*\n*\n}}\n*\n}}\n*\n*\n*\n|ol=6666128M }}\n*\n*\n**\n**\n**\n**\n**\n*\n*\n*\n*\n|ol=6587215M }}\n*\n*\n*\n*\n** [https://books.google.com/books?id=YaQUAAAAYAAJ v.2]\n*\n*\n1950s-1990s\n* Lubove, Roy, ed.  Pittsburgh 1976. 294 pp. short excerpts covering main themes\n*\n*\n*\nPublished in the 21st century\n*\n*  ([https://web.archive.org/web/20160310002430/http://www.theatlantic.com/national/category/pittsburgh-pa/ series] of articles about Pittsburgh), 2014-\nExternal links\n*\n* [http://dp.la/search?utf8=✓&page_size=100&q=(pittsburg%20OR%20pittsburgh Items related to Pittsburgh], various dates (via Digital Public Library of America)\n*\n*  (fulltext, various dates)\n*\n*"
    }
  ]
}