{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of events in Hamilton, Ontario\n\nBelow is a timeline of events in Hamilton, Ontario, Canada.\n, 1786]]\nBefore 1800\n* According to all records from local historians, this district was inhabited by the Neutral Indians who called it ATTIWANDARONIA.\n* 1616 – Like most of the Americas south of the tree line, the original inhabitants of the Hamilton area were Indigenous peoples. The first European to visit what is now Hamilton was probably Étienne Brûlé in 1616. Lasalle also visited the area, a fact commemorated at a park in nearby Burlington.\n* 1650 – The Iroquois Indians fought the Neutrals in a great battle on the foot of present-day Emerald Street. This area was the end of an old Indian trail that led to the Dundas Valley. The Iroquois landed from canoes and won the battle because they had obtained guns from the Dutch, and the Neutrals refused to trade with the whites. So many Neutrals were slain that the mound where they were buried could still be seen after 250 years (1900).\n* 1780 – About the year that both Robert Land and Richard Beasley arrived.\n* 1784 – About 10,000 United Empire Loyalists are settled in what is now southern Ontario, chiefly in Niagara, around the Bay of Quinte, and along the St. Lawrence River between Lake Ontario and Montreal. They are soon followed by many more Americans, some of them not so much ardent loyalists but attracted nonetheless by the availability of cheap, arable land. At the same time large numbers of Iroquois loyal to Britain arrive from the United States and are settled on reserves west of Lake Ontario. Kingston and Hamilton became important settlements as a result of the influx of Loyalists.\n* 1788 – (1788–1793) The townships at the Head-of-the-Lake were surveyed and named. The area was first known as The Head-of-the-Lake for its location at the western end of Lake Ontario.\n* 1790 – Richard Beasley occupied Burlington Heights (now the site of Dundurn and Harvey Parks) in 1790 & was granted land by the Crown in 1799. A local entrepreneur, Beasley's business ventures included fur trading, land acquisition and establishment of a grist mill in Ancaster. He was a member of the legislative assembly of Upper Canada from 1791 to 1804 and was appointed colonel of the 2nd regiment of the York militia in 1809. Financial difficulties forced Beasley to sell lands at Burlington Heights, but it was purchased in 1832 by Sir Allan Napier MacNab who built Dundurn Castle on the foundations of Beasley's brick home.\n* 1791 – Barton township established originally in Lincoln township. Eventually becomes part of Wentworth County in 1816.\n* 1791 – a total of 31 families are recorded  as having settled at the Head-of-the-Lake (present day Hamilton).\n* 1791 – Like British North America itself, the Six Nations confederacy was torn apart by the American Revolution. Indians loyal to the Crown, under their leader Captain Joseph Brant, were settled in several nearby areas of what became Upper Canada in 1791 and ultimately Ontario in 1867.\n* 1792 – Administratively, the whole area was part of the Nassau District, which was renamed the Home District in 1792. Additionally, parts of the area were separately incorporated into the West Riding of York County and First Riding of Lincoln County. In 1798, most of the future Hamilton became part of Niagara District while remaining in Lincoln County.\n* 1795 – First lodge of Free Masons, Barton Lodge. (November 20)\n1800–1829\n* 1801 – Concession 2 lot 14, Barton Township was part of the original Crown Grant to John Askin on July 10, 1801. He sold to Nathaniel Hughson senior who sold to James Durand around 1806.\n* 1801 – First log court house.\n* 1801 – First documented murder case in Hamilton. The victim's name was Bartholomew London. The murderer became the first woman ever hung in Ontario.\n* 1803 – John Ryckman, born in Barton township, described the area in 1803 as he remembered it: \"The city in 1803 was all forest. The shores of the bay were difficult to reach or see because they were hidden by a thick, almost impenetrable mass of trees and undergrowth...Bears ate pigs, so settlers warred on bears. Wolves gobbled sheep and geese, so they hunted and trapped wolves. They also held organized raids on rattlesnakes on the mountainside. There was plenty of game. Many a time have I seen a deer jump the fence into my back yard, and there were millions of pigeons which we clubbed as they flew low.\"\n* 1809 – Talk of creating a townsite at what is now the intersection of John and Main Streets arose as early as 1809, but the war delayed the scheme until 1816 when George Hamilton and Nathaniel Hughson successfully promoted Hamilton as the judicial centre for the counties of Halton and Wentworth (the Gore District).\n* 1812 – The town of Hamilton was conceived by George Hamilton when he purchased the Durand farm shortly after the War of 1812.\n* 1813 –  Two American schooners, the Hamilton and the Scourge, capsized in Lake Ontario in 1813.\n* 1813 – June 5–6 – British win Battle of Stoney Creek.\n* 1813 – Eleven men hanged for treason right across the street from where Dundurn Castle eventually is built.\n* 1813 – Hamilton laid out as a village.\n* 1814 – Wm. Sheldon opened the first store at the corner of King Street and John Street.\n* 1815 – A chopping mill is the first industry in Hamilton, Ontario.\n* 1815 – George Hamilton, a settler and local politician, established a town site in the northern portion Barton Township after the war in 1815. He kept several east–west roads which were originally Indian trails, but the north–south streets were on a regular grid pattern. Streets were designated \"East\" or \"West\" if they crossed James Street or Highway 6. Streets were designated \"North\" or \"South\" if they crossed King Street or Highway 8.\n* 1816 – Barton township population is 668.\n* 1816 – Hamilton becomes a village.\n* 1817 – Barton township population is 800.\n* 1817 – First common school on land now occupied by city. It was on King Street, east of Wellington Street.\n* 1821 – First Hamilton School opened. A private school with John Law as master.\n* 1824 – First Methodist church, Now First United.\n* 1827 – Growth was aided in 1827 by a channel cut to link Burlington Bay directly with Lake Ontario, thus improving its marine transportation.\n* 1829 – First newspaper, Gore Balance, published by Bartimus Ferguson.\n1830–1839\n* 1830 – Last man to stand in pillory.\n* 1832 – First bound book, ''Samuel Thomson's New Guide to Health'' published by Smith and Hackstaff.\n* 1832 – Cholera swept the city.\n* 1833 – George Hamilton's settlement was incorporated as a police village in 1833. On January 8, 1833, the Legislature passed a further act \"To define the limits of the Town of Hamilton, in the District of Gore, and to establish a police station and public market therein.\"\n* 1833 – When the Town of Hamilton was incorporated in 1833, one of the first orders of business, after a closely fought election where 3 out of the 4 candidates had no opposition, was to find a suitable place for the town board to meet.  For the first few years they made do with meeting in local taverns such as Thomas Wilson's inn on the corner of John and Jackson Streets.\n* 1833 – The Garland, a local newspaper, publishes a synopsis, Hamilton contained \"about one hundred and twenty dwelling houses and upwards of one thousand inhabitants\" and then went on to list 4 public buildings, 7 taverns, 16 stores, 2 watchmakers, 2 saddlers, 4 merchant tailors, 4 cabinet makers, 4 boot and shoe makers, 2 bakers, 4 newspapers, 1 druggist, 1 tin and sheet iron manufactory, 1 hatter and 3 millineries. (February 16, 1833)\n* 1834 – Beach Canal opens and population now at 2000.\n* 1835 – James Street was the Lake Road and in 1835, James Street was extended south, but was interrupted by a bog at Hunter Street which eventually (1844) was drained out and graded.\n* 1835 – Sir Allan MacNab completed Dundurn Castle, his stately home, in 1835.\n* 1835 – Hamilton's first Bank was the Gore Bank of Hamilton. Chartered in 1835 and opened on Monday May 2, 1836.\n* 1835 – One of Hamilton's early newspapers is published by George Perkins Boothesby Bull; The Hamilton Gazette, and General Advertiser. Newspaper lasts until 1856.\n* 1836 – George Hamilton, the city's founder, died on February 20, 1836. His body was buried at the family burial plot on the family's own farm. It is now part of Mountain Side Park. The monument (tombstone) at the Hamilton cemetery wasn't put there until 1894. (George Hamilton's body was not buried at the Hamilton cemetery).\n* 1836 – Hamilton's growth continues. City's boundaries now include The Bay to the north, The mountain (Niagara Escarpment) to the south, Queen Street to the west and Wellington Street to the east.\n* 1836 – Hamilton Waterworks Company incorporated.\n* 1837 – Sir Allan MacNab, a boy soldier in the War of 1812, he led Gore militia to crush insurgents in the Rebellion of 1837 for which he was knighted the following year.\n* 1838 – Sir Allan MacNab, is knighted.\n* 1838 – St. Mary's Roman Catholic Church  on Park Street is completed.\n1840–1849\n* 1842 – First municipal council. The first elections are held and 26 people are chosen to represent the townships of Gore.\n* 1843 – First city owned fire engines.\n* 1846 – Hamilton received its city charter in June-9, 1846 by an act of Parliament, 9 Victoria Chapter 73. 3 newspapers, 2 lending libraries, 3 bookstores, 5 common schools, all rented; 2 boys' schools, 3 ladies' seminaries.\n* 1846 – The first telegraph wire in Canada is strung between Hamilton and Toronto in December 1846.\n* 1846 – The Hamilton Spectator newspaper is born. (still going strong today).\n* 1847 – Colin Campbell Ferrie becomes Hamilton's first mayor.\n* 1847 – Hugh Cossart Baker Sr. establishes the first life insurance company in Canada (21 August 1847); the Canada Life Assurance Company, with Baker as its president, manager and actuary. (Father of Hamilton telephone pioneer; Hugh Cossart Baker Jr.)\n* 1848 – King and James Streets macadamized.\n* 1849 – 92 deaths recorded from cholera.\n* 1849 – Sir William Osler, \"Father of Modern Medicine\" (born: July 12, 1849). Raised largely in Dundas, Ontario.\n1850–1859\n* 1850 – First lighting of streets by gas.\n* 1851 – First land bought by the Board of Education.\n* 1852 – First orphanage asylum. Population now at 10,300.\n* 1853 – First union-journeymen carpenters formed a union and went on strike. First street numbers on buildings.\n* 1854 – the newly renamed Great Western Railway (Ontario) became Hamilton's first functioning railway in 1854. Completion of this railway and the Niagara Suspension Bridge transforms Hamilton into a major centre and part of the American immigration route from New York City or Boston to Chicago or Milwaukee.\n* 1854 – September 11, Sir Allan Napier MacNab becomes the Premier of Canada West, the only Prime Minister of Canada that Hamilton has ever produced. (The Joint Premiers of the Province of Canada, who were the heads of government of the Province of Canada from the 1841 unification of Upper Canada and Lower Canada until Confederation in 1867. Each administration was led by two men, one from Canada West (now Ontario) and one from Canada East (now Quebec). Officially, one of them at any given time had the title of Premier while the other had the title of deputy.\n* 1854 – Cholera epidemic – more than 600 deaths.\n* 1855 – Hamilton's core boasted a sewer system, graded streets and planked sidewalks. Stumps, boulders, and rocks were finally removed from the streets, animals were banned from wandering freely on the new thoroughfares.\n* 1855 – Grand Lodge of Canada is formed in Hamilton, Ontario (10 November 1855). The National Office of the Supreme Council 33° of the Ancient and Accepted Scottish Rite of Freemasonry of Canada whose Grand Orient is in Hamilton, Ontario, is located adjacent to this historic Scottish Rite building.\n* 1856 – First use of chloroform in Hamilton.\n* 1856 – Daniel C. Gunn engine shop on Wellington Street North, Hamilton, Ontario, produces first Canadian-built locomotives.\n* 1857 – Desjardins Canal disaster – 57 passengers were killed when a train derailed near the Desjardins Canal.\n* 1857 – When the Great Western railroad made the present opening for the Desjardins Canal, the bones of a mammoth were found.\n* 1858 – The Hamilton Times newspaper begins publishing 9 January 1858. The newspaper lasts until 1920.\n* 1858 – Last man imprisoned here for debt.\n* 1859 – Mayor elected by the people. Henry McKinstry first elected mayor.\n* 1859 – Last public execution.\n1860–1869\n* 1860 – First tap water in the city.\n* 1860 – The Crystal Palace opened up at Victoria Park 20 September 1860. It was home to the area's largest fall fair for many years. The local Hamilton Herald newspaper was quoted as saying on 22 September 1890, \"The Carnival of Venice, The Paris Exposition or the World's Fair in Chicago will be nowhere tomorrow when the great Central Fair is opened at the Crystal Palace Grounds in this city.\" The structure was demolished in 1891.\n* 1860 – First railway sleeping car built in Hamilton.\n* 1862 – The city had invested in the Great Western Railway (Ontario) but the government of Canada favoured the rival Grand Trunk Railway. Also the end of the Depression (1857–1862) and population dips downwards in Hamilton and the city could not meet the interest on its bonds, many of which were held by British investors. To save the city from its creditors temporarily, Thomas Beasley removes the assessment rolls, thus preventing a levy of special tax. Foundries and machine shops associated with the Great Western Railway failed and several established wholesalers closed their accounts. Daniel C. Gunn's locomotive works went bankrupt, but the manufacturers of farm implements and stoves-the mainstays of iron foundries – were able to weather the crisis. Those owned by Dennis Moore and the Copp brothers endured, but their employees suffered wage cuts and layoffs. Canadian patent laws and the underemployed workers skilled in machinist trades lured an important new industrial enterprise from the U.S.A. – the manufacture of sewing machines by Richard Wanzer. From this development there evolved the ready-made clothing industry, which William Eli Sanford introduced locally. From judicial village to commercial town to railway centre, Hamilton moves to an ever-stronger dependency on industry.\n* 1862 – Isaac Buchanan who was the 1st Commanding Officer of that Regiment.\nLCol The Hon. Isaac Buchanan commanded the 13th from 28 Nov 1862 until 30 Dec 1864. The XIIIth Battalion is known today as The Royal Hamilton Light Infantry (Wentworth Regiment).\n* 1864 – First Board of Trade – Hon. Isaac Buchanan, President. 27 churches and 77 taverns in the city.\n* 1867 – Confederation of Canada.\n* 1868 – Hottest day ever recorded in Hamilton as the thermometer hits 41.4&nbsp;°C\n* 1869 – On Wednesday, November 3, 1869, in a room above George Lee's Fruit Store, the Hamilton Football Club was formed. Hamilton Football Clubs have captured the Grey Cup in every decade of the 20th century, a feat matched in pro sport by only one other franchise, the Montreal Canadiens.\n1870–1879\n* 1870–1870s decade; Confederation era Hamilton boosters lose a commercial and financial edge to Toronto and consciously shift to the economic strategy of attracting industry.\n* 1870 – Daily temperature published.\n* 1872 – The Nine-Hour Movement is born, Hamilton unionists urge government to limit working hours to nine per day.\n* 1872 – the Bank of Hamilton was established. It lasted until 1924. The Bank of Hamilton merged with The Commerce (later to become the Canadian Imperial Bank of Commerce, or CIBC) on January 2, 1924. It was one of the last surviving banks in Canada that was not headquartered in Toronto or Montreal.\n* 1873 – The Hamilton Football Club played its first game against the recently formed Toronto Argonauts, which the Argonauts won. It was in that game that the Hamilton players first wore their colours of yellow and black. Hamilton won the rematch the following Saturday, and it was in the reporting of that game that they were first referred to as the Tigers.\n* 1874 – The Hamilton Street Railway (HSR) began offering horse-drawn public transportation.\n* 1876 – First time all the Irish gathered together in Hamilton to celebrate March 17 – St. Patrick's day.\n* 1877 – June 20, 1877 – First commercial telephone service (Fire Department) in Canada began in Hamilton, Ontario. Hugh Cossart Baker Jr. learned of Alexander Graham Bell's invention in 1877 at the Philadelphia International Exposition and from there decided to test the communication tool in Hamilton.\n* 1877 – Robert Smiley, the founding publisher of The Spectator, sold the newspaper to William Southam in 1877 as the first link in the Southam newspaper chain.\n* 1877 – Hamilton population at 32,641.\n* 1878 – The first telephone exchange in the British Empire was opened in Hamilton. (Hugh Cossart Baker Jr.)\n* 1879 – May 15 – Hamilton is the site of the first commercial long-distance telephone line in the British Empire. (Hugh Cossart Baker Jr.), Hamilton to Dundas.\n1880–1889\n* 1880 – McMaster University opens up in Toronto (Bloor Street campus). Eventually moves to Hamilton in 1930.\n* 1880 – Apr 29 – Hugh Cossart Baker Jr. of Hamilton, Ontario received charter to build a national telephone company. It was called The Hamilton Telephone Company and this was the charter that enabled the creation of the Bell Telephone Company in Canada. Hugh Cossart Baker Jr. became the manager of the Ontario division until he retired in 1909.\n* 1880 – Trained nursing introduced in city hospital.\n* 1881 – Thomas Willson, Hamilton inventor, designed and patented the first electric arc lamps in 1881.\n* 1881 – First public telephones installed.\n* 1882 – Ernest D’Israeli Smith, (E. D. Smith) after being frustrated by paying to have his fruit transported from the Stoney Creek area, had founded a company in 1882 to market directly to wholesalers and eliminate the middleman. E.D. Smith & Sons Ltd. continues operating today, and has since the early 20th century has sold manufactured preserves and jams. Its namesake founder served as the Conservative MP for Wentworth around the turn of the 20th century.\n* 1883 – Asphalt sidewalks on main streets.\n* 1886 – Florence Lawrence, \"Hollywood's first movie star\" is born January 2, 1886, in Hamilton, Ontario.\n* 1888 – Group of English businessmen visiting the city nicknamed it the \"Birmingham of Canada.\"\n* 1889 – Wentworth Historical Society is founded. (8 January 1889)\n* 1889 – James McMillan, (born and raised in Hamilton, Ontario) becomes U.S. Senator from the state of Michigan in 1889.\n* 1889 – Robert B. Harris (along with his brother John M. Harris) establish the Hamilton Herald newspaper in 1889. Begins publishing on August 1 becoming Hamilton's first one-cent newspaper. Hamilton is now a 3-newspaper town: The Hamilton Spectator, The Hamilton Times and The Hamilton Herald. Newspaper lasts until 1936.\n1890–1899\ncirca 1906]]\n* 1890 – First organized hockey game held in Hamilton; Bank of Hamilton vs. Knox, Morgan. (this is the earliest reference to an organized hockey game being played in Hamilton.)\n* 1890 – Hamilton's first public library opens up on Main Street West. Officially opened up by Lord and Lady Aberdeen on September 16, 1890.\n* 1890 – First bowling alley in the city opens at back of the J.W. MacDonald Tobacco shop, (66 James Street North).\n* 1892 – June 29, 1892, is the date the first electric streetcar was operated in Hamilton. The first two electric routes were King Street East and James Street North. Street cars continued running on Hamilton streets until 6 April 1951.\n* 1892 –  The Toronto, Hamilton and Buffalo Railway began operations.\n* 1892 – The Hamilton Street Railway (HSR) converted to electrically powered vehicles in 1892.\n* 1892 – James Street incline railway opens up June 11 (1892–1932).\n* 1893 – Hamilton's first large department store opens: the Right House (King Street).\n* 1893 – The Sir John A. Macdonald statue arrives in Hamilton from London, England on 30 October 1893. Official dedication of the statue took place 1 November 1893. Located at the intersection of King and Hughson Streets. Prime Minister Sir John Thompson in attendance.\n* 1893 – Hamilton Electric Light Co. electrify the street railway.\n* 1894 – Harvey Park was named after Colonel John Harvey, a British officer during the War of 1812. The name was accepted by Hamilton City Council 11 June 1894. (situated just west of Dundurn Park).\n* 1894 – Hamilton Herald newspaper and cigar store owner Billy Carroll established the Around the Bay Road Race. Although it is not a proper marathon, it is the longest continuously held long-distance foot race in North America.\n* 1895 – Wentworth incline railway begins operation in August 1895. (1895–1936)\n* 1895 – The TH&B Railway came into Hamilton in 1895. A railway tunnel was then constructed from Queen to Park Street to cut down on the noise, pollution and disruption for the wealthy families who lived South of Jackson Street in the Durand neighbourhood.\n*1896 – Cataract Power Company of Hamilton was incorporated, later becoming the Dominion Power and Transmission Company acquires  water privilege at Decew Falls. Nikola Tesla (the inventor of the AC Polyphase system of generators, transformers and motors) consulted about the plans to build a power generating station in St Catharines at Decew Falls and to send power to Hamilton. Tesla approved the plans.\n* 1896 – Sir John Morison Gibson forms The Dominion Power and Transmission Company, that brought hydroelectric power, for the first time, to Hamilton, from their plant, at DeCrew Falls.\n* 1896 – Hamilton Radial Electric Railway extended across Beach Strip. (7 September 1896).\n* 1896 – Hamilton firefighters unionized.\n* 1897 – John M. Lyle, Hamilton architect in the late 19th century and early 20th century, designs New York Public Library Main Branch in 1897. (Later went on to design the Royal Alexandra Theatre, in Toronto (1907) and Union Station (Toronto) 1914–1921).\n* 1897 – Adelaide Hoodless, was a Canadian educational reformer who founded the international women's organization known as the Women's Institutes in 1897.\n* 1897 – Westinghouse established in Hamilton. first Westinghouse operation outside of the U.S.\n* 1898 – The \"Five Johns\", (John Patterson, John Dickenson (Canadian politician), John Morison Gibson, John Moodie Sr. and John Sutherland), form The Cataract Power Co. Ltd. introducing electric power to Hamilton in 1898. On August 25, 1898, power was sent twenty seven miles from DeCew Falls, St. Catharines, using water from the old Welland Canal. New industries, such as the forerunners of the Steel Co. of Canada (Stelco) and Canadian Westinghouse, were attracted here by the cheaper, more efficient power. One time this Company controlled hydro power from Brantford to St. Catharines, including the Hamilton Street Railway and the area's radial lines. Back then the city's nickname was \"The Electric City.\"\n* 1898 – The first automobile driven in Canada was by textile manufacturer John Moodie in 1898; A one-cylinder Winton he imported from Cleveland. John Moodie was also one of the founders of Canada's automobile club, the Hamilton Automobile Club (now CAA South Central Ontario), which was founded in 1903 when there were 18 cars in town. By 1920, there were 6,000 and Hamilton's ratio of one car for every 15 people was higher than that of New York, Chicago, Boston or Toronto.\n* 1899 – Thomas Bain in 1899 becomes the Speaker of the House of Commons of Canada in Ottawa.\n* 1899 – Dundurn becomes a city park and the Victorian Order of Nurses begin work in Hamilton.\n1900–1909\nin 1908]]\n]]\n* 1902 – International Harvester is the second major United States industry to locate in Hamilton.\n* 1902 – Canadian Otis Elevator Company is formed (August 22)\n* 1903 – Hamilton Automobile Club (was the first in Canada) founded by John Moodie.\n* 1903 – Canadian Canners Limited formed. (Originally known as Canadian Canners Consolidated Companies Limited)\n* 1904 – George Klein, (born: August 15, 1904) – often called \"The most productive inventor in Canada in the 20th century.\"\n* 1906 – Hamilton east elected Ontario's first independent labour candidate, Allan Studholme, who held the seat until his death in 1919.\n* 1906 – Local boy William Sherring won an Olympic gold medal at Athens for the marathon.\n* 1906 – \"One big reason\" for almost 75% increase in the population of Hamilton between 1901 and 1912, boasted Sir John Morison Gibson of Dominion Power and Transmission Company, was \"Cheap Electric Power Furnished By Us.\" This simplistic explanation for the development of Hamilton in the early 20th century leaves much unexamined, but one conclusion cannot be disputed. In the perception of the Hamilton public, a view certainly fostered by Gibson and his fellow hydroelectric promoters, Hamilton was no longer regarded the Birmingham or the Pittsburgh of Canada Hamilton was now, as the title of a 1906 promotional booklet on the city proudly proclaimed, \"The Electric City.\"\n* 1906 – Hamilton Street Railway strike of 1906. Violent strike turns ugly and one of the few times in Hamilton's history that the Riot Act is read and enforced.\n* 1908 – Sir John Morison Gibson (1842–1929) becomes the Lieutenant-Governor of Ontario (1908–1914) from Hamilton.\n* 1908 – Robert Stanley Weir, best remembered as the author of the English lyrics to O Canada. His verses were first published in 1908, he spoke of them as representing a humble effort to do a great thing: to supply Canadians with a National Song; not to usurp others more or less in vogue, but to take place with them in the minstrelsy of our country. The song became widely used as a national anthem, was approved as such by Canada's parliament in 1967, and was with minor changes to the lyrics, formally legislated as such in 1980.\n* 1908 – Robert Kerr, Irish-Canadian sprinter. He won the gold medal in the 200 metres and the bronze medal in the 100 metres at the 1908 Summer Olympics.\n* 1909 – On 24 May 1909 a Coney Island-type amusement Park was opened in Hamilton. It was known as Maple Leaf Park and was bounded by Barton Street (north), Ottawa Street (east), Cannon Street (south), Rosslyn Avenue (west). It failed to attract enough visitors to keep the gates open and only lasted a year. Investors of the Park sold the land to local real estate speculators for $25,000 interested in the property because the land itself was a valuable commodity in the booming East Hamilton market.\n1910–1919\n* 1910 – Steel Company of Canada (Stelco) is formed.\n* 1910 – Andrew Ross, local Hamilton businessman builds the Barton Street Arena; future home of NHL Hamilton Tigers.\n* 1910 – The Royal Hotel (later renamed the Royal Connaught Hotel) is constructed on King Street.\n* 1911 – Hamilton hosted its first Aviation Meet at Aviation Park, hastily created on the Arthur O'Heir Survey, adjacent to the Tuckett Farm and Burlington Bay.\n* 1911 – Hamilton Hydro sub-station built on Dundurn St. North, the building is now home to the 'Staircase Theatre'.\n* 1912 – Dofasco, (Dominion Steel Casting Company) established. In 1917 named Dominion Foundries and Steel, the company then merges with Hamilton Steel Wheel Company.\n* 1912 – National Steel Car is established.\n* 1912 – Hamilton is second only to Montreal in shipping. (4.5 miles of dockage)\n* 1912 – First ever Grey Cup victory by a football team from Hamilton (4th ever Grey Cup). The Hamilton Alerts defeat the Toronto Argonauts 11-to-4. Game was played in Hamilton at the A.A.A. Grounds.\n* 1912 – Jack Kent Cooke, born in Hamilton in 1912 – was a Canadian-American entrepreneur who became one of the most widely known executives in North American professional sports. He owned the Washington Redskins (NFL), the Los Angeles Lakers (NBA), and the Los Angeles Kings (NHL), and built The Forum in Inglewood, California.\n, 1913.]]\n* 1912 – Dr. Alfred Pain of Hamilton drowns after the Titanic hits an iceberg. (14 April 1912).\n* 1913 – After receiving a grant from Andrew Carnegie of New York the city of Hamilton builds a brand new Library on the south side of Main Street West, across the street from the old Library. It is officially opened by the Lieutenant Governor [and Hamiltonian], Sir John Morison Gibson on May 5, 1913.\n* 1913 – The Rotary Club of Hamilton starts (June 23, 1913) 1:10pm at Young's Cafe 26 King William St. (aka. Listerblock).  Started by Bruce Carey, Russell T Kelly, Arthur Bell and Charlie McCallough.  Others that attended the lunch included Bill Peace, George C Coppley, Harry Russell and Bill Seymour\n* 1913 – Increased population and prosperity prompted a building boom. As a publicity stunt and raffle, workers and contractors built a house in a day in 1913 which was later featured in a Ripley's Believe It or Not cartoon.\n* 1913 – the Procter & Gamble Manufacturing Company (based in Cincinnati) purchased land in Hamilton. This event marks  beginning of company's operations outside the U.S.\n* 1914 – Sir John Strathearn Hendrie (1857–1923) becomes the Lieutenant-Governor of Ontario (1914–1919). from Hamilton.\n* 1914 – Construction starts on Procter & Gamble Hamilton plant, which cost $1 million and consisted of seven buildings: the Crisco building, the boiler house, the gas plant, the soap building, the hardening plant, the kettle and glycerin house, and the machine shop.\n* 1914 – Hamilton is connected to Toronto by the first concrete highway built in Canada, Highway 2\n* 1915 – Procter & Gamble officially opens Hamilton plant, employing 75 workers who made six different products.\n* 1915 – Herkimer Apartments, on the corner of Bay Street South and Herkimer Street, was the first Hamilton apartment installed with an elevator, which ran from the basement to the fifth floor. Opened in July 1915.\n* 1916 – The Royal Connaught Hotel opened. (Construction of it started in 1914).\n* 1917 – Gage Park opens up.\n* 1919 – Hoover Suction Sweeper Company builds a plant in Hamilton.\n* 1919 – Firestone Tire and Rubber Company of Canada is established.\n* 1919 – Bay Street, derives its name from its proximity to Hamilton Harbour, which was once Burlington Bay. In 1919, a Federal Order-In-Council changed the name of Burlington Bay to Hamilton Harbour.\n* 1919 – Civic Stadium built.\n* 1919 – Glendale Golf & Country Club opened in Hamilton's East End\n1920–1929\n* 1920 – Hamilton gets an NHL team called the Hamilton Tigers, but then the team folds after a player's strike in 1925. Players get bought up by New York City bootleggers and the team there is named the New York Americans and become the very first pro sports team to play out of the newly built Madison Square Garden in downtown Manhattan.\n* 1921 – Pantages Theatre opens up on King Street, (between Catharine Street and Mary Street), with a seating capacity of 3,500 made it the largest theatre in Canada at the time. Renamed The Palace Theatre in 1930. It closed down in 1972.\n* 1921 – The city's population grows to 114,000 making it Canada's 5th largest city.\n* 1922 – CKOC radio station starts up. Today it is the oldest radio station in English Canada; second oldest overall. On the air since May 1, 1922\n* 1922 – Prior to the 1922–23 season, the NHL would hold its Governors meeting at the Royal Connaught Hotel on King Street, where the visiting NHL teams who came to town to play against the Hamilton Tigers stayed as well.\n* 1922 – Beech-Nut Packing Company (makers of the Life Savers candy), establishes Canadian operations in Hamilton.\n* 1923 – On 29 March 1923, real estate agents and politicians announce the winning name, (Name the neighbourhood contest), at the Royal Connaught Hotel in downtown Hamilton. 6,170 people were gathered for the official announcement. Rev. Canon Percival Lawson Spencer won $200.00 for his submission of the \"Westdale\" name. Other names that were seriously considered for the neighbourhood include, Westhome, Vimy Ridge, Bridgeton, Woodlands Park, Surrey Park and Bridgeview.\n* 1923 – Westinghouse in Hamilton was the first company in Canada to manufacture radios (1923) and electric air cleaners (1944).\n* 1923 – Babe Dye becomes NHL scoring champion, repeats feat in 1925.\n* 1923 – Scottish Rite Cathedral built.\n* 1924 – The second Lister Block building erected. (The first one built in 1886 was destroyed by fire in 1923).\n* 1925 – First traffic lights in Canada go into operation at the Delta. (11 June 1925).\n* 1925 – Hamilton Tigers finish first overall in the NHL but players refuse to participate in playoffs. At end of season team folds and players move to New York and join the NHL's newest hockey club; the New York Americans.\n* 1926 – First Motor bus on Hamilton streets, 26 August (1926 – present).\n* 1927 – CHML began operations in 1927 as a response to censorship of political discussions by Hamilton's first radio station, CKOC. The original owners were Maple Leaf Radio Company, and the \"HML\" in the callsign stood for \"Hamilton Maple Leaf\".\n* 1927 Jack V. Elliot established the Elliot Airport on the old Ghent homestead, running from the Radial Line to the Bay.\n* 1927 – First airmail flight to Hamilton. (24 August 1927).\n* 1928 – Eileen Vollick, Aviator, Fascinated by aviation from childhood this daring young woman enrolled in the Jack V. Elliot Aviation School in Hamilton, Ontario. On March 31, 1928, she passed the federal aviation test and become the first Canadian woman to earn a private pilot's certificate.\n* 1929 – On May 24, 1929, a great ceremony was attended by numerous citizens of Hamilton. The unveiling of the United Empire Loyalist statue, which was a generous gift to the city by Mr. Stanley Mills, brought great cheers from the crowd gathered outside the Wentworth County Court House.\n* 1929 – Built for $1,000,000, Hamilton's first skyscraper; The Pigott Building: 18-floors, . Originally an office building, the Pigott Building is now used for condominiums.\n1930–1939\n]]\n]]\n* 1930 – The first British Empire Games – now the Commonwealth Games – were held in Hamilton in 1930 as a result of the efforts of Melville Marks Robinson.\n* 1930 – McMaster University moves to Hamilton, Ontario from Toronto.\n* 1930- [http://www.westdaleunited.ca Westdale United Church] was built at the Corner of North Oval and Paisley. The building was dedicated on September 7, 1930 and is still an active and thriving congregation to this day.\n* 1930 – Bessie Starkman (Rocco Perri's wife) murdered on 13 August 1930.\n* 1931 – Built in 1931, Westdale Secondary School was immediately deemed the largest composite school in the British Empire, having cost $1.3 million to build and consisting of 4.7 hectares of building, grounds and athletic fields.\n* 1931 – Canada's first birth control clinic was in Hamilton in 1931, as the advocates of birth control, led by Mary (Chambers) Hawkins, the American wife of a prominent city executive, and aided by some of Hamilton society's leading women, it aimed to meet the needs of people whose health and family lives suffered tremendously during the Great Depression.\n* 1931 – Trains no longer block traffic as James Street underpass is completed. (3 December 1931).\n* 1932 – Red Horner, pro hockey player, helps the Toronto Maple Leafs win their first Stanley Cup in 1932.\n* 1932 – Ray Lewis, captures bronze medal at 1932 Summer Olympics in L. A. (Track & Field), becoming the very first Canadian-born Black Olympic medalist.\n* 1932 – James Street Incline railway closes and permanently abandoned on May 14, 1932. (1892–1932)\n* 1933 – Filtration plant opened.\n* 1933 – Christ the King Cathedral, a Roman Catholic church, was consecrated on December 19, 1933.\n* 1933 – King George V allows the city of Hamilton to use the name, Royal Botanical Gardens. (19 May 1933).\n* 1934 – Hamilton is the birthplace of Canadian Tire. Two brothers John W. Billes and Alfred J. Biles in 1934 open up first associate store in Hamilton, Ontario.\n* 1936 – Wentworth Incline railway stops operating on August 15, 1936. (1895–1936) The first day, the public was allowed free access up and down the line. By the time the Wentworth Street Incline made its last trip on 16 August 1936, it was estimated that nearly 20,000,000 trips had been made up and down the line.\n* 1937 – Syl Apps, legendary Toronto Maple Leafs captain who led the Leafs to three Stanley Cups and McMaster University alumnus, wins the Calder trophy in 1937 as the top rookie in the National Hockey League.\n1940–1949\n* 1940 – The June 1940 issue of Canadian Transportation, in an article titled 'The Transit Service in Hamilton', stated that 72-passenger street cars of all-steel construction, and fitted for one-man operation, as well as 33 buses were in operation when it was written. The article went on to say that the Hamilton Street Railway had 27.97 route miles of electric railway.\n* 1940 – Harry Crerar was a Canadian general and became the country's \"leading field commander\" in World War II.\n* 1940 – John C. Munro Hamilton International Airport; The airport was originally built in 1940 as the Mount Hope Airport, a Royal Canadian Air Force base. After the war, the airport gradually shifted towards civil use, The military ceased using it as a base in 1964.\n* 1941 – The Royal Botanical Gardens was established as an independent entity in 1941 by an act of the provincial government, but the project's origins are traceable to the late 1920s when the City of Hamilton began acquiring land for the beautification of the city's northwest entrance.\n* 1943 – Jackie Callura, was a Canadian featherweight boxer and became the world featherweight champion by defeating Jackie Wilson in 1943.\n* 1944 – Civic bathing beach was closed by the Department of Health.\n* 1944 – On 23 April 1944, Rocco Perri was seen for the last time in Hamilton, Ontario. Although his body has never been found, there is speculation that he was murdered, possibly by being put in a barrel filled with cement and dumped into Burlington Bay. As one Royal Canadian Mounted Police officer concluded in a 1954 interview, \"We won't find his body until the Bay dries up.\"\n* 1944 – An earthquake damaged St. Paul's Church spire. (5 September 1944).\n* 1944 – Sam Lawrence Park can be found on the western end of Concession Street. Prior to 1944, this property was the Webb Quarry. In February 1944, The City of Hamilton was given  of land for park use by Thomas Hambly Ross, MP (Hamilton East), and his wife Olive. The park was originally named Ross Park, then renamed Patton Park in 1946, in honour of captain John MacMillan Stevenson Patton, a Hamiltonian who risked his life during World War II by detonating an unexploded bomb. For this exploit he received the first George Cross for valour. In 1960, the park was renamed to honour Sam Lawrence. During 1990 to 1994, Sam Lawrence Park underwent a major upgrading that included repairing the stone walls, installing new walkways, site lighting, site furniture, and the redevelopment of the major rock gardens.\n* 1945 – Win Mortimer, a comic book and comic strip artist best known as one of the major illustrators of the DC Comics superhero Superman, joined DC Comics.\n* 1946 – (July 15), After a meeting at the Playhouse Theatre, Local 1005 members marched to the plant gates to start the famous strike of 1946. The fight was over union recognition, a 40-hour work week and wages. With the help of Hamilton's community this struggle changed Canadian labour history. It forced employers to accept collective bargaining and helped start a mass trade-union movement in Canada.\n* 1946 – Evelyn Dick was arrested for murder after local children in Hamilton, Ontario found the torso of her missing estranged husband. The head and limbs had been sawed from his body and ashes containing bone fragments and teeth were found in the alleyway behind her Carrick Avenue home. She was convicted of the murder in 1946 and sentenced to hang; however, lawyer J.J. Robinette appealed her case and won an eventual acquittal. During searches of Evelyn's home, the decayed remains of a baby boy were found encased in cement in a suitcase found in the attic of her home. She was convicted of manslaughter in 1947 and sentenced to 11 years in prison. Evelyn was released from prison in 1958 and quickly disappeared from public view. She was granted a Royal Prerogative of Mercy in 1985.\n* 1946 – \"The Skyway,\" Canada's first drive-in theater opens. (July 10, Stoney Creek, Ontario)\n* 1946 – John Foote, military chaplain and Ontario cabinet minister, was a Canadian recipient of the Victoria Cross in 1946.\n* 1946 – Joe Krol, Canadian football quarterback (1932–53), won the Lou Marsh Trophy as Canada's top athlete in 1946.\n* 1946 – Hamilton's population was 178,686.\n* 1948 – (August 18), surrounded by more than 400 employees and a battery of reporters, the first vehicle, a blue Champion four-door sedan, rolled off the Studebaker assembly line.\n* 1948 – Canadian Westinghouse designed and built the first Canadian television set.\n* 1948 – Susan Shoe Industries Limited was founded.\n* 1949 – Hamilton hosted the Brier for the first time.\n1950–1959\n* 1950 – Ellen Fairclough becomes the first female member of the Canadian Cabinet. Elected to the House of Commons of Canada in a 1950 by-election after being defeated in the 1949 federal election.\n* 1950 – It was decided that the two Clubs Tigers and Wildcats should amalgamate and form one representative team for Hamilton. The present name, TIGER-CATS, and what is known as the modern era of football started in 1950.\n* 1951 – The end of the streetcar era in Hamilton came in the early hours of April 6, 1951, when the Belt Line route was abandoned, car 519 making the last revenue run. Even though it no longer operated on railway tracks, the name Hamilton Street Railway continued to be used, and is still used today.\n* 1951 – March 28, 1951 – Ballerina Karen Kain born in Hamilton, Ontario.\n* 1953 – Hamilton Tiger-Cats capture their first Grey Cup in Grey Cup #41; (#8 Grey Cup for a football team from Hamilton). The Tiger-Cats defeated the Winnipeg Blue Bombers 12-to-6 at Varsity Stadium in Toronto.\n* 1954 – CHCH began broadcasting in 1954 as a CBC affiliate from a transmitter located at 481 First Road West in Stoney Creek. At the time, all private stations were required to be CBC affiliates.\n* 1954 – \"Golden Horseshoe\" phrase first used by Westinghouse President, Herbert H. Rogge, in a speech to the Hamilton Chamber of Commerce. (January 12, 1954)\n* 1954 – Hurricane Hazel hits Hamilton. (October 15–16)\n* 1955 – John Callaghan, was a Canadian cardiologist who \"pioneered open-heart surgery.\" He performed Canada's first successful open heart surgery in 1955.\n* 1955 – The Centre Mall was Canada's first mall, built in 1955. One of the first shopping malls in North America, original plans for an enclosed mall were abandoned.\n* 1955 – Hurricane Connie hits Hamilton. (August 13)\n* 1956 – Hamilton is the birthplace of the Pioneer gas station. November 29, 1956, on Upper James Street. Today over 140 locations across Ontario (8% market share in Ontario) making it one of Canada's largest independent gasoline retailers.\n* 1956 – First computerised election in Hamilton's history takes place.\n* 1957 – Hamilton is twinned with Flint, Michigan, and its amateur athletes compete in the Canusa Games, held alternatively there and here since 1957. Through the CANUSA games which date back to 1958, Flint and Hamilton hold the distinction of having the oldest continuous sister-city relationship between a U.S. and Canadian city.\n* 1958 – New courthouse opened on Main East at John, on the site of old 1879 building.\n* 1958 – The Burlington Bay James N. Allan Skyway, originally called the Burlington Bay Skyway and referred to locally as simply the Skyway Bridge, is located in Hamilton and Burlington. The Skyway, as it locally known, is part of the Queen Elizabeth Way freeway linking Fort Erie with Toronto in Ontario. The first bridge was completed in 1958.\n* 1958 – Angelo Mosca, joins the Canadian Football League in 1958 to play for the Hamilton Tiger-Cats.\n* 1958 – Ronnie Hawkins came to Canada in 1958. His first gig was at the Golden Rail in Hamilton where he became an overnight success. It was a result of Hawkins success in Hamilton that he decided to move to Canada permanently. His career spans over five decades and 25 records. His hits include, “Forty Days”, “Mary Lou”, and “Hey! Bo Diddley”.\n* 1958 – Conway Twitty, singer-songwriter and his band were in town nearly 50 years ago and were playing the Flamingo Lounge where Hamilton Place is located today. Legend has it that the drummer, Jack Nance, wrote 'It's Only Make Believe' between sets, although another story puts them at the nearby Fischer Hotel. The song was recorded in 1958 and became the first of nine Top 40 hits for Twitty, selling eight million copies.\n1960–1969\n* 1960 – Barton Township annexed by the City of Hamilton and the township ceased to exist.\n* 1960 – CHCH Television Tower is a 357.5 metre-high guyed TV mast in Hamilton, Ontario, Canada which is the primary transmitter for television station CHCH-TV. When it was built in 1960, the CHCH Television Tower became the tallest structure in Canada.\n* 1960 – The Farmers' Market moved under cover on the ground floor of the Eaton's parking garage built on the market grounds.\n* 1960 – New City Hall opened on Main Street West.\n* 1960 – Police dogs used for the first time in Hamilton.\n* 1961 – Old city hall, with its 38-metre clock tower, demolished to allow expansion of Eaton's department store. The clock and bell went into the tower of the 1990 Eaton Centre.\n* 1961 – CHCH disaffiliated from the CBC and becomes an independent TV station.\n* 1962 – John Munro, elected to the Canadian House of Commons in the 1962 election, and served continuously as a Member of Parliament (MP) for Hamilton, Ontario. Munro was appointed to Cabinet by Prime Minister Pierre Trudeau, and served variously as Minister of Amateur Sport, Minister of Health and Welfare and Minister of Labour from 1968 to 1978 when he was forced to resign from over the \"Skyshops\" scandal.\n* 1962 – The Hamilton Red Wings in 1962 capture the Memorial Cup which featured 1972 Summit Series hero Paul Henderson. Hamilton defeated the Edmonton Oil Kings.\n* 1963 – Department of National Defence no longer needs the Hamilton airport. Department of Transportation assumes ownership and operation. The airport was originally built in 1940 as the Mount Hope Airport, a Royal Canadian Air Force base. After the war, the airport gradually shifted towards civil use, The military ceased using it as a base in 1964.\n* 1964 – Imperial Tobacco Company's Hamilton operations are moved to Guelph, Ontario.\n* 1964 – Hamilton is the birthplace of the Tim Hortons chain (1964).  The original store (\"Store #1\") still operates on Ottawa Street.\n* 1966 – Terminal Towers including a new eight-storey Holiday Inn opened on the site of the old transit terminal between King and Main at Catharine Street. It is now called Effort Square and the hotel is a Hamilton Plaza Hotel.\n* 1966 – Mohawk College starts granting diplomas in 1966, and has since grown into one of the largest provincially funded colleges in the province of Ontario.\n* 1966 – Studebaker Hamilton shuts down as its last car factory. (March 5)\n* 1967 – Hamiltonian Paul Szep, becomes the editorial cartoonist for The Boston Globe in 1967. (1967–2001).\n* 1968 – Lincoln Alexander, became Canada's first black Member of Parliament when he was elected to the Canadian House of Commons in 1968 as a member of the Progressive Conservative Party of Canada.\n* 1968 – Thomas McQuesten, his historic downtown family home was willed to the City of Hamilton after the death of the last of his five unmarried siblings in 1968. After its restoration was complete in 1971, Whitehern has been open as a civic museum and has occasionally served as a period film location.\n1970–1979\n]]\n]]\n]]\n* 1970s – Notable actors from Hamilton are Second City Television alumni Eugene Levy, Martin Short and Dave Thomas. All three Hamltonians attended McMaster University along with John Candy in the 1970s.\n* 1971 – The Capitol Theatre on King East closed.\n* 1971 – IBM Building office tower opened on Main West by the old library. Today (2007) known as the BDC Building.\n* 1971 – The Hilarious House of Frightenstein was a Canadian children's television series which was also produced by CHCH in 1971. It was syndicated to television stations across Canada and the United States, and occasionally still appears today in some TV markets. A quirky sketch comedy series, the show's cast included Billy Van, Fishka Rais, Guy Big, Mitch Markowitz, Vincent Price and Julius Sumner Miller. Van, in fact, played the vast majority of the characters. 130 episodes of the series were made, in one single nine-month span of time starting in 1971.\n* 1972 – Hamilton's largest theatre, the Palace, was demolished.\n*1972 – Hamilton Hurricanes Football Club wins the Canadian Junior Football League (CJFL) National Championship: The Canadian Bowl.\n* 1972 – The Canadian Football Hall of Fame officially opened as a museum to dedicate football in Canada, (November 28, 1972) in Hamilton.\n* 1972 – Phase 1 of Jackson Square completed, including Stelco Tower and Bank of Montreal Pavilion. The old Bank of Montreal building at Main and James was used as the city reference library until 1980 and had been vacant or a nightclub site on and off for many years.\n* 1973 – The Birks Building at King and James, demolished to make room for a modernist law office, was once described by Oscar Wilde as \"the most beautiful building in all of North America.\"\n* 1973 – Stelco Tower is built in downtown Hamilton, 25-floors/ 103-metres. At the time of completion was the tallest building in Hamilton but that title only lasted for a year until Landmark Place (Century 21 building) was complete in 1974.\n* 1973 – The last day Tolls were charged on the Hamilton Harbour James N. Allan Skyway Bridge. (December 28)\n* 1973 – Hamilton Place auditorium opened.\n* 1973 – Wentworth County changes into the Regional Municipality of Hamilton-Wentworth. (Bill 155)\n* 1974 – Hamilton's tallest building; Landmark Place, (formerly known as the Century 21 building) is completed. 43 stories/ 127.0 metres in height. Also the tallest residential building in Canada outside of Toronto as of January 10, 2007.\n* 1974 – (January 1), The Regional Municipality of Hamilton-Wentworth came into being.\n* 1974 – CHCH TV 11 was first in the world with the television premiere of The Godfather.\n* 1976 – the Hamilton Fincups captured the Memorial Cup trophy. The Hamilton team featured future NHL stars Willie Huber, Al Jensen, Dale McCourt, Al Secord and Ric Seiling. Hamilton defeated the New Westminster Bruins in the Finals.\n* 1976 – Hamilton's Mayor; Victor Kennedy Copps suffers a severe heart attack during the Around the Bay Road Race and leaves public office.\n* 1976 – First Place seniors high rise at King and Wellington opened on the site of First United Church, which burned in 1969.\n* 1976 – Widening of York Boulevard, which involved expropriating hundreds of homes and businesses, was completed.\n* 1976 – The Spectator, which had been downtown since its founding in 1846, moved out of its King East building to 44 Frid St.\n* 1977 – Second phase of Jackson Square completed with a six-storey office tower, but not the department store intended to be its major attraction.\n* 1977 – The Art Gallery of Hamilton opened beside the board of education.\n* 1977 – New police headquarters opened down the street from the old one on King William at Mary.\n* 1978 – Harold Ballard buys the Hamilton Tiger-Cats from Michael DeGroote for $1.2 million in January 1978.\n* 1978 – Teenage Head, in May 1978, they released their first single \"Picture My Face\" on Epic Records, and quickly became part of the scene exploding in Toronto.\n* 1978 – August 7: Hamilton held a round of the Formula Atlantic Championship. The insurance company demanded that the metal containers that formed part of the portable barrier system be filled with sand. In the haste to get this done in time, sand was dumped all over the road. The resulting delay led to the whole event being run in just half a day. Following 30 minutes of practice, a shortened qualifying session was held for 48 minutes, although there was basically only one line because the sand still lying on the circuit. The race was finally started at 8pm. The race was originally scheduled for 70 laps. There was a safety car period after an early three-car incident. The race was eventually red flagged after 39 laps due to darkness. Keke Rosberg (1982's Formula One World Champion) won the race.\n1980–1989\n.]]\n* 1980 – The Hamilton Central Library and Farmers Market opened.\n* 1981 – The Hamilton Convention Centre and the government office tower above it opened. The tower was named the Ellen Fairclough Building in 1982.\n* 1982 – Bob Morrow wins the first of six mayoral elections, defeating incumbent John Alexander McDonald. Bob Morrow serves as Mayor of Hamilton from 1983-to-2000 and becomes longest-serving mayor in Hamilton's history.\n* 1983 – The Standard Life Centre opened at the west end of Jackson Square.\n* 1983 – Renovations began at Gore Park, including cutting down all the mature trees and constructing an amphitheatre. What came to be known as the Gore Park Fiasco was stopped by citizen protests, redesigned and completed in November 1984.\n* 1985 – Daniel Lanois, a solo artist in his own right and producer for U2, opens up Grant Avenue Studios in Hamilton, Ontario.\n* 1985 – Sheraton Hamilton, connected to Jackson Square, opened, boosting downtown's hotel space.\n* 1985 – Copps Coliseum, sports and entertainment arena with a capacity of up to 19,000 (depending on event type and configuration) opens its doors for business. It is named after the former Hamilton mayor, Victor K. Copps.\n* 1985, November – Hamilton Street Railway uses first Natural Gas Vehicle (N.G.V.) buses in North America.\n* 1986 – World Junior Ice Hockey Championship Games in 1986 at Copps Coliseum which saw the Soviets capture gold against Team Canada with a top scoring line that consisted of Sergei Fedorov, Alexander Mogilny and Pavel Bure.\n* 1986 – The popular downtown restaurant The Chicken Roost closed.\n* 1987 – #99 Wayne Gretzky and #66 Mario Lemieux combine forces to capture the Canada Cup at Copps Coliseum as Team Canada defeat the Russians. Canada wins series 2 games to one. All three games end in 6-to-5 scores.\n* 1987 – The first of two reflective glass buildings of the CIBC tower (Commerce Place I) opened at King and James opposite Gore Park. The other (Commerce Place II) opened in 1990.\n* 1989 – The original name of the first bridge was the Burlington Bay Skyway. After it was twinned, the proposed names of \"James N. Allan Skyway\" (in honour of the Ontario minister who championed the 1958 bridge) and \"James N. Allan Burlington Bay Skyway\" were rejected. The official name since 1989 has been \"Burlington Bay James N. Allan Skyway\", while it is referred to by the public simply as the \"Skyway Bridge\".\n* 1989 – The ''Robinson's store on James South between Main and King closed and was demolished shortly afterward.\n* 1989 – The Unified Family Court opened in the old central library on Main Street.\n* 1989 – The Tivoli Theatre on James North closed.\n* 1989 – The Century Theatre on Mary Street closed.\n* 1989 – Fire destroyed two 1840s buildings at the northeast corner of King'' and John.\n1990–1999\n* 1990 – April 1990 CKOC (radio station) moved to Hamilton's mountain and took up residence at 883 Upper Wentworth Street, near Lime Ridge Mall. This was the first time any local station had settled away from the lower city.\n* 1990–1990 was the Year Hamilton came closest to landing an NHL franchise when 14,000 Hamilton hockey fans made Non-refundable downpayments for season's tickets in less than 24 hours but was blocked by Seymour Knox III (then owner of the Buffalo Sabres) and the Toronto Maple Leafs organizations.\n* 1990 – During 1990 to 1994, Sam Lawrence Park underwent a major upgrading that included repairing the stone walls, installing new walkways, site lighting, site furniture, and the redevelopment of the major rock gardens.\n* 1990, Eric Lindros and the Oshawa Generals defeat the Kitchener Rangers at Copps Coliseum to capture the Memorial Cup of Hockey.\n* 1990 – The Hamilton Eaton Centre created a major new commercial development beside Jackson Square.\n* 1990 – F. W. Woolworth closed on King East.\n* 1991 – In 1991, CKDS adopted the CJXY (Y95.3) callsign and a classic rock format.\n* 1991 – The du Maurier Centre on King William, home to Theatre Aquarius, opened.\n* 1991 – Stelco moved its head office from Toronto back to Hamilton and the Stelco Tower.\n* 1991 – Mark Messier leads Team Canada to victory over Brett Hull and Team U.S.A. to capture the Canada Cup at Copps Coliseum.\n* 1991 – Hamilton hosts the Brier for the second time.\n* 1992 – The assets of Amstel Brewery Canada Limited are acquired by a company later called Lakeport Brewing Corporation. The Lakeport Brewing Company is the biggest discount brewer in Canada (March). Lakeport Brewing Company is Canada's No.1 co-packer of beer, non-alcohol and spirit-based products. The company is also said to be North America's most modernized beverage alcohol production facility.\n* 1993 – Jean Chrétien became prime minister following the federal election, and names Sheila Copps as Deputy prime minister and Minister of the Environment.\n* 1994 – Transport Canada announces it will divest itself of local and regional airports. The region of Hamilton issues a request for proposals from private firms to run the airport.\n* 1994 – March 18, \"Remembering John\" a special memorial service for John Candy arranged by The Second City is broadcast live on CHCH TV and transmitted via satellite to eight stations across Canada.\n* 1994 – The last Canadian ''Kresge's store, in Hamilton, closed at northeast corner of King'' and Hughson.\n* 1995 –  View Magazine (Hamilton's Weekly) is born and is still going strong.\n* 1995 – Hurricane Opal hits Hamilton. (October 5–6)\n* 1995 – Hamilton hosts The Juno Awards of 1995 for the first time, representing Canadian music industry achievements of the previous year, at a ceremony in the Copps Coliseum. Mary Walsh, Rick Mercer and other regulars of the television series This Hour Has 22 Minutes were the hosts for the ceremonies which were broadcast on CBC Television.\n* 1995 – ''The Lister Block's last tenants were forced to move out, leaving the building vacant.\n* 1996 – Hamilton International Airport Limited (HIAL) is the fully owned subsidiary of TradePort International Corporation. HIAL begins to manage the John C. Munro Hamilton International Airport. TradePort, winner of the bid to take over the airport, assumes responsibility to manage, finance and operate it under a 40-year lease.\n* 1996 – The conversion of the Pigott and Sun Life buildings on James South at Main into 110 upscale condominium units was completed.\n* 1996 – A replica of the original Gore Park fountain was installed in the park. The original had been replaced in 1960.\n* 1996 – The refurbished TH&B Station'' became the Hamilton GO Transit station, as well as the city's bus terminal.\n* 1996 – Oh What a Feeling: A Vital Collection of Canadian Music was a 4-CD box set released in 1996 to celebrate the 25th anniversary of the Juno Awards. All of the sets feature popular Canadian songs from the 1960s onward. The sets were titled for the song \"Oh What A Feeling\" by Hamilton Ontario rock band Crowbar. From 1969 to 1970, most of the members of the group had been a backup band for Ronnie Hawkins. However, he fired them, saying \"You guys are so crazy that you could **** up a crowbar in three seconds!\" They recorded their first album in 1970 as King Biscuit Boy and Crowbar. King Biscuit Boy left the band later in 1970, but continued to appear as a guest performer.\n* 1996 – Hamilton hosts the Juno Awards of 1996, representing Canadian music industry achievements of the previous year, at a ceremony in the Copps Coliseum. Anne Murray was the host for the ceremonies, which were broadcast on CBC Television. Prominent nominees were Alanis Morissette and Shania Twain. Canadian Music Hall of Fame Inductees: David Clayton-Thomas, Denny Doherty, John Kay, Domenic Troiano, Zal Yanovsky.\n]]\n* 1997 – Hamilton hosts the Juno Awards of 1997, representing Canadian music industry achievements of the previous year, at a ceremony in the Copps Coliseum. Jann Arden was host for the major ceremonies which were broadcast on CBC Television. Major winners were Celine Dion and The Tragically Hip.\n* 1997 – The Bank of Montreal moved out of Jackson Square, where it had been a major first tenant, and into its own building at Main and Bay.\n* 1997 – Lincoln M. Alexander Parkway is complete. (called The Linc by locals) is a municipal freeway in the city. Named after Lincoln Alexander, the former Progressive Conservative MP and Lieutenant governor of Ontario, though he never held a driver's license of his own. It opened on October 15, 1997, and at the present its western terminus is at Highway 403.  The expressway runs along the south of Hamilton and becomes The Red Hill Expressway going north ending at the QEW.\n* 1999 – In 1999, CHML and CJXY were acquired by Corus Entertainment. The following year, CJXY swapped frequencies with Corus' CING, taking over CING's former 107.9 frequency; at the same time it changed its moniker to Y108.\n* 1999 – McMaster University is home to a piece of Albert Einstein's brain. An autopsy was performed on Einstein by Dr. Thomas Stoltz Harvey, who removed and preserved his brain. Harvey found nothing unusual with his brain, but in 1999 further analysis by a team at McMaster University revealed that his parietal operculum region was missing and, to compensate, his inferior parietal lobe was 15% wider than normal. The inferior parietal region is responsible for mathematical thought, visuospatial cognition, and imagery of movement. Einstein's brain also contained 73% more glial cells than the average brain.\n* 1999 – Hamilton hosts the Juno Awards of 1999 honouring Canadian music industry achievements, broadcast by CBC Television and hosted by Mike Bullard.\n* 1999 – Eaton's closed as the department store chain collapsed.\n2000 – present\n]]\n* 2000 – LIUNA reopened the James North CN rail station as a banquet hall.\n* 2001 – The new city of Hamilton is formed. The Regional Municipality of Hamilton-Wentworth and its six local municipalities; Ancaster, Dundas, Flamborough, Glanbrook, Hamilton and Stoney Creek amalgamate. (January 1)\n* 2001 – The Juno Awards of 2001 were held in Hamilton, Ontario, hosted by Rick Mercer at Copps Coliseum and broadcast on CBC Television. Performers during the telecast included: Deborah Cox, Nelly Furtado, The Guess Who, Jacksoul, Michie Mee, The Moffatts and Treble Charger.\n* 2002 – Pat Quinn, At the 2002 Olympic Winter Games coached Team Canada to their first Olympic gold medal in ice hockey at the Olympic Games since 1952.\n* 2003 – Hamilton Bulldogs of the AHL lose in the Calder Cup Finals to the Houston Aeros.\n* 2003 – On August 30, 2003, the 60th anniversary of her commissioning into the Royal Canadian Navy,  (Canada's most famous warship and the last remaining Tribal Class in the world) was moved to the city of Hamilton, Ontario by Parks Canada where she has become a focal point of a revitalized waterfront.\n* 2003 – Michael DeGroote, makes a $105 million CAD donation was given to McMaster's medical program. It is the largest single cash gift in Canadian history and will be used to upgrade the current medical school, called the Michael G. DeGroote School of Medicine.\n* 2003 – The Hamilton Golf & Country Club hosted the 2003 Canadian Open golf championship in which Bob Tway won.\n* 2003 – Hamilton successfully hosted the World Cycling Championships in 2003. It was only the second time the World Cycling Championships was staged outside of Europe, first time ever in Canada. Igor Astarloa of Spain was the winner.\n* 2004 – Dave Andreychuk, captains the Tampa Bay Lightning of the NHL to the 2004 Stanley Cup.\n* 2006 – Hamilton hosts the Canadian Open Golf Championship again in 2006 Jim Furyk won the title.\n* 2006 – As of October 5, 2006, speculation has it that Jim Balsillie of Research In Motion who offered to buy the Pittsburgh Penguins for $175-million would move the team to Hamilton where it would play out of the Copps Coliseum Arena.\n* 2006 – On December 15, 2006, Balsillie withdrew his bid to buy the Pittsburgh Penguins. He made the decision after receiving notice from NHL commissioner Gary Bettman that the league would restrict Balsillie's control over the team. The move was geared at preventing Balsillie from moving the team.\n* 2006 – The Hamilton Port Authority handles over 12 million tons of cargo and is visited by over 700 vessels each year. This ranks Hamilton as the busiest of all Canadian Great Lakes ports.\n* 2007 – Hamilton hosts the 2007 Tim Hortons Brier (March 3–11).\n* 2007 – Ronald V. Joyce Stadium at McMaster University opens up. Used for football, soccer and rugby.\n* 2007 – David Braley Athletic Centre at McMaster University opens up.\n* 2007 – Cayuga International Speedway (now Jukasa Motor Speedway), a 5/8-mile oval auto racing track reopens in 2007 after major renovations.\n* 2007 – Henderson General Hospital on Concession Street (April 2007) major renovations and expansion started and once complete the hospital will be renamed the Juravinski Hospital and Cancer Centre, (after Charles Juravinski and his wife Margaret), after they both made a $43-million contribution to health care in Hamilton.\n* 2007 – Hamilton Bulldogs win the Calder Cup, defeating the Hershey Bears 2–1 before sellout crowd at Copps Coliseum.\n* 2007 – Hamiltonian Brian Melo wins the fifth season of Canadian Idol.\n* 2007 – Red Hill Valley Parkway (popularly called the Red Hill Creek Expressway) a municipal expressway running through the city, connecting the Lincoln M. Alexander Parkway to the Queen Elizabeth Way near Hamilton Harbour. A four-lane freeway completed in 2007. The parkway was originally scheduled to be opened to vehicular traffic on November 16 but the date was pushed back a day and officially opened November 17.\n* 2007 – Jim Balsillie of Waterloo, Ontario-based Research In Motion, offers to manage and run HECFI, (Hamilton Entertainment and Convention Facilities), which includes Copps Coliseum, Hamilton Place and Convention Centre. Also, offers to upgrade and renovate the Copps Coliseum Arena to make it a 2007 NHL-ready Arena. Price tag for renovations/ upgrades, $100-million (minimum). Name of Jim Balsillie's company that will run and manage all 3-Hamilton landmarks is \"Golden Horseshoe Sports & Entertainment.\"\n* 2007 – September 19, CBC organized a meeting in Hamilton at the Convention Centre to discuss the idea of bringing a new radio station to the City citing that 'Hamilton was the largest, and most underrepresented city in the country in terms of media coverage.'\n* 2007 – Centre Mall owners announce plans for a 23-building super centre on the property on Barton Street East. Cost is estimated to be around $100-million and will take up  of retail space. This will end up being the largest redevelopment project in the history of Hamilton's east-end.\n* 2007 – It is announced on October 4, that the Mountain Plaza Mall at Fennell Avenue and Upper James Street is to be rebuilt in a $50-million project. Announcement made on October 4 by Flavio Volpe, spokesperson for Smart Centres Ltd., Vaughan-based company that bought the Mall in November 2006.\n* 2008 – On Friday, February 29, 2008, Hamilton, Ontario Wikipedia page became the \"FEATURED ARTICLE.\"\n* 2008 – May 2, 2008, Hamilton's most powerful voices in business, the arts, government, social services, health and education called for \"breathtaking\" change and a reinvention of Hamilton's image at the city's first ever economic summit.\n* 2008 – June 2, 2008, Real Estate developer Harry Stinson makes a public presentation of his proposed 100-storey Connaught Towers at the Hamilton Chamber of Commerce building. It would have made it the tallest building in Canada. Three months later, on Thursday September 4, Harry Stinson closes up the Connaught Towers sales office in downtown Hamilton and the project is officially cancelled.\n* 2008 – Hamilton hosts the Vanier Cup. (Championship trophy of Canadian Interuniversity Sport men's football.)\n* 2009 – Prince Charles, Prince of Wales and Camilla, Duchess of Cornwall visit Dundurn Castle and HMCS Haida.\n* 2009 – Toronto/ Hamilton wins 2015 Pan American Games bid.\n* 2010 – June 23, 2010, A 5.0 magnitude earthquake hit Ontario (including Hamilton)\n* 2024 – February 25, 2024, A cybersecurity outage impacting several city services (including phone, email and\nmap systems).\nReferences"
    }
  ]
}