{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of golf on UK television\n\nThis is a timeline of the history of golf on television in the UK.\n1950s to 1970s\n* 1955\n** The BBC broadcasts The Open Championship for the first time.\n* 1956 to 1971\n** No events.\n* 1972\n** ITV shows the 1972 and 1973 Scottish Open. The tournament is cancelled when television coverage could not be arranged in 1974.\n* 1973\n** 20–22 September –  Coverage of the Ryder Cup moves from the BBC to ITV. ITV also shows the 1975 and 1977 events.\n* 1974\n** No events.\n* 1975\n** No events.\n* 1976\n** No events.\n* 1977\n** ITV televises the Ryder Cup for the final time.\n* 1978\n** No events.\n* 1979\n** The 1979 Ryder Cup is not televised in the UK because ITV held the rights to the event, and it took place during the 1979 ITV strike.\n1980s\n* 1980\n** No events.\n*1981\n** The BBC regains the rights to the Ryder Cup.\n*1982\n** No events.\n*1983\n** 18-19 June – Channel 4 begins showing coverage of the American major golf tournaments when it shows live coverage of the conclusion of the final two rounds of the US Open Golf Championship. Later in the summer Channel 4 airs the final two rounds of the US PGA Championship. Channel 4 also covers the 1984 events.\n*1984\n** 14-15 April – Channel 4 increases its coverage of the American golfing majors when it broadcasts live coverage of the conclusion of the 3rd and 4th rounds of the Masters Tournament. Channel 4 also shows the 1985 event.\n*1985\n** 16 June – Channel 4 ends its coverage of golf's American majors when it airs coverage of the 1985 PGA Championship.\n* 1986\n** 12–13 April – The BBC shows live coverage of the Masters for the first time. As Channel 4, only the final two rounds are covered.\n* 1987\n** 9 April – Screensport broadcasts live coverage of the US Masters golf from Augusta. This co-insides with the channel also broadcasting regular coverage of PGA Tour events.\n** 9–12 July – The BBC shows live coverage of the Scottish Open for the first time, and continues to show the event live until 1993.\n* 1988\n** No events.\n* 1989\n** No events.\n1990s\n* 1990\n** No events.\n* 1991\n** No events.\n* 1992\n** No events.\n* 1993\n** Sky begins providing live coverage of the PGA Tour and the PGA European Tour.\n** 24–26 September – The BBC shows live coverage of the Ryder Cup for the final time.The BBC shows live broadcast of the Open Championship.\n* 1994\n** 6–9 July – Sky Sports covers the Scottish Open for the first time. The event had previously been shown live on the BBC.\n* 1995\n** 22–24 September – Sky Sports becomes the exclusive broadcaster of the Ryder Cup and has shown the event exclusively live ever since. The event receives no coverage on terrestrial television.\n* 1996\n** Sky Sports shows women’s golf for the first time.\n* 1997\n** 26–28 September – Coverage of the Ryder Cup returns to free-to-air television when the BBC picks up the rights to highlights of the event. The BBC has shown highlights of the Ruder Cup ever since.\n* 1998\n** No events.\n* 1999\n** 4–7 November – Sky Sports broadcasts live coverage of the first edition of the World Golf Championships and with the exception of the 2001 WGC-American Express Championship, which was broadcast on the BBC, Sky has been the exclusive broadcaster of the tournament ever since..\n2000s\n* 2000 to 2005\n** No events.\n* 2006\n** December – Sky's 13 years of covering golf's PGA Tour ends after Setanta Sports wins the rights to coverage of the tour from the start of 2007.\n* 2007\n** 11 January – Following Setanta Sports’ purchase of rights to the PGA Tour, the company launches a dedicated golf channel Setanta Golf.\n** 31 December – The Golf Channel UK closes because it not being able to attract a viable audience due to not broadcasting enough live tournaments.\n* 2008\n** No events.\n* 2009\n** 23 June – Setanta Sports ceases broadcasting in the UK after going into administration. The closure means that Setanta Golf stops broadcasting.\n** 25 June – Eurosport picks up the television rights to the PGA Tour for the remainder of the 2009 season. However the coverage only lasts  for six months as the rights return to Sky Sports at the start of 2010.\n2010s\n*2010\n** January –  Sky Sports regains the rights to the PGA Tour.\n*2011\n** 7–10 April – Sky Sports shows coverage of the Masters for the first time. It shows the first two rounds exclusively live and shares coverage of rounds 3 and 4 with the BBC.\n** November – ESPN shows two golf tournaments from Australia.\n*2012\n** The BBC loses the rights to the Scottish Open, and BMW PGA Championship to Sky Sports. The BBC does retain the rights to show highlights of both events.\n*2013\n** No events.\n*2014\n** 18 September-2 October – Sky rebrands Sky Sports 4 as Sky Sports Ryder Cup to show its live coverage of the 2014 Ryder Cup, from Gleneagles. This is repeated from 26 September to 5 October 2016 for the Ryder Cup for that year. In 2018, Sky Sports Golf is rebranded to Sky Sports Ryder Cup to bring coverage of the 2018 tournament.\n*2015\n** 17–20 July – After 60 years, the BBC shows live coverage of The Open Championship for the final time as from next year, live coverage of the event transfers to Sky Sports although the BBC does continue to show two hours of highlights from all four days of the event.\n*2016\n** 11–18 July – During its first live broadcast of golf's Open Championship, Sky Sports 1 is rebranded as Sky Sports The Open. This is repeated in subsequent years.\n*2017\n** 18–14 May – Sky rebrands Sky Sports 4 as Sky Sports The Players. The channel is dedicated to the coverage of the 2017 Players Championship. This is repeated on Sky Sports Golf for the 2018, 2019 and 2021 competitions, and also the 2020 competition prior to it being cancelled due to the COVID-19 pandemic.\n** 18 July – Sky Sports is revamped with the numbered channels being replaced by sports-specific channels. One of the new channels is devoted to golf and is called Sky Sports Golf.\n** 3–6 August – Sky Sports replaces the BBC as live broadcaster of the Women's British Open.\n*2018\n** 11–19 June – Sky rebrands Sky Sports Golf as Sky Sports US Open, dedicated to the coverage of the 2018 US Open.\n** 9–12 August – Eleven Sports broadcasts the 2018 PGA Championship, meaning that or the first time, a major golf event in the UK is only available on a streaming platform. However, the event returns to Sky Sports the following year.\n*2019\n** 12–13 April – The BBC shows live coverage of the Masters for the final time, airing live coverage of the final two rounds. Coverage of the entire event moves to Sky Sports. This brings to an end all live coverage of golf on the BBC.\n** 16-19 May –  The US PGA Championship returns to Sky Sports.\n2020s\n* No events.\nReferences"
    }
  ]
}