{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Hits Radio\n\nA timeline of notable events relating to Hits Radio, a British commercial radio station operated by Bauer Media Audio UK.\n2000s\n* 2003\n** 1 January – A station named The Hits, carrying the audio of the Box Plus Network television channel of the same name, appears on DAB in London.\n** April – The Hits on DAB switches away from the TV audio and becomes a dedicated radio stream, playing contemporary pop hits.\n** July – The Hits is made available nationally as a radio service when it is added to the radio section of the Freeview programme guide (as 'The Hits Radio' to differentiate itself from the television channel)\n** Late in year – The Hits expands its DAB coverage with its addition to multiplexes outside London, including Emap-owned platforms in Northern England.\n* 2004\n** early 2004 – The bitrate of The Hits on Emap's local DAB multiplexes is reduced to allow for the addition of heat radio. It is subsequently further reduced to allow the local Magic stations, which had also been hit by Heat's addition, to re-increase their bitrates.\n** April – The Hits is removed from Emap's local DAB multiplexes in favour of Kerrang! Radio.\n* 2005\n** No events.\n* 2006\n** No events.\n* 2007\n** No events.\n* 2008\n** Emap's radio assets are acquired by Bauer Media.\n* 2009\n** No events.\n2010s\n* 2012\n** Late in year – The Hits reappears on Bauer's northern English DAB multiplexes, following a reduction in the bitrate used by heat radio.\n* 2013\n** No events.\n* 2014\n** No events.\n* 2015\n** 5 January – Bauer's network of FM contemporary hit radio services, including Key 103, are relaunched as the Bauer City 1 network. Most of the stations had already been carrying network programming from the Castlefield studios (such as In:Demand) in offpeak slots prior to the relaunch, and continued to do so thereafter. It was at this point that Magic 1152 on AM became Key 2.\n** 19 January –\n*** The Hits is split into a network of fresh-hits DAB stations in Bauer's heritage areas – Bauer City 3 – with split localised news, branding and advertising, and shared programme content. This programming also remains available nationally on Freeview under The Hits Radio name.\n*** The Hits is removed from DAB in London and Birmingham, the Birmingham space going to Kisstory (then to Kiss Fresh after Kisstory's move to Sound Digital in 2016).\n* 2016\n** No events.\n* 2017\n** 1 September – The Bauer City 3 network is disbanded, and The Hits as a single national service returns to DAB in its place.\n* 2018\n** 18 April – It is announced that Hits Radio will launch in June as a national station and that the name will also launch on FM in Manchester, replacing Key 103. This is announced live on Key 103. The new station logo and some information about programming, including the new breakfast show, is unveiled.\n** 23 May – Absolute Radio 70s and Kerrang! Radio are removed from DAB in London and replaced by a stereo placeholder service of music and announcements listed as Hits Radio – this placeholder is also rolled out to numerous other DAB areas, mostly in newly created slots on Arqiva's NOW Digital multiplexes.\n** late May – Magic Soul is replaced on DAB in Birmingham by the Hits Radio placeholder.\n** 1 June – Key 103 and The Hits Radio cease presented programming at 6pm and run a 60-hour sequence of music and announcements in preparation for the impending relaunch.\n** 4 June – Hits Radio Manchester launches, replacing Key 103 on FM in Manchester; Hits Radio UK launches replacing The Hits on DAB and Freeview. Gethin Jones, Gemma Atkinson and Dave Vitty launch the Manchester station on-air, with Greatest Day by Take That, winner of an online Manchester Evening News poll, the first song played.\n* 2019\n** 29 May - Gethin, Gemma and Dave announce their departure from Hits Radio Breakfast, with Atkinson remaining with the station after maternity leave.\n** 25 June - Bauer Media announce a new look breakfast show for Hits Radio, consisting of Fleur East, Greg Burns and James Barr.\n** 12 July - The Hits Radio Breakfast Show With Fleur East, Greg & James launches.\n** 5 August - Bauer announce that the local drive time shows on 11 radio stations in the Hits Radio network; Radio City, Rock FM, TFM, Metro Radio, Hallam FM, Viking FM, Radio Aire and Free Radio - would be replaced by a national show presented by Wes Butters and Gemma Atkinson.\n2020s\n* 2020\n** 28 August – Hits Radio launches its first spin-off station – Hits Radio Pride. It is aimed at the LGBTQ+ community.\n** 31 August – Hits Radio South Coast launches, thereby becoming the second FM station to be known on air as Hits Radio. The station had previously broadcast as The Breeze South Coast and the change is made following the purchase in 2019 of The Breeze network from Celador Radio.\n** 3 November – Hits Radio Suffolk launches on DAB digital radio, taking up the slot which had been carrying the local iteration of Greatest Hits Radio since September (and prior to this Town 102); the switch is made in tandem with the GHR affiliation switching to the former Ipswich 102. Like the digital-only North Yorkshire Hits Radio, all programming output is shared with the Hits network feed, but the option to use localised identity, news/information and advertising is retained.\n* 2021\n** 6 September – Bournemouth-based Fire Radio and Bristol-based Sam FM rebrand as Hits Radio. Both stations retain local drivetime shows.\n* 2022\n** 19 September – Nation Broadcasting replaces Hits Radio South Coast on FM with Easy Radio South Coast. Bauer provides a replacement Hits Radio feed via the South Hampshire DAB multiplex.\n** 1 October – Hits Radio Suffolk is withdrawn from DAB as the capacity reverts to carrying Greatest Hits Radio; this takes place in tandem with the 102 FM service transitioning from GHR to Nation Radio Suffolk.\n* 2023\n** April – CFM in Cumbria transfers from the Hits Radio Network to Greatest Hits Radio, with Hits Radio programming remaining available in the area over DAB.\n** 4 September – Hits Radio extends its networked drivetime programme to Hits Radio Bristol and Hits Radio South Coast, with the local programme on those stations moving to mid-mornings.\n** 23 October – Bauer introduces Hits Radio programming to Lincs FM except for its breakfast show, which remains a local programme.\n** 30 October – Bauer replaces Jack FM in Oxfordshire with Hits Radio.\n** 13 December – Hits Radio is removed from Sky as part of a decision by Bauer to remove all of its stations from the platform.\n*2024\n** January – The final local programming on Lancashire's Rock FM and Liverpool's Radio City ends when the two stations' breakfast shows merge.\n** 17 April – Bauer stations Free Radio, Pirate FM, Gem Radio, Hallam FM, Lincs FM, Metro Radio, Pulse 1, Radio City, Rock FM, Signal 1, TFM, Viking FM and The Wave rebrand to Hits Radio. The stations continue to have local breakfast output, with networked programming at all other times. Local news, advertising and traffic updates continue to air.\n** 7 August – Bauer announces that Hits Radio will replace KISS on FM in London, Norfolk and the West of England later in the year.\n** 16 September – Magic Chilled rebrands as  Hits Radio Chilled.\n** 22 September – Hits Radio replaces Kiss on FM in London, the west and in Norwich.\n** 28 October – Hits Radio's mid-morning output becomes fully networked.\n* 2025\n** 10 January – Bauer Media Audio UK reaches a deal to acquire Star Radio in Cambridgeshire and rebrand the station as Hits Radio.\n** 31 March – Hits Radio 90s and Hits Radio 00s launch.\n** 6 June – Eleven Hits Radio local breakfast shows across England and Wales air for the final time as Bauer prepares to transmit a single breakfast show for the entire network.\n** 9 June – Bauer begins networking a single breakfast show across its Hits Radio network in England and Wales.\n** 1 September - localised digital-only versions of Hits Radio in 14 areas of England and Wales are launched online and begin to replace Hits Radio UK on DAB; in Suffolk this essentially reinstates Hits Radio Suffolk, which originally operated between 2020 and 2022. Hits Radio UK continues to broadcast on four multiplexes in Scotland.\nReferences"
    }
  ]
}