{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of astronomy\n\nThis is a timeline of astronomy. It covers ancient, medieval, Renaissance-era, and finally modern astronomy.\nAntiquity\n750 BC\nMayan astronomers discover an 18.7-year cycle in the rising and setting of the Moon. From this they created the first almanacs&nbsp;– tables of the movements of the Sun, Moon, and planets for the use in astrology. In 6th century BC Greece, this was also discovered\n585 BC\nThales of Miletus is said to have predicted a solar eclipse. He said \"it will happen today.\"\n467 BC\nAnaxagoras produced a correct explanation for eclipses and then described the Sun as a fiery mass larger than the Peloponnese, as well as attempting to explain rainbows and meteors. He was the first to explain that the Moon shines due to reflected light from the Sun.\n400 BC\nAround this date, Babylonians use the zodiac to divide the heavens sexagesimally into twelve equal segments of thirty degrees each, the better to record and communicate information about the position of celestial bodies.\n387 BC\nPlato, a Greek philosopher, founds a school (the Platonic Academy) that will influence the next 2000 years. Borrowing and expanding from Pythagoreanism, it promotes the idea that everything in the universe moves in harmony and that the Sun, Moon, and planets move around Earth in perfect circles.\n380 BC\nAristotle, a Greek polymath, described motion of physical objects based on their affinity with one of four classical elements: earth, water, air, or fire.\n350 BC\nThe astronomer Shi Shen is believed to have cataloged 809 stars in 122 constellations, and he also made the earliest known observation of sunspots.\n270 BC\nAristarchus of Samos proposes heliocentrism as an alternative to the Earth-centered universe. His heliocentric model places the Sun at its center, with Earth as just one planet orbiting it. However, there were only a few people who took the theory seriously.\n240 BC\nThe earliest recorded sighting of Halley's Comet is made by Chinese astronomers. Their records of the comet's movement allow astronomers today to predict accurately how the comet's orbit changes over the centuries.\n170 BC\nHipparchus incidentally discovered of the precession of the equinoxes.\n70 BC\nVitruvius explains that an object’s fall speed depends on their specific gravity.\nAD 140\nPtolemy publishes his star catalogue, listing 48 constellations and endorses the geocentric (Earth-centered) view of the universe. His views go unquestioned for nearly 1500 years in Europe and are passed down to Arabic and medieval European astronomers in his book the Almagest. He also proposed astronomical calculation of the sidereal revolution of planets.\nMiddle ages\nAD 400\nThe Hindu cosmological time cycles explained in the Surya Siddhanta, give the average length of the sidereal year (the length of the Earth's revolution around the Sun) as 365.2563627 days, which is only 1.4 seconds longer than the modern value of 365.256363004 days. This remains the most accurate estimate for the length of the sidereal year anywhere in the world for over a thousand years.\nAD 499\nIndian mathematician-astronomer Aryabhata, in his Aryabhatiya first explain the  elliptical model of the planets, where the planets spin on their axis and follow elliptical orbits, the Sun and the Moon revolve around the Earth in epicycles. He also writes that the planets and the Moon do not have their own light but reflect the light of the Sun and that the Earth rotates on its axis causing day and night and also that the Sun rotates around the Earth causing years.\nAD 628\nIndian mathematician-astronomer Brahmagupta, in his Brāhmasphuṭasiddhānta, first recognizes gravity as a force of attraction. He gives methods for calculations of the motions and places of various planets, their rising and setting, conjunctions, and calculations of the solar and lunar eclipses.\nAD 773\nThe Sanskrit works of Aryabhata and Brahmagupta, along with the Sanskrit text Surya Siddhanta, are translated into Arabic, introducing Arabic astronomers to Indian astronomy.\nAD 777\nMuḥammad ibn Ibrāhīm al-Fazārī and Yaʿqūb ibn Ṭāriq translate the Surya Siddhanta and Brahmasphutasiddhanta, and compile them as the Zij al-Sindhind, the first Zij treatise.\nAD 830\nThe first major Arabic work of astronomy is the Zij al-Sindh by Muhammad ibn Musa al-Khwarizmi. The work contains tables for the movements of the Sun, the Moon, and the five planets known at the time. The work is significant as it introduced Ptolemaic concepts into Islamic sciences. This work also marks the turning point in Arabic astronomy. Hitherto, Arabic astronomers had adopted a primarily research approach to the field, translating works of others and learning already discovered knowledge. Al-Khwarizmi's work marked the beginning of nontraditional methods of study and calculations.\nAD 850\nal-Farghani wrote Kitab fi Jawani (\"A compendium of the science of stars\"). The book primarily gave a summary of Ptolemic cosmography. However, it also corrected Ptolemy based on findings of earlier Arab astronomers. Al-Farghani gave revised values for the obliquity of the ecliptic, the precessional movement of the apogees of the Sun and the Moon, and the circumference of the Earth. The books were widely circulated through the Muslim world and even translated into Latin.\nAD 928\nThe earliest surviving astrolabe is constructed by astronomer Nastulus.\nAD 1030\nAl-Biruni discussed the Indian geocentric theories of Aryabhata, Brahmagupta and Varāhamihira in his ''Ta'rikh al-Hind (Indica in Latin). Biruni stated that the followers of Aryabhata consider the Earth to be at the center. In fact, Biruni casually stated that this does not create any mathematical problems.\nAD 1031\nAl-Sijzi, a contemporary of Al-Biruni, defended the theory that Earth rotates on its axis.\nAD 1054\nChinese astronomers record the sudden appearance of a bright star. Native-American rock carvings also show the brilliant star close to the Moon. This star is the Crab supernova exploding.\nAD 1070\nAbu Ubayd al-Juzjani published the Tarik al-Aflak. In his work, he indicated the so-called \"equant\" problem of the Ptolemic model. Al-Juzjani even proposed a solution to the problem. In al-Andalus, the anonymous work al-Istidrak ala Batlamyus (meaning \"Recapitulation regarding Ptolemy\"), included a list of objections to the Ptolemic astronomy.\nOne of the most important works in the period was Al-Shukuk ala Batlamyus (\"Doubts on Ptolemy\"). In this, the author summed up the inconsistencies of the Ptolemic models. Many astronomers took up the challenge posed in this work, namely to develop alternate models that evaded such errors.\nAD 1126\nIslamic and Indian astronomical works (including Aryabhatiya and Brahma-Sphuta-Siddhanta) are translated into Latin in Córdoba, Spain in 1126, introducing European astronomers to Islamic and Indian astronomy.\nAD 1150\nIndian mathematician-astronomer Bhāskara II, in his Siddhanta Shiromani'', calculates the longitudes and latitudes of the planets, lunar and solar eclipses, risings and settings, the Moon's lunar crescent, syzygies, and conjunctions of the planets with each other and with the fixed stars, and explains the three problems of diurnal rotation. He also calculates the planetary mean motion, ellipses, first visibilities of the planets, the lunar crescent, the seasons, and the length of the Earth's revolution around the Sun to 9 decimal places.\nAD 1190\nNur ad-Din al-Bitruji proposed an alternative geocentric system to Ptolemy's. He also declared the Ptolemaic system as mathematical, and not physical. His alternative system spread through most of Europe during the 13th century, with debates and refutations of his ideas continued to the 16th century.\nAD 1250\nMu'ayyad al-Din al-Urdi develops the Urdi lemma, which is later used in the Copernican heliocentric model.\nNasir al-Din al-Tusi resolved significant problems in the Ptolemaic system by developing the Tusi-couple as an alternative to the physically problematic equant introduced by Ptolemy. His Tusi-couple is later used in the Copernican model.\nTusi's student Qutb al-Din al-Shirazi, in his The Limit of Accomplishment concerning Knowledge of the Heavens, discusses the possibility of heliocentrism.\nNajm al-Din al-Qazwini al-Katibi, who also worked at the Maraghah observatory, in his ''Hikmat al-'Ain, wrote an argument for a heliocentric model, though he later abandoned the idea.\nAD 1350\nIbn al-Shatir (1304–1375), in his A Final Inquiry Concerning the Rectification of Planetary Theory, eliminated the need for an equant by introducing an extra epicycle, departing from the Ptolemaic system in a way very similar to what Copernicus later also did. Ibn al-Shatir proposed a system that was only approximately geocentric, rather than exactly so, having demonstrated trigonometrically that the Earth was not the exact center of the universe. His rectification is later used in the Copernican model.\nRenaissance and Age of Enlightenment\n16th century\nAD 1500\nNilakantha Somayaji proposes a model very similar to the Tychonic system and his equation for the centre for the planets Mercury and Venus were the most accurate until Johannes Kepler\nAD 1543\nNicolaus Copernicus publishes De revolutionibus orbium coelestium'' containing his theory that Earth travels around the Sun. However, he complicates his theory by retaining Plato's perfect circular orbits of the planets.\nAD 1572\nA brilliant supernova (SN 1572 – thought at the time to be a comet) is observed by Tycho Brahe, who proves that it is traveling beyond Earth's atmosphere and therefore provides the first evidence that the heavens can change.\n17th century\nAD 1608\nDutch eyeglass maker Hans Lippershey tries to patent a refracting telescope (the first historical record of one). The invention spreads rapidly across Europe, as scientists make their own instruments. Their discoveries begin a revolution in astronomy.\nAD 1609\nJohannes Kepler publishes his New Astronomy. In this and later works, he announces his three laws of planetary motion, replacing the circular orbits of Plato with elliptical ones. Almanacs based on Johannes' laws prove to be highly accurate.\nAD 1610\nGalileo Galilei publishes Sidereus Nuncius describing the findings of his observations with the telescope he built. These include spots on the Sun, craters on the Moon, and four satellites of Jupiter. Proving that not everything orbits Earth, he promotes the Copernican view of a Sun-centered universe.\nAD 1655\nAs the power and the quality of the telescopes increase, Christiaan Huygens studies Saturn and discovers its largest satellite, Titan. He also explains Saturn's appearance, suggesting the planet is surrounded by a thin ring.\nAD 1663\nScottish astronomer James Gregory describes his \"gregorian\" reflecting telescope, using parabolic mirrors instead of lenses to reduce chromatic aberration and spherical aberration, but is unable to build one.\nAD 1668\nIsaac Newton builds the first reflecting telescope, his Newtonian telescope.\nAD 1687\nIsaac Newton publishes his first copy of the book Philosophiae Naturalis Principia Mathematica, establishing the theory of gravitation and laws of motion. The Principia explains Kepler's laws of planetary motion and allows astronomers to understand the forces acting between the Sun, the planets, and their moons.\n18th century\n1705\nEdmond Halley calculates that the comets recorded at 76-year intervals from 1456 to 1682 are one and the same. He predicts that the comet will return again in 1758. When it reappears as expected, the comet is named in his honor.\n1750\nFrench astronomer Nicolas de Lacaille sails to southern oceans and begins work compiling a catalog of more than 10,000 stars in the southern sky. Although Halley and others have observed from the Southern Hemisphere before, Lacaille's star catalog is the first comprehensive one of the southern sky.\n1781\nAmateur astronomer William Herschel discovers the planet Uranus, although he at first mistakes it for a comet. Uranus is the first planet to be discovered beyond Saturn, which was thought to be the most distant planet in ancient times.\n1784\nCharles Messier publishes his catalog of star clusters and nebulas. Messier draws up the list to prevent these objects from being identified as comets. However, it soon becomes a standard reference for the study of star clusters and nebulas and is still in use today.\n19th century\n1800\nWilliam Herschel splits sunlight through a prism and with a thermometer, measures the energy given out by different colours. He notices a sudden increase in energy beyond the red end of the spectrum, discovering invisible infrared and laying the foundations of spectroscopy.\n1801\nItalian astronomer Giuseppe Piazzi discovers what appears to be a new planet orbiting between Mars and Jupiter, and names it Ceres. William Herschel proves it is a very small object, calculating it to be only 320&nbsp;km in diameter, and not a planet. He proposes the name asteroid, and soon other similar bodies are being found. We now know that Ceres is 932&nbsp;km in diameter, and is now considered to be a dwarf planet.\n1814\nJoseph von Fraunhofer builds the first accurate spectrometer and uses it to study the spectrum of the Sun's light. He discovers and maps hundreds of fine dark lines crossing the solar spectrum. In 1859 these lines are linked to chemical elements in the Sun's atmosphere. Spectroscopy becomes a method for studying what stars are made of.\n1838\nFriedrich Bessel successfully uses the method of stellar parallax, the effect of Earth's annual movement around the Sun, to calculate the distance to 61 Cygni, the first star other than the Sun to have its distance from Earth measured. Bessel's is a truly accurate measurement of stellar positions, and the parallax technique establishes a framework for measuring the scale of the universe.\n1843\nGerman amateur astronomer Heinrich Schwabe, who had been studying the Sun for the past 17 years, announces his discovery of a regular cycle in sunspot numbers - the first clue to the Sun's internal structure.\n1845\nIrish astronomer William Parsons, 3rd Earl of Rosse completes the first of the world's great telescopes, with a 180-cm mirror. He uses it to study and draw the structure of nebulas, and within a few months discovers the spiral structure of the Whirlpool Galaxy.\nFrench physicists Jean Foucault and Armand Fizeau take the first detailed photographs of the Sun's surface through a telescope - the birth of scientific astrophotography. Within five years, astronomers produce the first detailed photographs of the Moon. Early film is not sensitive enough to image stars.\n1846\nA new planet, Neptune, is identified by German astronomer Johann Gottfried Galle while searching in the position suggested by Urbain Le Verrier. Le Verrier has calculated the position and size of the planet from the effects of its gravitational pull on the orbit of Uranus. An English mathematician, John Couch Adams, also made a similar calculation a year earlier.\n1868\nAstronomers notice a new bright emission line in the spectrum of the Sun's atmosphere during an eclipse. The emission line is caused by an element's giving out light, and British astronomer Norman Lockyer concludes that it is an element unknown on Earth. He calls it helium, from the Greek word for the Sun. Nearly 30 years later, helium is found on Earth.\n1872\nAn American astronomer Henry Draper takes the first photograph of the spectrum of a star (Vega), showing absorption lines that reveal its chemical makeup. Astronomers begin to see that spectroscopy is the key to understanding how stars evolve. William Huggins uses absorption lines to measure the redshifts of stars, which give the first indication of how fast stars are moving.\n1895\nKonstantin Tsiolkovsky publishes his first article on the possibility of space flight. His greatest discovery is that a rocket, unlike other forms of propulsion, will work in a vacuum. He also outlines the principle of a multistage launch vehicle.\n20th century\n1901\nA comprehensive survey of stars, the Henry Draper Catalogue, is published. In the catalog, Annie Jump Cannon proposes a sequence of classifying stars by the absorption lines in their spectra, which is still in use today.\n1906\nEjnar Hertzsprung establishes the standard for measuring the true brightness of a star. He shows that there is a relationship between color and absolute magnitude for 90% of the stars in the Milky Way Galaxy. In 1913, Henry Norris Russell published a diagram that shows this relationship. Although astronomers agree that the diagram shows the sequence in which stars evolve, they argue about which way the sequence progresses. Arthur Eddington finally settles the controversy in 1924.\n1910\nWilliamina Fleming publishes her discovery of white dwarf stars.\n1912\nHenrietta Swan Leavitt discovers the period-luminosity relation for Cepheid variables, where the intrinsic brightness of a star is proportional to its luminosity oscillation period. It opened a whole new branch of possibilities of measuring distances on the universe, and this discovery was the basis for the work done by Edwin Hubble on extragalactic astronomy.\n1916\nGerman physicist Karl Schwarzschild uses Albert Einstein's theory of general relativity to lay the groundwork for black hole theory. He suggests that if any star collapse to a certain size or smaller, its gravity will be so strong that no form of radiation will escape from it.\n1923\nEdwin Hubble discovers a Cepheid variable star in the \"Andromeda Nebula\" and proves that Andromeda and other nebulas are galaxies far beyond our own. By 1925, he produces a classification system for galaxies.\n1925\nCecilia Payne-Gaposchkin discovers that hydrogen is the most abundant element in the Sun's atmosphere, and accordingly, the most abundant element in the universe by relating the spectral classes of stars to their actual temperatures and by applying the ionization theory developed by Indian physicist Meghnad Saha. This opens the path for the study of stellar atmospheres and chemical abundances, contributing to understand the chemical evolution of the universe.\n1926\nRobert Goddard launches the first rocket powered by liquid fuel. He also demonstrates that a rocket can work in a vacuum. His later rockets break the sound barrier for the first time.\n1929\nEdwin Hubble discovered that the universe is expanding and that the farther away a galaxy is, the faster it is moving away from us. Two years later, Georges Lemaître suggests that the expansion can be traced to an initial \"Big Bang\".\n1930\nBy applying new ideas from subatomic physics, Subrahmanyan Chandrasekhar predicts that the atoms in a white dwarf star of more than 1.44 solar masses will disintegrate, causing the star to collapse violently. In 1933, Walter Baade and Fritz Zwicky describe the neutron star that results from this collapse, causing a supernova explosion.\nClyde Tombaugh discovers the dwarf planet Pluto at the Lowell Observatory in Flagstaff, Arizona. The object is so faint and moving so slowly that he has to compare photos taken several nights apart.\n1932\nKarl Jansky detects the first radio waves coming from space. In 1942, radio waves from the Sun are detected. Seven years later radio astronomers identify the first distant source – the Crab Nebula, and the galaxies Centaurus A and M87.\n1938\nGerman physicist Hans Bethe explains how stars generate energy. He outlines a series of nuclear fusion reactions that turn hydrogen into helium and release enormous amounts of energy in a star's core. These reactions use the star's hydrogen very slowly, allowing it to burn for billions of years.\n1944\nA team of German scientists led by Wernher von Braun develops the V-2, the first rocket-powered ballistic missile. Scientists and engineers from Braun's team were captured at the end of World War II and drafted into the American and Soviet rocket programs.\n1947\nThe US sent up the first animals in space although not into orbit, through a V-2 rocket launched from White Sands Missile Range, New Mexico. The animals were fruit flies.\n1948\nThe largest telescope in the world, with a 5.08m (200&nbsp;in) mirror, is completed at Palomar Mountain in California. At the time, the telescope pushes single-mirror telescope technology to its limits – large mirrors tend to bend under their own weight.\n1957\nThe Soviet Union launches the first artificial satellite, Sputnik 1, into orbit, beginning the space age. The US launches its first satellite, Explorer 1, four months later.\n1958\nJuly 29 marks the beginning of the NASA (National Aeronautics and Space Administration), agency newly created by the United States to catch up with Soviet space technologies. It absorbs all research centers and staffs of the NACA (National Advisory Committee for Aeronautics), an organization founded in 1915.\n1959\nThe USSR and the US both launch probes to the Moon, but NASA's Pioneer probes all failed. The Soviet Luna program was more successful. Luna 2 crash-lands on the Moon's surface in September, and Luna 3 returns the first pictures of the Moon's farside in October.\n1960\nCornell University astronomer Frank Drake performed the first modern SETI experiment, named \"Project Ozma\", after the Queen of Oz in L. Frank Baum's fantasy books.\n1961\nAs part of NASA's Mercury-Redstone 2 mission, the chimpanzee Ham becomes the first Hominidae in space. Yuri Gagarin becomes the first person to orbit Earth in April. NASA astronaut Alan Shepard becomes the first American in space a month later, but does not go into orbit.\n1962\nJohn Glenn becomes the first American to orbit Earth. Mariner 2 becomes the first probe to reach another planet, flying past Venus in December. NASA follows this with the successful Mariner 4 mission to Mars in 1965, both the US and the USSR send many more probes to planets through the rest of the 1960s and 1970s.\n1963\nDutch-American astronomer Maarten Schmidt measures the spectra of quasars, the mysterious star-like radio sources discovered in 1960. He establishes that quasars are active galaxies, and among the most distant objects in the universe.\n1964\nNikolai Kardashev makes the Kardashev Scale to measure the power of civilizations.\n1965\nArno Penzias and Robert Wilson announce the discovery of a weak radio signal coming from all parts of the sky. Scientists figure out that this must be emitted by an object at a temperature of −270&nbsp;°C. Soon it is recognized as the remnant of the very hot radiation from the Big Bang that created the universe 13 billion years ago, see Cosmic microwave background.\n1966\nSoviet Luna 9 probe makes the first successful soft landing on the Moon in January, while the US lands the far more complex Surveyor missions, which follows up to NASA's Ranger series of crash-landers, scout sites for possible crewed landings.\n1967\nJocelyn Bell Burnell and Antony Hewish detected the first pulsar, an object emitting regular pulses of radio waves. Pulsars are eventually recognized as rapidly spinning neutron stars with intense magnetic fields - the remains of a supernova explosion.\n1968\nNASA's Apollo 8 mission becomes the first human spaceflight mission to enter the gravitational influence of another celestial body and to orbit it.\n1969\nThe US wins the race for the Moon as Neil Armstrong and Buzz Aldrin step onto the lunar surface on July 20. Apollo 11 is followed by five further landing missions, three carrying a sophisticated Lunar Roving Vehicle.\n1970\nThe Uhuru satellite, designed to map the sky at X-ray wavelengths, is launched by NASA. The existence of X-rays from the Sun and a few other stars has already been found using rocket-launched experiments, but Uhuru charts more than 300 X-ray sources, including several possible black holes.\n1971\nThe USSR launches its first space station Salyut 1 into orbit. It is followed by a series of stations, culminating with Mir in 1986. A permanent platform in orbit allows cosmonauts to carry out serious research and to set a series of new duration records for spaceflight.\n1972\nCharles Thomas Bolton was the first astronomer to present irrefutable evidence of the existence of a black hole.\n1975\nThe Soviet probe Venera 9 lands on the surface of Venus and sends back the first picture of its surface. The first probe to land on another planet, Venera 7 in 1970, had no camera. Both break down within an hour in the hostile atmosphere.\n1976\nNASA's Viking 1 and Viking 2 space probes arrive at Mars. Each Viking mission consists of an orbiter, which photographs the planet from above, and a lander, which touches down on the surface, analyzes the rocks, and searches unsuccessfully for life.\n1977\nOn August 20 the Voyager 2 space probe launched by NASA to study the Jovian system, Saturnian system, Uranian system, Neptunian system, the Kuiper belt, the heliosphere and the interstellar space.\nOn September 5 The Voyager 1 space probe launched by NASA to study the Jovian system, Saturnian system and the interstellar medium.\n1981\nSpace Shuttle Columbia, the first of NASA's reusable Space Shuttles, makes its maiden flight, ten years in development, the Shuttle will make space travel routine and eventually open the path for a new International Space Station.\n1983\nThe first infrared astronomy satellite, IRAS, is launched. It must be cooled to extremely low temperatures with liquid helium, and it operates for only 300 days before the supply of helium is exhausted. During this time it completes an infrared survey of 98% of the sky.\n1986\nNASA's spaceflight program comes to a halt when Space Shuttle Challenger explodes shortly after launch. A thorough inquiry and modifications to the rest of the fleet kept the shuttles on the ground for nearly three years.\nThe returning Halley's Comet is met by a fleet of five probes from the USSR, Japan, and Europe. The most ambitious is the European Space Agency's Giotto spacecraft, which flies through the comet's coma and photographs the nucleus.\n1989\nThe Magellan probe, launched by NASA, arrives at Venus and spends three years mapping the planet with radar. Magellan is the first in a new wave of probes that include Galileo, which arrives at Jupiter in 1995, and Cassini which arrives at Saturn in 2004.\n1990\nThe Hubble Space Telescope, the first large optical telescope in orbit, is launched using the Space Shuttle, but astronomers soon discovered that it is crippled by a problem with its mirror. A complex repair mission in 1993 allows the telescope to start producing spectacular images of distant stars, nebulae, and galaxies.\n1992\nThe Cosmic Background Explorer satellite produces a detailed map of the background radiation remaining from the Big Bang. The map shows \"ripples\", caused by slight variations in the density of the early universe&nbsp;– the seeds of galaxies and galaxy clusters.\nThe 10-meter Keck telescope on Mauna Kea, Hawaii, is completed. The first revolutionary new wave of telescopes, the Keck's main mirror is made of 36 six-sided segments, with computers to control their alignment. New optical telescopes also make use of interferometry&nbsp;– improving resolution by combining images from separate telescopes.\n1995\nThe first exoplanet, 51 Pegasi b, is discovered by Michel Mayor and Didier Queloz.\n1998\nConstruction work on a huge new space station named ISS has begun. A joint venture between many countries, including former space rivals Russia and the US.\nThe accelerated expansion was discovered during 1998, by two independent projects, the Supernova Cosmology Project and the High-Z Supernova Search Team, which both used distant type Ia supernovae to measure the acceleration.\n21st century\n2003\nSpace Shuttle Columbia disintegrates upon reentry into Earth's atmosphere\n2005\nMike Brown and his team discovered Eris a large body in the outer Solar System which was temporarily named as . Initially, it appeared larger than Pluto and was called the tenth planet.\n2006\nInternational Astronomical Union (IAU) adopted a new definition of planet. A new distinct class of objects called dwarf planets was also decided. Pluto was redefined as a dwarf planet along with Ceres and Eris, formerly known as . Eris was named after the IAU General Assembly in 2006.\n2008\n2008 TC3 becomes the first Earth-impacting meteoroid spotted and tracked prior to impact.\n2012\n(May 2) First visual proof of the existence of black holes is published. Suvi Gezari's team in Johns Hopkins University, using the Hawaiian telescope Pan-STARRS 1, record images of a supermassive black hole 2.7 million light-years away that is swallowing a red giant.\n2013\nIn October 2013, the first extrasolar asteroid is detected around white dwarf star GD 61. It is also the first detected extrasolar body which contains water in liquid or solid form.\n2015\nOn July 14, with the successful encounter of Pluto by NASA's New Horizons spacecraft, the United States became the first nation to explore all of the nine major planets recognized in 1981. Later on September 14, LIGO was the first to directly detect gravitational waves.\n2016\nExoplanet Proxima Centauri b is discovered around Proxima Centauri by the European Southern Observatory, making it the closest known exoplanet to the Solar System as of 2016.\n2017\nIn August 2017, a neutron star collision that occurred in the galaxy NGC 4993 produced the gravitational wave signal GW170817, which was observed by the LIGO/Virgo collaboration. After 1.7 seconds, it was observed as the gamma-ray burst GRB 170817A by the Fermi Gamma-ray Space Telescope and INTEGRAL, and its optical counterpart SSS17a was detected 11 hours later at the Las Campanas Observatory. Further optical observations e.g. by the Hubble Space Telescope and the Dark Energy Camera, ultraviolet observations by the Swift Gamma-Ray Burst Mission, X-ray observations by the Chandra X-ray Observatory and radio observations by the Karl G. Jansky Very Large Array complemented the detection. This was the first instance of a gravitational wave event that was observed to have a simultaneous electromagnetic signal, thereby marking a significant breakthrough for multi-messenger astronomy. Non-observation of neutrinos is attributed to the jets being strongly off-axis.\n2019\nChina's Chang'e 4 became the first spacecraft to perform a soft landing on the far side of the Moon.\nIn April 2019, the Event Horizon Telescope Collaboration obtained the first image of a black hole which was at the center of galaxy M87, providing more evidence for the existence of supermassive black holes in accordance with general relativity.\nIndia launched its second lunar probe called Chandrayaan-2 with an orbiter that was successful and a lander called Vikram along with a rover called Pragyan which failed just 2.1&nbsp;km above the lunar south pole.\n2020\nNASA launches Mars 2020 to Mars with a Mars rover and a small helicopter that was named Perseverance and Ingenuity by seventh grader Alexander Mather and eleventh grader Vaneeza Rupani respectively in a naming contest. First human orbital spaceflight launched by a private company occurred when SpaceX Demo-2 carrying astronauts Bob Behnken and Doug Hurley was launched to the International Space Station.\nReferences\n:*A. Baker and L. Chapter (2002), \"Part 4: The Sciences\". In M. M. Sharif, \"A History of Muslim Philosophy\", Philosophia Islamica.\n:*Ahmad Dallal, \"Science, Medicine and Technology.\", in The Oxford History of Islam, ed. John Esposito, New York: Oxford University Press, (1999).\n:*Asghar Qadir (1989). Relativity: An Introduction to the Special Theory. World Scientific, Singapore. .\n:*George Saliba (1999). [http://www.columbia.edu/~gas1/project/visions/case1/sci.1.html Whose Science is Arabic Science in Renaissance Europe?] Columbia University."
    }
  ]
}