{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of ITV in Wales\n\nThis is a timeline of the history of ITV in Wales, including the current service ITV Cymru Wales. It does not include events that affect the whole UK network.\n1950s\n* 1956\n** 26 October – Television Wales and the West is awarded the ITV franchise for South Wales and the West of England.\n* 1957\n** No events.\n* 1958\n** 14 January – At 4:45pm, TWW starts broadcasting.\n* 1959\n** No events.\n1960s\n*1960\n** No events.\n*1961\n**Following pressure from Welsh-speaking businessmen, the ITA awards a licence covering a new North and West Wales region to Wales West and North Television.\n*1962\n** 14 September – Wales (West and North) Television launches as Teledu Cymru. This brings ITV to north Wales for the first time, although people living on north east Wales and along much of the north Wales coast had been able to watch ITV since 1956 as this area is within reach of the Winter Hill transmitting station and therefore served by Granada Television.\n*1963\n**Delays in switching on the transmitters at Arfon (north west) and Moel-y-Parc in the north east destroys the finances of WWN. Free programming from the ITV network, plus other support from its neighbours ABC, ATV and TWW just about kept the ship afloat, but Granada decided to dispense with its productions in the Welsh language, and the loss of this programming stream proved fatal to WWN.\n*1964\n** 26 January – Wales (West and North) Television stops broadcasting after going bankrupt. TWW offers a generous package to WWN's shareholders, in order to gain control of the territory, and kept the Teledu Cymru name on the air as a service separate from its existing service to South Wales and the West.\n*1965\n** For the first time, TWW is able to provide separate programming for the whole of Wales and the West of England. This is made possible by the addition of a second VHF transmitter to the St Hilary mast to extend the Teledu Cymru service into south east Wales. Viewers in South Wales are able to receive both services.\n*1966\n** No events.\n* 1967\n** 21 June – TWW loses its licence to the Harlech Consortium. TWW unsuccessfully fought the ITA's decision, both formally and through the press. However, the ITA remained resolute that it is legally entitled to remove any contract at any time for any reason.\n* 1968\n**4 March – TWW stops broadcasting five months before its contract was due to expire, selling the final months of airtime to Harlech. However, the new contractor is not yet ready to go on air, so the ITA provides an interim service called Independent Television Service for Wales and the West.\n**20 May – Harlech Television takes over the Wales and West of England franchise just over two months ahead of the planned hand-over date. It launches two news magazines – Y Dydd (The Day) in Welsh and Report Wales in English. They are broadcast for a full half-hour. Previously, TWW had provided short evening bulletins known as TWW Reports, presented jointly from studios in Cardiff and Bristol, where the station ran a joint news operation covering the two areas.\n** August – A technicians strike forces ITV off the air for several weeks although management manage to launch a temporary ITV Emergency National Service with no regional variations.\n**14 September – The final edition of listings magazine Television Weekly is published. Listings are subsequently carried in an Wales and West of England edition of TVTimes which now becomes a national publication on 21 September.\n* 1969\n** No events.\n1970s\n* 1970\n**6 April – HTV starts broadcasting in colour and from this day, the station becomes known on air as HTV rather than Harlech Television. The service for Wales becomes known as HTV Cymru Wales. (HTV's \"general\" 405-line VHF service for South Wales and the West of England continues as a separate service).\n**30 May - HTV West is launched from the Mendip transmitter.\n* 1971\n** No events.\n* 1972\n** 16 October – Following a law change which removed all restrictions on broadcasting hours, HTV is able to launch an afternoon service.\n* 1973\n** No events.\n* 1974\n** The 1974 franchise round sees no changes in ITV's contractors as it is felt that the huge cost in switching to colour television would have made the companies unable to compete against rivals in a franchise battle.\n* 1975\n** No events.\n* 1976\n** No events.\n* 1977\n** No events.\n* 1978\n** No events.\n* 1979\n** 10 August – The 75 day ITV strike forces HTV off the air. The strike ends on 24 October.\n1980s\n* 1980\n** No events.\n* 1981\n** No events.\n* 1982\n**23 September – HTV launches a weekly current affairs programme Wales This Week. To this day, the programme continues to be broadcast.\n** 31 October – Programmes in Welsh are broadcast on HTV Cymru Wales for the final time as from the following day, all Welsh language programmes both on BBC Wales and HTV transfer to the new Welsh fourth channel S4C.\n**1 November – Following the launch of S4C, HTV's service in Wales becomes a fully English-language service, and is renamed \"HTV Wales\", and it renames its news programme to Wales at Six. However, the \"HTV Cymru Wales\" name continues as the production credit for programmes made for S4C.\n**November – HTV launches a Welsh-language current affairs series on S4C called Y Byd ar Bedwar (The World on Four).\n* 1983\n** 1 February – ITV's breakfast television service TV-am launches. Consequently, HTV's broadcast day now begins at 9:25&nbsp;am.\n* 1984\n** HTV opens a new studio complex at Culverhouse Cross due to its current studios at Pontcanna not having space for expansion to accommodate an increase in studio production.\n* 1985\n** 3 January – This is the last day of transmission using the 405-lines system in Wales, and the switch-off sees the end of HTV's \"general\" service to South Wales and the West of England.\n* 1986\n** No events.\n* 1987\n** 7 September – Following the transfer of ITV Schools to Channel 4 (and S4C), ITV provides a full morning programme schedule, with advertising, for the first time. The new service includes regular five-minute national and regional news bulletins.\n** 28 September – HTV launches a new computer-generated ident.\n* 1988\n** 22 August – HTV begins 24-hour broadcasting.\n* 1989\n** 1 September – ITV introduces its first official logo as part of an attempt to unify the network under one image whilst retaining regional identity. HTV adopts the ident and reverts to the name \"HTV Cymru Wales\" instead of \"HTV Wales\".\n1990s\n* 1990\n** April – Stereo broadcasts begin in Wales following the switching on of NICAM digital stereo from the Wenvoe transmitting station.\n* 1991\n** 28 April – HTV closes down its Night Club and replaces it with a simulcast of the overnight generic service from London.\n** 16 October – HTV retains its licence to broadcast when it bids the highest amount of a total of four applicants, although it is financially damaged by the process.\n* 1992\n** No events.\n* 1993\n** 1 January – To coincide with the start of this new franchise period, HTV launches a new set of idents.\n* 1994\n** 18 February – Flextech buys a 20% stake in the company, thereby clearing HTV's debts.\n**28 February – Wales at Six is replaced by Wales Tonight.\n* 1995\n** 1 January – HTV launches a new set of idents.\n** September – Flextech sells its 20% stake in HTV to Scottish Television.\n* 1996\n** October – United News & Media buys Scottish Television's 20% stake in HTV.\n* 1997\n** 28 June – HTV is fully taken over by United News & Media.\n* 1998\n** 15 November – The public launch of digital terrestrial TV in the UK takes place.\n* 1999\n** 8 March – Wales Tonight is renamed HTV Wales News.\n** 8 November – A new, hearts-based on-air look is introduced and HTV adopts its version of the ident.\n2000s\n* 2000\n** Granada plc buys United's television interests, but competition regulations limited the extent to which one company could control the ITV network, and Granada was consequently forced to give up one of its ITV franchises. This resulted in a break-up of HTV, whereby its broadcast facilities and Channel 3 broadcast licence (and hence its advertising revenues) are sold to Carlton Communications plc, owners of Carlton Television, whilst the majority of production facilities are retained by Granada.\n* 2001\n** No events.\n* 2002\n** 28 October – On-air regional identities are dropped apart from when introducing regional programmes and HTV's service in Wales is renamed ITV1 Wales.\n* 2003\n** No events.\n* 2004\n** January – The final two remaining English ITV companies, Carlton and Granada, merge to create a single England and Wales ITV company called ITV plc.\n** 2 February – HTV News is renamed ITV Wales News.\n*2005\n** The Ferryside television relay station in Carmarthenshire is chosen as the site of the UK's experimental switchover trial, and as such becomes the first UK TV transmitter to be converted to digital transmission.\n** 14 November — ITV Wales News is renamed back to Wales Tonight.\n* 2006\n** 29 December – HTV Ltd is renamed ITV Wales & West Ltd.\n* 2007\n** No events.\n* 2008\n** No events.\n* 2009\n** 9 September – Digital switchover begins in Wales when the Kilvey Hill transmitter is the first of eight main transmitters to complete digital switchover.\n2010s\n*2010\n** 31 March – Digital switchover is completed in Wales when the analogue transmissions at Wenvoe are switched off.\n*2011\n** 11 January – ITV Wales +1 is launched.\n*2012\n** No events.\n*2013\n**14 January – As part of a rebranding of ITV Wales, a new logo is introduced and the Wales news magazine is renamed ITV News Cymru Wales in 2013.\n**22 September – A new weekly current affairs programme, Newsweek Wales, is launched and is broadcast at Sunday lunchtime.\n*2014\n**1 January – ITV in Wales is now officially known as ITV Cymru Wales, and gains its own franchise instead of being part of the \"Wales and West\" franchise.\n**30 June – ITV Cymru Wales moves into a new facility on the ground floor of 3 Assembly Square, located next to the Welsh Assembly in Cardiff Bay and to mark the change, the Wales at Six name is reintroduced after 20 years.\n*2015\n** 25 August – ITV Cymru Wales begins broadcasting in HD.\nSee also\n* History of ITV\n* History of ITV television idents\n* Timeline of ITV\n* Timeline of television in Wales\nReferences"
    }
  ]
}