{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Scottish history\n\nThis is a timeline of Scottish history, comprising important legal and territorial changes and political events in Scotland and its predecessor states. See also Timeline of prehistoric Scotland.\n__NOTOC__\nTo read about the background to many of these events, see History of Scotland. More information can also be found in the list of Scottish monarchs, list of British monarchs, list of first ministers of Scotland, and list of years in Scotland.\nCenturies: 1st2nd3rd4th5th6th7th8th9th10th11th12th13th14th15th16th17th18th19th20th21st\n1st century\n{| class=\"wikitable\"\n! style=\"width:6en;align:right\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 83/84\n| || Romans defeat Caledonians at the Battle of Mons Graupius.\n|}\n2nd century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 122 || || Romans construct Hadrian's Wall.\n|-\n| 143 || || Romans construct Antonine Wall.\n|-\n| 163 || || Romans withdraw south to Trimontium and Hadrian's Wall.\n|}\n3rd century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 300 || || The term Pict is first recorded in describing the federated tribes invaded by Constantius Chlorus.\n|}\n4th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 397 || || Traditional date at which Saint Ninian establishes a Christian mission at Whithorn.\n|}\n5th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 470 || || Votadini peoples form the kingdom of Gododdin in the region north of the River Tweed.\n|}\n6th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 547 || || Angles capture the Northumbrian fortress at Bamburgh and found the kingdom of Bernicia.\n|-\n| 563 || || Saint Columba founds a monastery at Iona and begins his mission to the northern Picts.\n|-\n| 574 || || Áedán mac Gabráin begins reign over the Gaelic kingdom of Dál Riata.\n|-\n| 575 || ||  Western Scotland is granted independence from the Irish Dalriada, after a convention at Drum Ceatt near Derry.\n|-\n| 580 || || Riderch I of Alt Clut rules region later known as the kingdom of Strathclyde.\n|-\n| 584 || || Bruide, son of Maelchon, dies.\n|}\n7th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 604 || || Æthelfrith unites Bernicia and Deira to form the kingdom of Northumbria.\n|-\n| 638 || || Northumbrians capture Edinburgh from Gododdin.\n|-\n| 680 || || Trumwine Bishop of Abercorn.\n|-\n| 681 || || Bruide mac Bili, King of Fortriu, campaigns against Orkney.\n|-\n| 685 || || Pictish King Bruide mac Bili defeats Ecgfrith of Northumbria at the Battle of Dun Nechtain, halting the northern expansion of Northumbria.\n|-\n| 693 || || Bruide mac Bili dies.\n|-\n| 697 || || Bruide mac Der-Ilei among the signatories of the Cáin Adomnáin.\n|}\n8th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 717 || || Nechtan mac Der-Ilei expels Ionan clergy from Pictland and adopts Roman usages with the aid of Bishop Curetán; masons sent by Abbot Ceolfrid of Monkwearmouth-Jarrow Priory help build stone churches at Restenneth, Rosemarkie and elsewhere in eastern Scotland.\n|-\n| 724 || || Drust and Nechtan mac Der-Ilei fight civil war (to 729).\n|-\n| 732 || || Death of Nechtan mac Der-Ilei; Óengus mac Fergusa becomes King of the Picts.\n|-\n| 735 || || Óengus mac Fergusa, King of the Picts, campaigns against Dál Riata, and seizes and burns the royal centre of Dunadd.\n|-\n| 736 || || Battle of Cnoc Coirpi between Fortriu and Dál Riata.\n|-\n| 741 || || Battle of Druimm Cathmail between Fortriu and Dál Riata; the \"smiting of Dál Riata\", in which Dál Riata is subdued by Óengus mac Fergusa.\n|-\n| 747 || || St Andrews founded by this time, death of Abbot Túathalán.\n|-\n| 750 || || Picts defeated by Britons at the Battle of Catohic.\n|-\n| 756 || || Óengus mac Fergusa allied with the English of Northumbria attacks the Britons; the English army is destroyed.\n|-\n| 761 || || Death of Óengus mac Fergusa.\n|-\n| 763 || || Battle takes place in Fortriu between Ciniod and Áed Find; result unknown.\n|-\n| 778 || || Death of Áed Find, King of Dál Riata.\n|-\n| 794 || || Annals of Ulster report the \"wasting\" of \"all the islands of Britain by gentiles [Vikings]\".\n|}\n9th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 802 || || Iona burned by Vikings.\n|-\n| 806 || || The monasteries under Iona are attacked by Vikings, killing 68 monks.\n|-\n| 820 || || Death of Caustantín mac Fergusa.\n|-\n| 829 || || Abbot Diarmait, abbot of Iona, goes to Alba with relics of St Columba.\n|-\n| 831 || || Diarmait of Iona goes to Ireland with relics of St Columba.\n|-\n| 839 || || Eóganan mac Óengusa and his brother Bran killed in battle with Vikings, end of dominance of Fortriu.\n|-\n| 858 || || Death of Kenneth mac Alpin, King of the Picts; \"union of Picts and Scots\" traditionally dated from his reign.\n|-\n| 870 || || Alt Clut—Dumbarton Rock — captured by the Norse-Gael or Viking leaders Amlaíb Conung and Ímar after a six-month of siege.\n|-\n| 878 || || Kenneth mac Alpin's son Áed killed; Giric becomes king.\n|-\n| 889 || || Death of Giric; Domnall mac Causantín, grandson of Kenneth, becomes king.\n|-\n| 890 || || The Strathclyde Britons are exiled to the Gwynedd in Wales.\n|}\n10th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 900 || || Causantín mac Áeda succeeds Domnall mac Causantín.\n|-\n| 937 || || Battle of Brunanburh English victory in 937 by the army of Æthelstan, King of England, and his brother Edmund over the combined armies of Olaf III Guthfrithson, the Norse-Gael King of Dublin, Constantine II, King of Scots, and Owen I, King of Strathclyde.\n|-\n| 940 || || Saint Catroe of Metz leaves Scotland.\n|-\n| 943 || || Causantín mac Áeda abdicates to become a culdee at St Andrews.\n|-\n| 952 || || Death of Causantín mac Áeda.\n|-\n| 954 || || Indulf captures Edinburgh from Northumbria.\n|}\n11th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1058 || || After defeating Mac Bethad and Lulach, Máel Coluim III is proclaimed king.\n|-\n| 1012 || || Battle of Cruden Bay\n|}\n12th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:10en\" | Date || Event\n|-\n| 1124 || || David I becomes king and introduces the feudal system of landholding to much of Scotland.\n|-\n| 1128 || || David I founds Holyrood Abbey at Edinburgh.\n|-\n| 1136 || || Glasgow Cathedral (St Kentigern's, begun 1123) consecrated in the presence of David I.\n|-\n| 1153 || || Somerled sacks Glasgow and its vicinity.\n|-\n| 1156 || || Somerled defeats the Norse King of Mann and the Isles, establishing his own semi-independent rule as ri Innse Gall-King of the Hebrides.\n|-\n| 1164 || || Somerled is defeated by Malcolm IV in the Battle of Renfrew.\n|-\n| 1174 || || William I signs the Treaty of Falaise in which he swears allegiance to Henry II of England.\n|}\n13th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1234 || || Galloway's independent existence ends with the death of Alan, Lord of Galloway.\n|-\n| 1237 || || Southern border of Scotland established in the Treaty of York.\n|-\n| 1263 || || Scots defeat Norwegians in the Battle of Largs.\n|-\n| 1266 || || Norway cedes the Hebrides and Isle of Man to Scotland in the Treaty of Perth.\n|-\n|1290\n|\n|Margaret, Maid of Norway dies in Orkney.\n|-\n| 1292 || || Edward I of England intervenes in Scottish affairs and grants the Scottish throne to John Balliol.\n|-\n| 1297 || || Andrew de Moravia and William Wallace lead the Scots to victory over England at Stirling Bridge.\n|}\n14th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1305 || || William Wallace is executed in London.\n|-\n| 1314 || || Robert the Bruce defeats the English at Bannockburn.\n|-\n| 1320 || || Nobles assert Scottish independence in the Declaration of Arbroath.\n|-\n| 1328 || || Treaty of Northampton. England recognises Scottish independence.\n|-\n| 1329 || || Death of Robert the Bruce. His 5-year-old son, David II succeeds him.\n|-\n| 1371 || || Robert II becomes first Stewart king.\n|}\n15th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1402 || || English defeat Scots in the Battle of Nesbit Moor and the Battle of Humbleton Hill.\n|-\n| 1413 || || Foundation of the University of St Andrews.\n|-\n| 1451 || || Establishment of the University of Glasgow.\n|-\n| 1468 || || Denmark cedes Orkney and Shetland from Norway to Scotland.\n|-\n| 1488 || || James IV crowned after death of his father James III of Scotland in/after a rebellion—the Battle of Sauchieburn.\n|-\n| 1493 || || Lordship of the Isles abolished.  In 1540 the title was reserved to the crown.\n|-\n| 1495 || || Creation of the University of Aberdeen (King's College).\n|-\n| 1496 || || Education Act 1496 makes education compulsory for barons and wealthy landowners.\n|}\n16th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1513 || || James IV and thousands of Scots are killed at Battle of Flodden.\n|-\n| 1532 || || Creation of the College of Justice and the Court of Session.\n|-\n| 1542 || || Death of James V.\n|-\n| 1544 || || Burning of Edinburgh by an English army\n|-\n| 1547 || || Battle of Pinkie during the War of the Rough Wooing.\n|-\n| 1559 || || John Knox returns to Scotland from Geneva to promote Calvinism.\n|-\n| 1560 || || Parliament legislates Protestant Reformation of the Church of Scotland.\n|-\n| 1561 || || Mary, Queen of Scots returns from France.\n|-\n| 1566 || || Baptism of James VI at Stirling\n|-\n| 1568 || || Mary, Queen of Scots flees to England following the defeat of her army at the Battle of Langside.\n|-\n| 1579 || || James VI takes over government from his regent, James Douglas.\n|-\n| 1582 || || Establishment of the University of Edinburgh by royal charter.\n|-\n| 1587 || || Mary is beheaded by the order of Queen Elizabeth I of England.\n|-\n| 1589 || || James VI marries Anne of Denmark in Oslo.\n|-\n| 1590 || || Entry and coronation of Anne of Denmark in Edinburgh\n|-\n| 1592 || || James VI enacts the \"Golden Act\" recognising the power of Presbyterianism within the Scottish church.\n|-\n| 1594 || || Masque at the baptism of Prince Henry in Stirling\n|}\n17th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1603 || || The Union of the Crowns: James VI of Scotland becomes James I of England.\n|-\n| 1614 || || John Napier invents logarithms and publishes a book promoting their use in mathematics.\n|-\n| 1618 || || James VI forces episcopacy on the Church of Scotland through the Five Articles of Perth.\n|-\n| 1625 || || Charles I of England, Scotland and Ireland is crowned.\n|-\n| 1633 || || Education Act 1633 ordains a school in every parish (partially successful).\n|-\n| 1638 || || Scottish Covenanters rebel against Charles I.\n|-\n| 1639 || || The First Bishops' War.\n|-\n| 1640 || || The Second Bishops' War.\n|-\n| 1642 || || The First English Civil War started.\n|-\n| 1643 || || The Solemn League and Covenant promises Scots army to aid English parliamentarians against the king.\n|-\n| 1646 || || The First English Civil War ended.\n|-\n| 1648 || || The Second English Civil War started.\n|-\n| 1649 || || The Second English Civil War ended. Charles I is executed—ending the monarchy until 1660.\n|-\n| 1649 || || The Third English Civil War started.\n|-\n| 1650 || || Southern Scotland occupied by the English Commonwealth's New Model Army following Scottish defeats at the Battle of Dunbar 1650 and the Battle of Hamilton during the Third English Civil War\n|-\n| 1651 |||| Battle of Worcester was a victory for New Model Army over the last major Royalist field army. Most of the Royalist officers and men who fought at Worcester were Scottish. For the next ten years, apart from some mopping up operations and a few insurrections, (all of which were easily suppressed) there was not further military resistance to rule from London.\n|-\n| 1651 || || The Third English Civil War ended.\n|-\n| 1654 ||5 May||Oliver Cromwell issued a proclamation at the Mercat Cross in Edinburgh. Oliver Cromwell was the Protector of England Ireland and Scotland, that Scotland was united with the Commonwealth of England (Tender of Union) and there was a general pardon with some exceptions for the people of Scotland for any actions taken during the Wars of the Three Kingdoms (Cromwell's Act of Grace).\n|-\n| 1660 ||14 May|| The monarchy is restored in Scotland and Scotland resumes its status as a separate kingdom.\n|-\n| 1661 ||May|| Four men were executed for high treason for their actions against the Crown during the Wars of the Three Kingdoms. Archibald Campbell, 8th Earl of Argyll, James Guthrie, William Govan were all executed in May 1661 (the fourth Archibald Johnston, Lord Warriston fled abroad but returned to Scotland and was executed on 22 July 1663).\n|-\n| 1661 ||6 September ||The restoration of the Episcopacy was proclaimed by the Privy Council of Scotland.\n|-\n| 1662 || ||During the parliamentary session the Church of Scotland was restored as the national Church and all office-holders were required to renounce the Covenant.\n|-\n| 1662 ||9 September||The Scottish parliament passed the Act of indemnity and oblivion. It was a general pardon for most types of crime that may have been committed by Scots, between 1 January 1637 and before 1 September 1660, during what the Act called \"the late troubles\" (the Wars of the Three Kingdoms and the Interregnum).\n|-\n| 1679 || || James, Duke of Monmouth defeats Covenanters at the Battle of Bothwell Brig.\n|-\n| rowspan=\"2\" valign=\"top\" | 1689 || || Jacobite rising of 1689 Highlanders defeat army of William III at Killiecrankie, but are halted at Battle of Dunkeld.\n|-\n| || The Claim of Right and the re-establishment of Presbyterianism.\n|-\n| 1692 || || The Massacre of Glencoe.\n|-\n| 1695 || || The Bank of Scotland is created by an Act of the Parliament.\n|-\n| 1696 || || Education Act 1696 ordains a school in every parish (successful; act governs education until the 1872 act).\n|-\n| 1698 || || The Darien scheme was an unsuccessful attempt by the Kingdom of Scotland to establish a colony called \"New Caledonia\" on the Isthmus of Panama in the 1690s\n|}\n18th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1707 || || The Union of the Parliaments: the Acts of Union are passed by both the Scottish and English parliaments.\n|-\n| 1715 || || Jacobite rising of 1715.\n|-\n| 1745 || || Jacobite rising of 1745.\n|-\n| 1746 || || The Battle of Culloden ends the last Jacobite rising.\n|-\n| 1748 || || David Hume publishes An Enquiry Concerning Human Understanding.\n|- January 25, 1759 the birth of Robert burns\n| 1754 || || Joseph Black discovers \"fixed air\" (carbon dioxide).\n|-\n| 1768 || || The Encyclopædia Britannica First Edition commences publication.\n|-\n| 1769 || || James Watt patents idea for separate condensing chamber in the steam engine.\n|-\n| 1775 || || Passage of the Colliers and Salters (Scotland) Act 1775 commences the removal of life bondage of coal and salt workers.\n|-\n| 1776 || || Adam Smith publishes The Wealth of Nations.\n|-\n|}\n19th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 1802 || || John Playfair publishes summary of James Hutton's theories of geology.\n|-\n| 1805 || || The Glasgow Herald newspaper first published.\n|-\n| 1817 || || The Scotsman newspaper first published.\n|-\n| 1820 || || The \"Radical War\".\n|-\n| 1822 || || Visit of King George IV to Scotland organized by Sir Walter Scott.\n|-\n| 1832 || || The Reform Act enlarges the franchise.\n|-\n| 1843 || || The Disruption in the Church of Scotland (over the issue of patronage).\n|-\n| 1846 || || Beginning of the ten-year Highland Potato Famine.\n|-\n| 1847 || || The United Presbyterian Church of Scotland is established.\n|-\n| 1864 || || James Clerk Maxwell presents equations describing electromagnetic fields.\n|-\n| 1874 || || Patronage abolished in the Church of Scotland.\n|-\n| 1878 || || Collapse of the City of Glasgow Bank.\n|-\n| rowspan=\"2\" valign=\"top\" | 1879 || || William Ewart Gladstone conducts the Midlothian campaign as part of a political comeback.\n|-\n| || The Tay Bridge disaster.\n|-\n| 1885 || || Creation of the Scottish Office and the post of Secretary for Scotland, later Secretary of State for Scotland.\n|-\n| 1890 || || Opening of the Forth Railway Bridge.\n|-\n| 1896 || || Opening of the Glasgow Subway.\n|}\n20th century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year ||  | Date || Event\n|-\n|1919\n|31 January\n|The Battle of George Square\n|-\n| 1929 || || The Church of Scotland and the United Free Church of Scotland unite.\n|-\n| 1934 || || Scottish National Party founded.\n|-\n| 1938 || || The Empire Exhibition, Scotland is held at Bellahouston Park, Glasgow.\n|-\n| 1941 || || The Clydebank Blitz (13–15 March).\n|-\n| 1943 || || Creation of the North of Scotland Hydro-Electric Board to bring electricity to all parts of the Highlands and Islands.\n|-\n| 1945 || || First Scottish Nationalist MP is elected.\n|-\n| rowspan=\"2\" valign=\"top\" | 1947 || || Nationalisation of the railways – the Scottish Region of British Railways is created.\n|-\n| || The first Edinburgh International Festival is held.\n|-\n| 1950 || || The Stone of Destiny is removed from Westminster Abbey.\n|-\n| 1957 || || Scottish Television starts broadcasting.\n|-\n| 1968 || || The General Assembly of the Church of Scotland permits the ordination of women as ministers.\n|-\n| 1975 || || Local government reorganisation (replacing Counties and Burghs for administrative purposes with Regions and Districts).\n|-\n| 1978 || || Launch of BBC Radio Scotland.\n|-\n| 1979 || || Referendum to create a Scottish Assembly wins a majority but fails to win 40% of electorate. Act is therefore repealed without being put into effect.\n|-\n| 1988 || || Terrorists blow up Pan Am Flight 103 over Lockerbie with the loss of 270 lives, including 11 residents of the town.\n|-\n| 1995 || || Local government reorganisation (replacing the Regions and Districts with single-tier councils).\n|-\n| 1996 || || The Stone of Destiny is permanently returned to Scotland, to be housed in Edinburgh Castle.\n|-\n| 1997 || || Newly elected Labour UK Government under the leadership of Scots-born Prime Minister Tony Blair legislates for a referendum on a devolved Scottish Parliament which is passed by a large majority.\n|-\n| 1999 || || A Scottish Parliament sits for the first time in 272 years. Donald Dewar of the Scottish Labour Party elected as First Minister and forms Scottish Executive in coalition with the Scottish Liberal Democrats.\n|}\n21st century\n{| class=\"wikitable\"\n! style=\"width:6en\" | Year || style=\"width:15en\" | Date || Event\n|-\n| 2004 ||9 October || Opening of the new Scottish Parliament Building.\n|-\n| 2007 || || The Scottish National Party become the largest party in the Scottish Parliament and forms a minority government. Alex Salmond becomes the First Minister of Scotland, the first nationalist politician to serve as first minister.\n|-\n| 2011 || || The Scottish National Party under Alex Salmond gain an overall majority of the Scottish Parliament.\n|-\n| 2013 || || The Church of Scotland's ruling General Assembly votes to allow actively gay men and women to become ministers.\n|-\n| 2014 ||18 September || Scotland has a referendum on regaining national independence. The result is to remain a country of the UK, by 55% to 45%.\n|-\n| 2014 ||19 September || Alex Salmond announces his resignation as first minister following defeat in the independence referendum the day prior.\n|-\n| 2014 ||20 November || Nicola Sturgeon becomes first minister and leader of the Scottish National Party (SNP), becoming the first female politician to serve as first minister of Scotland and leader of the SNP.\n|-\n| 2015\n| || The Scottish National Party wins 4.7% of the popular vote in the UK General Election, securing 56 out of the 59 seats in Scotland out of 650 seats in total across the UK.\n|-\n| 2022 || 8 September || The longest reigning monarch of the United Kingdom, Elizabeth II, dies at Balmoral Castle in Aberdeenshire.\n|-\n| 2023 || 15 February || Nicola Sturgeon announces resignation as First Minister of Scotland and leadership of the Scottish National Party.\n|-\n| 2023 || 28 March || Humza Yousaf is elected as the First Minister of Scotland and new leader of Scottish National Party in the first contested leadership election in the SNP in nearly twenty years.\n|-\n| 2024 || 4 July || The Scottish Labour Party wins 40% of the popular vote in Scotland in the UK General Election and became the largest party in the UK Parliament in terms of Scottish seats.\n|-\n| 2025 || 23 January || The Scottish Government send an emergency alert to the public ahead of Storm Éowyn. The alert was sent to the mobile phones of around 4.5 million people. The Scottish Government Resilience Room (SGoRR) is activated by first minister John Swinney to co-ordinate the governments response to the approaching storm.\n|-\n| 2025 || 24 January || Storm Éowyn hits the country. The Met Office issued a rare Red weather warning for strong winds. Winds in excess of 100mph were recorded around the country, and was described at the \"worst storm to hit Scotland in 13 years\".\n|}\nSee also\n*Kings of Scotland family tree\n* Timeline of British history\n*Timeline of prehistoric Scotland\nNotes"
    }
  ]
}