{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of lighting technology\n\n)]]\nArtificial lighting technology began to be developed tens of thousands of years ago and continues to be refined in the present day.\nAntiquity\n* 125,000 BC Widespread control of fire by early humans.\n* 17,500 BC oldest documented lamp, utilizing animal fat as fuel\n*  oil lamps\n* c. 3000 BC candles are invented.\n* 577 CE Use of matches in China.\n18th century\n* 1780 Ami Argand invents the central draught fixed oil lamp.\n* 1784 Argand adds glass chimney to central draught lamp.\n* 1786 William Nicholson proposes use of concentric wicks.\n* 1792 William Murdoch begins experimenting with gas lighting and probably produced the first gas light in this year.\n* 1800 French watchmaker  overcomes the disadvantages of the Argand-type lamps with his clockwork fed Carcel lamp.\n19th century\n* 1800–1809 Humphry Davy invents the arc lamp when using Voltaic piles (battery) for his electrolysis experiments.\n* 1802- Vasily Vladimirovich Petrov developed the first persistent electric arc.\n* 1802 William Murdoch illuminates the exterior of the Soho Foundry with gas.\n* 1805 Philips and Lee's Cotton Mill, Manchester was the first industrial factory to be fully lit by gas.\n* 1809 Humphry Davy publicly demonstrates the first electric lamp over 10,000 lumens, at the Royal Society.\n* 1813 National Heat and Light Company formed by Frederick Albert Winsor.\n* 1815 Humphry Davy invents the miner's safety lamp.\n* 1823 Johann Wolfgang Döbereiner invents the Döbereiner's lamp.\n* 1835 James Bowman Lindsay demonstrates a light bulb based electric lighting system to the citizens of Dundee.\n* 1841 Arc-lighting is used as experimental public lighting in Paris.\n* 1853 Ignacy Łukasiewicz invents the modern kerosene lamp.\n* 1856 glassblower Heinrich Geissler confines the electric arc in a Geissler tube.\n* 1867 Edmond Becquerel demonstrates the first fluorescent lamp.\n* 1874 Alexander Lodygin patents an incandescent light bulb.\n* 1875 Henry Woodward patents an electric light bulb.\n* 1876 Pavel Yablochkov invents the Yablochkov candle, the first practical carbon arc lamp, for public street lighting in Paris.\n* 1879 (About Christmas time) Col. R. E. Crompton illuminated his home in Porchester Gardens, using a primary battery of Grove Cells, then a generator which was better. He gave special parties and illuminated his drawing room and dining room. Source: Practical Electrical Engineering, Newnes. Article entitled \"The Development of Electric Lighting\".\n* 1879 Thomas Edison and Joseph Swan patent the carbon-thread incandescent lamp. It lasted 40 hours.\n* 1880 Edison produced a 16-watt lightbulb that lasted 1500 hours.\n* 1882 Introduction of large scale direct current based indoor incandescent lighting and lighting utility with Edison's first Pearl Street Station\n* c. 1885 Incandescent gas mantle invented, revolutionises gas lighting.\n* 1886 Great Barrington, Massachusetts demonstration project, a much more versatile (long-distance transmission) transformer based alternating current based indoor incandescent lighting system introduced by William Stanley, Jr. working for George Westinghouse.  Stanley lit 23 businesses along a 4000 feet length of main street stepping a 500 AC volt current at the street down to 100 volts to power incandescent lamps at each location.\n* 1893 GE introduces the first commercial fully enclosed carbon arc lamp. Sealed in glass globes, it lasts 100h and therefore 10 times longer than hitherto carbon arc lamps\n* 1893 Nikola Tesla puts forward his ideas on high frequency and wireless electric lighting which included public demonstrations where he lit a Geissler tube wirelessly.\n* 1894 Daniel McFarlan Moore creates the Moore tube, precursor of electric gas-discharge lamps.\n* 1897 Walther Nernst invents and patents his incandescent lamp, based on solid state electrolytes.\n20th century\n* 1900 Frederick Baldwin patents a carbide lamp for use on bicycles.  The invention builds on acetylene lamps from the 1890s.\n* 1901 Peter Cooper Hewitt creates the first commercial mercury-vapor lamp.\n* 1904 Alexander Just and Franjo Hanaman invent the tungsten filament for incandescent lightbulbs.\n* 1910 Georges Claude demonstrates neon lighting at the Paris Motor Show.\n* 1912 Charles P. Steinmetz invents the metal-halide lamp.\n* 1913 Irving Langmuir discovers that inert gas could double the luminous efficacy of incandescent lightbulbs.\n* 1917 Burnie Lee Benbow patents the coiled coil filament.\n* 1920 Arthur Compton invents the sodium-vapor lamp.\n* 1921 Junichi Miura creates the first incandescent lightbulb to utilize a coiled coil filament.\n* 1925 Marvin Pipkin invents the first internal frosted lightbulb.\n* 1926 Edmund Germer patents the modern fluorescent lamp.\n* 1927 Oleg Losev creates the first LED (light-emitting diode).\n* 1953 Elmer Fridrich invents the halogen lamp.\n* 1953 André Bernanose and several colleagues observe electroluminescence in organic materials.\n* 1960 Theodore H. Maiman creates the first laser.\n* 1962 Nick Holonyak Jr. develops the first practical visible-spectrum (red) light-emitting diode.\n* 1963 Kurt Schmidt invents the first high pressure sodium-vapor lamp.\n* 1972 M. George Craford invents the first yellow light-emitting diode.\n* 1972 Herbert Paul Maruska and Jacques Pankove create the first violet light-emitting diode.\n* 1981 Philips sells their first Compact Fluorescent Energy Saving Lamps, with integrated conventional ballast.\n* 1981 Thorn Lighting Group exhibits the ceramic metal-halide lamp.\n* 1985 Osram answers with the first electronic Energy Saving Lamps to be very successful.\n* 1987 Ching Wan Tang and Steven Van Slyke at Eastman Kodak create the first practical organic light-emitting diode (OLED).\n* 1990 Michael Ury, Charles Wood, and several colleagues develop the sulfur lamp.\n* 1991 Philips invents a fluorescent lightbulb that lasts 60,000 hours using magnetic induction.\n* 1994 T5 lamps with cool tips are introduced to become the leading fluorescent lamps with up to 117 lm/W with good color rendering. These and almost all new fluorescent lamps are to be operated on electronic ballasts only.\n* 1994 The first commercial sulfur lamp is sold by Fusion Lighting.\n* 1995 Shuji Nakamura at Nichia labs invents the first practical blue and with additional phosphor, white LED, starting an LED boom.\n21st century\n* 2008 Ushio Lighting demonstrates the first LED filament.\n* 2011 Philips wins L Prize for LED screw-in lamp equivalent to 60&nbsp;W incandescent A-lamp for general use.\nReferences"
    }
  ]
}