{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Russian innovation__disambig_1\n\n}}\nin the Tsiolkovsky State Museum of the History of Cosmonautics, Kaluga, Russia. The exhibition includes the models and replicas of the following Russian inventions:]]\nThis timeline of Russian innovation encompasses key events in the history of technology in Russia.\nThe entries in this timeline fall into the following categories:\n* indigenous invention, like airliners, AC transformers, radio receivers, television, MRLs , artificial satellites, ICBMs\n* uniquely Russian products, objects and events, like Saint Basil's Cathedral, Matryoshka dolls, Russian vodka\n* products and objects with superlative characteristics, like the Tsar Bomba, the AK-47, and the Typhoon-class submarine\n* scientific and medical discoveries, like the periodic law, vitamins and stem cells\nThis timeline includes scientific and medical discoveries, products and technologies introduced by various peoples of Russia and its predecessor states, regardless of ethnicity, and also lists inventions by naturalized immigrant citizens. Certain innovations achieved internationally may also appear in this timeline in cases where the Russian side played a major role in such projects.\nin Nizhny Novgorod. An electric tram, an earlier invention by Fyodor Pirotsky, drives between the pavilions featuring breakthrough designs by Vladimir Shukhov: the world's first steel tensile structures, gridshells, thin-shells and the first hyperboloid steel tower. The exhibition demonstrated the first lightning detector and an early radio receiver of Alexander Popov, caterpillar tractor of Fyodor Blinov, the first Russian automobile, and other technical achievements.]]\n, built completely without nails and featuring such traditional elements of Russian architecture as the tented roof, multiple onion domes and bochka roofs.]]\nKievan Rus'\n10th century\nand sarafan.]]\n;Kokoshnik\n: The kokoshnik is a traditional Russian head-dress for women. It is patterned to match the style of the sarafan and can be pointed or round. It is tied at the back of the head with long thick ribbons in a large bow. The forehead is sometimes decorated with pearls or other jewelry. The word kokoshnik appeared in the 16th century, however the earliest head-dress pieces of a similar type were found in the 10th to 12th century burials in Veliky Novgorod. It was worn by girls and women on special occasions until the Russian Revolution, and was subsequently introduced into Western fashion by Russian émigrés.\n;Kvass / Okroshka\n: Kvass or kvas, sometimes called in English a \"bread drink\", is a fermented beverage made from black rye or rye bread, which contributes to its light or dark colour. By the content of alcohol resulted from fermentation, it is classified as non-alcoholic: up to 1.2% of alcohol, which is so low that it is considered acceptable for consumption by children. While the early low-alcoholic prototypes of kvass were known in some ancient civilizations, its modern, almost non-alcoholic form originated in Eastern Europe. Kvass was first mentioned in the Russian Primary Chronicle, which tells how Prince Vladimir the Great gave kvass among other beverages to the people, while celebrating the Christianization of Kievan Rus'. Kvass is also known as a main ingredient in okroshka, a Russian cold soup.d Saint Sophia Cathedral in Novgorod built on place of the original 13-domed wooden church, 11th century.]]\n;Multidomed church\n: The multidomed church is a typical form of Russian church architecture, which distinguishes Russia from other Eastern Orthodox nations and Christian denominations. Indeed, the earliest Russian churches built just after the Christianization of Kievan Rus', were multi-domed, which led some historians to speculate what Russian pre-Christian pagan temples might have looked like. Namely, these early churches were 13-domed wooden Saint Sophia Cathedral in Novgorod (989) and 25-domed stone Desyatinnaya Church in Kiev (989–996). The number of domes typically has a symbolical meaning in Russian architecture, for example 13 domes symbolize Christ with 12 Apostles, while 25 domes mean the same with additional 12 Prophets from the Old Testament. Multiple domes of Russian churches were often made of wood and were comparatively smaller than the Byzantine domes. kissel.]]\n;Kissel\n: Kissel or kisel is a dessert that consists of sweetened juice, typically that of berries, thickened with oats, cornstarch or potato starch, with red wine or dried fruits added sometimes. The dessert can be served either hot or cold, and if made using less thickening starch it can be consumed as a beverage, which is common in Russia. Kissel was mentioned for the first time in the Primary Chronicle, where it forms part of the story of how a besieged Russian city was saved from nomadic Pechenegs.\n11th century\nwith spelling lessons and drawings made by a 6–7 year old Novgorodian boy named Onfim.]]\n;Birch bark document\n: A birch bark document is a document written on pieces of birch bark. This form of writing material was developed independently by several ancient cultures. In Rus' the usage of the specially prepared birch bark as a cheap replacement for pergament or paper became widespread soon after the Christianization of the country. The earliest Russian birch bark documents (likely written in the first quarter of the 11th century) have been found in Veliky Novgorod. In total, more than 1000 such documents have been discovered, most of them in Novgorod and the rest in other ancient cities in Russia, Ukraine and Belarus. Many birch bark documents were written by common people rather than by clergy or nobility. This fact led some historians to suggest that before the Mongol invasion of Rus' the level of literacy in the country might have been considerably higher than in contemporary Western Europe. in a museum in Krasnoyarsk]]\n;Koch / Icebreaker\n: The koch was an ancient form of icebreaker, being a special type of one or two small wooden sailing ships with a mast, used for voyages in the icy conditions of the Arctic seas and Siberian rivers. The koch was developed by the Russian Pomors in the 11th century, when they started settling on the White Sea shores. The koch's hull was protected by a belt of ice-floe resistant flush skin-planking (made of oak or larch) along the variable water-line, and had a false keel for on-ice portage. If a koch was in danger of being trapped in the ice-fields, its rounded bodylines below the surface would allow for the ship to be pushed up out of the water and onto the ice with no damage. In the 19th century similar protective features were adopted to modern icebreakers..]]\n;Gudok\n: The gudok is an ancient East Slavic string musical instrument, played with a bow. It usually had three strings, two of them tuned in unison and played as a drone, the third tuned a fifth higher. All three strings were in the same plane at the bridge, so that a bow could make them all sound at the same time. Sometimes the gudok also had several sympathetic strings (up to eight) under the sounding board. These made the gudok's sound warm and rich. It was also possible to play while standing or dancing, which made it popular among skomorokhs. The name gudok comes from the 17th century, however the same type of instrument existed from 11th to 16th century, but was called smyk.\n;Medovukha\n: Medovukha is an old Slavic honey-based alcoholic beverage very similar to mead, but much cheaper and faster to make. Since the old times the Slavs exported the fermented mead as a luxury product to Europe in huge quantities. Fermentation occurs naturally over 15 to 50 years, originally rendering the product very expensive and only accessible to the nobility. However, in the 11th century East Slavs found that fermentation occurred much faster when the honey mixture was heated, enabling medovukha to become a commonly available drink in the territory of Rus'. In the 14th century, the invention of distillation made it possible to create a prototype of the modern medovukha, however vodka was invented at the same time and gradually surpassed medovukha in popularity.\ndepiction of the \"Wall against Wall\" (Stenka na Stenku) fist fighting.]]\n;1048 Russian fist fighting\n: Russian fist fighting is an ancient Russian combat sport, similar to modern boxing. However, it features some indigenous techniques and often fought in collective events called Stenka na Stenku (\"Wall against Wall\"). It has existed since the times of Kievan Rus', first mentioned in the Primary Chronicle in the year 1048. The government and the Russian Orthodox Church often tried to prohibit the fights; however, fist fighting remained popular until the 19th century, while in the 20th century some of the old techniques were adopted for the modern Russian martial arts.\n12th century\n(left) and two shestopyors.]]\n;Pernach\n: The pernach is a type of flanged mace developed since the 12th century in the region of Kievan Rus' and later widely used throughout Europe. The name comes from the Russian word перо (pero) meaning feather, reflecting the form of pernach that resembled an arrow with fletching. The most popular variety of pernach had six flanges and was called shestopyor (from Russian shest and pero, that is six-feathered). Pernach was the first form of the flanged mace to find wide usage. It was perfectly suited to defeat plate armour and plate mail. In later times it was often used as a symbol of power by military leaders in Eastern Europe.\n;Shashka\n: The shashka is a special kind of sabre, a very sharp, single-edged, single-handed, and guardless sword. In appearance, the shashka is midway between a full sabre and a straight sword. It has a slightly curved blade, and could be effective for both slashing and thrusting. Originally the shashka was developed in the 12th century by Circassians in the Northern Caucasus. These lands were integrated into the Russian Empire in the 18th century. By that time shashka was adopted as their main cold weapon by Russian Cossacks.]]\n;Treshchotka\n: The treshchotka, sometimes referred in plural as treshchotki, is a Russian folk music idiophone instrument which is used to imitate hand clapping. Basically it is a set of small boards on a string that get clapped together as a group. There are no known documents confirming the usage of the treshchotka in ancient Russia, however, the remnants of what might have been the earliest 12th-century treshchotka were recently found in Novgorod.\n;1149 bear spear\n: The bear spear or rogatina was a medieval type of spear used in bear hunting and also to hunt other large animals, like wisents and war horses. The sharpened head of a bear spear was enlarged and usually had the form of a bay leaf. Right under the head there was a short crosspiece that helped to fix the spear in the body of an animal. Often it was placed against the ground on its rear point, which made it easier to absorb the impact of the attacking beast. The Russian chronicles first mention rogatina as a military weapon in the year 1149, and as a hunting weapon in the year 1255.\n13th century\n;Sokha\n: The sokha is a light wooden plough which could be pulled by one horse. Its origin was in northern Russia, most likely in the Novgorod Republic, where it was used as early as in the 13th century. A characteristic feature of sokha construction is the bifurcated plowing tip (рассоха), so that a sokha has two plowshares, later made of metal, which cut the soil. The sokha is an evolution of a scratch-plough by an addition of a spade-like detail which turns the cut soil over (in regular ploughs the curved mouldboard both cuts and turns the soil)., with khokhloma handicraft seen on the background.]]\n;Pelmeni\n: Pelmeni is a dish originating from Siberia, now considered part of Russian national cuisine. It is a type of dumpling consisting of a filling that is wrapped in thin unleavened dough. The word pelmeni comes from the Finno-Ugric Komi, Udmurt, and Mansi languages. It is unclear when pelmeni entered the cuisines of indigenous Siberian people and when it first appeared in Russian cuisine, but most likely it was during the Mongol conquests and Mongol-Tatar invasion of Rus' in the 13th century, when Mongol-Tatars took the basic idea from the Chinese dumplings and brought it to Siberia and Eastern Europe.s of Cathedral of the Annunciation at the Moscow Kremlin.]]\n;Onion dome\n: The onion dome is a dome whose shape resembles an onion. Such domes are often larger in diameter than the drum upon which they are set, and their height usually exceeds their width. The whole bulbous structure tapers smoothly to a point. The so-called onion dome is the dominant form for church domes in Russia, and though the earliest preserved Russian domes of the type date from the 16th century, illustrations of the old chronicles indicate that they were used since the late 13th century.\nGrand duchy of Moscow\nof Transfiguration Cathedral in Vyazemy near Moscow.]]\n14th century\nLapta\n* Lapta is a Russian ball game played with a bat, similar to modern baseball. The game is played outside on a field the size of 20 x 25 sazhens (about 140 x 175 feet). Points are earned by hitting the ball, served by a player of the opposite team, and sending it as far as possible, then running across the field to the kon line, and if possible running back to the gorod line. The running player should try to avoid being hit with the ball, which is thrown by opposing team members. The most ancient balls and bats for lapta were found in 14th-century layers during excavations in Novgorod.\nZvonnitsa\n* A zvonnitsa is a large rectangular structure containing multiple arches or beams that carry bells, where bell ringers stand on its basement level and perform the ringing using long ropes, like playing on a kind of giant musical instrument. It was an alternative to bell tower in the medieval architecture of Russia and some Eastern European countries. Zvonnitsa appeared in Russia in the 14th century and was widely used until the 17th century. Sometimes it was mounted right atop the church building, resulting in the special type of church called pod zvonom (\"under ringing\") or izhe pod kolokoly (\"under bells\"). The most famous example of this type of a church is the Church of St. Ivan of the Ladder adjacent to the Ivan the Great Bell Tower in the Moscow Kremlin.\nAnbur script The alphabet was introduced by a Russian missionary, Stepan Khrap, also known as Saint Stephen of Perm (Степан Храп, св. Стефан Пермский) in 1372. The name Abur is derived from the names of the first two characters: An and Bur. The alphabet derived from Cyrillic and Greek, and Komi tribal signs, the latter being similar in the appearance to runes or siglas poveiras, because they were created by incisions, rather than by usual writing. The alphabet was in use until the 17th century, when it was superseded by the Cyrillic script. Abur was also used as cryptographic writing for the Russian language.\n1376 Sarafan\n* The sarafan is a long, shapeless pinafore-type jumper dress, a part of the traditional Russian folk costume worn by women and girls. Sarafans could be of single piece construction with thin shoulder straps over which a corset is sometimes worn, giving the shape of the body of a smaller triangle over a larger one. It comes in different styles such as the simpler black, flower- or check-patterned versions formerly used for everyday wear, or elaborate brocade versions formerly reserved for special occasions. Chronicles first mention it in the year 1376, and since that time it was worn well until the 20th century. It is now worn as a folk costume for performing Russian folk songs and folk dancing. Plain sarafans are still designed and worn today as a summer-time light dress.\n15th century\n*Kholui miniature\nwith muskets and bardiches.]]\nBardiche\n* The bardiche was a long poleaxe, that is a type of weapon combining the features of an axe and a polearm, known primarily in Eastern Europe where it was used instead of halberds. Occasionally such weapons were made in Antiquity and Early Middle Ages, but the regular and widespread usage of bardiches started in early-15th-century Russia. It was probably developed from the Scandinavian broad axe, but in Scandinavia it appeared only in the late 15th century. In the 16th century the bardiche became a weapon associated with the streltsy, Russian guardsmen armed with firearms, who used bardiches to rest handguns upon when firing.\ns with gorlatnaya hats on a painting by Andrey Ryabushkin.]]\nBoyar hat\n* The boyar hat, also known as gorlatnaya hat, was a fur hat worn by Russian nobility between the 15th and 17th centuries, most notably by boyars, for whom it was a sign of their social status. The higher hat indicated higher status. In average, it was one ell in height, having the form of a cylinder with more broad upper part, velvet or brocade on top and a main body made of fox, marten or sable fur. Today the hat is sometimes used in the Russian fashion.\nGulyay-gorod\n* The gulyay-gorod (literally \"wandering town\") was a mobile fortification made from large wall-sized prefabricated shields set on wagons or sleds, a development of the wagon fort concept. The usage of installable shields instead of permanently armoured wagons was cheaper and allowed more possible configurations to be assembled. Such mobile structures were used mostly in the open steppe, where few natural shelters could be found. The wide-scale usage of gulyay-gorod started during the Russo-Kazan Wars, and later it was often used by the Ukrainian Cossacks.\nUkha\n* Ukha is a Russian soup, made with broth and fish like salmon or cod, root vegetables, parsley root, leek, potato, bay leaf, lime, dill, green parsley and spiced with black pepper, cinnamon and cloves. Fish like perch, tenches, sheatfish and burbot were used to add flavour to the soup. Ukha as a name in the Russian cuisine for fish broth was established only in the late 17th to early 18th centuries. In earlier times this name was first given to thick meat broths, and then later chicken. Beginning from the 15th century, fish was used more and more often to prepare ukha, thus creating a dish that had a distinctive taste among soups.\nRussian oven\nin a peasant izba.]]\n* The Russian oven or Russian stove is a unique type of oven/furnace that first appeared in the early 15th century. The Russian oven is usually placed in the centre of the izba, a traditional Russian dwelling, and plays an immense role in the traditional Russian culture and way of life. It is used both for cooking and domestic heating and is designed to retain heat for long periods of time. This is achieved by channeling the smoke and hot air produced by combustion through a complex labyrinth of passages, warming the bricks from which the oven is constructed. In winter people may sleep on top of the oven to keep warm. As well as warming and cooking, the Russian oven can be used for washing. A grown man can easily fit inside, and during the Great Patriotic War some people escaped the Nazis by hiding in ovens. Porridge or pancakes prepared in such an oven may differ in taste from the same meal prepared on a modern stove or range. The process of cooking in a traditional Russian oven can be called \"languor\" - holding dishes for a long period of time at a steady temperature. Foods that are believed to acquire a distinctive character from being prepared in a Russian oven include baked milk, pearl barley, mushrooms cooked in sour cream, or even a simple potato.\nRassolnik\n* Rassolnik is a Russian soup made from pickled cucumbers, pearl barley and pork or beef kidneys, though a vegetarian version also exists. The dish is known from the 15th century, when it was initially called kalya. The key part of rassolnik is rassol, a liquid based on the juice of pickled cucumbers with some additions, famous for its usage in hangover treatment.\nc. 1430 Russian vodka\n* Russian vodka is perhaps the world's most famous national brand of vodka, that is a distilled liquor, composed solely of water and ethanol with possible traces of impurities and flavorings. Vodka is one of the world's most popular liquors. It is made by fermentation of rye, wheat, potatoes, grapes, or sugar beet molasses. Alcoholic content usually ranges between 35 and 50 percent by volume. The standard Russian vodka is 40 percent alcohol by volume (80 alcoholic proof). The exact origins of vodka cannot be traced definitively, but almost certainly vodka as a beverage comes from 14th–15th-century Eastern Europe. Russia is often named the birthplace of vodka. The distillation apparatus was known in Moscow from the late 14th century and was used to produce spirit, the precursor of vodka. According to Russian food historian William Pokhlyobkin, the first original recipe of Russian vodka was produced around 1430 by a monk called Isidore from Chudov Monastery inside the Moscow Kremlin.\nEarly 16th century\ns of the Holy Trinity Church in Nikitinki, Moscow.]]\nKokoshnik (architecture)\n* The kokoshnik is a semicircular or keel-like exterior decorative element in the traditional Russian architecture, a type of corbel blind arch. The name was inspired by the traditional Russian women's head-dress. Kokoshniks were used in Russian church architecture in the 16th century, while in the 17th century their popularity reached the highest point. Kokoshniks were placed on walls, at the basement of tented roofs or tholobates, or over the window frames, or in rows above the vaults.\n, Moscow, an early tented roof church. Kokoshniks are seen at the base of the tent.]]\n1510s Tented roof masonry\n* The tented roof masonry was a technique widely used in the Russian architecture in the 16th and 17th centuries. Before that time tented roofs (conical, or actually polygonal roofs) were made of wood and used in the wooden churches. These hipped roofs are thought to have originated in the Russian North, as they prevented snow from piling up on wooden buildings during long winters. Wooden tents also were used to cover towers in kremlins, or even applied in some common buildings, like it was in Western Europe, but the thin, pointed, nearly conical roofs of the similar shape made of brick or stone became a unique form in Russian church architecture. Some scholars, however, argue that hipped roofs have something in common with European Gothic spires, and even tend to call this style 'Russian Gothic'. The Ascension church of Kolomenskoye, built in 1532 to commemorate the birth of the first Russian Tsar Ivan IV, is often considered the first tented roof church, but recent studies show that the earliest use of the stone tented roof was in the Trinity Church in Alexandrov, built in the 1510s.\n1530 Middle Muscovite\nTsardom of Russia\nLate 16th century\n.]]\nRussian abacus\n* The Russian abacus or schoty (literally \"counts\") is a decimal type of abacus that has a single slanted deck in a unique vertical layout, with ten beads on each wire (except one wire which has four beads, for quarter-ruble fractions, that is usually near the user). It was developed in Russia from the late 16th century, at the time when abacus already was falling out of use in the Western Europe. However, the decimality of the Russian abacus (explained by Russian ruble's being the world's first decimal currency) and its simplicity (compared to the previous European and Asian versions) led to the wide use of this device in Russia well until the advent of electronic calculators in the late 20th century, though it remains in quite common use today.\n1550 Streltsy\n* First known standard military uniform worn by Russian regular army, elite armed forces known as Streltsy.\n1552 Battery-tower\n* The battery-tower is a late type of siege tower, carrying artillery inside it, a development of the gulyay-gorod concept. The first such tower was built by the Russian military engineer Ivan Vyrodkov during the siege of Kazan in 1552 (a part of the Russo-Kazan Wars), and could hold ten large-calibre cannons and 50 lighter cannons. Later battery-towers were often used by the Ukrainian Cossacks.\n.]]\n'1561 Saint Basil's Cathedral''\n* Saint Basil's Cathedral''' is perhaps the most famous Russian Orthodox cathedral, a symbol of Moscow and Russia. It was designed by Postnik Yakovlev on the order of Ivan IV of Russia and built on the Moscow's Red Square in 1555–1561, to commemorate the capture of Kazan and Astrakhan. The unique feature of the Saint Basil's Cathedral is the fact that it is a complex of multiple temples put together. The original building, known as \"Trinity Cathedral\", contained eight side churches covered with onion domes and arranged around the ninth, central tented roof church of Intercession; the tenth church was erected in 1588 over the grave of venerated local Fool Vasily (Basil). In the 16th and the 17th centuries the cathedral, perceived as the earthly symbol of the Heavenly City, was popularly known as \"Jerusalem\" and served as an allegory of the Jerusalem Temple in the annual Palm Sunday parade attended by the Patriarch of Moscow and the Tsar. Its striking design, shaped as a flame of a bonfire rising into the sky, has no analogues elsewhere in the world, and it was seldom reproduced in Russian architecture, most notably in the St. Peter's and Paul Cathedral in Petergof and in the Church of the Savior on Blood in St. Petersburg.\n'1566 Great Abatis Line\n* The Great Abatis Line, or Bolshaya Zasechnaya Cherta' in Russian, was the largest fortification line of the abatis type, built by the Grand Duchy of Moscow and later the Tsardom of Russia. Its purpose was to protect Russia from the raids of nomads of the Eastern European steppes, such as the Crimean Tatars. As a fortification construction stretching for hundreds kilometers, the Great Abatis Line is analogous to the Great Wall of China and the Roman limes. Most of its length consisted of abatis, which is a barrier built from felled trees arranged as a barricade. It was also fortified by ditches and earth mounds, palisades, watch towers and natural features like lakes and swamps. Stone and wooden kremlins of the towns were also included in the Great Abatis Line, as well as the smaller forts called ostrogs. The Great Abatis Line was built south of Moscow between the Bryansk woods and Meschera swamps starting from the 12th century, and was officially completed in 1566, exceeding 1000&nbsp;km in length.\n, showing its massive bore and cannonballs, and the Lion's head cast into the carriage.]]\n'1586 Tsar Cannon\n* The Tsar Cannon' is an enormous cannon, commissioned in 1586 by Russian Tsar Feodor and cast by Andrey Chokhov. It is the largest bombard by caliber. The cannon weighs 39.312 metric tonnes and has a length of . Its bronze-cast barrel has a calibre of , and an external diameter of . Along with a new carriage, the 2 ton cannonballs surrounding the cannon were added in 1835 and are larger than the diameter of its barrel; in fact, it was originally designed to fire 800&nbsp;kg stone grapeshot. The cannon is decorated with reliefs, including one depicting Tsar Feodor on a horse, hence the name of the cannon, though now the word Tsar is associated more with the supreme size of the weapon. Several copies of the cannon were made in the 21st century and installed in Donetsk, Ukraine and several Russian cities, while the original Tsar Cannon is in the Moscow Kremlin.\n17th century\ns of the Transfiguration Church in Kizhi, holding onion domes above.]]\nBochka roof\n* The bochka roof or simply bochka (, barrel) is the type of roof in the traditional Russian architecture that has a form of half-cylinder with an elevated and sharpened upper part, resembling the sharpened kokoshnik. Typically made of wood, the bochka roof was extensively used both in the church and civilian architecture in the 17th and 18th centuries. Later it was sometimes used in Russian Revival style buildings.\narranged in the pushka (cannon) pattern behind the gorod line.]]\nGorodki\n* Gorodki or townlets is an old Russian folk sport whose popularity has spread also to Scandinavia and the Baltic States. Similar to bowling, the aim of the game is to knock out groups of skittles arranged in some pattern by throwing a bat at them.  The skittles, or pins, are called gorodki (literally little cities or townlets), and the square zone in which they are arranged is called the gorod (city). The game is mentioned in the old Russian chronicles and was known in the form close to the modern one at least from the 17th century, since one of the famous players in gorodki was the young Peter I of Russia.\nRoller coaster\n* Russian Mountains, as they were called by the Westerners,  were winter sled rides held on specially constructed hills of ice, sometimes up to 200 feet tall, being the first type of roller coaster. Known from the 17th century, the slides were built to a height of between 70 and 80 feet, consisted of a 50 degree drop, and were reinforced by wooden supports. In the 18th century they were especially popular in St. Petersburg and surrounding areas, from where by the late 18th century their usage and popularity spread to Europe. Sometimes wheeled carts were used instead of tracks, like in the Katalnaya Gorka built in Catherine II's residences in Tsarskoe Selo and Oranienbaum. The first such wheeled ride was brought to Paris in 1804 under the name Les Montagnes Russes (French for \"Russian Mountains\"), and the term Russian Mountains continues to be a synonym for roller coaster in many countries today.\n.]]\nBird of Happiness\n* The Bird of Happiness is the traditional North Russian wooden toy, carved in the shape of a bird. It was invented by Pomors, the inhabitants of the White and Barents Sea coastline. The Bird of Happiness is made without glue or other fasteners, by elaborate carving of thin petals for the bird's wings and tail and then using a special method of spreading and curving them. Similar methods are also used in other products of the North Russian handicraft. The amulet is usually made of pine, fir, spruce, or Siberian cedar. It is suspended inside a house, guarding the family hearth and well-being.\nDymkovo toy\ns.]]\n* Dymkovo toys, also known as the Vyatka toys or Kirov toys are moulded painted clay figures of people and animals (sometimes in the form of a pennywhistle). It is an old Russian folk handicraft which still exists in a village of Dymkovo near Kirov (former Vyatka). Traditionally, the Dymkovo toys are made by women. Up until the 20th century, this toy production had been timed to the spring fair called свистунья (svistunya), or whistler. The first recorded mention of this event took place in 1811, however it is believed to have existed for some 400 years, thus dating the history of Dymkovo toy at least from the 17th century.\npulling a sleigh.]]\nTroika\n* The troika (тройка, \"triplet\" or \"trio\") is a traditional Russian harness driving combination, using three horses abreast, usually pulling a sleigh. It differs from most other three-horse combinations in that the horses are harnessed abreast. In addition to that, the troika is the world's only multiple harness with different horse gaits – the middle horse trots and the side horses canter. At full speed a troika could reach , which was a very high speed on land for vehicles in the 17th-19th centuries, making the troika closely associated with the fast ride. The troika was developed from the late 17th century, first being used for speedy delivering of mail, and having become common by the late 18th century. It was often used for travelling in stages where teams of tired horses could be exchanged for fresh animals to transport loads and people over long distances.\n1630 Late Muscovite Russian architecture characterized by many large cathedral-type churches with five onion-like cupolas, surrounding them with tents of bell towers and aisles.\n1659 Khokhloma\ntableware on a Soviet postage stamp.]]\n* Khokhloma is a Russian wood painting handicraft, known for its vivid flower patterns, red and gold colors over the black background, and the distinctive effect on the cheap and light wooden tableware or furniture, making it look heavier, metal-like and glamorous. It first appeared in the second half of the 17th century, at least from 1659, in today's Nizhny Novgorod Oblast and was named after the large trade settlement Khokhloma. The handicraft owes its origin to the Old Believers, who, fleeing from persecutions of officials, took refuge in local woods and taught some of the icon painting techniques to the local craftsmen, such as the usage of a goldish color without applying real gold. Nowadays khokhloma is one of the symbols of Russia, and apart from its usage in making tableware, furniture and souvenirs, it can be found in the wider context, for example in paintings on Russian airliners.\nNikolay Diletsky's circle of fifths in Idea grammatiki musikiyskoy (Moscow, 1679)\n1679 Circle of fifths\n*In the late 1670s a treatise called Grammatika was written by the composer and theorist Nikolai Diletskii. Diletskii's Grammatika is a treatise on composition, the first of its kind, which targeted Western-style polyphonic compositions. It taught how to write kontserty, polyphonic a cappella, which were normally based on liturgical texts and were created by putting together musical sections that have contrasting rhythm, meters, melodic material and vocal groupings. Diletskii intended his treatise to be a guide to composition but pertaining to the rules of music theory.  Within the Grammatika treatise is where the first circle of fifths appeared and was used for students as a composer's tool.\n.]]\n1685 Tula pryanik\n* The Tula pryanik is a type of printed gingerbread from the city of Tula, the most known kind of Russian gingerbreads. Usually the Tula pryanik looks like a rectangular tile or a flat figure. Modern Tula pryanik usually contain jam or condensed milk, while in the old times they were made with honey. The first mention of the Tula pryanik is in Tula census book of 1685.\n1688 Balalaika\n.]]\n* The balalaika is a stringed instrument with a characteristic triangular body and 3 strings (or sometimes 6, in 3 courses), perhaps the best-known national Russian musical instrument. The balalaika family of instruments includes, from the highest-pitched to the lowest, the prima balalaika, sekunda balalaika, alto balalaika, bass balalaika and contrabass balalaika. The earliest mention of balalaika is found in a 1688 document, and initially it was an instrument of skomorokhs (sort of Russian free-lance musical jesters). In the 1880s the modern standard balalaika was developed by Vasily Andreev, who also started a tradition of balalaika orchestras, which finally led to the popularity of the instrument in many countries outside Russia.\nGlass-holder\n*The podstakannik (Russian: подстаканник, literally \"thing under the glass\"), or tea glass holder, is a holder with a handle, most commonly made of metal, that holds a drinking glass. The primary purpose of podstakanniki (pl.) is to hold a very hot glass of tea, which is usually consumed right after it is brewed. It is a traditional way of serving and drinking tea in Russia, Ukraine, Belarus, and other post-Soviet states.\n1693\n*Naryshkin Baroque. Also called Moscow Baroque, or Muscovite Baroque, is the name given to a particular style of Baroque architecture and decoration which was fashionable in Moscow from the turn of the 17th into the early 18th centuries.\nEarly 18th century\ntable-glass.]]\nTable-glass\n* The table-glass or granyonyi stakan (literally faceted glass) is a type of drinkware made from especially hard and thick glass, having a faceted form. Granyonyi stakan has certain advantages over the other drinkware, since due to its form and hardness it is more difficult to break. It is arguably handier in usage on moving trains or rolling ships, where it is less prone to tip and fall, or slip from hands, and less likely to break upon hitting the floor. A legend says that the first known Russian faceted glass was given as a present to Tsar Peter the Great from a glass-maker called Yefim Smolin, living in Vladimir Oblast. He boasted to Tsar that his glass couldn't be broken. Tsar Peter liked the present, however, after drinking some alcoholic beverage from it, he threw the glass on the ground and managed to break it. Still Peter didn't punish the glass-maker, and the production of such glasses continued, while the Russian tradition of breaking drinkware on certain occasions originated from that episode.\ns and kopecks.]]\n1704 Decimal currency\n* The decimal currency is a type of currency that is based on one basic unit and a sub-unit which is a power of 10, typically 100. Most modern currencies adhere to this pattern. Russia was the first country to introduce such a currency after decimalisation of its financial system in 1704, during the reign of Peter the Great, when Russian ruble was made equal to 100 kopecks.\n1717 Metal lathe compound slide\n* by Andrey Nartov.  A compound slide on a metal lathe adds the ability to turn tapers more easily, and may be used to turn more precise diameters.  They are a standard feature of modern manually operated lathes.\n1718 Yacht club\n'' by Alexey Zubov, 1716. Shows yachts and war ships on the Neva River.]]\n* The yacht club is a sports club specifically related to sailing and yachting. The oldest yacht club in the world, by date of establishment, is the Neva Yacht Club, founded by the Russian Tsar Peter the Great in 1718 in St. Petersburg (likely, the idea had been devised as early as 1716, when the First Neva Shipyard started building civilian vessels). Though, since it was not a purely voluntary association of members, but an organisation founded by Tsar's decree, the Neva Yacht Club's being the world's oldest is challenged by the Royal Cork Yacht Club in Ireland, founded in 1720. Both clubs have gone through periods of dormancy and undergone various name changes.\nRussian Empire\n1720s\n, with some rebar seen.]]\n1725 Rebar\n* Rebar or reinforcing bar is a common metal bar (typically made of steel), used in reinforced concrete and reinforced masonry structures. Rebar was known in construction well before the era of the modern reinforced concrete, since some 150 years before its invention rebar were used in the Leaning Tower of Nevyansk in Russia, which was built on the orders of the industrialist Akinfiy Demidov between 1725 and 1732. The purpose of such construction is one of the many mysteries of the tower. The cast iron used was of very high quality, and there is no corrosion on them up to this day.\n1730s\nhas a metallic rod on top, grounded through the rebar (some are seen below).]]\n1732 Cast iron cupola / Lightning rod\n* The cast iron cupola was a type of cupola made of cast iron rather than made from stone or brick as it was in ancient or medieval domes. The first application of this technology is found in the mysterious Leaning Tower of Nevyansk, completed in 1732. The tower's tented roof had a cast iron carcass and outer shell. The second time, this technique was applied only some 100 years later, during the reconstruction of the Mainz Cathedral in Germany in 1826, while the third time it was used in the dome of Saint Isaac's Cathedral in St. Petersburg, built in the 1840s. The very top of the tower was crowned with a gilded metallic sphere with spikes. Since it was grounded through the rebar of the tower carcass, it acted like a lightning rod. Thus, the Russian builders de facto created the first lightning rod in the Western world some 25&nbsp;years before Benjamin Franklin, however it is not known whether that was intentional.\n'1733 Peter and Paul Cathedral\n* The Peter and Paul Cathedral' is a Russian Orthodox cathedral located in St. Petersburg, Russia. It is the first and oldest landmark in St. Petersburg, built between 1712 and 1733 inside the Peter and Paul Fortress. Both the cathedral and the fortress were originally built under Peter the Great and designed by Domenico Trezzini. The cathedral is the burial place of all Russian Emperors from Peter I to Nicholas II, with the exception of Peter II. The cathedral's bell tower is the world's tallest Eastern Orthodox bell tower. Since the belfry is not standalone, but an integral part of the main building, the cathedral is sometimes considered the highest Eastern Orthodox Church in the world.\n.]]\n'1735 Tsar Bell\n* The Tsar Bell, also known as the Tsarsky Kolokol or Royal Bell, is a huge bell on display on the grounds of the Moscow Kremlin. The bell was commissioned by Empress Anna, niece of Peter the Great. Currently it is the largest and heaviest bell in the world, weighing 216 tons, with a height of 6.14&nbsp;m (20.1&nbsp;ft) and diameter of 6.6&nbsp;m (21.6&nbsp;ft). It was founded from bronze by masters Ivan Motorin and his son Mikhail in 1733–1735. The bell, however, was never rung because of a fire in 1737, when a huge slab (11.5 tons) cracked off while it was still in the casting pit. In 1836, the bell was placed on a stone pedestal next to the Ivan the Great Bell Tower. For a time, the bell served as a chapel, with the broken area forming the door. According to the legend, on Judgement Day the Tsar Bell will be miraculously repaired and lifted up to heaven, where it will ring the blagovest (call to prayer).\nof Empress Anna of Russia.]]\n1739 Ice palace\n1740s\n1741 Quick-firing gun\nbattery of Andrey Nartov]]\n* by Andrey Nartov\n1750s\n1754 Coaxial rotor / Model helicopter\n* by Mikhail Lomonosov\n1756 Law of Mass Conservation\n* by Mikhail Lomonosov\n1757 Licorne (Russian field gun)\n* by M.W. Danilov and S.A. Martynov\n1760s\n1761 Atmosphere of Venus\n* Mikhail Lomonosov was the first person to hypothesize the existence of an atmosphere on Venus based on his observation of the transit of Venus of 1761 in a small observatory near his house in Petersburg.\n1762 Off-axis reflecting telescope\n* by Mikhail Lomonosov\n1770s\n1770 Amber Room\n* The Amber Room' in the Catherine Palace of Tsarskoye Selo near Saint Petersburg is a complete chamber decoration of amber panels backed with gold leaf and mirrors. It was dubbed the Eighth Wonder of the World due to its singular beauty and the large quantity of a rare material (amber is rather hard to carve). Due to its unique history it was also called the ''World's Greatest Lost Treasure. Several generations of German and Russian craftsmen worked on this masterpiece, prompted by several generations of monarchs. Construction began in 1701 to 1709 in Prussia. In 1716 the Amber Cabinet was given by Prussian king Friedrich Wilhelm I to his then ally, Tsar Peter I of Russia. Then it was expanded by Russian craftsmen, and by 1770, when the work was finished, the Room covered more than 55 square meters and contained over six tons of amber. It was looted during World War II by Nazi Germany, brought to Königsberg and lost in the chaos at the end of the war. In 1979-2003 Russian craftsmen again reconstructed the Amber Room in the Catherine Palace, while the location of the original one is still a mystery.\n'1770 Thunder Stone\n* The largest stone ever moved by man, used a base for a statue.\n1776 Orenburg shawl\n1778 Russian samovar'\n* In 1778 the Lisitsyn brothers introduced their first samovar design, and the same year they registered the first samovar-making factory in Russia.\nFile:Thunder Stone.jpg|The Transportation of the Thunder-stone in the Presence of Catherine II''. Engraving by I.F.Schley of the drawing by Yury Felten. 1770.\nFile:Samovar.silver.jpg|A typical samovar\n1780s\n1784 Orlov Trotter\n* by Alexei Grigoryevich Orlov\nFile:Орловский рысак.jpg|Orlov Trotter, considered the fastest for most of the 19th century.\n1790s\nRussian guitar\n* by Andrei Sychra\nValenki\n1793 Screw drive elevator\n* The screw drive elevator is an elevator that uses a screw drive system instead of a hoist, like it was in the earlier elevators. The invention of the screw drive was the most important step in elevator technology since ancient times, which finally led to the creation of modern passenger elevators. The first such elevator was invented by Ivan Kulibin and installed in the Winter Palace in 1793, while several years later another of Kulibin's elevators was installed in Arkhangelskoye near Moscow. In 1823, an \"ascending room\" made its debut in London.\n1795 Fedoskino miniature / Russian lacquer art\n1796 Peaked cap\n* The peaked cap has been worn by Russian Army officers as a type of forage cap since 1796 by some regiments, and from 1811 by most of the army.\nFile:Seven-string-guitar.jpg|A seven-string Russian guitar\nFile:315 Changes in uniforms and armament of troops of the Russian Imperial army.jpg|Russian soldiers wearing peaked caps.\n19th century\n*Kargopol toys\n*Filimonovo toys\n*Gorodets painting\n*Rushnik is a ritual cloth embroidered with symbols and cryptograms of the ancient world.\n1802 Modern powdered milk\n1802 Continuous electric arc\n* by Vasily Petrov\n1805 Droshky any of various 2 or 4 wheeled, horse-drawn, public carriages (early taxicabs).\nFile:Lichtbogen 3000 Volt.jpg|Electric arc.\nFile:Dorozka_Aleksander_Orłowski_1.png|Early 19th century depiction by Aleksander Orłowski\n1810s\n1811 Sailor cap\n1812 Electric telegraph\n* by Pavel Schilling\n1812 Naval mine\n* by Pavel Schilling\n1814 Beehive frame\n* by Petro Prokopovych\nFile:Russian sailor cap.jpg|Russian Navy's sailor cap.\nFile:Voll Honig.JPG|Beehive frame filled with honey.\n1820s\n1820 Antarctica\n* By Mikhail Lazarev & Fabian Gottlieb von Bellingshausen\n1820s Russian Revival architecture is the generic term for a number of different movements within Russian architecture that arose in second quarter of the 19th century and was an eclectic melding of pre-Peterine Russian architecture and elements of Byzantine architecture.\n1820 Monorail\n* The so-called \"Road on Pillars\" near Moscow, with horse-drawn carriages, built by Ivan Elmanov.\n1825 Zhostovo painting\n1828 Electromagnetic telegraph\n* by Pavel Schilling\n1829 Industrial production process of sunflower oil\n1829 Three bolt diving equipment\n* by E. K. Gauzen\n1829 Hyperbolic geometry\n* by Nikolay Lobachevsky\n1830s\n1832 Data recording equipment\n* Semen Korsakov was reputedly the first to use the punched cards in informatics for information storage and search. Korsakov announced his new method and machines in September 1832, and rather than seeking patents offered the machines for public use.\n'''1833 Lenz's law\n* by Heinrich Lenz\n1835 Centrifugal fan\n* by Alexander Sablukov\n1838 Electrotyping\n* by Boris Jacobi\n1839 Electric boat\n* by Boris Jacobi\n1839 Galvanoplastic sculpture'''\n* by Boris Jacobi and Heinrich Lenz\nFile:Homeoscope03.gif|The search of data on Semen Korsakov's punched card, a part of the machine called linear homeoscope.\nFile:CentrifugalFan.png|Components of a centrifugal fan.\n1840s\n1847 Field anesthesia\n* by Nikolay Pirogov\n1848 Modern oil well\n* by Vasily Semyonov\nFile:102 329 nobel oilwells.jpg|19th-century oil wells near Baku.\n1850s\n1850s Neo-Byzantine architecture in the Russian Empire emerged in the 1850s and became an officially endorsed preferred architectural style for church construction during the reign of Alexander II of Russia (1855–1881), replacing the Russo-Byzantine style of Konstantin Thon.\n'1851 Struve Geodetic Arc\n* by Friedrich Georg Wilhelm von Struve\n1851 Russian Railway Troops\n1854 Modern field surgery\n* By Nikolay Pirogov\n1854 Stereo camera\n1857-1861 Theory of chemical structure\n* By Alexander Butlerov, one of the principal creators of the theory of chemical structure, the first to incorporate double bonds into structural formulas, the discoverer of Hexamine and the discoverer of the Formose reaction.\n1857 Radiator\n* A radiator is a heat exchanger used to transfer thermal energy from one medium to another for the purpose of cooling or heating. The first historical application of radiator was in central heating systems. The heating radiator was invented by Franz San Galli, a Polish-born Russian businessman living in St. Petersburg, between 1855 and 1857.\n1858 Saint Isaac's Cathedral''\n* Saint Isaac's Cathedral''' is the largest Russian Orthodox cathedral in St. Petersburg. It was the tallest Eastern Orthodox church upon its completion (subsequently surpassed only by the Cathedral of Christ the Saviour). It is dedicated to Saint Isaac of Dalmatia, a patron saint of Peter the Great who had been born on the feast day of that saint. Designed by Auguste de Montferrand, the cathedral is a masterpiece of the late classicism, built between 1818 and 1858. Multiple innovations were used during construction, such as the giant cast iron dome, special frameworks to erect columns, and the first usage of galvanoplastic sculpture in architecture.\n1859 Aluminothermy\n* By Nikolay Beketov\nFile:Household radiator.jpg|An old-style household radiator.\nFile:Saint Isaac's Cathedral.jpg|Saint Isaac's Cathedral in St. Petersburg.\n1860s\n1860s Russian salad\n* by Lucien Olivier\n1861 Beef Stroganoff\n1864 Modern icebreaker\n* An icebreaker is a special-purpose ship or boat designed to move and navigate through ice-covered waters. The first steam-powered metal-hulled icebreaker of the modern type was the Russian Pilot, built in 1864 on orders of the merchant and shipbuilder Mikhail Britnev. It had the bow altered to achieve an ice-clearing capability (20° raise from keel line). This allowed the Pilot to push itself on the top of the ice and consequently break it. Britnev fashioned the bow of his ship after the shape of the old wooden Pomor kochs, which had been navigating icy waters of the White Sea and Barents Sea for centuries.\n1868 Grow light\n* Andrei Famintsyn was the first to use artificial light for plant growing and research.\n1869 Hectograph\n1869 Periodic table of the elements\n* by Dmitri Mendeleev\nFile:Russian Olivier salad.jpg|Russian salad.\nFile:Beef Stroganoff-01.jpg|Beef Stroganoff.\n1870s\nGymnasterka\n* The gymnasterka was originally introduced into the Tsarist army about 1870 for wear by regiments stationed in Turkestan during the hot summers. It took the form of a loose fitting white linen \"shirt-tunic\" and included the coloured shoulder-boards of the green tunic worn during the remainder of the year. The gymnasterka was taken into use by all branches of the Imperial Army at the time of the Russo-Turkish War of 1877–78.  Originally intended for working dress during peace-time and patterned on the traditional Russian peasant smock, the gymnasterka was subsequently adopted for ordinary duties and active service wear. It was worn as such by non-commissioned ranks in summer during the 1890s and early 1900s. The officers' equivalent was a white double breasted tunic or kitel.  During the Russo-Japanese War of 1904–05, the white gymnasterka with its red or blue shoulder-boards proved too conspicuous against modern weaponry and the garments were often dyed various shades of khaki. The smartness and comfort of the white gymnasterka enabled it to survive for a few more years of peacetime wear until a light khaki version was adopted in 1907-09 and worn during World War I.\n1872 Electric lamp\n* By Alexander Lodygin. In 1872, he applied for a Russian patent for his filament lamp. He also patented this invention in Austria, Britain, France, and Belgium. For a filament, Lodygin used a very thin carbon rod, placed under a bell-glass.\n1872 Aldol reaction\n* by Alexander Borodin, independently from Charles-Adolphe Wurtz\n1873 Odhner Arithmometer\n* by Willgodt Theophil Odhner\n1873 Armored cruiser\n* General-Admiral by Andrei Alexandrovich Popov\n1874 Headlamp\n* by Pavel Yablochkov\n1875 Railway electrification system\n* by Fyodor Pirotsky\n1876 AC transformer\n* by Pavel Yablochkov\n1876 Yablochkov candle\n* Invented in 1876 by Pavel Yablochkov, the Yablochkov candle was the first commercially viable electric carbon arc lamp and was used for the world's first electric street lightning at the Exposition Universelle (1878) in Paris.\n1877 Torpedo boat tender\n* by Stepan Makarov\n1877 Tracked wagon\n* by Fyodor Blinov\n1878 Cylindrical oil tank\n* by Vladimir Shukhov\n1879 Modern oil tanker\n* by Ludvig Nobel\nFile:Гимнастёрка и карабин.jpg|Gymnasterka of sergeant of Red Army (1935)\nFile:Odner-arithmometer.jpg|W. T. Odhner's arithmometer\nFile:Yablochkov candles illuminating Music hall on la Place du Chateau d'eau ca 1880.jpg|Yablochkov candles illuminating a music hall in Paris.\nFile:Steel Oil depot by Vladimir Shukhov.jpg|An old cylindrical oil storage tank.\n1880s\n1880s Winogradsky column\n* The Winogradsky column is a simple device for culturing a large diversity of microorganisms. Invented in the 1880s by Sergei Winogradsky, the device is a column of pond mud and water mixed with a carbon source such as newspaper (containing cellulose), blackened marshmallows or egg-shells (containing calcium carbonate), and a sulfur source such as gypsum (calcium sulfate) or egg yolk. Incubating the column in sunlight for months results in an aerobic/anaerobic gradient as well as a sulfide gradient. These two gradients promote the growth of different microorganisms such as Clostridium, Desulfovibrio, Chlorobium, Chromatium, Rhodomicrobium, and Beggiatoa, as well as many other species of bacteria, cyanobacteria, and algae.\n1888s Three-phase electric power\n* The three-phase system was developed independently from others by Mikhail Dolivo-Dobrovolsky.\n1880 Vitamins\n* By Nikolai Ivanovich Lunin (Russian Wikipedia article)\n1880 Electric tram\n* by Fyodor Pirotsky\n1881 Carbon arc welding\n* The first arc welding method was introduced by Nikolay Benardos and later patented in 1887.\n'1883 Cathedral of Christ the Saviour\n* The Cathedral of Christ the Saviour' is the main and largest cathedral of the Russian Orthodox Church, located in Moscow on the bank of the Moskva River. It is the tallest Eastern Orthodox church in the world. Designed by Konstantin Thon, it is an outstanding example of the Byzantine Revival architecture. The domes of the cathedral for the first time in history were gilded using the technique of gold electroplating. The original building was demolished during the Soviet era, but was rebuilt in 1995–2000, having become a symbol of Russia's religious renaissance.\n'1884 Mozhaysky's airplane\n* By Alexander Mozhaysky. Known as one of the earliest heavier-than-air machines to leave the ground under its own power, however still underpowered for a sustained controlled flight.\n1884 Electric submarine\n* By Stefan Drzewiecki\n1888 Caterpillar farm tractor\n* The first steam-powered tractor on continuous tracks was completed by Fyodor Blinov\n1888 Shielded metal arc welding'\n* By Nikolay Slavyanov\n1888 Solar cell (based on the outer photoelectric effect)\n* By Aleksandr Stoletov\n1889 Three-phase induction motor\n* By Mikhail Dolivo-Dobrovolsky\n1889 Three-phase transformer\n* By Mikhail Dolivo-Dobrovolsky\n'1889 Mosin–Nagant rifle '\n* By Sergei Ivanovich Mosin, the most produced rifle of the era\nFile:Tramway-LVS-2005.JPG|Electric tram in Saint Petersburg.\nFile:Wrau-cathedral-of-christ-the-savior.jpg|Cathedral of Christ the Saviour in Moscow, the world's tallest Eastern Orthodox church.\nFile:SMAW.welding.navy.ncs.jpg|Shielded metal arc welding.\n1890s\n1890 Matryoshka doll\n* By Sergey Malyutin and Vasily Zvyozdochkin\n1890 Powered exoskeleton\n1890 Chemosynthesis\n* By Sergei Winogradsky\n1891 Thermal chemical cracking\n* Shukhov cracking process by Vladimir Shukhov and Sergei Gavrilov, the first cracking method\n1891 Long-distance transmission of three-phase electric power\n* By Mikhail Dolivo-Dobrovolsky at the International Electrotechnical Exhibition in Frankfurt am Main. This demonstration initiated the today's power grids.\n1891 Three-phase hydroelectric power plant\n* By Mikhail Dolivo-Dobrovolsky\n1892 Viruses\n* By Dmitri Ivanovsky\n1894 Nephoscope\n* By Mikhail Pomortsev\n1895 Lightning detector / Radio receiver\n* By Alexander Stepanovich Popov\n1896 Thin-shell structure\n* By Vladimir Shukhov\n1896 Tensile structure\n* By Vladimir Shukhov\n1896 Hyperboloid structure\n* By Vladimir Shukhov, see also Shukhov Tower\n1897 Gridshell\n* By Vladimir Shukhov\n1898 Polar icebreaker\n* A polar icebreaker is an icebreaker capable of operating in the polar waters with their vast and thick multi-year sea ice. The Russian icebreaker Yermak (named after Yermak the conqueror of Siberia) was the first icebreaker able to ride over and crush pack ice. It was built in England between 1897 and 1898 after Admiral Stepan Makarov's design and under his supervision. Between 1899 and 1911 Yermak sailed in heavy ice conditions for more than 1000 days. Starting from this vessel, Russia created the largest fleet of oceangoing icebreakers in the 20th and 21st centuries.\n1899 Radiation pressure\n* By Pyotr Lebedev\nFile:First matryoshka museum doll open.jpg|The original matryoshka carved by Vasily Zvyozdochkin and painted by Sergey Malyutin.\nFile:Tensile Steel Lattice Shell of Oval Pavilion by Vladimir Shukhov 1895.jpg|The world's first tensile steel Shell by Vladimir Shukhov (during construction), Nizhny Novgorod, 1895.\nFile:First Shukhov Tower Nizhny Novgorod 1896.jpg|The world's first hyperboloid lattice 37-meter water tower by Vladimir Shukhov, All-Russian Exposition, Nizhny Novgorod, Russia, 1896\n20th century\nMstyora miniature\n1901 Classical conditioning\n* by Ivan Pavlov. Pavlov was awarded the Nobel Prize for his work in 1904. (Also referred to as \"Pavlov's dog\")\n1901 Chromatography\n* by Mikhail Tsvet\n1902 Fire fighting foam\n* Fire fighting foam is foam used for fire suppression. Its role is to cool the fire and to coat the fuel, preventing its contact with oxygen, resulting in suppression of combustion. Fire fighting foam was invented by the Russian engineer and chemist Aleksandr Loran in 1902. He was a teacher in a school in Baku, which was the main center of the Russian oil industry at that time. Impressed by the terrible and hardly extinguishable oil fires that he had seen there, Loran tried to find such a liquid substance that could deal effectively with the problem, and so he invented his fire fighting foam.\n1903 Theoretical foundations of spaceflight\n* By Konstantin Tsiolkovsky\n1903 Cytoskeleton\n1903 Motor ship\n* The Russian tanker Vandal was the world's first diesel-powered ship.\n1904 Radio jamming\n1904 Foam extinguisher\n* The first such extinguisher was produced in 1904 by Aleksandr Loran, who invented fire fighting foam two years before.\n1905 Auscultatory blood pressure measurement\n* By Nikolai Korotkov\n1905 Korotkov sounds\n1905 Insubmersibility\n* By Alexey Krylov and Stepan Makarov\n1906 Electric seismometer\n* By Boris Borisovich Galitzine\n1907 Aerosledge\n1907 Pulsejet\n1907 Bayan\n'1907 Church of the Savior on Blood''\n* The church contains over 7500 square metres of mosaics — according to its restorers, more than any other church in the world.\nFile:USCG AFFF.JPG|A modern foam fire extinguisher.\nFile:Sphygmomanometer.jpg|Aneroid sphygmomanometer with stethoscope, used for auscultatory blood pressure measurement.\nFile:Jupiter bayan accordion.JPG|Bayan accordion.\n1910s\n1910 Polybutadiene\n* The first commercially viable synthetic rubber by Sergei Lebedev.\n1910 Montage (filmmaking) or Kuleshov Effect (by Lev Kuleshov)\n1910 Non-Aristotelian logic\nBy Nikolai Vasilyev\n1911 Knapsack parachute\n* By Gleb Kotelnikov\n1910 Color television\n* By Hovannes Adamian\n1911 Television\n* By Boris Rosing and Vladimir Zworykin\n1911 Stanislavski's system '''\n*  A progression of techniques used to train actors to draw believable emotions to their performances. The method that was originally created and used by Constantin Stanislavski from 1911 to 1916 was based on the concept of emotional memory for which an actor focuses internally to portray a character's emotions onstage.\n1913 Zaum\n* Zaum (Russian: зáумь) is a word used to describe the linguistic experiments in sound symbolism and language creation of Russian Futurist poets such as Velimir Khlebnikov and Aleksei Kruchenykh.\n1913 Airliner\n* Russky Vityaz by Igor Sikorsky\n1913 Half-track\n* Also known as Kégresse track, invented by Adolphe Kégresse.\n1914 Aerobatics\n* By Pyotr Nesterov, independently from Adolphe Pégoud\n1914 Gyrocar\n* By Pyotr Shilovsky\n1914 Tachanka\n* By Nestor Makhno (according to some sources)\n1914 Strategic bomber\n* Sikorsky Ilya Muromets by Igor Sikorsky\n1914 Aerial ramming\n* By Pyotr Nesterov\n1915 Activated charcoal gas mask\n* By Nikolay Zelinsky, independently from James Bert Garner\n1915 Vezdekhod\n* Vezdekhod was the first prototype caterpillar tank, or tankette, and the first continuous track amphibious ATV. It was invented by Aleksandr Porokhovschikov in 1915. The word Vezdekhod means \"He who goes anywhere\" or \"all-terrain vehicle\".\n'1915 Tsar Tank\n* This eccentric design differed from modern tanks in that it did not use caterpillar tracks, rather it used a wheeled tricycle design. The two front spoked wheels were nearly 9 metres (27 feet) in diameter; the back wheel was smaller, only 1.5 metres (5 feet) high.\n1916 Trans-Siberian Railway\n* The longest railway in the world.\n1916' Optophonic piano\nFile:Gleb Kotelnikov.jpg|Gleb Kotelnikov with his invention, the knapsack parachute.\nFile:The Russian two-wheel car in London. 1914.jpg|Shilovsky's gyrocar in 1914, presented in London.\nFile:Selinski-Kummandt-kaasunamaari Kokonaisturvallisuus 2015 01.jpg|The Zelinsky—Kummant gas mask in the Military Museum of Finland.\nFile:Tsar tank.jpg|The Tsar Tank.\n1916 Avtomat rifle. Unlike 1890's Cei gas rifle, the Avtomat was designed for 25-round detachable magazines. Contemporary Occidental writers have struggled to classify the Fedorov Avtomat. Some consider it to be an \"early predecessor\" or \"ancestor\" to the modern assault rifle, while others believe that the Fedorov Avtomat was the world's first assault rifle.\nSoviet Russia and Soviet Union\nLate 1910s\n1917 Socialist realism\n* A style of realistic art which was developed in the Soviet Union and became a dominant style in other socialist countries.\n1918 Air ioniser\n* By Alexander Chizhevsky\n1918 Budenovka\n* By Viktor Vasnetsov\n1918 Ushanka\n1918 Jet pack (not built)\n1919 Film school\n*The Moscow Film School\n1919 Constructivism (art)\n* An artistic and architectural philosophy which was a rejection of the idea of autonomous art. The movement was in favour of art as a practice for social purposes.\nFile:Ushanka of Soldier of Soviet Army-6.jpg|The later version of the Soviet Army ushanka.\nFile:Lydia kavina.jpg|Lydia Kavina playing theremin.\n1920s\n1920s Constructivist architecture\n* A form of modern architecture that flourished in the Soviet Union in the 1920s and early 1930s. It combined advanced technology and engineering with an avowedly Communist social purpose.\n1920 Theremin\n* By Leon Theremin\n1921 Aerial refueling\n* By Russian-American aviation pioneer, inventor, and influential advocate of strategic air power, Alexander P. de Seversky\n1923 Iconoscope\n* By Vladimir Zworykin\n1923 Palekh miniature\n* Also Russian lacquer art, Kholuy miniature, Mstyora miniature\n1924 Flying wing\n* By Boris Cheranovsky\n1924 Optophonic Piano\n* By Ukrainian painter and sculptor, Vladimir Baranov-Rossine\n1924 Stem cells\n* By Russian-American scientist, Alexander Maximow\n1924 Primordial soup hypothesis (Abiogenesis)\n* By Aleksandr Oparin\n1924 Diesel electric locomotive\n* Russian locomotive class E el-2\n1925 Interlaced video\n* Interlaced video is a technique of doubling the perceived frame rate introduced with the composite video signal used with analog television without consuming extra bandwidth. It was first demonstrated by Léon Theremin in 1925.\n1926 Graphical sound\n* By Pavel Tager and Aleksandr Shorin\n1927 Light-emitting diode\n* by Oleg Losev\n'1927 Polikarpov Po-2 biplane\n* The most produced biplane in the world.\n1928 Gene pool\n* by Alexander Serebrovsky\n1928 Rabbage\n* Rabbage or Raphanobrassica, was the first ever non-sterile hybrid obtained through crossbreeding, which was an important step in biotechnology. It was produced by Georgii Karpechenko in 1928.\n1929 Cadaveric blood transfusion\n* by Sergei Yudin\n1929 Kinescope\n* By Vladimir Zworykin\n1929 Pobedit\n* Pobedit is a specialized alloy that is close in hardness to diamond (85–90 on the Rockwell scale). It was created in the USSR in 1929 and was used in mining, metal-cutting and as a material for special mechanical parts. Later a number of similar alloys have been developed.\n1929 Teletank / Military robot'\nFile:PalekhTroikaWolves.jpg|Troika with wolves, an example of Palekh miniature.\nFile:Bundeswehrmuseum Dresden 49.jpg|Polikarpov Po-2 Kukuruznik.\nFile:tt-26.jpg|Soviet TT-26 teletank, the first military robot.\n1930s\nSpring-loaded camming device\n* by Vitaly Abalakov\nAbalakov thread climbing device\n* by Vitaly Abalakov\nElectric rocket motor\n* by Valentin Glushko\n1930s Modern ship hull design\n* Vladimir Yourkevitch invented the modern ship hull design when he designed the SS Normandie.\n1930 Blood bank\n1930 Single lift-rotor helicopter\n* Designed by Boris N. Yuriev and Alexei M. Cheremukhin of TsAGI, the TsAGI 1-EA was flown by Cheremukhin to an unofficial altitude record of 605 meters (1,985&nbsp;ft) in August 1932.\n1930 Paratrooping\n* Russian Airborne Troops - the first and largest in the world\n1931 Pressure suit\n* by Yevgeny Chertovsky\n1931 Hypergolic rocket propellants\n* by Valentyn Glushko\n1931 Rhythmicon / Drum machine\n* by Léon Theremin, the first drum machine\n1931 Flame tank\n* KhT-26\n1932 Postconstructivism\n* A transitional architectural style that existed in the Soviet Union in the 1930s, typical of early Stalinist architecture before World War II.\n1932 Postal code\n*Modern postal codes were first introduced in the Ukrainian Soviet Socialist Republic in December 1932, but the system was abandoned in 1939.\n'''1932 Children's railway\n1932 Terpsitone\n* by Léon Theremin\n1932 Underwater welding\n* by Konstantin Khrenov\n1933 Human kidney transplant'''\n*In 1933 surgeon Yuriy Vorony from Kherson in Ukraine attempted the first human kidney transplant, using a kidney removed six hours earlier from a deceased donor to be reimplanted into the thigh. He measured kidney function using a connection between the kidney and the skin. His first patient died two days later, as the graft was incompatible with the recipient's blood group and was rejected. It was not until 17 June 1950, when a successful transplant was performed on Ruth Tucker, a 44-year-old woman with polycystic kidney disease, by Dr. Richard Lawler at Little Company of Mary Hospital in Evergreen Park, Illinois.\n1933 Sampling theorem\n* By Vladimir Kotelnikov\n1933 Tandem rotor helicopter\n* By Nikolay Florin\n1933 Stalinist architecture\n* Also referred to as Stalinist Gothic, or Socialist Classicism, is a term given to architecture of the Soviet Union under the leadership of Joseph Stalin.\n'1934 Tupolev ANT-20\n* Purpose-designed propaganda aircraft, the largest aircraft in 1930s\n1934 Cherenkov detector'\n* Cherenkov radiation was discovered in 1934 by Pavel Cherenkov\n1935 Kirza\n* Kirza is a type of artificial leather based on the multi-layer textile fabric, modified by membrane-like substances, produced mainly in the Soviet Union and Russia as a cheap and effective replacement for natural leather. The surface of kirza imitates pig leather. The material is mainly used in production of military boots and belts for machinery and automobiles. The name kirza is an acronym from Kirovskiy Zavod (Kirov plant) located in the city of Kirov, which was the first place of the mass production of kirza. The technology was invented in 1935 by Ivan Plotnikov and improved in 1941. Since that time kirza boots became a typical element of the uniform in the Soviet and Russian Army.\n'1935 Moscow Metro\n* The Moscow Metro', which spans almost the entire Russian capital, is Europe's busiest metro system. Opened in 1935, it is well known for the ornate design of many of its stations, which contain numerous examples of socialist realist art.\n1935 Kremlin stars\n1936 Acoustic microscopy\n1936 Airborne firefighting\n1937 Artificial heart\n* By Vladimir Demikhov. It was transplanted to a dog.\n1937 Modern evolutionary synthesis\n* By Russian-American geneticist and evolutionary biologist, Theodosius Dobzhansky\n1937 Superfluidity\n* By Pyotr Kapitsa, with John F. Allen and Don Misener\n1937 Drag chute\n* The drag chute or braking parachute is an application of the drogue parachute for decreasing the landing distance of an aircraft below that available solely from the aircraft's brakes. For the first time drag chutes were used in 1937 by the Soviet airplanes in the Arctic that provided support for the famous polar expeditions of the era. The drag chute allowed safe landings on small ice-floes.\n1937 Drifting ice station\n* Soviet and Russian drifting ice stations are important contributors to exploration of the Arctic. An idea to use the drift ice for the exploration of nature in the high latitudes of the Arctic Ocean belongs to Fridtjof Nansen, who fulfilled it on Fram between 1893 and 1896. However, the first stations to be placed right upon the drifting ice originated in the Soviet Union in 1937, when the first such station in the world, North Pole-1, started operating. More drifting ice stations were organised after World War II, and many special equipment was developed for them, such as the elevated tents to be placed on the melting ice and indicators monitoring the ice cracks.\n1937 Welded sculpture\n* Welded sculpture is an artform in which sculpture is made using welding techniques. The first such sculpture was the famous Worker and Kolkhoz Woman by Vera Mukhina. Initially it was placed atop the Soviet pavilion at the 1937 World's Fair in Paris. The choice of welding method was explained by a giant size of the sculpture, and also was intended to demonstrate the innovative Soviet technologies.\n1937 Fire-fighting sport\n* Fire-fighting sport is a sport discipline that includes a competition between various fire fighting teams in fire fighting-related exercises, such as climbing special stairs in a mock-up house, unfolding a water hose, and extinguishing a fire using hoses or extinguishers. It was developed in the Soviet Union in 1937, while international competitions have taken place since 1968.\n1937-1957 ANS synthesizer\n1938 Deep column station\n* The deep column station is a type of subway station, consisting of a central hall with two side halls, connected by ring-like passages between a row of columns. Depending on the type of station, the rings transmit load to the columns either by \"wedged arches\" or through purlins, forming a \"column-purlin complex.\" The fundamental advantage of the column station is the significantly greater connection between the halls, compared with a pylon station. The first deep column station in the world is Mayakovskaya, designed by Alexey Dushkin and opened in 1938 in Moscow Metro.\n1938 Sambo\n* Sambo (an acronym, Самбо stands for САМооборона-Без-Оружия, meaning \"self-defence without weapons\") is modern martial art, combat sport and self-defense system developed in the Soviet Union and recognized as an official sport by the USSR All-Union Sports Committee in 1938, presented by Anatoly Kharlampiev.\n1939 Kirlian photography\n* By Semyon Kirlian\n1939 Vought-Sikorsky VS-300\n* The world's first tail rotor helicopter and first amphibious helicopter by Igor Sikorsky.\n'1939 Ilyushin Il-2 '\n* The world's most produced combat aircraft.\n1939 Self-propelled multiple rocket launcher\n* Katyusha rocket launcher\nFile:Camalot number 6.JPG|Spring-loaded camming device in a parallel crack.\nFile:MC-3 pressure suit front.JPG|Pressure suit.\nFile:Underwater welding.jpg|A modern underwater welding.\nFile:ANT-20.jpg|Tupolev ANT-20 propaganda aircraft.\nFile:Кирзовые_сапоги_российского_солдата.jpg|Kirza boots.\nFile:Kirl66 g.png|Kirlian photo of two coins.\n1940s\n1940s Ballast cleaner\n1940s TRIZ\n1940s Sikorsky R-4\n* The R-4 was the world's first mass-produced helicopter and the first helicopter used by the United States Army Air Forces, Navy, Coast Guard, and the United Kingdom's Royal Air Force and Royal Navy.\n'1940 T-34 tank '\n* by Mikhail Koshkin, the most produced tank of World War II\n1941 Competitive rhythmic gymnastics\n1941 Maksutov telescope\n* by Dmitri Dmitrievich Maksutov\n1941 Degaussing\n* by Anatoly Petrovich Alexandrov, independently from Charles F. Goodeve\n1942 Winged tank\n* Antonov A-40 by Oleg Antonov\n1942 Gramicidin S\n* by Georgy Gause\n1944 Microtron\n1944 EPR spectroscopy\n* by Yevgeny Zavoisky\n'1945 T-54/55 tank '\n* World's most produced tank.\n1945 Passive resonant cavity bug\n* by Léon Theremin\n1946 Heart-lung transplant\n* by Vladimir Demikhov\n1947 Modern multistage rocket\n* by Mikhail Tikhonravov and Dmitry Okhotsimsky\n'1947 MiG-15 '\n* World's most produced jet aircraft.\n'1947 AK-47\n* The AK-47 (other names include Avtomat Kalashnikova, Kalashnikov, or AK') is a selective fire, gas operated 7.62×39mm assault rifle, developed in the Soviet Union by Mikhail Kalashnikov. The AK-47 was one of the first true assault rifles. It has been manufactured in many countries and has seen service with regular armed forces as well as irregular, revolutionary and terrorist organizations worldwide. Even after six decades, due to its durability, low production cost and ease of use, the original AK-47 and its numerous variants are the most widely used and popular assault rifles in the world; more AK-type rifles have been produced than all other assault rifles combined.\n1947 Lung transplant (Non-human)\n* by Vladimir Demikhov\n1947 Light beam microphone\n* The technique of using a light beam to remotely record sound probably originated with Léon Theremin in the Soviet Union at or before 1947, when he developed and used the Buran eavesdropping system. This worked by using a low power infrared beam (not a laser) from a distance to detect the sound vibrations in the glass windows. Lavrentiy Beria, head of the KGB, used this Buran device to spy on the U.S., British, and French embassies in Moscow\n'1949 Staged combustion cycle\n* Aleksei Isaev proposed the Staged combustion cycle widely used in rocket engines.\n1949 Reactive armour\nFile:Char T-34.jpg|T-34, the most successful tank design of World War II.\nFile:Maksutov 150mm.jpg|A 150mm aperture Maksutov-Cassegrain telescope.\nFile:AntonovA40.jpg|Antonov A-40 winged tank.\nFile:MiG-15 RB2.jpg|Front view of a MiG-15.\nFile:AK-47 type II noBG.png|A Type 2 AK-47, the first machined receiver variation\n1950s\n1950s Head transplant\n* The first head transplant with full cerebral function (by Vladimir Demikhov)\n1950s Magnetotellurics\n* The magnetotelluric technique was introduced independently by Japanese scientists in 1948 (Hirayama, Rikitake), Russian geophysicist Andrey Nikolayevich Tikhonov in 1950 and the French geophysicist Louis Cagniard in 1953.\n1950 MESM\n* The first universally programmable electronic computer in continental Europe, developed by Sergey Lebedev.\n1950 Berkovich tip\n1951 Belousov–Zhabotinsky reaction\n1951 Explosively pumped flux compression generator\n1952 Masers\n* Invention of the first masers by Nikolay Basov and Alexander Prokhorov who later shared the Nobel Prize in Physics for invention and development of laser technologies with Charles Townes.\n1952 Seven Sisters (Moscow)\n1952 Carbon nanotubes'\n* A 2006 editorial written by Marc Monthioux and Vladimir Kuznetsov in the journal Carbon described the interesting and often misstated origin of the carbon nanotube. A large percentage of academic and popular literature attributes the discovery of hollow, nanometer-size tubes composed of graphitic carbon to Sumio Iijima of NEC in 1991. In 1952 L. V. Radushkevich and V. M. Lukyanovich published clear images of 50 nanometer diameter tubes made of carbon in the Soviet Journal of Physical Chemistry. This discovery was largely unnoticed, as the article was published in the Russian language, and Western scientists' access to Soviet press was limited during the Cold War. It is likely that carbon nanotubes were produced before this date, but the invention of the transmission electron microscope (TEM) allowed direct visualization of these structures.\n1952 Anthropometric cosmetology or Ilizarov apparatus\n* by Gavril Ilizarov\n1954 Nuclear power plant\n* Obninsk Nuclear Power Plant by Igor Kurchatov\n'1955 MiG-21 '\n* World's most produced supersonic aircraft.\n1955 Ballistic missile submarine\n* R-11 Zemlya submarine-launched ballistic missile by Victor Makeev, Project 611 ballistic missile submarine\n1955 Fast-neutron reactor\n* BN350 nuclear fast reactor.\n'1955 Leningrad Metro\n1955 Tokamak\n* The Tokamak T-4 was tested in 1968 in Novosibirsk, conducting the first ever quasistationary thermonuclear fusion reaction. The first actual experimental tokamak was built in 1955. The Tokamak design plays the basic role in modern projects for power generation based on thermonuclear fusion  like ITER.\n1957 ANS synthesizer\n1957 Synchrophasotron\n1957 Spaceport\n* Baikonur Cosmodrome launch complex by Vladimir Barmin\n1957 Intercontinental ballistic missile'\n* The world's first successful intercontinental ballistic missile, R-7 Semyorka, was developed under supervision of Sergey Korolev between 1953 and 1957.\n1957 Orbital space rocket\n* The world's first successful intercontinental ballistic missile, as well as a first space rocket and expendable launch system, R-7 Semyorka, was developed under supervision of Sergey Korolev between 1953 and 1957.\n1957 Artificial satellite\n* Sputnik 1, the first Earth-orbiting artificial satellite. It was launched into an elliptical low Earth orbit by the Soviet Union on 4 October 1957, and was the first in a series of satellites collectively known as the Sputnik program.\n1957 Space capsule\n* Sputnik 2\n'1957 Raketa hydrofoil\n* by Rostislav Alexeyev\n1958 Modern ternary computer\n* Setun, by Nikolay Brusentsov\n1959 Nuclear icebreaker\n* A nuclear-powered icebreaker' is a purpose-built ship with nuclear propulsion for use in waters continuously covered with ice. Nuclear-powered icebreakers are far more powerful than their diesel powered counterparts, and have been constructed by Russia primarily to aid shipping in the frozen Arctic waterways in the north of Siberia, along the Northern Sea Route. NS Lenin was the world's first nuclear icebreaker, launched in 1957 at the Admiralty Shipyard and completed in 1959.\n1959 Space probe\n* Luna 1, also the first escape velocity spacecraft and the first Sun satellite.\n1959 Missile boat\n* Komar-class missile boat\n1959 Kleemenko cycle\n1959 Staged combustion cycle\nFile:Berkovich.jpg|A Berkovich tip.\nFile:FlyingThroughNanotube.png|Inside a carbon nanotube.\nFile:Ilizarov2.jpg|An Ilizarov apparatus treating a fractured tibia and fibula.\nFile:Shevchenko BN350.gif|BN350 nuclear fast reactor.\nFile:Tokamak fields lg.png|Tokamak magnetic field and plasma current.\nFile:Baikonur Cosmodrome Soyuz launch pad.jpg|Baikonur Cosmodrome's \"Gagarin's Start\" Soyuz launch pad prior to the rollout of Soyuz TMA-13, October 10, 2008.\nFile:Semyorka Rocket R7 by Sergei Korolyov in VDNH Ostankino RAF0540.jpg|The large-size model of R-7 Semyorka, the first ICBM and the first orbital rocket.\nFile:Sputnik asm.jpg|Sputnik 1 replica.\nFile:Raketa 234.jpg|Raketa-234 on the Volga River.\nFile:183R.JPG|A Komar-class missile boat launching a missile.\nFile:Lenin icebreaker.JPG|Lenin, the first nuclear icebreaker\nFile:Staged combustion rocket cycle.png|Staged combustion rocket cycle.\n1960s\n1960s Rocket boots\n1960 Reentry capsule\n* Sputnik 5\n1961 Human spaceflight\n* Vostok 1 (, Orient 1 or East 1) was the first human spaceflight. The Vostok 3KA spacecraft was launched on 12 April 1961, taking into space Yuri Gagarin, a cosmonaut from the Soviet Union. The Vostok 1 mission was the first time anyone had journeyed into outer space and the first time anyone had entered into orbit. The Vostok 1 was launched by the Soviet space program and supervised by the Soviet rocket scientist Sergey Korolyov.\n'1961 RPG-7\n1961 Lawrencium\n* Co-discovered at the Dubna Nuclear Research Institute and Lawrence Berkeley Laboratory\n1961 Anti-ballistic missile\n* by Pyotr Grushin\n1961 Space food\n1961 Space suit\n1961 Tsar Bomb\n* The most powerful weapon ever tested. The Tsar Bomba was a three-stage Teller–Ulam design hydrogen bomb with a yield of 50 to 58 megatons of TNT (210 to 240 PJ). This is equivalent to about 1,350–1,570 times the combined power of the bombs that destroyed Hiroshima and Nagasaki, 10 times the combined power of all the conventional explosives used in World War II, or one quarter of the estimated yield of the 1883 eruption of Krakatoa, and 10% of the combined yield of all nuclear tests to date.\n1961 Platform screen doors\n* Park Pobedy (Saint Petersburg Metro)\n1961 Ekranoplan\n* by Rostislav Alexeyev\n1961 Mil Mi-8 '\n* The world's most-produced helicopter\n1962 Detonation nanodiamond\n1962 AVL tree datastructure\n1962 3D holography\n* by Yuri Denisyuk\n1962 Modern stealth technology\n* by Petr Ufimtsev\n1963 KTM-5\n*The most produced tram in the world.\n1963 Oxygen cocktail\n1964 Rutherfordium\n'1964 Druzhba pipeline\n* The longest oil pipeline system in the world.\n1964 Plasma propulsion engine\n* Pulsed plasma thruster\n1964 Kardashyov scale\n1965 Extra-vehicular activity\n1965 Molniya orbit satellite\n1965 Voitenko compressor\n1965 Proton rocket\n* The most used heavy lift launch system\n1965 Air-augmented rocket\n* by Boris Shavyrin\n1966 Nobelium\n1966 Lander spacecraft\n* Luna 9 by Georgy Babakin\n1966 Orbiter\n* Luna 10\n1966 Regional jet'\n* The Yakovlev Yak-40 was the world's first regional jet.\n1966 Caspian Sea Monster\n* The largest ekranoplan and the second largest fixed-wing aircraft by Rostislav Alexeyev\n'1966 Soyuz rocket\n* According to the European Space Agency, the Soyuz launch vehicle is the most frequently used and most reliable launch vehicle in the world.\n1966 Orbital module\n* Soyuz spacecraft\n1967 Space toilet\n* Soyuz spacecraft\n1967 Ostankino Tower\n1967 The Motherland Calls\n1967 Computer for operations with functions\n1967 Automated space docking\n* Kosmos 186 and Kosmos 188\n1967 Venus lander'\n* Venera 4\n1968 Dubnium\n'1968 Mil V-12\n* The largest helicopter ever built.\n1968 Supersonic transport\n* Tupolev Tu-144\n1969 Comet 67P/Churyumov–Gerasimenko\n* By Klim Churyumov and Svetlana Gerasimenko\n1969 Intercontinental Submarine-launched ballistic missile'\n* R-29 Vysota\nFile:RPG-7 detached.jpg|An RPG-7 with warhead, world's most used anti-tank weapon.\nFile:Vostok spacecraft.jpg|The model of Vostok spacecraft, the first human spaceflight module.\nFile:Russian space food.jpg|Russian space food.\nFile:Tsar Bomba Revised.jpg|A Tsar Bomba-type casing on display at Sarov.\nFile:Mi-8 Hip Roving Sands 99.jpg|Mil Mi-8, the world's most produced helicopter.\nFile:Molniya-1 satellite.jpg|Molniya 1 satellite.\nFile:Proton Zvezda crop.jpg|Launch of a Proton rocket.\nFile:Soyuz TMA-7 spacecraft2edit1.jpg|Soyuz spacecraft (TMA version).\nFile:MI-12.JPG|Mil V-12, the world's largest helicopter.\n1970s\n1970s Semiconductor Heterostructures\n* Creation by Zhores Alferov of Semiconductor Heterostructures which play important role in modern electronics (Nobel Prize in Physics in 2000).\n1970s Radial keratotomy\n* by Svyatoslav Fyodorov\n1970 Excimer laser\n1970 Robotic sample return\n* Luna 16\n1970 Space rover\n* Lunokhod 1, the first space exploration rover, reached the Moon surface on 17 November 1970.\n1971 Space station\n* Salyut 1 (DOS-1) (; ) was launched 19 April 1971. It was the first space station to orbit Earth. Developed under supervision of Vladimir Chelomey.\n1971 Kaissa (chess program)\n* Kaissa became the first computer chess world champion in 1974.\n1972 Hall effect thruster\n1972 Mil Mi-24\n1972 Nuclear desalination\n* BN-350 reactor\n1973 Reflectron\n* By Boris Aleksandrovich Mamyrin\n1973 Skull crucible\n* The first commercially viable process to manufacture cubic zirconia.\n1974 Electron cooling\n* Electron cooling was invented by Gersh Budker (INP, Novosibirsk) in 1966 as a way to increase luminosity of hadron colliders. It was first tested in 1974 with 68 MeV protons at NAP-M storage ring at INP.\n1975 Underwater assault rifle\n* APS underwater assault rifle by Vladimir Simonov\n'1975 Arktika-class icebreaker\n* The Arktika class' is a Russian and former Soviet class of the world's most powerful nuclear icebreakers. Its pilot ship, NS Arktika, was the second Soviet nuclear icebreaker, completed in 1975. She became the first surface ship to reach the North Pole, on 17 August 1977.\n1975 Androgynous Peripheral Attach System\n* by Vladimir Syromyatnikov\n1976 Mobile ICBM\n* RT-21 Temp 2S by Alexander Nadiradze\n1977 Vertical launching system\n* First installed on Azov, a Kara-class cruiser\n'1977 Kirov-class battlecruiser\n* The Kirov-class battlecruisers' of the Russian Navy are the largest and heaviest surface combatant warships (i.e., not an aircraft carrier, assault ship or submarine) currently in active operation in the world.\n1978 Cargo spacecraft\n1978 Active protection system\n* Drozd system\n1979 Space-based radio telescope\n* the KRT-10 radio observatory (:ru:КРТ-10)\nFile:Russian stationary plasma thrusters.jpg|Hall effect thrusters.\nFile:Shevchenko BN350 desalinati.jpg|BN350 desalination unit, the first nuclear-heated desalination unit in the world.\nFile:APS underwater rifle REMOV.jpg|APS underwater assault rifle.\nFile:Russian Nuclear Icebreaker Arktika.jpg|NS Arktika, the first surface ship to reach the North Pole.\nFile:Moscow Parad 2008 Ballist.jpg|RT-2PM Topol, the first reliable mobile ICBM.\nFile:Kirov-class battlecruiser.jpg| .\n1980s\nKalina cycle\n* Invented and patented in the 1980s by Russian engineer Alexander Kalina. His invention included the first time development of a contiguous set of ammonia-water mixture thermodynamic properties, which provide the basis for unique power plant designs for different forms of power generation from different heat sources.\n1980s EHF therapy\n* by Nikolay Devyatkov and Mikhail Golant\n'1980 Typhoon-class submarine\n* The largest submarine ever built.\n1981 Quantum dot\n* by Alexey Ekimov and Alexander Efros\n1981 Tupolev Tu-160\n* The Tupolev Tu-160' is a supersonic, variable-geometry heavy bomber designed by the Soviet Union. Although several civil and military transport aircraft are bigger, the Tu-160 has the greatest total thrust, and the heaviest takeoff weight of any combat aircraft, and the highest top speed as well as one of the largest payloads of any current heavy bomber. Pilots of the Tu-160 call it the “White Swan”, due to its maneuverability and anti-flash white finish.\n1982 Helicopter ejection seat\n* Kamov Ka-50\n1984 Tetris\n* by Alexey Pazhitnov\n1986 Modular space station\n* Mir space station\n'1987 MIR submersible\n* The first to reach the seabed under the North Pole. Developed in cooperation with Finland.\n1987 RD-170 rocket engine '\n* The world's most powerful liquid-fuel rocket engine.\n'1988 An-225\n* The largest fixed-wing aircraft ever built.\n1989 Kola Superdeep Borehole\n* The deepest borehole in the world.\n1989 Supermaneuverability'\n* Sukhoi Su-27, Pugachev's Cobra maneuver.\n'1989 Tupolev Tu-155'\n* The world's first aircraft to use liquid hydrogen as fuel.\nFile:Typhoon iced.jpg|Typhoon-class submarine, covered with ice.\nFile:Tetrominoes IJLO STZ Worlds.svg|Tetris figures.\nFile:Mir on 12 June 1998edit1.jpg|Mir space station.\nFile:Su-27 Cobra 2b.png|A Su-27 performing the Cobra maneuver.\nEarly 1990s\n1989-1991 BARS apparatus\n1991 Thermoplan\n* The thermoplan is a disc-shaped airship of hybrid type, currently under development in Russia. The key feature of thermoplan is its two section structure. The main section of the airship is filled with helium, while the other section is filled with air that can be heated or cooled by the engines. This design greatly improves the maneuverability, alongside the disc shape which helps resist the powerful winds up to 20 metre per second. The projet was started in the late 1980s and the early 1990s, with the first working prototype tested in 1991. That was rather small airship, and the giant thermoplan wasn't built at that time due to the problems caused by the economy crisis of the 1990s. In the late 2000s (decade), the project was revived under the name Locomoskyner by the Russian company Locomosky in Ulyanovsk.\n1991 Scramjet\n* The Central Institute of Aviation Motors (CIAM) KHOLOD Hypersonic Flying Laboratory, through a joint effort with NASA. First successful supersonic combustion ramjet flight demonstration.\nRussian Federation\n1990s\nRD-180 Engine\n* Dual-combustion chamber, dual-nozzle rocket engine, derived from the RD-170 used in Soviet Zenit rockets, and currently provides first-stage power for the American Atlas V launch vehicle.\n1992 Znamya (space mirror)\n1992 Nuclotron\n* Nuclotron is the world's first superconductive synchrotron, exploited by the Joint Institute for Nuclear Research in Dubna, Moscow Oblast. This particle accelerator  is based on a miniature iron-shaped field superconductive magnets, and has a particle energy up to 7 GeV. It was built in 1987–1992 as a part of Dubna synchrophasotron modernisation program (the Nuclotron ring follows the outer perimeter of the synchrophasotron ring). 5 runs of about 1400 hours total duration have been provided by the present time. The most important experiments tested the cryomagnetic system of a novel type, and obtained data on nuclear collisions using internal target.\n1993 \"Novichok\"\n* \"Novichok\" is a series of chemical weapons developed between 1971 (USSR) and 1993 (Russia), significantly more potent than VX and Soman.\n1993 RAR\n* by Eugene Roshal\n1996 Lake Vostok\n1997 Two-level single-vault transfer station\n* Sportivnaya (Saint Petersburg Metro)\n'1998 Beriev Be-200\n* Four retractable water scoops, two forward and two aft of the fuselage step can be used to scoop a total of 12 tonnes of water in 14 seconds.\n1998 Submarine-launched spacecraft'\n* Russian submarine K-407 Novomoskovsk, Shtil'\n1999 7z\n* By Igor Pavlov\n1999 Sea Launch\n* by Igor Spassky, multinational cooperation\n1999 Flerovium\nFile:Beriew Be-200 at MAKS-2009.jpg|Beriev Be-200 dropping the water painted into the colors of the flag of Russia.\nFile:Sea Launch 01.jpg|A launch of Zenit 3SL rocket from the Sea Launch platform Ocean Odyssey, originally built in Japan as oil platform, and then modified by Norway and Russia for space launches.\n2000s\n2000s Heterotransistor\n* By Zhores Alfyorov with Herbert Kroemer\n2000 Livermorium\n*Collaboration between Lawrence Livermore National Laboratory in the United States and the Joint Institute for Nuclear Research in Russia\n2000 Abstract state machine\n2001 Space tourism\n'2001 Mirny Mine\n* The largest diamond mine in the world and the second largest human-made excavation.\n2001 Superconducting nanowire single-photon detector\n2003 Park Pobedy metro escalators\n* Longest metro escalators\n2003 Nihonium\n*Russian–American collaboration\n2003 Moscovium\n*Russian–American collaboration\n2003 Proof of the Poincaré conjecture\n* By Grigori Perelman\n2004 Nginx\n* One of the most widely used web servers in the world, created by Igor Sysoev.\n2004 Graphene\n* Creation of Graphene by Russian-born, British physicists Konstantin Novoselov and Andre Geim at the University of Manchester. They were awarded with Nobel Prize in Physics for this discovery in 2010.\n2005 Orbitrap\n* by Aleksandr Makarov\n2006 PEARL (PEtawatt pARametric Laser)\n* First petawatt power level laser complex\n2006 VKontakte\n* Launch of the widely used Russian social networking service.\n2006 Oganesson\n* First synthesized in 2002 at the Joint Institute for Nuclear Research (JINR) in Dubna, near Moscow, Russia, by a joint team of Russian and American scientists.\n2007 Elbrus 2000\n* Russian microprocessor.\n2007 NS 50 Let Pobedy\n* NS 50 Let Pobedy' is the world's largest nuclear-powered icebreaker, and the largest icebreaker in general. The keel was originally laid in 1989 by Baltic Works of Leningrad (now St Petersburg), and the ship was launched in 1993 as the NS Ural, while completed in 2007 under a new name. This icebreaker is the sixth and last of the Arktika class. The vessel was put into service by Murmansk Shipping Company, which manages all eight Russian state-owned nuclear icebreakers.\n'2007 Father of all bombs\n* Aviation Thermobaric Bomb of Increased Power, nicknamed \"Father of All Bombs\", is a Russian-made air-delivered/land activated thermobaric weapon, the most powerful conventional (non-nuclear) weapon in the world. The bomb was successfully field-tested in the late evening of 11 September 2007. According to the Russian military, the new weapon will replace several smaller types of nuclear bombs in its arsenal.\n2008 Denisovans'\n* The third discovered kind of human.\nFile:50 Let Pobedy.jpg|NS 50 Let Pobedy, the world's largest icebreaker.\nFile:Orbitrappe.png|Ion trajectories in an Orbitrap mass spectrometer.\n2010s\n'2010 Chatroulette\n* The first randomized webcam chatroom\n2010 Tennessine\n*Russian–American collaboration\n2011 71-409\n* The first Russian produced low-floor tram\n2011 Nuclear power station barge\n* The first mass-produced portable nuclear power station\n2011 Nord Stream 1\n* The longest offshore pipeline\n2011 Spektr-R\n* Space based radiotelescope with the highest angular resolution (RadioAstron project).\n2012 Russky Island Bridge '\n* The world's longest cable-stayed bridge\n'2015 OCSiAl Graphetron\n* industrial-scale production of carbon nanotubes\n2016 T-14 Armata\n2016 Soyuz MS\n2017 Kh-47M2 Kinzhal\n* Nuclear-capable hypersonic air-launched ballistic missile.\n2018 Crimean Bridge\n* Longest bridge in Europe.\n2019 Lakhta Centre\n* Tallest building in Russia and Europe. Sixteenth tallest building in the world.\n2019 Sukhoi Su-57\nFile:Буксировка ПАТЭС Академик Ломоносов 2019-08-23.jpg|Russian floating nuclear power station\nFile:Russky Bridge (October 2024)-0 2.jpg|Russky Bridge\nFile:Soyuz MS-20 docking (flipped).jpg|Soyuz MS\nFile:2018 Moscow Victory Day Parade 66.jpg|Kh-47M2 Kinzhal\nFile:Kerch. Crimean Bridge P5030811 2350.jpg|Crimean Bridge\nFile:Das Lachta Zentr- Лахта Центр 2H1A6038WI (4to3).jpg|Lakhta Centre\n2020s\n2020 ZALA Lancet\n2020 COVID-19 vaccine\n* First vaccine of its kind (Gam-COVID-Vac) approved by governmental authorities.\n2021 Test flight of the Nebo-25 rocket\n* Launched by Success Rockets, making the company the first private Russian space operator to achieve more than one launch per year.\n2022 K-329 Belgorod and 2M39 Poseidon.\n* Commissioning of a unique modified Oscar II class submarine capable of equipping an autonomous, nuclear powered and armed unmanned underwater vehicle.\n2023 Unified Planning and Correction Module (UMPK)\n* Guidance and gliding kit to convert unguided bombs into precision-guided glide-bombs.\n2023 Completion of the Bolshaya Koltsevaya line\n* The third circle line of the Moscow Metro, running outside the existing Koltsevaya line and interlocking with the Moscow Central Circle. The longest metro circle line in the world at the time of completion, surpassing Line 10 of the Beijing Subway.\n2023 Electric Water Tram\n* First year-round electric river transport service.\n2024 Knyaz Vandal of Novgorod\n* Loitering munition which uses a long distance fiber optic cable to allow for higher quality signal transmission, as well as making it immune to signal jamming.\n2025 Yakovlev SJ-100'\n* First flight of a fully Russified Superjet aircraft equipped with domestic Aviadvigatel PD-14 engines.\nFile:Army-2020-315.JPG|ZALA Lancet\nFile:Вакцина Спутник V (cropped).jpg|Sputnik V COVID-19 vaccine\nFile:Rocket NEBO.png|Success Rockets\nFile:Belgorod.jpg|K-329 Belgorod and 2M39 Poseidon\nFile:Fab-1500-umpk.jpg|UMPK\nFile:Bolshaya Koltsevaya line map.png|Bolshaya Koltsevaya line\nFile:Moscow, ZIL floating terminal April 2025 13.jpg|Electric Water Trams\nSee also\n* List of Russian inventors\n* :Category:Russian inventions\n* List of Russian scientists\n* List of Soviet calculators\n* Russian culture\nReferences\nExternal links"
    }
  ]
}