{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Jewish history in Lithuania and Belarus\n\n, Lithuania in memory of the Jews killed there.]]\nThis article presents the timeline of selected events concerning the history of the Jews in Lithuania and Belarus from the fourteenth century when the region was ruled by the Grand Duchy of Lithuania.\nEarly history\nWhile the first mentions of Jews in writing dates back to 1388, it is accepted that Jewish settlement in the region dates back to a century, or possibly centuries, earlier (some claim there were already Jews living in modern-day Belarus by the eighth century).  It has been theorized that Jews immigrated to the grand duchy in different waves, the first from the east (Babylonia, the Byzantine Empire, the Caucasus, and Judea and Samaria) and later from Germany in the west. Others say the region's first Jews were from the Kingdom of Poland, as we know of Polish Jews living in the grand duchy (in what is present-day Belarus) as early as the twelfth century. There are several possible motives that the Jews had to emigrate. In 1323, Grand Duke Gediminas of Lithuania wrote a letter sent to many cities throughout the Holy Roman Empire saying that despite his country's paganism, Lithuania was tolerant to Christianity, and that he in fact wanted to convert. He then went on to invite \"knights, squires, merchants, doctors, smiths, wheelwrights, cobblers, skinners, millers,\" and others to come live in Lithuania where they could practice their crafts without compromising their religion. This letter likely led to a wave German Jewish immigration to Lithuania. However, it has been theorized that German Jews had already settled in Lithuania centuries earlier, escaping the Crusades in the eleventh-century which massacred communities of Jews.\nRussian Jewish historian Abraham Harkavy speculated that the Lithuania's first Jews had emigrated in the tenth century from Khazaria. This idea is based on the story of the Khazar Correspondence which states that the king of Khazaria and thousands of his subject converted to Judaism, transforming the nation into a Jewish kingdom which lasted for centuries, only to be destroyed in the tenth century at the hands of the Byzantine and Kievan Rus' forces in the tenth century. This theory is also in line with the myth that Ashkenazi Jews descend from Khazars.\nTimeline\nEarly history leading to Jewish settlement\n* 13th century – Grand Duchy of Lithuania is founded; the first known grand duke and king is Mindaugas.\n* 1381–1384 – Lithuanian Civil War (1381–1384), Vytautas the Great with the Teutonic Order fights Grand Duke Jogaila, wresting control of Lithuanian lands.\n* 1384 – Vytautas and Jogaila reconcile, Jogaila remaining grand duke.\n* 1385 – Union of Krewo united Poland and Lithuania under one monarch, Jogaila, who then became \"Jagiello.\" It also declared the Christianization of Lithuania, i.e. the conversion of Jogaila, Vytautas and the nobility.\n* 1389–1392 – Lithuanian Civil War (1389–1392), Vytautus and the Order again invade Lithuania.\n* 1392 – Jagiello and Vytautus reconcile again. The Astrava Treaty names Vytautus grand duke of Lithuania while Jagiello takes the title \"Supreme Duke.\"\nJews in Lithuania and Belarus\n* 1323 – Grand Duke of Lithuania Gediminas writes a letter in which he invites German craftsmen to live in Lithuania without compromising their religion.\n* 1388–1389 – The Charter of 1388 is enacted by Vytautus, at this point a duke. The charter, the earliest mention of Jews in Lithuania, granted privileges to Jews residing in Trakai, and later Brest, Grodno, Lutsk, and Vladimir. Vilnius however remains off-limits to Jewish settlers.\n* 1453 – Casimir IV of the Kingdom of Poland and the Grand Duchy of Lithuania ratifies the General Charter of Jewish Liberties, the charter written in 1264 granting the Jews of Poland liberties.\n* 1487 – An Old Jewish Cemetery of Vilnius is said to open this year, likely for the few Jewish merchants and/or tax collectors who had permission to reside there.\n* 1492 – Casimir IV dies and is succeeded by his two sons, John I Albert in Poland and Alexander Jagiellon in Lithuania.\n* 1495 – Alexander Jagiellon expels the Jews from Lithuania. Many settle in Poland and Crimea.\n* 1503 – Expulsion edict is lifted. Returning Jews can reclaim their property as well as collect debts owed to them from before the expulsion.\n* 1520 – The establishment of the Council of the Four Lands (''Vaad Arba' Aratzot), the a Jewish council governing and representing the Jews of Poland and Lithuania.\n* 1527 – Nobles convince Grand Duke Sigismund II Augustus to ban Jews from living in Vilnius.\n* c. 1535 – Rabbi Shlomo Luria (the Maharshal'') becomes yeshiva dean in Brest, and is therefore sometimes accredited with bringing Torah (and Torah study) to Lithuania.\n* 1551 – Sigismund II Augustus permits the Jews who work for him as well as two Jewish merchants to reside in Vilnius, despite the law he enacted in 1527.\n* 1556 – Antisemitic nobles work to pass a law forbidding Jews from wearing expensive clothing while forcing the men to wear yellow hats and the women to wear yellow kerchiefs to \"distinguish Jews from Christians.\"\n* 1569 – The Kingdom of Poland and the Grand Duchy of Lithuania officially unite to form the Polish-Lithuanian Commonwealth.\n* 1572 – A synagogue opens in Vilnius.\n* 1592 – A pogrom breaks out Vilnius. Jewish businesses and homes, in addition to the synagogue, are destroyed. The synagogue is rebuilt in 1606.\n* 1593\n:*Grand Duke Sigismund III Vasa grants Jews permission to live in Vilnius, with the community becoming completely legal.\n:*Over the ensuing years, Vilnius grows to become a center of Torah study and Torah scholars, dubbed the \"Jerusalem of Lithuania.\"\n* 1623 – The Jewish communities of Lithuania break off from the Council of the Four Lands and establish an independent Council of the Land of Lithuania.\n* 1630–1633 – The Great Synagogue of Vilna is founded on the site of Vilnius' original synagogue.\n* 1648 – During the Khmelnytsky Uprising, Cossacks slaughter thousands of Jews throughout the commonwealth in massacres known as Tach VeTat.\n* 1652 – The village of Vilijampolė (Slabodka) if founded on the outskirts of Kaunas. Jews, who are forbidden to settle in Kaunas proper, establish a community in Vilijampolė.\n* 1655 – Sweden invades the Polish-Lithuanian Commonwealth and fighting breaks out in Vilnius. Jews flee to Germany, among them Rabbi Shabbatai HaKohen (the Shach).\n* c. 1740 – Rabbi Israel Baal Shem Tov founds the Hasidic sect of Judaism. Established Lithuanian Jewry, led by Rabbi Eliyahu of Vilna (the Vilna Gaon), fiercely opposes the new movement. The opposers become known as Misnagdim.\n* 1749 – Christian-born convert to Judaism Avraham ben Avraham (the Ger Tzedek of Vilna) is burnt to death in Vilnius.\n* 1765 – Leader of Hasidic Judaism and successor of the Baal Shem Tov Rabbi Dov Ber of Mezeritch appoints Rabbi Aharon Perlow to spread Hasidism to Lithuania. He establishes the Karlin Hasidic court in Karlin.\n* 1772\n:* The Misnagdim issue their first cherem (anathema) against Hasidism.\n:* Rabbi Menachem Mendel of Vitebsk becomes the leader of Lithuanian Hasidism after the death of Hasidic Rebbe Dov Ber of Mezeritch.\n:* The First Partition of Poland. At this time, the total population of Jews throughout the Polish-Lithuanian Commonwealth was 308,500.\n* 1772–1793 – The Partitions of Poland end the Polish Lithuanian Commonwealth. Most of the Grand Duchy of Lithuania (Lithuania, Belarus, and part of Ukraine) are incorporated into Russia.\n* 1777 – Rabbi Menachem Mendel of Vitebsk emigrates to the land of Israel with a group of three hundred hasidim. He is succeeded as Rebbe of Lithuania by Rabbi Shneur Zalman of Liadi.\n* 1791–1835 – The Pale of Settlement is created, and over the ensuing years expanded to include much of the former Grand Duchy. It is an area within the Russian Empire where most Jews are forced to live.\n* 1798 – Misnagdim press charges against the Hasidim, claiming they were involved in counter-government activity. Rabbi Shneur Zalman of Liadi and twenty-two Karliner Hasidim are arrested and imprisoned for a short time.\nengaged in Torah study]]\n* 1802 – The Volozhin Yeshiva is established in Valozhyn by Rabbi Chaim of Volozhin. The first of the Lithuanian yeshivas, it was called the \"Mother of Yeshivas.\"\n* 1808 – A group of students of the Vilna Gaon (Perushim), led  by Rabbi Menachem Mendel of Shklov, emigrates from Lithuania to Palestine.\n* 1809 – Two more groups of Perushim emigrate to Palestine.\n* 1817 – The Mir Yeshiva is established in Mir by Rabbi Shmuel Tiktinsky.\n* 1841 – The non-religious Jewish Enlightenment movement, called the Haskalah, spreads in Lithuania with the opening of a secular Jewish school by Mordecai Aaron Günzburg and Shlomo Salkind.\n* c. 1848 – Rabbi Yisrael Salanter founds the Musar movement, a Jewish ethical movement encouraging an emphasis on musar study and introspection.\n* 1882 – Rabbi Nosson Tzvi Finkel (the Alter of Slabodka), a student of Rabbi Yisrael Salanter, establishes a musar-oriented Yeshiva Knesses Yisrael in Slabodka (Vilijampolė).\n* 1896 – Another student of Rabbi Salanter, Rabbi Yosef Yozel Horowitz (the Alter of Navordok) establishes his own musar yeshiva, the Novardok Yeshiva, in Navahrudak. It was the first of a network of musar yeshivas known as \"Beis Yosef.\"\n* 1897 – Controversy breaks out in the Slabodka Yeshiva over the emphasis on mussar. Many students leave and form Yeshivas Knesses Beis Yitzchak (later be known as the \"Kaminetz Yeshiva\").\n* 1900 – The total number of Jews throughout the Russian Empire, including Lithuania and Belarus, is 3,907,102, or 3% of the Russian population.\n* 1903 – The Choral Synagogue is opened in Vilnius. The synagogue was largely influenced and led by the Haskalah.\n* 1914 – World War I breaks out. Russia declares war on Germany and they clash in Poland.\n* 1915 – Russia surrenders in Poland and German forces advance into Lithuania and Belarus, capturing Vilnius, Grodno, Lida, Brest, and other cities. Many Jews flee east into present-day Ukraine.\n* 1918–1923 – The Bolsheviks rebel against the empire, eventually overthrowing it and establishing the Russian SFSR and killing the czar.\n* 1918\n:* After Germany's defeat in World War I, Poland, now called Second Polish Republic, declares independence. Their territory includes much of Belarus.\n:* Lithuania as well declares independence.\n* 1919\n:* Belarus, now the SSRB, declares independence as a Soviet nation.\n:* Russia invades the Polish Republic, although they see defeat several years later in 1923.\n* 1922 – The Soviet Union is established, uniting multiple Soviet socialist republics including Belarus.\n* 1933 – Rabbi Yisrael Meir Kagan (the Chafetz Chaim), widely recognized as gadol hador (greatest rabbi of the generation) dies at the age of 94/95.\n* 1939\n:* Nazi Germany invades Poland starting World War II. The entire country is surrendered within weeks. Thousands of refugees including entire yeshivas escape to Vilnius. The Lithuanian prime minister orders the yeshivas to disperse to other towns throughout Lithuania.\n:* The Molotov–Ribbentrop Pact is signed between Germany and the Soviet Union. Germany agrees to give the Soviet Union eastern Poland (including much of present-day Belarus) on the condition of peace.\n:* The Lithuanian city of Klaipėda (Memel) is absorbed in Nazi Germany and its Jewish residents, numbering approximately 7,000, are expelled, with most moving to Lithuania proper.\n* 1941\n:*Germany invades the Soviet Union, bringing the Holocaust to Belarus. Many Jews escape to Shanghai. The German Order Police battalion and Einsatzgruppen carried out a wave of killing throughout the region, hundreds of thousands of Jews being shot to death. The most famous of these massacres are the Kaunas and Ponary massacres. Much of the killing was done in Ninth and Seventh Forts, where tens of thousands of Jews were killed. By the end of 1941, 175,000 Jews had been murdered.\n:*In addition, Lithuanian Nazi collaborators massacred thousands of Jews in Kaunas and its environs, in what became known as the Kaunas Pogrom.\n.]]\n:*The Nazis also set up ghettos (small neighborhoods where Jews were confined to) including those of Minsk, Kobryn, Slonim, Grodno and Brześć in Belarus and those of Vilna, Kovno, and Shavli in Lithuania.\n* 1942\n:* The Nazis come up with the Final Solution, the decision to exterminate all Jews under their control. They were to carry this out by transporting Jews on trains (often using cattle cars) to camps dedicated to killing Jews: either extermination camps where Jews are gassed to death immediately; or concentration camps, where the Nazis implemented the idea of \"extermination through labor,\" forcing the Jews to work to death. The largest of these camps was Auschwitz in Poland, the site of at least 1.1 million death.\n:* The ghettos of Belarus are liquidated. Many of the Jews are murdered in Bronna Góra.\n* 1943 – Heinrich Himmler orders the liquidation of ghettos. The Kovno Ghetto is transformed into the Kauen concentration camp with some of its residents being deported to other concentration or death camps. The Vilna Ghetto is liquidated with the remaining Jews sent to concentration or death camps, or to be killed in the Ponary Forest.\n* 1944 – The Soviet Union's Red Army occupies the Baltics and liberates all the surviving Jews in Lithuania. Soon after, the  Red Army captures Belarus, which declares independence.\n* 1945 – The Soviet Union regains complete control of Belarus.\n* 1945–1991 – The implementation of Soviet laws restricts religious practice. Jewish religious observance is quashed under the anti-religious legislation throughout the Soviet Union (including both Lithuania and Belarus).\n* 1968 – Thousands of Jews are arrested on accusations of Zionist activity.\n* 1970–1988 – A large wave of Jews immigrate from Soviet Belarus to Israel during the 1970s Soviet aliyah. Many immigrate to the United States.\n* 1990 – Lithuania declares independence from the Soviet Union.\n* 1991 – Belarus declares independence from the Soviet Union. Many more Jews immigrate to the United States and Israel (see 1990s post-Soviet aliyah).\n* 2003–2005 – 4,854 people make aliyah (immigrate to Israel).\nSee also\n* History of the Jews in Lithuania\n* History of the Jews in Belarus\n* Lithuanian Jews\n* Hasidic Judaism in Lithuania\n* The Holocaust in Lithuania\n* The Holocaust in Belarus\n* Timeline of Jewish-Polish history\nReferences"
    }
  ]
}