{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of investigations into Donald Trump and Russia (July–December 2017)\n\nThis is a timeline of major events in the second half of 2017 related to the investigations into links between Trump associates and Russian officials relating to the Russian interference in the 2016 United States elections. It follows the timeline of Russian interference in the 2016 United States elections before and after July 2016 up until election day November 8, the post-election transition, and the first half of 2017. The investigations continued in the first and second halves of 2018, the first and second halves of 2019, 2020, and 2021.\nJanuary–June 2017\nJuly–December 2017\nJuly\n* July:\n** Nunes staffers Kash Patel and Doug Presly travel to London and try to contact Steele without informing the U.S. Embassy or the British government of their trip. They find Steele at his lawyer's office, but the lawyer refuses to let them meet with Steele.\n** On CNN Tonight with Don Lemon, Whitaker, whom Trump will appoint acting AG in November 2018, says, \"So I could see a scenario where Jeff Sessions is replaced with a recess appointment, and that attorney general doesn't fire Bob Mueller, but he just reduces his budget to so low that his investigation grinds to almost a halt.\"\n* Early July:\n** In response to queries from Politico about assertions made by Peter W. Smith in November 2016, WikiLeaks denies it has been in possession of Clinton's deleted 30,000 emails since February 2016. WikiLeaks also declines to say whether Smith was in contact with the group.\n** Trump asks White House staff secretary Rob Porter to find out whether Associate Attorney General Rachel Brand would be interested in taking over responsibility for the Mueller investigation and eventually replacing Sessions as Attorney General. Porter ignores Trump's request because he is concerned about the implications of being involved in ending the investigation or firing Mueller.\n* July 7:\n** During a two-hour meeting with Trump at the 2017 G20 Hamburg summit, Putin denies interfering in the 2016 U.S. election. Trump conducts a second meeting with Putin some hours later, with no U.S. aides. The second meeting is undisclosed by the White House until July 18, following news reports. Trump takes his translator's notes and orders the translator not to discuss the meeting with other administration officials. Concerns about violations of the Presidential Records Act are later raised.\n** Hicks and White House communications advisor Josh Raffel learn that The New York Times is working on a story about the Trump Tower meeting.\n* July 8:\n** Returning from Germany aboard Air Force One, Trump preemptively dictates a misleading statement on behalf of Trump Jr., claiming that the Veselnitskaya meeting on June 9, 2016 concerned child adoption.\n** Without permission from Trump, Trump's legal team spokesman Mark Corallo works with Circa News to publish a story about the Trump Tower meeting that casts it as possibly being part of \"a broader election opposition effort to smear [Trump] by creating the impression he and his family had extensive ties to Russia as the Kremlin was interfering in the 2016 election.\"\n* July 9:\n** The New York Times first reports that Trump Jr., Kushner and Manafort met Veselnitskaya at Trump Tower on June 9, 2016. In response to the report, Goldstone sends Emin Agalarov a text message stating that he kept Emin's father out of the story, and warns that it could blow up. The Circa News story is published an hour later.\n** Trump and Hicks chastise Corallo for his participation in the Circa News story.\n** President Trump says he and Putin \"discussed forming an impenetrable cyber security unit so that election hacking, and many other negative things, will be guarded and safe.\" Trump later says he does not think this will happen.\n* July 10\n** Trump, Hicks, and Corallo have a conference call to discuss the handling of the Veselnitskaya meeting revelations. Corallo says the statement drafted on Air Force One will backfire because the original emails will eventually come out. Hicks responds the emails \"will never get out.\" Corallo resigns shortly thereafter, reportedly due to concerns over possible obstruction of justice.\n** Trump Organization lawyers email Rob Goldstone and two others a prepared statement drafted in Goldstone's name to use as a response to inquires about the Trump Tower meeting. The statement supports Trump Jr.'s account of the meeting. Goldstone responds with his own version of the statement that says he was acting on behalf of Emin Agalarov and that the meeting was about DNC funding from Russia, but never uses either statement.\n** Of the Trump Tower meeting, Whitaker says, \"But if you have somebody that you trust that is saying you need to meet with this individual because they have information about your opponent, you would take that meeting. There is no suggestion that at the time Donald Trump Jr. knew...\"\n** The Senate Intelligence Committee interviews Steele associate and attorney Jonathan Winer for the first time.\n* July 10–18: Further details about the Veselnitskaya meeting emerge in the press. Sekulow repeatedly denies that Trump was involved in drafting Trump Jr's statement.\n* July 11:\n** Trump Jr. tweets his emails about the Trump Tower meeting before The New York Times publishes them minutes later.\n** The Senate Intelligence Committee interviews Jonathan Finer.\n* July 12:\n** Former DNC staffer Scott Comer and Democratic Party donors Roy Cockrum and Eric Schoenberg file an invasion of privacy lawsuit against the Trump campaign and Stone for conspiring with WikiLeaks to release stolen Democratic emails and files.\n** Articles of Impeachment against President Trump are formally filed in the House of Representatives.\n** Speaking on Fox News, Pence's spokesman Marc Lotter repeatedly refuses to clarify whether or not Pence met with Russian representatives.\n** Rohrabacher removes a photo of himself and Nigel Farage from Facebook after a journalist posts it on Twitter.\n** CNN reports that multiple DNC officials and former Clinton campaign officials deny working with Ukraine to find dirt on Trump and his associates. DNC research director Lauren Dillon says, \"I've been director of research at the DNC for four years and had zero contact with foreign governments.\" The denials are in response to claims by White House officials that Alexandra Chalupa worked with the Ukrainian embassy to smear Manafort.\n** Mueller's team interviews translator Anatoli Samochornov for the first of two times.\n** Mueller's team interviews security expert Eric York for the first of three times.\n** Mueller's team interviews Rogers.\n** Mueller's team interviews Pompeo.\n* July 13:\n** Mueller's team interviews Samochornov for the second of two times.\n** Mueller's team interviews security expert Eric York for the second of three times.\n* July 14:\n** Brad Parscale, the digital media director of Trump's campaign, issues a statement stating \"I am unaware of any Russian involvement in the digital and data operation of the 2016 Trump presidential campaign\" after accepting an invitation to testify before the House Intelligence Committee.\n** The Senate Intelligence Committee interviews Gordon.\n* July 17:\n** Mueller's team interviews former Acting Assistant Attorney General Mary McCord.\n** The Senate Intelligence Committee interviews Clapper.\n* July 18:\n** Mueller obtains a search warrant for Michael Cohen's Gmail account.\n** The Senate Intelligence Committee interviews former White House Chief of Staff Denis McDonough.\n** The Senate Intelligence Committee interviews a panel of intelligence analysts.\n* July 19:\n**The New York Times reports on offshore transactions and shell companies linked to Manafort's work in Ukraine and investments with a Russian oligarch.\n** The New York Times reports on sources claiming that Deutsche Bank is cooperating with federal investigators about Trump accounts.\n** Trump follows up with Lewandowski about the June 19 public statement he dictated for Sessions to read. Trump tells Lewandowski to inform Sessions that he will be fired if he doesn't meet with Lewandowski. After the meeting, Lewandowski passes the statement to Dearborn and asks him to deliver it to Sessions. Feeling uncomfortable about being the messenger, Dearborn ignores the request and does not deliver the message.\n** Trump, in an unscheduled interview with The New York Times, blasts Sessions for recusing himself without telling Trump in advance of his nomination to be Attorney General. Trump then threatens Mueller's job if the investigation expands to his personal finances. He tells the Times that he \"didn't know about the [Trump Tower] meeting\" at the time and adds, \"As I've said—most other people, you know, when they call up and say, 'By the way, we have information on your opponent,' I think most politicians—I was just with a lot of people, they said, ... 'Who wouldn't have taken a meeting like that?'\" Hicks repeatedly tries to stop the interview to no avail.\n** The UK's National Cyber Security Centre (NCSC) says it has never certified Kaspersky Lab's security software, an admission that comes just a week after the Trump administration booted the firm from two of its approved suppliers lists.\n* July 20:\n** Bloomberg News reports that Mueller is investigating Trump's business transactions.\n** The Washington Post reports Trump is asking his attorneys about his ability to pardon himself and other key aides and family members.\n** Paul Behrends is removed from his position as staff director for a House Foreign Affairs subcommittee chaired by Rohrabacher. The move comes after news reports about Behrends's and Rohrbacher's trip to Moscow in April 2016.\n** Senator Chuck Grassley sends the Justice Department a letter calling for an investigation into alleged coordination between Chalupa and the Ukrainian government to interfere in the 2016 election. He cites the January 11 Politico report on alleged Ukrainian interference as evidence.\n** Mueller's team interviews Yates's top deputy Matthew S. Axelrod.\n* July 21:\n** The Washington Post reports Sessions discussed Trump campaign-related matters with Kislyak.\n** The Senate Judiciary Committee requests all communications between Trump Jr. and a group of people, including Jill Stein. She publicly describes the notion that she communicated with Trump Jr. as \"an obvious smear designed to generate a fake news feeding frenzy\".\n** John M. Dowd replaces Marc Kasowitz at the head of Trump's legal team, following personal threats made by Kasowitz. Legal spokesman Mark Corallo resigns. Michael Wolff later reports that Corallo had been instructed not to speak to the press or to answer his telephone, and that he privately stated his belief that the Air Force One meeting on July 8, 2017, represented likely obstruction of justice.\n** A complaint is filed against Representative Dana Rohrabacher with the Office of Foreign Assets Control alleging violations of Magnitsky Act sanctions. In April 2016, Rohrabacher received a document directly from Russian Deputy Prosecutor Viktor Grin, an individual under sanctions, and used it in attempts to weaken the Magnitsky Act. The allegation is that the work Rohrabacher performed was a \"service\" provided to Grin in violation of the sanctions against Grin.\n** Priebus calls Hunt in the evening to discuss whether Sessions will be fired or resign in the wake of The Washington Post article. Hunt tells him that Sessions has no intentions of resigning. She points out that Trump will still be under investigation without Sessions.\n** The Senate Intelligence Committee interviews Susan Rice.\n* July 22:\n** Trump asserts \"complete power\" to pardon anyone in relation to the Russia investigation.\n** Trump orders Priebus to tell Sessions that he has \"no choice\" and \"must immediately resign.\" Priebus then calls McGahn for advice. McGahn tells him to ignore Trump's order, and the two discuss the possibility of resigning instead of carrying out Trump's order to fire Sessions. When Trump follows up with Priebus in the afternoon, Priebus tells him he will get Sessions to resign. Trump follows up again. Priebus convinces him to hold off on the resignation because Rosenstein and Associate Attorney General Rachel Brand would also resign and Trump would probably never get another Attorney General confirmed by Congress.\n* July 24:\n** After a closed-door meeting with the Senate Intelligence Committee, Kushner issues a statement denying any collusion with Russian officials.\n** The Senate Intelligence Committee interviews Kushner.\n* July 25:\n** Kushner meets with the House Intelligence Committee in a closed-door meeting.\n** Manafort meets with members of the Senate Intelligence Committee and turns over contemporaneous notes of the June 9, 2016 meeting.\n** In an Oval Office interview with The Wall Street Journals Gerard Baker, Trump states that there was \"nobody on the campaign that saw anybody from Russia\".\n** The Senate Intelligence Committee interviews Benjamin J. Rhodes.\n* July 26: The FBI conducts a predawn raid on Manafort's home, seizing documents and electronic devices. The raid happens on the day Manafort was scheduled to testify before the Senate Judiciary Committee.\n* July 27: Papadopoulos is arrested upon arrival at Washington Dulles International Airport.\n* July 28:\n** Trump indicates his intention to sign the bill passed by overwhelming veto-proof majorities in both houses of Congress taking the sanctions in place against Russia out of the president's control.\n** Mueller's team interviews Shlomo Weber.\n** The Senate Intelligence Committee interviews former U.S. ambassador to the U.N. Samantha Power.\n* July 30: Putin, responding to sanctions, orders a cut in U.S. diplomatic staff by 755, and bars U.S. officials from entering a warehouse in Moscow used by the United States Embassy and to a site along the Moscow River.\n* July 31: The Washington Post reports that Trump personally dictated a statement for Donald Trump Jr. stating that the Veselnitskaya meeting \"primarily discussed a program about the adoption of Russian children\".\n* Late July: Mueller removes senior FBI investigator Peter Strzok from his team following the discovery of private texts exchanged with FBI lawyer Lisa Page during the Clinton investigation and the election campaign. According to The Washington Post, the texts contain pro-Clinton comments, are critical of Congress and the media, and call Trump an \"idiot\" and a \"loathsome human\".\nAugust\n* August 1:\n** Rod Wheeler files a defamation lawsuit claiming the Trump White House was directly involved in the publication of a Fox News story about the Seth Rich conspiracy theory that allegedly misquotes Wheeler.\n** White House Press Secretary Sarah Huckabee Sanders comments on The Washington Post article from the day before claiming Trump dictated the response about the Trump Tower meeting. She clarifies that Trump \"certainly didn't dictate, ... but he weighed in, offered suggestion, like any father would do, based on the limited information that he had.\"\n* August 2:\n** Trump signs the Countering America's Adversaries Through Sanctions Act (CAATSA), legislation limiting his ability to ease sanctions against Russia. He describes the bill as \"flawed\" and \"unconstitutional\".\n** The Trump campaign turns over about 20,000 pages of documents to the Senate Intelligence Committee, as demanded by Feinstein and Grassley.\n** Christopher A. Wray is sworn in as the new FBI director.\n** Rosenstein authorizes Mueller to investigate allegations that Manafort, Page, and Papadopoulos \"committed a crime or crimes by colluding with Russian government officials with respect to the Russian government's efforts to interfere with the 2016 presidential election,\" payments Manafort received from Ukrainian politicians, and loans he received from a bank CEO to secure a position in the Trump administration. He further authorizes Mueller to investigate allegations that Papadopoulos was an unregistered agent of the government of Israel, that Flynn was an unregistered agent of the government of Turkey, and other allegations involving Flynn and Trump.\n* August 3:\n** The Wall Street Journal and The Washington Post report that Mueller has convened a grand jury in the District of Columbia District Court exclusively for his Russia probe.\n** Flynn reveals a brief advisory role with Cambridge Analytica, the data mining and analysis firm that worked with Trump's campaign, and the sponsoring Mercer family in an amended public financial filing. Flynn also discloses income from the Trump transition team.\n** Newsweek publishes an interview with Jill Stein in which she describes as \"fake news\" all suggestion of wrongdoing or collusion in relation to members of the Trump campaign and the visit to Moscow during which she was photographed with Putin and Flynn.\n** Senators Lindsey Graham (R-SC), Richard Blumenthal (D-CT), Thom Tillis (R-NC) and Chris Coons (D-DE) unveil legislation designed to prevent Trump from firing Mueller.\n* August 4: CNN reports that some of Mueller's investigators bought liability insurance to protect themselves against possible lawsuits from some of the people under investigation.\n* August 5: Kislyak denies any inappropriate contact with Flynn, and says he will not agree to testify before Congress or a grand jury.\n* August 6: Rosenstein confirms that Mueller is authorized to investigate any crime exposed by his inquiry.\n* August 7: Mueller's team interviews Gordon for the first of four times through February 14, 2019.\n* August 8: Mueller's team obtains a search warrant for Cohen's Apple iCloud account.\n* August 9:\n** The Washington Post reports on the July 26 FBI raid at Manafort's home. According to The New York Times, Mueller ordered the search for tax documents and foreign banking records.\n** Conservative watchdog organization Foundation for Accountability and Civic Trust (FACT) files a complaint with the Federal Election Commission alleging that DNC consultant Chalupa improperly sought intelligence on Manafort from Ukrainian officials. Chalupa briefed the DNC on Manafort on March 30, 2016.\n* August 10:\n** Mueller's team interviews Papadopoulos.\n** The Senate Intelligence Committee interviews former Homeland Security Adviser Lisa Monaco.\n** The Senate Intelligence Committee interviews former Deputy National Security Advisor Avril Haines.\n* August 11:\n** Rinat Akhmetshin gives sworn testimony for two hours to Mueller's grand jury.\n** The Senate Intelligence Committee asks Sigal Mandelker, the Under Secretary of the Treasury for Terrorism and Financial Intelligence, to provide any \"suspicious\" or \"derogatory\" transaction records reported by banks involving Maria Butina, Alexander Torshin, Paul Erickson, Investing With Dignity, or Bridges LLC. Erickson owns Investing With Dignity and jointly owns Bridges LLC with Butina. The committee sends a follow-up request on December 7 complaining that it hasn't received a response.\n** Mueller's team interviews Papadopoulos.\n* August 14:\n** Pence says he \"never witnessed\" and was \"not aware\" of any collusion between the Trump campaign and Russian officials.\n** The Washington Post first reports on Papadopoulos's repeated attempts to arrange campaign meetings with the Russian leadership, which Manafort is said to have refused.\n** Thousands of people participate in the \"Protest Trump and ideology of hate at Trump Tower!\" protest outside Trump Tower in New York City. The protest was organized by the \"Resisters\" group on Facebook, one of the \"bad actor\" groups identified by Facebook in July 2018 as possibly belonging to the IRA.\n* August 15:\n** Representative Dana Rohrabacher and Charles C. Johnson visit Julian Assange in London at the Ecuadorian embassy. Johnson arranged the meeting. Afterward, Rohrabacher claims to have evidence showing Russia didn't hack the DNC.\n** U.S. District Judge Ursula Mancusi Ungaro denies an attempt by Christopher Steele to avoid being deposed for the Gubarev libel suit against BuzzFeed.\n** Mueller's team interviews former Acting Attorney General Sally Yates for the first of two times.\n** The Senate Intelligence Committee interviews Yates.\n* August 16:\n** Ukrainian Member of Parliament Andrii Derkach files a request with the Ukrainian prosecutor general to open a criminal investigation into whether Ukrainian government officials interfered in the 2016 U.S. presidential election. He alleges that government officials revealed the presence of Manafort's name in the \"black ledger\" in a deliberate attempt to help Clinton win the election.\n** Rohrabacher visits Assange at the London Ecuadorian embassy. Rohrabacher and Assange talk about \"what might be necessary to get him out\" and discuss a presidential pardon in exchange for information on the theft of DNC emails that were published by WikiLeaks before the 2016 presidential election.\n** The Senate Intelligence Committee interviews Walid Phares.\n* August 17: Mueller's team interviews McCabe for the first of two times.\n* August 18:\n** Yahoo! News reports that Charles C. Johnson refused a request from the Senate Intelligence Committee for documents related to his involvement with Peter W. Smiths's effort to locate Clinton's deleted emails.\n** Joshua Caplan writes in the Gateway Pundit that the mainstream media is ignoring the alleged Ukraine-Clinton collusion scandal. The article adds fuel to the Ukraine-Clinton-CrowdStrike conspiracy theory.\n** The Senate Intelligence Committee interviews Antony Blinken.\n* August 18–27: Cohen converses daily with Trump's personal counsel while preparing his statement for Congress. He raises concerns about changes to the statement made by Trump's legal team, but agrees not to contradict the coordinated message that there were no connections between Trump and Russia.\n* August 21: The Senate Intelligence Committee interviews Page.\nTestimony Transcript of Glenn R. Simpson]]\n* August 22:\n** Christopher Steele gives the FBI the names of sources for the Steele dossier.\n** Fusion GPS founder Glenn R. Simpson, who hired Steele to compile the dossier, speaks privately with the Senate Judiciary Committee and hands over more than 40,000 documents. Simpson tells the Committee that Steele knew that the FBI had an informant in Trump's campaign, and that the FBI's own information substantiated the details of Steele's research. Simpson also states that Steele broke off relations with the FBI shortly after October 31, 2016, due to his concerns that Trump's associates were manipulating the FBI. Simpson's attorney Josh Levy states during the meeting that a person has been killed as a result of the Steele dossier's publication.\n** Mueller's team interviews former GCHQ security expert Matt Tait.\n* August 23:\n** The FBI requests from the General Services Administration (GSA) copies of communications by nine members of Trump's team, according to Trump transition lawyer Kory Langhofer. A further request is made on August 30.\n** Chairman Grassley confirms that the Senate Judiciary Committee will vote on the question of releasing the transcript of the August 22 Fusion GPS testimony. A vote is never scheduled; Feinstein will unilaterally publish the transcript on January 9, 2018.\n** The Internet Research Agency's @TEN_GOP Twitter account is closed. It has over 150,000 followers, while the legitimate Tennessee Republican Party @tngop account only has 13,400 followers.\n** The Senate Intelligence Agency interviews former NSC Senior Director for Russia and Eurasia Celeste Wallander.\n* August 24:\n** The New York Times reports that Akhmetshin had stronger ties to the Russian government and Kremlin-backed oligarchs than previously known.\n** The House Intelligence Committee issues subpoenas to the FBI and the DoJ for documents relating to the Trump dossier. They were not complied with by the September 1 deadline; the deadline is extended to September 14.\n* August 25: The Washington Post and NBC report that Mueller has issued subpoenas to several lobbying firms connected to Flynn and Manafort, including Mercury Public Affairs and SGR LLC.\n* Late August: Fancy Bear launches a Spoofing/phishing attack on Senator Claire McCaskill's 2018 reelection campaign.\n* August 27: The Washington Post reports that the Trump Organization was actively pursuing plans to develop Trump Tower Moscow during the Presidential campaign in 2015–16, though Trump did not mention it publicly at the time.\n* August 28: Cohen's legal team submits a written statement to the House and Senate Intelligence Committees. The statement was circulated among, and edited by, members of the joint defense agreement with Trump's personal legal team. The statement falsely claims that the Trump Tower Moscow project was abandoned in January 2016, that Cohen and Trump never discussed Trump traveling to Moscow, that Cohen and Trump only discussed the project three times, and that Cohen never had contact with Russian government officials about the project. The falsehoods in the statement form the basis for Cohen's 2018 guilty plea for lying to Congress.\n* August 29:\n** CNN reports that Mueller has subpoenaed Manafort's former attorney Melissa Laurenza and spokesman Jason Maloni.\n** Mueller's team interviews Goldstone the first of two times through February 8, 2018.\n** Mueller's team interviews Gordon the second of four times.\n** Mueller's team interviews McFarland the first of three times.\n* August 30:\n** Politico reports that Mueller has arranged with New York Attorney General Eric Schneiderman to set up an alternative method of charging people in the case, in case Trump were to use his pardon power to stymie the investigation.\n** Hundred of people attend \"The People's Protest. Springfield against Trump\" protest near the Loren Cook Co. in Springfield, Missouri, where Trump gives a speech. The protest was organized by the \"Resisters\" group on Facebook, one of the \"bad actor\" groups identified by Facebook in July 2018 as possibly belonging to the IRA. In July 2018, Indivisible St. Louis tells The Hill they were already planning the protest when they were contacted by \"Resisters\" on Facebook.\n* August 31:\n** The Daily Beast reports that Mueller has enlisted the IRS's Criminal Investigations Unit to investigate Trump's tax returns.\n** The Wall Street Journal reports that, over the past months, Trump's lawyers have been making their case to Mueller that Trump should not be charged with obstruction of justice.\n** Mueller's team interviews Alamanda Gribbin, a U.S. embassy control officer in Moscow who saw the document passed to Rohrabacher in April 2016.\n** Mueller's team interviews Stephen Miller for the first of two times.\n** The Senate Intelligence Committee interviews former Cybersecurity Coordinator Michael Daniel.\n** The Senate Intelligence Committee interviews White House Cybersecurity Coordinator J. Michael Daniel.\nSeptember\n* September 1: The GSA submits a flash drive to Mueller's team containing tens of thousands of communications by 13 senior members of Trump's transition team, including Kushner, from the official governmental Presidential Transition Team domain, \"ptt.gov\".\n* September 6: Facebook admits selling advertisements to Russian companies seeking to reach U.S. voters. Hundreds of accounts were reportedly tied to the Internet Research Agency. Facebook pledges full cooperation with Mueller's investigation, and begins to provide details on purchases from Russia, including identities of the people involved.\n* September 7:\n** Trump Jr. testifies to the Senate Judiciary Committee that he met with a group of Russians in Trump Tower in June 2016 in order to seek damaging information about Hillary Clinton, but that no such information was forthcoming. His testimony conflicts with Cohen's November 2018 version of events regarding negotiations of a prospective Trump Tower in Moscow.\n** Mueller's team interviews Gordon the third of four times.\n* September 8: Mueller names to the White House six current and former aides he expects to question in Russia probe: Hicks, Spicer, Priebus, McGahn, Josh Raffel of the Office of American Innovation, and James Burnham.\n* September 9: Thousand of people participate in the \"We Stand with DREAMers! Support DACA!\" rally in New York City. The rally was organized by the \"Resisters\" group on Facebook, one of the \"bad actor\" groups identified by Facebook in July 2018 as possibly belonging to the IRA.\n* September 11: The Daily Beast reports that Russia used Facebook events to organize anti-immigrant rallies on U.S. soil.\n* September 12:\n** Yahoo! News reports the FBI has begun a Foreign Agents Registration Act (FARA) violation investigation against the Sputnik news agency.\n**The DoJ asks a company that supplies services to the U.S. affiliate of Russia Today (RT) to register as a foreign agent.\n** Trump's lawyer John Dowd announces that the Trump campaign has started giving documents to Mueller.\n** Mueller's team interviews James Carafano.\n* September 13:\n** The United States bans use of Kaspersky Lab software in federal agencies amid concerns of Russian espionage.\n** Flynn's son, Michael G. Flynn, is named as a subject of Mueller's investigation.\n** CNN reports that the DoJ is preventing Senate investigators from interviewing two top FBI officials who could provide firsthand testimony about Comey's firing.\n** Bloomberg reports that Mueller has a \"red-hot\" focus on Russia's effort to influence U.S. voters on Facebook.\n** Facebook states that a 225,000-member anti-immigrant group that attempted to organize anti-Clinton rallies in Texas during the 2016 presidential campaign was \"likely operated out of Russia\".\n** The Wall Street Journal reports that Flynn promoted a multi-billion-dollar Middle Eastern Russian-backed nuclear-plant project while working in the White House.\n* September 14:\n** Page files suit against Yahoo and The Huffington Post, alleging defamation in a September 2016 news article about his connections to Russia.\n** Mueller's team interviews James (Jim) Hoskins, a national security advisor to the Trump campaign.\n* September 15:\n** In response to a warrant, Facebook gives Mueller copies of advertisements and account information related to the Russian advertisement purchases beyond what it gave Congress in the previous week.\n** According to The Wall Street Journal, Representative Dana Rohrabacher (CA-R) contacts the White House this week about brokering a deal that would end Assange's legal troubles in exchange for evidence that Russia was not the source of hacked emails WikiLeaks published during the 2016 presidential campaign.\n** Manafort's spokesman Jason Maloni testifies before Mueller's federal grand jury.\n** Mueller's team interviews Yates for the second of two times.\n** The Senate Intelligence Committee interviews someone whose name is redacted from volume 2 of their report on Russian interference.\n** The Senate Intelligence Committee interviews Joint Chiefs of Staff vice chairman General Paul Selva.\n* September 17: The Senate Intelligence Committee seeks further information about Russian links to Facebook as concerns rise about the role that social media networks played in the 2016 presidential election and Russian interference.\n* September 18:\n** Mueller notifies Manafort that he is a target of the investigation and will be indicted.\n** CNN reports that U.S. investigators had been wiretapping Manafort under secret court orders before the election campaign, at least since 2014. The government surveillance continued into early 2017, including a period when Manafort was known to talk to Trump.\n** Flynn launches his legal defense fund to raise money to cover his expected legal bills of over $1 million. The fund attracts attention because it is structured as a trust, which will allow it to keep its donors confidential. While the fund's website says no foreign donations will be accepted, its lack of disclosure requirements means there is no way for anyone to verify whether any foreign donations are ever received.\n** The Senate Intelligence Committee interviews John Podesta. He is represented by attorney Mark Elias, who does not inform the committee of his role in hiring Fusion GPS for the Clinton campaign.\n* September 19:\n** Cohen arranges for the public release of his Congressional statement in advance of speaking to Congress as a signal to other potential witnesses to adhere to the coordinated message minimizing interactions with Russia.\n** A private Senate Intelligence Committee interview with Michael Cohen is disbanded when it is learned that Cohen has shared his prepared statement with the media. Senators Burr and Warner condemn Cohen's action and announce that he will be recalled to testify publicly on October 25.\n** Congressional investigators say Facebook is withholding information that may demonstrate the nature of Russian election interference.\n** CNN reports that Mueller's Manafort investigation covers 11 years of activity.\n** Reports emerge that Trump is using campaign and Republican National Committee (RNC) funds to pay legal bills from the Russia probe.\n** During a Senate confirmation, Jon Huntsman, Trump's pick for ambassador to Russia, says there is no doubt Moscow interfered in the 2016 U.S. election.\n** CBS News independently confirms that the FISA warrant surveillance of Manafort occurred during the 2016 presidential campaign.\n** Trump responds to a tweet from @10_gop, the \"backup\" account for the now-closed IRA account @TEN_GOP, saying, \"THANK YOU for your support Miami! My team just shared photos from your TRUMP SIGN WAVING DAY, yesterday! I love you- and there is no question - TOGETHER, WE WILL MAKE AMERICA GREAT AGAIN!\" The response is to an @10_gop tweet that simply reads \"we love you Mr. President.\"\n** Mueller's team interviews Sater for the first of two times.\n** Mueller's team interviews Papadopoulos.\n* September 20:\n** Mueller seeks White House documents related to Trump's actions as president, including records and emails concerning matters including Comey's dismissal and the warning that Flynn was under investigation.\n** The Washington Post reports that less than two weeks before Trump accepted the Republican presidential nomination, Manafort offered to provide briefings to Russian billionaire Oleg Deripaska, who is close to Putin.\n** The Daily Beast reports on emerging evidence that numerous pro-Trump and anti-Clinton Facebook and Twitter activist accounts, including \"Being Patriotic\" and \"march_for_trump\", were run by Russian propagandists.\n** Cohen's statement to Congress is published by the press. Trump's personal counsel tells Cohen that Trump is pleased by the release.\n** Mueller's team interviews Papadopoulos.\n** The Senate Intelligence Committee interviews former DNC CEO Amy Dacey.\n* September 21: Facebook hands information on more than 3,000 Russia-linked advertisements to the Senate and House Intelligence Committees.\n* September 22:\n** Trump and Kremlin spokesman Dmitry Peskov issue separate denials that Russia purchased advertising space on Facebook.\n** Mueller requests phone records about the Trump Jr. statement on the Veselnitskaya meeting that was reportedly prepared aboard Air Force One.\n** The Department of Homeland Security notifies election officials in 21 states that hackers targeted their systems last year; of those, only Illinois reported a successful breach.\n** Grassley asks the FBI whether it warned the Trump campaign in 2016 that Manafort was under federal surveillance while working for the campaign. Grassley compares the situation to the warning the McCain presidential campaign purportedly received in 2008.\n* September 24: The Washington Post reports that then-President Obama warned Facebook chief executive Mark Zuckerberg over the potential electoral impact of fake news on Facebook, an idea Zuckerberg had dismissed as \"crazy\".\n* September 25:\n** The Washington Post reports that \"Russian operatives used Facebook ads to exploit divisions over black political activism and Muslims.\"\n** Mueller's team interviews Miss Universe Organization head Paula Shugart.\n** The Senate Intelligence Committee interviews former Assistant Attorney General for National Security John Carlin.\n* September 26:\n** Stone speaks to a closed session of the House Intelligence Committee. He denies all allegations of collusion between Russia and the Trump campaign and describes the inquiry as politically motivated. In November 2019, Stone is found guilty of lying during his testimony.\n** CNN reports that the IRS is sharing information with Mueller.\n** Politico reports that approximately $150,000 worth of Russian-funded Facebook advertisements promoted candidates Trump, Sanders and Stein.\n** Senator Richard Blumenthal tells Politico that criminal charges against Flynn and Manafort are virtually certain.\n** ABC News reports Mueller is investigating the timing of $2 million in political contributions from Leonard Blavatnik, Simon Kukes, and Andrew Intrater to funds controlled by Trump. All three are associates of Russian oligarch Viktor Vekselberg. Balavatnik is also an associate of Oleg Deripaska.\n** The Trump inaugural committee pledges to donate $3 million to the American Red Cross, Samaritan's Purse, and the Salvation Army to help with hurricane relief. In January 2018, the committee refuses to say whether it actually donated the money.\n** Mueller's team interviews McCabe for the second of two times.\n* September 27:\n** Senator Mark Warner's office states that Reddit is of interest to the investigation.\n** CNN reports that one of the Facebook campaign-time ads bought by Russians referenced Black Lives Matter and was targeted to reach audiences in Ferguson, Missouri and Baltimore.\n** Facebook says it took down \"tens of thousands\" of fake accounts created by Russians before the German election.\n** The Senate Intelligence Committee invites Facebook, Twitter and Google parent company Alphabet to testify.\n** Zuckerberg says he regrets having dismissed election concerns, among reports of his lack of sensitivity to warnings of Russian trolls.\n** The Daily Beast reports that Russians impersonated American Muslims to create chaos on Facebook and Instagram.\n** BuzzFeed files a motion to compel depositions from James Comey and James Clapper to aid in their defense against the libel suit filed by Aleksej Gubarev. BuzzFeed is seeking information on how seriously the government treated the Steele dossier.\n* September 28:\n** Twitter announces that it identified 201 non-bot accounts tied to the IRA.\n** Democrats rebuke Twitter for its \"frankly inadequate\" response to Russian meddling.\n** Mother Jones writes that \"fake news on Twitter flooded swing states that helped Trump win.\"\n** Mueller's team interviews Keith Kellogg, the National Security Council chief of staff. He is the first White House staffer to be interviewed.\n** The Senate Intelligence Committee interviews Clovis.\nOctober\n* Fall: The Senate Intelligence Committee interviews Chalupa about alleged Ukrainian government interference in the 2016 presidential election.\n* October 1\n** Facebook announces that it will send Congress thousands of ads bought by Russian operatives.\n** First CAATSA deadline missed.\n* October 2:\n** The Washington Post reports that Russian Facebook ads showed a black woman firing a rifle, amid efforts to stoke racial strife.\n** The Washington Post reports that the Russians used similar methods to corporate America by using a Facebook tool to ID and influence voters.\n** Facebook announces 10 million Americans saw advertisements purchased by Russian intelligence officers in the 2016 election influence campaign.\n** The Senate Intelligence Committee interviews congresswoman Debbie Wasserman Schultz.\n* October 3:\n** CNN reports Russian-linked Facebook ads targeted Michigan and Wisconsin.\n** The Washington Post reports that the Senate Intelligence Committee is expected to largely endorse intel report on Russian meddling and sound the alarm about next election.\n** Mueller's team interviews Clovis.\n** The Senate Intelligence Committee interviews Anatoli Samochornov.\n* October 4:\n** Mikhail Fridman, Petr Aven, and German Khan file a libel suit against Fusion GPS and Glenn Simpson in the U.S. District Court for the District of Columbia. They allege Simpson and Fusion GPS recklessly distributed the Steele dossier to the media and damaged their reputations when \"defamatory statements\" about them in the dossier were published. All three are owners of Alfa-Bank.\n** Senator Burr announces the Senate Intelligence Committee will not release the Russian social media ads in their possession and calls on Facebook and Twitter to release the ads themselves.\n* October 5:\n** Papadopoulos pleads guilty to giving false testimony to the FBI about meetings he had with Mifsud in March 2016. A court transcript of the secret plea hearing shows that federal prosecutors described the Papadopoulos case as just a \"small part\" of Mueller's investigation. Those documents \"represent the first concrete evidence that ... Trump was personally told about ties between a campaign adviser and Russian officials.\" In the statement of the offense, Sam Clovis as the \"Campaign Supervisor\", Corey Lewandowski as \"High-Ranking Campaign Official\", Paul Manafort as \"another high-ranking campaign official\", Rick Gates as \"another campaign official\", Walid Phares as \"Another Foreign Policy Advisor\", Joseph Mifsud as \"The Professor\", Ivan Timofeev as \"Russian MFA Connection\", Olga Vinogradova as \"Female Russian National\", and Steve Bannon as \"Senior Policy Advisor\".\n** CNN reports that Mueller's investigators met with Steele.\n** Mueller subpoenas Papadopoulos's girlfriend, Simona Mangiante.\n** The Senate Intelligence Committee interviews Crowdstrike employee Sean Henry.\n* October 6:\n** The Daily Beast reports that staffers for the Senate Judiciary Committee say the committee is not investigating Russian meddling, despite press releases from committee chairman Chuck Grassley implying such an investigation is under way.\n** The Senate Intelligence Committee interviews Matt Tait.\n* October 9:\n** The Washington Post reports that Google uncovered Russian-bought ads on YouTube, Gmail and other Alphabet-owned platforms aimed at influencing the 2016 presidential election.\n** The Washington Post and ABC News report on correspondence indicating that Veselnitskaya's intended topic for her June 2016 meeting at Trump Tower was the Magnitsky Act.\n** The Daily Beast reports that Russia recruited YouTubers to publicly criticize Clinton.\n** The Wall Street Journal reports that Facebook removed mention of Russia from an April report on election influence.\n** Recode reports that Microsoft is reviewing its records for signs of Russian interference during the election.\n* October 10:\n** Nunes issues subpoenas to Fusion GPS. Fusion GPS lawyers deny the request on October 16.\n** Page informs the Senate Intelligence Committee that he will not cooperate with their inquiry, citing the Fifth Amendment.\n** A report published by the Brookings Institution alleges that Trump \"likely obstructed justice\" by dismissing Comey.\n* October 11: The Daily Beast reports that the House Intelligence Committee is looking at Cambridge Analytica's work for the Trump campaign as part of its investigation. The company is in the process of turning over documents to the committee.\n* October 12: Senators John McCain (R-AZ) and Ben Cardin (D-MD) state that, despite an October 1 deadline, the White House has still not acted to identify Kremlin-linked targets for sanctions under CAATSA.\n* October 13:\n** Mueller's investigators interview Trump's former Chief of Staff Reince Priebus for the entire day. He is interviewed an additional two times in 2018.\n** Politico reports that Twitter deleted data potentially crucial to Russia probes.\n** Facebook takes down data and thousands of posts, obscuring the reach of Russian disinformation.\n** NBC News reports on the transfer of $26 million from Oleg Deripaska's firm, Oguster Management Ltd, to Yiakora Ventures Ltd, a company linked to Manafort.\n** VTB Bank Chairman Andrey L. Kostin describes as \"fake news\" all purported connection between Felix Sater and plans for a Trump Tower in Moscow.\n** The Guardian reports that Barbara Leeden, a longtime staffer for Senator Chuck Grassley on the Senate Judiciary Committee and wife of close Flynn associate and Iran–Contra affair figure Michael Leeden, conducted an independent search for Clinton's missing emails beginning in December 2015. Grassley's spokesperson distances the senator from Leeden and tells The Guardian that Leeden is not part of the Judiciary Committee's investigation team.\n* Mid October: Mueller issues a first subpoena to the Trump campaign, which is voluntarily cooperating with his inquiry.\n* October 16:\n** Speaking to reporters at the White House, Trump rejects the suggestion that he intends to dismiss Mueller.\n** Trump meets privately with Sessions and urges him to investigate Clinton.\n** The Senate Intelligence Committee interviews Hicks.\n* October 17:\n** The Senate Intelligence Committee subpoenas Page.\n** Business Insider reports that Mueller has interviewed former GCHQ security specialist Matt Tait, who says he was \"recruited to collude with the Russians\" as part of Peter W. Smith's effort to locate Clinton's missing State Department emails.\n** The Guardian reports that Russian trolls posing as Americans paid U.S. activists to help fund protests during the 2016 election.\n** Mueller's team interviews Spicer for much of the day.\n** U.S. District Court Judge Ellen Huvelle tosses out Deripaska's libel suit against the Associated Press (AP). Huvelle rules Deripaska failed to show the AP knowingly misstated facts when it omitted some information about him from a story. Huvelle also denies a motion by the AP to recover its attorney costs. The suit was over an AP story about Deripaska's business dealings with Manafort. Both the AP and Deripaska file appeals for the two rulings.\n* October 18:\n** Fusion GPS partners Peter Fritsch and Thomas Catán appear before the House Intelligence Committee and invoke their Fifth Amendment rights against self-incrimination. Fritsch and Catán had both informed the committee when they received their subpoenas that they planned to invoke their Fifth Amendment rights and not testify. Regardless, Nunes took the unusual move of forcing them to appear even though the standard practice is to forego a hearing when witnesses indicate in advance that they will refuse to testify. The subpoena itself was also unusual in that it was signed only by Nunes. It is unclear whether other committee Republicans agreed to or knew of the subpoena being issued, and committee Democrats first learned of the subpoena from media reports.\n** Deutsche Bank receives a subpoena issued unilaterally by Nunes for all of Fusion GPS's bank records dating back to 2015.\n** Mueller's team interviews Spicer for the second of two days.\n** The Senate Intelligence Committee interviews Lewandowski.\n** The Senate Intelligence Committee interviews Kaveladze.\n* October 19:\n** The Daily Beast reports that Conway, Trump Jr. and Parscale pushed messages from an account operated from Russia's \"troll farm\", including allegations of voter fraud a week before Election Day.\n** Trump asks whether Russia, the FBI, or Democrats paid for the Steele dossier.\n** Senators Mark Warner and Amy Klobuchar introduce the Honest Ads Act, which would require digital platforms such as Facebook and Google to publicly archive advertisements with election content. McCain co-sponsors the legislation.\n** U.S. Ambassador to the United Nations Nikki Haley says that Russian online interference in American elections is \"warfare\" and spreading misinformation is the country's \"new weapon of choice.\"\n** According to The Washington Post, Pompeo \"distorts intelligence community's findings on Russian interference\".\n* October 20:\n** The Guardian reports that Russian billionaire Dmitry Rybolovlev, who bought Florida property from Trump in 2008, is under investigation in Monaco for breach of privacy related to his art dealings.\n** CNN reports that Senate investigators spoke with Russians present at the June 2016 meeting with Trump Jr.\n** Fusion GPS files suit in federal court in an attempt to block a subpoena issued unilaterally by Nunes for the firm's bank records.\n** Rosenstein confirms Mueller's authority to investigate Bijan Rafiekian and Kamil Ekim Alptekin for possible FARA-related crimes committed jointly with Flynn.\n* October 21: In an interview The New York Times columnist Maureen Dowd, former President Jimmy Carter says, \"I don't think there's any evidence that what the Russians did changed enough votes, or any votes.\"\n* October 23:\n** NBC News reports that Tony Podesta and the Podesta Group are now subjects in Mueller's investigation.\n** Kaspersky Lab, the Moscow-based cybersecurity firm whose software U.S. officials suspect helped the Russian government spy on Americans, promises to make its source code available for an independent review.\n** The Daily Beast reports that Greenfloid LLC, a tiny web hosting company registered to Sergey Kashyrin and two others, hosted IRA propaganda websites DoNotShoot.Us, BlackMattersUS.com and others on servers in a Staten Island neighborhood. Greenfloid is listed as the North American subsidiary of ITL, a hosting company based in Kharkiv, Ukraine, registered to Dmitry Deineka. Deineka gave conflicting answers when questioned by The Daily Beast about the IRA websites.\n** The Senate Intelligence Committee interviews Dearborn.\n* October 24:\n** Fusion GPS asks a federal judge in Washington for a restraining order to block the House Intelligence Committee from obtaining the firm's bank records, arguing that turning over the records would violate the First Amendment and poses an \"existential threat\" to the company.\n** Twitter plans to make political ads more transparent amid Russia revelations.\n** The Washington Post reports that the Clinton campaign and DNC were among the parties who paid for research that led to the Steele dossier.\n** Brad Pascale and Cohen testify back-to-back before the House Intelligence Committee.\n* October 25:\n** The head of Cambridge Analytica says he asked Assange for help finding Clinton's 33,000 deleted emails. Assange confirms the request and says he rejected the offer.\n** Feinstein and Grassley break ways in the Russia investigation.\n** Kaspersky Lab discloses that its software has uncovered secret code from the Equation Group on an NSA analyst's home computer.\n** Cohen appears before the Senate Intelligence Committee. In 2018, Cohen pleads guilty to perjury for lies he tells the committee.\n** Mueller's team interviews Trump campaign staffer Matt Miller.\n* October 26:\n** Twitter says it will no longer accept advertising from accounts owned by Russian-backed news outlets RT and Sputnik. Twitter vows to give away the $1.9 million already earned from them.\n** House Speaker Paul Ryan says that the FBI plans to hand over documents related to the Trump dossier.\n* October 27:\n** Feinstein sends five letters to key players, including one asking Facebook and Twitter for copies of advertising that Russian buyers aimed at the U.S.\n** The New York Times reports that The Washington Free Beacon, a conservative website funded by a major Republican donor, initially retained Fusion GPS to conduct opposition research on Trump.\n** Mueller's team interviews former CIA Director James Woolsey about Flynn.\n** The ODNI states that the dossier itself played no role in the coordinated intelligence assessment that Russia interfered in the U.S. election.\n** A federal grand jury in Washington, D.C., approves the first charges in Mueller's investigation, indicting Manafort and Gates on multiple felony counts.\n** The Senate Intelligence Committee interviews former Secretary of State John Kerry.\n** The Daily Beast reports that the IRA created a fake Hillary Clinton sex video. In 2018, NBC News reports that the video was released in 2016 and viewed on Pornhub over 250,000 times. In 2019, the Senate Intelligence Committee reveals that the video was originally posted on Reddit by the IRA user \"Rubinjer\", who also promoted the Hilltendo video game.\n* October 28: Reports further clarify that the charges returned by the grand jury under seal are \"related to meddling in the U.S. presidential election.\"\n* October 29: Mueller seizes three of Manafort's bank accounts.\n* October 30:\n** Manafort and Gates surrender themselves to the FBI after both are indicted on 12 federal charges brought by Mueller, including conspiracy against the United States and money laundering. Appearing in court a few hours later, Manafort and Gates plead not guilty. Manafort is released to home confinement on a $10 million bond, the terms of which will change on November 30. Gates is released to home confinement on a $5 million bond. They are required to surrender all passports and submit to in-home monitoring.\n** Mueller announces that Papadopoulos has pleaded guilty to making false testimony to the FBI. According to unsealed court documents, Papadopoulos met a Kremlin-linked professor, later identified by The Daily Telegraph as Joseph Mifsud of the University of Stirling's politics department. Mifsud told Papadopoulos that Moscow had damaging information on Clinton in the form of \"thousands of emails\".\n** A lawyer for Trump campaign co-chairman Sam Clovis states that Clovis was \"being polite\", following reports that he encouraged Papadopoulos to meet with Russian officials.\n** New disclosures provided to Congress by digital social media companies indicate that during the campaign Russian agents placed 1,000 videos on YouTube, 131,000 messages on Twitter, and, via 170 accounts,120,000 posts on Instagram. 80,000 Russia-linked posts on Facebook were viewed by up to 126 million people.\n** Mifsud tells The Daily Beast that he isn't the professor mentioned in Papadopoulos's statement of the facts, and that he doesn't know anyone in the Russian government.\n* October 31:\n** Trump calls Papadopoulos a \"low-level\" advisor and a \"liar\".\n** The Kremlin dismisses as \"baseless\" and \"ludicrous\" the notion that charges leveled by Mueller against three former Trump campaign officials constitute possible meddling by Russia in U.S. political affairs.\n** The Ukrainian government says it warned Facebook and U.S. officials years ago that Russia was conducting disinformation campaigns on its platform.\n** Politico reports that Sam Clovis, President Trump's nominee to be the Agriculture Department's chief scientist, has been \"a fully cooperative witness\" in the Senate Intelligence Committee's investigation of Russian interference.\n** Sarah Huckabee Sanders says that Mueller's probe brought down Papadopoulos only thanks to White House cooperation.\n** Facebook reports to Congress that the Russians succeeded in organizing a \"Miners for Trump\" rally.\nNovember\n* November:\n** Mueller's prosecutors interview Kushner.\n** The private equity firm Apollo Global Management gives Jared Kushner a $185 million loan. The loan was considered suspicious by some as Apollo's co-founder, Josh Harris, met several times with Kushner at the White House to discuss, among other things, a possible job in the administration. Also, the largest investor in Apollo's real estate trust, the Apollo-controlled entity that made the loan, is the Qatari government's Investment Authority. Kushner's company had previously tried to get a $500 million loan from the head of Qatar Investment Authority. The SEC drops an ongoing inquiry into Apollo in December.\n** Mueller's team obtains search warrants for two additional Cohen email accounts.\n* November 1:\n** The House Intelligence Committee releases a small sample of the ads a Russian troll farm purchased on Facebook during and after the U.S. presidential election.\n** Twitter acting general counsel Sam Edgett, Google general counsel Kent Walker, and Facebook general counsel Colin Stretch testify before the Senate Intelligence Committee. Edgett tells the committee that Twitter has found 2,752 IRA accounts and 36,746 Russia-linked bot accounts involved in election-related retweets. Walker tells them, \"Google's products didn't lend themselves to the kind of micro-targeting or viral dissemination that these [IRA] actors seemed to prefer.\"\n** Mueller's team interviews Jared Kushner for the first of two times.\n* November 2:\n** Page testifies to the House Intelligence Committee for seven hours. He confirms that he met Russian government officials during his July 2016 trip to Moscow, and contradicts Attorney General Sessions's testimony to the Senate in July that he did not know that Page had traveled to Russia during the campaign. Page also tells the Committee that he had briefed Hicks, Gordon and Lewandowski about the trip. Page invokes his Fifth Amendment right against self-incrimination when asked by Committee members why he withheld documents requested by the committee.\n** The Wall Street Journal reports that the DoJ has identified more than six Russian government officials involved in hacking the DNC's servers, and were considering bringing charges against them.\n** Kushner's team turns over documents to Mueller.\n* November 3:\n** Mueller's team interviews Burnham.\n** U.S. Representative Matt Gaetz files a proposed resolution in the House calling for Mueller to recuse himself from the Russia investigation because he was the head of the FBI during the events of the Uranium One controversy.\n** The Senate Intelligence Committee interviews Deripaska's U.S. lawyer Adam Waldman.\n** The Senate Judiciary Committee interviews Kaveladze.\n* November 5:\n** NBC News reports that federal investigators have gathered enough evidence to bring charges in their investigation of Flynn and his son.\n** Ryan vows that Congress shall not interfere with Mueller's investigations.\n** The New York Times reports that Wilbur Ross, after becoming Commerce Secretary, did not disclose his retained investments in a shipping firm he once controlled that has significant business ties to a Russian oligarch subject to American sanctions and Putin's son-in-law, Kirill Shamalov.\n* November 6:\n** An analysis of Twitter data shows Kremlin-backed online support for Trump began immediately after he started his campaign.\n** Veselnitskaya says that Trump Jr. indicated that a law targeting Russia could be reexamined if his father won the election, and asked her for written evidence that illegal proceeds went to Clinton's campaign.\n** BuzzFeed subpoenas the DNC for information related to the DNC hack as part of its efforts to defend itself against an ongoing libel suit connected to its publication of the Steele dossier.\n** Ross says there is \"nothing whatsoever improper\" about the relationship between an international shipping company he holds significant investments in and a Russian energy company whose owners include a Putin family member and an oligarch, Gennady Timchenko, subject to U.S. sanctions.\n** Politico reports Wendy Teramoto served as a part-time adviser to Ross while maintaining her board seat at the energy shipping company, Navigator, with a Kremlin-linked client.\n** Mueller's team interviews Annie Donaldson for the first time.\n* November 7:\n** Corey Lewandowski says that his \"memory has been refreshed\" of his email exchange with Page in which Page requested his permission to travel to Moscow.\n** The House Intelligence Committee privately interviews Keith Schiller, Trump's longtime bodyguard and, until September 20, his Oval Office Operations director. Schiller testifies that he believes Russians offered to send five women to Trump's hotel room during their 2013 trip to Moscow for the Miss Universe pageant, but that he did not think Trump met with the women. \"One source noted that Schiller testified he eventually left Trump's hotel room door and could not say for sure what happened during the remainder of the night.\"\n** Mueller's team interviews Papadopoulos.\n* November 8:\n** The Intercept reports that Pompeo met in late October with discredited former U.S. intelligence official William Binney, who has become an advocate for a disputed theory that the theft of the DNC emails was an inside job rather than a hack by Russian intelligence.\n** Simpson agrees to be interviewed by the House Intelligence Committee.\n** Congressional investigators have interviewed former Trump aides about the campaign's push to remove proposed language calling for giving weapons to Ukraine.\n** Senate Democrats have been privately investigating Russia's Europe meddling without Republican help.\n* November 9: The Senate Intelligence Committee interviews Kerry again.\n-->\n* November 10:\n** As reported in The Washington Post, Kathleen Hall Jamieson determines, through her analysis, Russians could plausibly have affected the outcome of the 2016 election.\n** Russia plans new measures to restrict U.S. media working in Russia after RT said it was pressured into registering as a foreign agent in America.\n** NBC News reports that Mueller's investigators are questioning witnesses about an alleged September 20, 2016, meeting between Flynn and Dana Rohrabacher, a staunch advocate of pro-Russia policies.\n** CNN reports that Mifsud has been missing for a week since he was last seen at his residence at Link Campus University in Rome. His whereabouts remain unknown until October 1, 2019.\n* November 11: Despite the unified assessment of the U.S. intelligence community, Trump says he took Putin at his word when Putin again denied directing an election influence campaign. Trump later says he sides with the U.S. intelligence agencies. Brennan and Clapper comment that Trump is being \"played\" by Putin, and accuse him of being \"susceptible to foreign leaders who stroke his ego.\"\n* November 12:\n** British spymasters fear that Kaspersky Lab anti-virus software given away for free by Barclays to more than 2 million customers may be an intelligence-gathering tool for the Russian government.\n** Lawyers for Alexsej Gubarev, who owns the Dallas-based web hosting firm Webzilla, are seeking to force Steele to provide testimony in Gubarev's case against BuzzFeed and its editor, Ben Smith.\n* November 13:\n** RT registers with the DoJ as a foreign agent under FARA.\n** The Atlantic reports that WikiLeaks asked Trump Jr. for his cooperation in sharing its work, in contesting the results of the election, and in arranging for Assange to be Australia's ambassador to the United States. The Atlantic also reports that Trump Jr. contemporaneously informed Bannon, Conway, Parscale and Kushner that he was in touch with WikiLeaks, and that Kushner informed Hicks. Pence denies any knowledge of WikiLeaks contacts.\n** Mueller's team interviews van der Zwaan.\n** The Senate Intelligence Committee interviews NSC Senior Director for Intelligence Programs Brett Holmgren.\n]]\n* November 14:\n** Simpson speaks for six hours with the House Intelligence Committee. He states that his research suggests that Trump was involved with Italian mafia figures early in his career and became associated with the Russian mafia in the 1990s. He describes evidence of Russian criminals buying Trump properties. He refers to a number of deaths and arrests following the publication of the Steele dossier. Simpson also asserts that Nigel Farage may have given Assange data on a flash drive at the Ecuadorian Embassy in London. The testimony transcript will be released on January 18, 2018.\n** Buzzfeed reports that the FBI is scrutinizing more than 60 money transfers from the Russian foreign ministry to its embassies across the globe. Most of the transactions, which moved through Citibank accounts and totaled more than $380,000, contained a memo line reading \"to finance election campaign of 2016\".\n** The New York Times reports that Rex Tillerson hired a Russian company with a KGB link to Putin to guard the United States Embassy in Moscow.\n** Mueller's team interviews Akhmetshin.\n* November 15:\n** The Russian Parliament votes unanimously for a new law about media \"foreign agents\", in retaliation for being forced to register RT as a propaganda outlet.\n** Steele says he believes his dossier is \"70–90% accurate\" and that his FBI contacts greeted his intelligence report with \"shock and horror\".\n** Mueller's team interviews Comey.\n* November 16:\n** The Washington Post reports that Kushner received and forwarded emails about WikiLeaks and a \"Russian backdoor overture and dinner invite\" that he kept from Senate Judiciary Committee investigators.\n** The Wall Street Journal reports that Mueller subpoenaed Trump campaign officials for Russia-related documents.\n** Guardian Faber publishes Luke Harding's Collusion: How Russia Helped Trump Win the White House, which details a network of connections originating in the 1980s between Trump and the Kremlin.\n** Mueller's team interviews Flynn for the first of 11 times through May 4, 2018.\n** Mueller's team interviews Kaveladze.\n* November 17:\n** CNN reports that Kushner told congressional Russia investigators in July that he did not communicate with WikiLeaks, and did not recall anyone on the Trump campaign who had.\n** Congressional aides say they may have answers on the pro-Russia GOP platform change.\n** The Wall Street Journal reports that the U.S. Department of Defense, and more specifically the Flynn-run Defense Intelligence Agency, flagged Kaspersky Lab as a potential threat as early as 2004.\n** Politico reports that Papadopoulos claimed in a Greek newspaper last year that Trump telephoned him to discuss his new position as a foreign policy adviser to his presidential campaign, and that the two had at least one personal introductory meeting that the White House has not acknowledged.\n** Mueller's team interviews Flynn for the second of 11 times.\n** The Senate Intelligence Committee interviews Strzok.\n* November 20:\n** Mueller's team interviews Flynn for the third of 11 times.\n** Veselnitskaya submits written testimony to the Senate Judiciary Committee in which she claims she has no relationship with the Russian Prosecutor General's office.\n** The Senate Intelligence Committee interviews Parscale.\n* November 21:\n** The Wall Street Journal reports that Mueller's investigators are asking questions about Kushner's interactions with foreign leaders during the presidential transition, including his involvement in a dispute at the United Nations in December.\n** The New York Times reports that Rohrabacher has come under Mueller's and the Senate Intelligence Committee's scrutiny in recent months for his \"close ties to the Kremlin\".\n** Mueller's team interviews White House Office of Legal Counsel attorney Uttman Dhillon.\n** Mueller's team interviews Flynn for the fourth of 11 times.\n** Mueller's team interviews Cohen's accountant Jeffrey Getzel. He tells them that he is under the impression that Cohen is going to receive a position in the Trump administration.\n* November 22:\n** Flynn withdraws from his joint defense agreement with Trump.\n** Trump attorney John M. Dowd leaves a voicemail for Flynn's lawyer Rob Kelner discouraging Flynn from cooperating.\n** Mueller's team interviews security expert Eric York for the third of three times.\n** Mueller's team interviews McFarland the second of three times.\n* November 23:\n** It is reported that Flynn's lawyers have notified Trump's legal team in recent days that they will no longer discuss Mueller's investigation.\n** The Senate Intelligence Committee interviews Adam Waldman.\n* November 27: The House Intelligence Committee subpoenas Randy Credico, a longtime associate of Stone. Credico replies by asserting his right to remain silent.\n* Late November:\n** Maria Butina and Paul Erickson attend a post-Thanksgiving barbecue at Representative Mark Sanford's family farm in South Carolina.\n** Adam Waldman visits Assange twice.\n* November 28: Mueller's team interviews Dearborn for the first time.\n* November 29:\n** Mueller's team interviews Eisenberg.\n** Mueller's team interviews Flynn for the fifth of 11 times.\n** Mueller's team interviews ODNI spokesperson Timothy Barrett.\n** The Senate Intelligence Committee interviews Frank Mermoud.\n* November 30:\n** Sessions testifies at a private meeting of the House Intelligence Committee. According to Schiff, Sessions refuses to say whether Trump asked him to hinder the Russia investigation.\n** The New York Times reports that Trump pressed Republicans Roy Blunt (R-MO), Richard Burr (R-NC), and Senate Majority Leader Mitch McConnell (R-KY) to end the Senate's Russia inquiry.\n** Stone confirms that his intermediary with Assange during the election was radio host Randy Credico.\n** Prince testifies before a closed-door hearing of the House Intelligence Committee. He insists that he didn't travel to the Seychelles to meet someone from Russia. Afterwards, he demands an apology from Schiff for \"wasting all of our time, for wasting millions of taxpayer dollars on a meaningless fishing expedition.\"\n** Mueller's team interviews McGahn for the first of six times.\nDecember\n* December:\n** The SEC drops an inquiry into how Apollo Global Management reported financial results. The inquiry had been ongoing since the Obama administration. This was considered suspicious by some as it came one month after Apollo gave Jared Kushner a $185 million loan, and months after Apollo's co-founder, Josh Harris, met with Kushner to discuss a possible job in the administration.\n** Butina declines a request to testify before the Senate Judiciary Committee because of lack of support from Republican members.\n* Early December: Trump becomes furious about news reports that Mueller has issued subpoenas to Deutsche Bank for records related to Trump, telling advisers he wants Mueller's investigation shut down. Trump backs off after Mueller's office tells his lawyers the reports are erroneous.\n* December 1:\n** Flynn pleads guilty in federal court to giving false testimony to the FBI about his contacts with Kislyak. As part of Flynn's negotiations, his son, Michael G. Flynn, is not expected to be charged. In the statement of the offense, K.T. McFarland is identified as \"PTT official\", and Sergey Kislyak as \"Russian Ambassador\".\n** Bloomberg reporter Eli Lake speculates in an opinion piece that Kushner is the person mentioned in Flynn's plea documents who is said to have ordered Flynn to contact Russia.\n** ABC News reports Flynn is prepared to testify that Trump directed him to make contact with the Russians, in the context of plans to defeat ISIS.\n** ABC News suspends news correspondent Brian Ross for 4 weeks for wrongly reporting that it was candidate Trump rather than President-elect Trump who had directed Flynn to contact the Russian government.\n** Trump's lawyer Ty Cobb says that Flynn's plea \"clears the way for a prompt and reasonable conclusion\" to the Russia investigation.\n* December 2:\n** The New York Times reports that even as the White House portrayed Flynn as a renegade who had acted independently in his discussions with a Russian official, emails among top transition officials provided or described suggest otherwise.\n** Trump admits to knowing that Flynn lied to the FBI in his tweet: \"I had to fire General Flynn because he lied to the Vice President and the FBI.\"\n* December 3:\n** Feinstein says on Meet the Press that her group is \"putting together of a case of obstruction of justice\" against Trump.\n** Trump's personal lawyer, John M. Dowd, says that he wrote the December 2 tweet on the @realDonaldTrump Twitter account about Flynn's firing. Dowd also says Trump knew in January 2017 that Flynn had likely lied to the FBI.\n** Trump calls the FBI a biased institution whose reputation for fairness is \"in tatters\".\n* December 4:\n** Trump says he \"feels badly\" for Flynn, and claims that Clinton \"lied many times\" to the agency without consequences.\n** An email sent during the transition by Trump's former deputy national security adviser, K. T. McFarland, appears to contradict the testimony she gave to Congress over the summer. The email shows McFarland knew about Flynn's December 29, 2016 call with Kislyak, while her written testimony says she had no knowledge of it at the time.\n** Prosecutors say that Manafort worked on an op-ed with Ukrainian journalist Oleg Voloshyn, an associate with ties to Russian intelligence, while out on bail; a court filing requests that the judge revoke Manafort's bond agreement.\n** Mueller's team interviews Denman for a second and final time.\n** The Senate Intelligence Committee interviews Denman.\n* December 5:\n** Reports indicate that Mueller has subpoenaed Deutsche Bank for data on accounts held by Trump and his family, prompting denials by Trump's lawyers Jay Sekulow and John Dowd. Subsequent reports on December 6 indicate that only information on Trump's associates has been subpoenaed.\n** Cambridge Analytica's Alexander Nix and Trump's longtime assistant Rhona Graff are scheduled to be interviewed by the House Intelligence Committee about the connections between Trump and the Kremlin.\n** Democrats place a hold on McFarland's nomination as ambassador to Singapore until she answers their questions about her knowledge of communications between Flynn and Kislyak.\n** Deripaska and the Associated Press (AP) agree to drop their appeals of rulings in Deripaska's libel suit against the AP. In October, Judge Ellen Huvelle dismissed the suit and denied the AP's request to recover attorney's fees.\n* December 6:\n** An unnamed \"whistleblower\" claims that Flynn told a former business associate that economic sanctions against Russia would be \"ripped up\" as one of the Trump administration's first acts.\n** Trump Jr. testifies to the House Intelligence Committee in private. He refuses to answer questions about conversations with his father, based on attorney-client privilege. Trump Jr. says he communicated with Hicks, not his father, about the response to his Veselnitskaya meeting.\n** New Jersey Governor Chris Christie says he was ousted as head of Trump's transition team due in part to his opposition to hiring Flynn as National Security Adviser.\n** Rosenstein confirms that he is satisfied thus far with Mueller's work.\n** The U.S. House of Representatives dismisses Al Green's resolution to impeach Trump, with 58 members requesting a vote and 364 refusing it.\n** Trump again urges Sessions to unrecuse himself and investigate Clinton. Sessions responds that he will operate under the law.\n* December 7:\n** Mueller's team interviews White House Communications Director Hope Hicks over two days. She is interviewed again on March 13, 2018.\n** During testimony to Congress, Director Christopher A. Wray defends the FBI from Trump's criticism of December 3.\n** The House Ethics Committee clears Nunes of misconduct in relation to the matter of his proximity to the White House and accusations that he inappropriately disclosed classified information. It is unclear how thorough the ethics investigation was since the Ethics Committee relied upon outside intelligence experts to review the material instead of comparing the material to Nunes's public statements themselves.\n* December 8:\n** Representative Matt Gaetz discusses Mueller's investigation with Trump aboard Air Force One en route to Florida. Representative Ron DeSantis is also aboard.\n** The Senate Intelligence Committee interviews former FBI Cyber Division assistant director Jim Trainor.\n* December 12:\n** Trump's lawyers call for an investigation into the FBI's and the DoJ's alleged conflicts of interest associated with the work of Fusion GPS on the Steele dossier.\n** The DoJ shows journalists private text messages between Peter Strzok and Lisa Page exhibiting anti-Trump and pro-Clinton sentiments.\n** Mueller's team interviews Thomas Barrack.\n** Mueller's team interviews McGahn for the second of six times.\n* December 13:\n** At a House Judiciary Committee hearing, Rosenstein states that he has seen no cause to dismiss Mueller, and confirms that Mueller is working within the boundaries of his brief. Rosenstein further states that Strzok's dismissal was appropriate and timely, and he contradicts Trump's claim that Mueller's investigation is a \"witch hunt\".\n** Trump Jr. meets with the U.S. Senate Intelligence Committee.\n** Mueller's team interviews Akhmetshin associate Ed Lieberman.\n* December 14:\n** The Wall Street Journal reports on the interview of Cambridge Analytica chief executive Alexander Nix by the House Intelligence Committee, stating that Mueller requested documents from the firm before or during October 2017. In undercover videos released by the British Channel 4 in March, Nix described his testimony. According to Nix, the Republicans on the committee asked only three questions and that portion of the interview lasted only five minutes, while the Democrats asked questions for two hours. This description of the nature of the testimony was confirmed by Adam Schiff, who said \"my (Republican) colleagues had a habit of asking three questions: Did you conspire, did you collude, did you coordinate with Russians? And if the answer was no, they were pretty much done\". Schiff also said the Republicans rejected requests that Nix be brought back before the committee.\n** At his annual news conference, Putin describes allegations of election interference as invented by Trump's political opponents, and states that contacts between Trump's associates and Russian officials before the election were appropriate.\n** The Washington Post reports in detail on Trump's associates' efforts to avoid the subject of Russia, to preclude Trump's \"rages\".\n** In the second of two interviews, Stephen Miller tells Mueller's team that he does not remember Clovis or Papadopoulos telling him that Russia had dirt on Clinton or possessed copies of her emails.\n** Mueller's team interviews McGahn for the third of six times.\n** The Senate Intelligence Committee interviews delegate to the 2016 Republican National Convention Dianna Denman.\n* December 15:\n** Answering questions from reporters, Trump reiterates his description of Russian collusion as a \"hoax\" and declines to comment on a possible pardon of Flynn. Trump declares that his own innocence is now \"proven\".\n** Inspector General Michael E. Horowitz states that he did not authorize the release to the press of the Strzok/Page text messages.\n** The Washington Post reports that Strzok and Page were using the text messages as a cover story for an extramarital affair between them.\n** Mueller's team interviews Sater for the second of two times.\n* December 16:\n** Kory Langhofer, a lawyer for Trump for America, sends Congress a letter alleging that Mueller's acquisition, via the GSA, of tens of thousands of emails sent and received by 13 senior Trump transition team members is unlawful. The communications derive from the official Presidential Transition Team domain, ptt.gov.\n** Trump escalates his criticism of the FBI over its Russia investigation, saying, \"It's a shame what's happened with the FBI ... It's a very sad thing to watch.\"\n* December 17:\n** Responding to Langhofer's accusation of December 16, GSA Deputy Counsel Lenny Loewentritt states that Trump's transition team was explicitly advised that all material passing through government equipment would be subject to monitoring and would not be held back from law enforcement officers.\n** Mueller's spokesman Peter Carr rejects Langhofer's claims, stating that the Trump transition emails were acquired appropriately through the criminal investigation process.\n** White House Director of Legislative Affairs Marc Short states there has been \"no conversation\" in the White House concerning any potential dismissal of Mueller. Trump shortly thereafter confirms that he is not considering dismissing Mueller.\n* December 18:\n** NBC News reports that the FBI warned Trump after his nomination at the 2016 RNC on July 19, 2016, that foreign adversaries, including Russia, would probably try to spy on and infiltrate his campaign.\n** The Washington Post reports that the Senate Intelligence Committee is looking at Jill Stein's presidential campaign for potential \"collusion with the Russians.\"\n** The House Intelligence Committee interviews Rob Goldstone and Debbie Wasserman Schultz.\n* December 19:\n** FBI Deputy Director Andrew McCabe testifies in private to the House Intelligence Committee about Russian election interference.\n** Gizmodo reports that the Trump transition team discussed Flynn's use of Signal to encrypt conversations, according to GSA emails under FOIA.\n** Senator John McCain's former staffer David J. Kramer testifies before the House Intelligence Committee in a closed-door session about his role in bringing the Steele dossier to the FBI.\n** The Senate Intelligence Committee interviews Rohrabacher.\n** The Senate Intelligence Committee interviews Behrends.\n* December 20:\n** Mark Warner delivers a speech to the Senate warning Trump of \"immediate and significant consequences\" should he attempt to dismiss Mueller or to pardon those involved in the investigation.\n** Foreign Policy reports that records submitted to Mueller's team indicate that McGahn researched federal law related both to the Logan Act and making false statements to investigators in the early days of Trump's presidency and that he may have warned Trump that Flynn was in potential violation.\n** Reports emerge that a group headed by Nunes has spent several weeks compiling a report on alleged \"corruption and conspiracy in the upper ranks of federal law enforcement\".\n** In private testimony before the House Intelligence Committee this week, McCabe tells lawmakers that Comey informed him of conversations he had with Trump soon after they happened.\n** Felix Sater is interviewed in New York by Congressional staff.\n** The Senate Intlleligence Committee interviews Veterans for Trump national director Matt Miller.\n* December 22:\n** The New York Times reports that federal prosecutors in the Eastern District of New York have sought records from Deutsche Bank about entities associated with Kushner's family businesses. The prosecutors are examining a $285 million loan Deutsche Bank made one month before Election Day to lease 229 West 43rd Street, the former New York Times building in Times Square.\n** Journalist David Corn, the first to report the existence of the Steele dossier, denies that FBI General Counsel James Baker was his source, following Baker's reassignment.\n** Mueller's team interviews McFarland the final of three times.\n* December 23: Kramer's lawyer, Larry Robbins, sends a letter to the House Intelligence Committee informing them they have a leak. He tells them that after his client testified before the committee on December 19, Cohen's lawyer Stephen Ryan contacted Robbins because someone from the House told him that Kramer has information that could help Cohen. Robbins says he declined Ryan's request for help.\n* December 24: The Guardian reports that the FBI has asked the Central Bank of Cyprus for financial information about the defunct FBME Bank, which was used by wealthy Russians with political connections and has been accused by the U.S. government of money laundering. Bloomberg reports that the Russia-related investigation into FBME was connected to a flow of illegal Russian funds into the New York real estate market.\n* December 27:\n** According to The Washington Post, Trump's legal team plans to cast Flynn as a \"liar seeking to protect himself\" if he accuses Trump or his senior aides of any wrongdoing.\n** Investigative journalist Michael Isikoff reports that Mueller has begun questioning RNC staffers about the party's digital operation that worked with the Trump campaign to target voters in key swing states.\n** Kramer receives a subpoena to make a second appearance before the House Intelligence Committee. Ten minutes later, conservative media report that the committee issued a subpoena to Kramer to appear in January.\n* December 28: When questioned about his plans regarding the Mueller probe in a New York Times interview with Michael S. Schmidt, Trump says, \"I have absolute right to do what I want to do with the Justice Department.\"\n2018\nSee also\n* Assessing Russian Activities and Intentions in Recent US Elections\n* Business projects of Donald Trump in Russia\n* Criminal charges brought in the Mueller special counsel investigation\n* Cyberwarfare by Russia\n* Donald Trump's disclosures of classified information\n* Efforts to impeach Donald Trump\n* Foreign electoral intervention\n* Propaganda in post-Soviet Russia\n* Russian interference in the 2016 Brexit referendum#Timeline\n* Social media in the United States presidential election, 2016\n* Timelines related to Donald Trump and Russian interference in United States elections\nReferences\nFurther reading\n}}\nExternal links\n}}"
    }
  ]
}