{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Jakarta\n\nThe following is a timeline of the history of the city of Jakarta, Indonesia.\nPrior to 19th century\n* 397 CE – The port town known as Sunda Kelapa.\n* Mid 5th century – The region around the port was under Hindu Tarumanagara kingdom's rule, according to Tugu inscription discovered in North Jakarta.\n* 13th to 16th century – The port of Sunda Kalapa was the main port of Hindu Sunda Kingdom, served the capital, Pakuan Pajajaran (now Bogor), located about 60&nbsp;km inland south\n* 1513 – Portuguese ships arrived.\n* 1522 – Padrão erected in Sunda Kelapa to mark Sunda-Portuquese treaty.\n* 1527\n** Fatahillah, on behalf of the Sultanate of Demak, conquers the Portuguese in Sunda Kalapa.\n** Sunda Kalapa renamed Jayakarta.\n* 1610 – Dutch trading post established.\n* 1619\n** Jan Pieterszoon Coen of the Dutch East India Company seizes the port of Jayakarta from the Sultanate of Banten.\n** City renamed Batavia.\n* 1628–1629 – Sultan Agung of Mataram launched Siege of Batavia.\n* 1695 – Gereja Sion built.\n* 1699 – An earthquake in Batavia causes the collapse of 49 buildings and leaves 28 dead.\n* 1710 – Stadhuis (town hall) built.\n* 1740 – Massacre of ethnic Chinese by Dutch East Indies troops.\n* 1744 – Amsterdam Gate built.\n* 1778 – Royal Batavian Society of Arts and Sciences founded.\n* 1797 – Kebon Jahe Kober cemetery established.\n19th century\n* 1804 – Negara Palace built.\n* 1811 – British took power.\n* 1814\n** Dutch rule of city restored.\n** Theatre built.\n* 1821 – Schouwburg Weltevreden concert hall built.\n* 1829 – Hotel de Provence established.\n* 1834 – 1834 Java earthquake\n* 1836 – 3 February: the first government steamboat, Willem I, arrived at the Batavia shipyard of Island Onrust. This was followed by the arrival of another steamer from the \"Nederland\" Royal Mail line in September 1871.\n* 1837 – Frederik-Hendrik citadel built.\n* 1851 – Medical school founded.\n* 1853\n** \"Society for the promotion of industry and agriculture\" established.\n** By the end of 1853, the first exhibition of agricultural products and native arts and crafts was held in Batavia.\n* 1860 – Gymnasium William III established.\n* 1864\n** March – a concession was granted to the Netherlands Indian Railway Company for the construction of a railway between Batavia and Buitenzorg.\n** Zoo established by Vereneging Plantenen Dierentuin.\n* 1868 – Gedung Gajah museum opens.\n* 1869\n**The opening of Suez Canal reduces the voyage from Europe to Batavia to 5 weeks.\n**Batavia Tramway Company started the horse-tram line, 'nr 1: Old Batavia' (now Kota Tua). The route started at Amsterdam Poort in the northern end of Prinsenstraat (now Jalan Cengkeh) and then reached Molenvliet (Jalan Gajah Madah) and Harmonie.\n* 1870\n** Artesian wells built.\n** Jakarta Kota Station built (approximate date).\n* 1871\n**15 September: Batavia-Buitenzorg railway line completed.\n**16 September: Batavia-Buitenzorg railway line's service was opened\n* 1877 – A boom occurred in the international trade activity with Europe and the increase of shipping led to the construction of a new harbor at Tanjung Priok between 1877 and 1883.\n* 1878 – 1 June: Commemoration of the first centenary of the Batavian Society of Arts and Sciences was held on 1 June 1878.\n* 1879 – Gambir Palace built.\n* 1880 – Population of Batavia: 96,957.\n* 1881\n**1 December: the first dock of the Netherlands Indian Dry Docks Company was opened on Pulau Amsterdam (Eiland Amsterdam, present Pulau Untung Jawa) in the roadsteads of Batavia.\n** Batavia-Buitenzorg-Cicurug railway line completed.\n* 1882\n**Batavia-Buitenzorg-Cicurug-Sukabumi railway line completed.\n**Horse-tram lines were reconstructed into steam tram lines.\n* 1883\n**Batavia-Buitenzorg-Cicurug-Sukabumi-Cianjur railway line completed.\n**12 August to 19 November: an exhibition of agricultural products and native arts and crafts was held at Batavia's Koningsplein.\n**Tsunami\n**Dutch Indies Telephone Company established in Batavia.\n* 1884\n** Batavia-Buitenzorg-Bandung railway line completed.\n**November – an exhibition of Javanese crafts and arts was held in the Zoological Gardens (now Taman Ismail Marzuki).\n** Weltevreden Station built.\n* 1886 – Tanjung Priuk Station completed, connecting Tanjung Priok harbor with Batavia.\n* 1888 – 15 January: an anatomical and bacterial laboratory established in Batavia.\n* 1886 – Tanjung Priok harbor built.\n* 1894 – 1 November: Batavia-Surabaya connected with the opening of the railway section Tasikmalaya-Maos\n* 1895 – 16 July: Pasteur Institute established.\n* 1898 – Population of Batavia: 115,567.\n* 1898 – The Opiumregie begins operations in Batavia.\n* 1899 – The electric train operated. It was the first ever electric train in the Kingdom of Netherlands.\n20th century\n1900s–1940s\n* 1901 – Jakarta Cathedral built.\n* 1903 – \"City council\" created.\n* 1906 – Gambir Market begins.\n* 1910 – Jatinegara Station built.\n* 1912 – Jakarta Stock Exchange established.\n* 1917 – Panus Bridge opened, connecting Batavia with Bogor\n* 1918\n** Municipal water company created.\n** Population: 234,697.\n* 1920 – Jakarta Flood Canal built.\n* 1922 – Cut Mutiah Mosque founded.\n* 1928 – Persija Jakarta football club founded.\n* 1930 – Population: 533,000.\n* 1931 – Old Indonesia football derby begins.\n* 1932 – Bioscoop Metropool built.\n* 1940 – Kemayoran Airport opens.\n* 1942 – City occupied by Japanese.\n* 1945 – Suwiryo becomes mayor.\n* 1948\n** Kebayoran Baru development begins.\n** Daan Jahja becomes military governor.\n** Population: 823,000.\n* 1949\n** City renamed Djakarta.\n** Kodam Jaya, Akademi Nasional, and National Archives of Indonesia established.\n** Ikada field renamed Merdeka Square.\n** Istana Gambir renamed Istana Merdeka.\n1950s–1990s\n* 1950\n** Suwiryo becomes mayor again.\n** State university established in Jakarta.\n** Major expansion of Jakarta's Administrative Boundaries (then called \"Kotapraja\"); Kotabaru Kebayoran Baru and Tjililitan airfield (Now Halim Perdanakusuma International Airport) amongst the new areas annexed from West Java (now Banten Province).\n* 1951 – Sjamsuridjal becomes mayor.\n* 1952\n** Population: 1,782,000.\n** First Section of The Road connecting Kotabaru Kebayoran Baru into then-City Proper (Gadjah Mada-Hayam Wuruk-Medan Merdeka Street Axis), Mohammad Husni Thamrin Street construction completed.\n* 1953\n** Sudiro becomes mayor.\n** Universitas Kristen Indonesia established.\n** Bank Indonesia headquartered in Jakarta.\n* 1955 –  Second and the final section of the road connecting Kotabaru Kebayoran Baru into then-city proper (Gadjah Mada-Hayam Wuruk-Medan Merdeka Street Axis), Sudirman Street construction Completed.\n* 1957 – Water Treatment Plant Pejompangan I created.\n* 1958 – SMA Negeri 8 Jakarta Public High School established.\n* 1960 – Soemarno Sosroatmodjo becomes governor.\n* 1961\n** Special Capital Region of Jakarta (province) created.\n** Population: 2,906,533.\n* 1962\n** Hotel Indonesia opens.\n** Selamat Datang Monument and Gelora Bung Karno Stadium built.\n** 4th Asian Games held.\n* 1964 – Henk Ngantung becomes governor.\n* 1965\n** Soemarno Sosroatmodjo becomes governor again.\n** Balai Sarbini (concert hall) and Tanjung Priok-Cililitan Bypass built.\n** Kompas newspaper begins publication.\n** 30 September Movement.\n* 1966\n** Ali Sadikin becomes governor.\n** Jakarta government divided into 5 self-governing cities: Central Jakarta (Jakarta Pusat), West Jakarta (Jakarta Barat), South Jakarta (Jakarta Selatan), East Jakarta (Jakarta Timur), and North Jakarta (Jakarta Utara).\n** Water Treatment Plant Pejompangan II created.\n** Ragunan Zoo and Ancol Dreamland resort open.\n* 1967 – YARSI University established.\n* 1968\n** Jakarta Fair begins.\n** Wisma Delima opens in Jalan Jaksa.\n** Taman Ismail Marzuki Art Center opens.\n* 1970 – 16th Asia Pacific Film Festival held.\n* 1971\n** Prambors FM radio begins broadcasting.\n** Tempo magazine begins publication.\n** Population: 4,576,009.\n* 1972\n** Spelling officially changed to Jakarta with introduction of the Perfected Spelling system.\n* 1974\n** January: Anti-Japanese Malari incident occurs.\n** Jakarta Convention Center opens.\n** Jakarta History Museum opens.\n** Binus University founded.\n** Betawi Cultural Heritage District established in Condet.\n* 1975\n**Wayang Museum of puppetry established.\n** Taman Mini Indonesia Indah and Museum Indonesia opensF.\n** National Monument (Indonesia) built.\n** Jakarta's last major Change within its Administrative Boundaries (as of March 2022).\n* 1976\n** Blok G government highrise built as a benchmark for other highrise in Jakarta.\n** Museum Seni Rupa dan Keramik established.\n* 1977\n** Tjokropranolo becomes governor.\n** Museum Bahari established.\n** Taman Prasasti Museum opens.\n* 1978\n** Istiqlal Mosque, Jakarta built.\n** Jagorawi Toll Road opens, linking Bogor, Ciawi, and Jakarta.\n** Textile Museum opens.\n* 1979\n** Jakarta hosts 1979 Southeast Asian Games\n** Sister city relationship established with Jeddah, Saudi Arabia.\n* 1980\n** National Library of Indonesia and Jakarta Foreign Correspondents Club founded.\n** Population: 6,503,449.\n** Ratu Plaza, the First Superblock Development in Jakarta and in Indonesia, Opened.\n* 1981 – SMA Negeri 68 Jakarta public high school established.\n* 1982 – R. Soeprapto becomes governor.\n* 1983 – 25 April: The Jakarta Post newspaper begins publication.\n* 1984\n** 12 September: Tanjung Priok massacre occurs.\n** October: Anti-Chinese bombings.\n** Sister city relationships established with Islamabad, Pakistan, and Seoul, South Korea.\n* 1985\n** Soekarno–Hatta International Airport opens; Kemayoran Airport closes.\n** Mercu Buana University established.\n* 1986\n** Dunia Fantasi theme park opens in Ancol Dreamland.\n** Sister city relationship established with Rotterdam, Netherlands.\n* 1987\n** Wiyogo Atmodarminto becomes governor.\n** Jakarta host 1987 Southeast Asian Games\n* 1988 – Jakarta–Cikampek Toll Road opens.\n* 1990\n** Mal Kelapa Gading opens.\n** Lippo Cikarang starts.\n** Sister city relationship established with Los Angeles, USA.\n* 1991\n** Jakarta Fair venue moved from Merdeka Square to Kemayoran.\n** Plaza Indonesia, a High-end Shopping Centre in Menteng, Central Jakarta, opens with an accompanying opening ceremony by The-then President of Indonesia, Soeharto.\n** Sister city relationship established with Casablanca, Morocco.\n* 1992\n** Soerjadi Soedirdja becomes governor.\n** Jakarta Convention Center reopens after major expansion (approximate date).\n** Sister city relationship established with Beijing, China.\n* 1993\n** Mayapada Tower built.\n** Purna Bhakti Pertiwi Museum opens.\n** Sister city relationship established with Berlin, Germany.\n* 1995\n** \"Kenduri Nasional\", national commemoration to celebrate 50th years of Indonesian Independence held in Merdeka Square.\n** Plaza Senayan, a high-end Shopping Mall in Tanah Abang, Central Jakarta (Culturally Considered Part of South Jakarta), opens.\n** Sister city relationship established with Paris, France.\n** Population: 9,160,500 (estimate).\n* 1996\n** Wisma 46, the highest building in Jakarta & Indonesia until surpassed 2016, opens.\n** Society for Interreligious Dialogue established.\n** 27 July: Indonesian government forces attacked the head office of the Indonesian Democratic Party in Menteng, Central Jakarta, which was being occupied by supporters of recently ousted party leader Megawati Sukarnoputri.\n* 1997\n** Sutiyoso becomes governor.\n** Jakarta Tower construction begins, yet stopped due to Asian financial crisis.\n** Jakarta host 1997 Southeast Asian Games\n* 1998 – Riots against Suharto's Government.\n* 1999 – Jakarta International Film Festival begins.\n* 2000\n** Jakarta Stock Exchange bombing.\n** Population density: 12,200 people per square kilometer.\n21st century\n2000s\n* 2003 – 5 August: Marriott Hotel bombing.\n* 2004\n** 15 January: TransJakarta, the bus rapid transit system of Jakarta, starts operations.\n** 9 September: Australian Embassy bombing.\n** Jakarta Monorail construction begins, yet halted months later.\n** Asian Network of Major Cities 21 meets in Jakarta.\n* 2005\n** Food scare.\n** Jakarta International Java Jazz Festival begins.\n** Ritz-Carlton Jakarta opens.\n* 2006 – Indosiar Television Tower built.\n* 2007\n** 8 August: 2007 Jakarta gubernatorial election held; Fauzi Bowo wins.\n** Indonesia Stock Exchange formed.\n** Flood.\n** The Peak Twin Towers built.\n* 2008 – Messiah Cathedral opens.\n* 2009\n** Aula Simfonia Jakarta opens.\n** Hotel bombings.\n2010s\n* 2010 – Population: 9,607,787; population density: 14,600 people per square kilometer.\n* 2011\n** Jakarta host 2011 Southeast Asian Games with Palembang\n** Population: 10,187,595.\n* 2012\n** Mata Elang International Stadium opens.\n** MRT Jakarta construction begins.\n** October: Joko Widodo becomes governor.\n* 2013\n** January: Flooding.\n** Population: 9,988,329.\n* 2014 – Basuki Tjahaja Purnama becomes governor.\n* 2016 – 4 November: an Islamist mass protest took place on 4 November 2016 in Jakarta, Indonesia. It was attended by an estimated 50,000–200,000 protesters, and was aimed against the Governor of Jakarta Basuki Tjahaja Purnama (popularly known as \"Ahok\"), for an alleged blasphemy of the Quran, the Islamic holy book.\n* 2017\n** Anies Baswedan elected governor\n**  Former Jakarta Governor Basuki Tjahaja Purnama sentenced to two years in prison for blasphemy\n* 2018\n** 18 August – 2 September: Jakarta host 2018 Asian Games with Palembang\n** Jakarta host 2018 Asian Para Games.\n* 2019\n**24 March: The first phase of the Jakarta MRT opens.\n**22 May: A mass protest against the 2019 Indonesian general election results, which later turned into a riot, took place on 22 May 2019 in Jakarta, Indonesia.\n**23–24 September: Mass protests led by students took place in front of the DPR/MPR Building.\n**1 December: Jakarta LRT The first phase is opens.\n2020s\n*2020\n**1 January: Flood strikes the Jakarta Metropolitan Area on 1 January 2020.\n*2022\n** Jakarta International Stadium opens.\n** Jakarta ePrix held.\nSee also\n* History of Jakarta\n* Governor of Jakarta\n* List of colonial buildings and structures in Jakarta\n* Other names of Jakarta\n* Greater Jakarta\n* Urbanization in Indonesia\n* Timeline of Indonesian history\nReferences\nThis article incorporates information from the Indonesian Wikipedia and German Wikipedia.\nBibliography\n;Published in the 20th century\n*  |short= 1}}\n*\n*\n* Susan Abeyasekere. Jakarta: A History. Singapore: Oxford University Press, 1987.\n* Abidin Kusno, \"Modern Beacon and Traditional Polity: Jakarta in the Time of Sukarno,\" chapter 2 Behind the Postcolonial: Architecture, Urban Space and Political Cultures in Indonesia (London: Routledge, 2000) 49–70.\n;Published in the 21st century\n*\n*\n*\n*\n}}\n*\n}}\n*\n*\n}}\n*\n}}\nExternal links\n*"
    }
  ]
}