{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Joe Biden presidency (2023 Q2)\n\nThe following is a timeline of the presidency of Joe Biden during the second quarter of 2023, from April 1 to June 30, 2023. For a complete itinerary of his travels, see List of presidential trips made by Joe Biden (2023). To navigate between quarters, see timeline of the Joe Biden presidency. For the Q3 timeline see timeline of the Joe Biden presidency (2023 Q3).\nTimeline\nApril 2023\n{| class=\"wikitable\"\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 115\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Saturday, April 1\n|\n* Vice President Kamala Harris arrives at farm in Lusaka, Zambia, on the final day of her trip to Africa.\n* In Lusaka, Zambia, Vice President Kamala Harris delivers remarks on increasing climate resilience, adaptation and mitigation across Africa.\n|\n|-\n|Sunday, April 2\n|\n* President Biden approves a major disaster declaration for the areas in the state of Arkansas affected by severe storms and tornadoes on March 31, 2023.\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 116\n|-\n!Date\n!Events\n!Photos/Videos\n|-\n|Monday, April 3\n|\n* President Biden approves a major disaster declaration for the areas in the state of California affected by severe winter storms, straight-line winds, flooding, landslides, and mudslides beginning on February 21, 2023.\n|\n|-\n|Tuesday, April 4\n|\n* President Biden talks Britain’s King Charles III in a phone call that First Lady Jill Biden will attend the monarch’s coronation ceremony in May. Biden also congratulates Charles III on his coronation and says that he would like to meet him in the United Kingdom at a later date.\n* President Biden delivers remarks in the meeting with the President’s Council of Advisors on Science and Technology.\n|\n|-\n|Wednesday, April 5\n|\n*\n|\n|-\n|Thursday, April 6\n|\n*\n|\n|-\n|Friday, April 7\n|\n*\n|\n|-\n|Saturday, April 8\n|\n*\n|\n|-\n|Sunday, April 9\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 117\n|-\n!Date\n!Events\n!Photos/Videos\n|-\n|Monday, April 10\n|\n*President Biden and First Lady Jill Biden host the White House Easter Egg Roll.\n|\n|-\n|Tuesday, April 11\n|\n* President Biden speaks with the family of Wall Street Journal reporter Evan Gershkovich after calling the reporter’s detention in Russia “totally illegal”.\n* President Biden leaves Washington for Belfast, Northern Ireland alongside his son Hunter Biden and his sister Valerie Biden. This is the first stop of his four-day, two-country trip.\n* Northern Ireland police says that four devices, described as pipe bombs, were found in a cemetery based in the Creggan area of Derry, on the same day ahead of President Joe Biden's visit to the country. Derry City and Strabane area commander Superintendent Nigel Goddard says that the main line of inquiry into the incident was attributed to the New IRA (a paramilitary group).\n* President Biden arrives in Belfast, Northern Ireland to mark the 25th anniversary of the Good Friday Agreement.\n|\n|-\n|Wednesday, April 12\n|\n* President Biden meets with British Prime Minister Rishi Sunak and delivers remarks at Ulster University.\n|\n|-\n|Thursday, April 13\n|\n* Irish President Michael D. Higgins welcomes President Biden to Áras an Uachtaráin and holds a bilateral meeting with him.\n* President Biden meets with Taoiseach Leo Varadkar at Farmleigh House.\n* President Biden delivers an address to the Irish parliament, becoming the fourth president of the United States to do so.\n* President Biden invites singer Lady Gaga to be co-chair of the Presidential Committee on the Arts and Humanities.\n* During a visit to Northern Ireland, President Biden says that he is \"very close\" to finding the person responsible for the leak of US intelligence service documents, which have been circulating on social media for days.\n|\n|-\n|Friday, April 14\n|\n* President Biden departs Dublin, arriving in Knock, Ireland, in County Mayo.\n* President Biden delivers remarks in Ballina, County Mayo, on the west coast of Ireland, where he ends his trip with a speech in the same city, home of his paternal ancestors.\n|\n|-\n|Saturday, April 15\n|\n*\n|\n|-\n|Sunday, April 16\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 118\n|-\n!Date\n!Events\n!Photos/Videos\n|-\n|Monday, April 17\n|\n*\n|\n|-\n|Tuesday, April 18\n|\n* President Biden signs an executive order related to childcare and eldercare during an event in the Rose Garden of the White House, in Washington, D.C.\n|\n|-\n|Wednesday, April 19\n|\n*\n|\n|-\n|Thursday, April 20\n|\n* President Biden holds a bilateral meeting with Colombian President Gustavo Petro at the White House.\n* President Biden officially announces that he will ask his Congress for US$500 million for the Amazon Fund, the Brazilian government's program that finances actions to combat deforestation in the Amazon rainforest with funds from foreign governments.\n|\n|-\n|Friday, April 21\n|\n*\n|\n|-\n|Saturday, April 22\n|\n*\n|\n|-\n|Sunday, April 23\n|\n* President Biden confirms that United States embassy staff and their families were evacuated by US forces from Sudan’s war-torn capital Khartoum due to the conflict between the Sudanese army and the paramilitary Rapid Support Forces (RSF).\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 119\n|-\n!Date\n!Events\n!Photos/Videos\n|-\n|Monday, April 24\n|\n*\n|\n|-\n|Tuesday, April 25\n|\n* President Biden formally announces his reelection campaign for president in the upcoming 2024 election. His announcement is made during a joint news conference with South Korean President Yoon Suk Yeol.\n* South Korean President Yoon Suk-yeol, accompanied by his wife Kim Keon-hee, begins a five-day state visit to the US, the second during the Biden presidency.\n|\n|-\n|Wednesday, April 26\n|\n* President Biden holds a bilateral meeting and joint press conference with South Korean President Yoon Suk-yeol at the White House. This day marks the 70th anniversary of the United States-South Korea alliance.\n* President Biden and First Lady Jill Biden host their second state dinner in honor of South Korean President Yoon Suk-yeol and his wife, Kim Keon-hee.\n* Hunter Biden’s lawyers meet with United States Department of Justice (DOJ) officials to discuss the long-running criminal investigation into the president’s son.\n|\n|-\n|Thursday, April 27\n|\n* Vice President Kamala Harris and Secretary Antony Blinken host a state luncheon for President of South Korea Yoon Suk-yeol at the Department of State.\n|, Antony Blinken, Jodie Haydon, Anthony Albanese, Kamala Harris, and Doug Emhoff at the Department of State]]\n|-\n|Friday, April 28\n|\n*\n|\n|-\n|Saturday, April 29\n|\n* President Biden attends the White House Correspondents' Association Dinner, hosted by Roy Wood Jr.\n|\n|-\n|Sunday, April 30\n|\n*\n|\n|}\nMay 2023\n{| class=\"wikitable\"\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 120\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, May 1\n|\n* President Biden holds a bilateral meeting with Filipino President Bongbong Marcos at the White House. Marcos is the first Filipino leader to visit the White House in 10 years.\n|\n|-\n|Tuesday, May 2\n|\n*\n|\n|-\n|Wednesday, May 3\n|\n* The GOP-led House Oversight Committee issues a subpoena demanding the FBI produce a record related to an alleged \"criminal scheme involving then-Vice President Joe Biden and a foreign national\".\n|\n|-\n|Thursday, May 4\n|\n*\n|\n|-\n|Friday, May 5\n|\n*\n|\n|-\n|Saturday, May 6\n|\n* First Lady Jill Biden attends the Coronation of Charles III and Camilla which President Biden chose not to attend.\n|\n|-\n|Sunday, May 7\n|\n* President Biden renews calls for a ban on assault weapons after the Dallas, Texas shooting which left nine people dead, including the gunman.\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 121\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, May 8\n|\n*\n|\n|-\n|Tuesday, May 9\n|\n*\n|\n|-\n|Wednesday, May 10\n|\n*\n|\n|-\n|Thursday, May 11\n|\n*\n|\n|-\n|Friday, May 12\n|\n* President Biden holds a bilateral meeting with Spanish Prime Minister Pedro Sánchez at the White House.\n|\n|-\n|Saturday, May 13\n|\n*President Biden delivers the commencement address at Howard University and receives an honorary Doctor of Letters from the university.\n|\n|-\n|Sunday, May 14\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 122\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, May 15\n|\n* President Biden attends the graduation commencement of his granddaughter Maisy, daughter of his son Hunter, from the University of Pennsylvania in Philadelphia.\n|\n|-\n|Tuesday, May 16\n|\n*\n|\n|-\n|Wednesday, May 17\n|\n* President Biden cancels a planned visit to Australia for a summit of Quad leaders from the United States, India, Australia, and Japan, citing ongoing negotiations over the US debt ceiling.\n|\n|-\n|Thursday, May 18\n|\n* President Biden arrives in Hiroshima, Japan for the 49th G7 summit.\n* Japanese Prime Minister Fumio Kishida welcomes President Biden at the Hiroshima Prefecture ahead of the G7 summit and holds a bilateral meeting with him.\n|\n|-\n|Friday, May 19\n|\n* President Biden attends the 49th G7 summit in Hiroshima.\n|\n|-\n|Saturday, May 20\n|\n* President Biden attends the QUAD Leaders Summit with Australian Prime Minister Anthony Albanese, Indian Prime Minister Narendra Modi, and Japanese Prime Minister Fumio Kishida on the sideline of the G7 summit.\n|\n|-\n|Sunday, May 21\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 123\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, May 22\n|\n*\n|\n|-\n|Tuesday, May 23\n|\n*\n|\n|-\n|Wednesday, May 24\n|\n*\n|\n|-\n|Thursday, May 25\n|\n*President Biden announces the nomination of Air Force General Charles Q. Brown Jr. as the next Chairman of the Joint Chiefs of Staff in the Rose Garden of the White House. General Brown is the Air Force's first Black commander of the Pacific Air Forces and the first Black chief of staff.\n|\n|-\n|Friday, May 26\n|\n*President Biden celebrates the NCAA champion LSU Tigers and UConn Huskies championship.\n|\n|-\n|Saturday, May 27\n|\n*\n|\n|-\n|Sunday, May 28\n|\n* President Biden attends the graduation commencement of his granddaughter Natalie, daughter of his late son Beau, from St. Andrew's School in Middletown, Delaware.\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 124\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, May 29\n|\n* President Biden performs a wreath-laying ceremony at the Tomb of the Unknown Soldier at the Arlington National Cemetery and delivers the Memorial Day address at the Memorial Amphitheater.\n|\n|-\n|Tuesday, May 30\n|\n*\n|\n|-\n|Wednesday, May 31\n|\n* The House passes the Fiscal Responsibility Act of 2023 by a vote of 314–117.\n|\n|}\nJune 2023\n{| class=\"wikitable\"\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 124\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Thursday, June 1\n|\n* President Biden falls down at the Air Force Academy graduation in Colorado Springs, CO.\n* The Senate passes the Fiscal Responsibility Act of 2023 by a vote of 63–36 to suspend the country's debt limit until January 1, 2025, in a race to avoid the country's first default.\n|\n|-\n|Friday, June 2\n|\n* President Biden addresses the nation on prime-time television in the Oval Office for a first time concerning the ongoing debt ceiling crisis.\n|\n|-\n|Saturday, June 3\n|\n* President Biden signs the Fiscal Responsibility Act of 2023 into law.\n|\n|-\n|Sunday, June 4\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 125\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, June 5\n|\n* President Biden holds a bilateral meeting with Danish Prime Minister Mette Frederiksen at the White House.\n* President Biden celebrates the Super Bowl Kansas City Chiefs championship.\n* House Oversight Chairman James Comer will move ahead this week with efforts to view an internal law enforcement document known as an FD-1023. According to Republicans, the document includes an unverified allegation that Joe Biden, while vice president, was involved in a bribery scheme involving a foreign national.\n* A Federal Appeals Court ruled that the Biden administration still cannot implement certain immigration policies at the southern border.\n|\n|-\n|Tuesday, June 6\n|\n*\n|\n|-\n|Wednesday, June 7\n|\n* Members of the Freedom House Caucus, the most right-wing caucus of the Republican Party, block the United States House of Representatives for the second day in a row, in protest against Kevin McCarthy's leadership.\n|\n|-\n|Thursday, June 8\n|\n* President Biden holds a bilateral meeting and joint press conference with British Prime Minister Rishi Sunak at the White House.\n* President Biden sends additional firefighters and aid to Canada in fighting the wildfires.\n|\n|-\n|Friday, June 9\n|\n*\n|\n|-\n|Saturday, June 10\n|\n*\n|\n|-\n|Sunday, June 11\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 126\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, June 12\n|\n*President Biden underwent a root canal, delaying his meeting with NATO Secretary, Jens Stoltenberg, to Tuesday, June 13\n*President Biden misses attending College Athlete Day on the South Lawn at the White House due to his root canal; Vice President Harris attends in his place instead.\n|\n|-\n|Tuesday, June 13\n|\n* President Biden holds a bilateral meeting with NATO Secretary General Jens Stoltenberg at the White House.\n* President Biden holds a bilateral meeting with Uruguayan President Luis Lacalle Pou at the White House.\n|\n|-\n|Wednesday, June 14\n|\n*\n|\n|-\n|Thursday, June 15\n|\n*\n|\n|-\n|Friday, June 16\n|\n* President Biden delivers remarks at the National Safer Communities Summit at the University of Hartford.\n|\n|-\n|Saturday, June 17\n|\n* President Biden speaks before an audience of union members in Philadelphia in what is his first rally since he declared his bid for a second term.\n|\n|-\n|Sunday, June 18\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 127\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, June 19\n|\n*\n|\n|-\n|Tuesday, June 20\n|\n* Indian Prime Minister Narendra Modi, begins a four-day state visit to the US, the third during the Biden presidency.\n* Hunter Biden, President Biden’s son, agrees to plead guilty to a pair of tax-related misdemeanors and enter into a pretrial diversion agreement that would enable him to avoid prosecution on one felony gun charge, potentially ending the yearslong probe.\n|\n|-\n|Wednesday, June 21\n|\n*\n|\n|-\n|Thursday, June 22\n|\n* President Biden holds a bilateral meeting and joint press conference with Indian Prime Minister Narendra Modi at the White House.\n* President Biden and First Lady Jill Biden host their third state dinner in honor of Indian Prime Minister Narendra Modi.\n|\n|-\n|Friday, June 23\n|\n* Vice President Harris and Secretary Blinken host a state luncheon for Indian Prime Minister Modi at the Department of State.\n* Indian Prime Minister Narendra Modi meets US and Indian business leaders in Washington, on the final day of a state visit.\n|\n|-\n|Saturday, June 24\n|\n* President Biden delivers a speech denouncing GOP abortion restrictions.\n* Vice President Kamala Harris delivers remarks on the anniversary of the United States Supreme Court decision in the Dobbs v. Jackson Women's Health Organization.\n|\n|-\n|Sunday, June 25\n|\n*\n|\n|- style=\"background:white;\"\n| colspan=\"3\" |\nWeek 128\n|-\n! Date\n! Events\n! Photos/Videos\n|-\n|Monday, June 26\n|\n*\n|\n|-\n|Tuesday, June 27\n|\n* President Biden has a private lunch with former President Barack Obama.\n|\n|-\n|Wednesday, June 28\n|\n*\n|\n|-\n|Thursday, June 29\n|\n*\n|\n|-\n|Friday, June 30\n|\n* The United States Supreme Court blocks President Biden’s student loan forgiveness program and limits LGBTQ protections in a separate case.\n|\n|}\nSee also\n*\n* List of executive actions by Joe Biden\n* Lists of presidential trips made by Joe Biden (international trips)\n*\n* Timeline of the 2020 United States presidential election\nNotes\nReferences"
    }
  ]
}