{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Islamic State insurgency in Iraq (2022)\n\nThis is a timeline of events during the Islamic State insurgency in Iraq (2017–present) in 2022.\nChronology\nJanuary\n*January 6 – 11 Islamic State militants were killed in several security operations throughout Iraq.\n*January 16 – 4 civilians were abducted and executed by IS militants in the Qadiriyah area, south of Samarra. Another civilian was also abducted but later managed to escape after the militants believed he was dead after attempting to execute him.\n*January 19 – 3 IS fighters were killed during an Iraqi army security operation in the Taji area near Baghdad.\n*January 20–21 – In their deadliest operation against government forces in recent months, IS militants stormed an Iraqi army barracks in the al-Azim district north of Baqubah in Diyala Governorate, killing 11 Iraqi soldiers as they slept. The attack occurred \"around 2:30 am against a base in the Hawi al-Azim area,\" according to an unidentified senior official. Provincial governor Muthanna al-Tamimi alleged that the jihadists \"exploited the cold and the negligence of the soldiers,\" adding that the base was fortified and equipped with \"a thermal camera, night vision goggles and a concrete watch-tower.\" The governor alleged that the attackers fled into Saladin Governorate.\n*January 22 – 3 IS fighters were killed in an Iraqi airstrike that targeted a gathering of IS vehicles south of the ancient city of Hatra.\n*January 23 – Iraqi security forces reportedly launched a large counter-terrorism operation from three directions against IS in north Diyala, including army and air force units and special operations personnel, with the assistance of local tribes and the PMF.\n*January 27 – An IS Emir by the name of 'Hawi the Great' was killed in an Iraqi airstrike in the Hamrin hills, northeast of Baquba.\nFebruary\n*February 3 – An IS militant was killed and another was wounded in an Iraqi airstrike on their positions in the Salah al-Din Governorate.\n*February 10 – 4 IS militants were killed during a clash with Iraqi army forces near the Al-Azim Dam north of Diyala.\nMarch\n*March 8 – An Iraqi security checkpoint was attacked by IS snipers Abbar subdistrict, northeast of Baquba. One Iraqi service member was injured and later died of his wounds.\n*March 9 – An IS operative was killed whilst trying to attack an Iraqi army convoy in Salah ad-Din province, on the road leading to Haditha.\n*March 10 – 4 IS fighters were killed after the Iraqi airforce launched 2 airstrikes on IS positions in rural Kirkuk province.\n*March 13 – Two Iraqi soldiers were killed after IS fighters attack an Iraqi army checkpoint in the Qaraj subdistrict, southeast of Mosul.\n*March 15 – An IED explosion took place targeting an Iraqi police vehicle in the Rashad subdistrict, west of Kirkuk, killing one Iraqi police officer.\n*March 22 – One Iraqi soldier was killed and another was wounded after IS operatives attack an Iraqi army post early in the morning in Wadi al-Shai, south of Kirkuk.\nApril\n*April 16 – Two PMF fighters were killed after IS militants attacked their positions in al-Eith region of Salah ad-Din province.\n*April 20 – Three PMF fighters were killed in an IS attacked a security post in Qara-Tappa, Diyala, with sniper and small arms fire.\n*April 21 – An IS militant was killed in clashes with Iraqi security personnel near Tuzkhormatu.\nMay\n*May 1 – IS fighters attacked the village of Albu-Taraz, northeast of Baquba, killing one civilian and injuring two others.\n*May 2 – IS militants attack an Iraqi army outpost in the Kenaan subdistrict, southeast of Baquba, killing one Iraqi soldier.\n*May 16 – IS fighters killed two PMF soldiers in clashes in Salahaddin Province.\n*May 23- Six civilians were killed and an Iraqi soldier was injured after IS fighters attacked the village of Islah, north of the Jalawla subdistrict. On the same day, PMF forces were attacked by IS militants in the al-Hadhar district, south of Mosul, killing one PMF fighter. Furthermore, IS attacked farms in Taza district of Kirkuk province, killing six farmers.\n*May 25 – Two PMF fighters were killed in clashes with IS militants in the village of Sheik Najm near the Mansouriyah subdistrict, northeast of Baquba. On the same day, an IS fighter was killed by PMF forces in the Wana subdistrict, north of Mosul.\nJune\n*In June 2022, 4 Iraqi security personnel, 46 IS fighters and 12 civilians were killed.\nJuly\n*In July 2022, 16 Iraqi security personnel, 22 IS fighters and 28 civilians were killed.\nAugust\n*In August 2022, 19 Iraqi security personnel, 36 IS fighters and 37 civilians were killed. A Dutch soldier was also wounded.\nSeptember\n*In September 2022, 7 Iraqi security personnel, 62 IS militants and 19 civilians were killed.\nOctober\n*In October 2022, 8 Iraqi security personnel, 7 IS militants and at least 43 civilians were killed.\nNovember\n*In November 2022, 8 Iraqi security personnel, 27 IS fighters and 13 civilians were killed.\nDecember\n* December 16 – An Iraqi police convoy hit a roadside bomb outside Kirkuk, with a firefight ensuing afterwards with IS fighters. A reported 9 officers and one IS fighter were killed.\nIn December 2022, 24 Iraqi security personnel, 51 IS militants and 37 civilians were killed in Iraq.\nIn 2022, at least 1,681 people were killed due to the conflict in Iraq.\nReferences"
    }
  ]
}