{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of women's suffrage in Arkansas\n\nThis is a '''timeline of women's suffrage in Arkansas'''. Early suffrage efforts date back to 1868 when Miles Ledford Langley tries to add a women's suffrage law in the state constitutional convention. The first women's suffrage organization in the state was created by Lizzie Dorman Fyler in 1881 and lasts until 1885. Another suffrage group is started in 1888 by Clara McDiarmid. Women's suffrage work continues steadily, though slowed down until the 1910s. New suffrage organizations began to form and campaigned for women's suffrage legislation. In 1917, women earned the right to vote in state primary elections. In May 1918 between 40,000 and 50,000 voted for the first time in Arkansas' primaries. On July 28, 1919 Arkansas ratified the Nineteenth Amendment. On December 3, 1919 the League of Women Voters (LWV) of Arkansas was formed.\n19th century\n1860s\n1868\n* Miles Ledford Langley from Arkadelphia, Arkansas proposes a women's suffrage law at the state constitutional convention.\n1869\n* The Arkansas Gazette begins publishing women's rights articles.\n1870s\n1870\n* January 5: Phoebe Couzins speaks in Little Rock, Arkansas.\n1880s\n1881\n* September 10: The Arkansas Woman Suffrage Association (AWSA) is formed with Lizzie Dorman Fyler as president.\n1885\n* AWSA disbands before October 9.\n1888\n* The Arkansas Equal Suffrage Association (AESA) is organized by Clara McDiarmid.\n1889\n* Susan B. Anthony campaigns in Helena, Forth Smith, and Little Rock.\n*Suffrage journal, the ''Woman's Chronicle'' starts publication.\n1890s\n1890\n* The Prohibition Party of Arkansas endorses women's suffrage.\n*The first women's suffrage parade is held in Little Rock.\n1891\n* Bill for white women's suffrage is introduced in the Arkansas Senate by Senator E.P. Hill.\n*The Arkansas General Assembly passes a law that creates a type of literacy test for voters.\n1893\n* The Arkansas Senate passes a bill for women's school board suffrage, but it does not pass in the House.\n* Arkansas institutes a poll tax.\n*The ''Woman's Chronicle'' ceases publication.\n1895\n* Lide Meriwether tours and speaks on women's suffrage in Arkansas.\n1899\n* A bill to allow women to vote in school board elections and \"questions involving moral issues\" is introduced by Senator Turner Butler, but fails by 16 to 8.\n20th century\n1900s\n1903\n* The first state convention of the Socialist Party of Arkansas is held in Little Rock. Their platform includes women's equal rights.\n1906\n* African Americans are excluded from primary elections in Arkansas.\n1910s\n1911\n* January: An unusual women's suffrage bill was proposed in the state House.\n* March: Suffragists testify on women's suffrage at a Committee meeting hearing.\n1913\n* The Women's Political Equality League (PEL) begins meeting in the City Hall in Little Rock.\n1914\n* PEL starts a class for studying contemporary issues and speaking.\n*October: Another State Woman Suffrage Association is formed. It is also known as the Arkansas Woman Suffrage Association (AWSA).\n1915\n* AWSA and PEL provide financial support for the Congressional Union for Woman Suffrage and the federal amendment campaign.\n* PEL works with the Arkansas Federation of Women's Clubs (AFWC) on a women's suffrage resolution.\n* The Washington County Women's Suffrage Association is organized.\n*October: State suffrage convention is held in Little Rock.\n1916\n* Alice Paul comes to Little Rock to organize a branch of the National Woman's Party (NWP).\n* April: Carrie Chapman Catt campaigns in Arkansas.\n*October: State suffrage convention is held in Pine Bluff.\n1917\n* February: Women gain the right to vote in primary elections.\n*Suffragists in the State Suffrage group reorganize as the Equal Suffrage State Central Committee (ESSCC).\n*Freda Hogan Ameringer organizes women in Huntington, Arkansas to pay their poll taxes so they can be ready to vote.\n*Mabel Vernon campaigns in Arkansas for the NWP.\n1918\n* April 2: ESSCC holds its first annual meeting.\n*April 3: Anna Howard Shaw speaks in Arkansas.\n*May: Between 40,000 and 50,000 women vote in the primary election.\n*July: A state constitutional convention is held where full women's suffrage is considered, but not added to the final draft.\n*July 10: Women delegates are present at the State Democratic convention and a woman's suffrage plank is adopted.\n1919\n* July 28: Arkansas ratifies the Nineteenth Amendment.\n*December 3: The ESSCC dissolves and reforms as the League of Women Voters (LWV) of Arkansas.\nSee also\n* List of Arkansas suffragists\n* Women's suffrage in Arkansas\n* Women's suffrage in states of the United States\n* Women's suffrage in the United States\n* Women's poll tax repeal movement\nReferences\nSources\n*\n*"
    }
  ]
}