{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the New People's Army rebellion\n\nThe following is the timeline of events of CPP-NPA-NDF rebellion, a conflict between the government of the Philippines, the Communist Party of the Philippines (CPP), the New People's Army (NPA) and the National Democratic Front (NDF).\n1960s\n* Sino-Soviet tensions cause the split of the old, Soviet-linked Partido Komunista ng Pilipinas (PKP). The continuous fall of the PKP's Huk rebellion and tensions within the party lead the youth radicals, led by Kabataang Makabayan (KM; Nationalistic Youth), to break away from the party. The leftist KM has been founded by Jose Maria Sison, an ideological leader from Manila.\n* 1968 – A guerilla faction of the  PKP, including most of the fighters and being led by Bernabe Buscayno, breaks away as well amid the party's declining significance while abandoning violence as a policy. Buscayno, a Maoist-oriented, is a high school dropout.\n* December 26, 1968 to January 7, 1969 – A Congress of Reestablishment is believed held in Capas, Tarlac.\n* December 26, 1968 – A group of younger Huks, led by Sison (Amado Guerrero) and also including Buscayno, re-establishes the militant Communist Party of the Philippines as a Marxist–Leninist–Maoist party, which later gains support. Sison becomes the chairperson of the CPP which is a former pro-Chinese PKP faction. CPP appeals to the country's business class wanting a smaller role for foreigners; and turns militant nationalism into urban demonstrations against President Ferdinand Marcos.\n* March 29, 1969 – CPP links up with remnants of the PKP's Hukbong Mapagpalaya ng Bayan (HMB) in Central Luzon to launch in Tarlac the Beijing-oriented New People's Army, its military wing. Buscayno (having been called as Commander Dante), who would be its chief, later expands NPA among the peasantry in Luzon. NPA, initially uses \"protracted people's war\" (PPW) strategy and tactics and whose primary task also is to replace the government with a \"national democratic\" system with a socialist perspective, leads what will be the world's longest-running Maoist insurgency.\n* 1969:\n** Sison writes \"The Philippine Crisis\" (later \"Philippine Society and Revolution\") as the \"Bible\" of the CPP-led national democratic revolution.\n** The Philippine Constabulary (PC) reports 21 clashes in ten key Luzon provinces. On the other hand, as later claimed by the NPA, they have \"annihilated\" 200 \"people's enemies\" including 17 United States military personnel.\n1970s\nIn the early 1970s, the CPP begins spreading of area of activities beyond its traditional base of operations in the Central Luzon, establishing sanctuaries in Isabela, Zambales, Camarines Sur, and parts of Mindanao.\n* Corpus had abandoned the CPP-NPA and was reinstated in the AFP after EDSA in 1986.\n--->\n1970\n* As Marcos administration later reveals, CPP either have organized or have been involved in at least 258 major demonstrations, some 33 ended violently.\n* With the death of the Huk's former member Pedro Taruc and the capture of its military commander Faustino del Mundo (Commander Sumulong), Buscayno's leadership becomes undisputed.\n* January–March – During the First Quarter Storm, CPP-led student demonstrations against President Marcos occur in the Greater Manila Area.\n* December 29 – 1Lt. Victor Corpus, a Philippine Constabulary official and an instructor at the Philippine Military Academy (PMA), defects to the NPA after leading ten guerrillas that raided the PMA armory, taking away several weapons which they brought to their camp in Isabela. With code name Viet Cong, he would be the NPA deputy military commander, reportedly by mid-1971, and a CPP Central Committee member.\n1971\n* As Marcos administration later reveals, the number of CPP-linked demonstrations exceeds that of the previous year, 24 of these ended violently.\n* The PC have reported 46 clashes in ten key provinces in Luzon since 1969. On the other hand, as later claimed by the NPA, they have killed or injured 600 \"enemy troops\" and have punished 230 \"bad elements\" within that year.\n-->\n* March:\n** CPP seizes control of a number of labor unions, succeeding in splitting them.\n** Carlos del Rosario, a CPP Central Committee member involved in its engagement with the labor unions, disappears.\n* March 29 – Army Lt. Crispin Tagamolila, a reserved officer, becomes the second defector to the NPA; declaring that corruption and theft among high military ranks are his primary motive. A guerilla based in Isabela, he becomes known by the nom de guerre \"Kumander Cely\". He is the brother of Antonio, president of the College Editors Guild of the Philippines in the 1960s.\n* May 1:\n** Security forces open fire on 4,000 workers and students protesting in front of the Congress building. The forces are led by the various Stalinist CPP-linked organizations — KM, the Samahang Demokratiko ng Kabataan (SDK; Democratic Federation of Youth), and KASAMA, a newly-founded labor group. Tear gas is dropped on the crowd as some are beaten. Three demonstrators are killed and 18 are wounded, many severely. KM, SDK, and Movement for Democratic Philippines (MDP) stage rallies twice to condemn the incident and to denounce President Marcos—in May 22 at Plaza Miranda, participated by Liberal Party (LP) senatorial candidate John Osmeña; and in June 12 in Cebu City, to support the latter.\n** The Movement for the Advancement of Nationalism (MAN), a PKP front organization, publishes a statement, Dissent and the Proletariat, showing support to the Marcos administration.\n* August 21 – A grenade explosion in a pre-election rally of the oppositionist LP at Plaza Miranda in Quiapo, Manila, kills nine individuals including a press photographer and two children; and injures a hundred others including all eight LP Senate candidates and Genaro Magsaysay; Osmeña, Ramon Mitra Jr., and Eddie Ilarde;--> as well as incumbent senators, LP president Gerardo Roxas and Sergio Osmeña, Jr. President Marcos accuses the CPP–NPA for the attack—which is then widely attributed to him—that triggers a series of events that led to the 1972 declaration of martial law. Corpus' 1986 statement and the interviews in late 1980s with eight of the former CPP senior officials reveal the CPP's responsibility for the bombing. Being ordered by Sison, party organizer Danny Cordero leads the attack. Cordero would be executed by his comrades in 1972 in the Isabela forest; the accomplices, Cecilio Apostol and Danilo Valero, would die in military encounters in 1971 and in 1977, respectively.\n* August 22 – Following the bombing incident, President Marcos declares state of emergency and immediately suspends some constitutional rights including writ of habeas corpus. Ninety-eight to more than a hundred suspected subversives are detained following mass arrests.\n* August 26 – Heavily-armed communist guerrillas, believed to be led by Corpus, raid a regional army camp somewhere in northern Luzon, where Task Force Lawin is stationing, and destroy two Philippine Air Force helicopters. A soldier and two guerrillas are injured in a clash. It is the first direct assault on the military installation since the Huk rebellion.\n* By September, the number of hardcore NPA members are estimated by the military intelligence between 300 to 400. NPA has been expanding their activities beyond Central Luzon.\n1972\n* NPA establishes two Armed City Partisans (ACPs); but are aborted after the declaration of martial law. ACP, which would be relaunched in 1975, will be the forerunner of the Alex Boncayao Brigade.\n* January–April – The PC reports a total of 30 clashes nationwide; 21 rebels and 30 from the government side are killed, bringing the total since 1969 to 42 and 132, respectively.\n* Mid-April – Gen. Romeo Espino, Chief of Staff of the Armed Forces of the Philippines, publicizes news on the apparent leadership of former army lieutenant Corpus. The guerilla forces have been operating in the mountains of Isabela. Espino also says that the NPA, which has been rapidly acquiring weapons, succeeds in an expansion drive in northern Luzon and in Camarines Sur, and expands their activities to Mindanao.\n* Early or mid-April – Seven guerrillas, including former Lt. Tagamolila, are killed in an encounter with the PC in northern Isabela.\n* May – The NPA, in a report released through the CPP, claims having 400,000 followers and having set up revolutionary committees in 800 villages in 18 of the 67 provinces. Meanwhile, the government states that its mass base is only 60,000, with 570 cadres, some 1,250 part-time guerrillas, and 4,500 support troops. On the other hand, NPA claims destroying several government equipment.\n* July 3 – Danny Cordero is fatally shot by Elizabeth Principe, one of the nine members of a tribunal which has voted the previous day to execute him, in a camp in Isabela. There have been a disagreement between Cordero and Ruben Guevarra, also a tribunal member, following their involvement in the Plaza Miranda bombing.\n|| July: NPA arms shipment from China on MV Karagatan lands at Digoyo Point, Palanan, Isabela, but are intercepted by the Armed Forces of the Philippines (AFP) before most of the arms could be brought ashore.}.--->\n* 4 July - The MV Karagatan, which was supposed to bring armaments supplied by China to the NPA reaches Digoyo Point in Palanan, Isabela. However the ship is discovered by a military patrol and is abandoned as it runs aground.\n* 18 July - A government raid on an NPA hideout in Cordon, Isabela leads to the discovery of the so-called Taringsing Documents, outlining plans by the CPP-NPA to overthrow the government by 1973.\n* July 22 – The country's news agency reports that some 400 NPA members, led by army defector Corpus, have been meeting in the three villages in San Mariano, Isabela, and grouping in preparation for attack on military installations. The band comes from a mountainous camp in Palanan where they have been driven away by government troops; and are believed to be the same group that has encountered the police earlier that month, where four troops and two dissidents are killed.\nThe government later immediately launches full-scale attack on NPA in Isabela.-->\n* September 11 – A gun battle between the police and armed NPA band, believed being involved in a series of terrorist attacks in the metropolitan area, near a Mobil Oil petroleum dump in Pandacan, Manila, results in the deaths of a leader of the suspected commando band, as well as a police sergeant. Another guerrilla escapes; six others are arrested aboard a jeep en route to the area.\n* September 21 – President Marcos signs Proclamation No. 1081, placing the entire country under martial law, citing need to suppress \"state of rebellion\" instigated by NPA. The decree puts the figures of the increased NPA strength at about 7,900 combatants (1,028 regulars; 1,800 combat support; 5,025 service support) by July 31. Within two months, some 6,100 people are arrested; while such declaration destroys the suspected communist-infiltrated student organizations including KM and SDK. However, many suspect government of using NPA as excuse for tightening authoritarian grip. Meanwhile, this results to bolstering of CPP and NPA ranks as many student activists flee cities.\n* September 22:\n** Defense Secretary Juan Ponce Enrile survives an ambush as gunmen shot his convoy while on his way home in Makati (then in Rizal). The government accuses NPA in relation to the assassination attempt, which is called by President Marcos \"the last straw\" to justify martial law. Enrile later admits in February 1986 that the incident has been staged.\n** General Order No. 2 orders the arrest of Buscayno and Sison, who have been included in the so-called \"National Target List\" of active participants in plot against the government. A Department of National Defense (DND) order has set rewards for their neutralization.\n* September 23 – President Marcos formally announces through evening broadcasts the martial law decree. In his speech to the nation, he reiterates that the imposition of martial law is due to existence of \"state of rebellion\", particularly by the NPA.\n* October 1 – The first armed encounter between the government and the NPA since the martial law declaration occurs in Zambales, in which 20 guerrillas are involved; at least one of them is killed and eight are captured.\n* November 16 – Fifty-six individuals, including Sison's wife Juliet, and Corpus, are charged with subversion before a military commission. They are alleged, sometime before or after 1968, of becoming officers and ranking leaders of the CPP, its military arm NPA, and at least six CPP's front organizations, whose objective is the overthrow of the government.\n* By late 1972, President Marcos reports that among the 37 municipalities of Isabela, 33 has been controlled by the NPA, while 25 has 207 barrio organizing committees. NPA has established the base of operations in remote areas in Isabela, the secondary in Bicol Peninsula.\n*late September to December - The military launches its first major operation against the NPA's primary stronghold in the Sierra Madre mountains in San Mariano, Isabela, forcing the CPP leadership to disperse nationwide but fails in its objective to eliminate the rebellion in Isabela.\n1973\n* April 24 – National Democratic Front of the Philippines (NDFP), an umbrella formation of the CPP–NPA and mass organizations under CPP leadership, is formed by the Preparatory Commission.\n* August 14 – Buscayno and Ninoy Aquino are charged before a military commission with subversion, under the Anti-Subversion Law (Republic Act No. 1700). Aquino has been arrested on September 23, 1972.\n1974\n* December 1 – ''\"Specific Characteristics of Our People's War\"'', based on Mao Zedong's strategy of protracted people's war, is issued by Sison.\n* December – Thirty individuals are arrested in Baguio and in Manila on various charges, which, according to the military, \"[results] in the dismantling of the national liaison committee of the [CPP] central committee.\" Two of them, Roman Catholic priests Revs. Edicio de la Torre and Manuel Lahoz, would begin hunger strikes in Camp Olivas on January 2, 1975, in response to refusal of entry of a delegation in a detention camp on December 31 to investigate torture allegations.\n1975\n* By early 1975, credible sources estimate that there are 1,000 NPA adherents, 2,000 CPP/ML cadre personnel, and 2,000–3,000 members of the front organizations. There is NPA militant activity mainly in east-central Luzon, while scattered activities are reported in other parts of the country.\n* October – January 1976 – CPP-led workers' strike movements suddenly rise since the La Tondeña strike.\n1976\n* Early 1976 – Over a dozen key CPP Central Committee members and advisers of CPP chairperson Sison are captured.\n* January – The Defense Department announces the capture of Roger Posadas, head of the CPP's explosives arm and suspect in series of explosions in Manila before the proclamation of martial law.\n* January 24 – The Defense Department announces the arrest of Jose Luneta, CPP's 3rd ranking official, and Saturnino Ocampo, former business writer of The Manila Times and CPP's top propagandist, bringing the number of captured communists in the past three days to 15. Meanwhile, 48 CPP leaders and members have been arrested in series of raids in Cagayan Valley, Central Luzon, and metropolitan Manila.\n* Within the entire January, a total of 48 CPP members are arrested. All suspected subversives include 17 ranking leaders. They also include Guillermo de Leon, an electronics expert, and Juanito Canlas and Cesario Diego, said to be CPP central committee members. By then, the party's strength has been decreased considerably to about 20,000, from some 120,000 prior to martial law.\n* February 12 – Eight people accused of being part of the CPP, whose group is operating in Mindanao, are arrested in Cagayan de Oro; including four leaders, particularly 1971 Queen of the Pacific Nelia Sancho, chairperson of the CPP Finance Alliance Group in the island. The government reported the following day that since the CPP's fourth plenum two months prior, 56 reported communists have been arrested.\n* July 1 – \"Our Urgent Tasks\", stressing mass and organizational works as requirements for armed revolution, is issued by Sison.\n* August 26 – NPA founder Buscayno, with his wife and their baby daughter, is captured by operatives of the armed forces in a surprise raid in a house in Mexico, Pampanga. Nine of his followers are likewise arrested in a follow-up operation.\n* August – Corpus, a former Army lieutenant who had been a CPP vice-chairperson and an NPA training chief, is captured.\n* Late August – Defense Minister Enrile states that there are foreign groups sending money \"from the West\", and the military has proved links between the church and the communists.\n* 13 November – NPA rebels attacked a logging truck in Mambusao, Davao Oriental. Six security troops were killed and three were wounded.\n* 22 November – NPA rebels staged a raid on 5 barrios situated on the perimeter of Clark Air Base, seizing 43 weapons from the local CHDF militia.\n1977\n* 27–29 August – Communist guerrillas conducted two ambushes on units of the PC in Pampanga and Subic, Zambales. Six PC members were killed and four wounded.\n* October – The government reveals for the first time that the NPA has joined with Muslim rebels seeking independence in Mindanao.\n* November 8 – A hundred and one individuals, including the Sison couple, Buscayno and Corpus, are charged with rebellion before a military commission.\n* November 10 – CPP chief Sison and his wife are captured upon orders by the Secretary of National Defense, along with three others and seized documents listing the CPP \"supporters\" among others, in a raid in a house in San Fernando, La Union. Although the arrest of Sison, a fugitive for seven years, would be reported by sources, the first government confirmation will be made nine days later. His arrest results to the neutralization of almost the entire CPP central committee. At that time, with the succeeding government offensive, the communists have moving the insurgency underground in its base areas in Luzon. Sison is later succeeded by Rodolfo Salas (Commander Bilog).\n* December 26 – Horacio Morales Jr., executive vice-president of the Development Academy of the Philippines, announces having joined the NDFP in protest \"against a ruling system that has brought […] suffering and misery to […] the people.\"\n1979\n* October 10 – The Defense Ministry announces the arrest of 18 people, some of them CPP members, on subversion charges, in the biggest crackdown on campuses since the declaration of martial law. A search on 54 others, ordered arrested by President Marcos to prevent demonstrations in schools during a term vacation, has been launched.\n1980s\n1981\n* NPA says it has guerrilla fronts in 50 of 73 provinces, with increasing support from peasants; despite a statement by Maj. Gen. Delfin Castro, head of military's southern command, on successful crackdown against the communists.\n* January 17 – President Marcos issues Proclamation No. 2045, officially lifting the nationwide martial law.\n* 19 April – Seventeen people were killed in a grenade attack on San Pedro cathedral, Davao City, during mass. Two grenades were thrown into the congregation as the traditional Easter service was concluding. New People's Army rebels were among several groups suspected of blame, and two young Marxists were apprehended for the attack.\n* October or November – Foreign press reports increasing NPA operations against government, which occurred quietly particularly in Mindanao, as well as Samar, amidst the seemingly succeeding military campaign against Muslim secessionists.\n1982\n* President Marcos regroups scattered villages from outlying areas in Mindanao, relocating into militarily supervised settlements to interrupt local support for rebels. Such strategy is later canceled as NPA has increasing support from villagers due to Army abuses against peasants.\n* Between 1982 and 1989, CPP conducts purges; starting with the anti-infiltration campaign, Cadena de Amor, in the Quezon–Bicol Zone (QBZ) that year.\n1983\n* April – President Marcos says that 436 communists and 19 NPA leaders are killed in a three-month anti-guerrilla campaign in Mindanao; as well as about increasing activities by the NPA which, by then, has changing tactics, from small groups of 3–9 guerrilla using hit-and-run tactics, later operating in groups of 200. Such fighting obtains supply of weapons being seized from soldiers.\n-->\n* September 29 – About 70–80 NPA rebels ambush an army patrol unit in Godod, Zamboanga del Norte. The truck is carrying at least 57 people; thirty-nine soldiers, including a unit commander from the 4th Infantry Division, and seven civilians are killed in the deadliest attack on the government forces since NPA began major operations a decade prior.\n1984\n* By that year, Western sources estimate NPA operates in 60 of 73 provinces.\n* Alex Boncayao Brigade (ABB) begins an urban warfare campaign against the Marcos administration with the assassination of police general Tomas Karingal in Quezon City. ABB, named after Alex Boncayao who has been killed in an encounter, has been formed in mid-1980s as a breakaway movement of the NPA.\n* May 14 – Parliamentary elections are held despite calls by the CPP for boycott. Ninety-one individuals are killed in military-communist clashes.\n* June – The Army launches largest offensive ever against the NPA in northern and central Luzon.\n1985\n* By that year, an anti-DPA (deep-penetration agent) campaign, \"Takip Silim\" (Dusk), takes place in southern Quezon. About half of some 60 people arrested were killed, mostly civilians and peasants. The CPP regional committee later orders it stopped.\n* In Davao City, the expansion of the NPA is reported, and by year-end, a local radio station placed the number of both summary executions and guerrilla killings at \"more than 600\".\n* April – A project team from an Australian mining consortium, consisting of three Australians and 13 Filipinos, is briefly detained by NPA rebels in Northern Samar.\n* May\n** Bagong Alyansang Makabayan (BAYAN; New Patriotic Alliance) is established through the CPP's initiative as a \"broad legal alliance\".\n** The CPP Mindanao Commission (Mindacom) starts a major anti-infiltration campaign, \"Kampanyang Ahos\", in Cagayan de Oro. It is conducted in Northern and Southern Mindanao; as well as far as Metro Manila and Cebu. Despite supposedly stopped in December, Ahos continues up to March 1986 in Misamis Oriental and Bukidnon. Between 400 and 1,100 cadres and civilian supporters are reported killed; many are buried in mass graves. In 1987, the CPP Politburo declares that while DPAs are killed in the campaign, there are abuses however as many have been falsely accused.\n* July 22 – NPA attacks a police station in Quinapondan, Eastern Samar, and takes away several firearms. Neither the police chief nor the five officers resist the raid.\n* 6 October – At least 14 rebels were killed in an encounter with a military patrol in Polanco, Zamboanga del Norte.\n* November 19 – Dave Barrios, an assemblyman's assistant, is abducted by three NPA members in the office of the United Church of Christ in the Philippines (UCCP) in Quezon City, being suspected as a military spy. He is believed to be killed during the purge.\n1986\n* According to the CPP, by that year, the number of NPA companies to be maintained is reduced from 15 in 1985 to only two; several guerilla fronts and mass bases are lost in Mindanao.\n* March – Nine American servicemen are held hostage overnight by NPA guerillas in Kalinga-Apayao after they accidentally enter an NPA territory. They are later released.\n* March 1–2 – In separate ambushes in Northern Samar on March 1, and in Leyte on March 2, three policemen are killed. Meanwhile, in Cebu City, a rebel leader is killed in a shootout.\n* March 3 – A police vehicle is ambushed by about 60 men, believed to belong to the NPA, near Guinobatan, Albay, killing 14 policemen and a paramilitary sergeant and wounding 13 other policemen and eight passengers of a bus caught in crossfire.\n* March 5 – The government under newly installed President Corazon Aquino releases four CPP members, including CPP founder Jose Maria Sison, NPA chief Bernabe Buscayno, and two members of a liquidation squad, as part of its policy of reconciliation with the Communist rebels, despite objections from the military. The four are the last of all political prisoners, held by the administration of her predecessor, Ferdinand Marcos, ordered freed; their number varies, ranging from 484 according to the president, to 517 according to presidential spokesperson Rene Saguisag.\n* March 14:\n** About 100 NPA rebels raid a warehouse of the National Food Authority in Allacapan, Cagayan, with a five-hour gun battle reportedly leaving seven soldiers and a civilian dead and five injured.\n** Ten militiamen are killed by communist guerillas in an attack in Bohol.\n* March 15 – Thirty NPA guerillas ambush a government jeep, carrying militiamen and government employees who had met with residents, along a mountain road in Amlan, Negros Oriental, killing 12 including eight employees of the Philippine National Oil Company (PNOC), and seriously wounding four.\n* March 19:\n** Three hundred rebels attack a military detachment in Sindangan, Zamboanga del Norte, killing eight and wounding three. They then sack the municipal hall.\n** Twenty guerillas ambush a jeep in Gonzaga, Cagayan, killing municipal mayor Francisco Baclig and three others on board.\n* Mid-March – NPA rebels ambush a battalion of troops outside Claveria, Misamis Oriental, seriously wounding five. They then raid the town, resulting in massive evacuations.\n* March 24 – Fifty heavily armed NPA rebels attack a village in Medina, Misamis Oriental, killing two militiamen and three individuals abducted after suspected of being government informers.\n* April 13 – More than a hundred guerrillas kidnap all ten patients in a government-owned hospital in Lasam, Cagayan, and set fire to the building.\n* April 17 – Conrado Balweg, a former Catholic priest and NPA commander, leads the indigenous faction in the Cordillera area that has broken away from the NPA, to establish the Cordillera People's Liberation Army (CPLA). It focuses on their recognition of mountain tribes even after victory, aiming for regional autonomy and self-determination.\n* April 20 – Farmers opened fire on the soldiers conducting \"clearing operations\" against the rebels in Cagayan, killing three. The ambush occurs amid strengthening rebel control, particularly in Lasam, Alacapan, and Lal-lo.\n* April 24 – About 30 NPA rebels ambush a military convoy which are carrying about 11 soldiers and three journalists and returning to Tuguegarao, Cagayan, killing at least seven including Manila Bulletin correspondent Pete Mabasa and Reuters photographer Willie Vicoy, which are said the first to be killed while covering the communist insurgency.\n* May 7 – The communists ambush and shoot to death all 14 soldiers of a patrol in Allacapan, Cagayan.\n* June 3 – An estimated 40 NPA guerrillas ambush eight policemen aboard a jeep in Gonzaga, Cagayan.\n* July 1:\n** A military convoy is ambushed by about 70 guerrillas near Gumaca, Quezon, killing 11 soldiers.\n** Government forces are ambushed by guerillas in Pamplona, Cagayan, with nine people died, including a soldier and a policeman.\n* August 22 – Eleven members of an obscure religious sect are killed by gunmen in Surigao del Norte, after being reportedly forced to shout \"Long love the NPA.\"\n* August 24 – A patrol is ambushed by NPA guerrillas in Sarrat, Ilocos Norte. A police chief and four of his men are killed; three more are injured.\n* August 31 – Sison leaves the country to start a lecture tour in universities abroad—in the Asia–Pacific region (from the following day until January 22, 1987) and in Europe (January 23, 1987 – 1988).\n* 13 September - The CPLA made a \"sipat\" or ceasefire with the Philippine government at the Mt. Data Hotel, in Bauko, Mountain Province. The agreement between the two sides was called the 1986 Mount Data Peace Accord.\n* 30 September – Authorities arrest NPA chairman Rodolfo Salas along with his wife and driver outside a Manila hospital amid peace talks between the rebels and the government.\n* November:\n** Victor Corpus issues a statement of CPP's responsibility for the Plaza Miranda bombing. Corpus, a former lieutenant who defected to the rebels in 1970, rejoins the Philippine Army at the rank of lieutenant colonel two days later. The account would later be corroborated by the admissions of eight of its former senior officials who disclosed their activities in separate interviews. Both claim that the bombing was masterminded by Sison.\n** A Japanese businessman is kidnapped for ransom by the NPA, with Japanese Red Army as conspirators.\n* 10 December – A 60-day cease fire is enacted between the NPA and the Philippine government.\n1987\n* Sison eventually flees to self-exile in Utrecht, Netherlands, and begins living there with residence permit, as research consultant at the Utrecht University until 1988. Meanwhile, the Philippine military later charges Sison with rebellion following reports that he reassumes CPP chairmanship.\n* By year-end, the NPA have 23,000 members; and is estimated by other source having up to 24,000. The year becomes one of the deadliest in the insurgency with more than 3,600 casualties.\n* Late 1987 or early 1988 – The Melito Glor Command, the NPA unit in the Southern Tagalog, starts another major anti-infiltration campaign \"Operation Missing Link\" (OPML) to arrest suspected spies. However, it is reported that even some members of its task force are implicated, resulting to the execution of four of the six arrested members; same as several committee members.\n* 22 January – 13 demonstrating farmers are killed by security forces in Mendiola Street, Manila. This leads to the breakdown of peace talks between the government and the CPP-NPA-NDF and the resumption of military offensives against the rebels.\n* March – Rebel forces attack a military detachment in Sagay, Negros Occidental. Two of the rebels are killed. They then leave aboard a truck loaded with arms cache, which would be involved in an accident after being chased by a military helicopter.\n* March 17 – A military convoy is ambushed by about 200 NPA guerillas in Catanauan, Quezon, while returning to its camp; killing 19 soldiers, mostly when their vehicles are hit by landmines, and injuring seven.\n* March 19 – About 100 NPA rebels ambush a patrol of 70 soldiers, belonging to one of two army battalions deployed around Bonifacio, Misamis Occidental, causing an hour-long gun battle that kills 18 and wounds two from the latter. There are reports that guerrillas likewise suffer \"much heavier\" casualties of an undetermined number.\n* April 14 – About a hundred NPA insurgents ambush an army truck in La Castellana, Negros Occidental. Four soldiers are killed after a half-hour gun battle.\n* April 19 – Soldiers discover an NPA training camp in a forest within Angat watershed in Bulacan, where illegal logging operations are reportedly done by rebels. This results in a battle between some 300 rebels and combined forces of Army Scout Rangers and provincial Constabulary command. Two days later, at least 20 guerrillas are killed in San Ildefonso, while clashes reach the adjacent town of Doña Remedios Trinidad.\n* April 20:\n** About 100 NPA rebels aboard three vehicles overrun an army detachment in Sagay, Negros Occidental. The rebels allegedly fire at outnumbered soldiers despite their surrender, even hitting some of visiting family members. Four civilians, 6 soldiers, and 5 rebels are killed.\n** An army sergeant is killed when a 6-vehicle military convoy is ambushed by 20 NPA rebels in Hinabangan, Samar, while on their way to a briefing at a Catbalogan headquarters.\n* Early July – Fighting in the vicinity of the breeding camp of the Philippine eagle on Mount Talomo in Davao City within weeks kills 40 NPA insurgents and 15 soldiers, and later forces the entire staff of the Philippine Eagle Conservation Program to evacuate along with twelve captive eagles.\n* July 27 – NPA guerrillas in Luna, Kalinga-Apayao, explode a land mine in the path of an army convoy, which has been sent to reinforce an army detachment under attack. They then open fire on the soldiers, killing 18 of them and injuring six.\n* August – A weeklong guerrilla offensive occurs with an assault on Manapla, Negros Occidental, by 60 NPA members, the first major urban attack by the northern Negros front. That however fails as both rebel assault force, which has seized weapons from a police outpost, and two highway forces are both later retreated while burning down the municipal hall and the mayor's house. The incident triggers months-long pre-dawn curfew throughout the province, then the only such restriction in the country.\n* August 27 – NPA rebels raid radio station DXRA in Davao City, with four of the personnel fatally shot inside, along with five civilian guests, in the city's worst attack against the journalists. Another radio announcer is injured in a following stampede.\n* Late August – September 1 – Scattered fighting in three provinces leaves 39 NPA insurgents, 9 soldiers, and two civilians dead. The casualties include 28 guerrillas in military offensives in Pangasinan on September 1; as well as two scout rangers when troops attack a rebel camp in Davao City.\n* September 2 – Some 200 NPA guerrillas attack a 28-man army patrol in Quezon, killing 21 and wounding five.\n* Late September – Early October – The Armed Forces of the Philippines (AFP) claims that day-long \"clashes\" between the military and the NPA in Doña Remedios Trinidad, Bulacan, have killed at least four rebels. However, after Manila-based daily newspapers have picked up accounts on a major offensive, residents and the NPA commander for Bulacan later both deny these claims. The former believe that combat troops have been deployed following the shooting incident on September 26, when a soldier has been killed in what is said a mistaken encounter, which is being denied by the AFP while insisting that reporters who have visited the area have missed the fighting.\n* October 28 – The NPA kills three Americans, including a serviceman and a retiree, near Clark Air Base. It is believed that it is the beginning of attacks against American servicemen; as the NPA has decided to target those who based at two United States military bases in the country.\n* November 15 – Juanito Rivera, CPP vice chairman and alleged member of the Executive Committee, is arrested.\n* November 17 – Napoleon Dojillo, resigned NDF leader in Negros, surrenders to the provincial military commander.\n* December – A two-day Christmas cease-fire is declared by President Aquino and by the NPA, however eight from the security forces die in rebel attacks. Another holiday truce is declared by the president from December 31 to January 1.\n* December 31:\n** A military truck is ambushed by about 40 heavily armed rebels while approaching San Mariano, Isabela, to pick up a sick soldier; the rebels flee following a brief battle with reinforcements. Six soldiers and five civilians—all hitchhikers—are killed; four soldiers and another civilian are reportedly injured.\n** A military intelligence agent is fatally shot in Catarman, Northern Samar, causing a battle between law enforcers and three rebels; two of the suspects are killed along with a civilian caught in crossfire.\n1988\n* NPA has 25,000 members by March.--->\n* Sison applies for political asylum in the Netherlands, which would be rejected by the government at least thrice—in 1990, in 1993, and in 1997. He will later appeal to the European Court of Human Rights. Meanwhile, his family lives in the government-funded apartment since then.\n* \"Olympia\" is launched in Metro Manila and Rizal to arrest suspected infiltrators. Similar operations were conducted in the northern Luzon and Eastern Visayas.\n* February 4:\n** The military announces the arrest of 20 suspected high-ranking CPP officers and seizure of data containing a list of their financial contributors, in a series of raids in Metro Manila. Those captured include two Central Committee members, Tomas Dominado Jr. and Nicholas Ruiz, a Roman Catholic priest and member of the executive committee on Leyte Island; two regional finance officers from the Visayas, and another priest.\n** Jaime Cardinal Sin, in a meeting with foreign reporters and speaking on the allegations on church workers being leftist sympathizers, discloses that some of them remain \"members of the hard core\" insurgency; and that the church's main social welfare organization, National Association of Social Action of the Philippines, has been dissolved on January 28 following reports that its fund has been channeled to the communists.\n* February 13 and 16 – Suspected communists flag down and set on fire two Pepsi-Cola trucks from the bottling plant in San Fernando, Pampanga, separately in Bacolor and Porac.\n* March 9 – A village in Sanchez-Mira, Cagayan, is raided by 200 NPA rebels who burned an Iglesia ni Cristo chapel; two civilians are killed in a crossfire. Pursuit operations by the military in the town and in nearby Aparri end on March 14 with 16 rebels killed. Two hostages are executed.\n* March 10–11 – An offensive by some 2,500 army troops against 500 NPA militiamen kills 32 insurgents in Concepcion, Misamis Occidental.\n* March 12 – Three NPA guerillas are hacked to death by troops in Bukidnon.\n* March 12–13 – Twelve NPA guerillas are killed in an air attack on a rebel training camp in Cotabato.\n* Early or mid-March – Nemesio Dimafiles, CPP chief in Negros, is arrested. Dimafiles has been reportedly resigned eight months prior due to a dispute over the party's policies.\n* March 17 – Police captures Elizardo Lapuz, head of the NPA provincial operational command in Pampanga, in a raid at his hideout in a village near Clark Air Base in Angeles City.\n* March 18 – A CPP faction on Negros island, dissidents calling itself the \"Resignees,\" circulates a clandestine document calling for new peace talks and \"critical support\" for the Aquino administration, in the aftermath of the arrest of Dimafiles who has been listed as a member. The report says up to 60% of the rebels may be prepared for resignation.\n* March 28 – Gunmen reportedly from the ABB, NPA's Metro Manila branch, ambush suburb mayor Prospero Oreta, a distant relative of President Aquino. He is injured while seven of his bodyguards are killed.\n* March 29:\n** Seven communists are captured in separate raids in Metro Manila. Charges of rebellion and sedition would be filed against them.\n*** Among those seized in San Juan are four CPP Central Committee members (three others have been captured since 1986); three of them top leaders—Romulo Kintanar, head of the NPA General Command, and his wife Gloria Jopson, also a finance committee member; Rafael Baylosis, CPP Secretary-General; Benjamin de Vera, head of CPP Mindanao commission; and Marco Palo, a member of the national liaison commission.\n*** In Quezon City, Napoleon Manuel, chief of staff and logistics officer of the NPA, and Esther Yson are arrested; while CPP chairperson Benito Tiamzon escapes.\n** As of that day, communist assassination squads, \"Sparrow units\", have killed more than 150 law enforcement personnel since the previous year.\n* June 1 – NPA's Melito Glor command, led by Gregorio Rosal and Leopoldo Mabilangan, raids a Magnolia Chicken hatchery of the San Miguel Corporation in Tiaong, Quezon, and kidnap a security guard, which will be released later that day. At the same time, it seizes four Army lieutenants and a Constabulary sergeant, aboard a car on their way to Manila, at a roadblock. The five will be held hostage until being freed in Mount Banahaw on August 14 following series of negotiations.\n* June 5 – Communist rebels ambush government troops, who are pursuing the former that had stole vehicles from sugar plantations in Tayap village the previous day, on Negros. A four-hour gun battle leaves 14 soldiers dead and two others wounded; a militiaman is believed to be abducted by the rebels.\n* June 20 – At least 42 guerrillas are arrested in evening raids in Dagupan and Urdaneta in Pangasinan, and in Baguio, including Francisco Pascual, a member of the ruling central committee of the CPP and one of the rebel negotiators in peace talks, who is captured in Dagupan.\n* June 21 – A rebel leader, identified by the CPP newsletter Ang Bayan (The Nation) in its interview as Comrade Rio, a member of the executive committee in the Central Luzon, warns that Americans involved in the government's anti-insurgency drive would be killed anytime. Rio justifies the 1987 killing of three American servicemen outside Clark by a rebel hit squad. Since then, none of the threats issued by the rebels has been carried out.\n* July 3:\n** An urban hit squad known as \"Sparrows\" releases a statement to news agencies, stating that the rebels vow reprisals against alleged military-sponsored death squads whom they accuse being the suspects in increasing violence against prominent leftists, including the wounding of university president Nemesio Prudente and the death of lawyer Emmanuel Mendoza in the previous week. The ambush on the former has been his second in eight months; while the latter is the fifth human rights official to be killed in the past 12 months.\n** Fernando Suangco is arrested in the University of Santo Tomas Hospital in Manila. Suangco (Ka Yenen), a high-ranking NPA officer in Angeles City, is the suspect in a prior assassination attempt in a birthday party where city mayor Antonio Abad Santos survived. On July 9, murder charges are filed against him, being implicated to the killings of two Americans and three Filipino police officers.\n* July 5:\n** Four suspected communist rebels fatally shot two policemen aboard a patrol car at a downtown intersection in Manila. A civilian bystander is injured, as well as another policeman conducting traffic, who is shot by the suspects escaping through a commandeered passenger jeep. The incident is described as a \"Sparrow\" operation.\n** Police raids twelve houses in Quezon City being \"used as a transit point\" by guerrillas, arresting 24 suspected rebels.\n** The military reports the deaths of nine people in three incidents in Albay within 48 hours.\n* August 30 – Seventy complaints of human rights violations are filed by the military against the CPP–NPA–NDF before the Commission on Human Rights. Among the cases filed are murder, kidnapping, serious illegal detention, robbery and frustrated murder, which have been occurred in parts of Luzon and Northern Mindanao. These are in addition to 117 cases that have been filed in various courts nationwide.\n* October 10 – The Philippine Constabulary (PC) exhumes two bodies in Santa Cruz, Laguna, believed to be of Modesto Gammara, president of a local jeepney association, and of his worker Rene Gallente. The two, according to Gammara's father, an NPA member who surrendered to the PC prior to the exhumation, have been captured and executed in February due to complaints of embezzlement. The NPA denies their involvement in their deaths.\n* October 15 – A bronze statue of U.S. Gen Douglas MacArthur in Palo, Leyte, is blown up, tearing off its legs. It is speculated that communist guerillas are primary suspects, although no group claims credit for the explosion.\n* November 1 – The CPP Executive Committee orders the OPML stopped and all cases reviewed. In December, 55 individuals are released; however at the end, 66 NPA members are killed. \"Olympia\" and other anti-DPA campaigns are likewise ordered stopped, all due to abuses. Eventually, the leadership gives disciplinary action only to seven officers involved in the OPML.\n1989\n* NPA has 23,000 members by October.\n* January 16 – An Australian gold-processing plant in Bunawan, Agusan del Sur, is attacked by about 40 NPA rebels. The mine is looted and set aflame; five people are dead and dozen are wounded. For the next two weeks, gunfights involving villagers and the military leave six additional deaths.\n* February – A Filipino businessman who has been supporting U.S. military bases is shot dead by the NPA.\n* April – A planned ambush by an NPA team at Clark Air Base is foiled by a U.S. military security patrol while the former is laying landmines in a road.\n* April – Eighteen explosive devices are detonated by NPA rebels at a U.S. military communications facility in Mount Cabuyao near Baguio, destroying and damaging two antennas.\n* April 4 – About 300 mountaineers are stopped by some 350 NPA rebels in Santa Cruz, Davao del Sur, as they have been on expedition on Mount Apo. Among them, three foreigners and five Filipinos are captured; while the rest are detained until April 6. All of the hostages are freed on April 8 and 13.\n* April 21 – NPA gunmen assassinate a military adviser,  U.S. Army Col. James N. Rowe, while on his way to work in Quezon City, and seriously injure his driver. Rowe, a Vietnam War veteran, is heading the Joint U.S. Military Assistance Group in Manila. The shooting is part of a protest against U.S. assistance to the AFP. In 1991, the city Regional Trial Court would convict and sentence two NPA members to life imprisonment.\n* May – NPA rebels capture six soldiers after a 7-hour firefight on Mount Diwata in Surigao del Sur. The group is led by a priest, Frank Navarro, one of the long-time rebel chieftains in eastern Mindanao who has been searched by the military. The shelling in the area by June reportedly delays the release.\n* May – Dozens of skeletal remains are discovered in Mauban, Quezon, and Cavinti, Laguna, after a former NPA guerrilla, who had served as a guard in the OPML, has informed authorities of mass graves.\n* June 10 – The municipal hall of Marihatag, Surigao del Sur, is attacked by 300 rebels, reportedly led by Navarro; two soldiers and two children are killed.\n* June 25 – About 70 NPA rebels attack a religious service of the UCCP in its chapel in Digos, Davao del Sur, resulting in the deaths of up to 40 worshippers—two of them beheaded, as well as ten injuries. It is claimed that two NPA members are also killed. The congregation has been organized into an anti-communist religious cult Ituman, whose members compose most of the casualties that also include tribe members. Two days later, an NPA command in the Southern Mindanao region accepts responsibility and expresses apologies for the massacre, while claiming that they have retaliated after some of the rebels were attacked by Ituman members.\n* July 23 – The military offers rewards, about $50,000 each, for 35 members of CPP central committee, while issuing new wanted posters.\n* July 27:\n** Two CPP central committee members, Satur Ocampo, also a leader of the affiliated \"fronts,\" and his wife Carolina Malay, are arrested by the Philippine Constabulary in Makati. The couple, both former journalists, have been chief negotiators for the communists with the Aquino government.\n** The capital's security force reports that 15 lower ranking Communists have been arrested in a series of military raids on 23 suspected rebel \"safehouses\" in Metro Manila since July 26.\n* Around August – A report by The Washington Post states that eight of former CPP senior officials—four were from the Central Committee—have disclosed the activities of the party in separate interviews in more than a year of research on the party. These include the CPP's involvement in the Plaza Miranda bombing (corroborating Corpus' account in 1986), being masterminded by Sison; as well as a secret mission to China and failed shipping of weapons to the NPA. By then, Sison has been living in self-exile in the Netherlands.\n* 26 September – Two United States Department of Defense contractors are killed by NPA rebels outside the Clark Air Base.\n* September – An officer of the presidential security force is killed; NPA later claims responsibility.\n* October 20 – Four communist guerrillas free fellow rebels Romeo Valencia and Fernando Suangco, who has been charged in the 1987 murders of four individuals in Angeles City, in a restaurant. They shoot and injure two policemen who have been escorting the suspects after their court appearance, and the driver of the van they are trying to commandeer.\n* December – The U.S. Embassy Seafront Compound in Manila sustains minor damage after two rifle grenades are fired at them.\n1990s\n1990\n* NPA has 19,000 members by mid-1990.\n* January – NPA detonates an explosive at the U.S. Cultural Center in Davao City.\n* February – The NPA ambushes and kills an American geologist, his Filipino wife, and his father-in-law, in Bohol.\n* March – The NPA murders an American at his ranch in Masbate for his refusal to pay \"revolutionary taxes\".\n* May 15 – A night prior to the start of the negotiations between the governments of the Philippines and of the United States on the U.S. bases, the NPA shoots to death two U.S. Air Force personnel in Angeles City near Clark Air Base. The group fails to kill another. The NPA later \"declares a war\" against the American presence in the country.\n* May 18 – One of two rifle grenades fired at the U.S. Information Service Thomas Jefferson Cultural Center in Makati explodes.\n* May 24 – ABB announces the start of the \"sustained partisan warfare\" in Manila in line with their sixth anniversary. This follows the previous day's ambush of Constabulary Col. Reynaldo Dino in Caloocan where Dino and four other individuals are killed.\n* May 29 – Fumio Mizuno, a training director of a Japanese private organization helping rural farmers in Negros Occidental, is kidnapped by guerrillas in Bacolod. It is apparently in an effort to discourage Japanese aid. Mizuno is released on August 2.\n* June 5 – Retired Col. Laudemar Kahulugan, security chief of Purefoods, Inc. in Quezon City, is shot while on his way to work, in an apparent \"sparrow\" killing. Kahulugan have been a Constabulary chief in Angeles and Davao cities.\n* June 13 – Three NPA guerrillas abduct Timothy Swanson, a Peace Corps volunteer from Wyoming, in his residence in Silay, Negros Occidental. American officials would learn of the incident at the time of the withdrawal of the volunteers. Swanson is likewise released on August 2.\n* June 27 – The government of United States decides to suspend the 29-year-old Peace Corps program and to recall 261 volunteers following reported threats from the guerrillas. At that time, ten of its citizens have been killed in NPA attacks since October 1987.\n* July – In another attack at the U.S. Cultural Center in Davao City, four NPA members aboard a jeep fire at the building.\n* July 8 – About 40 NPA guerrillas raided Castellano village in central Negros, killing a policeman and his cousin in their house, and kidnapping at the checkpoint four others, including a son of the San Carlos city mayor and two businessmen.\n* July 17 – Guerrillas kidnap two army soldiers in Negros Occidental. They are later released along with Swanson in Silay.\n* September – In the first NPA bombing of the Voice of America (VOA) transmitter site in Tarlac, an antenna base is destroyed.\n* October – An American national is apparently kidnapped by the NPA while travelling in Cagayan.\n* November – Two rifle grenades are fired at the U.S. Embassy in Manila.\n* December – Two labor leaders are shot to death by two suspected NPA gunmen while holding a human rights seminar inside the Ateneo de Manila University campus. Since January, there have been more than eighty NPA assassinations in Metro Manila.\n1991\n* Government reports the arrest of 80 middle and high-ranking members of the CPP–NPA, among them members of the CPP General Command and its chief, Romulo Kintanar.\n* Early that year, a two-day battle occurs in Surigao del Sur, as NPA holds a hilltop military barracks for days.\n* January 30–31 – In NPA's second attempt to bomb a VOA facility in Tinang, Tarlac, firefights with the police ensue, first within a half-hour when 50 guerrillas fire at the police barracks; and later overnight as the saboteurs set up bombs at the VOA transmitter site. NPA members withdraw at the early morning of the following day; fifteen explosive devices are subsequently defused by the police.\n--->\n1992\n* NPA numbers around 18,000 guerillas.\n* The CPP leadership under Jose Maria Sison launches the Second Great Rectification Movement promoting a hardline response to the collapse of communism in eastern Europe and the dissolution of the Soviet Union.\n* During \"The Second Rectification Movement\", allegations that the party leaders are supporting insurrection lead to the breakup of the CPP into the reaffirmist and rejectionist factions—the latter a breakaway.\n* The CPP Central Committee issues a document condemning Ahos for various violations; and recognizes mistakes in the OPML.\n* February 15 – Approximately 200 NPA guerrillas, led by former Catholic priest Francisco \"Frank\" Navarro and mostly young boys, ambush a military convoy carrying a company of about 100 army troops in Marihatag, Surigao del Sur. The assault, which lasts almost an hour, leaves 47 soldiers dead, 18 injured and two missing; hence the worst government defeat since 1983. More than 3,000 troops are later deployed by the military for a counterattack, which would cause evacuations in the Higaonon community of the province and in Agusan del Sur.\n* February 16:\n** President Aquino, speaking at graduation ceremonies at the Philippine Military Academy, claims the government has defeated the NPA. Armed Forces chief Gen. Lisandro Abadia reports the decrease in size of the NPA, from 26,000 in 1988 to about 15,000.\n** Eleven communist rebels are killed in two separate clashes with the military in Kalinga-Apayao and Isabela.\n* April 11 – About 50 NPA guerrillas ambush a routine military patrol, returning to its camp, in Sagada, Mountain Province, leading to a battle that lasts for about six hours. At least 21 rebels and 19 soldiers troops are killed; at least 20 other government troops are wounded.\n* September 1 – The Joint Declaration of The Hague, a framework agreement for peace negotiations, albeit no interim ceasefire, is signed by the government (GRP) and the NDFP—with Sison who, since 1990, has been its chief political consultant in the negotiations which is supported by the European Parliament in its 1997 and 1999 resolutions.\n* 24 September – President Fidel V. Ramos signs into law Republic Act 7636, which repealed the Anti-Subversion Law of 1957 that outlawed membership in the Communist Party as part of his efforts to open peace negotiations with the CPP-NPA.\n* November – The CPP Executive Committee says that since 1988, more than a hundred cadres, including several Central Committee members, have been arrested, and the equipment containing sensitive information about the party have been seized.\n1993\n* The CPP said the methods used in anti-infiltration campaigns are defective.\n* In the Netherlands, in a memorandum, the intelligence agency, which has been monitoring Sison's activities since the early 1990s, warns the government that he and his organization posed a threat to the citizens.\n* March 19 – Ten Pampanga-based NPA guerrillas surrender to the city and police authorities in Angeles City, being headed by Fernando Suangco. Suangco, an NPA brigade commander, is a suspect in the 1987 assassination in Clark Air Base and also involved in the deaths of eight law enforcement personnel, and has been captured but freed by his fellow rebels in 1988.\n1994\n* President Fidel Ramos, in an attempt to end rebellion, legalizes CPP, allows it to be involved in parliamentary political process, and pardons most of its leaders. A peace process with the group begins.\n1995\n* Brig. Gen. Raymundo Jarque defects to the NPA due to disappointment with the government; the highest military official to join radical Leftists by then. He has been the chief implementor of counter-insurgency operations in Negros in the 1980s, particularly Oplan Thunderbolt. Later, he would be involved in the peace negotiations between the NDFP and the government.\n* May 14 and 21 – Heavily armed NPA rebels attack a village in Makilala, Cotabato, but are repulsed by army and militia troopers from nearby. Exactly a week later, another raid is conducted, killing an army soldier.\n1997\n* March – Nilo dela Cruz, leader of the urban-based ABB who has split from the Manila–Rizal Committee, brokers an alliance with the rural-based Revolutionary Proletarian Army (RPA), being led by Arturo Tabara, former head of the CPP–NPA Visayas Commission. Both groups are former CPP rejectionists.\n* 30 October – The NPA raided the police station of Rodriguez, Rizal, ransacking the armory, killing one police officer, and abducting Rene Francisco, the police chief. He was later released on December 5 in Tanay, Rizal.\n1998\n* By year-end, following years of purges, splits, and defections, the NPA reportedly falls to around 1,000 cadres, along with splinter groups operating as quasi-bandits.\n* February 15 – Odilon Mallari, lawyer and commentator at Roman Catholic-run DXCP in General Santos, is killed by two NPA liquidation squad members who would later be arrested.\n* March 16 – The Comprehensive Agreement on Respect for Human Rights and International Humanitarian Law (CARHRIHL), setting a framework to address human rights violations related to insurgency, is agreed by the GRP and the then-exiled NDFP. Amidst the periodic peace talks, the administration of Joseph Estrada (presidential term begins at mid-year) will enter talks on its implementation in late part of that year.\n* Early May – The car of Surigao del Sur governor Primo Murillo is reportedly fired by NPA assailants, wounding members of his staff.\n* May 1 – A breakaway group, Rebolusyonaryong Partido ng Manggagawa ng Pilipinas (RPM-P; Revolutionary Workers Party of the Philippines), is established by Tabara, who would be its chairperson, and de la Cruz, leaders of the ABB–RPA alliance, an armed wing, as its Marxist–Leninist political wing.\n* July – A police patrol in Northern Samar is attacked by about 40 NPA members, killing two policemen and an army officer.\n* August – A military platoon is ambushed by NPA rebels, cooperating with tribal leaders, in the Bontoc, Mountain Province, wherein two soldiers are killed. The incident took place amid calls for the government's denial of mining company applications in the area.\n* September:\n** Another splinter group, Marxista–Leninistang Partido ng Pilipinas (MLPP; Marxist–Leninist Party of the Philippines), is established by Central Luzon-based cadres expelled in 1997 by CPP leader Benito Tiamzon. Members also include those who has separated from CPP–NPA after a 1992 debate over various differences. MLPP would formally sever its ties in April 1999. Its armed group is the Rebolusyonaryong Hukbong Bayan (RHB, Revolutionary People's Army).\n** A group of 25 NPA insurgents is attacked by a military unit in Samar, killing five of them.\n* Amado Payot (Kumander Benzar), alleged head of the group responsible in the 1989 massacre of worshippers in Davao del Sur, is captured in Cotabato. He is later detained in Davao City for various charges until being freed on bail in March 1999; but never appears in a trial.\n1999\n* NPA resumes armed activities; CPP breaks off negotiations. Throughout the presidency of Joseph Estrada, NPA ranks increase again to 12,000 guerillas.\n* February 17 – NPA rebels abduct Brig. Gen. Victor Obillo, who would be the highest-ranking military officer to be captured, and Capt. Eduardo Montealto in Davao City. After a massive rescue mission and an intercession, the captives are freed on .\n* NPA guerrillas captured a police officer in Sorsogon, Sorsogon, and an army officer in Lianga, Surigao del Sur. The two are likewise freed, earlier than Obillo and Montealto.\n* August 2 – A member of the CPP's Southern Mindanao Regional Party Committee, an NPA medic, and two civilians who have given them a ride to Compostela, Compostela Valley, are allegedly summarily executed by army soldiers.\n* November 2 – Leoncio Pitao (Ka Parago), custodian of Obillo and Montealto, is arrested in his residence in Davao City.\n2000s\n2000\n* From January 15 to February 5, skeletal remains of at least a hundred individuals, mostly NPA rebels, were exhumed by government authorities from various mass graves in Brgy. Taglimao, Cagayan de Oro. They were believed to be victims of a purge by the NPA in the mid-1980s, known as Operation Zombie. Military authorities estimated that more than 4,000 people were killed, in which only 15 were actually \"deep penetration agents\" (DPAs), the main target. Since 1999, the remains of at least 416 of them had been recovered in the NPA \"killing fields\" in the said village.—[http://www.newsflash.org/2000/02/hl/hl011869.htm \"New ‘killing fields’ yield 50 NPA victims\"] PHNO. February 7, 2000. Retrieved January 7, 2019.—[http://www.newsflash.org/2000/02/hl/hl011872.htm \"Joma faces murder charges for Mindanao killing fields\"] PHNO. February 8, 2000. Retrieved January 7, 2019. Some former NPA guerillas confessed that the mass killings, particularly of at least 60 rebels in 1986, were allegedly carried out on orders of CPP founding chairman Jose Maria Sison.—[http://www.newsflash.org/2000/01/ht/ht001032.htm \"Joma disowns Mindanao killing fields, faces murder charges\"] PHNO. January 19, 2000. Retrieved February 26, 2022.—[http://www.newsflash.org/2000/01/ht/ht001044.htm \"Ex-NPA leader confirms Mindanao killing fields massacre\"] PHNO. January 31, 2000. Retrieved February 26, 2022.\n* February 5 – Suspected communists assassinated a village chief and two civilians in Naga, then part of Zamboanga del Sur.\n* March 2 – About 40 NPA rebels attacked an army detachment in Balilihan, Bohol but immediately withdrew. They later ambushed a truckload of soldiers and militiamen, who had sent to reinforce the detachment, along the way in Catigbian, killing at least 5 soldiers and their officer, as well as 4 militiamen.\n* March 11 – The 43rd Infantry Battalion of the Philippine Army captured a NPA camp in Bontoc, Southern Leyte; 5 rebels were killed in a firefight.\n* May 9 – Combined forces of the Army's 1st Infantry Battalion's Task Force Banahaw and the regional police mobile group encountered a band of about 50 NPA fighters in Paete, Laguna; 8 suspected rebels were killed.\n* June 15 – Seven soldiers and a militiaman were killed in an ambush by the NPA in Maslog, Eastern Samar.\n* June 28 – NPA insurgents ambushed a military medical mission in Jones, Isabela, killing an Army colonel and 12 of his troops in their worst attack within a decade.\n* July – government forces discovered a mass grave in Baybay, Leyte containing the skeletal remains of more than 10 suspected victims of a rebel purge in the early 1980s.\n* July 3 – A NPA commander identified as Ka Alpha was killed, and three policemen and a civilian were wounded, in a clash in Mansalay, Oriental Mindoro.\n* July 4 – 60 suspected NPA rebels ambushed a police team tasked to investigate the killing of a barangay chairman a day prior, in a mountain village in Victoria, Oriental Mindoro, killing 8 of them and wounding five others.\n* September 30 – A military group returning from a three-day civic action, was ambushed by the NPA in Paquibato District, Davao City; at least 4 from the group were killed, as well as 5 civilians.\n* November 18 – About 80 NPA rebels attacked a police station in Caramoan, Camarines Sur, later repelled by the policemen; at least 6 guerrillas, a policeman, and a militiaman, were killed.\n* December 3 – A police chief of Puerto Galera, Oriental Mindoro was assassinated by four unidentified men, believed to be NPA rebels. It was said that it was in retaliation to the death of a certain Ka Joel, leader of a three-man NPA group assigned the town, in an encounter in August.\n2001\n* Another memorandum from the Dutch intelligence agency reportedly accuses Sison of having contacts with Muslim insurgent groups in the southern Philippines.\n* November 17 – NPA rebels ambushed 25 soldiers of an Army Special Forces platoon on board a dump truck that had hit a landmine in Cateel, Davao Oriental, killing 18 of them; the remaining soldiers returned fire in the ensuing firefight that killed 10 rebels.\n2002\n* Early April – A police contingent is waylaid by NPA guerrillas in Kiblawan, Davao del Sur, killing two policemen.\n* April 9 – An injured suspected NPA rebel is captured after a clash between some 30 rebels and government troops in Tapaz, Capiz.\n* April 13 – About 30 suspected NPA rebels forcibly enter a construction site in Calbayog, Samar, and burn three heavy equipment.\n* April 15 – A military offensive on an NPA camp in Davao City kills six rebels and injures a militiaman and two of the seven who are captured.\n* April 16 – Suspected NPA guerrillas ambush a police contingent in Maasim, Sarangani, injuring three police officers.\n* On 30 June, one soldier and 15 militants were injured after a skirmish in Nueva Era, Ilocos Norte. Documents and pamphlets were seized from rebel bunkers.\n* Early August – The government declares an \"all-out war\" (against the communist rebels).\n* August 6 and 8 – Sison issues separate statements. One says the NPA could increase \"its tactical offensives, [through] 128 guerrilla fronts\" and \"can also go into new kinds of special operations.\" Another says his remarks on the electrical system represent only \"an analysis, not an order to the NPA.\"\n* August 9 and 12 – The United States Department of State designates the CPP–NPA as a \"foreign terrorist organization,\" saying that their presence has been strongly opposed and their citizens has been killed by the NPA in the Philippines. This follows a latter country's visit by its secretary Colin Powell. Three days later, the United States Department of the Treasury listed the CPP–NPA and Sison as \"terrorists\" and orders the freezing of their assets.\n* August 13 – The Dutch Foreign Minister issues the \"sanction regulation against terrorism\" listing the CPP–NPA and Sison (allegedly Armando Liwanag, chairman of the CPP Central Committee).\n* As a result of the declarations on the CPP–NPA and Sison as \"terrorists\" by the governments of the United States and of the Netherlands, as well as by the council of the European Union, a crackdown on suspected assets of Sison is launched in the Netherlands; including an eviction order as well as stoppage of providing benefits. Sison later challenges these actions, as well as that to block his asylum request in the Netherlands, in the courts.\n* September 27 – About 50 rebels raid a police station in Lopez, Quezon, killing a police chief and an officer, and wounding two others.\n* September 30 – A police station in San Rafael, Bulacan, is strafed by NPA rebels who, at the same time, injure three soldiers in a firefight in a nearby town.\n* Early October – The National Bureau of Investigation announces the arrest of a suspected NPA fund raiser and two cadres somewhere in Metro Manila \"less than [a week prior]\". Their base of operations is in Quezon.\n2003\n* February 5 – The CPP Executive Committee issues a statement saying that among those with the biggest accountability in the purge in the 1980s are officials who have broke away from the party, especially in 1992 during the \"Second Rectification Movement,\" naming only five of them.\n* On 19 April, 5 soldiers were killed and 9 wounded in a gun fight with NPA rebels outside Ligao, Albay.\n* June 22:\n** NPA rebels assassinate municipal mayor Guerrero Zaragoza outside a cockpit in Tayug, Pangasinan. A bystander is also killed.\n** In the second NPA raid in Quinapondan, Eastern Samar, involving about 150 rebels, the attack at the police station by 20 of them is repulsed by two of three policemen in the area, one of them is a police chief who is injured.\n* June 26 – A patrol base of a company of the 52nd Infantry Battalion in Oras, Eastern Samar, is attacked by 200 communist guerrillas; and is later burned after a 2-hour gun battle. Among the 34 who man the detachment, 11 militiamen and 5 army soldiers are killed along with a civilian, in what will reportedly be the largest NPA raid since the 1989 Digos incident.\n* July 14 – NPA rebels ambush a group of soldiers in Bontoc, Mountain Province, killing eight from the latter. On August 5, military operations in two villages begin, where seven rebels are killed, including two in an aerial attack on August 15.\n* August 6 – A junior army officer and two of 3 soldiers, acting as his security escorts, are killed in Canlaon, Negros Oriental, while they, on board a service vehicle of the city government, are about to deliver military supplies in Moises Padilla, Negros Occidental. An NPA command claims responsibility in the ambush.\n2004\n* Early that year, NPA has 128 guerrilla fronts under its command, in more than 90% of the provinces.\n* March 26 – A PNOC geothermal plant in Leyte is raided by an NPA unit which would kill three PNOC employees and two policemen in subsequent ambush.\n* March 28 – An army patrol base in Davao City is raided by more than a hundred guerillas, which would retreat later following a four-hour gun battle as another yet outnumbered battalion of soldiers foil the attack. Two members of the Civilian Active Auxiliary are wounded.\n* November – Ten soldiers are killed by NPA rebels in San Rafael, Bulacan.\n2005\n* February – A rebel-planted land mine in Sultan Kudarat injures two soldiers.\n* On 13 July, NPA cadres killed nine soldiers and injured three in Ilocos Sur.\n* On 29 September, left-wing party Bayan Muna, accused by security forces of being an NPA front, announced that 53 of its members had been killed by alleged government hired gunmen between 2001 and 2005. Leftist labor movement Kilusan Mayo Uno seconded the accusations, claiming that 33 of its activists were killed in 2005. Satur Ocampo described the killings as \"political repression masquerading as counter-insurgency and antiterrorism operations\". A PNP official said that the killings would be fully investigated, and following an official enquiry, at least two soldiers were charged with murder.\n* October 9 – Five soldiers and three civilians are killed in an NPA land mine attack in Misamis Occidental.\n* On 28 October, at least 10 militants were wounded in clashes in Surigao del Sur.\n* On 10 November, rebels set light to a public bus in Bataan after the owner refused to pay a revolutionary tax.\n* November 19 – Two army trucks, carrying 60 soldiers who are returning from combat operations, are attacked by 30–40 NPA rebels in Calinog, Iloilo, wherein land mines blow up a truck and rebels fired at them. After an hour-long gun battle, nine soldiers are killed and 20 are injured.\n* November 19–20 – In Quezon, an NPA unit attack Globe cellular towers in Lucban and Sampaloc. The next day, a gun battle with a six-man mobile patrol team along Maharlika Highway in Tiaong kills a policeman and injures three. The NPA claims that some guerrillas are wounded.\n* December 16 – A land mine detonated by suspected communist insurgents in Tulunan, Cotabato, kills three soldiers in a humanitarian mission, and injures at least 11 others.\n2006\n* January 31 – Ten individuals, including three civilians, died in a clash between the military and NPA rebels in Santa Ignacia, Tarlac.\n* May 18 – A civilian was killed in a military encounter against NPA rebels in Bulan, Sorsogon.\n* June 23 – A rebel ambush in Laguna resulted in the injury of a soldier.\n* June 26 – An NPA-planted landmine hit a military minivan in Camarines Sur, wounding a soldier.\n* July 16 – A soldier and a policeman were killed in a gunfight in Occidental Mindoro. On the same day, the NPA allegedly assassinated an army officer in Bulacan.\n* July 21 – The NPA raided a police station in Isabela, stealing four rifles and a number of communication sets.\n* July 22 – NPA rebels attacked a ferry terminal and a police station in Matnog, Sorsogon.\n* July 24:\n** NPA rebels, had purportedly failed in collecting \"revolutionary taxes\" from owners of public vehicles, detonated two landmines on a highway in Tago, Surigao del Sur, hitting a jeepney wherein five of its passengers were seriously injured, along with ten pedestrians.\n** NPA taken hostage some fifty civilians in San Francisco, Agusan del Sur, as they gathered them in a checkpoint set up by some hundred rebels led by George Madlos (Ka Oris). Some were released later that day.\n** On the same day, suspected NPA members set fire to a Globe telecommunications tower in Camarines Sur.\n* August 8 – An NPA attack caused the injury of five soldiers who were at the time packing relief supplies for evacuees from the eruption of Mayon Volcano. In a separate incident, the AFP killed five rebels and lost one soldier during clashes with the NPA.\n2007\n* In May, the NPA imposed a countrywide campaign tax on politicians willing to participate in the midterm elections. According to a PNP source, the victorious candidate of the Albay governor's race paid the NPA a total of $800,000. Former governor Fernando Gonzales accused the NPA of denying him entry into the southern regions of the province. The rebels also intensified their attacks before the election, resulting in the deaths of 18 people.\n* May 28 – Eight soldiers were wounded as NPA rebels ambushed a military convoy in Aurora.\n* On 7 June, the NPA engaged AFP troops in Monkayo, Compostela Valley. Both sides issued conflicting reports concerning incident: a government spokesman announced the death of nine rebels and four soldiers, while the NPA denied claimed to have killed 15 soldiers and suffering one fatality.\n* On 15 June, the AFP clashed with insurgents in Compostela Valley. Nine militants and four soldiers were killed during the battle.\n* On 16 June, NPA fighters killed four policemen in Catanduanes. Weapons were removed from the killed officers.\n* On 17 June, a squad of militants detonated three bombs at a Globe Telecom tower in Iloilo after disarming the security guards on the site.\n* On 24 June, several dozen guerrillas carried out a raid on the town hall of Dangcagan, Bukidnon. One police officer was killed as the rebels fled with eight stolen weapons.\n* On 29 June, a band of militants launched an offensive on an AFP patrol base in Agusan del Norte. Eight militants and seven AFP soldiers were killed, and the rebels abducted three AFP personnel.\n* On 31 June, three guerrillas were killed by the Philippine Army in Agusan del Norte.\n2008\n* On 5 May, the NPA assassinated former Legazpi City chief Narciso Guarin.\n* On 26 October, NPA fighters masquerading as Philippine Drug Enforcement Agency officer raid the Quezon Provincial Jail to free seven imprisoned fighters. In response to the jailbreak, high-risk NPA fighters were immediately transferred to other secure prisons.\n2009\n* On 13 November, an NPA attack on a logging site resulted in 23 deaths.\n2010s\n2010\n* On 15 May at around 14:50, a truck carrying members of the Philippine Army was bombed in Davao City. One soldier died and two injured soldiers were evacuated to Davao Medical Center.\n* On 20 May, a team from the Philippine National Police Special Action Force were aboard their vehicle when suspected NPA rebels detonated a land mine at San Jose village in Antipolo, Rizal at around 6 am.\n* On 13 July, the NPA executed Mateo Biong Jr., a drug cartel leader and former mayor of Giporlos, Eastern Samar. Biong was accused of killing rival drug dealers, illegal logging and mining, and misuse of public funds.\n* On 26 September, security forces killed top NPA commander Elmer Osila during clashes in Goa, Camarines Sur.\n* On 14 December, ten soldiers were killed and two injured after a guerrilla ambush in Las Navas, Northern Samar. The rebels took 11 rifles from the killed soldiers.\n* On 15 December, two civilians were killed, one of them a 15-year-old boy and the other a former chairman of Barangay Poponton, in an ambush on a pump boat along Hinaga River in Las Navas, Northern Samar. Five soldiers and a civilian were reported missing as a result of the ambush carried out with automatic weapons at around 5 pm that left the civilian vessel heavily damaged. The attack was believed to have been carried out by an undetermined number of NPA rebels who were said to be hiding along the forested area of the river.\n2011\n* On 26 May, three construction workers are killed and another wounded in an attack staged by leftist rebels in the ore-rich town of Tampakan, South Cotabato. Ten gunmen, believed to be NPA rebels, ambushed a convoy of five trucks at around 1:30pm with small arms and grenades in the village of Danlag.\n* On 2 June, the PNP arrested rebel explosive expert Ryan Sison in Dalahican village, Lucena, Quezon, confiscating IED components.\n* On 4 July, a closure agreement between the CPLA and the Government of the Philippines was signed at Rizal Hall in Malacañang Palace. The agreement called for the disarmament of the group, the reintegration of the militants into mainstream society and the conversion of the militant group into a socio-economic organization.\n* On 26 July, a government militiaman was killed and one wounded in Barangay Gumitan, Marilog district, Davao City.\n* On 3 October, a band of 200 NPA fighters set fire to equipment belonging to mining corporations in the villages of Cagdianao and Taganito, in Claver, Surigao del Norte.\n2012\n* On 16 January, six insurgents were killed during a clash in a Japanese banana plantation in Compostela Valley.\n* On 9 April, rebels carried out a raid on the police station of Tigbao, Zamboanga del Sur, stealing weapons and taking hostage a policeman, who was later released.\n* On 19 April, an IED detonated by the NPA killed three and injured two soldiers in New Upian, Barangay Marilog, Marilog district, Davao City.\n* On 23 April, militants stole several high-powered assault rifles from a security agency in Butuan, Agusan del Norte, after posing as National Bureau of Investigation agents.\n* On 25 April, an NPA attack resulted in the deaths of 11 soldiers and 2 civilians in Ifugao.\n* On 29 April, militants killed four soldiers and a civilian PDT member in Labo, Camarines Norte, and took their weapons.\n* On 7 May, the NPA claimed to have carried out an ambush in Trento, Agusan del Sur, and Monkayo, Compostela Valley, killing three soldiers, and wounding four. In a second incident, two soldiers were wounded in the vicinity of the Bahayan river, Trento. The AFP responded by bombing Trento, displacing 80 families.\n* On 14 May, a soldier was killed during a shootout in Barangay Bucalan in Canlaon, Negros Oriental.\n* On 20 May, rebels sabotaged equipment stationed at an airport construction site in Albay.\n* On 24 May, NPA agents assassinated an intelligence officer at the cockfighting pit of Lagonglong, Misamis Oriental.\n2013\n* January 27 – Twenty suspected NPA guerrillas ambushed a truck, with policemen and village officials among those aboard, in La Castellana, Negros Occidental; nine people, including a policeman and three village officials, were killed.\n* On 28 February, authorities detained the NPA's Central Visayas commander Ruben Nabas along with his secretary. On the same day, two NPA members surrendered to the authorities of Barangay Del Pilar, Cabadbaran, Agusan del Norte.\n* On 7 May, two soldiers were killed while escorting election officials in Kalinga.\n* On 11 May, rebels of the communist New People's Army allegedly ambushed the convoy of Kadingilan, Bukidnon mayor Joelito Jacosalem Talaid, wounding him and killing four of his bodyguards. A radio report stated the mayor had been shot in the leg. Talaid was traveling through Barangay Kibogtok when he and his bodyguards were stopped by up to 10 armed men. Talaid was also allegedly forced to hand over 7 million Philippine pesos worth of cash to the suspects.\n* On 20 May, NPA militants raided the office of a security agency in Orange Valley village, Tagum, Davao del Norte, stealing firearms, ammunition and bulletproof vests. They also detonated an IED on a national highway in Barangay Pandapan, Tagum, injuring five soldiers and a civilian.\n* On 27 May, a group of 30 rebels ambushed a Special Action Force patrol in Capagaran village, Allacapan, Cagayan, killing 8 policemen and injuring 7 others.\n* On 21 August, one soldier was killed and three were wounded in a skirmish in Purok, Barangay Balagan in San Mariano, Isabela. Security forces seized two IEDs and propaganda materials.\n* On 30 August, Philippine Air Force helicopters bombed rebel positions in the northern area of Sagada, Mountain Province, following a clash that took place a day earlier during which two policemen were wounded.\n* On 5 December, NPA officer Rene Rabulan Briones was killed in Del Gallego, Camarines Sur, during a shootout with the Philippine military.\n* On 14 December, the NPA raided a police station in Kibawe, Bukidnon. A police officer was killed, and the insurgents stole 13 firearms before escaping in four cars.\n2014\n* On 1 January, suspected NPA members gunned down Demetrio Capilastique, a leading figure of the Revolutionary Proletarian Army-Alex Boncayao Brigade (RPA-ABB), in Badiangan, Iloilo.\n* On 22 March, Communist Party of the Philippines (CPP) Chairman Benito Tiamzon, his wife Wilma Tiamzon (secretary general of the NPA) and five others were arrested in Barangay Zaragosa, Aloguinsan, Cebu. The Tiamzons had a standing warrant of arrest orders for crimes against humanity, including charges of murder, multiple murder and frustrated murder.\n* On 27 March, Andrea Rosal, daughter of deceased former NPA spokesman \"Ka Roger\" Rosal, was arrested in Caloocan.\n* Between 7–10 April, the NPA set fire to vehicles and heavy equipment belonging to mining companies in Masara village in Maco and Pantukan, Compostela Valley, after alleged environmental damage caused by the mining companies.\n* 17 April – insurgents clashed with a detachment of the Citizen Armed Force Geographical Unit (CAFGU) in Barangay San Pascual, Catarman, Northern Samar. There were no casualties.\n* 20 May – five communist militants were killed in two separate encounters in President Roxas, Cotabato and Tayabas, Quezon. One soldier was wounded. Government forces seized weaponry, radios, ammunition and propaganda materials.\n* 23 May – at least five NPA rebels were killed and two captured in a firefight in Barangay Balocawe, Matnog, Sorsogon.\n* 8 June – security forces captured NPA commander Nasyo in Tanjay, Negros Oriental.\n* 16 July – an NDF spokesman announced that the NPA had suffered 14 fatalities following simultaneous attacks against private armies in Santa Irene, Prosperidad, Barangay Bitan-agan, San Francisco, Agusan del Sur. A civilian and a private army commander were also killed in the incident, and NDF claimed to have seized a number of weapons during the raids.\n* 31 July – One soldier and an unspecified number of rebels were killed in a firefight in Tapaz, Capiz.\n* 6 August – The AFP arrested top militant commander Eduardo Almores Esteban in Landheights subdivision in Barangay Buntala, Jaro, Iloilo City.\n* 4 September – Five NPA fighters died in an encounter with an army patrol in Lacub, Abra.\n* 3 November – NPA gunmen killed two soldiers in Daraga, Albay .\n* 5 November – The AFP engaged suspected NPA insurgents, killing three fighters and seizing nine weapons, in Sitio Tubak, Barangay Nomol, Maasim, Sarangani.\n* 23 November – Three civilians were injured in an NPA attack on an army patrol post in Sitio Guiwanon, Barangay Danao, San Jacinto, Masbate.\n* 25 November – The PNP detained rebel commander Billy Morado along with another insurgent in Caloocan.\n* 5 December – a security force patrol clashed with guerrillas in Sitio Upper Balantang, Barangay Cabuyuan, Mabini, Compostela Valley, killing five rebels.\n* 17 December – The Criminal Investigation and Detection Group arrested NPA commander Jordan Reyes Donillo at a checkpoint located in Barangay Magnaga, Pantukan, Compostela Valley. On the same day, the NPA released a statement claiming to have killed 40 government loyalists, including policemen, soldiers and militia, in the course of 28 operations in December.\n* 26 December – The Philippine government and the Communist Party of the Philippines agreed to renew peace talks.\n* 29 December – Three soldiers were killed in a communist ambush in Mabini, Compostela Valley.\n2015\n* 16 January – Three NPA officers surrendered to authorities in Capiz, the rebels belonged to the Tugalbong and Baloy platoons of the NPA.\n* 23 January – Government troops clashed with NPA militants in Sitio Brazil, Mat-i, Surigao City and Imbayao, Malaybalay, Bukidnon. No casualties were reported, and the Philippine Army seized two rifles and a grenade launcher in the former encounter.\n* 28 January – NPA rebels killed a soldier of the 69th Infantry Battalion in an ambush in the Paquibato district, Davao City.\n* 2 February – Rebels executed Rufino Dumayas, a former NPA commander, after accusing him of revealing the identities of several rebels and cooperating with security forces.\n* 5 February – An army officer was killed by communist guerrillas in Las Navas, Northern Samar. Two rebels were later arrested.\n* 6 February – Security forces overpowered a group of NPA rebels, forcing them to flee, in Barangay Rojales, Carmen, Agusan del Norte. Numerous weapons, explosives and communication equipment were seized, and one rebel was arrested.\n* 8 February – Authorities arrested Raunil Mortejo, Reboy Gandinao and Jasmin Badilla, three members of NPA's Eastern Mindanao Command, in Barangay Sinaragan, Matanao, Davao del Sur, and in Barangay Lumintao, Quezon, Bukidnon.\n* 9 February – Security forces uncovered NPA encampments in Sitio Tig-atay, Barangay Igpaho, Tubungan, Iloilo, and Sitio Tigmarabas, Barangay Ongyod, Miag-ao, Iloilo. The camps had the capacity to accommodate 120 people.\n* 14 March – A landmine detonation killed 3 soldiers and wounded five others, the incident occurred in Los Arcos, Prosperidad, Agusan del Sur.\n* 1 April – Two soldiers and a civilian were killed in an NPA ambush in Sityo Ban-as, Barangay Mahayag, San Miguel, Surigao del Sur, seven people were also wounded.\n* 2 June – Authorities detained the NPA's top commander Adelberto Silva in Bacoor, Cavite south of Manila, grenades and documentation were also recovered during the operation.\n2016\n2017\n* 30 January – Two soldiers were killed following an ambush staged by suspected NPA guerrillas in Echague, Isabela.\n* 8 February – Heavy equipment were set on fire by rebels in San Francisco, Quezon.\n* 8 February – A soldier was killed in a firefight in Santo Niño, Cagayan.\n* 9 February – Rebels burned two trucks in Itogon, Benguet.\n* 9 February – NPA rebels killed a resident and abducted two others in Talakag, Bukidnon.\n* 13 February – Four rebels were killed in a firefight with government troops in Aroroy, Masbate.\n* 16 February – Two soldiers and three NPA rebels were killed while 15 other troops were wounded in a land mine attack and clashes in Davao City.\n* 8 March – Rebels ambushed a police convoy, resulting in 4 policemen killed and injuring another, in Bansalan, Davao del Sur.\n* 18 March – A rebel was killed in an encounter with government troops in Kitcharao, Agusan del Norte.\n* 30 March – An encounter between the military and rebels took place in General Nakar, Quezon. Two soldiers and 10 rebels were killed.\n* 28 July – Firefight between government forces and the NPA in Trece Martires village, Casiguran, Sorsogon left 4 rebels dead.\n2018\n* 23 January –\n** Two soldiers died and two were wounded in an encounter with NPA members in Pinukpuk, Kalinga.\n** A retired policeman was killed by the NPA in Tabuk, Kalinga.\n* 25 January – Insurgents killed an Army officer and wounded 2 soldiers in a firefight in Paquibato proper, Davao City.\n* 28 January – A man was kidnapped and later executed by the NPA in San Miguel, Surigao del Sur.\n* 15 August – Seven NPA militants were killed during a gunfight that lasted 33 minutes, in San Jose, Antique.\n* 28 December – The National Task Force to End Local Communist Armed Conflict (NTF-ELCAC) was formed, pursuant to Executive Order No. 70 issued by President Rodrigo Duterte\n* 30 December – Six militants were killed in Negros Oriental in separate encounters with government forces, while 24 arrested during a series of anti-rebels raids including former Guihulngan Mayor Cesar Macalua, who was allegedly involved in the illegal drug trade.\n2019\n*November 26 – CPP-NPA Leader Jaime \"Ka Diego\" Padilla was captured and arrested in San Juan, Metro Manila after undergoing an executive checkup in Cardinal Santos Medical Center. Authorities said that he was carrying P4.4 million in revolutionary tax he collected.\n2020s\n2020\n2021\n*January 6 – A military officer of the 72nd Division Reconnaissance Group was killed in a shootout with rebels in Abra.\n*January 12 – Government employee Pio Lingatong was assassinated by militants in Barangay Aloja, Batuan, Bohol.\n*January 17 – 3 soldiers were killed and 1 were wounded in an ambush in Legazpi City, Albay, the soldiers were transporting intel when they were attacked.\n*January 20 – Several militants killed 2 kidnapped village officials in Masbate, 1 being a councilman and another being a watchman.\n*January 22 – 1 soldier was killed in a shootout with rebels in Lamag village, Quirino, Ilocos Sur.\n*January 28 – Shots were fired at the Sison police station in Surigao del Norte, 2 hours later a group of rebels in the same area ambushed a patrol, a military officer sustained head injuries.\n*January 30 – A skirmish occurred between militiamen and rebels in Don Victoriano, Misamis Occidental, at least 1 militiaman was injured.\n*February 3 – A soldier was wounded by an IED during a skirmish with rebels in the Umayam tribe region of Bukidnon.\n*February 4 – Rebels assassinated militiaman Darwin Juagpao in Tandag, Surigao del Sur.\n*February 5 – 2 soldiers were killed and 1 wounded during a clash with rebels in Quezon.\n*February 8 – Rebels assassinated militiaman Lander Sta. Ana Garde in Guihulngan, Negros Oriental.\n*February 9 – A military lieutenant was killed along with 2 rebels during intense clashes in Quezon.\n*February 17 – 2 former mayors and 2 others were assassinated during a rebel ambush in Barangay Ignacio B. Jurado, Lasam, Cagayan. NPA propaganda was found near the scene and there were no less than 6 attackers.\n*February 18 – A soldier was wounded during a skirmish with rebels in San Joaquin, Iloilo.\n*February 19 – A Special Action Force member with the Philippine National Police was wounded in a shootout with rebels in Northern Samar.\n*February 22 – 4 Special Action Force troopers and 2 civilians were wounded by a rebel IED on a highway in Barangay Putiao, Pilar, Sorsogon, the rebels also engaged in a brief firefight with the police before retreating.\n*February 25 – Rebels torched a Dump Truck and a Backhoe in Barangay Binocaran, Malimono, Surigao del Norte.\n*February 28 – Village chief Julie Catamin was killed during a drive-by in Barangay Roosevelt, Tapaz, Capiz.\n*March 3 – Rebels detonated a landmine near a police car in Janiuay, Iloilo. Nobody was injured.\n*June 8 – Keith Absalon and his brother Nolven were killed in a Masbate City blast, after 24 NPA rebels detonated landmines and explosives. Later, one rebel was arrested.\n* August 16 – An encounter between government forces and the NPA in Dolores, Eastern Samar resulted to deaths of at least 16 rebels.\n*October 30 – NPA Leader Jorge \"Ka Oris\" Madlos was slain after a clash with military troops in Impasugong, Bukidnon.\n* December 17 – Four suspected NPA members died in an encounter between combined forces of the 2nd Infantry Battalion of the Philippine Army's 903rd Infantry Brigade and the police, and at least 20 suspected rebels, at the boundary of Esperanza and Placer in Masbate.\n* In 2021, 142 suspected NPA members were neutralized, according to a Philippine Army report: 71 surrendered, 49 died in encounters, 22 were arrested. Among those neutralized were 12 high-ranking leaders.\n2022\n*February 24 – alleged rebels were killed in Andap village, New Bataan, Davao de Oro by the government troops.\n* June 8 – An NPA member was killed in an encounter in Palimbang, Sultan Kudarat.\n* July 6 – Four rebels involved in the ambush of policemen in Binalbagan, Negros Occidental in February, were killed in an encounter.\n* July 26 – Three suspected NPA rebels died in a gun battle in Canlaon, Negros Oriental.\n* July 30 – Three NPA rebels, including a high-ranking leader, were killed in encounters in Palimbang, Sultan Kudarat.\n* August 22 – A boat carrying ten NPA members, reportedly including leaders Benito and Wilma Tiamzon, exploded during an encounter with the military's Joint Task Force Storm off Catbalogan, Samar. Some remains were later retrieved. Both the National Intelligence Coordinating Agency and the Communist Party of the Philippines confirmed the deaths of the Tiamzons, with the latter disputing the circumstances presented by the Armed Forces of the Philippines.\n* September 6 – The son and wife of Ka Oris Madlos' Vincent Isagani Madlos and Angie Polandres Salinas were killed after an encounter with members of the 8th Infantry Battalion under the 403rd Infantry Brigade in Barangay Kapitan Bayong, Bukidnon.\n* September 23 – A clash between government troops and communist militants occurred in Esperanza, Sultan Kudarat.\n* October 6–19 – Series of encounters between troops of the 94th Infantry Battalion (94IB) of the Philippine Army (PA) and NPA rebels began on October 6 in Barangay Carabalan, Himamaylan, Negros Occidental. Two soldiers were killed on October 8; Romeo Nanta, commanding officer of the Regional Operational Command of Komiteng Rehiyon-Negros, was also killed on October 10. As a result, more than 3,000 individuals from barangays Carabalan and Cabadiangan were temporarily displaced until October 18. On October 12, the 94IB seized a communist rebels' hideout. On October 19, it was confirmed that encounter sites were cleared by the army.\n* October 7 – Two soldiers were killed in an NPA attack in Jipapad, Eastern Samar.\n* October 26 – Two rebels were killed in an encounter in Garchitorena, Camarines Sur.\n* October 30 – A top NPA leader was killed in an encounter in Senator Ninoy Aquino, Sultan Kudarat.\n* November 21 – A local NPA guerrilla unit commander in Central Negros was killed in a brief encounter in Guihulngan, Negros Oriental. By that time, three rebels had been killed in series of clashes in the city for the past weeks.\n* November 23 – Six rebels from the NPA's Eastern Visayas Regional Party Committee, including its leader, were killed in an encounter with Army troopers in Las Navas, Northern Samar.\n* November 24\n** Six NPA rebels belonging to a sub-regional command, including a ranking leader and his wife, were killed in an encounter with soldiers of the Army's 7th Infantry Battalion in Bagumbayan, Sultan Kudarat.\n** Suspected rebels shot and killed two soldiers in an ambush in Sipalay, Negros Occidental.\n* December 16 – Jose Maria Sison, founding chairperson of the CPP, died after a two-week hospital confinement in Utrecht, the Netherlands.\n2023\n* January 9 and 10 – A suspected NPA rebel was killed in an encounter in Himamaylan, Negros Occidental on January 9. Another was killed in Guihulngan, Negros Oriental the following day.\n* February 4–5 – Two separate clashes between government forces and NPA rebels occurred in a village in Kabankalan, Negros Occidental. Following the second encounter, the bodies of three rebels and their weapons were recovered.\n* February 9 – Five rebels were killed in a dawn encounter between soldiers of the 2nd Infantry Battalion, who were conducting a security patrol, and some 20 NPA members in Cawayan, Masbate; four more were arrested.———\n* February 18 – Two alleged NPA rebels were killed in separate military operations in Borongan, Eastern Samar and T'Boli, South Cotabato.\n* February 20 – Two soldiers of the 31st IB of the Philippine Army, part of the augmentation force in the search operations for victims of a plane crash on Mayon volcano, were shot dead by three NPAs in Camalig, Albay.\n* March 1 – Three separate clashes between NPA guerrillas and the 94th IB in Himamaylan, Negros Occidental, in one of the sites of similar incidents in 2022, killed four suspected NPA members and injured a soldier.\n* March 2 – Three NPA rebels were killed in a military encounter in Senator Ninoy Aquino, Sultan Kudarat.\n* March 9 and 15 – Two insurgents were killed in separate encounters between the military and the NPA in Balbalan, Kalinga.\n* March 11:\n** Three NPA rebels were killed in an encounter against joint law enforcement groups in Pikit, Cotabato.\n** Two NPA members were killed by combined law enforcement elements in Datu Saudi Ampatuan, Maguindanao del Sur.\n* March 19 – An NPA member was killed in an encounter in Talakag, Bukidnon.\n* March 20 – An NPA rebel and a soldier were killed in an encounter in Silvino Lobos, Northern Samar.\n* Late March – Series of clashes between the military and NPA rebels occurred in Masbate. On March 20, a soldier was killed in a five-minute encounter in Cawayan; on March 22, encounters following bomb explosions occurred in Placer and Dimasalang.——\n* March 27 and 30 – Series of operations by the Army occurred in a village in Bayugan, Agusan del Sur. On March 27, two ranking NPA leaders in Caraga were killed. Three days later, a secretary of two NPA local committees was also killed.——\n* March 31 – Two clashes erupted between troops of the 80th IB of the 2nd Infantry Division and around 30 NPA rebels in the vicinity of Wawa Dam, Rizal. A soldier was killed and another two were wounded while the casualties on the rebel side were  undetermined.\n* April 18 – A rebel was killed in a brief gunfight in Moises Padilla, Negros Occidental.\n* April 20 – An encounter between the NPA and government troops occurred in Negros Occidental, beginning in Isabela and continued at the boundary with Binalbagan, the municipality wherein Rogelio Posadas, secretary of the CPP-NPA regional committee in Central Visayas, died.——— In the same province, an alleged NPA member was killed in another encounter in Escalante.\n* April 28 – An NPA rebel was killed in a clash in Canlaon, Negros Oriental.\n* April 30 – The Army's 803rd Infantry Battalion engaged around 40 NPA members in a pre-dawn armed encounter in an upland village in Bobon, Northern Samar, with at least seven suspected rebels killed. A wounded medical officer of the rebels later surrendered in Catarman.———\n* May 1 – An encounter between troops of the 80th Infantry Battalion of the 2nd Infantry Division and approximately 20 NPA rebels occurred in Brgy. Puray, Rodriguez, Rizal. The 30-minute firefight resulted in the withdrawal of the rebels. Casualties on rebel side were undetermined; war materiel were recovered.\n* May 3 – An alleged NPA rebel was killed in an encounter in Himamaylan, Negros Occidental.\n* May 20–21 – The Army's 62nd Infantry Battalion launched combat operations in a village in Moises Padilla, Negros Occidental on May 20, with three separate morning encounters with a number of NPA rebels, five of them were killed.—— Tracking down the retreating rebels at Guihulngan, Negros Oriental the following day, they engaged in another firefight with at least eight NPA rebels, four more were killed.——\n* May 21 – An alleged NPA rebel was killed in a military encounter in Cauayan, Negros Occidental.\n* May 28 – Four NPA rebels were killed in a military encounter in Catarman, Northern Samar.\n*May 30 - Rebel forces ambush a Philippines Army convoy in Barangay Malisbong, Sablayan. None are killed. 11 individuals were charged for terrorism in relation to this attack in February 2023.\n* June 16 – Five NPA rebels were killed in a military operation at Mount Apo-Apo in Butuan. Two more rebels were killed in separate encounters in Claveria, Misamis Oriental and in Malaybalay, Bukidnon.\n* July 7 – An NPA rebel was killed following a series of clashes with the military in Himamaylan, Negros Occidental.\n* July 20 – Two NPA rebels, one of them an alleged leader in central Negros, were killed in a clash with the military in Moises Padilla, Negros Occidental.\n* July 26 – An NPA leader in Northern Mindanao was killed in a military encounter in Gingoog, Misamis Oriental.\n* August 5–6 – Military encounters occurred at Guihulngan, Negros Oriental and during pursuit operations at Moises Padilla, Negros Occidental the following day with an alleged unidentified NPA rebel killed.\n* August 19\n** Four suspected NPA rebels, including its leader, were killed in an encounter with the government troops in San Jacinto, Masbate.\n** An NPA rebel was killed in an encounter in Ragay, Camarines Sur.\n* August 23 – A commanding officer of the CPP–NPA North Central Mindanao Regional Committee was killed in a military encounter in Malaybalay, Bukidnon.\n* August 24, 26 – A government soldier was killed in a military encounter with the NPA in Santa Catalina, Negros Oriental on August 24. Two days later, another encounter came at the same site as the government troops were conducting pursuit operations, killing an unidentified NPA rebel.\n* September 1 – Five members of the Citizen Armed Force Geographical Unit were killed in an encounter with NPA rebels in Tagkawayan, Quezon.\n* September 7 – Six alleged NPA rebels were killed in a series of military encounters in Bilar, Bohol.\n* September 21 – Five NPA members, along with a civilian, were killed in a clash between the Army 47th Infantry Battalion and an NPA regional committee in Kabankalan, Negros Occidental.\n*November 28 –The government and the CPP-NPA said that they would resume peace talks after a six-year hiatus.\n* December 17 – Six rebels and a soldier were killed in a clash between the Army and the NPA in Balayan, Batangas.\n* December 25 – Nine rebels were killed during clashes with the military in Malaybalay, Bukidnon.\n* December 28 – Four rebels, including a guerrilla front leader, were killed during clashes with the military in Sergio Osmeña, Zamboanga del Norte.\n2024\n* January 13 – President Bongbong Marcos announced that the NPA no longer had any active guerrilla fronts in the country.\n* January 31 - NPA claimed to have killed three 80th IBPA troops.\n* February 15 - Rebels of the Roselyn Jean Pell Command - Northern Negros Guerrilla Front killed 55-year old Allan Macasling, who 'created fear' for residents of Toboso. They obtained two guns, bullets, two smartphones, and 'various IDs' from the man, whom they accused of land grabbing and counter-revolution.\n* February 21–22 – Three NPA rebels were killed and four soldiers were injured following a series of encounters in Escalante, Negros Occidental. The military later launched an airstrike.\n* February 23 – According to the Philippine Government, five NPA rebels and a police officer were killed in an encounter between government troops and the NPA in Bilar, Bohol. The CPP disputes this, claiming that there was no military encounter, and that the 5 individuals were captured and then executed by the military.\n* February 27 - Top NPA leader Aprecia Rosete alias \"Bambam\" of the CPP-NPA Western Mindanao Regional Party Committee was killed in an encounter with government forces belonging to the 102nd Infantry Brigade in the village of Malagalad, Dumingag, Zamboanga del Sur; war material recovered.\n* April 4 - A farmer named Marlon Catacio was shot dead by 62nd IB in a false encounter, according to NPA.\n* April 11 - Leonardo Panaligan Command, under instruction of NPA Central Negros' People's Revolutionary Court, awarded death penalty to Danny Boy Bartolome due to his alleged spying for the 62nd IB. NPA fighters seized two smartphones from his home. They had previously expelled him from the local area but due to his not complying with this order, executed him.\n* April 18 - NPA claimed Jose Rapsing Command to have killed two soldiers of the Philippine Army's 96th Infantry Battalion, and 'seriously wounded' two others.\n2025\n*February 12 - The highest ranking NPA leader in Mindanao, Myrna Sularte, is killed in a shootout with the military in Butuan City.\nNotes\nReferences"
    }
  ]
}