{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of banking in Western Australia\n\nThe first commercial bank in Western Australia was created eight years after the establishment of the Swan River Colony in 1829.\nEntries in italics indicate a locally (Western Australian) domiciled operation.\n{|\n|-\n| Early 1830s || Colonial Secretary of Western Australia, Peter Broun, begins a makeshift banking service out of necessity, despite having no training in finance or accounting. It collapses in 1835.\n|-\n| June 1837 || Bank of Western Australia is established by  prominent local businessmen including George Leake as its first chairman\n|-\n| 1841 || Bank of Western Australia is sold to the Bank of Australasia\n|-\n| 1841 || Western Australia Bank is established\n|-\n| 1845 || Original Bank of Western Australia closes\n|-\n| 1855 || Government savings bank opens\n|-\n| 1863 || Post Office Savings Bank opens\n|-\n| 1862 || Perth Building Society opens\n|-\n| 1866 || Branch of National Bank of Australasia opens\n|-\n| 1878 || Branch of Union Bank of Australia opens\n|-\n| 1883 || Branch of Bank of New South Wales opens\n|-\n| 1888 || Branch of Commercial Bank of Australia opens\n|-\n| 1895 || Government of Western Australia establishes the Agricultural Bank of Western Australia\n|-\n| 1927 || Western Australian Bank acquired by Bank of New South Wales\n|-\n| 1945 || Agricultural Bank renamed to Rural & Industries Bank\n|-\n| 1964 || Town & Country Building Society established\n|-\n| 1983 || Western Australian Building Society agrees to merger with the Town & Country Building Society on 27 April 1983\n|-\n| 1987 || Perth Building Society merges with Hotham Building Society to form Challenge Bank\n|-\n| 1990 || Town & Country Building Society acquired by ANZ Bank\n|-\n| 1994 || Rural & Industries Bank renamed Bankwest\n|-\n| 1995 || Challenge Bank acquired by Westpac\n|-\n| 1995 || Bank of Scotland acquired Bankwest, and as part of the sale agreement, offered 49 per cent of the shares in BankWest to the public. BankWest shares listed on the Australian Securities Exchange on 1 February 1996.\n|-\n| 2001 || Halifax merged with Bank of Scotland to form HBOS. HBOS then acquired all the outstanding shares of Bankwest, making it HBOS's wholly owned subsidiary\n|-\n| 2008 || Commonwealth Bank acquires Bankwest from HBOS for $2.1bn, fallout from the 2008 financial crisis\n|}\nReferences\nExternal links\n*[https://web.archive.org/web/20060503170654/http://www.encyclopedia.uwapress.uwa.edu.au/wa_snapshots#b WA SNAPSHOTS - Banking]\n*[http://www.gabr.net.au/biogs/ABE0187b.htm#related 1841 - 1927 Western Australian Bank]"
    }
  ]
}