{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2023 review of Westminster constituencies\n\nThis article covers the timeline of the most recent cycle of the process to redraw the constituency map for the House of Commons, namely the 2023 Periodic Review of Westminster constituencies. The new constituency borders came into law on 29 November 2023. For a summary of the outcome of the review, see 2023 review of Westminster constituencies.\nSummary\nThe process for periodic reviews of parliamentary constituencies in the United Kingdom is governed by the Parliamentary Constituencies Act 1986, as amended by the Parliamentary Voting System and Constituencies Act 2011 and subsequently by the Parliamentary Constituencies Act 2020. This review was the successor to the 2018 periodic review of Westminster constituencies, which was ultimately abandoned after it failed to pass into law. After abandonment of the previous reviews since 2015, the review is set to be the first review based on electoral registers drawn up using Individual Electoral Registration which Parliament approved  from 2014–15, an anti-fraud and personally empowering system in place in most of the world, replacing household registration condemned by the worldwide Office for Democratic Institutions and Human Rights\n(OSCE/ODIHR). By every, routine, local government canvass reaching slightly fewer imminent attainers of the age of 18 effectively than the old system of household registration a small group of LSE experts have blogged, this change very marginally favours the Conservatives. Local election offices are funded to implement mitigating measures to minimise any such disproportionate impacts.  The Command Papers were sponsored and ordered by a Deputy Prime Minister, Nick Clegg, a Liberal Democrat.\nUnder current legislation, the four Boundary Commissions of the United Kingdom were required to report on their next review of the boundaries of parliamentary constituencies before 1 July 2023. In order to meet this deadline, the Commissions began their work on 5 January 2021. Following three rounds of public consultation, all four Commissions submitted their final proposals to the Speaker of the House of Commons on 27 June 2023. The Speaker immediately laid these before Parliament and the reports were published on the respective Commissions' websites the following day. The new boundaries were formally introduced into UK law on 15 November 2023 through The Parliamentary Constituencies Order 2023. (The original deadline of the end of October was missed by the government, which, according to the Act, must only happen in exceptional circumstances).\nPrevious reviews\nThe 2013 periodic review of Westminster constituencies was launched by the Parliamentary Voting System and Constituencies Act 2011. The process began in 2011 and was intended to be completed by 2013, but a January 2013 vote in the House of Commons temporarily stopped the process. The 2018 periodic review of Westminster constituencies commenced following the 2015 general election and the four Boundary Commissions submitted their final recommendations to the Secretary of State on 5 September 2018 and made their reports public a week later. Leader of the House of Commons Andrea Leadsom told the House on 13 September 2018 that \"it will be some time\" before the necessary statutory instruments would be put forward for approval by both the Commons and the Lords. The proposals were never put forward for approval before the calling of the general election held on 12 December 2019, and in December 2020 the reviews were formally abandoned under the Schedule to the Parliamentary Constituencies Act 2020.\nProposed changes\nThe Government's policy position regarding the process for the 2023 review was confirmed in a written statement, entitled Strengthening Democracy, by Minister of State for the Cabinet Office Chloe Smith on 24 March 2020. Smith confirmed in her written statement that primary legislation would be brought forward to remove the legal requirement to give effect to the recommendations of the Sixth Review and set the framework for future boundary reviews.\nThe main proposals in the statement were as follows:\n;Maintaining 650 seats\n:Under the legislation which governed the unimplemented 2018 Boundary Review recommendations, the number of constituencies was to be reduced from 650 to 600. It was proposed that this be retained at 650, on the grounds that Parliament had a greater workload following the UK's departure from the European Union.\n;Electoral quota tolerance\n:It was proposed to maintain the current tolerance of ±5% from the average size of constituencies (the \"electoral quota\").\n;Protected constituencies\n:It was initially proposed that there would be no change to the four protected constituencies of Isle of Wight (divided into two seats), Na h-Eileanan an Iar (the Western Isles of Scotland) and Orkney and Shetland (the Northern Isles of Scotland), which are protected from the electoral quota due to their unique geography. However, during the passage of the legislation, an amendment was introduced to add Ynys Môn (the Isle of Anglesey in Wales), increasing the number of protected constituencies to five.\n;Boundary review cycle\n:It was proposed that reviews be carried out every eight years, rather than the pre-2020 requirement of five years.\n;Implementation of recommendations\n:Under the law as it existed prior to 2020, the final proposals of the Boundary Commissions were brought into effect through an Order in Council that had to be approved by Parliament. It was proposed that the Order in Council should no longer require parliamentary approval.\nLegislation\nA bill was introduced on 19 May 2020 to reflect the written statement and it received its Second Reading on 2 June 2020. The Parliamentary Constituencies Act 2020 received royal assent on 14 December 2020. The Act amends the regulations underpinning the  boundary review process, including the Parliamentary Constituencies Act 1986, Northern Ireland Act 1998, Boundary Commissions Act 1992 and Parliamentary Voting System and Constituencies Act 2011.\nCommencement of reviews\nThe four Boundary Commissions formally launched their 2023 reviews on 5 January 2021, to coincide with the release by the Office for National Statistics (ONS) of electorate data from analysis of the electoral registers that had been published on 2 March 2020. The commissions jointly calculated the relevant electoral quota/range to be used for the 2023 review and the allocation of parliamentary constituencies between the four nations. The English commission further divided its allocation between the nine regions of England.\nSize of constituencies\nThe electorate of the United Kingdom, comprising 650 constituencies, as determined by the ONS, was 47,558,398 on 2 March 2020. The electorate of the five protected constituencies – Isle of Wight (two seats), Na h-Eileanan an Iar, Orkney and Shetland, and Ynys Môn – amounted to 220,132, leaving 47,338,266 to be distributed between the remaining 645 constituencies, which gave an electoral quota of 73,393. Each non-protected constituency must have an electorate which is within 5% of this quota, which gave a permitted range of 69,724 to 77,062. In Northern Ireland the legislation allows for a wider range, in certain prescribed circumstances, from 68,313 to 77,062.\nOf the 646 unprotected constituencies (Isle of Wight currently has only one seat), 236 had electorates within the permitted range, while 203 were below and 207 were above.\nThe regional distribution of these seats is shown in the following table.\n{| class=\"wikitable sortable\"\n!Region/Nation\n!Below range\n!Within range\n!Above range\n!Total seats\n|-\n|Eastern\n| align=\"center\" |7\n|align = \"center\" |25\n|align = \"center\" |26\n|align = \"center\" |58\n|-\n|East Midlands\n| align=\"center\" |7\n|align = \"center\" |17\n|align = \"center\" |22\n|align = \"center\" |46\n|-\n|London\n| align=\"center\" |20\n|align = \"center\" |20\n|align = \"center\" |33\n|align = \"center\" |73\n|-\n|North East\n| align=\"center\" |21\n|align = \"center\" |6\n|align = \"center\" |2\n|align = \"center\" |29\n|-\n|North West\n| align=\"center\" |28\n|align = \"center\" |33\n|align = \"center\" |14\n|align = \"center\" |75\n|-\n|South East *\n| align=\"center\" |2\n|align = \"center\" |37\n|align = \"center\" |44\n|align = \"center\" |83\n|-\n|South West\n| align=\"center\" |7\n|align = \"center\" |23\n|align = \"center\" |25\n|align = \"center\" |55\n|-\n|West Midlands\n| align=\"center\" |25\n|align = \"center\" |26\n|align = \"center\" |8\n|align = \"center\" |59\n|-\n|Yorkshire and the Humber\n| align=\"center\" |16\n|align = \"center\" |22\n|align = \"center\" |16\n|align = \"center\" |54\n|-\n!England\n!133\n!209\n!190\n!532\n|-\n|Northern Ireland\n| align=\"center\" |6\n|align = \"center\" |8\n|align = \"center\" |4\n|align = \"center\" |18\n|-\n|Scotland\n| align=\"center\" |27\n|align = \"center\" |18\n|align = \"center\" |12\n|align = \"center\" |57\n|-\n|Wales\n| align=\"center\" |37\n|align = \"center\" |1\n|align = \"center\" |1\n|align = \"center\" |39\n|-\n!Total\n!203\n!236\n!207\n!646\n|}\nDistribution of seats\nUnited Kingdom\nThe 650 constituencies were allocated between the four nations of the UK in accordance with the method of allocation specified by the legislation as shown in the table below.\n{| class=\"wikitable sortable\"\n! rowspan=\"2\" |Nation\n! rowspan=\"2\" |Current seats(2010–2019)\n! colspan=\"3\" |Unprotected seats\n! colspan=\"2\" |Protected seats\n! colspan=\"3\" |Total\n|-\n!Electorate\n!Allocation\n!Average size\n!Electorate\n!Allocation\n!Electorate\n!Allocation\n!Change\n|-\n|England\n|align = \"center\" |533\n|align = \"center\" |39,748,705\n|align = \"center\" |541\n|align = \"center\" |73,473\n|align = \"center\" |111,716\n|align = \"center\" |2\n|align = \"center\" |39,860,421\n|align = \"center\" |543\n|align = \"center\" |+10\n|-\n|Northern Ireland\n|align = \"center\" |18\n|align = \"center\" |1,295,688\n|align = \"center\" |18\n|align = \"center\" |71,983\n|align = \"center\" |-\n|align = \"center\" |-\n|align = \"center\" |1,295,688\n|align = \"center\" |18\n|align = \"center\" |-\n|-\n|Scotland\n|align = \"center\" |59\n|align = \"center\" |4,023,611\n|align = \"center\" |55\n|align = \"center\" |73,157\n|align = \"center\" |56,001\n|align = \"center\" |2\n|align = \"center\" |4,079,612\n|align = \"center\" |57\n|align = \"center\" |-2\n|-\n|Wales\n|align = \"center\" |40\n|align = \"center\" |2,270,262\n|align = \"center\" |31\n|align = \"center\" |73,234\n|align = \"center\" |52,415\n|align = \"center\" |1\n|align = \"center\" |2,322,677\n|align = \"center\" |32\n|align = \"center\" |-8\n|-\n!Total\n!650\n!47,338,266\n!645\n!73,393\n!220,132\n!5\n!47,558,398\n!650\n!-\n|}\nRegions of England\nThe Commission for England applied the same distribution formula to the English allocation, which results in the following redistribution of constituencies among the English regions:\n{| class=\"wikitable sortable\"\n!Region\n!Current seats(2010–2019)\n!Electorate\n!Allocation\n!Change\n!Average size\n|-\n|East of England\n|align = \"center\" |58\n|align = \"center\" |4,482,127\n|align = \"center\" |61\n|align = \"center\" |+3\n|align = \"center\" |73,477\n|-\n|East Midlands\n|align = \"center\" |46\n|align = \"center\" |3,481,126\n|align = \"center\" |47\n|align = \"center\" |+1\n|align = \"center\" |74,067\n|-\n|London\n|align = \"center\" |73\n|align = \"center\" |5,550,454\n|align = \"center\" |75\n|align = \"center\" |+2\n|align = \"center\" |74,006\n|-\n|North East\n|align = \"center\" |29\n|align = \"center\" |1,952,999\n|align = \"center\" |27\n|align = \"center\" |−2\n|align = \"center\" |72,333\n|-\n|North West\n|align = \"center\" |75\n|align = \"center\" |5,381,549\n|align = \"center\" |73\n|align = \"center\" |−2\n|align = \"center\" |73,720\n|-\n|South East *\n|align = \"center\" |83\n|align = \"center\" |6,522,802\n|align = \"center\" |89\n|align = \"center\" |+6\n|align = \"center\" |73,290\n|-\n|South West\n|align = \"center\" |55\n|align = \"center\" |4,242,136\n|align = \"center\" |58\n|align = \"center\" |+3\n|align = \"center\" |73,140\n|-\n|West Midlands\n|align = \"center\" |59\n|align = \"center\" |4,169,012\n|align = \"center\" |57\n|align = \"center\" |−2\n|align = \"center\" |73,141\n|-\n|Yorkshire and the Humber\n|align = \"center\" |54\n|align = \"center\" |3,966,500\n|align = \"center\" |54\n|align = \"center\" |—\n|align = \"center\" |73,454\n|-\n!Unprotected seats\n!532\n!39,748,705\n!541\n!+9\n!73,428\n|-\n|Isle of Wight\n|align = \"center\" |1\n|align = \"center\" |111,716\n|align = \"center\" |2\n|align = \"center\" |+1\n|align = \"center\" |55,858\n|-\n!Total\n!533\n!39,860,421\n!543\n!+10\n!73,408\n|}\nExcluding Isle of Wight\nComparison with the Fifth Review\nThe current constituency boundaries were largely based on the Fifth Periodic Review of Westminster Constituencies which was carried out by the Boundary Commissions between 2000 and 2007. The Scottish review was completed in time for the 2005 general election, with the other three reviews coming into effect at the 2010 general election. In England, the fifth review was based on the number of electors on the electoral register published in February 2000. The electorates were therefore already 10 years out of date by the time it came into effect, and over 20 years had elapsed between the publication of that register and the start of the 2023 reviews.\nThe table below shows the movements in the national/regional electorates since those used for the fifth review.\n{| class=\"wikitable sortable\"\n!Region/Nation\n!Electorate in 2000\n!Electorate in 2020\n!Absolute% increase\n!Relative% increase\n|-\n|East of England\n| align=\"center\" |4,063,594\n| align=\"center\" |4,482,127\n| align=\"center\" |10.3%\n| align=\"center\" |2.8%\n|-\n|East Midlands\n| align=\"center\" |3,198,214\n| align=\"center\" |3,481,126\n| align=\"center\" |8.8%\n| align=\"center\" |1.4%\n|-\n|London\n| align=\"center\" |4,974,025\n| align=\"center\" |5,550,454\n| align=\"center\" |11.6%\n| align=\"center\" |4.0%\n|-\n|North East\n| align=\"center\" |1,955,336\n| align=\"center\" |1,952,999\n| align=\"center\" | -0.1%\n| align=\"center\" | -6.9%\n|-\n|North West\n| align=\"center\" |5,193,017\n| align=\"center\" |5,381,549\n| align=\"center\" |3.6%\n| align=\"center\" | -3.4%\n|-\n|South East\n| align=\"center\" |6,021,130\n| align=\"center\" |6,634,518\n| align=\"center\" |10.2%\n| align=\"center\" |2.7%\n|-\n|South West\n| align=\"center\" |3,779,970\n| align=\"center\" |4,242,136\n| align=\"center\" |12.2%\n| align=\"center\" |4.6%\n|-\n|West Midlands\n| align=\"center\" |4,023,708\n| align=\"center\" |4,169,012\n| align=\"center\" |3.6%\n| align=\"center\" | -3.5%\n|-\n|Yorkshire and the Humber\n| align=\"center\" |3,786,501\n| align=\"center\" |3,966,500\n| align=\"center\" |4.8%\n| align=\"center\" | -2.4%\n|-\n!England\n!36,995,495\n!39,860,421\n!7.7%\n!0.4%\n|-\n|Northern Ireland\n| align=\"center\" |1,097,450\n| align=\"center\" |1,295,688\n| align=\"center\" |18.1%\n| align=\"center\" |10.0%\n|-\n|Scotland\n| align=\"center\" |3,995,489\n| align=\"center\" |4,079,612\n| align=\"center\" |2.1%\n| align=\"center\" | -4.9%\n|-\n|Wales\n| align=\"center\" |2,225,599\n| align=\"center\" |2,322,677\n| align=\"center\" |4.4%\n| align=\"center\" | -2.8%\n|-\n!Total\n!44,314,033\n!47,558,398\n!7.3%\n!0.0%\n|}\nProspective wards\nThe detailed constituency and ward electorates issued by the ONS were based on the local authority boundaries which were currently effective and did not take account of prospective changes which were to be enacted on 1 December 2020. There were 31 such local authorities in England, of which 16 were London boroughs. The Commission for England  subsequently worked with local authorities to produce updated data which included these 'prospective' wards. A comprehensive list of ward electorates was published on 24 March 2021.\nTimetable\nThe initial outline timetable published by the Commission for England was as follows:\n* 5 January 2021: Begin development of initial proposals.\n* 10 May 2021: Publish Guide to the 2023 Review.\n* 8 June 2021: Publish initial proposals and conduct eight-week written consultation.\n* 22 February 2022: Publish responses to initial proposals and conduct six-week 'secondary consultation', including between two and five public hearings in each region.\n* 8 November 2022: Publish revised proposals and conduct four-week written consultation.\n* 27 June 2023: Submit and publish final report and recommendations.\n* 15 November 2023: Order in Council approved by King Charles III in the Privy Council; the order formally implemented the new boundaries by giving them force of law. (The original deadline of the end of October was missed by the government, which, according to the Act, must only happen in exceptional circumstances).\nInitial proposals\nEngland\nThe Boundary Commission for England published their initial proposals on 8 June 2021. The proposals represent significant changes to the existing boundaries, with just 47 existing constituencies remaining unchanged (just under 10% of existing constituencies). In addition, a further 69 constituencies were unchanged except to realign boundaries with new or prospective local government ward boundaries. Due to the constraints on the size of constituency electorates, it was not always possible to allocate whole numbers of constituencies to individual counties and to avoid crossing county boundaries. Accordingly, each region was divided into sub-regions which comprised a whole number of constituencies.\nThe information in the table below was primarily extracted from the commission's summary sheets for each region.\n{| class=\"wikitable sortable\"\n!Region\n!Totalproposedseats\n!Unchanged\n!Realignedto wardboundaries\n!width=300px class=unsortable|Sub-regions\n!class=unsortable|Comments\n|-\n|East Midlands\n| align=\"center\" |47 (+1)\n| align=\"center\" |5\n| align=\"center\" |6\n|DerbyshireLeicestershireLincolnshire and Rutland (+1)NorthamptonshireNottinghamshire\n|Rutland is currently included with Leicestershire. In Northamptonshire, it was necessary to divide three wards in order to develop a whole number of constituencies within its boundaries.\n|-\n|Eastern\n| align=\"center\" |61 (+3)\n| align=\"center\" |1\n| align=\"center\" |10\n|Bedfordshire and Hertfordshire (+1)Cambridgeshire (+1)Essex and Suffolk (+1)Norfolk\n|\n|-\n|London\n| align=\"center\" |75 (+2)\n| align=\"center\" |2\n| align=\"center\" |10\n|North East LondonNewham and Tower Hamlets (+1)North Central and North West LondonSouth Central and South West London (+1)South East London\n|Considerable changes required, with 31 of the proposed constituencies crossing London borough boundaries, although none cross the River Thames. It was proposed that three wards were divided across London. Among constituencies affected was that of Holborn and St Pancras – held by the Labour leader, Keir Starmer – which would be renamed Kentish Town and Bloomsbury to reflect the changes. The existing Cities of London and Westminster seat would be split between the newly named seats of City of London and Islington South, and Westminster and Chelsea East.\n|-\n|North East\n| align=\"center\" |27 (−2)\n| align=\"center\" |2\n| align=\"center\" | –\n|Newcastle upon Tyne, North Tyneside, and NorthumberlandCounty Durham, South Tyneside, and Sunderland (−1)GatesheadTees Valley (−1)\n|As at present, no constituency crosses the River Tyne within the metropolitan county of Tyne and Wear.\n|-\n|North West\n| align=\"center\" |73 (−2)\n| align=\"center\" |10\n| align=\"center\" |3\n|Cheshire and MerseysideCumbria and Lancashire (−2)Greater Manchester\n|Although Merseyside and Lancashire are in separate sub-regions, a cross-county boundary constituency was proposed which combines a small part of the District of West Lancashire with the town of Southport. There were two proposed constituencies which cross the boundary between Cheshire and Merseyside, which ensures no constituencies cross the River Mersey below Warrington. It was proposed that three wards were divided – one each in Cumbria, Manchester and Wirral.\nIn the Wirral, the constituency of Wirral South would be broken up and divided between enlarged Birkenhead and Wirral West seats, with two wards being included in a new Ellesmere Port seat, which is mostly in Cheshire. As a consequence, the City of Chester constituency, which has been in existence since the 16th century, would be changed, with the majority of the seat forming Chester North and Neston.\n|-\n|South East\n| align=\"center\" |91 (+7)\n| align=\"center\" |13\n| align=\"center\" |3\n|Berkshire, Hampshire, and Surrey (+2)Buckinghamshire (+1)Sussex (+1)Isle of Wight (+1)Kent (+1)Oxfordshire (+1)\n|It was proposed that three wards were divided across the region.\n|-\n|South West\n| align=\"center\" |58 (+3)\n| align=\"center\" |3\n| align=\"center\" |12\n|Avon, Somerset, and Devon (+2)CornwallDorsetGloucestershire and Wiltshire (+1)\n|It was possible to avoid a so-called \"Devonwall\" constituency, straddling Devon and Cornwall. However, considerable changes were required in Avon, Somerset and Devon. One ward was divided in the city of Plymouth to keep changes elsewhere to a minimum.\n|-\n|West Midlands\n| align=\"center\" |57 (−2)\n| align=\"center\" |9\n| align=\"center\" |12\n|HerefordshireShropshireWorcestershireWarwickshireCoventryBirmingham and SolihullStaffordshire and the Black Country (−2)\n|Two wards were divided in the City of Birmingham, with parts of both being included in the constituency of Birmingham Selly Oak. One ward is divided in the Black Country.\n|-\n|Yorkshire and the Humber\n| align=\"center\" |54 (-)\n| align=\"center\" |2\n| align=\"center\" |13\n|Humberside and South Yorkshire (−1)North Yorkshire and West Yorkshire (+1)\n|It was necessary to divide a ward in each of the cities of Leeds and Sheffield and in the borough of Kirklees due to the large ward electorates in these metropolitan boroughs. The seat of Elmet and Rothwell was split up, with Rothwell being included in a reconfigured Wakefield constituency and remaining areas comprising parts of two proposed constituencies which span the county boundary between North Yorkshire and West Yorkshire. Don Valley would be replaced by Doncaster East and Axholme, which spans the boroughs of Doncaster and North Lincolnshire.\n|-\n!Total\n!543\n!47\n!69\n!\n!\n|}\nNorthern Ireland\nInitial proposals were published on 20 October 2021. As the number of constituencies in Northern Ireland remains the same, changes were only necessary to bring some of the electorates within the permitted range and align boundaries with those of revised local government wards. Belfast South would be enlarged into the countryside and renamed 'Belfast South and Mid Down'. East Antrim would be extended further west, while Fermanagh and South Tyrone would be extended further east into County Armagh.\nScotland\nThe Boundary Commission for Scotland released its initial proposals on 14 October 2021.\nThe following table details the proposed changes, based on the commission's press release.\n{| class=\"wikitable\"\n|+ Proposed constituencies\n|-\n! Region !! Number of constituencies !! Number unchanged !! Comments\n|-\n| Aberdeen City, Aberdeenshire, Argyll and Bute, Highland, and Moray || 9 (−1) || 1 || The two Aberdeen City constituencies were realigned to ward boundaries, except near Rosemount. Argyll and Bute was renamed Argyll and expanded northward. Gordon was expanded westward and renamed Gordon and Moray South. Highland is divided into three constituencies, with part of Moray centred on Elgin included in a Highland constituency.\n|-\n| Angus, Clackmannanshire, Dundee City, Falkirk, Fife, Perth and Kinross, Stirling, and West Lothian || 13 (-) || 1 || Dundee's east–west split was maintained and largely aligned with ward boundaries. Parts of Angus were added to Dundee East (renamed Dundee East and Arbroath). In Falkirk, Bo'ness was added to Linlithgow and East Falkirk, while Whitburn was added to Livingston in West Lothian. Stenhousemuir and its vicinity were added to Clackmannanshire council area in a proposed Mid Forth Valley constituency. Angus was renamed Angus and Strathmore and added Blairgowrie in Perth and Kinross.\n|-\n| Dumfries and Galloway, East Dunbartonshire, North Lanarkshire, Scottish Borders, South Lanarkshire, and West Dunbartonshire || 12 (-) || 0 || The boundaries in Dumfries and Galloway and Scottish Borders remained largely unchanged. East Dunbartonshire and part of North Lanarkshire were split between two constituencies. The remainder of North Lanarkshire was added to South Lanarkshire constituencies. The West Dunbartonshire council area received its own constituency, along with part of Yoker (in Glasgow).\n|-\n| City of Edinburgh, East Lothian, and Midlothian || 7 (-) || 2 || The majority of the boundary changes occurred with the City of Edinburgh, but all constituency names remained the same. In East Lothian, part of Musselburgh was added to the Edinburgh East constituency. The present constituency of East Lothian was to be renamed East Lothian Coast and contains the remainder of the council area.\n|-\n| East Ayrshire, North Ayrshire, and South Ayrshire || 4 (-) || 4 || The four constituencies within this region remained unchanged.\n|-\n| East Renfrewshire || 1 (-)|| 1 || The council area continued to have its own constituency.\n|-\n| Glasgow City, Inverclyde, and Renfrewshire || 9 (−1) || 1 || The constituencies in this area were nearly completely reorganized. Six constituencies exist wholly within Glasgow. Glasgow North West saw the least change but was renamed Glasgow West. Yoker in Glasgow was added to West Dunbartonshire. The Inverclyde constituency was expanded to include Bridge of Weir and Houston in Renfrewshire, while Cardonald in Glasgow was added to Renfrew North (renamed from Paisley and Renfrewshire North). Paisley and Renfrewshire South was renamed Renfrew South.\n|-\n| Na h-Eileanan an Iar and Orkney and Shetland || 2 || 2 || These constituencies remained protected by UK law.\n|}\nWales\nInitial proposals for constituencies in Wales were published on 8 September 2021, reducing Wales' constituencies by 8, from 40 to 32.\nApart from the protected constituency of Ynys Môn, no constituencies were unchanged. The table below summarises the relationship between the remaining current constituencies and the initial proposals.\n{| class=\"wikitable mw-collapsible\"\n!width=200|Current constituency\n!width=220|Initial proposed constituency\n|-\n! colspan=\"2\" style=\"background:#FFFFCC\"|Expanded constituencies – containing an entire current constituency and parts of adjoining constituencies\n|-\n|Aberconwy\n|Aberconwy\n|-\n|Alyn and Deeside\n|Alyn and Deeside\n|-\n|Blaenau Gwent\n|Blaenau Gwent and Rhymney\n|-\n|Brecon and Radnorshire\n|Brecon and Radnor\n|-\n|Ceredigion\n|Ceredigion Preseli\n|-\n|Cardiff Central\n|Cardiff Central\n|-\n|Cardiff North\n|Cardiff North\n|-\n|Cardiff West\n|Cardiff West\n|-\n|Dwyfor Meirionnydd\n|Dwyfor Meirionnydd\n|-\n|Llanelli\n|Llanelli\n|-\n|Montgomeryshire\n|Montgomeryshire and Glyndŵr\n|-\n|Rhondda\n|Rhondda\n|-\n|Torfaen\n|Torfaen\n|-\n|Wrexham\n|Wrexham\n|-\n| colspan=\"2\" |\n|-\n! colspan=\"2\"  style=\"background:#FFFFCC\"|Redefined constituencies – containing a majority of at least one constituency and parts of adjoining constituencies\n|-\n|Aberavon\n|Aberafon Porthcawl1\n|-\n|Caerphilly\n|Newport West and Caerphilly\n|-\n|Cardiff South and Penarth\n|Cardiff South and Penarth\n|-\n|Carmarthen East and Dinefwr\n|Caerfyrddin\n|-\n|Clwyd West\n|Clwyd\n|-\n|Delyn\n|Delyn\n|-\n|Gower\n|Swansea West and Gower\n|-\n|Islwyn\n|Islwyn\n|-\n|Merthyr Tydfil and Rhymney\n|Merthyr Tydfil and Aberdare\n|-\n|Monmouth\n|Monmouthshire\n|-\n|Neath\n|Swansea East and Neath\n|-\n|Newport East\n|Newport East\n|-\n|Ogmore\n|Bridgend1\n|-\n|Pontypridd\n|Pontypridd\n|-\n|Preseli Pembrokeshire\n|Mid and South Pembrokeshire\n|-\n|Swansea East\n|Swansea Central and North\n|-\n|Vale of Glamorgan\n|Vale of Glamorgan2\n|-\n| colspan=2 |\n|-\n! colspan=2  style=\"background:#FFFFCC\"|Abolished constituencies – split between two or more proposed constituencies\n|-\n|Arfon\n| rowspan=\"8\" |Not applicable\n|-\n|Bridgend1\n|-\n|Carmarthen West and South Pembrokeshire\n|-\n|Clwyd South\n|-\n|Cynon Valley\n|-\n|Newport West\n|-\n|Swansea West\n|-\n|Vale of Clwyd\n|}\nNotes:\n1 The proposed constituency of Bridgend contained the majority of the current constituency of Ogmore and a minority of the current constituency of Bridgend (including the town of Bridgend). The current constituency was effectively abolished, with the majority being included in the proposed constituency of Aberafon Porthcawl.\n2 The proposed constituency of Vale of Glamorgan contained the majority of the existing constituency, but no part of any other constituency.\nPolitical impact\nAccording to analysis carried out in October 2021 by electoral modelling consultancy Electoral Calculus, a total of 28 constituencies would disappear (i.e. be broken up and not form the larger part of any proposed seats), offset by 28 wholly new constituencies (proposed seats which do not contain the larger part of any pre-existing seat). If the 2019 general election was re-run under the boundaries in the initial proposals, it was estimated that a further 23 seats would change hands. The overall effect would be a net gain of 13 seats for the Conservatives, a net loss of 8 for Labour, a loss of 3 for the Liberal Democrats and 2 for Plaid Cymru. This was further analysed as follows:\n{| class=\"wikitable\"\n! rowspan=\"2\" |Party\n! rowspan=\"2\" |New seats\n! rowspan=\"2\" |Abolishedseats\n! colspan=\"2\" |Seats changing hands\n! rowspan=\"2\" |Total\n|-\n!Gain\n!Loss\n|-\n|Conservative\n|align = \"center\" |+21\n|align = \"center\" |−15\n|align = \"center\" |+14\n|align = \"center\" |−7\n|align = \"center\" |+13\n|-\n|Labour\n|align = \"center\" |+7\n|align = \"center\" |−9\n|align = \"center\" |+6\n|align = \"center\" |−12\n|align = \"center\" |−8\n|-\n|Liberal Democrat\n|align = \"center\" | –\n|align = \"center\" | -1\n|align = \"center\" | –\n|align = \"center\" | -2\n|align = \"center\" |−3\n|-\n|Scottish National\n|align = \"center\" | –\n|align = \"center\" | −2\n|align = \"center\" | +3\n|align = \"center\" | −1\n|align = \"center\" |0\n|-\n|Plaid Cymru\n|align = \"center\" | –\n|align = \"center\" | −1\n|align = \"center\" | –\n|align = \"center\" | −1\n|align = \"center\" |−2\n|-\n|Total\n|align = \"center\" |+28\n|align = \"center\" |−28\n|align = \"center\" |+23\n|align = \"center\" |−23\n|align = \"center\" |–\n|}\nConsultation on initial proposals\nThe publication of the initial proposals by each of the Boundary Commissions was followed by eight-week consultation periods. In total, over 36,000 comments were received. The Commissions subsequently published these comments on their respective web sites and further six-week secondary consultation periods were then held, giving the opportunity for observations to be made on the comments made in the initial consultations. In addition, a total of 45 public hearings were conducted.\n{| class=\"wikitable\"\n!Nation\n!Initial 8-week consultation\n!No. of comments\n!Secondary 6-week consultation\n!No. of public hearings\n|-\n|England\n|8 June 2021 – 2 August 2021\n|Over 34,000\n|22 February 2022 – 4 April 2022\n|32\n|-\n|Northern Ireland\n|20 October 2021 – 15 December 2021\n|31\n|9 February 2022 – 23 March 2022\n|3\n|-\n|Scotland\n|14 October 2021 – 8 December 2021\n|1,105\n|10 February 2022 – 23 March 2022\n|5\n|-\n|Wales\n|8 September 2021 – 3 November 2021\n|1,211\n|17 February 2022 – 30 March 2022\n|5\n|}\nRevised proposals\nEngland\nThe Commission for England published revised proposals on 8 November 2022, followed by a third and final, four-week, consultation period ending on 5 December. After receiving over 45,000 comments over the previous two consultation periods, the Commission revised nearly half the proposed constituencies put forward in its initial review (including name changes). Of the 225 constituencies whose boundaries were revised, 90 have revised names. A further 34 constituencies changed names only. 55 of the 124 name changes reverted to the current constituency names, either because the revised constituency boundaries were more closely aligned with the current boundaries, or because local residents objected to the new names put forward by the commission. More extensive use of divided wards was included in the revised proposals, totalling 47, compared to 19 in the initial proposals. This enabled more communities to be kept together in one constituency and also meant that constituencies in some areas could more closely follow the existing configurations, resulting in fewer voters moving between seats.\nThe information in the table below was primarily extracted from the commission's summary sheets for each region.\n{| class=\"wikitable sortable\"\n!\n!\n! colspan=\"3\" |Compared to initial proposals\n! colspan=\"2\" |Compared to existing seats\n!\n|-\n!width=100|Region\n!width=70|Totalproposedseats\n!width=70|Revisedboundaries\n!width=70|Revisednames\n!width=70|Splitwards\n!width=70|Unchanged\n!width=70|Realignedto wardboundaries\n!class=unsortable|Comments\n|-\n|East Midlands\n| align=\"center\" |47 (+1)\n| align=\"center\" |19\n| align=\"center\" |7\n| align=\"center\" |6\n| align=\"center\" |6\n| align=\"center\" |7\n|Leicestershire now combined with Lincolnshire and Rutland as a sub-region. This enabled less disruption to the current configuration of constituencies in Leicestershire, with three seats wholly within the city of Leicester, incorporating one split ward. No revisions in Derbyshire and only minor ones elsewhere, including an additional split ward in Northamptonshire and one in Nottinghamshire.\n|-\n|Eastern\n| align=\"center\" |61 (+3)\n| align=\"center\" |28\n| align=\"center\" |9\n| align=\"center\" |2\n| align=\"center\" |3\n| align=\"center\" |15\n|Suffolk now combined with Norfolk as a sub-region, instead of Essex. This resulted in revisions to most of the seats in these three counties, with a cross-county boundary seat between Norfolk and Suffolk (Waveney Valley), rather than between Essex and Suffolk (Haverhill and Halstead). Two split wards in Essex. No boundary revisions to any proposed seats across the rest of the region.\n|-\n|London\n| align=\"center\" |75 (+2)\n| align=\"center\" |43\n| align=\"center\" |32\n| align=\"center\" |6\n| align=\"center\" |3\n| align=\"center\" |7\n|The North Central and North West London sub-region was divided into two separate sub-regions, as was the South Central and South West London sub-region. This resulted in extensive revisions to the initial proposals in these areas, producing new constituencies more closely aligned to the current ones. Limited changes in the other sub-regions, with two additional split wards in the borough of Havering and one in the borough of Bromley.\n|-\n|North East\n| align=\"center\" |27 (−2)\n| align=\"center\" |17\n| align=\"center\" |12\n| align=\"center\" |4\n| align=\"center\" |2\n| align=\"center\" | 2\n|Gateshead no longer treated as a separate sub-region and added to the County Durham, South Tyneside, and Sunderland sub-region. Major revisions throughout Tyne and Wear, and County Durham, including four split wards, resulting in more coherent constituencies, especially in the city of Sunderland.\n|-\n|North West\n| align=\"center\" |73 (−2)\n| align=\"center\" |32\n| align=\"center\" |17\n| align=\"center\" |7\n| align=\"center\" |13\n| align=\"center\" |5\n|No change to sub-regions. Major revisions in Cumbria, East Lancashire, and the city of Manchester/borough of Tameside. Four additional split wards, including two in the borough of Wigan to minimise the changes necessary to constituencies in this area.\n|-\n|South East\n| align=\"center\" |91 (+7)\n| align=\"center\" |27\n| align=\"center\" |19\n| align=\"center\" | 7\n| align=\"center\" |15\n| align=\"center\" |3\n|No change to sub-regions. Major revisions in West Sussex, including two split wards, to align boundaries more closely to those of existing seats. A ward was split in Brighton and Hove, rather than swapping whole wards between the two Brighton seats. Minor revisions elsewhere in the region.\n|-\n|South West\n| align=\"center\" |58 (+3)\n| align=\"center\" |25\n| align=\"center\" |11\n| align=\"center\" |2\n| align=\"center\" |1\n| align=\"center\" |11\n|No change to sub-regions. Limited revisions, most extensively in the Gloucestershire and Wiltshire sub-region, including a split ward in the borough of Swindon.\n|-\n|West Midlands\n| align=\"center\" |57 (−2)\n| align=\"center\" |11\n| align=\"center\" |7\n| align=\"center\" |6\n| align=\"center\" |9\n| align=\"center\" |10\n|No change to sub-regions. Only major revisions were in the boroughs of Sandwell and Walsall. An additional split ward in Birmingham and one in Staffordshire.\n|-\n|Yorkshire andthe Humber\n| align=\"center\" |54 (-)\n| align=\"center\" |23\n| align=\"center\" |10\n| align=\"center\" |7\n| align=\"center\" |2\n| align=\"center\" |12\n|No change to sub-regions. Major realignment of boundaries in East Yorkshire, aided by a split ward. An additional split ward in each of the metropolitan boroughs of Bradford, Calderdale and Kirklees, for more equal numbers (totals) of electors.\n|-\n!Total\n!543\n!225\n!124\n!47\n!54\n!72\n!\n|}\nNorthern Ireland\nThe Commission for Northern Ireland published revised proposals for consultation on 14 November 2022.\nMinor amendments were made to eight of the 18 constituencies, making more use of divided wards to minimise the changes necessary to the current configuration of constituencies. As a result of the revisions, the proposed name of the Strangford and Quoile constituency reverted to its current name of Strangford.\nScotland\nThe Commission for Scotland also published revised proposals for consultation from 8 November to 5 December 2022.\nOf the 55 mainland constituencies, 20 were unchanged from the initial proposals, including three with changed names only. Of the 35 revised constituencies, 20 also have revised names. There were no changes to the proposed groupings of council areas, but only the Ayrshire and East Renfrewshire groupings were completely unaffected.\nThe final proposals were announced in June 2023.\nWales\nThe Commission for Wales published revised proposals on 19 October 2022, with comments due no later than 15 November.\nThe Commission revised its initial proposals in terms of their geographical make-up in 22 of the 32 allocated constituencies, and 9 of the proposed constituency names were amended. Most of the adjustments resulted from moving electoral wards between neighbouring constituencies. The most significant change was combining western parts of Newport with the majority of the existing constituency of Islwyn, rather than parts of Caerphilly, on the basis of better local ties, to form Newport West and Islwyn. The existing constituency of Caerphilly is retained with relatively minor changes composed wholly of wards of Caerphilly County Borough Council. There were also some boundary realignments in North Wales.\nPolitical impact\nElectoral Calculus count the revised proposals as being lessened.  Namely four fewer very greatly changed seats (new and/or abolished) (24) and seven fewer seats changing hands, ceteris paribus (all votes cast being identical) (16 of the 650). Overall, compared to the initial proposals, this would map out to three fewer seats won by the Conservative party at the 2019 general election and three fewer lost by the Labour party, the supervening (wider swing in votes) meaning only a net gain of ten for the Conservatives and net loss of five Labour MPs. In November 2022, professors Colin Rallings and Michael Thrasher estimated the Conservatives would have won five additional seats in 2019, with Labour unchanged.\nFinal proposals\nAll four Commissions submitted their Final Recommendations Reports to the Speaker of the House of Commons on 27 June 2023 and they were immediately laid before Parliament. The reports were published on the respective Commissions' websites on 28 June 2023.\nChanges from revised proposals\nIn England, after receiving a further 18,890 representations, 41 constituencies were revised, eight of which also involved a change of name. Most of these were relatively minor boundary changes between two neighbouring seats. In a further 45 constituencies, only the name was changed. This left 457 seats unaltered from the revised proposals published in November 2022. The final recommendations for England result in only 55 of the existing 533 constituencies remaining completely unchanged.\nIn Wales, 21 of the 32 seats were unaltered from the revised proposals; 10 had revised boundaries (of which five were renamed); and one had a name change only. In Scotland boundary changes affected 18 seats, of which 12 were renamed. Only name changes affected a further six, leaving 33 unaltered. In Northern Ireland, minor boundary changes affected five seats, with no changes to the proposed names.\nDetails relating to the final proposals are shown on 2023 review of Westminster constituencies.\nParliamentary approval\nIn accordance with the Parliamentary Constituencies Act, the Order in Council to formally introduce the new boundaries into UK law should have been approved by 28 October 2023 – 4 months after the publication of the final reports, unless \"there are exceptional circumstances\". However, the Order was not given by the Privy Council until 15 November 2023,\nExternal links\n* [https://boundarycommissionforengland.independent.gov.uk/ Boundary Commission for England]\n* [https://www.bcomm-scotland.independent.gov.uk/ Boundary Commission for Scotland]\n* [https://bcomm-wales.gov.uk/ Boundary Commission for Wales]\n* [https://www.boundarycommission.org.uk/ Boundary Commission for Northern Ireland]\n* [https://blogs.lse.ac.uk/politicsandpolicy/constituency-boundaries-the-reform-behind-the-review/ London School of Economics – The Reform Behind the Review], September 2023\nReferences"
    }
  ]
}