{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Burundian history\n\nThis is a timeline of Burundian history, comprising important legal and territorial changes and political events in Burundi and its predecessor states.  To read about the background to these events, see History of Burundi.  See also the list of Kings of Burundi, list of colonial governors of Burundi, and list of presidents of Burundi.\n19th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1858 || || The area was visited by British explorer John Hanning Speke, who became the first European to do so.\n|}\n20th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1903 || || Burundi came under the control of Germany.\n|-\n| 1922 || 20 July || Burundi and Rwanda were joined into the League of Nations mandate of Ruanda-Urundi, governed by Belgium.\n|-\n| 1962 || 1 July || Burundi received independence from Belgium.\n|-\n| 1965 || 15 January || Prime Minister Pierre Ngendandumwe was assassinated by a Rwandan Tutsi.\n|-\n| 1966 || 28 November || Michel Micombero became the first President of Burundi.\n|-\n| 1972 || 27 April || Burundi genocide (1972): A rebellion broke out which led to a genocide against Hutus.\n|-\n| 1976 || 2 November || Jean-Baptiste Bagaza assumed the Presidency of Burundi in a bloodless ''coup d'état.\n|-\n| rowspan=\"2\" valign=\"top\" | 1987 || 3 September || 1987 Burundian coup d'état: Bagaza was deposed while in Canada.\n|-\n| 2 October || Pierre Buyoya was sworn in as President of Burundi.\n|-\n| 1992 || March || Burundi adopted a new constitution.\n|-\n| rowspan=\"2\" valign=\"top\" | 1993 || 2 June || Burundian presidential election, 1993: The Hutu Melchior Ndadaye won the election.\n|-\n| 21 October || Burundi Civil War: Ndadaye was assassinated by Tutsi extremists, starting a genocide against Tutsis and a civil war.\n|-\n| rowspan=\"5\" valign=\"top\" | 1994 || 5 February || Cyprien Ntaryamira took office as President of Burundi.\n|-\n| 6 April || Assassination of Juvénal Habyarimana and Cyprien Ntaryamira: Ntaryamira and Rwandan President Juvénal Habyarimana were shot down as their aircraft approached Kigali.\n|-\n| 8 April || Sylvestre Ntibantunganya was named interim President.\n|-\n| 25 April || An attempted military coup was averted.\n|-\n| 30 September || Ntibantunganya was elected President by a new Convention of Government.\n|-\n| 1995 || 11 March || Mines and Energy Minister Ernest Kabushemeye was eaten by cannibals in Bujumbura.\n|-\n| rowspan=\"2\" valign=\"top\" | 1996 || 21 July || Hutu rebels attacked a refugee camp in the country, killing more than three hundred people.\n|-\n| 25 July || 1996 Burundian coup d'état: Buyoya returned to power.\n}}\n;Sources\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*"
    }
  ]
}