{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Israeli–Palestinian conflict in 2002\n\nNote: This compilation includes only those attacks that resulted in casualties. Attacks which did not kill or wound are not included.\nTimeline\nJanuary\n* 4 January: An Israeli army undercover unit kills a Hamas member in the village of Tal and arrests two others.\n* 9 January: Two Hamas militants wearing Palestinian police uniforms attack an IDF post near the Gaza Strip with grenades and assault rifles. Four Israeli soldiers and one of the attackers are killed.\n* 10 January-11: The Israeli army demolished 59 houses and damaged another 200 in Rafah refugee camp. Over six hundred Palestinians are made homeless.\n* 14 January: The IDF killed Raed al-Karmi, head of Al-Aqsa Martyrs' Brigades (AMB) in Tulkarm. AMB gunmen kill an Israeli soldier near Shavei Shomron.\n* 14 January: Sgt. Elad Abu-Gani, 19, from Tiberias was killed and an officer was injured in a Palestinian ambush near Kuchin, with Fatah claiming responsibility.\n*\n* 15 January: Avraham (Avi) Boaz, 71, an American from Ma'aleh Adumim, was kidnapped at a PA checkpoint in Beit Jala and later found dead in Beit Sahur, Bethlehem. Fatah's Al-Aksa Brigade claimed responsibility.\n* 15 January: Yoela Chen, 45, of Givat Ze'ev, was shot and killed by Palestinian militants near Givat Ze'ev's gas station; her aunt was injured. Responsibility was claimed by Fatah's Al-Aqsa Brigade.\n* 17 January: A gunman kills six and injures 33 in a Bat Mitzvah celebration in Hadera. The Al-Aqsa Martyrs' Brigades claimed responsibility for the attack. Wanted AMB member Khamis Abdallah is killed by the Israeli army in an apparent assassination in Nablus. A Palestinian is killed by shellfire on the Gaza border. Two Preventive Security Force officers are killed when an Israeli F-16 destroyed the Palestinian Authority's main police headquarters in Tulkarem.\n* 18 January: In an apparent assassination, wanted AMB member Faraj Hani Odeh Nazzal is killed in the West Bank.\n* 21 January: A 19-year-old Palestinian was killed and seven wounded in fighting with Israeli forces in the West Bank city of Tulkarm.\n* 22 January: Sarah Hamburger, 79, and Svetlana Sandler, 56, both from Jerusalem, were killed and 40 injured by a Palestinian with an M-16 at a Jerusalem bus stop; the Fatah Al-Aqsa Brigades claimed responsibility.\n* 27 January: Pinhas Tokatli, 81, was killed and over 150 were wounded in a suicide bombing in Jerusalem by a Fatah female suicide bomber armed with over 10 kilos of explosives.\nFebruary\n* 6 February: Miri Ohana, 45, and her daughter Yael, 11, were killed in Moshav Hamra by an armed militant. St.-Sgt. Maj.(res.) Moshe Majos Meconen, 33, also died in the attack. Both Fatah and Hamas claimed responsibility.\n* 8 February: Moranne Amit, 25, from Kibbutz Kfar Hanasi was fatally stabbed in Jerusalem by four young Palestinians.\n* 9 February: Atala Lipobsky, 78, of Ma'ale Ephraim, was shot and killed in an apparent ambush on the Trans-Samaria Highway.\n* 10 February: Lt. Keren Rothstein, 20, and Cpl. Aya Malachi, 18, were killed and four others were injured in a drive-by shooting at the IDF Southern Command base in Be'er Sheva. Hamas claimed responsibility.\n* 14 February: St.-Sgt. Ron Lavie, St.-Sgt. Moshe Peled, both 20, and St.-Sgt. Asher Zaguri, 21, were killed by a mine on the Karni-Netzarim road in the Gaza Strip.\n* 16 February: Two teenagers killed in a suicide bombing in the West Bank. Another teenage girl died from her injuries 11 days later. The PFLP claimed responsibility.\n* 18 February: An Israeli-Arab policeman is killed by a suicide bomber. Fatah (Al-Aqsa) claims responsibility. An Israeli settler woman is and two soldiers trying to assist her are killed in a combined shooting and bombing in the Gaza Strip. The gunman who killed the woman is run over and killed by an Israeli civilian who was driving nearby, who sustained gunshot wounds. Fatah (Al-Aqsa) claims responsibility.\n* 19 February: Palestinian guerillas attacked an army checkpoint at Ein 'Ariq near Ramallah killing six Israeli soldiers. The Al-Aqsa Brigade and Hamas claimed joint responsibility.\n* 20 February: In retaliation of the raid 19 February, Israeli warplanes and helicopter gunships attack structures belonging to the Palestinian Authority. Israeli artillery also attacks Palestinian police checkpoints, and Israeli troops engage in firefights with Palestinians. A total of 16 Palestinians are killed.\n* 26 February: A 15-year-old Palestinian girl, wielding a knife, was shot dead at an Israeli checkpoint near Tulkarm in what appeared to have been a failed attack at that checkpoint.\n* 28 February: Israeli forces stormed the two refugee cams Balata and Jenin between Thursday morning into the early morning hours of Friday around 04:00. News reports state that 2 - 19 people were killed and hundreds were wounded.\nMarch\n* 1 March: IDF soldier Sgt. Ya'acov Avni, 20, from Kiryat Ata, was killed by Palestinian sniper fire in the Jenin refugee camp.\n* 2 March: A suicide bombing attack kills 11 and injures 50 in Beit Yisrael of Jerusalem. Fatah claims responsibility for the attack.\n* 3 March: Palestinian sniper, Tha'ir Kayid Hammad, 22, kills 10 and injures 6 near Ofra, West Bank.\n* 4 March: Six Palestinians, five of them children, were killed in Ramallah when a tank shelled a pickup truck and another vehicle belonging to a suspected Hamas militant. In Jenin, six more Palestinians were killed in a clash with Israeli soldiers. In Rafah refugee camp, two Palestinian gunmen and one civilian was killed and three buildings demolished.\n* 7 March: Five Israeli teenagers were killed and 23 injured when a Hamas gunmen infiltrated the Gush Katif settlement of Atzmona, opening fire and throwing hand grenades at the school and nearby houses. One of those killed sustained third degree burns over 90% of his body after a grenade was thrown through the window of his dorm room. He died of his wounds in the hospital five hours after the attack.\n* 8 March: St.-Sgt. Edward Korol, 20, of Ashdod, was killed by a Palestinian sniper in Tulkarem.\n* 9 March: A Palestinian suicide bombing at Cafe Moment in central Jerusalem killed 11 people killed and injured 54 others.\n* 13 March: Lt. Gil Badihi, 21, from Nataf, died from injuries sustained when he was shot in the head by a Palestinian gunman in Ramallah. He was inside his tank, evacuating infantry personnel at the time.\n* 14 March: An Israeli tank is destroyed by a mine near Netzarim, killing three soldiers and wounding two. DFLP and Fatah claimed responsibility.\n* 17 March: Israeli Noa Auerbach, 18, is critically injured in Kfar Saba by a Palestinian gunman who later dies of her injuries. Two hours later, a suicide bomber attack near an Egged bus no. 22 at the French Hill junction in northern Jerusalem injures 25.\n* 20 March: Seven Israelis killed in a suicide bombing of an Egged bus.\n* 21 March: Three people killed and 86 injured during a suicide bombing on King George Street, central Jerusalem.\n* 27 March: The Passover Massacre: 30 Israelis were killed and 140 wounded when a suicide bomber exploded in the crowded dining room of the Park Hotel in Netanya.\n* 31 March: A suicide bombing in Haifa at the Matza restaurant killed 16 and injured over 40. Hamas claimed responsibility. Victims included Suheil Adawi, Dov Chernobroda, Shimon Koren and his sons Ran and Gal, Moshe Levin, Danielle Menchel, Orly Ofir, Aviel Ron and his children Ofer and Anat, Ya'akov Shani, Adi Shiran, and Daniel Carlos Wegman. Carlos Yerushalmi and Shimon Shiran later died from their injuries.\nApril\n* 3 April: An IDF reserve soldier was killed in Jenin during Operation Defensive Shield.\n* 9 April: Thirteen IDF soldiers were killed and 7 injured in Jenin by Palestinian militants during an ambush. Explosives and gunfire from rooftops were used against them.\n* 10 April: Eight people killed and 22 wounded in a suicide bombing.\n* 12 April: Seven people killed, 104 injured by a woman suicide bomber. The Al-Aqsa Martyrs' Brigades claimed responsibility for the attack.\n* 27 April: Four Israelis killed and seven injured by two Palestinian gunman in Adora, Har Hebron.\n* 29 April: Israeli forces invaded the West Bank town of Hebron and killed nine Palestinians. In the Church of the Nativity in Bethlehem, a Palestinian gunmen was shot dead by Israeli snipers.\n* From 3 April to 12 April: 52 Palestinians, 5-22 of them civilians (sources vary) and 23 Israeli soldiers were confirmed killed in Jenin.\nMay\n* 7 May: 15 people killed and 60 injured in a suicide bombing attack at a gaming center. Hamas claimed responsibility for the attack.\n* 19 May: Three Israelis killed in a suicide bombing attack of Netanya's open-air market.\n* 21 May: One Israeli injured when a bomb explodes Kehilat Katzuvitch Street in northern Tel Aviv.\n* 22 May: Two people (one of them a teenager) are killed in suicide bombing in central Rishon LeZion.\n* 23 May: A Palestinian detonates an IED on the underside of an oil tanker truck at Pi Glilot fuel storage facility station, injuring no one with authorities estimating that the chain reaction explosions would have killed at least 10,000 in the area.\n* 29 May: Two Palestinians were killed by Israeli troops; one in the southern Gaza Strip in Khan Yunis and one gunman belonging to Islamic Jihad in Jenin on the West Bank. Additionally, four homes were blown up and 20 damaged in Rafah.\nJune\n* 5 June: 17 people killed and 43 wounded from a car bomb. The car exploded near the gasoline tank of the bus, causing it to burst into flames. Most of the casualties were soldiers who were on their way to their bases. The Islamic Jihad claimed responsibility for the attack.\n* 6 June: An 18-year-old Israeli student died of gunshot wounds after a shooting attack near Ofra.\n* 8 June: Three Israelis, including a ninth month pregnant woman, were shot dead when gunmen infiltrated the community of Carmei Tzur north of Hebron.\n* 8 June: A militant infiltrated into the Jordan Valley community of Mechora. A woman was murdered and her husband, 30, wounded.\n* 11 June: A 14-year-old girl was killed from a pipe bomb in Herzliya.\n* 18 June: 19 people killed and 74 wounded in a suicide bombing of a bus at the Patt junction. The bomber boarded the bus at the stop in Beit Safafa, an Arab neighborhood opposite Gilo, and almost immediately detonated the large bomb which he carried in a bag stuffed with ball bearings. The blast destroyed the front half of the bus, packed with people on their way to work and schoolchildren.\n* 19 June: Seven killed and 35 injured in a suicide bombing attack on a bus station in northern Jerusalem.\nJuly\n* 16 July:  Nine people (two men, six women, and an infant child) were killed in the 2002 Immanuel bus attack. Two 20-kilo bombs were set off about 200 meters from the town's entrance, damaging the bus's front tires and forcing it off the road. The explosion damaged the bus doors, trapping the passengers inside. The militants then started to shoot at the bus, firing through the unprotected roof and throwing grenades through the narrow upper windows, which are not armored.\n* 17 July: Five people were killed and about 40 injured in a double suicide bombing on Neve Sha'anan Street near the old central bus station in Tel Aviv. The bombs, which were strapped to the waists of the bombers, contained nails and metal shards.\n* 31 July: Nine people, some of them American students, were killed and over 80 wounded when a bomb exploded in the Frank Sinatra cafeteria on the Hebrew University Mt. Scopus campus in Jerusalem.\nAugust\n* 1 August: A 27-year-old Israeli man was found shot in the head at point-blank range and bound, west of Tulkarem, near the Green Line.\n* 4 August: Nine people were killed in the Meron Junction Bus 361 attack. The blast blew off the roof of the bus, which then burst into flames, killing or wounding nearly everyone inside.\n* 5 August: A young Israeli couple were killed when gunmen opened fire on their car. One of their children was wounded in the attack.\n* 10 August:\nSeptember\n* 5 September: A Merkava heavy tank was destroyed by a mine near the Kissufim Crossing, killing 1 soldiers and wounding 3. Popular Resistance Committees claimed responsibility.\n* 18 September: The charred body of a 67-year-old Israeli construction contractor was found near al-Azzariya, a Palestinian village near the settlement of Ma'ale Adummim, east of Jerusalem.\n* 23 September: A man and three of his children were killed and wounded respectively during a shooting in Hebron.\nOctober\n* 8 October: A 51-year-old Israeli was critically wounded in an ambush shooting south of Hebron, dying the next day. Hamas claimed responsibility for the attack.\n* 9 October: Palestinian gunmen shot and wounded four Israelis traveling in a car near Hebron.\n* 10 October: A 71-year-old woman was killed and about 30 people were wounded during a suicide bombing.\n* 21 October: 14 persons were killed when a bus was blown up in a suicide attack by a bomber driving an explosives-laden jeep near the Karkur junction.\n* 27 October: Sonol gas station bombing: Three IDF soldiers were killed and approximately 20 people were wounded.\n* 29 October: A woman and two 14-year-old girls were shot dead by a Palestinian gunman who infiltrated the settlement of Hermesh, north of Tulkarm, in the northern West Bank. A soldier and a resident were wounded in the assault.\nNovember\n* 4 November: Two killed and twenty injured in a Palestinian suicide bombing attack at the Arim shopping mall in Kfar Saba.\n* 6 November: Two Israeli farmers were shot to dead by a Palestinian gunman posing as a worker near Pe'at Sadeh in the southern Gaza Strip.\n* 10 November: Five killed by a Palestinian gunman in the Metzer Kibbutz, near Hadera close to the Green Line.\n* 15 November: 2002 Hebron ambush, where 12 people were killed.\n* 21 November: 11 people killed and about 50 wounded in a suicide bombing attack in Kiryat Menahem.\n* British UNRWA staffer Iain Hook is shot and killed by an Israeli sniper in Jenin.\n* 28 November: 2002 Beit She'an attack: Six Israelis and two militants were killed, and 34 Israelis were wounded. Kenyan hotel bombing: Three Israelis and 10 Kenyans were killed by a car bomb explosion in the lobby of the Israeli-owned Paradise Hotel in Mombasa, Kenya. 21 Israelis and 60 Kenyans were wounded in the attack.\nDecember\n* 20 December: A 40-year-old rabbi was shot and killed on the Kissufim corridor road. The Islamic Jihad claimed responsibility for the attack.\n* 26 December: In Nablus, Israeli troops killed two Palestinians. A Palestinian who had opened fire against a patrol, and a 15-year-old Palestinian boy who was killed in the crossfire. In Tulkarem, one man was killed when he tried to escape arrest. According to Palestinian and Israeli sources he was a member of the Al Aqsa Martyrs Brigade. In Ramallah three Palestinians, one of them a Hamas member, were killed by Israeli troops in separate incidents. In the West Bank village of Qabatiya, Hamza Abu Roub, a top Islamic Jihad leader, was killed while resisting arrest. Four IDF soldiers were wounded in the incident. Thereafter Abu Roub's house was blown up. In the Gaza Strip Israeli troops killed two Hamas members which were attempting an attack on the Netzarim settlement.\n* 27 December: Two IDF soldiers and two yeshiva students were killed in an attack on the Hesder yeshiva (military religious academy) of Otniel.\nSee also\n* Israel-Gaza conflict\nReferences"
    }
  ]
}