{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of plant pathology\n\nPlant pathology has developed from antiquity, but scientific study began in the Early modern period and developed in the 19th century.\nEarly history\n*300–286 BC; Theophrastus, father of botany, wrote and studied diseases of trees, cereals and legumes\n17th century\n*1665; Robert Hooke illustrates a plant-pathogenic fungal disease, rose rust\n*1675; Antony van Leeuwenhoek invents the compound microscope, in 1683 describes bacteria seen with the microscope\n18th century\n*1729; Pier Antonio Micheli observes fungal spores, conducts germination experiments\n*1755; Mathieu Tillet reports on treatment of seeds\n19th century\n*1802; Lime sulfur first used to control plant disease\n*1845–1849; Potato late blight epidemic in Ireland\n*1853; Heinrich Anton de Bary, father of modern mycology, establishes that fungi are the cause, not the result, of plant diseases, publishes \"Untersuchungen uber die Brandpilze\"\n*1858; Julius Kühn publishes \"Die Krankheiten der Kultergewachse\"\n*1865; M. Planchon discovers a new species of Phylloxera, which was named Phylloxera vastatrix.\n*1868–1882; Coffee rust epidemic in Sri Lanka\n*1871; Thomas Taylor publishes the first USDA papers on microscopic plant pathogens\n*1875; Mikhail Woronin identified the cause of clubroot as a \"plasmodiophorous organism\" and gave it the name Plasmodiophora brassicae\n*1876; Fusarium oxysporum f.sp. cubense, responsible for Panama disease, discovered in bananas in Australia\n*1878–1885; Downy mildew of grape epidemic in France\n*1879; Robert Koch establishes germ theory: diseases are caused by microorganisms\n*1882; Lehrbuch der Baumkrankheiten (Textbook of Diseases of Trees), by Robert Hartig, is published in Berlin, the first textbook of forest pathology.\n*1885; Bordeaux mixture introduced by Pierre-Marie-Alexis Millardet to control downy mildew on grape\n*1885; Experimental proof that bacteria can cause plant diseases: Erwinia amylovora and fire blight of apple\n*1886–1898; Recognition of plant viral diseases: Tobacco mosaic virus\n*1889; Introduction of hot water treatment of seed for disease control by J. L. Jensen\n20th century\n*1902; First chair of plant pathology established, in Copenhagen\n*1904; Mendelian inheritance of cereal rust resistance demonstrated\n*1907; First academic department of plant  pathology established at Cornell University\n*1908; American Phytopathological Society founded\n*1910; Panama disease reaches Western Hemisphere\n*1911; Scientific journal Phytopathology founded\n*1923; Lawrence Ogilvie identified the virus that had devastated Bermuda's high-value lily bulb crops.\n*1925; Panama disease reaches every banana-growing country in the Western Hemisphere\n*1951; European and Mediterranean Plant Protection Organization (EPPO) founded\n*1967; Recognition of plant pathogenic mycoplasma-like organisms\n*1971; Theodor Otto Diener discovers viroids, organisms smaller than viruses\nReferences"
    }
  ]
}