{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Russo-Ukrainian war (1 June 2025 – 31 August 2025)\n\nThis timeline of the Russo-Ukrainian war covers the period from 1 June 2025 to 31 August 2025.\nJune 2025\n1 June\nTwelve Ukrainian soldiers were killed and sixty were wounded in a Russian missile attack on the 239th Polygon training ground north of Dnipro. The attack led to the resignation of Major General Mykhailo Drapatyi as Commander of the Ukrainian Ground Forces that same day.\nDuring the night between 31 May and 1 June, Russia launched a large-scale air attack on Ukraine, with 472 drones and seven missiles according to the Ukrainian Air Force.\nAtesh claimed to have destroyed a relay box on the Volnovakha-Mariupol railway in occupied Donetsk Oblast.\nThe Security Service of Ukraine (SBU) conducted Operation Spiderweb which they claimed hit \"more than 40\" Russian aircraft, including A-50s, Tu-95s and Tu-22 M3s at four airbases, including the Belaya air base in Irkutsk Oblast, more than  from the Ukrainian border, following a drone attack launched from within Russia, near each of the affected bases.\nThe number 68 Klimov-Moscow train was derailed when an \"explosion\" collapsed a railway bridge it was travelling on in Bryansk Oblast. According to Bryansk governor Alexander Bogomaz, one passenger was killed while 66 were injured with 47 being hospitalised. Russian senator Andrey Klishas, chair of the Federation Council Committee on constitutional legislation and state construction, blamed Ukraine for the incident. Another bridge explosion in Kursk Oblast led to a train derailment that injured one worker according to the acting governor.\nGeolocated footage showed that Russian forces took the rural settlements of , Dyliivka and Dachne, near Toretsk.\nThe Russian Ministry of Defense claimed that Russian forces captured the villages of Kindrashivka and Oleksiivka in Sumy Oblast.\n2 June\nDeepStateMap.Live reported that Russian forces captured the village of Kostiantynivka in Sumy Oblast.\nRussia and Ukraine held their second round of peace negotiations for 2025 in Istanbul, Turkey.\n3 June\nSix people were killed in a Russian airstrike on Sumy.\nRussian-installed officials claimed that Ukrainian drone strikes on energy infrastructure caused widespread blackouts across Zaporizhzhia and Kherson Oblasts.\nThe SBU carried out an attack on the Crimean Bridge. The attack targeted the underwater supports of the bridge, with the SBU stating that the bridge had been mined over several months by its agents.\nRussian forces claimed to have taken the village of Andriivka in the Sumy direction and the village of Mykolaivka in the Pokrovsk direction.\nZelenskyy appointed Mykhailo Drapatyi to become head of the Ukrainian military's Joint Forces Command. Zelenskyy also removed Colonel Vadym Sukharevsky as commander of the Unmanned Systems Forces and replaced him with Major Robert Brovdi.\nThe SBU arrested a 42-year-old conscript in Kharkiv who was leaking intelligence to Russian forces and planning to defect.\n4 June\nIn the Sumy direction, Russian forces claimed to have taken the settlements of Varachyne and Yablunivka, while geolocated footage confirmed Russian control over Vodolahy.\nUkrainian military intelligence (HUR) said it hacked the Tupolev design bureau's server, stealing some 4.4 gigabytes of data before replacing its webpage with an \"image of an owl clutching a Russian aircraft\".\n5 June\nState Administration, destroyed by bombing on ]]\nFive people were killed in a Russian drone attack in Pryluky, Chernihiv Oblast. The  building in Kherson city was partially destroyed in a Russian airstrike.\nUkrainian missiles struck a base in Klintsy, Bryansk Oblast, destroying an Iskander launcher and damaging two others. According to Astra, 8 Russian soldiers were killed in the attack.\nRussian forces claimed to have developed a FPV drone with a 50&nbsp;kilometre range, using a fibre optic cable spool weighing less than 4 kilograms.\nPoland's Central Investigation Bureau of Police executed a search warrant on a building in the village of Laszki, following a report from concerned locals, finding \"several\" air defence systems and ammunition destined for Ukraine abandoned and unguarded in a warehouse.\nRussian forces claimed to have taken the village of Novokostiantynivka in Sumy Oblast.\n6 June\n's FIRMS detected a fire on 5 June 2025 23:41:00 (UTC) at the \"Progress\" plant, Michurinsk.]]\nSix people were killed in Russian airstrikes on Kyiv.\nAn oil refinery in Engels, Saratov Oblast, caught fire after a drone attack. The local governor reported a fire at an \"industrial enterprise\". The Russian MoD claimed 174 Ukrainian drones intercepted over Crimea and 12 Russian regions. Ukrainian drones also struck the defense plant \"Progress\" in Michurinsk, the fuel depot of the Engels-2 air base, Dyagilevo air base and Bryansk Airport. Russian media channel Astra reported an Mi-8 was destroyed while an Mi-35 was damaged.\nThe Ukrainian Air Force stated that the Russian Aerospace Forces started using Tu-160 bombers to launch cruise missiles due to the loss of Tu-95 bombers from Operation Spider's Web.\nGeolocated footage showed that Russian forces took the village of Andriivka in the Sumy direction and the villages of  and , south of Komar. Russian milbloggers claimed that Russian forces took the village of Novoserhiivka, northeast of Novopavlivka.\nThe National Guard of Russia claimed that it killed a man attempting to target a military site in Ryazan Oblast with an FPV drone.\n7 June\nFive people were killed in Russian airstrikes on Kharkiv, while two others were killed in separate attacks in Kherson. One person was killed in a separate attack in Synelnykove Raion, Dnipropetrovsk Oblast.\nA Russian Su-35 was shot down over Kursk Oblast, according to the Ukrainian Air Force.\nThe Azot Chemical Plant in Novomoskovsk, Tula Oblast was struck by Ukrainian drones. Some eight explosions were heard by locals, a fire broke out and flights to Kaluga Airport were restricted temporarily.\nUkrainian drones struck a bitumen plant in Kstovo, Nizhny Novgorod Oblast, starting a fire of some 200 cubic meters.\nCanada announced an aid package worth US$25.5 million which includes Bison and Coyote armoured vehicles, ammunition, and electronic warfare systems.\n8 June\nRussian Railways' website was shut down by a cyber attack conducted by the HUR.\nUkrainian drones destroyed a Russian Buk-M3 missile system.\nUS President Donald Trump redirected 20,000 anti-drone missiles meant for Ukraine to American forces in the Middle East.\nRussian forces claimed that elements of the 90th Tank Division had entered Dnipropetrovsk Oblast for the first time in an offensive. Major Andrii Kovalev, a spokesman for Ukraine's General Staff denied that Russian forces had any presence in the oblast.\n9 June\nRussia and Ukraine conducted a prisoner exchange as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nFour Ukrainian HIMARS rockets reportedly struck a Russian duty station in Rylsk, Kursk Oblast. The Acting Governor Alexander Khinshtein claimed a \"cultural and recreational center\" was hit by a Ukrainian missile, killing one person in Prigorodnaya Slobodka.\nUkrainian drones struck the Savasleyka air base in Nizhny Novgorod Oblast, reportedly damaging a MiG-31 and a Sukhoi. Ukrainian drones also attacked a factory that produced parts for Shahed drones in Cheboksary. According to Astra a fire broke out and the plant was temporarily closed.\nThe Institute for the Study of War assessed that Russian forces had entered Dnipropetrovsk Oblast.\nGeolocated footage showed that Russian forces took the village of  in eastern Kharkiv Oblast.\n10 June\noffice in Kyiv after the attack]]\nFour people were killed in a Russian missile attack on Kyiv and Odesa. In Kyiv, Boeing’s office was attacked, among other buildings.\nThe governor of Belgorod Oblast claimed that one person was killed in a Ukrainian drone strike on Belgorod city.\nThe Russian Defence Ministry claimed to have shot down 102 Ukrainian drones over several regions. The drones targeted Shahed assembly plants in Nizhnekamsk and Yelabuga. Astra reported locals heard explosions while flights from airports in Nizhnekamsk, St Petersburg and Moscow were canceled temporarily.\nHUR soldiers, with support from other units, ambushed Russian forces near Kupiansk, claiming to have killed 30 Russian soldiers, wounded over 40 and capturing two while destroying various fortifications.\nRussia and Ukraine conducted a second prisoner exchange as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nA Ukrainian military observer reported that Ukrainian forces retook the villages of  and , south of Komar.\n11 June\nThree people were killed in a Russian drone attack on Kharkiv.\nA gunpowder factory in Kotovsk, Tambov Oblast was struck by Ukrainian drones as locals heard \"multiple explosions\" while a large fire broke out. The local governor, Yevgeny Pervyshov, said that the attack did not produce casualties. TASS said the drone attack was repelled, but a fire was caused by \"Russian air defense systems\".\nThe bodies of 1,212 Ukrainian soldiers killed in action were returned by Russia. A few days later, during the identification process in Ukraine, some of these bodies were identified as being the remains of Russian soldiers.\nThe FSB claimed to have arrested an alleged Ukrainian agent on suspicion of plotting to assassinate a Russian war veteran using a car bomb in Veliky Novgorod.\n12 June\nUkrainian drones struck the Rezonit plant producing Russian military equipment in the Zubovo technopark, Moscow Oblast. The governor of Belgorod Oblast claimed that one person was killed in a drone attack in Borisovka.\nRussia and Ukraine conducted a third prisoner exchange as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nAtesh claimed to have killed several Russian soldiers in an attack on a military truck near Melitopol.\nGeolocated footage showed that Russian forces took the village of Hryhorivka, northeast of Siversk in Donetsk Oblast.\n13 June\nThe bodies of 1,200 Ukrainians were returned by Russia as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nThe Russian Defense Ministry claimed that Russian forces took the village of Koptieve, northeast of Pokrovsk and Komar.\nButurlinovka Air Base in Voronezh Oblast was attacked by a Ukrainian drone. Local witnesses reported 15 blasts from within the airbase's perimeter.\n14 June\nUkrainian drones struck the JSC NNK plant in Samara Oblast which produced explosives for the Russian military, and the Nevinnomyssk plant in Stavropol Krai, which made components for \"explosives, ammunition, and rocket fuel\".\nRussia and Ukraine conducted a fourth prisoner exchange as part of an agreement reached during the 2 June peace negotiations in Istanbul. The bodies of 1,200 Ukrainians were also repatriated as part of the agreement.\nThe Ukrainian Sapsan ballistic missile entered serial production.\nA Ukrainian military observer reported that Russian forces retook , south of Komar. Geolocated footage showed that Russian forces took the village of , east of Novopavlivka.\nHUR agents sabotaged a power substation in Kaliningrad by draining the coolant out of the turbine resulting in a fire, causing an estimated over $5 million damage. Several nearby enterprises and military facilities experienced a power outage.\nDmitriy Kurashov's trial commenced in Zaporizhzhia, the first trial involving a Russian soldier killing a Ukrainian POW, Vitalii Hodniuk in January 2024. Ukrainian authorities claimed to have identified the execution of 124 Ukrainian POWs by Russian soldiers.\nA Ukrainian HIMARS strike hit a Russian convoy in Makiivka, Donetsk Oblast. Local sources reported several destroyed buses and “a large number of dead and wounded”.\n15 June\nOne person was killed by Russian shelling in Kherson.\nThe head of Tatarstan claimed that one person was killed in a Ukrainian drone attack in Yelabuzhsky District. The drones struck a Russian drone testing and production factory, according to the Ukrainian General Staff.\nThe bodies of 1,200 Ukrainians were repatriated as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nRussian forces claimed to have taken the village of  in the Sumy direction.\n16 June\nDrones attacked Oryol city, with residents hearing explosions near an oil depot. The local governor claimed that eleven drones were \"intercepted and destroyed\" over Oryol Oblast. In Kursk Oblast, the regional governor claimed that one person was killed in a drone strike in Goncharovka.\nThe bodies of 1,245 Ukrainian soldiers were repatriated as part of an agreement reached during the 2 June peace negotiations in Istanbul. However, Ukraine's Minister of Internal Affairs Ihor Klymenko claimed that some of the remains brought to Ukraine in recent repatriations were actually of Russian soldiers, whether \"intentionally\" or reflecting \"habitual disregard for their own people.\"\nRussian forces claimed to have taken the village of  at the border of Dnipropetrovsk Oblast.\n17 June\nAt least 30 people were killed and 172 injured in a Russian air attack on Kyiv. Two people were killed in a drone attack on Odesa.\nThe FSB claimed to have arrested a man in Kerch on suspicion of spying for Ukraine.\nTen explosions were heard in Kotovsk, Tambov Oblast, during a drone strike.\nGeolocated footage showed that Russian forces entered the village of Serebrianka, northeast of Siversk.\nCanada announced an aid package to Ukraine worth $4.3 billion.\n18 June\nUkraine's 225th Separate Assault Regiment attacked the command post of Russia's 30th Motorized Rifle Regiment near the village of Andriyivka, in Sumy Oblast some five kilometres from the Russian border. During the attack, the regiment claimed to have killed Russian Major Andrey Yartsev and seized documents. Images of some of the documents were uploaded to the regiment's Telegram account.\nThe HUR claimed the assassination of the Russian-installed deputy-mayor of Berdiansk, Mykhailo Hrytsai with a silenced PM pistol. The HUR claimed that he had built torture chambers to suppress the local population.\nThe Russian defense ministry claimed that Russian forces took the village of , north of Dvorichna. Geolocated footage showed that Russian forces took the village of , south of Chasiv Yar.\n19 June\nUkrainian drones struck Volgograd, shutting down operations at airports in Volgograd, Saratov and Kaluga. The Russian MoD claimed that some 81 drones were shot down over some 10 regions from Crimea to Moscow. No casualties or damage was reported.\nRussia and Ukraine conducted a fifth prisoner exchange as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nZelenskyy appointed Brigadier General Hennadii Shapovalov as commander of the Ukrainian Ground Forces.\nA Ukrainian court sentenced , the head of the Russian Federal Penitentiary Service, to 10 years' imprisonment in absentia for the alleged establishment of torture facilities in Russian-occupied Kherson Oblast.\n20 June\nOne person was killed in a Russian drone attack on Odesa.\nRussia and Ukraine conducted a sixth prisoner exchange as part of an agreement reached during the 2 June peace negotiations in Istanbul.\nThe HUR released a recorded phone call in which Russian soldiers talked about a missing comrade being eaten by a fellow soldier, citing it as evidence of cannibalism in the Russian army.\nThe SBU arrested a Ukrainian army deserter who had been recruited by the FSB and set fire to several military vehicles in exchange for rewards. It also found a Makarov handgun and 50 cartridges in a cache in connection to the arrest as part of an assassination plot against an FSB target in Kyiv.\nThe Russian defense ministry claimed that Russian forces took the village of , northeast of Kupiansk.\n21 June\nSix people were killed due to Russian bombing of Kramatorsk.\nRussian forces claimed to have taken the village of Oleksandro-Kalynove, west of Toretsk. Geolocated footage showed that Russian forces took the village of , south of Novopavlivka and , west of Velyka Novosilka. Geolocated footage showed that Ukrainian forces retook the village of Andriivka in Sumy Oblast.\nHUR drones struck a Russian fuel train in Zaporizhzhia Oblast, with photos posted online showing a break in the railway line.\nThe SBU arrested a Ukrainian serviceman accused of passing on the location of Neptune missile batteries.\n22 June\nA Ukrainian training ground was struck by an Iskander-M missile, killing three people.\nThe Russian Ministry of Defense claimed that Russian forces captured the village of Hrekivka in Luhansk Oblast. Geolocated footage showed that Russian forces took the villages of Komar and Perebudova in Donetsk Oblast.\n23 June\nafter the attack]]\nNine people were killed in a Russian air attack on Kyiv, while three others were killed in a separate attack in Bilhorod-Dnistrovskyi.\nThe Atlas plant of Rosrezerv in Rostov was attacked by Ukrainian drones. The Russian MoD only reported a fire had broken out in the\nKamensky district while heat was detected by NASA's FIRMS satellites.\nThe bodies of three Russians misidentified as Ukrainian soldiers killed in action were repatriated after they were sent to Ukraine during a previous exchange of war dead with Russia.\nThe SBU claimed to have foiled two assassination attempts against President Zelenskyy by the FSB. One involved a colonel assigned to protect Zelenskyy. The second involved a \"sleeper agent\" in Poland that was to take place at Rzeszów Airport; the SBU worked with Poland's Internal Security Agency.\n24 June\nTwenty-one people were killed in Russian missile attacks on Dnipro and Samar, while three others were killed in a Russian drone attack near Verkhnia Syrovatka, Sumy Oblast.\nRussia accused Ukraine of setting fire to an apartment block in Krasnogorsk, Moscow Oblast following a drone attack, injuring two people.\nGeolocated footage showed that Russian forces took the village of Malynivka, northeast of Pokrovsk and Novoserhiivka, west of Pokrovsk. A Russian source claimed that Russian forces took the rural settlement of Dyliivka, north of Toretsk.\nISW reported a potential Neptune missile strike on the command post of the Russian 88th \"Hispaniola\" Volunteer Brigade in Crimea.\n25 June\nIn Crimea, explosions were reported in Dzhankoi, Kerch and near Cape Chauda. Local air defences were activated.\nUkrainian drones struck a Russian facility in Taganrog linked to drone production. The Russian MoD claimed to have intercepted 40 drones in several areas.\nUkraine unveiled a glide bomb kit, with a range of 60 kilometres, that is a response to Russian KAB glide bombs.\nGeolocated footage showed that Ukrainian forces retook the village of Zelenyi Hai, east of Borova.\nUkraine and the Council of Europe signed an agreement to establish a special tribunal to prosecute Russian leaders over the invasion.\n26 June\nThe HUR claimed it had damaged a Russian S-400 missile system in Crimea following a drone attack.\nThe governor of Kursk Oblast claimed that Chinese journalist Lu Yuguang of Phoenix TV was injured in a Ukrainian drone attack on Korenevo.\nUkraine and Russia conducted a prisoner exchange involving an unspecified number of POWs.\n27 June\nFive people were killed in a Russian drone strike on Samar, Dnipropetrovsk Oblast.\nThe Russian MoD said it destroyed 39 drones over various regions of Russia and Crimea. In Kalachyovsky District, Volgograd Oblast, a bridge over the Don River was restricted to traffic after a fire was started by a drone strike. In Novokuybyshevsk, Samara Oblast, Rosneft's oil refinery was attacked. The local governor, Vyacheslav Fedorishchev, confirmed there was a fire but no casualties. The SBU claimed to have destroyed two Su-34 bombers and damaged two more at Marinovka air base in Volgograd Oblast with long range drones.\n28 June\nTwo people were killed in a Russian drone attack on Odesa.\nThe SBU claimed to have destroyed Russian three helicopters: a Mi-8, Mi-26, Mi-28 along with a Pantsyr-S1 self-propelled anti-aircraft missile and gun system following a drone attack on the Kirovske airbase in Crimea. Secondary detonations were reported following attacks on fuel, ammunition and drones stored at the base while Atesh claimed to have set fire to a railway signal cabinet near Yasynuvata, Donetsk Oblast.\nHUR drones struck the 120th Arsenal of the Main Missile and Artillery Directorate of the Russian Defense Ministry in Bryansk, with locals reporting explosions.\nA controversy arose in Germany over a €900 million apparent discrepancy in German MoD budgets for assistance to Ukraine. The MoD clarified that the apparent discrepancy is due to €900 million coming from the European Peace Facility, rather than from Germany directly.\nRussian forces claimed to have crossed into Dnipropetrovsk Oblast and taken the village of Dachne near Novopavlivka. Geolocated footage showed that Russian forces took the village of Zirka, near Komar.\nRussia suspended petrol exports amid supply shortages exacerbated by Ukrainian strikes on Russian oil infrastructure.\n29 June\nEngineering Professional College of National University of Food Technologies after mass attack on Ukraine on 29 June]]\nA Ukrainian F-16 was shot down and the pilot killed. The pilot, Lieutenant Colonel Maksym Ustymenko, used all \"onboard weapons\" and shot down seven aerial targets. The seventh damaged his fighter and forced him to fly away from a residential area before crashing.\nA Russian drone attack in Kherson Oblast killed one person.\nZelenskyy signed a decree withdrawing Ukraine from the Ottawa Treaty on Landmines.\n30 June\nA Ukrainian MiG-29 bombed a Russian drone repair base using GBU-39 Small Diameter Bombs.\nRussian forces claimed to have taken the village of Novoukrainka, south of Pokrovsk and geolocated footage showed that Russian forces took the village of Novomykolaivka, at the border with Dnipropetrovsk Oblast.\nAccording to Astra and Russian media the acting commander of the 8th Combined Arms Army, Colonel Ruslan Goryachkin, was killed during a Ukrainian Storm Shadow strike on a command post in Donetsk Oblast. Also killed was Colonel Vasily Skirnevsky, chief of communications for the 8th Combined Arms Army.\nJuly 2025\n1 July\nMultiple people were reported killed in a Russian missile attack on Huliaipole, Dnipropetrovsk Oblast. Zelenskyy later confirmed that the commander of the 110th Separate Mechanized Brigade was killed while 30 others were injured in the attack. One person was killed in a Russian attack on a civilian evacuation vehicle near Pokrovsk.\nSBU drones struck the Electromechanical Plant Kupol in Izhevsk, Udmurtia, some 1300 kilometres from the Ukrainian border, starting a fire according to locals. The head of Udmurtia claimed three people were killed in the attack. Ukrainian drones also hit Luhansk, Saratov and Engels. An Su-30 was destroyed by HUR drones at Saky air base, as well as Pantsir-S1 missile system and various radars on Crimea.\nOleksandr Syrskyi, commander-in-chief of the Ukrainian Armed Forces, ordered a ban on concentrating soldiers and equipment at training facilities and the placement of service personnel in tent camps as protection from Russian missile attacks.\nThe head of the Luhansk People's Republic, Leonid Pasechnik, claimed that Russian forces had taken the entirety of Luhansk Oblast.\nThe United States halted shipments of some key weapons to Ukraine, including aerial defence and precision guided munitions. White House spokeswoman Anna Kelly gave concerns about American domestic stockpiles as justification. Contradicting the statement, NBC later reported that Pete Hegseth stopped the shipment, supported by Elbridge Colby, although it would not have jeopardized the US military's own ammunition supplies.\n2 July\nThe SBU claimed to have blown up a Russian ammunition depot in Khartsyzsk, Donetsk Oblast, following a drone strike.\n3 July\nvillage (Kharkiv Oblast) after a strike on 3 July]]\nThree people were killed and over 47 injured in Russian attacks on Poltava that also set fire to a conscription office. Two people were killed in a separate drone attack on Odesa that also damaged a building housing the Chinese consulate.\nMajor General Mikhail Gudkov, deputy commander of the Russian Navy, was killed in Kursk Oblast by a HIMARS strike. Russian milbloggers claimed that some 22 were killed, while Primorsky Krai's governor Oleg Kozhemyako also confirmed the death of Gudkov's deputy.\nThe governor of Lipetsk Oblast claimed that one person was killed in a Ukrainian drone strike.\nThe former Russian-installed mayor of Luhansk, Manolis Pilavov, was killed in an explosion that also injured three people.\nThe SBU arrested a major in the Ukrainian Air Force, based in Lviv, accused of supplying the FSB with the location of military assets.\nThe FSB arrested a woman on suspicion of trying to plant a car bomb targeting a defense industry worker in Saint Petersburg.\nISW referred to unverified reports that the head of the FSB's Fifth Directorate, Alexei Komkov, died in a car bombing in Moscow.\nAn aviation arsenal at Khalino airbase, Kursk Oblast, was struck by Ukrainian drones, leading to an explosion believed to include ammunition for the Pantsir-S1, one of which was \"probably\" damaged.\nRussian forces opened a new front in Kharkiv Oblast with the Russian defense ministry claiming to have captured the village of Milove. It also claimed to have taken the village of Razine near Pokrovsk.\n4 July\nTwo people were killed in a Russian air attack on Kyiv.\nUkrainian drones struck Sergiyevo-Posadsky District in Moscow Oblast and several settlements in Rostov Oblast. In Azov several houses, a stadium and cars were damaged. In Dolotinka, Russian officials claimed that an apartment was struck and falling debris killed an elderly woman. Twenty residents were evacuated as well. In Shakhty 2,000 residents were left without power. In Moscow some four explosions were reported by locals resulting in a damaged power substation and 42,000 people without electricity. A factory that manufactures warheads for Shahed drones was also struck.\nUkraine and Russia conducted a prisoner exchange that saw the release of an unspecified number of POWs.\nA HUR bomb detonated in a Chevrolet Aveo, killing three drone pilots from the Russian Bars-Sarmat unit based in Strilkove, Kherson Oblast.\nGeolocated footage showed that Russian forces took the villages of Novomykolaivka in Sumy Oblast and , south of Komar, the Russian defense ministry claimed that Russian forces took the village of Predtechyne, south of Chasiv Yar. Geolocated footage showed that Russian forces took the villages of Koptieve and Shevchenko Pershe near Pokrovsk.\n5 July\n(Kharkiv Oblast) after drone attack in the night 4/5&nbsp;July]]\nUkrainian drones struck Cheboksary in Chuvashia. According to eyewitness the drones either attacked a warehouse or a local enterprise in the industrial area, causing explosions and a fire. Drones also struck Engels, where it was claimed one drone was shot down and eight explosions were heard. Flights out of airports in Saratov, Ulyanovsk, and Saint Petersburg were canceled temporarily.\nBorisoglebsk air base was attacked by drones, causing a fire that was detected by NASA FIRMS. Locals reported 8-10 explosions.\nThe HUR reportedly used explosives to destroy a gas pipeline along the Sea of Japan and water pipelines that supplied several military installations including garrisons of the 155th Marine Brigade in Vladivostok.\nGeolocated footage showed that Russian forces took the village of Malynivka, in the Pokrovsk direction, Russian forces claimed to have advanced to the outskirts of Siversk.\n6 July\nFive people were killed in Russian attacks on Kostiantynivka and Druzhkivka in Donetsk Oblast.\nRussia claimed to have taken the villages of Piddubne in Donetsk Oblast and Sobolivka in Kharkiv Oblast.\nJózsef Sebestyén, a Hungarian who was forcibly conscripted into the 128th Mountain Assault Brigade of the Ukrainian Army, died while on active duty due to wounds sustained from a beating by conscription officers.\n7 July\nafter drone attack on 7&nbsp;July]]\nIn Moscow Oblast, the Krasnozavodsk Chemical Plant, which produces ammunition for Russian security forces, was struck by Ukrainian drones.\nHUR drones struck \"technological workshops\" at the Ilsky oil refinery, Krasnodar Krai. Russian authorities acknowledged drone debris fell on the oil refinery.\nRoman Starovoyt, Russian Minister of Transport, was fired from his post due to \"massive disruptions of Russian civilian airspace caused by Ukrainian drone raids\". Starovoit, who previously served as governor of Kursk Oblast, was found dead hours later, having shot himself in an apparent suicide due to looming corruption charges.\nThe Russian defense ministry claimed that Russian forces has crossed into the Ukrainian border near Tyotkino and took the village of Bezsalivka.\n8 July\nThe governor of Kursk Oblast claimed that four people, including a Rosgvardiya officer, were killed in a Ukrainian drone attack on Kursk city.\nThe US Department of Defense announced that it would send additional defensive weapons to Ukraine following a directive from President Trump.\n9 July\nIn the early morning, Russia launched a large-scale aerial attack on Lutsk. Ukraine claimed the airstrike was the largest since the start of the war, with 728 drones and 13 missiles launched.\nEight people were killed in Russian attacks on Kostiantynivka and Rodynske in Donetsk Oblast. One person was killed in a separate attack in Pravdyne, Kherson Oblast, with the Ukrainian military claiming to have successfully targeted the responsible drone unit in Hola Prystan.\nThe SBU arrested two Chinese nationals in Kyiv on suspicion of gathering intelligence on the Neptune missile system.\nThe Ukrainian 3rd Assault Brigade claimed the world's first surrender of enemy soldiers to unmanned drones in Kharkiv Oblast.\nA Ukrainian translator working for the European Commission was dismissed from her position and subsequently detained by Belgian authorities on suspicion of espionage after allegedly taking prohibited notes of a closed door meeting between Zelenskyy and EU leaders.\nGeolocated footage showed that Russian forces took the village of Tovste near Novopavlivka.\n10 July\nTwo people were killed in a Russian drone attack on Kyiv that also damaged the building housing the Apostolic Nunciature to Ukraine.\nThe governor of Belgorod Oblast claimed that two people were killed in a Ukrainian drone attack on Shebekino.\nAtesh claimed to have carried out sabotage attacks on railway infrastructure in Uvarove in Crimea and in Volgograd. The HUR claimed that it carried out an operation with Ukrainian partisans that destroyed a Russian command post in Melitopol, killing five soldiers.\nSBU Colonel Ivan Voronych was shot dead in the Holosiivskyi District of Kyiv by an unknown assailant. The White Phoenix, a local branch of the American neo-Nazi group The Base subsequently claimed responsibility for the attack.\nRussia started using \"unmanned rail carts\" and \"remotely operated railway platforms\" to reduce the loss of personnel from Ukrainian drone attacks on rail traffic operating near the front line.\nThe US resumed deliveries of 155 mm shells and GMLRS to Ukraine.\nA Russian decoy drone crashed in Lithuania after travelling through Belarus.\n11 July\nRussian officials claimed that three people were killed in Ukrainian attacks on Belgorod, Lipetsk and Tula Oblasts.\nGeolocated footage showed that Russian forces took the village of Zelena Dolyna in northern Donetsk Oblast.\nThe HUR blew up a gas pipeline in Langepas, Tyumen Oblast, that supplied \"military-industrial facilities\" in Chelyabinsk, Orenburg, and Sverdlovsk Oblasts according to a HUR source.\nUK intelligence estimated that Russian forces fighting in Ukraine had lost 236,000 soldiers killed or wounded in 2025, with 32,000 casualties (1,080 daily) in June 2025 alone.\n12 July\nRussia launched a wave of aerial attacks across Ukraine, killing six people in Chernivtsi and in Dnipropetrovsk and Sumy Oblasts. Explosions were also reported in Lutsk and Lviv. According to Zelenskyy, at least 597 drones and 26 missiles were sent by Russia, while Poland deployed fighter jets to protect its own airspace.\n13 July\nOne person was killed in a Russian drone attack in Sumy Oblast.\nSBU head Vasyl Malyuk claimed that an Alpha team raided a safe house in Kyiv Oblast and killed two FSB agents responsible for the killing of SBU Colonel Ivan Voronych on 10 July, after they had resisted arrest.\nRussia claimed to have taken the village of  in Donetsk Oblast, near the border with Dnipropetrovsk Oblast. and  in Kharkiv Oblast.\nA Russian Buk-M3 was destroyed by artillery fire from the Ukrainian 15th Artillery Reconnaissance Brigade.\n14 July\nOne person was killed in a Russian drone attack in Kharkiv Oblast.\nGeolocated footage showed that Russian forces took the village of Malynivka, east of Huliapole. Russian forces claimed to have taken the village of Yunakivka in the Sumy direction and Mayak in the Pokrovsk direction.\n15 July\nThe SBU claimed to have arrested a man in Rivne on suspicion of attempting to plant a bomb in an apartment building on behalf of the FSB.\nUkrainian drones struck a PJSC Energia plant in Yelets, Lipetsk Oblast, that manufactures batteries and accumulators for Russian weapons, resulting in a fire and one injury.\nPutin rewarded American citizen Daniel Martindale with a Russian passport for spying in Ukraine and the Order of the Donetsk People's Republic.\nGeolocated footage showed that Russian forces took the rural settlement of Novospaske, west of Toretsk. Russian milbloggers claimed that Russian forces took the village of Novotoretske, northeast of Pokrovsk and the Russian defense ministry claimed that Russian forces took the village of Voskresenka in Donetsk Oblast.\n16 July\nTwo people were killed in a Russian airstrike on Dobropillia, Donetsk Oblast.\nThe mayor of Ogre, Latvia, Egils Helmanis, was injured in a Russian drone strike in Ukraine while he was on an official visit to provide aid to the Ukrainian military.\nThe governor of Belgorod Oblast claimed that one person was killed in a Ukrainian drone strike in Pervomaysky.\nGeolocated footage showed that Russian forces took the village of , southwest of Novopavlivka.\n17 July\nUkrainian drones struck targets in St. Petersburg and Moscow. Drones interrupted flights to major airports, with ten flights being delayed in St. Petersburg. In Kaluga Oblast a 14-year-old girl was injured. According to the local governor a drone killed one man and injured some six in Belgorod city. In Smolensk Oblast one was injured. In Voronezh three children were claimed to have been injured. A total of 122 drones were claimed to have been intercepted by Russian forces.\nThe bodies of 1,000 Ukrainian soldiers killed in action were repatriated by Russia in exchange for the bodies of 19 Russian soldiers.\nGeolocated footage showed that Russian forces took the village of , near Pokrovsk.\nThe HUR hacked the Gazprom databases, disabling access for some \"20,000 system administrators\", as well as copying and deleting \"hundreds of terabytes of data\". The data affected both the retail and service sides of the business.\nThe Hungarian government barred three Ukrainian military officials from entering the country amid a diplomatic dispute caused by the death of József Sebestyén.\n18 July\nTwo people were killed in Russian attacks on Kamianske, Dnipropetrovsk Oblast. One person was killed in a separate attack in Zaporizhzhia Oblast.\nDrones and explosions were reported in Moscow and Oryol Oblasts. In Moscow, Vnukovo Airport cancelled one flight and delayed multiple outbound and inbound flights. The Mayor of Moscow, Sergey Sobyanin, claimed several drones were shot down. In Rostov-on-Don Astra reported a \"massive fire\" at a military barracks.\n19 July\nOne person was killed in a Russian drone attack on Odesa, while two others were killed in a missile attack on Vasylkivka, Dnipropetrovsk Oblast.\nThe Mayor of Moscow claimed that 13 drones were shot down over two hours. Witnesses reported several drones shot down over Zelenograd.\n20 July\nAtesh claimed to have carried out a sabotage attack on railway infrastructure near Medvedki, Tula Oblast.\nThe Russian defense ministry claimed that Russian air defense downed over 230 Ukrainian drones over Russia including 27 near Moscow.\nGeolocated footage showed that Russian forces took the village of Yablunivka in the Sumy direction. The Russian defense ministry claimed that Russian forces took the village of , near Toretsk.\nUkrainian “long-range firepower” destroyed a S-300P and Nebo-M in Belgorod Oblast.\n21 July\nmissile in Kyiv]]\nOne person was killed in a Russian air attack on Kyiv.\nA Russian missile attack on a Ukrainian military training camp in Kropyvnytskyi killed at least 15 soldiers and wounded over 100 other soldiers. According to an American volunteer from Florida, the base's raid alarm did not sound before the strike and that first aid kits \"were nowhere to be found.\" Volodymyr Kaminskyi, a spokesman for the International Legion of the Defence Intelligence of Ukraine, said that an investigation is ongoing and that the number of victims cannot be disclosed.\nUkrainian drones struck Moscow and Rostov-on-Don. In the village of Kamenolomni, a train station and a flower shop were set on fire by falling debris. The mayor of Moscow claimed all drones were shot down. However flight restrictions were put in place at Moscow's airports for the fifth night in a row.\nUkrainian military observer Kostyantyn Mashovets claimed that Ukrainian forces retook the villages of Andriivka, Kindrativka, and Oleksiivka in the Sumy direction.\n22 July\nOne person was killed in a Russian airstrike in Kramatorsk.\nThe Russian-installed Governor of Kherson Oblast, Vladimir Saldo, claimed that three people were killed in a Ukrainian drone strike on a bus in Hola Prystan.\nRussian forces entered the city of Pokrovsk.\nIn the Sumy direction, geolocated footage showed that Russian forces took the rural settlement of Varachyne while Russian forces further claimed that they took the village of Oleksiivka. Geolocated footage showed that Russian forces took the village of Lypove, north of Lyman and Bila Hora, near Toretsk.\nA Ukrainian Mirage 2000 crash landed in Volyn Oblast with the pilot ejecting safely, marking the first Mirage jet lost since their acquisition by Ukraine.\n23 July\nThree people were killed in a Russian attack in Kharkiv Oblast.\nRussia said that it agreed to exchange more POWs at peace negotiations with Ukraine held in Istanbul.\nRussian forces claimed to have taken the village of Torske near Lyman and the villages of Pankivka and Volodymyrivka northeast of Pokrovsk. Geolocated footage showed that Russian forces took the towns of , north of Kupiansk and Dachne, south of Novopavlivka.\nA Hungarian citizen who joined the Ukrainian Army in 2024 was charged in absentia \"illegally joining an armed group involved in an armed conflict outside the territory of allied forces\" by the Hungarian prosecutor's office in Csongrád-Csanád County.\nThe US Department of Defense approved a military aid package valued at $322 million, including HAWK missiles, maintenance equipment and Bradley Vehicles.\nUkrainian drones struck several parts of Rostov Oblast, injuring three people, setting fire to the Novocherkassk power plant, and disrupting rail, Rostelecom and electricity services.\n24 July\n's FIRMS detected a fire on 23 July 2025 22:03:00 (UTC) at the Sochi Lukoil fuel depot.]]\nTwo people were killed in a Russian attack in Donetsk Oblast.\nMultiple buildings in Odesa, including the Pryvoz Market and historic buildings on Prymorskyi Boulevard, were damaged in a Russian airstrike.\nUkrainian drones attacked Sochi and caused a fire in the Lukoil fuel depot with locals reporting at least seven explosions in the sky. Russian air defence, ranging from small arms to S-300/400 missiles, engaged the drones \"flying directly over residential buildings.\" Two people were killed.\nAn Israeli Red Color radar designed to plot impact zones for rockets and drones and allowing for more timely warnings for civilians became active in Kyiv.\nGeolocated footage showed that Russian forces took the village of Yablunivka, northwest of Toretsk and the Russian defense ministry claimed that Russian forces took the rural settlement of Novoekonomichne, northeast of Pokrovsk and the village of Zvirove, southwest of Pokrovsk.\nThe European Union announced that it was suspending all financial assistance to Ukraine until the \"independent powers of its anti- corruption institutions are restored.\"\n25 July\nOne person was killed in a Russian airstrike on Kharkiv.\nThe Ukrainian Air Force destroyed an FSB facility near Belaya Beryozka in Bryansk Oblast using AASM Hammer bombs.\nThe airports of Vladikavkaz, Grozny, Magas, Mineralnye Vody, Nalchik, Stavropol, Sochi, and Tambov were shut down due to drone attacks. Seventy flights were delayed, including 45 at Sochi Airport. In Nevinnomyssk, 30 drones were shot down by air defences. The local fertiliser plant, Nevinnomyssky Azot, was destroyed by Ukrainian drones. The Russian MoD reported downing 105 drones over several regions.\nAstra reported 20 trains were delayed after a \"drone attack\". In Rostov Oblast, a train station and residential buildings in Peschanokopskoye were damaged by drones. Ten trains were delayed for five hours when power was lost. In Krasnodar Krai, 12 trains were delayed after drone debris damaged the power lines to the Timashevskaya station.\n100 terabytes of data were taken from Russian-appointed Crimean authorities by hackers from the HUR over two days, ranging from health to military data.\nGeolocated footage confirmed Russian claims of control over Novoekonomichne and showed that Russian forces took the town of Holubivka and entered Kupiansk from the north. Russian forces claimed to have taken the town of Oleksandro-Kalynove near Toretsk.\n26 July\non fire at Armavir air base]]\nUkrainian officials stated that Russia fired over 200 drones and almost 30 missiles were fired into Ukraine, three people were killed and over six injured in a Russian air attack in Dnipropetrovsk Oblast, while in Russia, the governor of Rostov Oblast claimed that two people were killed in a Ukrainian drone attack. Drones managed to hit a residential block and industrial areas in Dnipro while a shopping centre was hit in the wider district. The headquarters of the Sumy Regional Military Administration was damaged in a Russian drone strike.\nRussian forces took the settlements of Maliivka in Dnipropetrovsk Oblast and Zelenyi Hai in Donetsk Oblast.\nAstra reported that the Signal radio plant in Stavropol Krai was damaged by Ukrainian drones. Governor Vladimir Vladimirov confirmed a small fire at \"industrial facilities\" with no casualties.\nUkraine's Khortytsia operational-strategic group claimed to have killed Colonel Lebedev, commander of the 83rd Motorized Rifle Regiment of the Russian 69th Guards Motor Rifle Division in Velykyi Burluk, Kharkiv Oblast.\nThe HUR claimed that an operative burned down a two-seat Su-27UB combat trainer at Armavir air base in Krasnodar Krai.\n27 July\nThree people were killed in a Russian drone strike on a bus near Yunakivka, Sumy Oblast.\nUkrainian drone debris landed on a railway power substation in Oktyabrsky District, Volgograd Oblast, resulting in a loss of power to rail services.\nLocals reported Ukrainian drones over Gatchina, Vsevolozhsk, Kronstadt, and Volosovsky District in Leningrad Oblast. Explosions were reported, believed to be the work of air defences, as more than 70 flights from Pulkovo Airport were delayed or cancelled. Governor of Leningrad Oblast, Aleksandr Drozdenko, confirmed that Russian air defense downed drones in several districts, with debris reportedly falling in residential and industrial zones. The Russian Ministry of Defense claimed its air defenses intercepted or destroyed a total of 99 drones including 36 in Bryansk Oblast, 21 at Smolensk Oblast, 10 at Kaluga Oblast, and nine each at Volgograd and Rostov Oblasts. More Ukrainian drones were reported in the skies of Crimea, Voronezh, Kursk, Nizhny Novgorod, Oryol, Tambov, and the Black Sea coasts.\nGeolocated footage showed that Russian forces have reached the outskirts of the town of Stepnohirsk. Russian forces claimed to have taken the town of Plavni near the Dnieper.\nRussia cancelled the Saint Petersburg Navy Day parade for security reasons for the first time since its inception in 2017.\n28 July\nafter the bombing]]\nSeventeen inmates were killed in a Russian bombing of a prison in Bilenke, Zaporizhzhia Oblast.\nThe pro-Ukrainian hacker groups  and Cyber Partisans caused a \"massive malfunction\" in Aeroflot's online system, leading to 49 flights to various locations being cancelled.\nThe SBU claimed to have arrested a Belarusian KGB agent who was spying on Ukrainian defences in Volyn Oblast.\nRussian equipment, likely trying to cross the Zherebets River near Lyman, was attacked by Ukrainian drones, tanks and artillery, resulting in the destruction of a BM-21 Grad, a 152-mm Msta-B howitzer with its tractor, a BTR-82A and civilian cars.\nThe Russian-occupied parts of Donetsk Oblast came under attack from drones. Russian-installed authorities stated that over 150,000 residents of Donetsk city, Makiivka and Yasynuvata were left without electricity.\n29 July\nafter the attack]]\nSix people were killed in a Russian missile attack in Novoplatonivka, Kharkiv Oblast. Three others were killed in a separate attack in Kamianske.\nRussian media reported that Ukrainian drone strikes caused fires and a blackout in Donetsk.\nUnknown drones struck Salsk, Rostov Oblast, setting fire to a freight train and damaging the Salsk station. Nine trains were delayed as a result.\nThe SBU claimed to have thwarted a Russian plot to assassinate Serhii Filimonov, the commander of the Ukrainian 108th Separate Mechanized Battalion, resulting in the arrest of a resident of Dnipropetrovsk Oblast who had been recruited by the FSB.\nUkraine received seven out of 18 promised IRIS-T systems from Germany, according to the Ukrainian Ambassador to Germany Oleksii Makeiev.\nThree Ukrainian soldiers were killed and 18 wounded during a Russian Iskander missile strike on a training ground in Chernihiv Oblast. In response, Ukrainian military commander  Oleksandr Syrskyi ordered most military training to be moved underground.\nGeolocated footage showed that Russian forces entered the border of Zaporizhia Oblast from Donetsk Oblast and captured the town of Temyrivka.\n30 July\nMexico's National Intelligence Centre warned the SBU that some Latin American volunteers in Ukrainian drone units only joined to learn about drone warfare for future use by drug cartels.\nThe SBU caught a Ukrainian Air Force instructor pilot with the rank of major who was assisting the GRU with intelligence on targeting F-16s, Su-24 bombers and Mirage 2000s.\nGeolocated footage showed that Russian forces captured the town of Oleksandro-Kalynove, while Ukrainian forces retook the towns of Maliivka and Temyrivka.\n31 July\nRussia launched over 300 drones on Kyiv, killing at least 32 people and injuring over 159 more.\nRussia claimed to have taken Chasiv Yar, which was denied by Ukrainian forces. Geolocated footage showed that Russian forces captured most of the city.\nZelenskyy signed a law reinstating the independence of the National Anti-Corruption Bureau and the Specialized Anti-Corruption Prosecutor's Office amid threats of a suspension of financial support from the EU and the G7 if the agencies were subdued.\nUkrainian drones struck the Volgograd–Rostov railway, setting fire to the electrical substation in the village of Kotelnikovo, Volgograd Oblast. Volgograd governor Andrey Bocharov confirmed that rail traffic was temporarily restricted.\nA MiG-29 bombed a Russian drone operator base with a JDAM-ER in Repyakhovka, Belgorod Oblast.\nThe SBU claimed to have launched drones at the JSC Radiozavod plant owned by Russian state-owned Rostec in Penza, setting it on fire. Mobile phone access and internet were disabled. The local governor denied any damage or casualties.\nUkrainian drones dropped an e-bike to help a wounded soldier avoid encirclement by Russian forces.\nAugust 2025\n1 August\nExplosions were reported in Taganrog, Rostov Oblast. Locals also reported that \"combat helicopters\" were active in the area.\nA North Korean M-1978 Koksan was destroyed by a HIMARS strike in an undisclosed location.\nHundreds protested in Vinnytsia demanding the release of men held in detention for military service by military enlistment offices before forcing open a stadium where the men were being held. Police used tear gas and arrested five protesters on charges of seizing a state building.\n2 August\n.]]\nOne person was killed in an attack in Sumy Oblast.\nThe HUR claimed to a have carried out a joint operation with partisans in Melitopol that killed five Kadyrovites in a bus explosion that also destroyed an electronic warfare system.\nDrones attacked both Kerch and Feodosia in Crimea. A \"space object tracking radar\" was damaged in Feodosia, with \"abnormal temperatures\" reported by NASA's FIRMS. An oil refinery was reported on fire. The Kerch bridge was closed for some five hours to traffic. The Ryazan and Novokuybyshevsk oil refineries were attacked by Ukrainian drones, along with the \"Electropribor Production Association\" and Radiozavod's plants in Penza. One person was killed and two people were injured in Penza Oblast, and one person was killed in Rostov and Samara Oblast. The Russian defense ministry claimed to have shot down 34 drones over Rostov Oblast.\nUkrainian long-range UAVs attacked and caused fire at the Primorsko-Akhtarsk air base, which is used for the storage and launch of Shahed drones. The Likhaya-Zamchalovo traction power substation, in the village of Uglerodovsky, Rostov Oblast, was set on fire by drones. The Central Asia–Center gas pipeline was disabled by explosions.\nThe National Anti-Corruption Bureau of Ukraine and the Specialized Anti-Corruption Prosecutor's Office announced the arrest of four people in connection with a \"large-scale corruption scheme\" over the procurement of drones and signal jamming systems.\nUkrainian forces destroyed a S-300 missile system in Zaporizhzhia Oblast.\n3 August\n]]\nRussia launched a missile strike on Kyiv.\nThe governor of Voronezh Oblast claimed one person was injured in a Ukrainian drone attack.\nThe  of Sochi, , stated that Ukrainian drones struck an oil depot near Sochi airport, resulting in a \"massive\" fire which cancelled flights to the airport. An oil refinery in Kstovo, Nizhny Novgorod also was attacked in an unverified claim.\nUkraine imposed sanctions on 99 individuals and entities for helping circumvent Western sanctions against Russia.\nLieutenant General Anatolii Kryvonozhko was formally made the Commander of the Ukrainian Air Force by President Zelenskyy, having been the acting commander since 30 August 2024.\nThe HUR claimed to have obtained documents outlining the specifications for the Russian submarine Knyaz Pozharskiy. The documents included \"ship's combat layout, engineering schematics, survival systems, and the organizational structure of the crew\".\nGeolocated footage showed that Russian forces took the town of Novoukrainka south of Pokrovsk.\n4 August\nFour people were killed in Russian attacks in Zaporizhzhia Oblast. Three people were killed in separate attacks in Kharkiv Oblast.\nThe Ukrainian military claimed it had killed more than 10 Russian soldiers who had attempted to assault the Hoptivka border checkpoint in Kharkiv Oblast.\nUkrainian drones struck both Mikhaylovka and Frolovo in Volgograd Oblast. The Archeda railway station in Frolovo was set on fire.\nThe SBU claimed to have conducted a drone attack on Saky Air Base in Crimea and completely destroyed one Su-30SM, damaged another while an additional three Su-24s were hit with unspecified damage.\nIn Sochi, three women were detained and fined by police for filming themselves after a drone attack on the Rosneft-Kubannefteprodukt oil depot and posting it on TikTok.\nThe  of the Donetsk People's Republic, Denis Pushilin, claimed that Russian forces took both banks of the Kleban-Buk Reservoir. Geolocated footage showed that Russian forces took the town of Novoselivka, east of Siversk. A Russian milblogger claimed that Russian forces took the town of Hrekivka, southeast of Borova.\nPetrol prices in Russia reached a record high, surpassing the previous record from September 2023.\n5 August\nafter the attack]]\nRussian forces targeted a train station in Lozova, Kharkiv Oblast, killing two people and injuring 10 others. Ukrainian authorities claimed that over 30 Geran-2 drones were used in the attack.\nA Russian FPV drone struck a house in Stepnohirsk settlement hromada, Zaporizhzhia Oblast, killing two people.\nOne person was killed in a bomb attack in Zhytomyr that was blamed by the SBU on two minors who had been recruited by Russia.\nThe HUR's Tymur Special Unit claimed to have killed 334 Russian soldiers and wounded more than 550 others during a battle in Sumy Oblast.\n6 August\nThe US government authorized an arms sale to Ukraine valued at $200 million, mostly for spares, repairs and maintenance of M777 howitzers.\nThe Tatsinskaya railway station in Rostov Oblast was attacked by Ukrainian drones. Rostov Oblast Governor Yury Slyusar said damage to power lines left 87 homes and 200 residents without power. The Russian MoD said that 51 drones had been shot down over several regions including Crimea.\nUkrainian partisans from the People'e Resistance of Ukraine blew up an Mi-28 helicopter in Torzhok, Tver Oblast.\n7 August\nRussian Telegram channels claimed that unknown drones attacked the Afipsky oil refinery and the drones attacked a military base in Slavyansk-on-Kuban. In Surovikino, Volgograd Oblast, two train stations were attacked. The regional governor Andrey Bocharov said that a fire at the Surovikino station was put out while \"sappers\" cleared wreckage from the Maksim Gorky station.\nUkrainian prosecutors charged the administrator of Detention Center No. 2, in Rostov Oblast, in absentia with the \"torture and death\" of Ukrainian journalist Victoria Roshchyna.\nGeolocated footage showed that Russian forces took the town of , west of Kupiansk and north of . Geolocated footage showed that Russian forces advanced to the center of , northwest of Toretsk and central Shcherbynivka, indicating that Russian forces likely recently completed the seizure of Toretsk.\nThe HUR claimed to have carried out a series of attacks in Crimea that destroyed or damaged three Russian radar stations and a Project 02510 BK-16 landing craft.\nPublished Russian naval documents showed that the Buyan-class corvette Vyshniy Volochyok was damaged from colliding with the civilian tanker Nazan in Temryuk Bay while maneuvering to evade attacking Ukrainian drones.\n8 August\nGeolocated footage showed that Ukrainian forces retained positions in  and parts of Shcherbynivka, both near Toretsk, while Russian forces advanced into central  and seized .\nUkraine imposed sanctions on Rosatom and 34 other individuals and entities involved in bypassing energy-related sanctions against Russia and in the occupation of the Zaporizhzhia and Chernobyl Nuclear Power Plants.\nThe HUR claimed to have carried out an attack on Russia's 90th Anti-Aircraft Missile Brigade in Krasnodar Krai, killing 12 and injuring dozens more, as well as destroying military equipment.\nA Ukrainian drone targeted the \"Voronezh-M\" radar station near Orsk in Orenburg Oblast, making it the longest one-way drone attack ever with the distance of over 1,800 kilometers.\n9 August\nTwo people were killed in a Russian drone strike on a bus in Kherson. During the rescue operation, Russian forces launched another attack, injuring three police officers.\n10 August\n's FIRMS detected extensive fire on August 10 00:39:00 (UTC) at the Saratov oil refinery.]]\nThree swimmers were killed by sea mines in the Black Sea off the coast of Odesa Oblast.\nThe Ukrainian military claimed to have retaken the village of Bezsalivka in Sumy Oblast following an operation that killed 18 Russian soldiers, but a Russian milblogger reportedly affiliated with the Russian Northern Group of Forces refuted the claim.\nUkrainian drones attacked the Saratov oil refinery with reports of numerous explosions in the early morning and social media videos showing massive fires and black smoke associated with burning oil products. Collateral damage from falling drone debris included one fatality.\nThe Ukrainian Air Force conducted a \"high-precision bomb strike\" against a Russian battalion headquarters in Oleshky, Kherson Oblast, claiming to have killed 25 soldiers, including the battalion commander, and injured 11.\n11 August\nDeepStateMap reported that Russian forces had reached the Dobropillia–Kramatorsk highway, advanced near the town of  in Donetsk Oblast and entered the settlements of  and . NASA's Fire Information for Resource Management System reported heat anomalies west of  and in , east of Dobropillia, Bilytske, southeast of Dobropillia, and Rodynske, leading the ISW to assess that Russian forces likely recently seized , Sukhetske, , Zatyshok, , , , Nykanorivka, southeast of Dobropillia, and the towns of Maiak, and , east of Dobropillia. A day later, spokesperson for the Dnipro operational-strategic group, Colonel Viktor Trehubov, denied any breakthroughs in the area.\nGeolocated footage indicated that Russian forces captured the town of Zelenyi Hai.\nThe Ukrainian military claimed to have killed the commander of the Russian 85th Motorized Rifle Brigade who goes by the callsign \"Dniepr\" and five other soldiers in an attack on a command post in Donetsk Oblast.\nThe Orenburg Helium Plant and the Monocrystal JSC plant in Stavropol were attacked by Ukrainian drones.\n12 August\n) at the Unecha junction of the Druzhba pipeline.]]\nA Ukrainian soldier was killed in a Russian cluster munitions attack on an undisclosed training facility.\nUkrainian drones caused a fire at the Unecha junction of the Druzhba pipeline in Bryansk Oblast.\nUnited States Secretary of State Marco Rubio, in a podcast interview with Sid Rosenberg, claimed that the Russians had lost 60,000 dead in July alone, which he said indicated Russia's commitment to the war.\n13 August\nThe Russian Defense Ministry claimed that Russian forces took the villages of Zatyshok and Zapovidne, near Dobropillia.\nThe Ukrainian Freedom of Russia Legion claimed that its Hroza platoon destroyed a Russian Chernyi Glaz Electronic Warfare System in an undisclosed location.\n14 August\n.]]\nThe Russian defence ministry claimed to have downed 44 drones overnight, including nine in Volgograd Oblast. Volgograd's governor claimed that falling drone debris caused a fire at Lukoil's Volgograd Refinery.\nRostov Oblast Governor Yury Slyusar claimed that a Ukrainian drone struck a residential building in Rostov-on-Don, injuring 13. A government building in Belgorod Oblast suffered \"minor damage\" from a drone strike, while the regional governor claimed that one person was killed in a strike in Pristen.\nUkraine received 84 soldiers and civilians in a prisoner swap. Some civilians had been in custody since 2014.\nThe FSB and the Russian military claimed to have destroyed Hrim-2 missile production sites, \"eliminating both the threat of Ukrainian missile strikes deep inside Russian territory\".\nThe Ukrainian Navy claimed that it intercepted a Russian radio transmission indicating that a Su-30SM had been lost over Snake Island. The cause of the crash is unknown, with wreckage being spotted a search and rescue is under way.\nGeolocated footage showed that Russian forces took the town of , northeast of Velykomykhailivka at the border of Donetsk Oblast and Dnipropetrovsk Oblast.\nThe SBU charged former politician Viktor Medvedchuk and 12 accomplices in absentia for working with Russia to \"advance its interests\".\nUkrainian journalist and soldier Yurii Butusov claimed that a Ukrainian sniper killed two Russian targets at a distance of 4,000 meters, setting a new record for the longest range sniper kill.\n15 August\nUkraine said that it struck the Port of Olya in Astrakhan Oblast, hitting a ship carrying Iranian drone parts and ammunition.\nThe Syzran Oil Refinery in Samara Oblast was set ablaze by Ukrainian drones. Ukraine also struck a command post in Yenakiieve, Donetsk Oblast used by the 132nd Separate Guards Motor Rifle Brigade.\nThe Governor of Kursk Oblast claimed a Ukrainian strike hit a residential building, killing one and wounding ten.\nA Russian ballistic missile attack in Dnipro Raion of Dnipropetrovsk Oblast killed one person.\nGeolocated footage showed that Russian forces took the town of  near the Donetsk Oblast and Dnipropetrovsk Oblast border. Ukrainian military observer Kostyantyn Mashovets reported that Ukrainian forces withdrew from Udachne, near Pokrovsk. Ukrainian sources claimed that Ukrainian forces retook the towns of , Vesele and Zoloty Kolodiaz in the Dobropillia direction but were unable to be confirmed by ISW.\nAn explosion occurred at a gunpowder factory at the Elastik synthetic fiber plant in the village of Lesnoy, Ryazan Oblast, killing over 23 people and injuring over 154 more.\n16 August\nThe Ukrainian military said Russian forces took the villages of Popiv Yar, southwest of Dobropillia, and Ivano-Darivka, northeast of Sloviansk. Geolocated footage showed that Russian forces took the town of Serebrianka, near Siversk.\nIn the Dobropillia direction, geolocated footage showed that Ukrainian forces retook the towns of Vesele and Hruzke, while The Ukrainian General Staff claimed that the 1st Azov Corps cleared the towns of Rubizhne, Novovodyane, Petrivka and Zolotyi Kolodyaz.\nThe Ukrainian Air Force said that Russia fired 85 drones and a ballistic missile towards Ukraine, of which 61 were shot down. The Russian Defence Ministry claimed that air defenses shot down 29 drones launched by Ukraine.\nRussian Lieutenant General Essedulla Abatchev, deputy commander of Russia's Northern Group of Forces, was attacked while travelling in a convoy in the village of Zhuryatino, near the borders in Kursk Oblast and was seriously wounded. The HUR claimed that he was flown to the Moscow Oblast military hospital for emergency treatment having lost an arm and a leg.\nThe HUR claimed that it destroyed an ammunition dump in Melitopol, killing at least six Russian naval infantry and elements of a drone unit attached to the \"Kadyrovite Akhmat-Vostok\" unit.\nUkrainian drones struck the Azot chemical plant in Stavropol Krai. Locals reported \"9-10 explosions\".\n17 August\nThe HUR announced that it, alongside with the State Border Guard Service and other units of the AFU, carried out a drone attack on the  in Liski, Voronezh Oblast.\nPolice in Donetsk Oblast stated that Russian forces attacked the town of Sviatohorivka, west of Dobropillia using a Geran-2 drone, killing two civilians. A Russian milblogger claimed that Russian forces bombed the town of Bilozerske, north of Dobropillia using Geran-2 drones and glide bombs.\n18 August\nafter the attack.]]\n's FIRMS detected fire on 17 August 2025 23:50:00 (UTC) at the Nikolskoye oil pumping station, Michurinsky District.]]\nThree people were killed in a Russian missile attack on Zaporizhzhia. Seven others were killed and 23 were injured during a Russian drone attack on an apartment building in Kharkiv. A drone attack on Sumy State University destroyed one of its buildings.\nUkraine announced the FP-5 Flamingo, a new cruise missile claimed to be already in serial production at 50 units per month with a stated range of 3,000 kilometres, GPS, internal navigation, four hours flight time and a one-ton warhead.\nThe General Staff of the AFU announced that their UAVs struck the Nikolskoye oil pumping station in Michurinsky District in Tambov Oblast, causing a complete stop of the Druzhba pipeline.\nIn the Dobropillia direction, Ukrainian military observer Konstantyn Mashovets claimed that Ukrainian forces recently retook the towns of Zapovidne and Dorozhnie, and geolocated footage showed that Ukrainian forces retook the town of Zolotyi Kolodyaz.\nGeolocated footage showed that Ukrainian forces retook the town of , east of Velykomykhailivka.\n19 August\n.]]\nThe SBU claimed to have carried out drone strikes that destroyed two Russian ammunition warehouses in Bilokurakyne, Luhansk Oblast.\nThe bodies of 1,000 Ukrainian soldiers killed in the war, including five reported to have died in captivity, were repatriated in an exchange that also saw the repatriation of 19 deceased Russian personnel.\nThe Ukrainian military attacked and caused an extensive fire on a fuel transporting train that had derailed near  and Tokmak, Zaporizhzhia Oblast.\nRussian forces claimed to have entered Kostiantynivka from the east. The head of the city's Military Administration Serhiy Horbunov stated that Russian forces conducted ten FAB-250 strikes against civilian infrastructure, damaging residential and administration buildings and a school.\n20 August\nA Russian MLRS strike on a market in Kostiantynivka killed three people and injured four others.\nThe HUR claimed to have carried out a missile strike on a Russian patrol boat off the coast of Zaliznyi Port in Kherson Oblast that killed five crew members.\nThe FSB claimed to have intercepted a Ukrainian sabotage unit belonging to the Special Operations Forces in Bryansk Oblast, killing three members and capturing two others including the unit's commander, Oleksandr Zhuk, who confessed to the FSB that Special forces of Ukraine were behind the May 2025 Bryansk bridge attack and a train derailment in Belgorod Oblast in September 2024.\nGeolocated footage showed that Russian forces took the towns of Bezsalivka, on the Ukrainian side of the border near Tyotkino, and in Novoheorhiivka, southeast of Velykomykhailivka. Ukrainian military observer Kostyantyn Mashovets claimed that Russian forces took Maliivka and advanced east of , both southeast of Velykomykhailivka.\nAn explosion was reported on the cornfields of the Polish village of Osiny some 100 kilometers from Warsaw. The Polish defense minister accused Russia of flying the drone.\n21 August\nRussia conducted overnight strikes on western Ukraine. The UAF reported that Russia launched 574 drones and 40 ballistic and cruise missiles. Officials reported one dead and 15 injured—one person was killed in an air attack on Lviv that injured three others, and an elderly woman was injured after Russian forces bombed a village in the Polohy Raion of Zaporizhzhia Oblast. An American-owned electronics plant, Flex, in Mukachevo, one of the biggest American investments in Ukraine, was set on fire in a separate air attack.\nUkrainian drones set fire to an oil refinery in Novoshakhtinsk, Rostov Oblast, that had previously been attacked in December 2024 and was defended by Pantsir and Tor anti-aircraft systems.\nThe Ukrainian military claimed to have retaken most of  from Russian forces.\nA Ukrainian national identified as Serhii K was arrested in Italy on suspicion of co-masterminding the Nord Stream pipelines sabotage in 2022.\nThe Russian defense ministry claimed that Russian forces took the town of Oleksandro-Shultyne near Kostantynivka.\nIn Bryansk Oblast Ukrainian drones caused fire and halt of operations at the Druzhba pipeline's Unecha junction, that had been attacked nine days prior.\nThe Ukrainian Navy claimed to have carried out an attack on the Khersones air base near Sevastopol, destroying five drones.\n22 August\nThe HUR claimed that five Russian military divers were killed after a Ukrainian naval drone that they were trying to retrieve exploded in Novorossiysk Bay.\nThe HUR claimed that their Bratsvo Unit had repelled a Russian assault in Donetsk Oblast, allegedly killing 90 and capturing five and preventing an attempt to enter Dnipropetrovsk Oblast.\nThe Russian defense ministry claimed that Russian forces took the town of , south of the Kleban-Buk Reservoir and the town of , in the Dobropillia direction.\n23 August\nOne person was killed in a Russian air attack in Synelnykove Raion, Dnipropetrovsk Oblast.\nA Ukrainian Air Force pilot, Major Serhii Bondar, was killed while landing his MIG-29 aircraft following a combat mission.\nThe Russian defense ministry claimed that Russian forces took the town of . Geolocated footage showed that Ukrainian forces retook the town of Mykhailivka, near Myrnohrad.\nDrones were sighted in Leningrad Oblast and St Petersburg, causing the Pulkovo Airport to temporarily suspend operations. Leningrad Oblast Governor Aleksandr Drozdenko stated that four drones were intercepted in Tosnensky District and a drone was intercepted in the towns of Kirishi and Gatchina. St Petersburg Governor Alexander Beglov said that a drone was intercepted in Krasnoselsky District and Pushkinsky District.\nUkrainian soldiers belonging to the 129th Heavy Mechanized Brigade's \"Rugby Team\" Unmanned Systems Battalion crossed the Russian border into Kursk Oblast and raised the Ukrainian flag over what they claimed to be \"ethnic Ukrainian\" land in the villages of Gornal and Guyevo.\n24 August\nThe HUR claimed that Ukrainian forces had retaken the village of Novomykhailivka in Pokrovsk Raion, Donetsk Oblast. The Ukrainian military also claimed to have retaken the villages of Zelenyi Hai, Mykhailivka, and  in the Pokrovsk and Dobropillia direction. Geolocated footage showed that Ukrainian forces retook the town of Novyi Myr in southeast Kharkiv Oblast.\nA fire erupted at the Kursk Nuclear Power Plant after Russia intercepted a Ukrainian drone. Ukrainian drones set fire to Novatek gas terminal in the Ust-Luga Multimodal Complex around 120&nbsp;km west of Saint Petersburg. Social media videos showed damage to a fractionating column of the facility. During the attacks, a passenger aircraft operated by AlMasria Universal Airlines flying from Sharm El Sheikh, Egypt to Saint Petersburg was forced to divert to Tallinn Airport in Estonia following the closure of Pulkovo Airport.\nAtesh claimed to have carried out a sabotage attack on a railway line near Cherkessk in the Russian republic of Karachay-Cherkessia.\nAccording to the Wall Street Journal, the Trump administration authorised the sale of 3,350  Extended Range Attack Munition (ERAM) missiles to Ukraine. It also reported that the US Department of Defense had denied Ukraine permission to fire ATACMS or other US missiles at targets inside Russia. This decision also affected Anglo-French Storm Shadow missiles due to their reliance on US targeting data.\nDuring a visit to Ukraine, Canadian Prime Minister Mark Carney announced a $2 Billion aid package which would include drones, armoured vehicles and munitions.\nThe Russian Defense Ministry claimed that Russian forces took the town of , south of Novopavlivka.\nRussia and Ukraine held a prisoner exchange that saw the release of 146 POWs held by Russia in exchange for the same number of POWs held by Ukraine.\n25 August\nRussian prime minister Mikhail Mishustin signed an order allowing the Russian-occupied cities of Mariupol and Berdiansk to open their ports to foreign ships.\nRussian forces struck Kostiantynivka with an FAB-250, injuring four people.\nUkrainian military observer Kostyantyn Mashovets claimed that Ukrainian forces seized Nove Shakhove and Zapovidne in the Dobropillia direction and that Russian forces had no positions in Pokrovsk. He also claimed that Russian forces took the town of Torske. Geolocated footage showed that Ukrainian forces retook the town of Novomykhailivka, north of Lyman.\nDeepState reported that Russia seized two villages in Dnipropetrovsk Oblast for the first time, Zaporizke and Novoheorhiivka.\nRussian GPS jamming forced a Ukrainian drone into Estonia where it exploded in a field in the village of Koruste in Elva Parish, Tartu County.\n26 August\nThe Ukrainian military officially acknowledged the entry of Russian forces into Dnipropetrovsk Oblast for the first time, saying that there are ongoing clashes in the towns of Zaporizke and Novoheorhiivka.\nIn Crimea, the train station of Urozhaine and the settlement of Chervonohvardiiske were struck by explosions, with local air defence reporting eight drones downed.\nA mine operated by DTEK in an undisclosed location was attacked by Russian drones, killing one employee.\nRussian milbloggers claimed that Russian forces seized Zelenyi Hai,  and  in the Novopavlivka direction.\nThe Ryazan-Moscow oil pipeline exploded, according to the HUR. Local media reported explosions and a fire. The HUR claimed that \"the transportation of petroleum products to Moscow (via the pipeline) has been suspended indefinitely\".\nThe Ukrainian government revised its travel regulations to allow men aged between 18 and 22 years old to leave the country for the first time since the 2022 invasion.\n27 August\nRussian forces launched strikes on the , killing one person and injuring three more. A Russian shell hit the town of Novovorontsovka in Kherson Oblast, killing two people.\nThe Russian defense ministry claimed that Russian forces took the town of Leontovychi, southwest of Pokrovsk. A Ukrainian military analyst reported that Russian forces took the town of Plavni and the Prymorske railroad station in southern Prymorske, Zaporizhzhia Oblast.\n28 August\n.]]\nA Russian air attack on Kyiv killed 25 people, including four children, and injured 63, including 11 children. Among the buildings damaged were the headquarters of the European Union mission to Ukraine and the British Council.\nThe Ukrainian Navy said one of its vessels was hit in a Russian attack that killed two people in unspecified circumstances. The Russian defence ministry claimed that its forces had sunk the Ukrainian medium reconnaissance ship Simferopol near the mouth of the Danube River using a naval drone.\nThe HUR claimed to have carried out an attack that damaged a Russian Buyan-M-class small missile carrier in the Sea of Azov off the Crimean coast.\nUkrainian drones struck the Afipsky oil refinery in Krasnodar Krai, causing a \"large-scale fire\". The Kuibyshev oil refinery in Samara Oblast was also struck causing a fire and explosions. Other unspecified attacks occurred on logistics and ammunition dumps in both Russia and occupied areas of Ukraine.\nHungary issued an entry ban against Robert Brovdi, commander of the Ukrainian Unmanned Systems Forces, in response to Ukrainian drone attacks on the Druzhba pipeline.\nHUR drones destroyed a radar attached to a S-400 missile system.\nRussian milbloggers claimed that Russian forces took the town of Zahryzove, northeast of Borova and the towns of Nove Shakhove, Zapovidne, Vesele, and Krasnyi Lyman in the Pokrovsk-Dobropillia direction, while the Russian defense ministry claimed that Russian forces took the town of , near Toretsk.\nA Ukrainian Neptune missile battery was damaged or destroyed by Russian missiles following an attempt to attack targets in Krasnodar Krai.\n29 August\nA diesel pumping station in Naytopovichi, Bryansk Oblast, was destroyed by Ukrainian forces. The local governor, Alexander Bogomaz, said 18 fixed wing drones had been downed.\nThe Ukrainian military claimed to have destroyed a Russian ammunition depot in Luhansk Oblast and a drone distribution hub in Donetsk Oblast.\n30 August\nOne person was killed in a Russian air attack on Zaporizhzhia.\nThe Ukrainian Dnipro operational-strategic group Spokesperson Colonel Viktor Trehubov reported that Ukrainian forces recaptured the town of  and  near Kupiansk.\nThe Ukrainian I Want to Live project claimed that 18 Russian officers were killed in an arson attack on a command post of the 35th Combined Arms Army near Voskresenska, Zaporizhzhia Oblast.\nUkrainian drones struck two oil refineries in Krasnodar and Syzran. The Krasnodar oil refinery was set ablaze. The HUR claimed to have destroyed an \"underground depot\" at the , which makes gunpowder for the production of propellants for \"small arms, artillery, and rocket engines\", in Tula Oblast. Tula Oblast Governor Dmitry Milyaev claimed that a drone attack had been stopped but falling wreckage landed on an \"industrial enterprise\", while the Russian MoD claimed that a drone had been intercepted.\nDuring Russia's strikes in Dnipropetrovsk Oblast, one person was killed in the  and one person was injured in the  and .\nUkrainian Member of Parliament Andriy Parubiy, who co-founded the Social-National Party of Ukraine and served as the commander of the  during the Revolution of Dignity was shot and killed in the Sykhivskyi District of Lviv.\nSatellite imagery showed the first combat use by Flamingo missiles on six hovercraft at a border guard base operated by the FSB in Crimea. Some three Flamingos were launched destroying the base, killing a Russian soldier and damaging the hovercraft according to Russian media.\nThe Ukrainian military claimed to have destroyed the radar of a Russian S-300 air defense system at Saky air base in Crimea.\n31 August\nThe Belizean-flagged cargo vessel NS Pride was damaged after hitting an explosive in the Black Sea off Chornomorsk, Odesa Oblast.\nRussian strikes hit Kherson, killing one person and injuring six others.\nGeolocated footage showed that Ukrainian forces retook the town of Dachne, south of Novopavlivka. Russian forces claimed to have taken the town of Druzhelyubivka, Kharkiv Oblast.\nReferences"
    }
  ]
}