{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Quebec history (1663–1759)\n\nThis section of the Timeline of Quebec history concerns the events relating to the Quebec portion of New France between the establishment of the Sovereign Council and the fall of Quebec.\n1663-1667\n*1663 – New France becomes a royal province under Louis XIV. The Sovereign Council is created to administer the colonies under the absolute authority of the King.\n*1663 – François de Laval founds the Séminaire de Québec, now known as the Université Laval.\n*1663 – Arrival of Augustin de Saffray de Mézy, first governor named by the King, Monseigneur Laval, royal commissioner Louis Gaudais-Dupont and 150 colonists and craftmen on September 15.\n*1663 – Election of Jean-Baptiste Legardeur de Repentigny, the first mayor of Quebec City on October 17.\n*1665 – Jean-Baptiste Colbert appoints Jean Talon as intendant of New France.\n*1665 – The new governor de Mézy dies of sickness in Quebec City.\n*1665 – Daniel de Rémy de Courcelle becomes governor of New France.\n*1665 – Arrival of the Carignan-Salières Regiment of 1,300 soldiers on June 19.\n*1665 – The Carignan-Salières Regiment destroys five Mohawk nation villages, weakening Iroquois resolve to keep fighting.\n*1666 – A census conducted by Jean Talon in the winter of 1665-1666 showed a population of 3,215 French inhabitants residing in New France.\n*1666 – During the autumn, the soldier of Carignan-Salières, led by Alexandre de Prouville, the \"Marquis de Tracy\" and the governor, invade the Iroquois territory to the south, burn their villages and destroy their crops. See French and Iroquois Wars.\n*1667 – Signing of a peace treaty with the defeated Iroquois\n*1667 – The first Filles du roi (\"King's Daughters\") arrive in New France during the summer.\n1670s\n*1670 – Jean-Baptiste Legardeur de Repentigny establishes Repentigny, Quebec\n*1672 – Louis Buade de Frontenac becomes Governor of New France on April 7.\n*1674 – Creation of the Roman Catholic diocese of Quebec. François de Laval is made Bishop.\n*1675 – The expression coureur des bois is coined to name those who bypass Royal officials and deal directly with the First Nations in the fur trade.\n*1675 – Arrival of the new intendant Jacques Duchesneau de la Doussinière et d'Ambault.\n1680s\n*1682 – Arrival of governor Antoine Lefèbvre de La Barre and intendant Jacques de Meulles\n*1682 – René Robert Cavalier de La Salle takes possession of the basin of the Mississippi River for the king of France.\n*1684 – Pierre-Esprit Radisson, a coureur de bois, is employed by Britain to explore the north for furs.\n*1685 – Jacques-René de Brisay, marquis de Denonville becomes governor of New France.\n*1685 – Louis XIV decrees the Code noir (Black Code) that ordered all Jews out of the French colonial empire, defined the rules for slavery, restricted the activities of free Negroes, and forbade the exercise of any religion other than Roman Catholicism.\n*1689 – Frontenac is reappointed governor of New France.\n*1689 – August 5. Fifteen hundred Iroquois warriors attack the settlement of Lachine, killing or torturing most of its inhabitants.  This incident would become known as the Lachine massacre.\n1690s\n*1690 – Sir William Phips appears with several ships near L'Isle d'Orleans and demands the surrender of the Fort of Quebec. Frontenac refuses and Phips withdraws.\n*1690 – July 2 : One-hundred Iroquois are attacked in the Battle of Coulée Grou resulting in Canadian pioneer Jean Grou and others being burned alive.\n*1690 – New France falls after losing 600 men in war.\n*1692 – Marie-Madeleine Jarret de Verchères becomes a hero in New France for defending a fort against the Iroquois while waiting for French Army reinforcements.\n*1696 – During King William's War French troops seized the Avalon Peninsula in Newfoundland and burned the city of St. John's.\n*1696 – René Lepage de Ste-Claire founded what will become the city of Rimouski later. He installed all his family in the Lower St. Lawrence. He obtained this Seigneurie from Augustin Rouer de la Cardonnière in exchange of a ground which he had on the Île d'Orléans.\n*1698 – Louis-Hector de Callière is made governor of New France after the death of Frontenac in November.\n*1699 – Pierre Le Moyne d'Iberville establishes France's first permanent settlement in Louisiana in what is now the southernmost portion of Alabama.\n1700s\n*1701 – August 4 : Signing of the Great Peace of Montreal between 39 First Nation tribes and the French Colonial government.\n*1702 – Beginning of Queen Anne's War between France and Great Britain.\n*1703 – Philippe de Rigaud Vaudreuil, governor of Montreal, is made governor of New France when de Callière dies in Montreal.\n*1704 – Claude de Ramezay is made governor of Montreal on May 15.\n*1704 – February 29 – Deerfield Massacre : French forces from Quebec and Native American forces under the command of Jean-Baptiste Hertel de Rouville attacked the village of Deerfield, Massachusetts.\n1710s\n*1712 – New France extends from Newfoundland to Lake Superior and from the Hudson Bay to the Gulf of Mexico.\n*1712 – Michel Bégon becomes Intendant of New France\n*1713 – French colonists in all of North America numbered about twelve thousand, while British colonists numbered almost one million.\n*1713 – British destroy Fort St. Louis when left vacant.\n*1717 – French banker John Law's Mississippi Company sets up business in Louisiana and the Mississippi River basin.\n*1719 – Jacques David appointed royal notary of Montreal.\n1720s\n*1720 – Quebec City is fortified by the King of France.\n*1726 – Charles de Beauharnois de La Boische d'Orléans is named Governor of New France.\n1730s\n*1731 – Beginning of the construction of the Chemin du roy between Quebec City and Montreal.\n*1734 – Marie-Joseph Angélique, a black slave, is hanged for allegedly burning the house of her owner.\n1740s\n*1743 – Louis-Joseph Gaultier de La Vérendrye and his brother, François de La Vérendrye, travelling from Fort La Reine, reach the Rocky Mountains.\n*1745 – The fortress of Louisbourg falls to the English.\n*1748 – Signature of the Treaty of Aix-la-Chapelle on October 17.\n*1748 – Roland-Michel Barrin de La Galissonière becomes interim governor of New France.\n*1749 – Jacques-Pierre de Taffanel, marquis de Jonquière becomes governor of New France.\n1750s\n*1752 – Ange Duquesne, marquis de Menneville becomes governor of New France.\n*1754 – A census shows the population of New France to be 55,009 while in Britain's Thirteen Colonies it has reached 1,170,800.\n*1754 – Beginning of the French and Indian War between Great Britain and France for control of the North American colonies. It is part of the Seven Years' War.\n*1755 – Pierre François de Rigaud, Marquis de Vaudreuil-Cavagnal becomes governor of New France.\n*1755 – Beginning of the Acadian Expulsion on July 28.\n*1756 – New commander of the French troops Louis-Joseph de Montcalm arrives in Quebec City and is made subordinate of governor Vaudreuil.\n*1756 – August 29, beginning of the Seven Years' War in Europe.\n*1757 – The French army takes Fort William Henry on August 9.\n*1758 – Battle of Fort Carillon in the night of July 7 to 8. General Montcalm's soldiers resist the attack of General James Abercrombie. See the Battle of Ticonderoga.\n*1759 – Beginning of the Quebec City siege on July 12.\n*1759 – On September 13, the British troops of James Wolfe defeat the French troops of Montcalm in the Battle of the Plains of Abraham near Quebec City.\n*1759 – On September 18, Quebec City surrenders. The government of New France moves to Montreal. See Articles of Capitulation of Quebec.\nReferences\nSee also"
    }
  ]
}