{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of pterosaur research\n\n]]\nThis timeline of pterosaur research is a chronologically ordered list of important fossil discoveries, controversies of interpretation, and taxonomic revisions of pterosaurs, the famed flying reptiles of the Mesozoic era. Although pterosaurs went extinct millions of years before humans evolved, humans have coexisted with pterosaur fossils for millennia. Before the development of paleontology as a formal science, these remains would have been interpreted through a mythological lens. Myths about thunderbirds told by the Native Americans of the modern Western United States may have been influenced by observations of Pteranodon fossils. These thunderbirds were said to have warred with water monsters, which agrees well with the co-occurrence of Pteranodon and the ancient marine reptiles of the seaway over which it flew.\nThe formal study of pterosaurs began in the late 18th century when naturalist Cosimo Alessandro Collini of Mannheim, Germany published a description of an unusual animal with long arms, each bearing an elongated finger. He recognized that this long finger could support a membrane like that of a bat wing, but because the unnamed creature was found in deposits that preserve marine life he concluded that these strange arms were used as flippers. The creature was restudied again in the very early 19th century by French anatomist Georges Cuvier, who recognized both that the creature was a reptile and that its \"flippers\" were wings. He called the creature the Ptero-dactyle, a name since revised to Pterodactylus''.\nAlthough Cuvier's interpretation later became the consensus, it was just one of many early interpretations of the creature and its relatives, including that they were bats, strange birds, or the primordial handiwork of Satan himself. Similar animals like the long-tailed Rhamphorhynchus and Gnathosaurus were soon discovered around Europe and it became obvious that earth was once home to a diverse group of flying reptiles. The British anatomist Sir Richard Owen dubbed this vanished order the Pterosauria. Soon after, he described Britain's own first pterosaur, Dimorphodon. Later in the 19th century pterosaurs were discovered in North America as well, the first of which was a spectacular animal named Pteranodon by paleontologist Othniel Charles Marsh.\nVarious aspects of pterosaur biology invited controversy from the beginning. Samuel Thomas von Soemmering ignited a multi-century debate over how pterosaurs walked on the ground by suggesting they crawled on all fours like bats. August Quenstedt, by contrast, argued that they walked on their hind limbs. In the early 20th century, Hankin and Watson in the first major study of pterosaur flight biomechanics concluded that on the ground these reptiles were altogether helpless and could only scoot along on their stomachs like penguins. The debate gained steam in 1957 when William Stokes reported unusual tracks left by a four-footed animal he suspected was a pterosaur walking along the ground. In 1984, Kevin Padian, who had recently argued that pterosaurs walked on their hind legs, dismissed Stokes's tracks as those of a crocodilian. However, in the mid-1990s, Jean-Michel Mazin and others reported that fossil footprints in Crayssac, France were similar to those reported by Stokes from the US. Mazin's tracks were more obviously pterosaurian in origin and settled the debate in favor of pterosaurs walking on all fours.\nPterosaur paleontology continues to progress into the 21st century. In fact, according to David Hone the early 21st century has seen more progress in pterosaur paleontology than in \"the preceding two centuries\" combined. He compared this transformative period in pterosaur paleontology to the Dinosaur Renaissance of the 1970s. He also observed that roughly one-third of known pterosaurs were discovered during this brief interval. One of the most notable of these was Darwinopterus, whose body resembled the more primitive long-tailed \"rhamphorynchoids\", while its skull resembled those of the more advanced short-tailed pterodactyloids. These traits establish the species as an important transitional form, documenting one of the most important phases of pterosaur evolution. Another important new species is Faxinalipterus minima, which might well be the world's oldest pterosaur. The first confirmed pterosaur eggs were also reported from China during the early 21st century.\nPrescientific\n* The Cheyenne people of Nebraska believed in mythical thunderbirds and water monsters that were in endless conflict with each other. The thunderbirds were said to resemble giant eagles and killed both people and animals with arrows made of lightning. People occasionally discovered stony arrowheads thought to come from the thunderbirds' arrows. According to folklorist Adrienne Mayor, these supposed arrowheads were likely fossil belemnites, which were compared to missiles by other indigenous American cultures, like the Zuni people.\n* The fossils of the Niobrara chalk may have been influential on these stories. The pterosaur Pteranodon and marine reptiles like mosasaurs are preserved in Niobrara Chalk deposits and associated remains may have been interpreted as evidence for antagonism between immense flying animals and serpentine aquatic reptiles. Fossils of the large toothed diving bird Hesperornis are also found in the Niobrara chalk, sometimes preserved inside specimens of large predatory marine reptiles. Observations of similar fossils in the past may have been seen as further evidence for thunderbird-water monster conflict.\n* The Sioux people of South Dakota believed that the first creatures in creation were the insects and reptiles, who were ruled by the Water Monster Unktehi. Reptiles were very diverse and came in all shapes and sizes, but they became violent and bloodthirsty until they were petrified by lightning sent by the Thunder Birds. The physical bodies of the Thunder Beings killed by the lightning, including Unktehi, also ended up being buried. The Sioux believe that earth has a history of four distinct ages. These events occurred during the Age of Rock. This portrayal of the Thunder Birds may also have been influenced by associations of fossils of Pteranodon with marine reptiles of the same age in the western United States.\n18th century\n'']]\n1780s\n1784\n* Cosimo Alessandro Collini, keeper of the natural history collections of Mannheim, reported the skeleton of an unusual animal to the scientific literature. It had strange arms that could have supported a membrane like that of a bat's wing, yet it was preserved in rocks characterized by fossil of marine life. Based on these associations, he tentatively concluded that the animal was aquatic.\n19th century\n, the naturalist who recognized pterosaurs as flying reptiles]]\n1800s\n1801\n* French anatomist Georges Cuvier restudied Collini's bizarre fossil, based on his published illustration. He reinterpreted its forelimbs as wings and deemed it a flying reptile.\n1802\n* The strange fossil described by Collini was moved from Mannheim to Munich.\n1807\n* German anatomist Johann Friedrich Blumenbach interpreted Collini's animal as a bird, specifically, as some kind of waterfowl.\n1809\n* Cuvier named the flying reptile reported by Collini Ptéro-Dactyle.\n1810s\n]]\n1812\n* In contrast to Cuvier and Blumenbach, Samuel Thomas von Soemmering interpreted Collini's fossil as a mammal. Specifically, he interpreted it as an unusual bat, which morphologically linked mammals with birds. He named this strange creature Ornithocephalus. Soemmering may have interpreted this series of forms in an evolutionary sense, following the early evolutionary ideas of Jean-Baptiste de Lamarck. Soemmering's analysis of the specimen was blemished by anatomical errors, like the misidentifications of bones. Soemmering agreed with Cuvier that the creature was a flying insectivore, however. Soemmering argued that pterosaurs walked on all fours like bats when on the ground. His advocacy for this interpretation of pterosaur terrestrial gait has been regarded as the beginning of a multi-century debate on the subject.\n1817\n* Soemmering reported the discovery of a second pterosaur specimen. This second specimen was smaller than the first, with a 25&nbsp;cm wingspan, and possessed a shorter snout. These traits mislead Soemmering into greater confidence in his interpretation of pterosaurs as bats. This specimen reminded him of the parti-colored bat.\n1819\n* Cuvier renames Ptéro-Dactyle into the current generic name Pterodactylus, but assigning P. longirostris (now considered a synonym of the type species P. antiquus) as the type species of the genus.\n1820s\n.]]\n1824\n* Cuvier reiterated his previous conclusions that the Ptero-Dactyle was a reptile that flew with membranous wings. He also advanced novel speculations about its paleobiology, like that it used the claws on its wings to climb trees and \"crawled\" quadrupedally when not in flight rather than walking on its hind limbs.\n1825\n* Paleontologist Georg Graf Munster discovered an unusual skull. He sent the fossil to Soemmering, who thought it belonged to an ancient sea bird. He also sent a cast of the skull to August Georg Goldfuss, who recognized it as a pterosaur. Goldfuss described the new species Pterodactylus muensteri based on the specimen.\n1827\n* Gideon Mantell discovered some fossil bones in the Wealden beds (Wessex Formation) of Sussex, England that he believed were the remains of ancient birds.\n* Mantell recognized that his \"bird\" bones were actually pterosaur fossils and reported his findings to the scientific literature. These were the first Cretaceous pterosaur fossils ever described.\n1829\n* William Buckland described the new species Pterodactylus macronyx based on fossil remains discovered by Mary Anning in December the previous year from the Lias Group of the Dorset Coast of England. These were the first scientifically documented pterosaurs to be discovered outside of the Solnhofen lithographic limestone.\n1830s\nand William Buckland]]\n1830\n* Carl von Theodori described the new species Pterodactylus banthensis from Franconia.\n* Georg Wagler argued that pterosaurs represented a distinct class of aquatic vertebrates that he called Gryphi. Like Collini, Wagler thought that pterosaurs swam underwater using their forelimbs as flippers.\n1831\n* August Goldfuss depicted pterosaurs as flying reptiles that used their wing claws to climb cliffs. He hypothesized that on land, they would have had to travel on all fours. He also suggested that they may have been covered in hair.\n1832\n* von Meyer described the new genus Rhamphocephalus.\n1833\n* von Meyer described the new genus and species Gnathosaurus subulatus.\n1834\n* Johann Jacob Kaup first referred to pterosaurs by that name.\n1836\n* William Buckland depicted pterosaurs as cliff-climbing winged reptiles in a manner heavily influenced by Goldfuss.\n1837 --> 1839\n* Graf Munster received a complete skeleton of \"Pterodactylus\" munsteri which revealed the presence of a long bony tail in this species.\n1840s\n1840\n* Thomas Hawkins published The Book of the Great Sea-Dragons, wherein he suggested that the great reptiles of the Mesozoic were created by the devil. He described pterosaurs as \"an engrafted-by-Evil stock\" and depicted them as bat-like scavengers that combed the ancient seashore.\n1842\n* Sir Richard Owen formally named the order Pterosauria.\n1843\n* Edward Newman interpreted pterosaurs as mammals in a similar fashion to Soemmering. However, Newman specifically considered pterosaurs to be carnivorous flying marsupials.\n1847\n* von Meyer erected the genus Rhamphorhynchus''.\n1850s\n1851\n* Two pterosaurs sculpted by Benjamin Waterhouse Hawkins were put on display in England's Crystal Palace. These were the first three-dimensional life-size restorations of pterosaurs.\n1855\n* von Meyer described the new genus and species Ctenochasma roemeri.\n.]]\n1855\n* August Quenstedt described the species Pterodactylus suevicus from the Nusplingen lithographic limestone. In this publication he argued that pterosaurs would have walked bipedally on the ground.\n1856\n* Albert Oppel reported the discovery of a pterosaur lower jaw from the Posidonia shales of Holzmaden. This was the first pterosaur specimen to be reported from these deposits, which would go on to produce many pterosaur fossils of exceptional quality.\n1859\n* Sir Richard Owen erected the new genus Dimorphodon for the species \"Pterodactylus\" macronyx.\n* Buckman described a clutch of 4.5&nbsp;cm long oval-shaped fossil eggs from Middle Jurassic marine rock in the United Kingdom. He erected the new oogenus and oospecies Oolithes bathonicae for them, the first time fossil eggs had been given their own unique taxonomic name.\n1850s – 1860s\n1859 – 1860\n* Meyer described 40 specimens of Pterodactylus. Among these specimens he reported more than 20 species. Most of these species are not recognized as distinct today and generally represent the misguided application of new names to members of known species at different ages. One species was not even a pterosaur; the \"Pterodactylus\" crassipes type specimen would later be recognized as the \"Haarlem\" specimen of Archaeopteryx. He also reported the presence of pterosaurs in the lithographic limestone of Cerin, France.\n1860s\n.]]\n1860\n* Andreas Wagner erected the new genus Dorygnathus for the species Pterodactylus banthensis.\n1861\n* Wagner described the new genus Scaphognathus for the species Pterodactylus crassirostris.\n1862\n* Oppel described the new species Ctenochasma gracile. He also interpreted some tracks from the Solnhofen lithographic limestone as pterosaur tracks. This was the first report of potential pterosaur tracks to the scientific literature.\n1863\n* The book \"La Terre avant Le Deluge\" by Louis Figuier was published. It included an early restoration of a Rhamphorhynchus walking across the ground on all fours. This depiction was based on fossil footprints from the Solnhofen limestone attributed to the taxon.\n1869\n* Harry Govier Seeley described the new genus Ornithocheirus.\n1870s\n]]\n]]\n(left) and his rival Edward Drinker Cope (right)]]\n]]\n]]\n]]\n1870\n* Seeley described the new genus Cycnorhamphus and the new species Ornithocheirus huxleyi.\n* Seeley argued that pterosaurs represented the evolutionary transitional form between reptiles and birds, distinguished from the traditional reptiles by a warm-blooded metabolism as well as bird like anatomy, physiology and terrestrial gait. The claim ignited a \"violent controversy\" with the Owen due to his more traditional perspectives on pterosaurs and his hostility to evolutionary theory.\n* Othniel Charles Marsh described the new genus and species Laornis edvardsianus.\nNovember, late''\n* Marsh's Yale Peabody Museum crews visited Kansas. Marsh discovered the first Pteranodon wing bones. These were the first scientifically described pterosaur fossils from North America.\nNovember – December 31st\n* Sir Richard Owen expressed astonishment at the North American discovery of pterosaurs exceeding the size of warm-blooded birds and mammals, given his interpretation of the group as typical cold blooded reptiles.\n1871\n* Seeley described the new genus Ornithostoma for a toothless pterosaur from the Cambridge Greensand. He also described the new genus Diopecephalus. He observed that pterosaurs had large, birdlike brains.\n* Marsh discovered further Pteranodon remains.\n* Marsh discovered the type specimen of Pterodactylus velox.\n* Marsh described the new species Pterodactlus oweni based on some Pteranodon wing bones. He attributed teeth to the species.\n* Edward Drinker Cope discovered at least two Pteranodon specimens.\n* William Carruthers described two new oospecies of Oolithes and suggested that these fossil eggs were laid by pterosaurs.\n1872\n7 March\n* Marsh described the species Pterodactylus ingens. He continued to attribute teeth to Pteranodon. Marsh realized that his species name Pterodactylus oweni had already been used, so renamed it Pterodactylus occidentalis. Marsh also named Pterodactylus velox.\n12 March\n* Cope also attributed teeth to Pteranodon.\n* Cope described the new species Ornithochirus umbrosus and O. harpyia.\n* Cope published an additional paper on his \"Ornithochirus\" species. This paper was read before the American Philosophical Society.\n12 March – 31 December\n* An anonymous review synonymized Cope's Ornithochirus umbrosus and O. harpyia with Marsh's Pterodactylus ingens and Pterodactylus occidentalis, respectively.\n1874\n* Cope acknowledged the validity of Marsh's Pterodactylus ingens and P. occidentalis, but continued to insist that his O. umbrosus was a valid species, although he came to refer it to Pterodactylus. This paper included the first illustrations of Pteranodon wing bones.\n* A pterosaur fossil bearing an impression of the wing membrane was discovered. This was the first physical evidence of the structure which had previously been inferred purely from skeletal anatomy.\n* Owen described the new genus Coloborhynchus.\n1875\n* Cope argued that his Ornithochirus species supposedly synonymous with Marsh's Pterodactylus species actually had priority because while Marsh's description was published first, Cope's would have been if not for delays caused by a fire at the publisher.\n* Mudge discovered the type specimen of Pteranodon comptus.\n* Seeley described the new genus Doratorhynchus.\n1876\nMay\n* Samuel Wendell Williston discovered the type specimen of Pteranodon.\nMay – 31 December\n* Marsh described the new genus and species Pteranodon longiceps and referred the toothless American pterosaurs to the new order Pteranodontia. He also described the new species Pteranodon comptus and P. gracilis.\n* Marsh published additional research on American pterosaurs. He acknowledged that his referral of teeth to the genus was an error. Marsh described the new genus Nyctosaurus for \"Pteranodon\" gracilis.\n* Williston helped excavate the Pteranodon specimen YPM 1177.\n* Brous and Williston helped excavate the Pteranodon specimen YPM 2473.\n1877\n* Charles H. Sternberg discovered AMNH 5098, a Pteranodon specimen with fossil fish and crustacean remains preserved in its throat pouch in Kansas.\n1880s\nfrom an 1882 publication by Othniel Charles Marsh]]\n\" (actually just a juvenile Ctenochasma)]]\n1881\n* Marsh described the new genus Dermodactylus as well as the new genus and species Laopteryx priscus.\n* Marsh renamed Nyctosaurus Nyctodactylus under the mistaken belief that the latter genus was preoccupied.\n1882\n* Marsh described the new species Rhamphorhynchus phyllurus from the Solnhofen lithographic limestone. The type specimen displayed exquisitely preserved impressions of the animal's wing membranes as well as a diamond shaped fin at the end of the tail. Marsh thought that this fin was oriented vertically because it was slightly asymmetrical and could be used help the pterosaur steer as it flew. However, Marsh's hypothesis regarding the orientation of the tail vane would later become controversial.\n* Karl Alfred von Zittel described a fossil Rhamphorhynchus wing from the Solnhofen lithographic limestone that also preserved lifelike impressions of the wing membrane. He observed that the wing of Rhamphorhynchus was strengthened by fibrous tissue. Based on this specimen, Zittel concluded that in life Rhamphorhynchus had relatively narrow wings, whereas Marsh thought the wings were much wider. The wing Zittel studied has been known as the \"Zittel wing\" in his honor ever since.\n1884\n* Marsh reported that by this time the Yale Peabody Museum curated over 600 Pteranodon specimens. He also published more information about the skull of the Pteranodon type specimen and illustrated it. Marsh suspected that Pteranodon lacked a sclerotic ring, since one was absent in even well-preserved specimens.\n1886\n* Francesco Bassani described the new genus and species Tribelesodon longobardicus from Besano, Italy as the first known Triassic pterosaur.\n1887\n* Seeley described the new genus and species Ornithodesmus cluniculus.\n1888\n* Richard Lydekker described the new genus Ptenodracon for the second pterosaur specimen to be discovered. This genus is now regarded as a junior synonym of Pterodactylus because the traits supposedly \"Ptenodracon\" instead indicate that the specimen was a juvenile.\n* Newton reported the discovery of an endocast of a pterosaur brain in the Lias of Whitby, England. The find revealed that pterosaur brains were more like modern birds than reptiles.\n1890s\nin 1891]]\n1891\n* Wiliston published what paleontologist Michael Everhart called the first complete description of Pteranodon this year. Notable observations in this publication include the discovery of a sclerotic ring in this taxon. Williston also found a coprolite containing tiny, indeterminate bone fragments preserved in one Pteranodon pelvic area. Williston also argued that previous estimates of Pteranodon wingspan were exaggerated and that the maximum wingspan of the genus was just short of 20 feet.\n1892\n* Williston disputed the length of Pteranodon crest in Marsh's 1884 reconstruction.\n* Williston published a redescription of the skull of Pteranodon based on a more recently discovered and better preserved specimen, KUVP 2212. He also criticized the length of Pteranodon crest in Marsh's 1884 reconstruction of the specimen YPM 1177 as being too speculative given the quality of its preservation. Williston speculated that Pteranodon-like fossils would be one day discovered in Europe, and that in this case Pteranodon was probably a junior synonym of Ornithostoma.\nIn this paper Williston also described a new, relatively complete Nyctosaurus specimen. He noted that the only published trait distinguishing the genus from Pterodactylus was an absence of teeth and recommended synonymizing these two genera if \"Nyctosaurus\" teeth were ever found.\n1893\n* Williston argued that Pteranodon was a junior synonym of Ornithostoma. He praised Cope for recognizing these affinities, while lambasting Marsh for being unable to do so despite having a larger number of specimens. According to Everhart, Williston's criticism of Marsh may have been motivated by mistreatment at his hands while he worked for him.\n1895\n* Williston published a description of the lower jaw of Pteranodon. This was the first such specimen not to be \"crushed from side to side\".\n1896\n* Williston published a description of another Pteranodon skull and synonymized the genus with Ornithostoma.\n1897\n* Williston reported that Seeley was also unable to find any trait in Pteranodon distinguishing it from Ornithostoma.\n20th century\n1900s\n1901\n* Felix Plieninger formally divided the pterosaurs into two suborders, the long-tailed Rhamphorhynchoidea and the short-tailed Pterodactyloids.\n* Seeley published Dragons of the Air. This was the first \"serious boo[k]\" about pterosaurs. In it he restored pterosaurs with the wing membrane attached to the hindlimb.\n1902\n* Williston published further anatomical description of Nyctosaurus based on a recently discovered well-preserved specimen now catalogued as FMNH 25026. He estimated its live weight as less than five pounds. He interpreted the skull as completely lacking a crest.\n* Williston published another paper about FMNH 25026 in which he described the skull in detail and photographed it.\n* Williston published a popular article about pterosaurs for Popular Science Monthly. In this article, Williston restored pterosaurs with the wing membrane attached to the hindlimb. According to Everhart, by this point Williston had \"largely given up\" in his attempts to synonymize Pteranodon with Ornithostoma.\n]]\n1903\n* Williston observed that the generic name Nyctosaurus was not actually preoccupied. He speculated that Marsh probably came to believe that it was preoccupied because of the existence of a higher order taxon called Nyctisauria. Since Nyctosaurus was not preoccupied, Williston reclassified \"Nyctodactylus\" back to the original genus. Williston also described the new genus and species Apatomerus mirus for a partial pterosaur femur from the Kiowa Shale of Kansas. This specimen is now catalogued as KUVP 1198. This paper contained a notable error wherein Williston claimed that Pteranodon'' lacked a fibula.\n* George Francis Eaton published a paper defending Marsh's research on Pteranodon against Williston.\n'']]\n1904\n* Eaton published a paper defending Marsh's research on Pteranodon against Williston. Some of Eaton's criticisms have since come under fire. For instance, Everhart has noted that Eaton's criticism of Williston for reporting a sclerotic ring in Pteranodon rather than Nyctosaurus ignored the fact that Eaton had found sclerotic rings in both genera.\n* Williston published a paper on pterosaur fingers.\n1907\n* Plieninger described the species Rhamphorhynchus kokeni from the Nusplingen lithographic limestone.\n* Woodward described the new genus and species Scleromochlus taylori.\n1910s\n1910\n* Eaton published his doctoral dissertation on the osteology of Pteranodon. This publication was the most significant work about Pteranodon as well as large pterosaurs generally for many decades afterward. In this monograph, he restored pterosaurs with the wing membrane attached to the hindlimb. He concurred with earlier work by Marsh and Williston that Pteranodon had a short tail. According to Everhart, Eaton toned down his former stridently defensive attitude toward Marsh and warmed up somewhat to Williston's work. He noted that the supposed wing bones of Pteranodon comptus were actually Nyctosaurus tibiae and that P. ingens and P. occidentalis were only distinguishable by their sizes. Everhart also noted that Eaton actually followed some of Williston's work \"too closeley\" and repeated Williston's erroneous claim that Pteranodon lacked a fibula.\n* Williston finally confirmed the presence of a fibula in Pteranodon, correcting his previous error that mislead Eaton.\n1911\n* Williston published a favorable review of Eaton's dissertation and conceded that his earlier criticism of Marsh's Pteranodon skull reconstruction was baseless.\n* Williston published a restoration of Nyctosaurus. This was his last paper on pterosaurs.\n]]\n]]\n1913\n* Hooley described the new subfamily Ptenodraconinae based on Lydekker's misguided genus Ptenodracon.\n1914\n* Hooley described the new genus Lonchodectes.\n* Hankin and Watson published the first study of the aerodynamics of pterosaur flight. They concluded that Pteranodon spent much more time soaring than actively flapping. On the ground, however, Hankin and Watson argued that pterosaurs would have been \"completely helpless\" and could only move about by \"pushing themselves along, after the manner of penguins.\"\n1918\n* Arthaber described the new genus and species Parapsicephalus.\n1920s\n1920\n* Wiman published a description of the fossils purchased by the Paleontological Museum in Uppsala, Sweden from C. H. Sternberg, which included Pteranodon fossils. He confirmed the presence of a fibula in some of the specimens.\n]]\n]]\n1921\n* Friedrich von Huene described the new genus Rhabdopelix.\n1922\n* Nopcsa described in detail and reconstructed Bassani's purported Triassic pterosaur from Italy, Tribelesodon.\n1923\n* Döderlein described the new genus Anurognathus.\n1925\n* Abel argued that pterosaurs would have to walk on all fours when not in the air, like a modern bat.\n1927\n* Broili described possible fossil evidence for a hair like body covering in pterosaurs from Germany.\n1928\n* Strand described the new genus Campylognathoides.\n* Nessov described the new genus Bennettazhia.\n1929\n* Bernhard Peyer discovered that the purported Triassic pterosaur Tribelesodon was actually a juvenile Tanystrophaeus, whose long neck vertebrae were mistaken for a wing-finger.\n1930s\n1937\n* Koh described the new species Rhamphorhynchus intermedius.\n1938\n* Kenneth Caster conclusively demonstrated that unusual fossil tracks from the Solnhofen lithographic limestone variously attributed to creatures like Archaeopteryx, little dinosaurs, or pterosaurs were actually made by horseshoe crabs, as specimens had been found literally \"dead in their tracks\".\n1939\n* Broili described the new genus and species Belonochasma aenigmaticum.\n1940s\nat the end of a type of fossil trackway once attributed to pterosaurs]]\n1940\n* Caster reported finding a dead horseshoe crab at the end of a type of fossil trackway once attributed to long-tailed pterosaurs.\n1943\n* Brown reported a Pteranodon specimen with the remains of two fish species and a crustacean preserved where its throat pouch would have been in life.\n1948\n* Riabinin described the new genus and species Batrachognathus volans.\n1950s\n]]\n1952\n* George F. Sternberg discovered an unusual Pteranodon skull in Kansas, FHSM VP-339 that would later serve as the type specimen of the species Pteranodon sternbergi.\n1954\n* Ambroggi and Lapparent described the new ichnogenus and ichnospecies Agadirichnus elegans. They attributed these tracks to a lizard.\n1956\n* Sternberg discovered another specimen of P. sternbergi near WaKeeney, Kansas which is now catalogued as FHSM VP-184. This specimen lacked a skull and was smaller than the type. In life it would have had a roughly 12.5 foot wingspan.\n1957\n* Stokes described the new ichnogenus and species Pteraichnus saltwashensis from the Late Jurassic Morrison Formation of Utah, USA, interpreting them as pterosaur tracks. Stokes reported the presence of an impression left by the putative pterosaurian trackmaker's wing finger, although this claim is probably mistaken. If his identification of these tracks was correct, it would mean that pterosaurs walked on all fours.\n* Eric von Holst published an experimental study of Rhamphorhynchus flight biomechanics that utilized a flapping scale model. Because the model could only fly when its tail vane was oriented horizontally rather than vertically, von Holst concluded that Marsh's original reconstruction was erroneous.\n1958\n* Sternberg and Walker reported the second P. sternbergi specimen to the scientific literature.\n* Kuhn accepted the pterosaurian interpretation of Pteraichnus.\n1960s\n.]]\n.]]\n1962\n* George Sternberg discovered a nearly complete Nyctosaurus specimen near Elkader, Kansas which is now catalogued as FHSM VP-2148.\n1963\n* Delair described the new ichnogenus and ichnospecies Purbeckopus pentadactylus. Delair did not recognize the tracks as pterosaurian.\n1964\n* Bonner reported the Elkader Nyctosaurus discovered by Sternberg to the scientific literature and described the new species N. sternbergi based on it.\n* C. C. Young described the new genus Dsungaripterus from Early Cretaceous rocks in China.\n* Young described the new genus Germanodactylus.\n* Kuhn continued to accept the pterosaurian interpretation of Pteraichnus.\n1965 -->\n1966\n* Harksen described the new species Pteranodon sternbergi. Unlike P. longiceps, this species had a short, wide crest.\n1968\n* Peter Wellnhofer published a revision of the taxonomy of Pterodactylus. It was his first publication about pterosaurs.\n1969\n* Colbert described the new genus and species Nesodactylus hesperius.\n1970s\n]]\n]]\n]]\n]]\n1970\n* John Ostrom reported that the type specimen of \"Pterodactylus\" crassipes actually represented a fourth specimen of Archaeopteryx. This was the fourth specimen referrable to that genus ever discovered.\n* Bonaparte described the new genus and species Pterodaustro guinazui. This genus was the most extremely specialized filter-feeding pterosaur known to science.\n1971\n* Miller published a review of Pterandon known fossil record and proposed a new classification scheme for the species in the genus. However, his scheme has largely since been rejected. He also observed that Nyctosaurus sternbergi was a preoccupied species name and renamed it N. bonneri after its describer.\n* Miller described a new specimen of Pteranodon longiceps discovered near Elkader, Kansas which is now catalogued as FHSM VP-2183.\n* Heptonstall published an article on the biomechanics of Pteranodon flight.\n* Sharov described the new genus and species Sordes pilosus from Late Jurassic rocks in Kazakhstan. The type specimen seemed to reveal the presence of a body covering of hair-like filaments.\n* Price reported the first pterosaur fossils from the lagerstatten Crato and Santana formations of Brazil. These deposits would go on to be some of the most important pterosaur fossil sources in the world due to their high quality three dimensional preservation.\n* Price described the new genus and species Araripesaurus castilhoi.\n*Wild described the new species Dorygnathus mistelgauensis.\n* Haubold accepted the pterosaurian interpretation of Pteraichnus.\n1973\n* Rocco Zambelli described the new genus and species Eudimorphodon ranzii from the Upper Triassic of Bergamo, Italy. This was the first true Triassic pterosaur.\n* Young described the new genus and species Noripterus complicidens.\n1974\n* Bramwell and Whitfield re-examined the biomechanics of Pteranodon flight after an extended lull in research on the topic. They estimated that a Pteranodon with a 7 m wingspan would have a mass of about 16&nbsp;kg. To stay aloft, such a Pteranodon would need to fly at least 6.7&nbsp;m/s, which is regarded as an \"extremely low\" minimum speed. Such a load would have allowed it to take off or land \"gently\". Bramwell and Witfield argued that the biomechanics may have left Pteranodon vulnerable to increasing wind speeds resulting from climate change as the Late Cretaceous proceeded and even tentatively suggested that this may have been the cause of extinction for the genus.\n* Fabre described the new genus Gallodactylus.\n* Casamiquela described the new genus and species Herbstosaurus pigmaeus.\n1975\n* Stein published an article on the biomechanics of Pteranodon flight. He crafted model Pteranodon wings and tested them in a wind tunnel. He found that Pteranodon was a capable, maneuverable flyer but was best adapted to long distance flights at low velocities. Stein calculated that a large Pteranodon would have to fly at least 10 miles an hour to stay airborne. He concluded that Pteranodon would have had to land on its hind feet because making the front feet ready for landing would collapse the wings, which would no longer be useful for keeping the pterosaur aloft. Stein's conclusions contradicted the previous findings of Bramwell and Whitfield.\n* Lawson described the new genus and species Quetzalcoatlus northropi.\n1977\n* Wellnhofer described the new genus and species Araripedactylus dehmi.\n* Logue reported Pteraichnus-like tracks in Wyoming.\n1978\n* Wild described the new genus and species Peteinosaurus zambellii. In this paper he also described Eudimorphodon in greater detail.\n* West reported Pteraichnus-like tracks in Oklahoma.\n* Wellnhofer argued in favor of quadrupedal pterosaurs.\n* Stokes reported additional potential pterosaur tracks from the Navajo Formation.\n1979\n* Kevin Padian published a study on the biomechanics of pterosaur flight.\n* Stokes and Madsen reported additional potential pterosaur tracks from the Navajo Formation.\n1980s\n1980\n* Brower published an article on the biomechanics of Pteranodon flight. His conclusions contradicted the findings of Bramwell and Whitfield, however.\n* de Buisonjé described the new genus and species Santanadactylus brasilensis.\n1981\n* Frey and Riess published a study on the biomechanics of pterosaur flight.\n* Galton described the new genus and species Comodactylus ostromi.\n1982\n* Dong described the new genus and species Huanhepterus quingyangensis.\nas a biped]]\n]]\n1983\n* Frey and Riess published a study on the biomechanics of pterosaur flight.\n* Padian argued that the wing membrane of pterosaurus probably did not attach to the hindlimb and that pterosaurs had narrow wings comparable in proportion to those of modern soaring sea birds. He also argued based on the skeletal anatomy of Dimorphodon that it and other pterosaurs probably walked on their hind legs when not airborne.\n* Padian published an additional paper arguing for bipedal pterosaurs.\n* Brower studied the aerodynamics of Nyctosaurus and Pteranodon by comparing them to hang gliders. He concluded that both were unable to ascend or descend at high speed. He thought that they spent most of their time soaring rather than actively flapping. Brower thought Pteranodon itself to be entirely incapable of flapping flight. His conclusions contradicted the previous findings of Bramwell and Whitfield.\n* He, Yan and Su described the new genus and species Angustinaripterus longicephalus.\n* Wild described the new genus and species Preondactylus buffarinii.\n* Leonardi and Borgomanero described the new genus and species Cearadactylus atrox.\n1984\n* Nessov described the new genus and species Azhdarcho lancicollis.\n* Kevin Padian and Paul Olsen reinterpreted the supposed pterosaur tracks named Pteraichnus from the Morrison Formation of Utah as crocodilian tracks. They argued in favor of bipedal pterosaurs.\n* Padian described the new genus and species Rhamphinion jenkinsi.\n* Kellner described the new genus and species Brasileodactylus araripensis.\n* Haubold continued to accept the pterosaurian interpretation of Pteraichnus. He also argued that pterosaurs were quadrupedal.\n1985\n* Schultz and others argued that the type specimen of Apatomerus mirus was not actually a pterosaur fossils.\n* Aeronautical engineer Alan McCready designed a flying model of Quetzalcoatlus in an experimental attempt to ascertain how a creature of its size could even be capable of flight. However, his results were inconclusive.\n* Campos and Kellner described the new genus and species Anhanguera blittersdorffi.\n1986\n* Martins Neto described the new genus and species Pricesaurus megalodon.\n* Unwin published a paper regarding the debate over the identity of the Pteraichnus trackmaker.\n1987\n* Bennett observed that the tail of Pteranodon was longer than generally thought, being at least 19&nbsp;cm on a Pteranodon with a 7.5 m wingspan. He hypothesized that this lengthier tail could have supported an additional membrane that would have assisted the animal's pitch during flight. However, Bennett has subsequently disavowed the idea that Pteranodon supported a membrane with its tail.\n* Nessov and Borkin described the new genus Arambourgiania.\n* Padian published another paper arguing for bipedal pterosaurs.\n* Conrad and others \"assumed\" that the ichnogenus Purbeckopus was produced by a crocodylian.\n* Unwin published a paper regarding the debate over the identity of the Pteraichnus trackmaker.\n* Leonardi suggested that the supposed pterosaur footprints Stokes reported from the Navajo Formation in the 1970s were actually produced by the same kind of non-pterosaurian animal that made Batrachopus.\n]]\n1988\n* Russell estimated that by this time 878 Pteranodon specimens were known.\n* Pennycuick published a study on the biomechanics of pterosaur flight.\n* Wellnhofer studied the range of motion in the hip and hind limbs of three-dimensionally preserved pterosaur fossils from the Crato Formation of Brazil for insight into their terrestrial gait. He concluded that they walked on all fours.\n* Kellner and Campos described the new genus and species Tupuxuara longicristatus.\n1989\n* Kellner described the new genus and species Tapejara wellnhoferi.\n* Jensen and Padian described the new genus and species Mesadactylus ornithosphyos.\n* Nessov and Yarkov described the new genus Bogolubovia.\n* Prince and Lockley \"assumed\" that the ichnogenus Purbeckopus was produced by a crocodylian.\n* Unwin published a paper regarding the debate over the identity of the Pteraichnus trackmaker.\n* Gillette and Thomas reported additional potential pterosaur footprints.\n1990s\nand P. sternbergi. The grey areas were not preserved in their respective specimens.]]\n1990\n* Michael Everhart discovered his first Pteranodon specimen in Kansas. In life it would have had a roughly 14 foot wingspan.\n* Stewart reported that Nyctosaurus and Pteranodon made their first appearances in the stratigraphic column in the middle of the Smoky Hill Chalk, which dates back to the Santonian.\n* Bennett published a study of the biostratigraphy of Pteranodon. He found that the type specimen of P. sternbergi was discovered in the lower chalk, while the type specimen of P. longiceps was discovered in the upper portion of the chalk.\n1991\n* Peter Wellnhofer published The Illustrated Encyclopedia of Pterosaurs. Wellnhofer's book was only the second serious book about pterosaurs ever published. In it, he argued that Othniel Charles Marsh was correct to reconstruct the tail vane of Rhamphorhynchus with a vertical orientation based on its asymmetry and also provided additional evidence for this orientation based on the shape of its tail vertebrae. Wellnhofer also observed that pterosaurs had large, birdlike brains. Wellnhofer also argued in favor of quadrupedal pterosaurs.\n* Chatterjee described the new genus and species Protoavis texensis.\n]]\n]]\n1992\n* Bennett published a study of sexual dimorphism in Pteranodon using 400 specimens. He found there to be two size based morphs, a larger form with a larger crest and narrow pelvis and a small form with a small crest and wide pelvis. He concluded that the larger form was male and the smaller form was female. He found that female Pteranodon outnumbered male Pteranodon by 2:1. Bennett argued that since large crests were only associated with one size morph, that it functioned purely as display. He also hypothesized that Pteranodon sternbergi was the direct ancestor of Pteranodon longiceps.\n* Bennett argued that the purported pterosaur footprints reported by Gillette and Thomas were actually produced by crocodylians.\n* Lockley and others reported the presence of Early Cretaceous pterosaur tracks in Spain.\n1993\n* Moratalla reported the presence of Early Cretaceous pterosaur tracks in Spain.\n1994\n* Bennett studied the Pteranodon remains curated by the Yale Peabody Museum. His research debunked several claims originally made by O. C. Marsh. The teeth Marsh originally referred to Pteranodon Bennett attributed to the fish genus Xiphactinus. Bennet also argued that none of the Pteranodon species Marsh named after P. longiceps were actually distinct from it. Bennett criticized conclusions drawn by Miller and Harksen as well. Bennett criticized the former's 1971 classification scheme for Pteranodon species and the latter's 1966 reconstruction of Pteranodon sternbergi as having excessively long jaws. Nyctosaurus also received some attention in this paper. Bennett concluded that N. bonneri was a junior synonym of N. gracilis.\n* Unwin and Bakhurina published a paper arguing that much of the supposed soft tissue impressions of the Sordes type specimen were not the remains of a furry body covering. Instead, they seemed to be the remains of the fibrous tissue that reinforced the wing membrane.\n* Frey and Martill described the new genus and species Arthurdactylus conandoylei.\n* Cai and Wei described the new genus and species Zhejiangopterus linhaiensis.\n* Kellner and Campos described the new species Tupuxuara leonardii.\n* Lee described the new species Coloborhynchus wadleighi.\n* Logue reported the discovery of a new fossil track site featuring Pteraichnus-like traces.\n* Moratalla and others reported fossil pterosaur footprints in Europe.\n.]]\n]]\n1995\n* Jean-Michel Mazin and others reported the discovery of footprints left behind during the Late Jurassic at Pterosaur Beach, France which they attributed to pterosaurs. This paper has been regarded as the conclusion of the controversy regarding the type of gait pterosaurs utilized on the ground.\n* Lockley and others described the new ichnospecies Pteraichnus stokesi.\n* Howse and A. R. Milner described the new genus and species Plataleorhynchus streptophorodon.\n* Padian, de Ricqlés and Horner described the new genus and species Montanazhdarcho minor.\n* The putative pterosaurian origins of Pteraichnus ignited controversy at the annual meeting of the Society of Vertebrate Paleontology.\n* Moratalla and others reported the presence of Early Cretaceous pterosaur tracks in Spain.\n* Lockley and Hunt reported the discovery of a new fossil track site featuring Pteraichnus-like traces. They also argued that the supposed pterosaur footprints Stokes reported from the Navajo Formation in the 1970s were actually synapsid tracks.\n1996\n* Bennett argued that some pterosaur traits were inconsistent with their hypothesized membership in the archosaurs.\n* Harris and Carpenter described the new genus and species Kepodactylus insperatus.\n* Carpenter reported the presence of coprolites associated with a Pteranodon specimen discovered in the Pierre Shale. The coprolites contained fish bones.\n* Karl Hirsch tentatively concluded that the putative pterosaur eggs Oolithes were actually laid by turtles. Pterosaur eggs would remain unknown in the fossil record until 2004.\n* Lockley and Unwin noted the Pteraichnus controversy at the previous years meeting of the Society of Vertebrate Paleontologists.\n* Time magazine featured a story about the Pteraichnus controversy.\n* Lockley and others published further research on North American pterosaur tracks.\nJune 1st\n* Pamela Everhart discovered a Pteranodon specimen in Kansas. Pam and her husband Michael partially excavated the specimen and covered the rest of the fossils until a more thorough excavation was possible.\nJune 29–30th\n* Michael and Pamela Everhart returned to finish excavating the Pteranodon, which had a roughly 17 foot wingspan.\n]]\n1997\n* Liggett and others reported a Pteranodon femur from the Cenomanian Greenhorn Formation in Kansas.\n* Kellner described the new species Tapejara imperator.\n* Ji Q. and Ji S. described the new genus and species Eosipterus yangi.\n* Miller published an article in Earth magazine about the Pteraichnus controversy.\n* Lockley and Mickelson published further research on North American pterosaur tracks.\n* Lockley and others reported the first pterosaur tracks known from Asia.\n* Bennett \"explicitly endorsed\" the pterosaurian interpretation of Pteraichnus.\n* Unwin also \"explicitly endorsed\" the pterosaurian interpretation of Pteraichnus.\n1998\n* Clark, Hopson, Hernández, Fastovsky and Montellano described the new species Dimorphodon weintraubi.\n* Buffetaut, Lepage, J.-J. and Lepage, G., described the new genus and species Normannognathus wellnhoferi.\n* Lockley published further research on North American pterosaur tracks.\nMay\n* Chris Bennet referred the 1996 Everhart Pteranodon specimen to the species P. sternbergi.\nJune\n* Michael and Pamela Everhart returned to the site of their 1996 Pteranodon discovery to search for additional remains of the animal. However, extensive digging only produced one additional bone from the specimen.\n1999\n* The Everharts donated their 1996 Pteranodon specimen to the Cincinnati Museum Center. It is now catalogued as CMC VP-7203.\n* Ji S., Ji Q. and Padian described the new genus Dendrorhynchoides.\n* Unwin and Heinrich described the new genus and species Tendaguripterus recki.\n* Lockley reported the presence of pterosaur tracks in the Late Cretaceous North Horn Formation of Utah.\n21st century\n2000s\n]]\n2000\n* Martill and others described the new genus and species Domeykodactylus ceciliae.\n* Bennett reported the discovery of three new Nyctosaurus'' specimens from Kansas to that year's annual meeting of the Society of Vertebrate Paleontologists. One specimen had a 15-foot wingspan and represented a new size record for the species. The other two, discovered near WaKeeney, bore strange large branching crests.\n* Kellner and Tomida described the new genus and species Anhanguera piscator.\n* Bennett described the anatomy of the pterosaur wing membrane.\n* Garcia Ramos and others published research on exceptionally well-preserved Late Jurassic pterosaur tracks in Asturias, Spain. These tracks are important both by being the tracks of a particularly large pterosaur and by clearly preserving the webbing between its toes.\n2001\n* Jenkens and others described the new species Eudimorphodon cromptonellus.\n* Chris Bennett published the first monograph-length discussion of Pteranodon in more than 90 years. One of his more notable conclusions was that the reconstructions used by previous researchers to study Pteranodon flight biomechanics were so inaccurate that any conclusions drawn from them were completely invalid.\n* Wang and Lü Junchang described the new genus and species Haopterus gracilis.\n* Howse, Milner, and Martill described the new genus Istiodactylus.\n* Dalla Vecchia and others reported the discovery of pterosaur fossils in Lebanon.\n* Paleontologists gathered at Toulouse for a scientific conference dedicated solely to pterosaurs.\n* Fuentes Vidarte published research on Early Cretaceous pterosaur tracks in Spain.\n* Mazin and others reported the existence of fossil pterosaur tracks preserving the impression of a fifth toe. This suggests that the trackmaker was a primitive long-tailed pterosaur.\n* Garcia Ramos and others published research on exceptionally well-preserved Late Jurassic pterosaur tracks in Asturias, Spain.\n* Lockley and others argued that there were two different types of fossil footprint assemblages that include Pteraichnus that differed by the type of a rock they were preserved in. One type of Pteraichnus-bearing track assemblage is associated with carbonate rocks, and the other with clastic rocks.\n]]\n2002\n* Hwang and others described the new ichnogenus and ichnospecies Haenamichnus uhangriensis.\n* Helmut Tischlinger and Eberhard Frey studied pterosaur fossils under ultraviolet light in order to learn more about their soft tissues.\n* Dalla Vecchia and others described the new genus and species Austriadactylus cristatus.\n* Buffetaut, Grigorescu, and Csiki described the new genus and species Hatzegopteryx thambema.\n* Wang and others described the new genus and species Jeholopterus ningchengensis.\n* Varricchio described the new genus and species Piksi barbarulna.\n* Czerkas and Ji described the new genus and species Pterorhynchus wellnhoferi.\n* Kellner and Campos described the new genus and species Thalassodromeus sethi.\n* Czerkas and Mickelson described the new genus and species Utahdactylus kateae''.\n* Unwin and Henderson published a review of paleontology's understanding of pterosaur paleobiology.\n* Garcia Ramos and others published research on exceptionally well-preserved Late Jurassic pterosaur tracks in Asturias, Spain.\n2003\n.]]\n.]]\n]]\n* Frey, Martill and Buchy described the new species Tapejara navigans.\n* Veldmeijer described the new species Coloborhynchus spielbergi.\n* Bennet described the Nyctosaurus'' specimens with unusual and large crests. He hypothesized that only adult males bore the very large crests. Despite their large size, Bennett concluded that the crests were sufficiently streamlined to exert minimal impact on the animal's aerodynamics.\n* An amateur fossil hunter discovered a \"very large\" complete Pteranodon sternbergi skull in Kansas, although the specimen is still held in his private collection and has not received significant scientific attention.\n* Lü described the new genus and species Beipiaopterus chenianus.\n* Wang and Zhou described the new genus and species Chaoyangopterus zhangi.\n* Carpenter and others described the new genus and species Harpactognathus gentryii.\n* Dong, Sun, and Wu described the new genus and species Jidapterus edentus.\n* Wang and Zhou described the new genus and species Liaoningopterus gui.\n* Frey, Martill, and Buchy described the new genus and species Ludodactylus sibbicki.\n* Pereda-Suberbiola and others described the new genus and species Phosphatodraco mauritanicus.\n* Wang and Zhou described the new genus and species Sinopterus dongi.\n* Frey and others published a study on the wing membranes of \"dark wing\" specimen of Rhamphorhynchus. This study helped advance paleontologists' understanding of the internal musculature and blood vasculature of the pterosaur wing. This study utilized UV light to help reveal greater detail in the specimen than is visible to the unaided eye. They also reported the existence of pterosaur crests composed entirely of soft tissue.\n* Wellnhofer found primitive pterosaurs to have a mandibular fenestra, a trait linking them to the archosaurs.\n* Kellner published a study attempting to reconstruct the evolutionary history of pterosaurs. This study has been subsequently praised by David Hone as a landmark in the field.\n* Unwin published a study attempting to reconstruct the evolutionary history of pterosaurs. Like that by Kellner, this study has been subsequently praised by David Hone as a landmark in the field.\n* Bennett published a study on the anatomy and evolution of the pterosaur wing.\n* Witmer and others published a study on the braincase of pterosaurs.\n* Sayao published a study on the histology of pterosaur bones.\n* Padian continued to argue that Pteraichnus and similar trace fossils were not produced by pterosaurs.\n* Billon-Bruyat and Mazin argued that Agadirichnus was probably produced by a pterosaur and might even be the senior synonym of Pteraichnus. Lockley, Harris and Mitchell characterized this claim as a \"radical suggestion\" from a \"historically-interesting paper\".\n2004\n* Chiappe and others reported the first confirmed pterosaur eggs to the scientific literature.\n* Ji and others, in the same issue of Nature as Chiappe and his colleagues, reported additional pterosaur egg fossils.\n* Wang and Zhou reported the discovery of an Early Cretaceous fossilized pterosaur embryo still preserved inside the egg.\n* Peters described the new genus and species Avgodectes pseudembryon.\n* Gasparini, Fernández, and de la Fuente described the new genus and species Cacibupteryx caribensis.\n* Maisch, Matzke, and Ge Sun described the new genus and species Lonchognathosaurus acutirostris.\n* Cordoniu and Chiappe described some juvenile pterosaur fossils and discussed their implications for pterosaur developmental biology.\n* Chatterjee and Templin published estimates of the body mass of various pterosaurs.\n* Buffetaut and others reported evidence that dinosaurs preyed upon pterosaurs.\n* Fuentes Vidarte published research on Early Cretaceous pterosaur tracks in Spain.\n* Fuentes Vidarte published additional research on Early Cretaceous pterosaur tracks in Spain.\nMay\n* Michael Everhart examined the Apatomerus type specimen and deterimened that it was not a pterosaur fossil.\nJuly\n* Everhart discovered a bone similar in the collections of Kansas University that was similar to the Apatomerus type specimen. This bone was associated with plesiosaur vertebrae, thus revealing the true identity of Apatomerus.\n2005\n.]]\n* Ösi, Weishampel, and Jianu described the new genus and species Bakonydraco galaczi.\n* Lü and Ji described the new genus and species Boreopterus cuiae.\n* Steel and others described the new genus and species Caulkicephalus trimicrodon.\n* Lü and Ji described the new genus and species Eoazhdarcho liaoxiensis.\n* Lü and Zhang described the new genus and species Eopteranodon lii.\n* Wang and others described the new genus and species Feilongus youngi and Nurhachius ignaciobritoi. In this same paper they also attempted to reconstruct the evolutionary history of pterosaurs.\n* Lu and Yuan described the new genus and species Huaxiapterus jii.\n* Dong and Lu described the new genus and species Liaoxipterus brachyognathus.\n* Unwin published the book The Pterosaurs from Deep Time. This was only the third \"serious boo[k]\" about pterosaurs ever published. In it, Unwin argued that young pterosaurs were born well-developed and requiring little investment of parental care.\n* A pterosaur-focused exhibit went on tour in Japan.\n* Peinkowski and Niedzwiedzki published a study on pterosaur tracks from Poland.\n* Meyer and others reported the presence of pterosaur footprints in the Upper Cretaceous Cerro del Pueblo Formation of Mexico. However, they are now actually thought to be poorly preserved dinosaur footprints.\n* Kleeman reported the presence of pterosaur footprints in the Upper Cretaceous Cerro del Pueblo Formation of Mexico. However, they are now actually thought to be poorly preserved dinosaur footprints.\n]]\n2006\n* Wang and Zhou described the new genus and species Cathayopterus grabaui.\n* Fröbisch and Fröbisch described the new genus and species Caviramus schesaplanensis.\n* Wang and others described the new genus and species Longchengpterus zhaoi.\n* Frey and others described the new genus and species Muzquizopteryx coahuilensis.\n* Lü and others described the new genus and species Yixianopterus jingangshanensis.\n* Martill and Naish described some juvenile pterosaur fossils and discussed their implications for pterosaur developmental biology.\n* Frey and others reported the discovery of pterosaur fossils in Mexico.\n* Reynolds and Mickelson reported potential pterosaur tracks from the Aztec Sandstone of California.\n]]\n2007\n* Averianov described the new genus and species Aralazhdarcho bostobensis.\n* Wang and others described the new genus and species Gegepterus changi.\n* Kellner and Campos described the new genus Tupandactylus.\n* Humphries and others debunked the hypothesis that many pterosaurs fed by skim feeding.\n* Veldmeijer and others published a study on pterosaur skull biomechanics.\n* Following the success of the 2001 pterosaur symposium in Toulouse, a regular gathering of pterosaur paleontologists was established and titled \"Flugsaurier\" after the German word for pterosaur. This debut meeting was held in Munich and dedicated to long-time pterosaur paleontologist Peter Wellnhofer.\n* Harris and others reported the existence of fossil pterosaur tracks preserving the impression of a fifth toe. This suggests that the trackmaker was a primitive long-tailed pterosaur.\n* Garcia Ramos and others published research on exceptionally well-preserved Late Jurassic pterosaur tracks in Asturias, Spain.\n* Pinuela and others published research on exceptionally well-preserved Late Jurassic pterosaur tracks in Asturias, Spain.\n* Lockley and others also reported the existence of fossil pterosaur tracks preserving the impression of a fifth toe. This suggests that the trackmaker was a primitive long-tailed pterosaur.\n* Lockley and others reported the presence of pterosaur tracks in the Dakota Group of Colorado.\nApril\n* The University of Munich awarded Helmut Tischlinger an honorary doctorate degree for his work studying pterosaur fossil under ultraviolet light to better understand their soft tissues.\n2008\n.]]\n* Andres and Ji described the new genus and species Elanodactylus prolatus.\n* Xiaolin Wang and others described the new genus and species Hongshanopterus.\n* Molnar and Thulborn described the new genus and species Mythunga lacustris .\n* Wang and others described the new genus and species Nemicolopterus crypticus.\n* Stecher described the new genus and species Raeticodactylus filisurensis .\n* Lü and others described the new genus and species Shenzhoupterus chaoyangensis.\n* Averianov, Arkhangelsky, and Pervushov described the new genus and species Volgadraco bogolubovi.\n* Barrett published a comprehensive guide to pterosaur-bearing stratigraphic units and fossil sites.\n* Lockley and others published a paper documenting all known fossil track sites that preserve pterosaur footprints.\n* Unwin and Deeming argued that the thin shells of the recently discovered pterosaur eggs suggest that they were buried after laying rather than \"brooded\" like birds and pop cultural portrayals.\n* Bennett published a study on the anatomy and evolution of the pterosaur wing.\n* Steel published a study on the histology of pterosaur bones.\n* Witton published estimates of the body mass of various pterosaurs.\n* Wilkinson published the first digital analysis of pterosaur flight biomechanics.\n* Elgin and others published a study of pterosaur flight biomechanics that utilized a wind tunnel.\n* Habib published a study examining how pterosaurs took flight. He concluded that pterosaur take-off occurred on all fours using the strength of their well-developed wing and chest muscles to launch into the air.\n* Witton and Naish argued that azhdarchid pterosaurs spent much of their lives on the ground browsing for prey.\n.]]\n2009\n* Dalla Vecchia described the new genus and species Carniadactylus rosenfeldi.\n* Lü described the new genus and species Changchengopterus pani.\n* Lü described the new genus and species Ningchengopterus liuae.\n* Wang and others described the new genus and species Wukongopterus lii.\n* Kellner and others published a study on the wing membranes of Jeholopterus''. This study helped advance paleontologists' understanding of actinofibrils and the pycnofibres composing pterosaurs \"furry\" covering.\n* Gao and others reported the discovery of pterosaur fossils in North Korea.\n* Claessens and others published a study examining the \"thin-walled and pneumatic\" nature of pterosaur bones.\n* Butler and others published a study examining the \"thin-walled and pneumatic\" nature of pterosaur bones.\n* Mazin and others reported the first trace fossil produced by a pterosaur as it landed.\n* Dyke and others published compared the anatomy of pterosaur wings with those of other flying animals to better understand their ecomorphology.\n2010s\n]]\n]]\n]]\n]]\n2010\n* Myers described the new genus and species Aetodactylus halli.\n*Ibrahim and others described the new genus and species Alanqa saharica.\n* Lü and Fucha described the new genus and species Archaeoistiodactylus linglongtaensis.\n* Lü and others described the new genus and species Darwinopterus modularis. According to David Hone, D. modularis was the single most influential pterosaur species on science's understanding of pterosaur evolution. The body of Darwinopterus resembled the more primitive long-tailed \"rhamphorynchoids\", while its skull resembled those of the more advanced short-tailed pterodactyloids. These traits establish the species as an important transitional form, documenting one of the most important phases of pterosaur evolution. In this paper they also attempted to reconstruct the evolutionary history of pterosaurs.\n* Wang and others described the new genus and species D. linglongtaensis.\n* Kellner described the new genus and species Dawndraco kanzai.\n* Bonaparte, Schultz, and Soares described the new genus and species Faxinalipterus minima. This species may represent the earliest known pterosaur.\n* Lü, Fucha, and Chen described the new genus and species Fenghuangopterus lii.\n* Kellner described the new species Geosternbergia maiseyi.\n* Wang and others described the new genus and species Kunpengopterus sinensis. They also formally defined the new family Wukongopteridae. This taxon is considered one of the most important higher-order pterosaur taxa to be described in recent times due to its intermediate nature between the \"rhamphorhynchoids\" and pterodactyloids.\n* Vidarte and Calvo described the new genus and species Prejanopterus curvirostra.\n* Andres, Clark, and Xing described the new genus and species Sericipterus wucaiwanensis.\n* Lü described the new genus and species Zhenyuanopterus longirostris''.\n* Tischlinger published a study on pterosaur wing membranes. This study utilized UV light to help reveal greater detail in the specimen than is visible to the unaided eye.\n* Steel reported the presence of a possible wukongopterid in Middle Jurassic rocks in the United Kingdom.\n* Nesbitt and Hone found primitive pterosaurs to have a mandibular fenestra, a trait linking them to the archosaurs. They also observed that many of the traits suggested by Bennett to be at odds with archosaurian origins were found in many groups and therefore not evidence for an interpretation of pterosaurs and a distinct non-archosaurian lineage.\n* Vidovic published a study on the histology of pterosaur teeth.\n* Henderson published estimates of the body mass of various pterosaurs.\n* Witton and Habib noted that pterosaurs' reliance on launching with the wings from all fours to take flight limited their maximum body size and \"had important implications for their ecology\".\n* Tutken and Hone attempted to ascertain the diet of pterosaurs by studying the isotopic composition of their bones and teeth.\n* This year the Flugsaurier conference was held in Beijing.\n* The Royal Society put on an exhibition related to pterosaurs as part of its 200th anniversary celebration.\n* Documentary dedicated to pterosaurs titled Flying Monsters was released. This film would go on to win the BAFTA Award.\n]]\n2011\n* Frey, Meyer, and Tischlinger described the new genus Aurorazhdarcho.\n* Kellner, Rodrigues, and Costa described the new genus and species Aussiedraco molnari.\n* Elgin and Frey described the new genus and species Barbosania gracilirostris.\n* Lü and others described the new genus and species Darwinopterus robustodens.\n* Lü and Bo described the new genus and species Jianchangopterus zhaoianus.\n* Sullivan and Fowler described the new genus and species Navajodactylus boerei.\n* Jiang and Wang described the new genus and species Pterofiltrus qiui.\n* Martill described the new genus and species Unwindia trigonus.\n* Lu and others reported the discovery of a Darwinopterus'' egg associated with its mother. This was the fourth known discovery of a pterosaur egg.\n* O'Connor and others reported the discovery of pterosaur fossils in Kenya.\n* Nesbitt published a thorough cladistic analysis of the archosaurs, finding pterosaurs not only to be a member, but very close relatives of the dinosaurs.\n* Palmer published a study of pterosaur flight biomechanics that utilized a wind tunnel.\n* Prondvai and Osi published a study on pterosaur skull biomechanics.\n]]\n]]\n2012\n* Novas and others described the new genus and species Aerotitan sudamericanus.\n* Hone and others described the new genus and species Bellubrunnus rothgaengeri. This was the first known pterosaur with forward-pointing wingtips.\n* Lü and Hone described the new genus and species Dendrorhynchoides mutoudengensis.\n* Vullo and others described the new genus and species Europejara olcadesorum.\n* Lü and others described the new genus and species Gladocephaloideus jingangshanensis.\n* Wang and others described the new genus and species Guidraco venator.\n* Cheng and others described the new genus and species Jianchangnathus robustus.\n* Lü and others described the new genus and species Moganopterus zhuiana.\n* Lü and others described the new genus and species Qinglongopterus guoi.\n* Prondvai and others published a study of the bone histology of young pterosaurs.\n* Vullo and others expanded the known range of the tapejarids in to Europe.\n* Hone and others argued that the crests of many pterosaur species were a result of mutual sexual selection.\n]]\n]]\n2013\n* Andres and Myers described the new genus and species Alamodactylus byrdi.\n* Bennett described the new genus and species Ardeadactylus longicollum.\n* Rodrigues and Kellner described the new genus Camposipterus.\n* Kellner described the new genus and species Caupedactylus ybaka.\n* Rodrigues and Kellner described the new genus Cimoliopterus.\n* Martill and Etches described the new genus and species Cuspicephalus scarfi.\n* Vremir and others described the new genus and species Eurazhdarcho langendorfensis.\n* Rodrigues and Kellner described the new genus Lonchodraco.\n* Andres and Myers described the new genus and species Radiodactylus langstoni.\n* Naish, Simpson and Dyke described the new genus and species Vectidraco daisymorrisae.\n* Codorniú and Gasparini described the new genus and species Wenupteryx uzi.\n* Witton published the book Pterosaurs.\n2014\n]]\n* Vidovic and Martill described the new genus Aerodactylus.\n* Jiang and others described the new genus and species Boreopterus giganticus.\n* Manzig and others described the new genus and species Caiuajara dobruskii.\n* Wang and others described the new genus and species Hamipterus tianshanensis.\n* Wang and others described the new genus and species Ikrandraco avatar.\n* Andres, Clark and Xu described the new genus and species Kryptodrakon progenitor.\n* Bantim and others described the new genus and species Maaradactylus kellneri.\n2015\nwith jaws both open and closed]]\n* Kellner described the new genus and species Arcticodactylus cromptonellus.\n* Kellner described the new genus and species Austriadraco dallavecchiai.\n* Headden and Campos described the new genus and species Banguela oberlii.\n* Kellner described the new genus and species Bergamodactylus.\n* Myers described the new genus and species Cimoliopterus dunni.\n* Cheng and others described the new genus and species Daohugoupterus wildi.\n* Rodrigues and others described the new genus and species Linlongopterus.\n* Lü and others described the new genus and species Orientognathus.\n* O'Sullivan and Martill described the new genus and species Rhamphorhynchus etchesi.\n2016\n* Lü and others described the new genus and species Pangupterus liui.\n* Codorniú and others described the new genus and species Allkaruen.\n* Pêgas and others described the new genus and species Aymberedactylus cearensis.\n2017\n* Zhou and others described the new genus and species Liaodactylus primus.\n* Wang and others described the new genus and species Douzhanopterus zhengi.\n* Vidovic and Martill erected the new genus Altmuehlopterus for the species \"Ornithocephalus\" ramphastinus.\n* Kellner and Calvo described the new genus and species Argentinadraco barrealensis.\n2018\n* Britt and others described the new genus and species Caelestiventus hanseni.\n* Longrich, Martill and Andres described the new genera and species Alcione elainus, Barbaridactylus grandis, Simurghia robusta, and Tethydraco regalis.\n* Lü and others described the new genus and species Vesperopterylus lamadongensis.\n* Martill and others described the new genus and species Xericeps curvirostris.\n* Rigal, Martill and Sweetman erected the new genus Serradraco for the species \"Pterodactylus\" sagittirostris.\n* Pêgas, Costa, and Kellner reassigned the fossil previously attributed to Banguela oberlii to the genus Thalassodromeus, renaming it Thalassodromeus oberlii.\n* Vullo and others described the new genus and species Mistralazhdarcho maggii.\n2019\n* Jacobs and others described the new species Coloborhynchus fluviferox.\n* Holgado and others described the new genus and species Iberodactylus andreui.\n* Pycnofibers showing diagnostic features of feathers are reported in two specimens of anurognathid pterosaurs (probably belonging either to the genus Jeholopterus or Dendrorhynchoides) from the Jurassic of China by Yang et al. (2019).\n* Redescription of the holotype specimen of Mythunga camara was published by Pentland & Poropat (2019).\n* A study on intervertebral foramina in Vectidraco, Anhanguera and Coloborhynchus, and on their implications for inferring palaeoecology and locomotion of these pterosaurs, is published by Martin‐Silverstone, Sykes & Naish (2019).\n* The first pterosaur postcranial bone (a left ulna) from the Albian Lohan Cura Formation (Argentina) is described by Bellardini & Codorniú (2019).\n* Hone and others described the new genus and species Cryodrakon boreas.\n* Pentland and others described the new genus and species Ferrodraco lentoni.\n* Kellner and others described the new genus and species Keresdrakon vilsoni.\n* Kellner and others described the new genus and species Mimodactylus libanensis.\n* Zhou and others described the new Nurhachius species N. luei.\n* Dalla Vecchia described the new genus and species Seazzadactylus venieri.\n* Pêgas and others erected the new genus Targaryendraco for the species \"Ornithocheirus\" wiedenrothi.\n2020s\n2020\n* Solomon and others described the new genus and species Albadraco tharmisensis.\n*Martill and others described the new genus and species Wightia declivirostris, the first occurrence of Tapejaridae in the United Kingdom.\n*Redscription of the holotype specimen of Ferrodraco, particularly the post-cranial skeleton, was published by Pentland and others. This study suggests that the diversity of Australian pterosaur fauna has been greatly underestimated.\nSee also\n* Timeline of ichthyosaur research\n* Timeline of plesiosaur research\nFootnotes\nReferences\nA-F\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nG-L\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nM-R\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nS-Z\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}