{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of women's suffrage in Texas\n\nwomen register to vote in the Texas primary election in July 1918.|alt=Travis County women register to vote in the Texas primary election in July 1918.|300x300px]]This is a '''timeline of women's suffrage in Texas'''. Women's suffrage was brought up in Texas at the first state constitutional convention, which began in 1868. However, there was a lack of support for the proposal at the time to enfranchise women. Women continued to fight for the right to vote in the state. In 1918, women gained the right to vote in Texas primary elections. The Texas legislature ratified the 19th amendment on June 28, 1919, becoming the ninth state and the first Southern state to ratify the amendment. While white women had secured the vote, Black women still struggled to vote in Texas. In 1944, white primaries were declared unconstitutional. Poll taxes were outlawed in 1964 and the Voting Rights Act was passed in 1965, fully enfranchising Black women voters.\n1860s\n1868-1869\n* Titus H. Mundine proposes that all people, regardless of sex, should be given the right to vote in Texas. The Texas State Constitutional Convention rejected the proposal. It was considered \"unwomanly\" to vote by the convention.\n1869\n* Martha Goodwin Tunstall speaks to women's suffrage supporters in Austin. That same year, the National Woman Suffrage Association (NWSA) lists Tunstall as representing Texas.\n1870s\n1872\n* The American Woman Suffrage Association (AWSA) petitions the Texas Legislature to allow women's suffrage.\n1873\n* Albert Jennings Fountain introduces women's suffrage measures in the Texas Senate, though these were defeated.\n1875\n* A women's suffrage petition authored by Sarah Grimke Wattles Hiatt from Eldorado, Texas was sent to the second Texas Constitutional Convention. Two delegates to the convention also proposed women's suffrage, but both their efforts and the petition were ignored.\n1876\n* The Constitution of Texas was published. Article VI covered suffrage and did not allow women to vote.\n1880s\nsponsored by the Texas Equal Rights Association. 1884.]]\n1884\n* Mariana Thompson Folsom conducts a more than ten week tour of Texas, giving women's suffrage lectures in various cities.\n1888\n* The Texas chapter of the Women's Christian Temperance Union (WCTU) becomes the first chapter in the South to endorse women's suffrage, although they lose members because of their stance.\n1890s\n1893\n* The first statewide women's suffrage group, the Texas Equal Rights Association (TERA) is formed in Dallas by Rebecca Henry Hayes.\n* Denison, Granger and Taylor, Texas set up local chapters of TERA.\n* October During the Texas State Fair in Dallas, a women's congress is featured. The program drew three hundred women and was organized by Ellen Lawson Dabbs, secretary of TERA, and featured women's suffrage speakers.\n1894\n* All political party conventions this year hosted suffragist speakers. Ellen Keller from Fort Worth argued that women, being subject to laws should be allowed to help decided these laws through the vote. However, the suffragists in Texas were unable to have equal suffrage adopted in the party platforms of the Democratic, Republican, or Populist Party.\n* Beaumont, Belton, Circleville, Dallas, Fort Worth and San Antonio set up local chapters of TERA.\n* TERA is divided over whether to invite Susan B. Anthony to give lectures in Texas.\n1895\n* A woman suffrage proposal is introduced in the Texas House of Representatives by A.C. Tompkins but does not leave committee.\n1896\n*TERA closed operations due to internal problems and lack of funding.\n1900s\n1901\n* Annette Finnigan of Houston and her father, John Finnigan contribute financially to the New York Suffrage League.\n1902\n* Texas institutes a poll tax for voting.\n1903\n* Annette, Elizabeth and Katharine Finnigan create an Equal Suffrage League in Houston, which later that year, in December, becomes the Texas Woman Suffrage Association.\n* Carrie Chapman Catt gives a women's suffrage lecture in Houston.\n1904\n* Eleanor Brackenridge, of San Antonio writes \"The Legal Status of Texas Women,\" analyzing Texas laws relating to women.\n* The Texas Woman Suffrage Association holds a convention with local chapters from Galveston, Houston and La Porte representing their communities.\n1907\n* State representative, Jess Alexander Baker, introduces a joint resolution for women's suffrage in the Texas House. Suffragists invited to speak to the legislature included Alice McAnulty, Helen M. Stoddard, Emma J. Mellette, Elisabet Ney, Helen Jarvis Kenyon and May Jarvis.\n1908\n* Two women, Ella Isabelle Tucker and Adella Kelsey Turner, are elected to the Dallas school board.\n*The Austin Suffrage Association is formed.\n*Eliza E. Peterson from Texarkana becomes head of the \"Colored division\" of the Texas WCTU. Peterson spoke in favor of women's suffrage while touring.\n*Anna Howard Shaw does a brief suffrage tour in Austin, Dallas, Houston, and San Antonio.\n1910s\nThroughout the 1910s, Eliza E. Peterson of Texarkana continues to speak around the country for the African American division of the WCTU of Texas. She also spoke out on women's suffrage., on April 7, 1913.]]\n1911\n* State representative, Jess Alexander Baker, introduces a suffrage amendment to the Texas Constitution in the Thirty-second Legislature.\n* Jovita Idar begins to write pro-suffrage articles in her family's Spanish language newspaper, La Cronica.\n1912\n* Anna Howard Shaw tours Texas and there is a revival of interest in women's suffrage.\n* The Equal Franchise Society of San Antonio is formed.\n1913\n* First women's suffrage convention since 1904 takes place in Texas at the St. Anthony Hotel in San Antonio. The Texas Woman Suffrage Association is revived and Eleanor Brackenridge is voted president.\n* Texas women march with women from other states in Washington, D.C., for suffrage on the eve of Woodrow Wilson's inauguration.\n* March 15 the first meeting of the Dallas Equal Suffrage Association (DESA) is held.\n* October 23 \"Equal Suffrage Day\" is held at the Texas State Fair.\n1914\n* The Texas Woman Suffrage Association holds its annual convention in Dallas, with eight local chapters in attendance.\n1915\n* A women's suffrage bill for a Texas state constitutional amendment is approved in a committee of the Texas House of Representatives, but defeated by the House as a whole.\n* January 18 Frank H. Burmeister introduces the women's suffrage resolution in the Texas Legislature.\n* February 23 W.T. Bagby in the Texas House of Representatives argues that \"woman suffrage was contrary to the laws of nature and the Bible.\" He states that allowing women to vote would lead to socialism and that women should stay in the home.\n* Minnie Fisher Cunningham becomes president of the Texas Woman Suffrage Association. The annual convention was held at Galveston and had 21 local chapters attending.\n* The Texas Federation of Women's Clubs comes out in endorsement of women's suffrage.\n* Jane Y. McCallum is elected president of the Austin Woman Suffrage Association.\n* Suffrage Day at the State Fair hosts 300 TESA delegates and a parade to the fairgrounds.\n1916\n* March Pauline Wells from Brownsville started the Texas Association Opposed to Woman Suffrage.\n* The Texas Woman Suffrage Association is renamed the Texas Equal Suffrage Association (TESA). The annual convention was held in Dallas.\n* A Texas chapter of the suffrage group, the National Woman's Party is created.\n* In Laredo, Texas, Jovita Idar and Eduardo Idar began publishing a newspaper, the Evolución which featured regular articles supporting women's suffrage.\n1917\n* Major anti-suffrage governor, James Ferguson, is impeached with help from Cunningham and other suffragists.\n* The annual convention of TESA is held in Waco.\n* TESA moves its headquarters from Houston to Austin in order to better lobby the government of Texas.\n* The Texas Federation of Colored Women's Clubs officially endorses women's suffrage efforts.\n* In Galveston, Texas, a Negro Women's Voter League is formed.\n* January 13 A bill by Jess A. Baker to create a constitutional amendment for women's suffrage gets a majority of votes, but fails to get the necessary two-thirds vote to pass. In addition to introducing this bill, Baker also introduces a bill to allow women to vote in the primary elections.\n* April 9 Suffragists in Dallas march in the Patriotic Parade.\n* July 7 The El Paso Equal Franchise League, led by Belle Critchett, calls out militant suffrage tactics.\n1918\n* Christia Adair in Kingsville works with black and white women on petitions for women to vote in the Democratic primary election.\n* The annual convention of TESA is held in Austin.\n* January TESA lobbies Governor William P. Hobby on supporting a bill to allow women to vote in the primary election.\n* February A primary suffrage bill is introduced by state representative, Charles B. Metcalfe.\n* March 26 Hobby signs the primary voting bill into law.\n* June 12 The El Paso Negro Woman's Civic and Enfranchisement League was formed by Maude Sampson.\n* June 26 Women's right to vote in the primary takes effect, giving women 17 days to register for the July 2 primary. Around 386,000 women registered to vote during that time.\n* In Harris County, more than 1,500 black women register to vote, but other counties refuse to register African American women.\n* In San Antonio, the Spanish newspaper, La Prensa, translated and published information about voter registration.\n* Eleanor Brackenridge became the first woman to register to vote in Bexar County. Hortense Sparks Ward was the first woman to register in Harris County.\n* August A large number of Democratic county conventions endorse women's suffrage: 233.\n1919\n* Large meeting of African American men in LaGrange come out in support of women's suffrage.\n* January Hobby suggests that state laws be amended to allow women's suffrage and to disallow alien residents to vote. The resolution passed the Texas legislature and was slated to be voted on in May.\n* February 8 Colonial Ball held to raise money for the campaign for the women's suffrage resolution.\n* February 24 The Prison Special arrives in San Antonio.\n* February 26 The Prison Special spends a night in El Paso before continuing their tour.\n* April 11 Anna Howard Shaw lectures on women's suffrage in Waco.\n* May 24 The resolution giving women the vote and disallowing aliens to vote is bundled together and the resolution was defeated by the voters.\n* June 28 The Texas legislature ratified the 19th Amendment. Texas was the ninth state and the first Southern state to ratify the amendment.\n* June the Texas Association Opposed to Woman Suffrage was disbanded.\n* October TESA holds a victory convention, dissolves the group and reorganizes itself as the League of Women Voters of Texas.\n1920s\n1921\n* Women born in Mexico and waiting to become naturalized American citizens lost the right to vote.\n1923\n* Texas creates white primaries, preventing black people from voting in primary elections.\n1924\n* Native Americans gain citizenship, but not the guaranteed right to vote.\n1940s\n]]\n1944\n* Christia Adair and other black women are able to vote in the Texas primary after the Supreme Court strikes down the white primary law in Texas. The case that decided the issue was Smith v. Allwright.\n1960s\n1964\n* The 24th Amendment to the Constitution outlaws poll taxes.\n1965\n* Congress passes the Voting Rights Act, ensuring Black women's and Native American women's right to vote.\nSee also\n* List of Texas suffragists\n* Women's suffrage in Texas\n*Women's poll tax repeal movement\n*Women's suffrage in states of the United States\n* Women's suffrage in the United States\nReferences\nSources\n*\n*\n*\n*\n*\n*"
    }
  ]
}