{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of rugby league on UK television\n\nThis is a timeline of the history of rugby league on television in the UK.\n1940s\n* 1948\n** 1 May – The BBC broadcasts the Rugby League Challenge Cup final for the first time, although this can only be seen in the London area.\n* 1949\n** No events.\n1950s\n* 1950\n** No events.\n* 1951\n** The first ever televised international rugby league match takes place between Great Britain and New Zealand at Station Road, Swinton. This was the first outdoor sporting event to be televised in the north of England.\n* 1952\n** The Challenge Cup final is broadcast for a second time, and was the first time it could be seen in the north of England.\n*1953\n** The Rugby Football League refuse permission to broadcast the Challenge Cup final due to concerns that live coverage had affected the attendance of the previous year's final.\n*1954\n** No events.\n* 1955\n** October–November – The newly launched ITV creates a rugby league tournament called the Independent Television Floodlit Trophy. Played under floodlights at various London football grounds, the tournament is shown live in the London area only because ITV had not launched in the sport's north of England heartlands. The second halves of the matches are shown live. The competition was a one-off and did not return the following year.\n* 1956\n** No events.\n* 1957\n** No events.\n* 1958\n** 10 May – The BBC broadcasts the Challenge Cup final for the third time and this marks the start of annual coverage of the final.\n* 1959\n** No events.\n1960s\n* 1960 to 1964\n** At some unknown point during this period, Grandstand shows coverage of earlier rounds from the Challenge Cup for the first time.\n* 1965\n** 6 October – The first edition of the BBC2 Floodlit Trophy is broadcast, bringing rugby league to television screens on a regular basis for the first time. The competition is designed specifically for television.\n* 1966 to 1969\n** For a brief period during the late 1960s, ITV shows coverage of the Challenge Cup on World of Sport\n1970s\n* No events.\n1980s\n* 1980\n** 11 June – A new TV deal is agreed with the BBC, but they no longer hold exclusive rights to rugby league coverage, and any games not shown by the BBC can be offered to Independent Television instead. The BBC2 Floodlit Trophy is also scrapped due to financial cutbacks by the broadcaster.\n* 1981\n** A new highlights programme, RL Action, is broadcast on Granada Television and Yorkshire Television.\n* 1982\n** 19 May – For the only time since 1958, the BBC does not show live coverage of the final of the Challenge Cup. It had shown the original game live 18 days earlier but opted to show the replay in highlights form only, as part of that week's edition of Sportsnight.\n* 1983\n** No events.\n* 1984\n** No events.\n* 1985\n** ITV scraps its British rugby league coverage, and no games from the league championship are shown at all on UK television for the next two seasons. A new program, Australian RL Action, is briefly shown, featuring highlights of Australian clubs from the New South Wales Rugby League (NSWRL) competition.\n* 1986\n** No events.\n* 1987\n** For a brief period, Yorkshire Television broadcasts a late night rugby league highlights programme called Scrumdown.\n* 1988\n** No events.\n* 1989\n** Granada Television agrees to broadcast live coverage of 12 rugby league matches, including the final of the Lancashire Cup.\n1990s\n* 1990\n** 1 April – British Satellite Broadcasting televises its first rugby league match.\n** August – The RFL agrees a deal with British Aerospace for their new TV service, Sportscast, a TV channel shown exclusively in pubs and clubs. The service was short-lived, collapsing 18 months later.\n* 1991\n** No events.\n* 1992\n** BSkyB acquires exclusive rights to show league matches. Sky also launches its own rugby league magazine programme, ''Boots 'N' All, which first aired in February 1992.\n** 24 October – The BBC shows live coverage of the 1992 Rugby League World Cup final.\n* 1993\n** No events.\n* 1994\n** No events.\n* 1995\n** 7–28 October – L!VE TV broadcasts many of the matches from the 1995 Rugby League World Cup. It shows many of them exclusively because, apart from the opening game, the BBC does not show any of the games live until the semi-final stage.\n* 1996\n** Following an approach by Rupert Murdoch to British rugby league clubs to form a new Super League, the sport agrees to the proposals, which amongst other things sees the sport move from a winter to a summer season. Consequently, all live league coverage is shown exclusively on Sky Sports.\n* 1997\n** No events.\n* 1998\n** No events.\n* 1999\n** The first edition of The Super League Show is broadcast on the BBC. It is broadcast to the North West, Yorkshire & North Midlands, North East & Cumbria, and East Yorkshire and Lincolnshire regions on Monday nights.\n2000s\n* 2000\n** Rugby League Raw is broadcast by Yorkshire Television for the first time. The documentary-style programme mixes action with behind-the-scenes footage.\n** 29 October-15 November – Sky Sports takes over as one of the broadcasters of the Rugby League World Cup and shares coverage of the 2000 Rugby League World Cup with the BBC.\n* 2001\n** No events.\n* 2002\n** No events.\n* 2003\n** No events.\n* 2004\n** Rugby League Raw moves from Yorkshire Television to the BBC and is shown in the North East & Cumbria, Yorkshire & North Midlands, East Yorkshire & Lincolnshire and North West regions. The documentary-style programme focuses on coverage of the National Leagues play-offs.\n*2005\n** No events.\n* 2006\n** Manchester local television station Channel M launches a rugby league magazine called Code XIII. Whilst its main focus is on teams playing in the Greater Manchester area, it also touched upon the progress of other teams in the region including Warrington and Widnes. A spin-off series, Code XIII: Grassroots, focused on local amateur rugby league highlights. The programme ran for three seasons, ending in 2008 after management at Channel M decided that they were not willing to go forward with another series that did not contain game action, and that the asking price for buying in the footage was more than Guardian Media Group could afford.\n* 2007\n** Rugby League Raw is broadcast for the final time due to Sky Sports beginning to show National League rugby.\n** 9 June – S4C shows the first of four Celtic Crusaders rugby league matches live. The following season, S4C shows five more Celtic Crusaders games.\n* 2008\n** February – Having previously only been broadcast as a regional programme, The Super League Show'' is broadcast nationally for the first time when it is given a Tuesday lunchtime slot on BBC Two.\n** 22 November – Sky Sports' coverage of the Rugby League World Cup ends as the rights for future tournaments move to Premier Sports.\n* 2009\n** 25 September – ESPN brings National Rugby League to the UK when it broadcasts the first Preliminary Final live on 25 September, the second Preliminary Final and on 4 October it shows the Grand Final.\n2010s\n*2010\n** No events.\n*2011\n** No events.\n*2012\n** March – Premier Sports begins broadcasting up to 32 games from the Rugby Football League Championship, Championship 1 and Championship Cup in the 2012 season.\n** Sky Sports broadcasts games from the Challenge Cup for the first time. Sky is the secondary broadcaster of the competition, showing live coverage of one match from rounds 5 and 6 and two quarter-finals.\n*2013\n** 26 October-30 November – Premier Sports broadcasts its first major international sporting event when it is joint broadcaster with the BBC of the 2013 Rugby League World Cup. The channel also provides live coverage of the 2017 event.\n*2014\n** Premier Sports and BBC Sport replace Sky Sports as broadcaster of the Rugby League Four Nations tournament.\n*2015\n** November – After over 20 seasons on air, the final edition of Sky Sports’ rugby league magazine ''Boots 'N' All is broadcast.\n*2016\n** Premier Sports begins showing all 201 games of rugby league from the Australian National Rugby League alongside the NRL Footy Show, State of Origin series, NRL Full Time and Rugby League Back Chat''.\n*2017\n** 3 November – The BBC announces that it has signed deals with a number of different sports to bring 1,000 extra hours of live sports coverage each year. The increase in free-to-air sport includes coverage of the entire Rugby League Challenge Cup.\n*2018\n** Coverage of the Australia and New Zealand's National Rugby League returns to Sky Sports on a five-year contract. The deal includes selected matches from the Telstra Premiership plus the NRL Grand Final as well as the State of Origin series, Pacific Tests, Auckland Nines and the All Stars Match.\n** 28 April – FreeSports begins showing live coverage of matches from rugby league’s National Conference League with more than 30 matches to be shown over the course of the season.\n*2019\n** 26 October-16 November – BBC Sport broadcasts live coverage of rugby league's British Lions tour to New Zealand.\n2020s\n* 2020\n** No events.\n* 2021\n** 7 May – Sky Sports ends a decade of coverage of the Challenge Cup when it shows two quarter-finals from the 2021 Challenge Cup.\n* 2022\n** 12 February – Live Super League matches are broadcast on free-to-air television for the first time when Channel 4 shows the first of ten matches each season for the next two years. This is the first time in its 40-year history that channel 4has broadcast rugby league.\n** Premier Sports broadcasts the RFL Championship. Coverage includes the regular season, the Play-Offs in the autumn culminating in the Million Pound Game and every match of the Summer Bash featuring all 14 clubs in a single venue on the same weekend. The deal also includes the 2023 season.\n** 28 February – Premier Sports replaces Sky Sports as the secondary rights holder of the Challenge Cup. It shows five games from the competition - one match from rounds 4, 5 and 6 and two quarter-finals.\n** 15 October-19 November – The BBC broadcasts live coverage of all 61 games from the men's, women's and wheelchair tournaments of the 2021 Rugby League World Cup.\n*2023\n** No events.\n*2024\n** 17 February - The BBC shows a live Super League rugby league match for the first time when it broadcasts the first of the 15 Super League games that the BBC will show for the next three seasons.\nReferences\n;General\n*\n;Inline"
    }
  ]
}