{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Spanish July 1936 coup\n\nThis timeline of Spanish July 1936 coup lists events which took place during 4 days between July 17 and July 20.\nWhile the start date is non-controversial, in historiography there is no agreement as to the end-date. It is widely accepted that technically speaking, the coup failed and the conflict assumed the format of a civil war. However, it is not clear at which point the coup might be considered over, and almost all works present the coup as an early stage of the general phenomenon known as the Spanish Civil War. Some works suggest that the coup turned into war on July 19; others advance the date of July 20; some claim that the August/September airlift turned the failed coup into the war, and some point even to November 1936, when the Nationalists were defeated at the gates of Madrid. As this entry is supposed to provide possibly detailed timeline, it is limited to the first 80 hours of the conflict.\nHours are stated in WET, used in Morocco protectorate and most of Spain at the time; this applies also to events in the Canary Islands, the region which used UTC−01:00. Time is rounded to full-hour or half-hour, unless the exact hour is known.\nFriday, July 17\n{| class=\"wikitable\"\n! scope=\"col\" style=\"width: 80px;\" | hour\n! scope=\"col\" style=\"width: 120px;\" | where\n! scope=\"col\" style=\"width: 1200px;\" | event\n|-bgcolor=\"dfe2e9\"\n|-\n| 4:10 PM  || Melilla  || while an 11-member Guardia Civil patrol, acting on orders from civil authorities and general Romerales, is performing search in Comisión Geográfica (site of topographical unit of the Melilla garrison where conspirators were preparing arms), one of the plotters present manages to call a nearby Foreign Legion station requesting help\n|-\n| 4:20 PM || Melilla  || hastily assembled 9-member Foreign Legion detachment arrives at Comisión Geográfica; the legionnaires point their rifles against the civiles. One of the conspirators, teniente La Torre, comes clear and invites the guardias to join the rising. Following a brief moment of tension the commanding Guardia, teniente Zaro, orders his men not to resist\n|-\n| 4:30 PM|| Melilla|| retired teniente coronel Segui, who assumed command of conspirators in Comisión, orders the officers present to take control of key military establishments of the garrison and to block any traffic out of the harbor. Officers leave to change from civilian clothes to uniforms and take command\n|-\n|4:45 PM|| Madrid/Tetuan||  prime minister Casares Quiroga, who around 3 PM was informed about suspicious activities in Comisión and who ordered the search, calls delegado gubernativo in Tetuan to find out about the situation in the city; the prime minister is informed (correctly) that in Tetuan everything is in order\n|-\n|prior to 5 PM|| Melilla||  conspirators start calling units stationed around Melilla to proceed towards the city\n|-\n|5 PM|| Melilla||  Romerales, who is unaware of developments in Comisión, acting on earlier instructions from Casares (unclear when received), orders to detain some key officers suspected: teniente coronel Gazapo and comandantes Zanón and Rodrigo. He also calls some units stationed beyond the city and orders them to proceed towards Melilla\n|-\n|5 PM || Madrid/Tetuan||minister of interior Moles, who apparently could not get through to Romerales in Melilla, calls the highest Spanish civilian authority in the protectorate, Alto Comisario Alvarez-Buylla to find out what is going on, but the latter can not offer any information\n|-\n|5:10 PM || Madrid/Tetuan||Casares calls Alvarez-Buylla and asks about overall commander of troops in Morocco general Gómez Morato, to be informed that the latter is on inspection in Larache. Casares orders to contact the aviation commander in Morocco, De la Puente, and to put all military airfields on alert. He also orders coronel Martín-Moreno, Gómez Morato's chief of staff, to cancel all leaves and monitor all military radio traffic\n|-\n|slightly after 5 PM || Melilla|| the news about the incident in Comisión reach general Romerales, who  starts calling his staff officers, some of them having a rest during the siesta. They start gathering and discuss what they know, some of them conspirators pretending to be loyal. At one point they decide to come clear and coronel Solans ask Romerales to resign command\n|-\n|5:15 PM || Melilla||Segui with some men enters the Romerales office, points his pistol at the general and terminates negotiations about surrendering command. Romerales is made to call Delegado Gubernativo in Melilla, Fernández Gil, and inform him about ceding power to Solans. Then he and his loyal staff officers are locked\n|-\n|5:15 PM || Madrid/Larache||Casares manages to catch Gómez Morato in Larache, informs him that some unrest seems to take place in Melilla, and orders him to fly immediately there. Gómez commences arrangements for the flight\n|-\n|5:30 PM || Melilla||coronel Solans sends out rebel patrols to read out bando which declares the state of war; as agreed beforehand, it is signed by Franco, who at the time is in Las Palmas de Gran Canaria, entirely unaware of the coup unfolding; he expects it to begin only after his arrival in Morocco, which he plans for one of the forthcoming days\n|-\n|5:30 || Melilla/Madrid||Fernández Gil manages to reach Moles in Madrid; this is the moment when the government acquires first certain information about the coup unfolding in Melilla\n|-\n|5:40 PM || Madrid||Casares Quiroga orders state of alarm (acuartelamiento) in the Madrid garrison. He also orders 3 destroyers to set sail from the Cartagena naval base and to commence patrolling the straits, with the objective of preventing a would-be attempt to shift rebel troops to the peninsula. The destroyer Churruca, patrolling the coast near Cádiz, is ordered to proceed to Ceuta. Casares also orders relocation of some aviation squadrons to the airfield in Getafe, near Madrid. Finally, he orders that any officer in active service present beyond his area of duty should be arrested\n|-\n|5:45 PM|| Melilla||compañía de Cazadores 7, called earlier by Romerales, arrives at the Melilla military headquarters and its officers, unaware of the plot, declare themselves aligned with the rebellion\n|-\n|5:45 PM || Melilla/Tetuan|| the Melilla delegado gubernativo Fernández Gil, still in his office, manages to contact Tetuan by telegraph and telephone and to speak to Alvarez-Buylla and others; he is told to offer resistance, though he has almost no means to do so\n|-\n|6 PM || Madrid||Casares informs president Azaña about developments in Melilla. The president calls his staff, including military advisers\n|-\n|6 PM || Melilla||groups of workers start to appear on the streets of Melilla, some of them armed. First they demonstrate, later they turn towards Parque de Artillería to seize firearms. They are dispersed by military detachments, there are first wounded, though no-one is killed. Sporadic shootout is heard from time to time\n|-\n|6 PM || Tetuan||the conspirators in Tetuan, who wait for arrival of Franco during one of the forthcoming days to start to coup, are informed by their fellow plotters about developments in Melilla. They immediately start preparations for urgent action, orders are being sent and key officers proceed to their units\n|-\n|6 PM || Madrid||minister of navy Giral issues detailed ordered for Cartagena warships, including blocking and possibly pounding the port in Melilla\n|-\n|6:15 PM|| Nador|| the state of war declaration is read; Nador is the second city where the rebels took control. Local units adhere to insurgency\n|-\n|6:15 PM || Melilla||rebel Guardia Civil and Carabineros units enter the Melilla ayuntamiento and detain everyone present, including the mayor and some councilors. They will be locked in the building for some 30 hours. More less at the same time, soldiers enter the building of Delegación de Gobierno and depose the delegado, Fernández Gil, who is banned from leaving the building\n|-\n|6:25 PM || Madrid||the evening session of the cabinet begins in Madrid. Casares does not reveal the news to the ministers, yet in private he talks to Prieto, who is already aware of the developments (probably thanks to a call from a PSOE militant in Melilla). The prime minister presents the events in Melilla as a localised mutiny, though it is not clear whether he believes this\n|-\n|6:30 PM|| Nador||rebels seize without resistance the airport of Tauima near Nador. At the same time another detachment tries to take control of the flying boat aviation base in Atalayón, north of Nador. They are offered resistance by the local garrison and some 45-minute combat follows; this is the first armed confrontation of the civil war. During the shooutout there are two rebel Moroccan soldiers killed; they are the first fatal casualties of the civil war\n|-\n|6:45 PM || Madrid||Prieto appears in the Cortes building to head the meeting of the PSOE parliamentary group. He informs a group of press correspondents present that there is a coup in Melilla\n|-\n|prior to 7 PM || Melilla||rebel Carabineros units board all Spanish ships in the Melilla harbour (three) and disable their radio equipment; to prevent them setting sail, they leave a patrol on every ship\n|-\n|7 PM || Madrid||one of the journalists who learned the news from Prieto calls president of the Cortes, Martínez Barrio, to break the news. Barrio tries to reach the prime minister, who is heading the cabinet session\n|-\n|7 PM || Madrid||on advice of his military ADC and head of presidential escort major Casado, president Azaña and his entourage leave the El Pardo palace, isolated in the countryside and deemed not secure; they move to Palacio Nacional in the middle of Madrid\n|-\n|7 PM || Madrid/Pamplona||one of the journalists who learned the news from Prieto calls García García, head of the Pamplonese daily Diario de Navarra and one of chief civil collaborators of general Mola. Garcilaso immediately calls Mola, and this is the moment that the actual head of the conspiracy learns about the rising in Morocco\n|-\n|7 PM || Madrid/Melilla||sub-secretary of war, Guardia Civil commander general Pozas, sub-secretary of Ministry of Economy call their respective subordinates in Melilla; they get evasive responses, but Pozas is informed straightforwardly that “we stand together with our comrades from the army”\n|-\n|7 PM || eastern Morocco|| large detachments of regulares and the Foreign Legion, stationed in eastern Morocco and ordered by rebels to proceed towards Melilla, start to appear on the streets; they assume positions in key points of the city. There are minor sporadic skirmishes noted, but there are no casualties recorded\n|-\n|7 PM || Ceuta||ayuntamiento, whose members are already aware of developments in Melilla, terminate the regular session. The communist alcalde López Sánchez-Prado declares that days of fighting are near, and visits the governmental delegate Ruiz Flores demanding (in vain) arms for the people.\n|-\n|early evening||Madrid||some politicians, like Goicoechea or Lerroux, pre-warned by conspirators, have already left or are leaving Madrid for remote rural locations or going abroad\n|-\n|7:15 PM||  Nador||the Atalayón aviation base near Nador surrenders\n|-\n|7:30 PM || Nador||general Gómez Morato, on instructions from Carases flying from Larache, lands at the Tauima airfield near Nador. He is immediately detained by local rebel commander\n|-\n|7:30 PM || Tetuan/Ceuta||most conspirators in Ceuta and Tetuan are with their units. The sun starts to set over Morocco\n|-\n|7:40 PM || Madrid||the cabinet, following a debate on Ley de Jurados Industriales, is briefly informed by Casares about the coup unfolding in Melilla; he then immediately terminates the session. The ministers are visibly shaken\n|-\n|7:45 PM || Madrid||following the closed cabinet session the journalists gathered are informed about daily proceedings, but not a word is uttered about Melilla. They are told that next session of the government is planned for Monday, July 20.\n|-\n|8 PM || Melilla||rebels in Melilla set up their general staff, lead by Segui, and its key sections, with division of duties agreed\n|-\n|8 PM || Melilla|| rebels start to transport all prisoners, it is officers who in various units refused to join the coup, to Fuerte María Cristina\n|-\n|8 PM || Tetuan|| the highest civil authority in Morocoo, Tetuan-based Alvarez-Buylla, gathers all individuals he trusts to discuss the way forward. They decide to deploy a trusted detachment around the Alta Comisaría building, but remain disoriented as to whom they may trust; some of these present are indeed in the conspiracy. De la Puente informs those gathered that general Núñez de Prado would arrive from Madrid the following day\n|-\n|8:15 PM || Ceuta||destroyer Churruca and gunboat Dato, acting on governmental orders and with a view of bombarding rebels in Melilla, arrive in the port of Ceuta; both commanders are in conspiracy\n|-\n|8:30 PM || Tetuan/Ceuta||units in Ceuta and Tetuan get ready for action; men are assembled, arms are distributed, ammunition is picked up, detailed orders are being issued\n|-\n|8:30 PM || Madrid||Casares meets Azaña, who has already moved to his new residence. It is not clear whether any specific action is agreed; the meeting is tense, as the president blames the prime minister for not having taking sufficient preventive measures\n|-\n|9 PM || Madrid||Casares begins a round of telephone calls across Spain, informing civil and military authorities about events in Melilla; he orders that the state of alert is declared in garrisons, and in most it is indeed declared during the evening/night\n|-\n|9 PM || Tetuan/Madrid||Alvarez-Buylla talks to Casares over the phone and informs the prime minister that so far, in Tetuán there is no sign of unrest\n|-\n|9 PM || Madrid||rebel commanders presumed to lead the coup in Madrid, already aware of the developments in Melilla, meet to discuss the way forward. Though the coup in the capital was not supposed to commence earlier than on 19 or 20, they decide to move the date forward and raise the Madrid garrison on July 18. Not all key generals are present, as some have already moved away from their usual places of residence and are difficult to contact\n|-\n|9 PM || Melilla|| rebel units are deployed in Mantelete, la Alcazaba and Melilla la Vieja districts of Melilla, inhabited mostly by local workers. There is sporadic shootout and perhaps some wounded, but there is no fatal casualty recorded\n|-\n|10 PM || Tetuan||V. Bandera del Tercio is the first unit to move in Tetuan; soon other units follow. The state of war is declared. Troops start to seize key buildings; 200 men present in Centro Obrero are detained until morning. There is almost no resistance and there are no casualties\n|-\n|10:30 PM || Larache||the state of war is declared in Larache. Military detachments start occupying key buildings. During attempt to seize the post office some soldiers refuse to follow orders from the rebel officers. A shootout occurs, and two rebel lieutenants get killed; they are the first Spaniards to fall during the civil war (apart from them and 2 Moroccan soldiers no more people would be killed on July 17). Few loyalists are soon overwhelmed.\n|-\n|10:30 PM || Madrid||head of republican security, Alonso Mallol, who in early afternoon hours in Burgos detained an aircraft supposed to bring general Sanjurjo to Spain during one of the days to come, returns to Madrid\n|-\n|11 PM || Tetuan||Alvarez-Buylla in Tetuán orders detention of coronel Sáenz de Buruaga and teniente coronel Beigbeder, supposed leaders of the coup in the city; officers entrusted with the task would default upon it. President of Centro Obrero de Tetuan and some trade union leaders who evaded the roundup arrive at Alta Comisaría asking for arms, which Alvarez-Buylla has not. The High Commissar sends envoys to the caliph, requesting help\n|-\n|11 PM || Ceuta||rebel units declare the state of war in Ceuta. The local governmental delegate, Ruiz Flores, orders the Guardia Civil detachment protecting the building not to offer resistance\n|-\n|11 PM || Cartagena|| Sánchez Barcáiztegui is the first destroyer to leave Cartagena; she sets sail towards Melilla and soon is followed by another destroyer, Lepanto\n|-\n|11:30 PM || Tetuan||Alvarez-Buylla manages to contact de la Puente by phone, and tells him to fortify the Sania Ramel airfield near Tetuán. Perhaps he intends to join de la Puente, but the Alta Comisaría building is isolated and surrounded by the rebels\n|-\n|before midnight || peninsular Spain|| via various channels the government learns that rebellion is unfolding also in Tetuan and Larache, unsure about Ceuta. Simultaneously, some conspiring officers and commanders in Spain, especially in Andalusia, get the news; to most it is a surprise, as they expected the coup to take place during one of the coming days, and many are unsure how to proceed\n|}\nSaturday, July 18\n{| class=\"wikitable\"\n! scope=\"col\" style=\"width: 80px;\" | hour\n! scope=\"col\" style=\"width: 120px;\" | where\n! scope=\"col\" style=\"width: 1200px;\" | event\n|-bgcolor=\"dfe2e9\"\n|-\n| after midnight|| Madrid||Casares orders Nuñez de Prado to prepare a squadron and bomb the rebels in Morocco (the previous order that Nuñez de Prado flies to Sania Ramel near Tetuan is cancelled, as the city is suspected to be under the rebel control)\n|-\n| after midnight || Madrid||numerous off-duty officers, along military channels informed about developments in Morocco, report to the regional headquarters and offer their services\n|-\n| 0:15 AM|| Madrid||Casares orders the censorship office to impose total blackout on information about Morocco\n|-\n| 0:30 AM || Madrid/Seville||Nuñez de Prado calls the Tablada air base near Seville and orders to prepare bombs and explosives, to be loaded onto aircraft to arrive from Madrid. Immediately afterwards he orders the squadron, stationed near Madrid, to proceed towards Tablada. He then orders head of Aeronautica Naval to relocate naval aircraft from Murcia to Málaga\n|-\n| 1 AM || Madrid||police raids premises of a Madrid newspaper, which plans to publish an extraordinary issue on events in Morocco\n|-\n| 1 AM || Madrid||Casares orders destitution of general Cabanellas (Virgillo), head of the most important of 8 military districts and divisions at the same time, based in Madrid. Cabanellas is either marginally or not at all involved in the plot. He is replaced by general Miaja\n|-\n| 1 AM || Madrid/Las Palmas||civil governor of Las Palmas Boix Roig gets the call from Madrid with questions about how are things in Gran Canaria, to which he correctly responds that all is normal. He is informed that in Morocco the state of war was declared signed by Franco, to which he responds that Franco and his family are sleeping in a hotel nearby. Boix asks whether he is supposed to detain Franco, but is ordered merely to send some Guardia Civil and municipal guard to watch the hotel\n|-\n| 1 AM || Ceuta||acting on governmental orders but commanded by conspirators, Churruca and Dato set sail from Ceuta to patrol the straits and prevent would-be shift of rebel troops to the peninsula\n|-\n| 1:30 AM || Las Palmas||local conspirators get the news about the coup unfolding in Morocco, including that the state of war was declared in name of Franco\n|-\n| 2 AM || Ceuta|| the rebel coronel Sáenz de Buruaga calls De la Puente, who keeps preparing the Sania Ramel airbase for defence, and tries to convince him to surrender. De la Puente refuses\n|-\n| early hours|| peninsular Spain|| in some cities civil governors call or assemble local leaders of Frente Popular, break the news and try to devise action plans in case of a coup being attempted at their location\n|-\n| 2:15 AM || Las Palmas||Franco, sleeping with his family in a hotel in Las Palmas, is woken up by fellow conspirators and gets the news about the rising declared in Morocco\n|-\n| 3 AM || Getafe||a squadron of bombers leaves Getafe airport with orders to proceed to Seville, where aircraft are supposed to be armed with bombs. However, 3 pilots (out of 6), all in conspiracy, turn north and head to Pamplona, where Mola – in order not to provoke counter-action – would order their detention\n|-\n| 3 AM|| Las Palmas||conspirators on Gran Canaria commence urgent preparations to declare the state of war, also in the neighboring province of Tenerife\n|-\n| 3 AM|| Las Palmas||civil governor meets local leaders of Federación Obrera, he also gathers some Guardia Civil commanders. A string of new telephone calls with Madrid follows, also with general Pozas\n|-\n| 3 AM|| Tetuan|| teniente coronel Beigbeder, jefe of Delegación de Asuntos Indígenas, calls the court of the caliph; he claims the army has risen against the secular and revolutionary republic, that Franco would arrive any time soon, and asks whether he could count on the people of Morocco. Soon he gets the call back, with customary greeting and best wishes\n|-\n| 3:30 AM|| Las Palmas||Franco, in plain clothes and surrounded by some conspirators, leaves the hotel and drives to Comandancia Militar, where he starts issuing first orders. His wife and daughter would be soon transferred to safe military premises; they will see each other again in August\n|-\n| before 4 AM|| Las Palmas|| governor gets from Madrid (unclear from who personally) the orders to detain Franco, but is unsure how to proceed\n|-\n| 4 AM|| Las Palmas|| Cecil Bebb, the English pilot who was chartered to fly from London to Gran Canaria and who for few days has been residing in a hotel in Las Palmas, unclear what next, is woken up and told to start preparations to fly to Morocco\n|-\n| 4 AM|| Tenerife|| conspirators in Tenerife receive from Gran Canaria the orders to prepare immediate action, and start calling officers from their homes to the local comandancia\n|-\n| 4 AM|| Cadiz|| vicealmirante Gámez Fossi, commander the Cádiz naval base, declares state of alert in naval forces of Cádiz. This is the first rebel action on the peninsula\n|-\n| 4 AM rebel|| Tetuan|| troops commence attack on Sania Ramel airbase, shootout follows\n|-\n| 4:30 AM|| Santa Cruz||the civil governor calls management of local Radio Club Tenerife and orders them to jam radio broadcasts from Tetuan, which start repeatedly reading the state of war declaration\n|-\n| 4:30 AM|| Tetuan|| rebels deploy artillery and start firing at defenders of the Sania Ramel airbase\n|-\n| 4:45|| Tetuan|| following another call to Alvarez-Buylla, isolated but not detained in the Commissariat building in Tetuan, De la Puente orders to detroy vital equipment of 7 Breguet XIX aircraft in Sania Ramel, so that they can not be used by rebels\n|-\n| 4:45 AM|| Madrid/Las Palmas|| sub-secretary of war general De la Cruz Boullosa in Madrid calls the Las Palmas Comandancia Militar and demands to speak to Franco. He is told that Franco is out inspecting troops, while in fact he just gives last orders to rise\n|-\n| 5 AM|| Tetuan|| defenders of Sania Ramel airbase surrender. There are 5 WIA on both sides, no KIA. The sun rises over Morocco\n|-\n| 5 AM|| Las Palmas|| a tugboat is prepared to carry Franco to the Gando airport, as conspirators consider taking the 20-km-long road too risky\n|-\n| 5 AM|| Cartagena|| acting on earlier governmental orders, the destroyer Almirante Valdés leaves Cartagena to start patrolling the straits. Later during the day 5 submarines, C-1, C-3, C-4, C-6 and B-6 set sail from Cartagena with the same order\n|-\n| 5 AM|| Seville|| bombers sent from Getafe land in Tablada airport near Seville. Mounting extra weapons and loading bombs begins\n|-\n| 5 AM|| Las Palmas|| Franco signs the bando declaring the state of war in the provinces of Gran Canaria and Tenerife and an accompanying manifesto, both prepared few days earlier. First troops are deployed on the streets of Las Palmas. There is no resistance offered by either public order forces or by civilians. Las Palmas is the 1st provincial capital controlled by the rebels\n|-\n| 5:15 AM|| Santa Cruz|| first troops are deployed on the streets of Santa Cruz de Tenerife. There is no resistance offered by civilians and the forces of order\n|-\n| 5:15 AM|| Burgos|| emotions have been running high following deposition and detention of general González de Lara (one of chief local conspirators) the morning before, some mid-level conspirators lead a detachment to Guardia Civil barracks, where Lara is held. During the approach one of the soldiers incidentally fires his rifle, killing another fellow soldier; the latter is the first fatal victim of the war on the peninsula. The Guardias are sympathetic and let the military in, but Lara and other detainees refuse to leave, claiming that premature action might compromise the rising (it was originally planned for July 19 or 20). Soldiers withdraw to their barracks. In few hours the detainees would be transported to the Guadalajara prison (and later killed)\n|-\n| 5:30 AM|| Santa Cruz|| comandante Moreno Ureña, head of the rebels in Tenerife, visits the residence of the civil governor, Vázquez Moro; Guardia Civil detachment guarding the building joins the rebels. Moreno tells Vázques that he is deposed and must remain within the building, where he is free and might do what he likes\n|-\n| 5:30 AM|| Melilla|| destoyers Lepanto and Sánchez Barcáiztegui, ordered few hours earlier to call at Melilla, appear near the port; they stop their engines without entering the harbor, neither they open fire at the rebels\n|-\n| 5:30 AM|| Las Palmas|| general Orgaz, commander of the Gran Canaria garrison and one of key conspirators on the island, visits Boix Roig in his civil governor office. He fails to convince Boix to renounce power, but he does not detain the civil governor, who is told not to leave the building. The latter immediately calls Madrid, where the government gets information of the coup on Gran Canaria also from some Guardia Civil sources\n|-\n| 5:30 AM|| Madrid/Santa Cruz|| in Madrid De la Cruz Boullosa again tries to reach Franco in Gran Canaria and then calls Tenerife, to find what is going on; he is told straightforwardly by coronel González Peral that the garrison is fully loyal – to Franco\n|-\n| 6 AM|| Madrid|| as the sun rises over the peninsula, among the newspapers which go out in Madrid only El Socialista managed to evade censorship intervention and publishes vague and imprecise, but highly alarming news of military rising in Morocco\n|-\n| 6:15 AM|| Las Palmas|| state of war is declared in Gran Canaria, signed by Franco. A copy is delivered to the civil governor; Boix Roig tears the paper to pieces without reading. Forces of order are either passive or join the rebels, though their high commanders remain loyal to the government\n|-\n| 6:15 AM|| Las Palmas|| Franco sends a telegram message to Morocco and all major garrisons on the peninsula, greeting the heroic Army of Africa and declaring “fe ciega” in ultimate triumph. He apparently is not aware that Romerales and Morato have been detained, as they are among the addressees\n|-\n| 6:30 AM|| Las Palmas|| radio station starts broadcasting the state of war declaration and the manifesto by Franco, which claims to defend the Republic. Also the Radio Club Tenerife, which 3 hours earlier were told to jam the Tetuan messages, starts broadcasting rebel messages\n|-\n| 6:45 AM|| Melilla|| at entry to harbor destroyers under loyalist command stop a postal ship from Málaga, about to enter the port; its captain is allowed to proceed but warned that warships would fire upon the postal ship if rebel troops try to embark\n|-\n| 7 AM|| Madrid|| Casares orders Cabanellas (Miguel), the only head of 8 divisions fully committed to conspiracy and commander of the Zaragoza military region, to proceed towards Madrid for consultations; Casares is highly suspicious about him and intends to depose Cabanellas, which he thinks might be impossible remotely. Cabanellas pretends to agree\n|-\n| 7 AM|| Morocco|| rebels listen to radio messages from Las Palmas (there is no telephone communication between Morocco and Canary Islands working, and the telegraph one is shaky), but remain unsure when they might expect Franco in Africa\n|-\n| 7 AM|| Las Palmas|| Franco talks by phone to commanders of Guardia Civil, Guardia de Asalto and Carabineros on Gran Canaria, but they refuse to join the rebellion; some detachments of these services remain locked in their barracks with unclear intentions\n|-\n| 7 AM|| Las Palmas|| workers in Las Palmas instead of commencing work (Saturday was a working day at the time) gather in increasing numbers in front of Comandancia Militar; rebel officials fear that soldiers on guard of the premises might fraternize. Teniente coronel Franco Salgado-Araujo gets an infantry detachment with artillery pieces from the nearby barracks. Shots fired in the air disperse the crowd\n|-\n| 7 AM|| Morocco|| trade unions in various locations in Morocco declare general strike, yet its result vary from city to city and from one branch to another. In Melilla the strike paralyzed the city as public transport ceased to operate, also newspapers do not go out\n|-\n| 7 AM|| Madrid|| Giral orders Churruca and Dato to open artillery fire on rebel military in Ceuta. Upon receiving the orders, officers of both warships agree to default; it is the first act of rebellion in the navy\n|-\n| 7:10|| Madrid|| radio-operator at navy communications centre at the outskirts of Madrid receives a coded message from Franco to the Cartagena navy base. Instead of transmitting it, he skips the chain of command, which he rightly suspects might be controlled by conspirators, and informs high officials in the ministry. Soon he would commence a 3-day-long process of contacting every warship in the navy with warning messages in claris, which will enable crews to follow developments and not be misled by conspiring officers\n|-\n| 7:30 AM|| Madrid/Santa Cruz|| Moles calls Comandancia Militar in Santa Cruz, demanding to speak to Franco (which suggests chaos in the government, since Ministry of War was perfectly aware that Franco was in Las Palmas). After this, telephone exchange in Santa Cruz is told not to connect any calls from Madrid any more\n|-\n| 8 AM|| Ceuta|| Churruca and Dato enter the port of Ceuta and their commanders put themselves under orders of the rebel commanders\n|-\n| 8 AM|| Las Palmas|| Franco gives an interview to a local press correspondent, claiming that the army rose to restore order in Spain; he falsely claims that also peninsular garrisons joined the rising\n|-\n| 8 AM|| Tetuan|| since rebels  in Tetuan feel fully in control, they allow people held since evening hours in Centro Obrero to go home, though some individuals are detained and imprisoned\n|-\n| 8 AM|| Seville|| a military pilot and member of the Seville aviation staff fires at aircraft being prepared to bomb Morocco with the intention of sabotaging it, soon in turn to be wounded by loyalist pilots. Nearly lynched, he is transported first to medics and then to prison. When reporting the incident to commander of the Seville military region, general Villa-Abrile, conspirators claim the culprit was drunk\n|-\n| 8:30 AM|| Nador|| three aircraft from Tauima airport, held by the rebels, perform reconnaissance flights over the coast. One pilot decides not to return and to land across the border in the French zone\n|-\n| 8:30 AM|| Madrid|| Casares releases a governmental communiqué. It claims incorrectly that “in certain zones” of Morocco there is a military rising, that fully loyal land, air and naval forces are proceeding to crush the rebellion, and that the government fully controls the situation. The communiqué claims also (correctly at that moment) that no-one on the peninsula joined the rebel movement. It is the first official public confirmation of the coup unfolding\n|-\n| 9 AM|| Madrid|| general Pozas starts calling Guardia Civil commanders in numerous provinces in Old and New Castile, ordering them to assemble servicemen and proceed to Madrid\n|-\n| 9:30 AM|| Madrid|| Casares is visited by two PSOE deputies, Vidarte Franco and Cordero Pérez, who ask that firearms be distributed among workers’ militamen and trade-unionists. The prime minister refuses, declares that events are unfolding as he predicted and the government has perfectly sufficient means to deal with rebellion\n|-\n| 10 AM|| Bilbao|| teniente coronel Vidal, commander of a battalion in Bilbao, acting on his own gathers officers he suspects of conspiring in an apparently unrelated technical meeting, and detains them. The strike is precise and would later paralyse the coup in Biscay\n|-\n| 10:30 AM|| Las Palmas|| in Las Palmas Franco makes another round of calls to the civil governor and the Guardia Civil commander, who remain isolated in their quarters, and fruitlessly urges them to resign power\n|-\n| 10:30 AM|| Tetuan/Las Palmas||  rebels in Las Palmas receive a telegraph message from Sáenz de Buruaga in Tetuan, which declares that rebels control the entire protectorate and Franco might land either in Larache or in Tetuan\n|-\n| 11 AM|| Las Palmas|| Franco transfers his powers as supreme commander on the Canary Islands to general Orgaz and delivers a brief speech to officers gathered in the Comandancia in Las Palmas. He then boards a car and drives to the harbor\n|-\n| 11:30 AM|| Las Palmas|| a tugboat, waiting for Franco in Las Palmas harbour, sets sail for a voyage along the island coastline to the Gando airport. Franco's wife, who since the early morning hours stays protected in other military premises, upon learning the news, overwhelmed by events, breaks into tears\n|-\n| 11:50 AM|| Las Palmas|| Bebb and Boyers, crew of the aircraft chartered to bring Franco to Africa, leave Las Palmas in a vehicle escorted by armed motorists towards the Gando airport, where they arrive some 20 minutes later\n|-\n| morning hours|| Madrid||in some places UMRA officers at minor positions start handing out small amounts of firearms they were able to gather in front of Casas del Pueblo and similar premises\n|-\n| morning hours|| Madrid||in some barracks conspiring officers commence preparations to rise. Also in key provincial cities preparations are under way with generals appointed to lead the insurgency already in place, e.g. already on July 16 Queipo and Saliquet left Madrid and moved respectively to Seville and Valladolid\n|-\n| morning hours|| Madrid||on-duty and off-duty UMRA officers start to appear in the Ministry of War. Sub-secretary general De la Cruz Boullosa and the chief of staff general Sánchez-Ocaña are increasingly overwhelmed, and it is UMRA officers who start issuing orders to garrisons across Spain\n|-\n| 12 AM|| Madrid||regular mid-day governmental press briefing is not attended by Casares. Journalists are met by Interior sub-secretary Ossorio-Tafall, who offers no news\n|-\n| 12 AM|| Santander||battleship Jaime I, the most powerful warship in the navy, on governmental orders leaves Santander and sets sail towards Morocco. The decision is a risky one, since situation in Santander is unclear; Jaime I with her powerful artillery ensured governmental control over the city\n|-\n| 1 PM || Madrid||general García de la Herrán and teniente coronel Alvarez-Rementeria (Alberto), both in top command layer among the conspirators in the capital, meet in Madrid. They can not communicate with other key plotters, generals Fanjul and Villegas, who for security reasons left their usual residences. García de la Herrán and Alvarez-Rementeria tentatively agree to start the coup in Madrid this evening\n|-\n| 1 PM|| Pamplona|| Mola calls the Navarrese Guardia Civil commander, comandante Rodríguez-Medel, to his office; he then comes clear and invites him to join the coup. The latter refuses and walks out free, contacting the civil governor Menor Poblador. The latter orders Mola to come to his office, but Mola claims being busy and refuses. Poblador calls Mola's immediate superior, general Batet in Burgos, who in turn calls Mola. Batet declares that Mola, when few days earlier assuring him of his loyalty, lied; Mola confirms. Neither Rodríguez-Medel nor Poblador nor Batet take any action against Mola, probably assuming it would be pointless as he controls the entire garrison\n|-\n| 1:30 PM|| Burgos||in Burgos Batet intends to take action against coronel Gistau, deemed responsible for the morning raid on the local prison. However, increasingly unsure whom he can count upon, he calls a meeting of local commanders first; as no-one shows up, Batet realises he is isolated and the garrison is probably controlled by conspirators\n|-\n| 1:30 PM|| Madrid||Casares nominates general Nuñez de Prado the acting commander of the V. Military Region and orders him to fly to Zaragoza and assume command there. Shortly afterwards Nuñez de Prado, who is highly skeptical and considers his mission semi-suicidal, takes off from the Cuatro Vientos airport near Madrid\n|-\n| 2 PM|| Las Palmas||Franco arrives by tugboat to the Gando airport. He changes to civilian clothes, gives a brief speech, and 15 minutes later the aircraft with English crew and few rebel officers takes off towards Africa. It is already obvious that by dark they would not reach Spanish Morocco, which is some 1,200&nbsp;km away; the aircraft can not fly by night. It is heading towards the French Morocco\n|-\n| 2 PM|| El Ferrol||cruiser Libertad, acting on governmental orders, leaves the naval base in El Ferrol and sets sail towards Morocco\n|-\n| 2 PM|| Seville|| Queipo appears at headquarters of the II. Military Region and with no resistance detains Villa-Abrile. He then proceeds to headquarters of the infantry regiment, and also with no resistance detains the commander, coronel Allanegui. No shot is fired\n|-\n| 2 PM|| Melilla||destroyer Almirante Valdés joins Sánchez Barcáiztegui and Lepanto at anchor near entry to the port. All are under orders to pound rebels until all shells are fired or until the rebels request ceasefire, but instead, commanders stage a meeting. Two lean towards joining the rebels, one is firmly against it. The meeting goes on\n|-\n| 2:30 PM|| Pamplona||in Pamplona Mola calls local commanders of Carlist militia, orders them to commence preparations and informs them that the coup in Navarre would start 6 AM the following day\n|-\n| 2:45|| Madrid||the government issues another statement. It claims that in Morocco loyal forces are working to restore order, and that there is absolute tranquility on the peninsula; the communiqué does not contain any info on the Canary Islands\n|-\n| 3 PM|| Seville||Queipo declares the state of war in II. Military Region, which is all Andalusia. Chaotic skirmishes between troops under his command and public order forces, especially Guardia de Asalto, break out\n|-\n| 3 PM|| Madrid||according to one source, upon learning of the coup unfolding in Seville Casares offers his resignation to Azaña. The president reportedly refuses to accept it and tells Casares to discuss the way forward with Popular Front leaders. Other sources, including the memoirs of Azaña, do not confirm this\n|-\n| 3 PM|| Madrid||Casares orders his ADC, comandante Martínez Varela, to take 5 trucks, go to Montaña barracks, and pick up 45,000 carbine bolts (since 1934 all bolts for firearms not in service were stored in Montaña, while carbines without bolts in the Parque de Artilleria barracks). It is not clear what the intention of Casares was, as he vehemently opposed handing out firearms to militias. However, the commanding officer in service, coronel Serra Bartolomé, refuses to hand out bolts. He is called by his immediate superior general Miaja, but during a one-to-one meeting he still refuses to hand out bolts. He is allowed to return to the barracks, while Miaja goes to see Casares\n|-\n| 3:30 PM|| Seville||Queipo calls the conspirators in Cádiz and Córdoba, informs them that he takes control of the military region, and orders them to commence the coup as soon as possible, which they agree to do\n|-\n| 3:30 PM|| Zaragoza||Nuñez de Prado lands in Zaragoza and proceeds to see the civil governor\n|-\n| 3:45 PM|| Madrid||the government issues another public statement. It contains a warning that Radio Ceuta, controlled by rebels, poses as Radio Sevilla and broadcasts entirely false information, e.g. that rebels took control of some ministerial buildings in Madrid\n|-\n| 4 PM|| Melilla||Almirante Valdés and Sánchez Barcáiztegui, whose commanders seem prepared to talk to rebel leaders, enter the port of Melilla, while the third destroyer Lepanto sets sail back to Andalusia\n|-\n| 4 PM|| Seville||left-wing militants start to gather in workers quarters, to find access to the city centre blocked by military patrols\n|-\n| 4 PM|| Cadiz|| the rebels, led by general Varela, start deploying troops on the streets; patrols read out announcements of state of war being declared in the province. They are immediately joined by Falange militants, pre-warned about the coup. In many spots soldiers are greeted with hostility and insults\n|-\n| 4:15 PM|| Madrid|| in the Cortes building PSOE hold a meeting, presided by Prieto, of its deputies. The feeling that Casares and his government are inefficient and lost is running high, with numerous voices to dismiss the prime minister. The party executive calls to form militia patrols and in association with Guardia de Asalto take defensive positions in Sierra de Guadarrama, in correct anticipation of rebel troops approaching from northern garrisons\n|-\n| 4:30 PM|| Seville|| left-wing militants try to storm the artillery depot at Paseo de Colón to get arms, but are repelled by fire, with some 15 workers killed. These are first deaths caused by enemy fire on the peninsula\n|-\n| 4:30 PM|| Melilla||commanders of both destroyers present in Melilla go onshore and discuss the way forward with local rebel leaders; they are heavily concerned that crew of both warships are fiercely republican and might rise against their officers any minute\n|-\n| 4:30 PM|| Seville||Queipo calls general Campins in Granada and general Patxot in Málaga, both aware of the conspiracy but undecided about their loyalties, and as their new superior following destitution of Villa-Abrile (i.e. as the new self-appointed commander of II. Región Militar) he urges them to declare the state of war as soon as possible. Both, highly skeptical, commence half-hearted preparations\n|-\n| 4:45 PM|| Madrid||a cabinet session begins, attended also by Largo Caballero and Martínez Barrio. According to some participants, Casares appears calm as he believes that the coup would be nothing but isolated attempts, like the 1932 Sanjurjada. PSOE leaders disagree, claim that the government has run out of measures, and demand that arms be distributed “to the people”, the claim supported by some ministers (Barnés for education, Giral for navy). The discussion goes on for some 90 minutes\n|-\n| 5 PM|| Tetuan|| the Tablada airport near Seville performs the role of a servicing, armament and refuelling point for some aircraft, which keep flying bombing sorties against the rebels in Morocco. One bombing raid, aimed against Dar Riffen barracks of the Legion in Tetuan, results in bombs being dropped near the mezquita, with some 15 people killed and 40 wounded. They are the first civilian victims of the war. The incident produces rage among the Moroccan population, now turned firmly against the Madrid government\n|-\n| 5 PM|| Las Palmas||standout continues, as civil governor and Guardia Civil refuse to surrender, while Orgaz hesitates to order assault of their premises\n|-\n| 5 PM|| Pamplona||in Pamplona the civil governor Menor Poblador, Frente Popular leaders and Guardia Civil commander have a teleconference with Madrid, warning Moles that rebellion is to be expected any minute. They are instructed to offer resistance if possible, and if not to withdraw all loyal troops to Tafalla, to mount resistance against would-be approach of rebel troops from Navarre to Madrid\n|-\n| 5 PM|| Jérez de la Frontera, Algeciras||local rebel commanders in Jérez de la Frontera and Algeciras introduce the state of war, declared for the province of Cadiz, in their cities. In Jerez some local workers demand arms from the mayor, which he does not have. Moreover, he orders local Guardia Civil not to resist. In Algeciras it is some local officers who refuse to follow rebel orders, but they are quickly overpowered\n|-\n| 5 PM|| Cadiz||Varela deploys some 200 troops around the building of civil governor and demands surrender of power, but Zapico Menéndez-Valdés, protected by tens of assault guards and with some 300 left-wing militants who gathered there, refuses. Rebels open fire at the building, the asaltos return fire\n|-\n| 5 PM|| Melilla||Ciudad de Alicante, a large ship operating between Barcelona and Ceuta, calls at Melilla. At this point in harbors of the Quert province in Morocco there are 5 ships, which theoretically are capable of transporting some 3,500 troops daily to Andalusia. However, 2 destroyers (Almirante Valdés and Sánchez Barcáiztegui) which appear to be loyalist are at anchor at the entry to the Melilla harbor\n|-\n|5:30 PM|| Madrid||the government issues another, short statement; it declare false the news, reportedly making rounds, that the state of war has been declared in all Spain\n|-\n|5:30 PM|| Melilla|| commander of Almirante Valdés comes clear and tries to rise the crew of the destroyer for the rebel cause, greeted with vivas to the republic. A Foreign Legion detachment with music appears on the quay, probably with the intention to encourage navy crews to rebel. However, the result is the opposite. Crews panic that the legionnaires intend to board both ships, and take control of both destroyers, overpowering the officers\n|-\n|5:30 PM|| Zaragoza|| Nuñez de Prado arrives at Comandancia Militar and meets Cabanellas. He is disarmed and detained\n|-\n|5:45 PM|| Agadir||the aircraft with Franco lands in Agadir; following some 45 minutes of refuelling it takes off towards Casablanca\n|-\n|6 PM|| Tetuan||Beigbeder is admitted by grand vizier Ahmed Ganmia; fluent in Arabic, he exploits the case of Moroccan casualties, presenting also the Madrid government as a secular government obsessed with hatred to religion, including the Muslim faith. The vizier agrees to support the rebels, which would be vital when it comes to recruiting Moroccan regulares for combat on the peninsula. He than rides on a horse across Muslim quarters of Tetuan, calming down the enraged locals\n|-\n|6 PM|| Madrid||during the cabinet sitting Casares gets the call from Largo Caballero, who demands that arms be distributed among left-wing militias; Casares firmly refuses\n|-\n|6 PM|| Melilla|| crews of Almirante Valdés and Sánchez Barcáiztegui attempt to set sail; amidst chaotic manoeuvres performed with no officer command Valdés hits the quay, gets damaged and is stuck, while Sánchez manages to leave the port; she proceeds back to Cartagena\n|-\n|6 PM|| El Ferrol|| cruiser Miguel de Cervantes, acting on governmental orders, leaves the naval base in El Ferrol and sets sail towards Morocco\n|-\n|6 PM|| Cadiz|| in Cadiz general Varela deploys an artillery piece against the civil governor building, but it jams having fired the first shell. None of the two sides seems to prevail, governmental premises are solid and well-defendable. In the meantime, following minor shootout the rebel navy commanders take control of the harbor in Cadiz\n|-\n|6 PM|| Cordoba|| coronel Cascajo Ruiz, the rebel commander in Córdoba, begins to deploy troops in the city, targeting key administrative buildings and infrastructure facilities. A detachment takes control of the Córdoba radio station, which starts to broadcast the state of war announcement\n|-\n|6 PM|| Malaga|| mid-level commanders in the Malaga garrison, with tacit approval of general Patxot, lead small detachments into the city and declare the state of war. Most Guardia Civil servicemen join them. However, most of the asaltos and large groups of armed left-wing militants offer resistance, both sides taking control of some important buildings in the city. Skirmishes continue, with no party prevailing. Both sides are aware that the port of Malaga might be crucial when it comes to would-be shift of African troops to Andalusia\n|-\n|6 PM|| Barcelona|| the commander of Guardia de Asalto orders total mobilisation of his troops, who are deployed in key points of the city. He then visits the military commander, general Llano de la Encomienda with a list of 70 officers to be detained. Llano refuses to proceed\n|-\n|6 PM|| Ceuta|| the gunboat Dato, at rebel service outside the port of Ceuta, intercepts a merchant ship España no 5 and orders it to Ceuta\n|-\n|6 PM|| Madrid|| one more statement from the government, broadcast by the Madrid radio, claims that while some elements in Morocco keep resisting, no rebel movement takes place on the peninsula; the situation is fully under control and soon all would be back to normal\n|-\n|6:15 PM|| Valladolid|| during preparations to form a convoy of buses and trucks, which in line with orders from Madrid would take few hundreds of Guardia Civil men to the capital, chaos and disorder break out. Some guardias in trucks proceed to the city centre with cries of \"¡Arriba España!\". Since this is a spontaneous mutiny, local rebel officer proceeds to a rural estate where Saliquet and other officers appointed leaders of the coup await the following morning to rise\n|-\n|6:30 PM|| Madrid|| once the cabinet sitting is over (with no specific decision taken, also with no decision to distribute arms) Casares goes to Azaña. He again declares resignation; the president provisionally accepts it, and asks him to continue until his successor takes over; resignation is not made public\n|-\n|6:30 PM|| Seville|| rebels deploy artillery pieces against buildings in the centre of Seville, where the civil governor Varela Rendueles and some loyal commanders are defended by the asaltos\n|-\n|6:30 PM|| Cordoba|| in Cordoba rebels start shelling the civil governor building, protected by the asaltos, with artillery. The governor, Rodríguez de León, orders surrender and is detained; he is the first civil governor arrested by rebels. Cordoba is the 2rd provincial capital controlled by the rebels\n|-\n|6:30 PM || Melilla|| coronel Solans, commanding in Melilla, issues an official statement that artillery would be used against quarters where there is sniper fire recorded, as in parts of the city soldiers are at times fired at\n|-\n|until late afternoon|| Madrid|| streets look like normal, public transport works, usual Saturday evening crowds do not appear particularly excited, though at least 2 people are reported killed in unclear circumstances. This starts changing early evening, especially after the evening issue of Claridad goes out with first-page call \"¡Libertad o muerte!\", demands to distribute arms and chaotic information about the coup in Seville. Stores start to close ahead of schedule, agitated groups form, more and more people arrive in the centre by metro. Public order forces start to disappear from the streets\n|-\n|early evening|| Madrid|| president Azaña starts phone calls to various politicians with regard to formation of the new government. He talked to Miguel Maura and Felipe Sánchez Román, yet it is not entirely clear whether they were sounded about leading the new cabinet or merely about entering it\n|-\n|7 PM|| Madrid|| PSOE and PCE issue a joint communiqué, which declares full support for the Casares government and its policy. It also calls all workers to gather at nearest suitable premises and await further instructions and contains vague claims that the February electoral victory must now be confirmed in arms\n|-\n|7 PM || Madrid|| UGT declares general strike, but only where rebellion has taken place\n|-\n|7 PM|| Seville|| governor Varela orders surrender and combat in the centre of Seville ceases; he and other officials like the mayor are detained; Varela is the second civil governor arrested by rebels. Some further people have been killed on both sides. In the meantime, peripheral districts like Triana, San Julián and Macarena are engulfed in revolutionary chaos, with looting, churches burning and ongoing hunt for presumed enemies of the peoples. Seville (or rather its centre, with key objects) is the 3rd provincial capital controlled by the rebels\n|-\n|7 PM|| Ceuta|| destroyer Churruca and a merchant ship Ciudad de Algericas, both with some 250 rebel troops aboard, set sail from Ceuta to Cádiz\n|-\n|7:30 PM|| Pamplona|| Guardia Civil commander in Pamplona orders preparations to move all his units in buses and trucks to Tafalla\n|-\n|7:30 PM|| Madrid|| the cabinet press office issues another communiqué. It claims all provinces remain loyal to the government, and in Seville, where Queipo de Llano declared state of war, rebellion is just being defeated. It is the first official confirmation that the coup takes place in mainland Spain\n|-\n|7:30 PM|| Santa Cruz||  since morning hours the civil governor and asaltos commander remain isolated yet not assaulted in their building, the standout comes to an abrupt end. Shots are fired from the besieged building towards the soldiers, who return fire. During intense exchange, which lasts for some 15 minutes, there is one KIA on each side. Eventually the asaltos surrender and Vázquez Moro is the third civil governor arrested by rebels. Santa Cruz is the 4th provincial capital controlled by the rebels\n|-\n|8 PM|| Pamplona|| Guardia Civil troops rebel against Rodríguez-Medel, who tries to assemble his men to board trucks and mount a defensive line in Tafalla. In unclear circumstances he is shot dead, probably by his own men\n|-\n|8 PM|| Cadiz|| brief truce is arranged in the centre of Cadiz; both sides evacuate the wounded. Also, some 40 females, children and other non-combatants leave the site of the civil governor\n|-\n|8 PM|| Santoña|| left-wing commander of Santoña garrison, one of chief military units in Cantabria, comandante García Vayas, unexpectedly shows up in the barracks, declares state of alert and takes extra precautions against would-be coup (which indeed was just being prepared). He sents suspicious officers home (to be arrested next morning). The action is well-aimed and vital for preventing the coup in Cantabria\n|-\n|8 PM|| Madrid|| Miaja, who apparently agreed with Casares to leave the bolts in Montaña barracks, is approached by Alvarez-Rementería, who takes this as a sign that Miaja might be lured to the conspiracy. Miaja refuses to join, but takes no action again the plotters\n|-\n|8 PM|| Madrid|| Martínez Barrío visits both Azaña and Casares and concludes that no-one is in charge, with chaos and disorientation ruling both in the presidency and the cabinet\n|-\n|8 PM|| Madrid|| teniente coronel Gil Ruiz, head of Parque Divisionario de Artillería, orders distribution of firearms; hundreds of carbines are handed from a truck to men who can show membership card of lef-wing party or trade organization. Also in front of some Casas del Pueblo and Círculos Socialistas UMRA officers keep distributing arms they managed to get out of depots. Armed civilians start appearing on the streets, some forming patrols and checking documents of passers-by\n|-\n|8 PM|| Valladolid|| conspiracy gets out of control; mid-rank officers during evening meal come clear and animate soldiers against the government, Falange and Carlist volunteers are admitted into the barracks\n|-\n|8:30 PM|| Madrid|| Alvarez-Rementería moves to Montaña barracks and orders state of alert for 3 units stationed there (no leaves, officers recalled to sub-units etc.)\n|-\n|8:30 PM|| Valladolid|| first army detachments take to the streets, though no state of war is declared yet\n|-\n|9 PM|| Melilla|| Almirante Valdés, controlled by republican crew which overpowered officers but are hardly in position to steer the warship, assisted by a tugboat manages to unlock herself following collision with the quay. Rebels do not dare challenge the destroyer, since thanks to her artillery she enjoys massive firepower advantage. Eventually Valdés sets sail back to Cartagena\n|-\n|9:15 PM|| Casablanca|| aircraft with Franco lands in Casablanca, in French Morocco. The English crew and Spanish officers, the latter in plain clothes and on false passports, find accommodation in a hotel. Luis Bolín calls from Casablanca to Tanger. Using pre-agreed coded messages it is understood that the following day Franco should arrive in Tetuan\n|-\n|9:30 PM|| Vitoria|| military commander of Vitoria garrison general García Benítez is instructed from Madrid to detain teniente coronel Alonso Vega, rightly suspected to be the key conspirator. Benítez defaults\n|-\n|9:30 PM|| Burgos|| general Mena arrived few hours earlier to take command of the brigade commanded by general de Lara, dismissed the day before. When attempting to assume control, he is disarmed and detained by mid-level officers\n|-\n|9:30 PM|| Valladolid|| local radio station is taken over by Falangists, who declare rising against the Casares government. Guardia Civil commander is overpowered by his deputy, who joins spontaneously the unfolding coup\n|-\n|9:45 PM|| Seville|| Queipo delivers a radio address, broadcast to all Spain, pledging to defend the republic against disorder and revolution; he would be speaking at the same time almost every day for a few weeks to come\n|-\n|10 PM|| Burgos|| one of key plotters, teniente coronel Aizpuru, approaches the divisional chief of staff, uninvolved in conspiracy, coronel Moreno Calderon, and invites him to join. The latter accepts and proceeds to inform general Batet that Mena has been detained. Batet orders to set Mena free; conspirators come clear, refuse and give Batet 30 minutes to either join or surrender\n|-\n|10 PM|| Madrid|| Casares appears totally resigned and overwhelmed in his office. When approached by PSOE deputies he responds that there is nothing he could do, that all Spain has rebelled, that no-one in provincial garrisons is taking his calls, and that they rather talk to his successor\n|-\n|10 PM|| Madrid|| the Cortes chairman Martínez Barrio accepts the proposal of president Azaña to form a new cabinet\n|-\n|10 PM|| Valladolid|| general Saliquet, who in rural estate was awaiting following morning to arrive in Valladolid and commence the coup, was urgently informed of developments. He arrives at divisional headquarters and invites the commanding general Molero Lobo to join, which he refuses. Heated argument turns deadly when officers accompanying both generals draw their pistols. Molero gets wounded, one rebel is killed and another one mortally wounded. Saliquet assumes power\n|-\n|10:30 PM|| Valladolid|| soldiers are deployed on the streets, greeted mostly with vivas but sometimes with insults; shooutout breaks out near Casa del Pueblo. After Seville (II. division) and Zaragoza (V. division), Valladolid (VII division) is the third divisional headquarters where rebels take control\n|-\n|10:30 PM|| Malaga|| ceasefire is arranged, where both sides keep each other in check; the port remains under the loyalist control\n|-\n|11 PM|| Madrid|| Martínez Barrio meets some key politicians, including Prieto, Marcelino Domingo and Sánchez Román. Prieto talks over the phone to Largo Caballero, who refuses to join a government which includes parties to the right of the Popular Front. Barrio is told that PSOE will support the government, but will not enter it. Domingo and Sánchez Roman are prepared to join, but remain highly skeptical\n|-\n|11 PM|| Madrid|| García de la Herrán, Alvarez-Rementería and other conspirators stage a meeting and agree one more time one more action plan; the following day appointed individuals should take command of units in various barracks and take to the streets, later seizing also key governmental buildings. Generals Villegas and Fanjul still can not be reached; at the time they remain isolated in their provisional hideout apartments and take no action. Conspirators are neither in contact with provincial garrisons and are unaware of developments elsewhere; wildest rumors circulate, e.g. that troops of Mola are already approaching northern slopes of Sierra de Guadarrama\n|-\n|11 PM|| Zaragoza|| soldiers take to the streets, seize key buildings and mount control points; left-wing activists and trade unionists are being rounded up in hundreds. Guardia Civil and Guardia de Asalto commanders, almost all in conspiracy, act along, though state of war is not declared yet\n|-\n|11:30 PM|| Huelva||while no sign of unrest has been recorded so far, acting on instructions from general Pozas the local Guardia Civil commander (there are very small army sub-units in Huelva) forms a column, which in trucks and buses departs to Seville to fight the rebels. They are joined by few hundred militiamen from Rio Tinto, who carry with them explosives used in mining industry\n|-\n|11:30|| Burgos|| general Batet, isolated but not detained and aware that most officers are in conspiracy, tries to mobilize some sub-units, but their commanders refuse to follow orders\n|-\n|11:45 PM|| Madrid|| the PCE propagandist Ibárruri during a radio broadcast delivers a discourse which for the first time employs the later famous “no pasarán!” phrase (\"they will not pass\"; at the moment the rebels are known to control Morocco and perhaps the Canary Islands). From now on the Madrid radio every 30 minutes will broadcast brief news, usually overoptimistic and misleading, if not erroneous\n|-\n|11:45 PM|| Madrid||  Martínez Barrio visits Azaña in Palacio Nacional and informs him that given limited support of political parties, he resigns the mission to form a new cabinet. Following animated conversation he changes his mind and agrees to resume his government-forming attempt. Barrio begins a round of phone talks with politicians invited to take seats in his cabinet\n|}\nSunday, July 19\n{| class=\"wikitable\"\n! scope=\"col\" style=\"width: 80px;\" | hour\n! scope=\"col\" style=\"width: 120px;\" | where\n! scope=\"col\" style=\"width: 1200px;\" | event\n|-bgcolor=\"dfe2e9\"\n|-\n|1 AM|| Madrid|| CNT declares general strike\n|-\n|1 AM|| Seville|| commander of the Tablada airport near Sevilla surrenders to the rebels, who approached the airfield (though there is no combat). At this point rebels seize some mid-size multi-purpose aircraft, while the government loses outlet enabling bombings of Morocco\n|-\n|1 AM|| Oviedo|| a large force of some 2,000 left-wing militiamen, partially given arms by the local commander coronel Aranda, leaves in a train (18 cars) towards Madrid to assist the government\n|-\n|1 AM|| Valladolid|| civil governor Lavín, who few hours earlier barricaded himself in the office, flees the building and goes into hiding; few hours later he would return to the office and get apprehended\n|-\n|1 AM|| Malaga||while ceasefire still lasts, the civil governor Fernández Vega sends an envoy to general Patxot, with the proposal to withdraw troops to barracks and await developments in entire Spain. Patxot refuses, demands surrender and bluffs that troops from Africa are on their way across the sea to the Malaga harbour\n|-\n|1:30 AM|| Malaga|| some rebel commanders refuse to prepare for opening artillery fire against the asaltos and the civil governor building. Others rebel officers start changing sides, taking some sub-units with them\n|-\n|2 AM|| Valladolid|| state of war is declared. Since public order forces adhere to the coup, sporadic shootouts which broke out are mostly between soldiers and civilians, the latter being quickly dispersed. The order to declare the state of war is passed to all garrisons in the VII. Military Region, where it will be acted upon. Valladolid is the 5th provincial capital controlled by the rebels\n|-\n|2 AM|| Burgos|| general Batet, so far free to use phone and move within the building and still refusing to join the rebels, is disarmed, yet he is free to move within the comandancia premises and to use phone\n|-\n|2 AM|| Zaragoza|| soldiers enter the site of the civil governor Vera Coronel, who has almost no guardias at his disposal. He is detained, while guardias who did not join the rising are being locked up\n|-\n|2 AM|| Madrid||  Casares Quiroga and his ministers visit Azaña in Palacio Nacional, where their resignation is officially and formally accepted\n|-\n|2:30 AM|| Burgos|| troops declare the state of war. The civil governor Fagoaga Reus commands a handful of asaltos, who guard his building, and orders them to distribute arms to gathering JSU militants, but the guardias refuse. Following some hesitation, eventually the Guardia commander decides not to mount opposition. Apart from few shoots fired by civilians, there is no combat. In line with the plan, general Dávila assumes command. Burgos (VI. Division) is the fourth divisional headquarters where rebels take control. Burgos is the 6th provincial capital controlled by the rebels\n|-\n|3 AM|| Bilbao||  the commanding officer Fernández Piñerua receives phone orders from the Mola headquarters in Pamplona to declare the state war during morning hours of the day. He refuses, claims that appropriate orders could only come from general Batet, and informs key public order and civilian authorities, which remain on alert since the day before; they decide to mount a pre-emptive strike and in few hours detain key officers, suspected of conspiracy\n|-\n|3 AM|| Madrid||  Barrio completes the list of ministers, with Miaja in war, Barcia Trelles in interior, and Giral in navy. The cabinet is composed of PNR, UR, IR, ERC and independents. General Castelló Pantoja, at the time in Badajóz, is nominated to replace Miaja (who held this post for 25 hours) as head of the I. Military Region. It is understood that the new government will not hand out arms to left-wing militias and perhaps seek some understanding with the rebels, though this is unclear\n|-\n|3:15 AM|| Madrid|| the newly appointed minister of war Miaja keeps calling various garrisons, usually getting ambiguous responses though also some assurances of total loyalty. He talks also to Mola, who confirms that he is in rebellion and declares that no understanding can be reached\n|-\n|before dawn|| Madrid/Zaragoza||  Martínez Barrio talks over the phone to general Cabanellas, who says it is too late to seek compromise\n|-\n|before dawn|| Madrid/Burgos||  Martinez Barrio talks over the phone to general Batet, who declares loyalty to the government but informs Barrio that he is isolated and the entire garrison has rebelled. He suggests that Barrio talks to Mola, who according to him, effectively took command of the division\n|-\n|before dawn|| Madrid/Pamplona||  Martinez Barrio talks over the phone to general Mola, assuring him of moderate character of the new government and perhaps offering some posts in the cabinet. Mola says it is too late to seek compromise\n|-\n|before dawn|| Madrid/Biarritz|| according to some sources, Martinez Barrio talks over the phone to Gil-Robles (who since February has been residing mostly in Biarritz), inviting him to take a seat in the future government; Gil-Robles refuses. Other sources do not confirm the conversation has taken place\n|-\n|4 AM|| Madrid||  Martínez Barrio sends to press the composition of his cabinet, morning issues of Madrid newspapers go to print and radio starts to broadcast the news\n|-\n|4 AM|| Malaga|| Patxot, during last few hours abandoned by some of his rebel officers and in vain awaiting a rebel naval convoy to arrive from Melilla, orders withdrawal to the barracks. There have been some few KIAs and few dozens WIA recorded. Málaga is the first case of the coup having been defeated in a provincial capital. For the time being Patxot is not detained. The city is gradually being taken over by revolutionary militias\n|-\n|4 AM|| Zaragoza|| rebel troops seize all official buildings (ayuntamiento, diputación, tribunal) and these key to infrastructure (post, radio, CEPSA, power plants etc.)\n|-\n|4:15 AM|| Madrid/Valencia|| Martínez Barrio talks over the phone to general Martínez Monje, commander of the III. Military District (Valencia); Monje is in conspiracy, but he keeps vacillating; during the conversation he assures Barrio of his loyalty to the government\n|-\n|4:30 AM|| Barcelona|| officers with first sub-units leave barracks, intending to take positions at vital points in the city; in total, there are some 2,000 people (including Carlists and Falangists) taking to the streets. During following 1–2 hours, new and new units will be leaving barracks\n|-\n|4:45 AM|| Barcelona|| the Generalitat delegado of public order Escofet calls Llano de Encomienda demanding action, to which the general responds that he has few effectives under his command. Disappointed, Escofet orders forces of order, who remained on alert, to confront soldiers\n|-\n|5 AM|| Vitoria|| Alonso Vega sends troops to detain the civil governor and seize his office, which is done with no resistance offered. Commander of the garrison, general García Benitez, marginally involved in conspiracy, decides to collaborate with Alonso\n|-\n|5 AM|| Cartagena|| the loyalist commanding general Martínez Cabrera sends a column to seize the nearby navy airfield in San Javier, which declared insurgency. San Javier staff surrender with no combat and counter-admiral Fontenla is detained, having been the first general-rank rebel officer arrested\n|-\n|5 AM|| Zaragoza|| exactly as agreed between Mola and Cabanellas, the latter declares the state of war; given almost total adhesion of officers in army, civiles and asaltos, there is close to no opposition offered. Roundup of trade union and left-wing party leaders continues\n|-\n|5:15 AM|| Casablanca|| the aircraft with Franco takes off to Tetuan\n|-\n|5:30 AM|| Cadiz|| Churruca and Ciudad de Algeciras reach the port of Cadiz, carrying some 250 troops. As the port is controlled by rebels they immediately disembark and join fightings in the city. After disembarkment Churruca and Ciudad set sail back to Ceuta, to transport another group of soldiers from Africa to Andalusia (the commander of Churruca declined the proposal that a detachment of legionnaires is stationed on board in case the crew turns against rebel officers)\n|-\n|before 6 AM|| Madrid|| as the sun rises over the peninsula, morning newspapers go out. They contain information about composition of the new Martínez Barrio government, information about destitution of Franco from all command posts, annulment of all state of war declarations and Miaja's decree dissolving all military units which take part in rebellion\n|-\n|6 AM|| Barcelona||  a rebel detachment takes positions in Plaza de Cataluña and seizes few buildings around the plaza\n|-\n|6 AM|| Barcelona|| first fights break out in various locations in Barcelona, including central spots like Diagonal, or the Columbus monument; soldiers are opposed first by Guardia de Asalto, who are then gradually joined by armed group of civilians, mostly CNT tradeunionists, who in buildings of Casa del Pueblo and similar were given rifles, usually hidden since the 1934 revolution\n|-\n|6 AM|| Pamplona||  Mola orders troops out of the barracks; the state of war is declared, while radio and newspapers publish his manifesto, prepared and delivered earlier. However, Mola has little information as to what is going on elsewhere, as communication with most other garrisons in scarce and unreliable. He is tempted to believe that Franco and African troops might be already in Córdoba\n|-\n|6 AM|| Vitoria|| state of war is declared. Few officers and soldiers who refuse to join are overpowered and detained\n|-\n|6 AM|| Ávila|| Guardia Civil take to the streets and proceed to detain civil authorities (there are almost no army detachments in the city); no resistance is offered\n|-\n|6 AM|| Zamora|| on orders from Valladolid, coronel Iscar Moreno orders soldiers to the streets and declares the state of war. The civil governor Martín Hernández offers no resistance, he is allowed to leave the city and eventually crosses to Portugal\n|-\n|6 AM|| Jaén|| militia patrols, formed the previous evening by Comite de Frente Popular (CFP) and partially armed (with consent of the alcalde, José Campos Perabá) keep roaming the streets. They break into the bishopric residence, claiming they are looking for weapons. There is no military unit in the city, and Guardia Civil commanders, some of them in conspiracy, remain undecided\n|-\n|6 AM|| Palencia|| general Ferrer de Miguel, acting on orders from rebel-controlled Burgos divisional command, orders soldiers to the streets and declared the state of war. Apart from minor skirmishes the only foco of resistance is the residence of civil governor Martínez Ruiz-Delgado, defended by some asaltos\n|-\n|6 AM|| Gerona|| general Fernández Ampón orders troops to the streets and declares the state of war. There is no armed opposition encountered; the civil governor is isolated – though not assaulted – in his office building\n|-\n|6 AM|| Lerida|| coronel Sanz Gracia orders troops to the streets and declares the state of war. Groups of protesting civilans are dispersed, there is 1 person shot. Most of Carabineros, Asaltos and Civiles join the coup. Premises of left-wing parties, periodicals and unions are sealed, but Sanz does not order detention of leftist leaders. During the day trade unions will declare general strike, starting July 20\n|-\n|6 AM|| Huesca|| on orders from Cabanellas in Zaragoza, coronel García Conde declares the state of war and takes to the streets. Though top commanders of public order services are loyal, many mid-rank commanders of the asaltos and the civiles join. There is little opposition and following isolated skirmishes the rebels take control of the city, detaining the civil governor Carrascosa. Following a series of local state-of-war declarations made at dawn, the rebels now control 14 provincial capitals\n|-\n|6 AM|| Ceuta|| a battalion of regulares aboard a ship Cabo Espartel and escorted by the gunboat Dato leave Ceuta for Algeciras. At the time there are no loyalist warships patrolling the Mediterranean, as destroyers who left Melilla are already back in their base in Cartagena and warships sent from Galicia and Cantabria are on the Atlantic, sailing along the Portuguese coast\n|-\n|6:30 AM|| Madrid||  crowds gather near major administrative buildings, military and guardia barracks; the prevailing mood is this of utter hostility to the Barrio government, since it is perceived as another bourgeoisie cabinet unable of resolute action and since there are no worker parties, especially PSOE, represented\n|-\n|6:50 AM|| Tetuan||  the aircraft with Franco lands at the Sania Ramel airfield; he immediately assumes command in Morocco. Before the aircraft takes off to Lisbon, Franco authorizes Bolín, to be aboard, to purchase 12 bomber and 3 fighter aircraft in Britain, Italy or Germany\n|-\n|6:30 AM|| Cadiz|| civil governor Zapico orders surrender; his office is seized by rebels while Zapico and some of his staff, mostly Guardia de Assalto officers, are detained\n|-\n|7 AM|| Ávila|| rebels declare the state of war and consolidate their control over the city\n|-\n|7 AM|| Madrid||  Marcelino Domingo visits the headquarters of his party Izquierda Republicana, greeted by fury and anger about the Barrio government; some young militants tear to pieces their IR identity cards\n|-\n|7 AM|| Madrid||  Barrio talks over the phone to Largo Caballero, who demands that arms be distributed to “the people”. Barrio invites him to meet in an hour\n|-\n|7 AM|| Madrid|| last moment of apparent normality in the Madrid Montaña barracks, as a group of 42 uniformed cadets march out in formation to attend a daily mass (it is Sunday). There will be neither any problems on their return, one hour later, though vigilant crowd is gathering around the barracks in neighboring streets\n|-\n|7 AM|| Madrid||  teniente coronel Mangada, known for his radical left-wing views, sent a military truck with militiamen to an arms depot in Casa de Campo, with orders to collect rifles. An aligned local commander opens the gate and intends to hand out weapons, but some officers oppose this. Intense 10-minute shootout breaks out, with 3 officers killed. These are the first fatal victims of the war in Madrid\n|-\n|7:30 AM|| Atlantic|| the crew of Churruca, on its way from Cadiz to Ceuta, rises against rebel officers and following a brief fight with some KIAs take control of the warship. The destroyer then changes course, and instead of rebel-held Ceuta starts heading to government-held Cartagena\n|-\n|7:30 AM|| Palma de Mallorca|| general Goded declares the state of war in the Baleares; as almost all officers and most Guardia Civil commanders were in conspiracy, there is close to no opposition. The exception is Menorca; though the commanding officer general Bosch Atienza is with the rebels, some officers and numerous NCOs refuse to join. Rebels seize control over all islands, but there is a stalemate in Menorca. The rebels now control 15 provincial capitals\n|-\n|morning hours||Ávila || as rebels take control over local prison, they set free Onesimo Redondo, one of the Falange leaders, incarcerated since March\n|-\n|morning hours|| Barcelona|| Escofet emerges as the de facto commander of loyalist forces in Barcelona, giving orders to Guardia Civil, Guardia de Asalto, Carabineros, Mossos d’Esquadra and these militia units which agree to follow any orders\n|-\n|8 AM|| Bilbao|| a joint parade of military and public order forces is staged across central streets, with the purpose of demonstrating the prowess and readiness of governmental forces; military conspirators in Basurto barracks hesitate and await assistance from neighboring provinces, while Carlist and Falangist groups await orders in various premises\n|-\n|8 AM|| Barcelona||  increasingly intense and increasingly chaotic fight continues on the streets of Barcelona. A rebel detachment seized the Telefónica building, where it gets surrounded; they use artillery pieces, yet few hours later are pushed out from the building. The centre of Barcelona is engulfed in fierce combat, with thousands of militants on each part; in few spots there is hand-to-hand combat. It is the first case of armed confrontation on this scale during the civil war\n|-\n|8 AM|| Barcelona|| a rebel unit fails to take the radio station, repelled by the asaltos\n|-\n|8 AM|| Palencia|| civil governor Martinez Ruiz-Delgado orders the asaltos to cease fire and surrender; he is also detained, while rebels take full control over the city. The rebels now control 16 provincial capitals\n|-\n|8 AM|| Cadiz|| the rebels seize the town hall, the last major island of resistance in the city. The alcalde is detained. Isolated fightings will be taking place during the following 48 hours, but rebel control of the city is and will be firm\n|-\n|8 AM|| Tetuan/Madrid||Franco sends to Casares (whom he still believes to be the prime minister) a telegram message of protest against bombing civilian quarters of Moroccan cities\n|-\n|8:30|| Madrid|| in Palacio Nacional Azaña meets Barrio, some members of his newly formed cabinet and some other politicians, including Prieto and Largo Caballero. Barrio provides account of his night phone talks and declares that given the dominant mood in the streets, filled with socialist and anarchist supporters manifesting against him and demanding arms, he resigns as prime minister. Prieto tries to convince him to stay, but Largo declares that UGT will not support any government which does not distribute arms. Azaña asks for personal proposals for premiership; Prieto suggests Ruiz-Funes García, and no-one opposes\n|-\n|9 AM|| Madrid||during some skirmishes between falangist and PSOE militants at calle Torrijos in Madrid there are 4 people killed. It was the first major confrontation in the capital, others will soon follow; also, during morning hours first churches in Madrid are set on fire\n|-\n|9 AM|| Logroño|| the local commander general Carrasco declares the state of war, yet he takes very limited measures as to controlling the city. The rebels now control 17 provincial capitals\n|-\n|9 AM|| Segovia|| during early morning hours the commanding officer refused to follow orders from Saliquet, who declared himself commander of the Valladolid military region; mid-rank officers lead troops to the streets and with close to no opposite take control of the city\n|-\n|9 AM|| Algeciras||gunboat Dato and a merchant ship Cabo Espartel call at Algeciras, transporting some 550 regulares troops from Ceuta\n|-\n|9 AM|| Teruel|| having 3 hours earlier received orders from Zaragoza, coronel Aguado declares the state of war. Apart from the local recruitment office there are no military units in the city. Much larger detachments of civiles and asaltos, some 110 men in total, remain disoriented\n|-\n|9 AM|| Barcelona|| general Fernández Burriel, one of highest-positioned conspirators, visits commander of the IV Military Region, general Llano de la Encomienda, invites him to join the coup and to declare the state of war. Llano refuses, is disarmed and locked under guard in the premises\n|-\n|9:30 AM|| Las Palmas|| civil governor Boix Roig, for some 28 hours surrounded but not attacked in his gobernancia building, following further negotiations orders the asaltos not to resist and surrenders\n|-\n|9:30 AM|| Madrid||Azaña calls Mariano Ruiz-Funes and asks him to form the new government. However, the latter refuses\n|-\n|10 AM|| Madrid||following consultations with Martínez Barrio, Prieto, Largo Caballero, Sánchez Roman and others, still present in presidential Palacio Nacional, Azaña decides to turn to José Giral, previously the minister of navy, to form the new government; PSOE agrees to support the cabinet given arms are distributed. This condition is accepted both by Azaña and Giral. Giral begins consultations as to composition of his cabinet\n|-\n|10 AM|| La Linea||on rebel orders the torpedo-boat No 19 from Cádiz starts shelling the town hall and barracks in La Linea, the city bordering Gibraltar where despite orders from Sevilla the local garrison did not declare the state of war. La Linea surrenders to a company of regulares, which this morning sailed from Ceuta to Algeciras and reached the city soon afterwards\n|-\n|10 AM|| Leon||train with 2,000 militiamen from Oviedo reaches León, where so far there has been no rebellion. They demand arms, but the civil governor Emilio Francés refuses\n|-\n|late morning|| Pamplona||Carlist volunteers flock from neighboring villages to Pamplona and in the city centre they form long lines waiting to be given arms and incorporated into rebel units\n|-\n|late morning|| Madrid||streets in Madrid are ruled by militias, who set up control posts and control passers-by. Also high state officials travelling in their cars are subject to checks\n|-\n|10 AM|| Ceuta||Franco arrives from Tetuan to Ceuta\n|-\n|10 AM|| Pamplona||Mola delivers an address, broadcast by the Pamplona radio station\n|-\n|10 AM|| Burgos||general Dávila on the balcony of gobernador civil office watches a military parade, greeted and cheered by most of the population\n|-\n|late morning|| Madrid|| some army sub-units appear engaged in unusual activities (transferring from barracks to barracks, drills) yet is not clear what their intentions are\n|-\n|10 AM|| Palma de Mallorca||general Goded takes off towards Barcelona\n|-\n|10:30 AM|| Madrid|| envoys of Garcia de la Herran manage to find Villegas in his hideout in a private apartment, and urge him to assume command of the I. Division, which for the time being remains without commander (Miaja is minister of war, his successor Castello is in a car on his way from Badajoz). Villegas asks for protection of Guardia Civil when going to comandancia, and as he can not be guaranteed it, he refuses to act. Instead, he orders general Fanjul to assume command in the Montaña barracks\n|-\n|10:30 AM|| Barcelona||Goded lands in a flying boat naval base; army sub-units awaiting him and commanded by rebel officers are disciplined, while naval crews maintain a dubious stance. Goded will shortly depart in an armored car for the comandancia building, navigating across streets engulfed in combat\n|-\n|11 AM|| Seville||the column from Huelva arrives at the outskirts at Seville. Guardias declare themselves rebels and combat against the miners follows; one truck loaded with explosives detonates, with many casualties. Workers are overpowered, some flee and some are taken prisoner\n|-\n|11 AM|| Salamanca|| general García Álvarez, so far loosely involved in conspiracy, on orders from divisional command in Valladolid declares the state of war. Public order forces either remain passive or join the coup. When the bando is being read on the central plaza, some people cry \"Viva la República\" and assault the military; a platoon opens fire. During so-called Tiro de la Plaza 5 people die, including a 14-year-old girl. There is no further resistance. The rebels now control 18 provincial capitals\n|-\n|11:30 AM|| Caceres|| coronel Alvarez Díez with some 300 soldiers takes to the streets, with Civil Guard being passive and undecided. Alcalde and civil governor are detained with no opposition encountered. The rebels now control 19 provincial capitals\n|-\n|11:30|| Madrid/Zaragoza|| Pozas manages to reach Cabanellas by phone. Following animated discussion, each pledges to execute the other one\n|-\n|11:30 AM|| Mediterranean||loyalist-controlled destroyer Churruca, on her way to Cartagena, meets the rebel-controlled gunboat Dato, on her way to Ceuta. Churruca is unable to use her artillery, as officers have disabled the guns. Both ships part and continue to their destinations\n|-\n|11:45|| Albacete||in the city (with no military garrison) conspirators in ranks of Guardia Civil declare the state of war and proceed to detain all key officials, including the mayor, the civil governor and the president of Diputación Provincial. There is no opposition and the rebels easily take control of almost the entire province. The rebels now control 20 provincial capitals\n|-\n|around mid-day|| Madrid||general Castelló arrives from Badajoz to assume command of the I. Military Region. He will soon learn that he is just nominated the minister of war in the emerging Giral government (command of the region will temporarily go to the caretaker commander, García Antúnez)\n|-\n|around mid-day|| Seville|| following few hours of combat the rebels take control of the Gran Plaza district, so far controlled by the workers’ militias and other revolutionaries\n|-\n|12 AM|| Segovia||the rebels declare the state of war; no resistance is offered. The rebels now control 21 provincial capitals\n|-\n|12 AM|| Pamplona ||the Carlist leader Fal Conde arrives from Biarritz in an aircraft, operated by the retired military pilot, major Ansaldo. The Carlists take over key buildings of the city, tear down republican flags and mount the bi-color standard where possible (in some cases with Sacred Heart of Jesus placed in the middle)\n|-\n|12:30 PM|| Madrid||following heated discussion and despite his doubts, Fanjul acting on orders from Villegas moves to the Montaña barracks, where he is acknowledged as supreme commander by commanders of 3 units stationed there. Fanjul edits the bando which is to declare the state of war in Madrid\n|-\n|12:45 PM|| Barcelona||Goded arrives at the comandancia building in Barcelona, where most officers, including the divisional chief of staff Moxó Marcaida, acknowledge his command. Llano de Encomienda, locked in one of the rooms, does not\n|-\n|1 PM|| Leon|| 2,000 militiamen from Oviedo, on explicit orders from Madrid given some rifles but few cartridges, having learnt that Valladolid (on railway line to Madrid) is controlled by rebels, change direction and proceed towards Zamora (the train moves very slowly and by midnight will be in Benavente)\n|-\n|1 PM|| Ciudad Real|| in the city with almost no military, the conspiracy network was poorly developed and relied mostly on Falange. Following some shootout the day before in Puertollano, in the capital local Falangists gather to collect arms and prepare to rise, while there are approached by left-wing militias. Chaotic exchange of fire with 1 dead ensues, and at this point Guardia Civil firmly sides with the loyalists. With minor skirmishes in Arenas de San Juan, these are the only fightings in the province\n|-\n|1 PM|| Madrid||shootout breaks out at the main gate to Montaña barracks, which leaves 2 militiamen dead and many wounded. From this moment on the vigilant attitude of crowds in vicinity of the barracks turns into open hostility, which leads to sort of a siege, though full-scale fighting has not broken out yet. The crowd tries to prevent people moving in or out, though in the early afternoon hours this control is rather loose and almost 200 Falangists and Carlists manage to enter the barracks\n|-\n|1:30 PM|| Madrid||general Sanchez-Ocaña, the chief of staff, resigns. There is no official successor nominated so far, but most of his work is taken over by teniente coronel Hernandez Saravia, who becomes the informal head of general staff\n|-\n|1:30 PM|| Barcelona||Goded calls for naval transport of rebel troops from Mallorca and orders some units to come to his assistance, as asaltos and militias approach his headquarters. An artillery sub-unit on its way from San Andres barracks to his headquarters has to withdraw and abandon artillery pieces, which fall into the hands of the loyalists\n|-\n|2 PM|| Seville||Fokker VIIb with 9 Foreign Legion soldiers, flying from Sania Ramel airbase near Tetuan, lands at the Tablada airport near Seville. This is the first case of African troops being transported by air to the peninsula, and it commences the airlift which would continue for almost 3 months. Until dark this day there will be 3 more aircraft flown, with the total of 41 soldiers transported during this day\n|-\n|2 PM|| Madrid||Martínez Barrio, still president of the Cortes, leaves Madrid and drives towards Valencia; he will be incomunicado until the following morning\n|-\n|2 PM|| El Ferrol||the battleship Jaime I, on her way from Santander to bomb the rebels in Morocco, calls at El Ferrol to load coal. The captain, who is in conspiracy, is informed that in El Ferrol the rebels plan to rise later at night; he prefers to fake loyalty and continue towards Morocco later on\n|-\n|early afternoon (exact hour unclear)|| Madrid||the Giral government is completed (with Castelló Pantoja in war, Pozas in interior, and Giral in navy) and approved by the president\n|-\n|early afternoon|| Madrid||on orders from the government (unclear who exactly issued them) and with approval of Giral, loyalist military commanders organize massive distribution of rifles to militants of trade unions and left-wing parties. However, many of them are unserviceable, as bolts are stored separately in Montaña barracks\n|-\n|2:30 PM|| Barcelona||some aircraft from the Prat airbase bomb Goded's headquarters, some pilots fly instead west, where they join the rebels\n|-\n|2:30 PM|| Madrid||Castelló as the new minister of war commences a round of phone calls to provincial garrisons. Out of 8 divisional headquarters, he manages to talk only to Valencia and La Coruña, while there is no contact with Seville, Barcelona, Zaragoza, Burgos and Valladolid\n|-\n|3 PM|| Barcelona||Goded speaks over the phone to the Guardia Civil commander in Barcelona, coronel Escobar Huerta, and urges him to join (civiles are mostly passive). Escobar refuses and informs Goded that a new government has been formed (unclear whether he meant Barrio or Giral), which Goded dismisses as irrelevant news\n|-\n|3 PM|| Atlantic||when officers of Libertad, which at the time was approaching Cadiz, default on orders to open fire at rebels in the port, the crew tries to overpower them, and fierce combat ensues. The men prevail, but are unsure what next. Eventually the cruiser sets sail towards Tanger\n|-\n|3:35|| Melilla||having detained the family of general Miaja, on holidays in Melilla, coronel Solans by telegraph informs Miaja about the developments\n|-\n|afternoon || Pamplona||first detachment of some 1,500 men leave Pamplona towards Logroño with the intention to reach Sierra de Guadarrama shortly. This is the first case of a column departing from rebel-held northern city towards the capital, as in the original plan of Mola. There is some 300&nbsp;km between Pamplona and Madrid; so far no column has departed from Valladolid (150&nbsp;km from Madrid)\n|-\n|afternoon|| Toledo|| coronel Moscardo, the highest-ranked officer in Toledo and commander of the Military Academy there, refuses repeated orders from Hernandez Saravia and others to send rifles and munitions from the local arms factory; he is determined to rise, yet he plays for time\n|-\n|afternoon|| Pontevedra|| civil governor Acosta Pan and the provincial Comité de Defensa de la República agree to commence general strike in the province on 11:30 the following day. CDR is deploying militia patrols on roads between major cities in the province\n|-\n|4 PM|| Barcelona|| in immediate vicinity of the university and following a brief ceasefire, fierce combat between soldiers and civiles/civilians breaks out, which leaves 81 people killed; this is the most deadly confrontation of the war so far\n|-\n|4 PM|| Madrid||sub-secretary of war De la Cruz Bullosa calls Montaña barracks, where his son serves as a cadet; de la Cruz asks that his son is allowed to go. Commander of his unit agrees, but the young cadet refuses to leave his colleagues (he will be killed by the crowd later)\n|-\n|4:30 PM|| Oviedo|| Aranda orders troops and rebel civiles commanders to take to the streets. The civil governor Liarte Lausín is surrounded in his office, but the asaltos on guard refuse to fire against soldiers. Liarte is taken prisoner. The rebels now control 22 provincial capitals\n|-\n|5:30 PM|| Barcelona||civiles, asaltos and militiamen reach Goded's headquarters and with little opposition enter the building. Goded intends to commit suicide, but is stopped by his collaborators. All rebel commanders are taken prisoner; Llano de Encomienda is set free\n|-\n|6 PM|| Madrid||formation of the Giral government and its composition is made public by the Madrid radio station (it is too late to be published by newspapers, which will publish the news the following morning)\n|-\n|6 PM|| Atlantic||when the cruiser Miguel de Cervantes was on her way along the Atlantic coast near Lisbon, the men realised that officers intended to take the warship to the rebels. The crew rose to overpower the commanders, and brief but fierce combat ensued. The victorious loyalists decided to set sail towards Tanger\n|-\n|afternoon|| Alicante|| commander of the garrison, general García-Aldave, vacillates; a phone call from the Valencia garrison makes him lean towards loyalty. With unclear intentions, he inspects troops in the barracks\n|-\n|afternoon|| Madrid||the government closes the Madrid stock exchange, supposed to open tomorrow; the intention is to prevent speculation and financial turmoil. Cash withdrawals above 2,000 ptas (some 5,000 euro of 2024) are suspended. The decision will be made public the following day, when published in BOE\n|-\n|afternoon|| Cuenca|| having been denied arms by the civil governor, left-wing militias storm the local depot, get armed and take control of the city (where so far some local military conspirators remained vacillating; there are only very small army sub-units stationed in Cuenca)\n|-\n|late afternoon|| Melilla|| stores and cafes are re-opened and public transport resumes circulation, the first case of a city seized by rebels apparently returning to normal life. However, the same afternoon a soldier has been shot in unclear circumstances; in return, commander Mezzián warns that if civilians do not hand out firearms, population of entire quarters will be removed\n|-\n|late afternoon|| Teruel|| since morning hours the city has remained in a stalemate with state of war declared but no other action on part of the rebels, passive stance of public order forces and attempts to organise loyalist force by civil governor and left-wing leaders. Rebels with some guards disperse the crowd and detain the governor, Martínez Moreno. In no provincial capital the rebels took control with a smaller force (some 10 men) than in Teruel. The rebels now control 23 provincial capitals\n|-\n|late afternoon|| Somosierra||Guardia de Asalto and militia detachments from Madrid, which earlier during the day departed to mount defensive positions in Sierra de Guadarrama against anticipated rebel columns from the north, engage in combat for railway tunnel near the Somosierra pass. The tunnel has been seized by a small group of right-wing militants, who arrived from Madrid some 30 hours earlier. First rebel troops from the north will arrive at Guadarrama only on July 22\n|-\n|late afternoon|| Badajoz|| in the city with significant military units (1 infantry brigade and 1 infantry regiment) conspiracy was poorly coordinated with no high-level commanders taking part. Numerous mid-rank officers (teniente coronel Recio the highest-ranked one) gather and decide to rebel during one of few days to come\n|-\n|6:30 PM|| Barcelona|| Goded, who has been transported to Generalitat, agrees to declare over the radio that he is defeated; the broadcast has great impact among rebel troops in Catalonia which at this point still either keep fighting (Barcelona) or acting in rebellion (Gerona, Lerida) or considering insurgency (Tarragona)\n|-\n|7 PM|| Lisbon (Portugal)|| having taken off from Pamplona earlier during the day, Ansaldo lands at the Santa Cruz military airfield. He is supposed to take Sanjurjo to Burgos the following day. Some controversy occurs, as Portuguese military intend to intern the aircraft, while the Spanish consul demands requisition. Eventually Ansaldo is told he will be allowed to take off, but from another, provisional airfield (which might contribute to the future crash and death of Sanjurjo)\n|-\n|7 PM|| Gerona||having heard Goded's broadcast, Fernández Ampón orders his troops back to the barracks. After Malaga, Gerona is the second provincial capital where the coup is clearly defeated. The rebels now control 22 provincial capitals\n|-\n|8 PM|| Barcelona|| infantry sub-units from Alcantara and Montesa regiments, fighting in Barcelona, surrender. Loyalists regain full control over the Barcelona harbor. However, in numerous other spots rebel troops continue to resist\n|-\n|8 PM|| Tetuan||Franco decorates the Grand Vizier with Cruz Laureada de San Fernando; the ceremony is followed by a military parade\n|-\n|evening|| Lerida|| in some places soldiers fraternize with protesting workers, but in others they remain under orders. There are rumors that a strong loyalist column is approaching from Barcelona. One rebel detachment takes defensive positions in the ayuntamiento. Having heard news about Goded's defeat in Barcelona, coronel Sanz develops doubts and starts vacillating\n|-\n|evening|| Palencia|| the deposed civil governor who surrendered following a brief siege, Martínez Ruiz-Delgado, is shot in unclear circumstances when in captivity. He is the first civil governor to die at the hands of the rebels\n|-\n|evening|| Madrid||revolutionary crowd turns against religious objects; during the night, some 50 churches will be set on fire\n|-\n|9 PM|| Tanger|| the cruiser Libertad arrives in the port of the international zone in Tanger\n|-\n|9 PM|| Tetuan|| rebel officers discuss shifting troops to Andalusia. The idea of organising immediately a convoy by sea protected from loyalist navy by rebel aircraft is rejected as aircraft can not fly by night. Also captains of few merchant ships are highly skeptical about the nightly cruise. It is agreed that the airlift using aircraft available, suspended because of nightly conditions, be resumed after sunrise\n|-\n|11 PM|| Santander||military commander of Cantabria, Pérez y García Argüelles, so far vacillating and considering rebellion, meets top civilian authorities, public order men and the Santoña commander García Vayas; he decides not to rise\n|-\n|11 PM|| Madrid||Giral sends a telegram message to the French government in Paris and to the prime minister Blum personally, requesting arms\n|}\nMonday, July 20\n{| class=\"wikitable\"\n! scope=\"col\" style=\"width: 80px;\" | hour\n! scope=\"col\" style=\"width: 120px;\" | where\n! scope=\"col\" style=\"width: 1200px;\" | event\n|-bgcolor=\"dfe2e9\"\n|-\n|1 AM|| Vitoria||a soldier who refused to join rebel unit in Vitoria is court-martialled and executed; it is the first formal execution carried out by any side during the war\n|-\n|1 AM|| Madrid|| in the Campamento barracks at the outskirts of the city, García de la Herran manages to overcome skepticism of some officers and commences preparations for the rising, declaring state of alert for units stationed in the barracks\n|-\n|2 AM|| El Ferrol||battleship Jaime I sets sail towards Morocco\n|-\n|2 AM|| Madrid||sporadic small arms fire around Montaña barracks turns into regular, full-scale shootout\n|-\n|2:30 AM|| Granada|| the civil governor orders to hand out 3,000 rifles to Guardia Civil, which are then to be distributed among militiamen supposed to advance towards Seville and Cordoba. The order is co-signed by general Campins, who vacillates between rebellion and loyalty. Mid-level officers play for time and ask for written order, while commencing preparations to declare the state of war\n|-\n|3 AM|| Madrid||García de la Herran in Campamento tries to get some artillery pieces transported from smaller depots to his barracks, with the intention to be able to pound the nearby Cuatro Vientos airfield and prevent would-be aerial attacks by loyalist aviation\n|-\n|night hours|| Madrid||Fanjul, commanding in Montaña barracks, plans breakout across Casa de Campo to join forces with soldiers from the Campamento barracks (separated by some 6&nbsp;km distance). However, as this would imply that 45,000 bolts are left to be collected by the loyalists, the plan is abandoned. Anyway, as Montaña and Campamento communicate using regular phone lines, their plans are known to the government\n|-\n|4 AM|| Madrid||loyalist forces besieging the Montaña barracks mount loudspeakers, which demand that the soldiers surrender\n|-\n|4 AM|| Madrid||a column of civiles, asaltos and militiamen approaches the Campamento barracks, but are repelled, also by artillery fire\n|-\n|early morning|| Getafe||Regimento de Artillería Ligera no 1 in Getafe tries to pound the Cuatro Vientos airbase in vicinity, with little effect\n|-\n|4 AM|| Barcelona||in Barcelona the San Andrés barracks surrender. Left-wing militias get access to some 30,000 rifles, as San Andrés is the largest military depot in Catalonia\n|-\n|4:30 AM|| Granada||the civil governor, alarmed by news about movement in the barracks, asks general Campins to investigate. Faced with almost total support for rebellion among his officers, Campins signs the state of war declaration and soldiers take out to the streets\n|-\n|5 AM|| Benavente||the large column of some 2,500 militiamen from Oviedo, at the time in train at the local railway station, learn that Aranda rebelled. They change their plans and instead of proceeding towards Madrid, they commence return to Asturias\n|-\n|5 AM|| Madrid||in Montaña brief truce is arranged; a delegation with white flag is allowed into the barracks to negotiate the terms of surrender. Fanjul refuses to give up\n|-\n|5:30 AM|| Madrid||asaltos manage to deploy an artillery piece against the Montaña barracks and commence fire, causing heavy damage and many casualties; first soldiers try to flee the compound\n|-\n|after sunrise|| Madrid||the Montaña barracks are bombed by loyalist aircraft\n|-\n|after sunrise|| Spain|| as usual on Monday, in general there are no morning newspapers appearing; there are some exceptions if an extraordinary issue was prepared, e.g. this was the case of the Seville-based edition of ABC (not the Madrid-based edition). The semi-official Hoja Oficial del Lunes, issued in the government-controlled area, provides news about the Giral government and information on the coup having been defeated in Madrid, Barcelona and Seville\n|-\n|after sunrise|| Tetuan|| with few aircraft available, rebel aviation resumes, albeit at a very slow rate, transport of troops from Sania Ramel near Tetuan airfield to Tablada airfield near Seville\n|-\n|6 AM|| Getafe|| Regimento de Artillería Ligera no 1 in Getafe, attacked by forces of public order and militiamen, surrender\n|-\n|6 AM|| Alcala de Henares||the garrison of the city (some 30&nbsp;km north-east from the centre of Madrid) receives orders to leave towards Sierra de Guadarrama and assume defensive positions against expected advance of rebel troops from the north. Most officers, who until this moment remained undecided, opt for joining the insurgency. Soldiers are deployed in key points of the city with close to no resistance on part of Guardia Civil or civilians. The city will be controlled by rebels until July 22\n|-\n|6 AM|| La Coruña||civil governor Pérez Carballo, anticipating rising in the city (where so far neither the army nor navy has moved) agrees with local trade union leaders to commence general strike in few hours\n|-\n|morning|| La Coruña|| general Salcedo Molinuevo, commander of the VIII. Military Region, highly suspicious of his key subordinates coronels Tovar Figueras and Cánovas Lacruz, orders their detention. However key plotters, Gutiérrez Soto and Martín Alonso, act faster, and detain Salcedo. Command of the region is assumed, somewhat reluctantly, by coronel Cánovas Lacruz (the only non-general among rebels who assumed command of a military region). Cánovas orders commanders of all garrisons in the VIII. Region to declare the state of war, yet in the city the situation is unclear\n|-\n|morning|| Madrid|| the first case of anti-aircraft artillery fire occurs when the Campamento barracks are bombed by loyalist aviation; during few hours the rebels fire at least 900 shells, yet one of the batteries is hit by a bomb\n|-\n|morning|| Jaén || the city is firmly controlled by CFP patrols; conspirators abandon any idea of a rising. Militiamen break into the Fathers of Mercy convent and kill 5 people; this is the first known case of anti-religious violence resulting in deaths (later in the day in Barbastro the Claretian convent is also assaulted with some 60 religious detained, but they will be killed during the following few weeks)\n|-\n|7 AM|| Granada||fighting breaks out in workers’ districts, especially Albaicín; military withdraw, isolate the quarter and regroup, commencing attempts to penetrate the district. Chaotic fighting continues\n|-\n|7 AM|| Gijón||coronel Pinilla Barceló, commander of the infantry regiment, takes to the streets and declares the state of war. Given the leave season, he has only few hundred soldiers under his command, and soon will find his men at various spots of the city fighting against poorly armed, but more numerous civilian militants and public order forces\n|-\n|8 AM|| Logroño||UGT declares general strike and though for 24 hours the city has been under the state of war with close to no resistance encountered so far, sporadic skirmishes break out across the city. The column from Pamplona, which departed the previous evening, gets engaged in suffocating resistance\n|-\n|9 AM|| Zaragoza|| the civil governor Angel Vera Coronel, who so far remained isolated and incomunicado in his building, is detained\n|-\n|9 AM|| Melilla||5 submarines, loyal to the government and deployed earlier on patrol duties, take positions near entry to the Melilla harbor\n|-\n|9:30 AM|| Madrid|| Fanjul is wounded during artillery shelling of the barracks\n|-\n|10 AM|| Madrid|| Regimiento de Artillería Ligera no 2 in Vicálvaro, at the south-eastern outskirts of Madrid and so far passive due to disagreement among its commanding officers, surrenders\n|-\n|10 AM|| Oviedo|| Aranda declares the state of war\n|-\n|late morning|| Pontevedra || as local Comité de Defensa de la República deployed some patrols in the city, they try to control some passing officers. In few cases altercations end in exchange of fire, and eventually local conspiracy leaders order some units to the streets. Artillery piece is deployed in front of the ayuntamiento and fires few shells. The civil governor surrenders and is detained, yet chaotic shootout continues in the city\n|-\n|10:30 AM|| Madrid||asaltos, civiles and militiamen manage to penetrate into the Montaña barracks, where chaotic scenes follow, with some soldiers trying to flee, some surrendering and some continuing combat\n|-\n|11 AM|| Barcelona|| part of the rebel cavalry regiment, encircled in a Carmelite convent, following negotiations with Guardia Civil and Escofet agree the conditions of surrender and give up. However, when disarmed, they are assaulted by mostly Anarchist militiamen, and the civiles lose control. In the rage which follows, some 35 soldiers are lynched on the spot. This is the first case of large scale war crime committed during the civil war. Some corpses will be cut to pieces and fed to animals in the zoological garden\n|-\n|11 AM|| Seville|| attempt to penetrate the Triana district, controlled by workers militias, fails; following few hours of skirmishes heterogeneous rebel forces (military, Foreign Legion, Falangists, Carlists, civiles) withdraw back across the Guadalquivir\n|-\n|11:37 AM|| Las Palmas|| Lufthansa Ju-52, on regular postal service from Gambia, is requisitioned by rebels during a refuelling stopover at the Gando airport. The German pilot is told to fly the following day to Tetuan (where he will arrive on July 23, and then will carry Franco's envoys to Hitler)\n|-\n|11:30 AM|| Madrid||loyalists take full control of Montaña barracks, where combat ceases. Fanjul is escorted away by the civiles shortly before situation gets out of control and widespread carnage begins; it will last for some time; over 150 military, mostly officers, will be lynched\n|-\n|mid-day|| Lerida|| groups of soldiers, barely under discipline, start returning to the barracks; they are accompanied by loyalist civilians. Rebel command disintegrates\n|-\n|12 AM|| Madrid||Maria Cristina barracks, home to the Wad Ras regiment, have been under fire from early morning, with some 10 people dead. Once Montaña barracks have been seized, some Guardia de Asalto units move to Was Rad; defenders are demanded by phone to give up and they indeed surrender. As there are mostly the disciplined asaltos among loyalists troops, there is no carnage and rebel officers will be orderly transported to prisons\n|-\n|12:30 AM|| Atlantic||crew of Jaime I, informed by radio that commander of the ship and officers are in conspiracy, following brief combat overpowers the officers and sets sail towards the international zone in Tanger\n|-\n|mid-day|| Madrid|| Giral nominates general Riquelme the new commander of the I. Military Region (Madrid), replacing the temporary commander Celestino Garcia\n|-\n| 1 PM|| Barcelona||Atarazanas y Dependencias Militares building, at the end of las Ramblas, is seized as one of the last isolated pockets of resistance in Barcelona; its defenders have mostly run out of ammunition, and few hours earlier Francisco Ascaso, one of CNT leaders, has been killed in combat here. In revenge, the militiamen kill most officers and some NCOs taken prisoner\n|-\n|1 PM|| Madrid||the navy chief of staff vice-admiral Salas González is deposed and arrested as allegedly sympathetic to rebels (it is unclear whether he was involved in conspiracy). The same day the navy general staff is reduced to sección de operaciones, with merely teniente de navio its head, which renders the unit hardly operational\n|-\n|1 PM|| Bilbao||news about a rebel detachment proceeding from Vitoria reaches the city. The information lifts the spirits of increasingly pessimistic military, Carlists and Falangists, gathered in the barracks or various premises. Makeshift loyalist militia group is formed and departs south to confront the approaching reblels\n|-\n|1:45 PM|| Getafe||artillery from Getafe regiment is deployed against the Campamento barracks, with heavy damages resulting\n|-\n|2 PM|| Lisbon (Portugal)|| Bolín, who arrived the day before from Tetuan and spoke to Sanjurjo, getting authorisation of Franco's disposition to purchase aircraft, takes off to Biarritz, where after 4 hours of flight he will meet Luca de Tena, to fly to Rome the following day (July 21)\n|-\n|2 PM|| La Coruña||in La Coruña the rebels declare the state of war and with little opposition take control of most of the city. The civil governor Pérez Carballo is besieged in his office, defended by Guardia de Asalto\n|-\n|2 PM || Soria||two conspiring officers from the very small Guadalajara garrison drive north in reconnaissance mission trying to establish where the column from the north, supposed to advance towards Madrid, is. They are detained; at the time Soria remains tranquil with no rebel movements so far (both Guadalajara and Soria are part of the V. Region Militar, commanded by Cabanellas)\n|-\n|2 PM|| Orense|| the rebels declare the state of war. There is close to no resistance. The rebels now control 22 provincial capitals\n|-\n|2 PM || Leon|| the rebels declare the state of war. They are opposed by chaotic groupings of civilians and fighting breaks out at few spots. Resistance is suffocated within few hours, with 3 civilians (including 2 women) killed during the shootout. Crew of the nearby military airbase in its majority joins the coup. The rebels now control 23 provincial capitals\n|-\n|early afternoon|| Toledo|| Moscardo quoting fear of unrest again refuses to send arms and munitions from the local factory to Madrid, though he poses as loyal officer\n|-\n|early afternoon|| Paris (France)|| Leon Blum, who in early morning hours received Giral's telegraph asking for arms, consents; the French government send a request for detailed specification as to what is needed. This is the first case of a foreign government getting actively involved in the conflict\n|-\n|3 PM|| Madrid||García de la Herran, commanding in Campamento, orders surrender. Shortly afterwards he is killed by soldiers who some time earlier refused to join the coup and were incarcerated. Another leader of the coup in Madrid, Alvarez-Rementería, is also killed in Campamento in unclear circumstances. Though there are islands of rebel resistance and in some barracks the military seem undecided, it is already clear that in Madrid the coup failed\n|-\n|3 PM|| El Ferrol|| rebels declare the state of war. They are almost immediately opposed by civilian militias, who offer resistance on the streets. Moreover, soon fighting breaks out aboard warships at quays or in docks, as some crew opts for insurgency and some for loyalty. Later the entire port gets engulfed in combat, especially that both sides struggle for control of the arsenal\n|-\n|3 PM|| Lugo|| rebels declare the state of war, with close to no resistance offered; they now control 24 provincial capitals\n|-\n|3:30 PM|| Cascais (Portugal)||general Sanjurjo is killed when the aircraft supposed to take him to Burgos crashes at takeoff\n|-\n|4 PM|| Vigo|| small army garrison takes to the streets with intention to declare the state of war. Soldiers are attacked by apparently well-prepared militiamen, who have firearms. Rebels withdraw to the barracks to regroup and will soon take to the streets again\n|-\n|afternoon|| Pamplona|| general Carrasco, who on July 19 declared the state of war in Logroño but allowed resistance to break out on July 20, is recalled by Mola to Pamplona and detained for negligency. It is the first case of rebels turning against own leaders\n|-\n|afternoon|| Madrid|| in the presidential residence of El Pardo at the outskirts of Madrid (abandoned by Azaña, who feared for personal safety) soldiers of Regimiento de Transmisiones, garrisoning the place, keep faking loyalty. However, having learnt about surrender of Montaña and Campamento, they commence preparations for breakout to the north, across the Sierra to Segovia (which some indeed will manage to reach the following day)\n|-\n| afternoon|| Barcelona||Companys in his premises hosts the Anarchist leaders; some sort of division of powers is agreed between the Generalitat and CNT-FAI\n|-\n|afternoon|| Seville|| 17. Company of the 5. Bandera of the Foreign Legion is the first rebel unit airlifted from Africa and re-assembled in Andalusia\n|-\n|afternoon|| Spain|| afternoon newspapers (or afternoon issues of newspapers issued twice daily) publish decrees, manifestos and orders of rebels in rebel-controlled provincial capitals, and these of the government in the remaining ones. Some already publish the last-minute news about the death of Sanjurjo. In the loyalist zone papers do not publish any news about rebellion in peninsular cities and boast of governmental success (e.g. in Alicante a local newspaper declared that \"sedicious movement is almost defeated\"), in the rebel they boast of rebel victory (e.g. in a Caceres a local newspaper declared that the coup \"triumphed in all provinces except Madrid and Badajoz\")\n|-\n|afternoon|| London (Britain)|| the Admiralty issues orders to prepare evacuation of British citizens present in Spain. Appropriate messages would be sent to British ships in or near Spanish ports\n|-\n|afternoon|| Cantabrian Mountains|| rebel column from Vitoria, which was sent to assist the coup in Bilbao and which around mid-day reached Ochandiano, is met by a loyalist column sent from Bilbao; exchange of fire follows and both groups hold their positions. This is the first case of a frontline emerging\n|-\n|afternoon|| Lerida|| coronel Sanz, detained few hours earlier, is shot in the Gardeny castle. His ADC captain Martinez commits suicide\n|-\n|5 PM|| La Coruña|| after few hours of shootout and once the rebels deployed artillery, which fired at the civil governor building, Pérez Carballo orders surrender and is detained. Minor skirmishes follow (there would be 31 KIA recorded on July 20–22), yet almost total rebel domination is clear. They now control 25 provincial capitals\n|-\n|6 PM|| El Ferrol|| in the city rebels declare the state of war, but heavy fighting in the port continues with no side prevailing\n|-\n|7 PM|| Gijón||rebel units, which failed to take control over the city, following a day of fighting withdraw to the Simancas barracks; they are besieged by loyalist militants\n|-\n|7 PM|| Pontevedra|| general Iglesias Martinez, commander of the garrison who so far kept vacillating, decides to join the rebellion, already in full swing in the city. The state of war declaration is read. Resistance on part of some NCOs in the artillery barracks is suppressed\n|-\n|8 PM|| Vigo || defenders of the ayuntamiento surrender, as the building was subject to heavy fighting since the state of war was declared few hours earlier. Rebels take control of the centre, though some sniping will continue during the night and the following day. However, the district of Teis is controlled by the workers' militias, who erected barricades. Fighting there will continue until July 22. Until end-day there are 15 dead during combat, an unusually high number for such a medium-size city and a relatively low number of combatants\n|-\n|8 PM|| Pontevedra|| soldiers take control of the A Barca bridge, a strategic point in the city, and disperse loyalist militias. Fightings in the city left 3 people dead. The rebels now control 26 provincial capitals\n|-\n|8 PM || El Ferrol|| one of key leaders of loyalist navymen, captain Mouriño, is killed during fightings for the arsenal. Sailors from the battleship España, who were under his command, start to withdraw to their warship. Rebels seem to achieve slight advantage, yet fierce fighting continues; the alcalde remains in the town hall building, defended by public order troops\n|-\n|8 PM|| Seville||following a few hours of fighting in the Seville proletarian district of Triana the rebels fail to prevail; with the night falling their troops withdraw back across the Guadalquivir; along Triana, also Macarena and San Julián districts are controlled by the revolutionaries\n|-\n|10:45 PM || Pamplona|| Mola sends out a radiogram message, received by military radio operators across all Spain. It claims that in the military regions of Valladolid, Burgos, Zaragoza and Valencia the rebels are in complete control, and that motorised columns from the north \"are quickly advancing towards Madrid\". This overoptimistic message misleads numerous conspirators, especially in the south (Andalusia and Morocco, including Franco), who are tempted to believe that indeed rebels might be approaching northern slopes of Sierra de Guadarrama\n|-\n|11 PM || Granada|| soldiers suffocate resistance in Albaicín district and take full control over the city. The rebels now control 27 provincial capitals\n|-\n|11 PM || near Orihuela|| a group of armed Falangists, led by Antonio Maciá, gather to commence a raid on the Alicante prison, where they intend to free Primo de Rivera; the operation will end up in disaster few hours later\n|-\n|late evening|| San Sebastián||first ships and boats with workers fleeing from Galicia arrive in Basque ports; in San Sebastián, where local garrison appears loyal but streets are increasingly ruled by militias, this causes extra tension and disturbances\n|-\n|late evening|| Murcia|| coronel Bruquetas, leader of the poorly developed local conspiracy, defaults on orders from general Martínez Cabrera to assemble troops and prepare departure against the rebel-controlled Albacete. Guardia Civil remains fully loyal to the civil governor Silván. Soldiers remain in the barracks and there are no disturbances, but the situation is not clear\n|-\n|late evening|| Badajoz|| the garrison receive orders from Madrid to send 2 machine-gun companies to the capital. This triggers heated overnight debate with many mid-rank officers decided to rebel the following morning\n|-\n|late evening|| Almeria|| following 2 days of vacillation, consultations and doubts, conspirators (led by teniente coronel Huertas Topete) decide to act the following morning\n|-\n|late evening|| Lerida|| sergeant Crous leads a group of armed civilians to ayuntamiento, still occupied by rebel detachment, and attempts to talk them into submission. Following protracted talks, during the night a shootout will break out\n|-\n| unclear|| Granada|| unidentified pistoleros shot the PSOE deputy to the Cortes Martín García (according to other sources on July 22). He is the first of 70 MPs, killed during the war (though there are doubts as to causes of death in case of some others, and date of death of 4 deputies is unknown)\n|}\nFootnotes\nSee also\n*Spanish coup of July 1936\n*Spanish Civil War"
    }
  ]
}