{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Kurdistan Workers' Party insurgency (2015–2025)\n\n)\n| place             = Eastern and Southeastern Turkey, Northern Syria, Northern Iraq\nFor a map, see here\n| status            = Ceasefire\n* Uprising suppressed in Turkey.\n* Start of Turkish major intervention in Syria against YPG militants.\n* Turkey advanced 15 kilometers into Kurdish region territory in Iraq against PKK\n* On 1 March 2025, PKK declared a ceasefire.\n** On 12 May 2025, PKK dissolves itself.\n| combatant1        =\n| combatant2        =\n*  Kurdistan Communities Union (KCK)\n**  PKK (until 2025)\n***  HPG\n***  YJA-STAR\n***  YDG-H\n****  CPU\n****  YPS-Jin\n**  SDF\n***  YPG\n***  YPJ\n**  PFLK\n*  HBDH\n*  Kurdistan Freedom Hawks\n| commander1        =  Recep Tayyip Erdoğan Yaşar Güler (since 10 July 2018) Hulusi Akar (from 18 August 2015 to 10 July 2018) Necdet Özel (until 18 August 2015)\n| commander2        =  Mirad Qarayîlan Bahoz Erdal Cemil Bayık  Hülya Eroğlu (senior council member) Ayfer Kordu (senior council member)\n| units1            =\n* Turkish Armed Forces\n**  Land Forces\n*** Special Forces\n**  Gendarmerie\n*** JÖH\n*** JİTEM\n**  Air Force\n* Turkish National Police\n** PÖH\n* village guards\n----\nOther forces:Grey Wolves\n| units2            =\n*  PKK\n**  KCK\n**  HPG\n**  YJA-STAR\n** YDG-H\n***  YPS\n***  YPS-Jin (since 2016)\n*  PJAK\n* HBDH\n*  SDF\n| strength1         = Around 10,000 Turkish police and military personnel 360,000 active military personnel 244,000 police forces(2015 figures, of which not all are directly involved)233,000 security guards54,000 village guards\n| strength2         = 4,000–33,000Less than 30–60 left inside Turkey (per Turkey)\n| casualties1       =\n1,494 security forces killed (per the Crisis Group)\n| casualties2       = 4,786 militants killed (per the Crisis Group)27,584+ militants killed or captured (per Turkey, includes Syrian civil war and Northern Iraq Turkey-PKK conflict)1,181 militants killed (per PKK; as of Jan. 2017)\n| casualties3       = 646 civilians killed (per the Crisis Group)226 unidentified killed (civilians or militants; per the Crisis Group)378 civilians killed (per Turkey)500–1,000 civilians killed (per HDP, as of 2016)2,000 killed in total (per UN; as of March 2017)350,000 displaced (per the Crisis Group)\n| notes             =\n| imagesize         =\n}}\nIn late July 2015, the third phase of the Kurdish–Turkish conflict between various Kurdish insurgent groups and the Turkish government erupted, following a failed two and a half year-long peace process aimed at resolving the long-running conflict.\nThe conflict between Turkey and the Kurdistan Workers' Party (PKK) broke out again in summer 2015 following two-year-long peace negotiations. These began in late 2012, but failed to progress in light of the growing tensions on the Turkish-Syrian border in late 2014, when the Turkish state prevented its Kurdish citizens from sending support to the People's Protection Units (YPG) who were fighting against the Islamic State of Iraq and the Levant (ISIL) during the Siege of Kobani. Turkey was accused of assisting the Islamic State during the siege, resulting in the widespread 2014 Kurdish riots in Turkey involving dozens of fatalities.\nIn November 2015, Turkish authorities said that a number of towns and areas in the Eastern Anatolia region had come under the control of PKK militants and affiliated armed organizations. According to Turkish government sources, between July 2015 and May 2016, 2,583 Kurdish insurgents were killed in Turkey and 2,366 in Iraq, as well as 483 members of the Turkish security forces. The PKK said 1,557 Turkish security forces members were killed in 2015 during the clashes in Turkish and Iraqi Kurdistan, while it lost 220 fighters. According to the International Crisis Group, 4,310 people, including 465 civilians, were killed in Turkey between July 2015 and December 2018, including Kurdish lawyer Tahir Elçi. In March 2017, the United Nations voiced \"concern\" over the Turkish government's operations and called for an independent assessment of the \"massive destruction, killings and numerous other serious human rights violations\" against the ethnic Kurdish minority.\nSince 2016, the Turkish military and Syrian National Army have conducted operations against the Syrian Democratic Forces, leading to the Turkish occupation of northern Syria.\nIn May 2022, the conflict gained global geopolitical significance as Turkey opposed the accession of Finland and Sweden into NATO, accusing them of supporting the PKK.\nOn 27 February 2025 Abdullah Öcalan called for an end to the over-40-year conflict, and that the PKK disarm and disband.\nBackground\nThe Kurdish-Turkish peace process saw negotiations begin between jailed Kurdistan Workers' Party (PKK) leader Abdullah Ocalan and the Turkish government in late 2012. A ceasefire was called, and the PKK agreed to withdraw from Turkish Kurdistan into Iraqi Kurdistan. In 2014, anger increased among Turkish Kurds with what they saw as the Turkish state's facilitation of the Islamic State of Iraq and the Levant's assault on Syrian Kurds during the Rojava–Islamist conflict, culminating in the 2014 Kurdish riots in Turkey during the Siege of Kobanî. The June 2015 Turkish general election saw Turkey's ruling Justice and Development Party (AKP) lose its majority, and gains for the Peoples' Democratic Party (HDP). Tensions increased further after the Suruç bombing and Ceylanpınar incident in July, after which the Turkish government launched the 2015 police raids in Turkey and attacked PKK positions in Iraq, prompting the PKK to call off its ceasefire.\nBelligerents\nTurkish military and affiliates\nTurkish Forces consisting of Turkish Land Forces troops, Gendarmerie operatives and Police Special Operations teams are backed by the rest of the Turkish Armed Forces. They are supported by a system of \"village guards\" which represent a feudal part of Turkey. There have been recurring reports of the resurfacing Jitem \"military police intelligence and anti-terrorist service\" which had been responsible for massacres in the 1990s, and of irregular foreign jihadists, being employed.\nIn 2016 the Turkish government of president Recep Tayyip Erdogan and the Justice and Development Party (AKP) were increasingly portraying the party they oppose as an enemy of an \"Islamic order\", referring to the PKK and its affiliates and supporters as \"atheists and Zoroastrians\".\nPKK and affiliates\nIn 2008, according to information provided by the Intelligence Resource Program of the Federation of American Scientists the strength of the organization in terms of human resources consists of approximately 4,000 to 5,000 militants of whom 3,000 to 3,500 are located in northern Iraq. With the new wave of fighting from 2015 onward, observers said that active support for the PKK had become a \"mass phenomenon\" in majority ethnic Kurdish cities in the Southeast of the Republic of Turkey, with large numbers of local youth joining PKK-affiliated local militant groups.\nAccording to Turkish estimates the PKK has a much larger size than the previously stated size standing at over 32,800 active fighters spanning across north-western Syria, south-eastern Turkey, northern Iraq and north-western Iran concentrated on the Qandil mountain range.\nPKK bases remain active in Northern Iraq and its leadership suspected in the Qandil Mountains in Iraq and Iran. From the traditional preceding Turkish-PKK conflicts the PKK insurgency has transitioned into urban warfare in the country's densely populated south east.\n2015 timeline\n, a former mayor of Cizre, and German politician Cem Özdemir, 15 September 2015]]\nJuly\nSuruç bombing and suspected Turkish ISIL retaliations\nOn 20 July 2015, a bombing in the predominantly Kurdish district of Suruç, reportedly perpetrated by the Dokumacılar group  linked to the Islamic State of Iraq and the Levant (ISIL), killed 32 young activists and injured over 100. Most victims were members of the Socialist Party of the Oppressed (ESP) Youth Wing and the Socialist Youth Associations Federation (SGDF), university-aged students who were giving a press statement on their planned trip to reconstruct the Syrian border town of Kobanî in the de facto autonomous Federation of Northern Syria - Rojava.\n* On 21 July, the Turkish authorities said that the PKK's military wing has killed a Turkish soldier and wounded two more in Adıyaman, in retaliation for Suruc and what they say was Turkey's collaboration with ISIL.\n* On 22 July, in Ceylanpinar (Turkey), two policemen were shot in the head by gunmen in their sleep. A week later, however, Kurdistan Communities Union (KCK) spokesman Demhat Agit said PKK was not involved, saying \"these are the units independent from the PKK. They are local forces which organized themselves and not affiliated with us\", despite reports that the PKK had previously claimed responsibility for the attack.\nOperation Martyr Yalçın against PKK\nThe 21 and 22 July attacks were proclaimed a casus belli by the Turkish government, which resulted in Turkish Prime Minister Ahmet Davutoğlu taking the decision to begin active air operations against PKK positions in Iraq. This was internationally perceived as the end of the ceasefire period in the Kurdish-Turkish conflict. The New York Times assessed that \"the Iraq raids, which began late Friday and continued into Saturday, effectively ended an unstable two-year cease-fire between the Turkish government and the Kurdish militants, also known by the initials of their Kurdish name, PKK\".\n* On 24 July, members of the PKK abducted a policeman in the province of Diyarbakir. Additionally two police officers were injured, one with life-threatening injuries, after a suspected PKK grenade attack in Hakkari.\n* On 25 July, two Turkish soldiers were killed and four were wounded in a car bomb attack in the province of Diyarbakir in Turkey by PKK fighters.\nOperations Arslan Kulaksız and Hamza Yıldırım\nTurkish Forces on 26 July reportedly again attacked the same village west of Kobani targeting Kurdish People's Protection Units (YPG) fighters, and fired on a YPG vehicle west of Tell Abyad.\n* On 26 July, it was reported that F-16s yet again took off from Diyarbakır, this time only targeting PKK targets in Northern Iraq. Although there was no official government statement on the airstrikes, PKK sources said that one of their key bases in Hakurk was attacked. It was reported that the number of fighter jets taking part was significantly lower than the jets that took part in the previous waves of the operation. The same day, Turkish artillery shelled a PKK position in the north of Iraq over several hours.\n* On 27 July, in the province of Muş the Turkish head of the gendarmerie of the Malazgirt district was killed.\n* On 28 July, for the first time since the beginning of the operation, two Turkish F-16s  bombed PKK fighters inside Turkey, in the province of Sirnak.\n* On 28 July, the pipeline between Turkey and Iran was blown up in the province of Agri in Turkey, according to the authorities PKK involvement was suspected while a sergeant of the Turkish army was killed; according to the army, the PKK is responsible. In another province, a police officer was kidnapped by suspected Kurdistan Workers' Party (PKK) militants in southeastern Turkey.\n* On 28–29 July, a new wave of shelling was launched in the night and PKK camps in Zap, Metina, Gara, Avaşin-Basyan, Hakurk and the Qandil Mountains in northern Iraq were hit by Turkish fighter jets in an operation named after the recently killed gendarmerie major, Arslan Kulaksız.\n* On 29 July, the oil pipeline between Kirkuk (Iraq) and Ceyhan (Turkey) was blown up in the east Turkey, in the Sirnak province while in Hakkari, police quarters was under attack with heavy arms, including rocket launchers and long barrel rifles. In another attack, one soldier was killed and 4 other were wounded in an attack in the Doğubeyazıt district in the eastern province of Ağri.\n* On 30 July, a policeman and a civilian were killed in the town of Cinar by PKK guerilla according to the authority, while three soldiers were killed in the attack of their convoy by PKK fighters in the province of Sirnak.\n* On 31 July, Turkish reconnaissance aircraft once again flew over YPG territory in the north of Syria. While in Iraq, Turkish fighter jets shelling massively PKK positions.\n* On 31 July, Turkish fighter jets shelled bases of PKK in the north of Iraq, with 30 warplanes were involved. This operation was named Hamza Yıldırım in honor of the Corporal Hamza Yıldırım killed by the PKK in Turkey a few days earlier.\n* On 31 July, two policemen and two PKK fighters were killed by the PKK, in a PKK raid on a police station in Pozanti, Adana. In a separate incident, PKK militants bombed a railway line in the province of Kars in the country's east, killing a worker, while three PKK fighters were killed in Agri province.\nAugust\n* On 1 August, two PKK fighters were killed and one civilian wounded in an attack in Çatak while PKK fighters took 70 hostages for two hours in the Kars-Erzurum-Iğdır highway.\n* On 2 August, one Turkish soldier was killed and four injured after a military convoy hit a mine in the Mardin Province. Both attacks were blamed on the PKK.\n* On 4 August, PKK forces attacked a guard post in Şırnak Province with an RPG, killing one soldier and injuring another. In a separate attack, a mine killed two soldiers, also in Şırnak Province resulting in Turkish F-16s targeting PKK camps in the country's Hakkarı Province, with no information on casualties.\n* On 7 August, PKK attacks left eight dead during numerous attacks. In Silopi, Şırnak Province, five were killed during clashes between Police and the PKK, resulting in the deaths of at least one soldier and one police officer. In Doğubayazıt, Ağrı Province, a PKK attack left one soldier and one militant dead. A PKK attack on a police patrol in Milyat, Mardin Province killed one police officer. Elsewhere clashes were reported in Cizre and Uludere, Şırnak Province, Başkale, Van Province and Nusaybin, Mardin Province. PKK militants were also reported to have hijacked a minibus near Beytüşşebap, Şırnak Province.\n* On 10 August, 9 people were killed in a series of PKK attacks in Turkey. In İstanbul, a car bomb targeted a police station, injuring ten police officers, one police officer and two attackers were killed in subsequent clashes. Two others attackers launched an attack on the US consulate in Istanbul however there were no casualties, police arrest one of the attackers, a female, in clashes following the attack. In Silopi, Şırnak Province, a mine hit a police convoy killing four officers. In Beytüşşebap, Sirnak Province, militants opened fire on a military helicopter, killing one soldier. Turkish security forces killed a female PKK fighter named Kevser Eltürk, took a picture of her body after they stripped her naked, and distributed the photo.\n* On 14 August, 4 soldiers were killed in a series of PKK attacks. Three soldiers were killed and six injured during clashes with the PKK in Dağlıca, Hakkarı Province. A civilian was killed during clashes between Police and the PKK in Bağlar, Diyarbakır.\n* On 19 August, 4 Turkish police officers were killed by a roadside bomb\nSeptember\n* On 3 September, PKK killed 4 Turkish police officers in Mardin province.\n* On 5 September, the Turkish security forces besieged Cizre, in a one-week operation. The operations were reported to result in about 30 deaths among city's Kurdish residents.\n* On 6 September, PKK killed 16 Turkish soldiers by a double bombing on a military convoy in Hakkari Province.\n* On 8 September, PKK forces ambushed a Police minibus killing 14 officers. A second attack also resulted in the shooting and killing of a police officer by PKK forces.\n* On 25–26 September, 34 PKK militants, 4 civilians and 2 Turkish soldiers were killed in Şırnak Province. PKK sources said 14 Kurdish insurgents and 75 Turkish Soldiers were killed.\n* On 28 September, the Kurdish lawyer Tahir Elçi was killed.\nThe Turkish police used \"Armenian\" as an insult to refer to the Kurdish people in Cizre and Burhan Kuzu, a senior adviser to the President of Turkey, said that PKK members were uncircumcised implying that they were Armenians.\nOctober\n* On 2 October, the Turkish military entered the southeastern city of Silvan, in the Diyarbakır Province with tanks, armored carriers and hundreds of troops to seek out and destroy PKK elements within the city. Resulting clashes left at least 17 PKK militants dead while PKK affiliated locals said the Turkish military had bombed civilian areas with artillery.\n* On 4 October, a video was released in which Hacı Lokman Birlik, a 24-year-old protester, was killed by Turkish security forces before his body was tied to a police car and dragged through the streets. Some pro-government journalists and AKP members called the released video from the incident as a fake and photoshopped, while other Turkish newspapers, such as Sabah called it a \"common routine against terrorists\". Haci Lokman Birlik was the brother-in-law of former HDP MP Leyla Birlik. Later, Prime Minister of Turkey, Ahmet Davutoglu, said \"it is not acceptable\" and that both officers who were responsible of dragging the body of Birlik were fired. However, the HDP released a statement stating that both officers haven't been fired and statements of Ahmet Davutoglu are not true.\n* On 10 October, a double suicide bombing was carried out in Ankara during an anti-war demonstration rally held by pro-Kurdish, leftist and communist civilians. The bombing resulted in at least 102 killed amongst the demonstrators.\nNovember\n* On 5 November, the Turkish military concluded the 40-day long 2015 Hakkari assault ground offensive in the mountains of the south-eastern border province in which hundreds of PKK fighters were killed, dozens of their bunkers were destroyed and dozens of anti-aircraft weaponry was captured.\n* On 15 November, the Turkish Air Force bombarded 44 different locations with F-16s F-4E 2020 Terminators and unmanned drones in Northern Iraq in response to the PKK attempting to reconstruct depots, barracks, bunkers and hideouts that were destroyed earlier in the year by the air strikes conducted on 31 July.\n* On 21 November, the Turkish Air Force struck 23 different locations in the Şırnak border province and in Northern Iraq destroying caches and hideouts severing PKK supply lines. These included supply and shelter points in the mountains of Semidinli, Hakkari, south-east Turkey, north of their Iraqi and Iranian borders.\n* On 22 November, the Turkish Air Force struck 7 different locations in the Hakkâri Province on the Iraqi border killing 10 PKK militants and destroying several shelters and supply points. Two civilians were also killed during the curfew in the Nusaybin district of Mardin province on the Sunday in which on Monday 23rd entered its tenth consecutive day. The Turkish chief of General Staff earlier this year released a statement saying the Military is sensitive when it comes to civilian casualties who are caught up in armed clashes.\nDecember\n* On 2 December,  PKK militants set a remote-controlled IED trap for a Turkish Army convoy, killing one soldier and injuring 9 others in the explosion in the Mardin Province.\n* On 2 December,  PKK militants launched an armed attack on a police checkpoint during a curfew in Sur injuring one officer and killing 3 PKK insurgents in the clash.\n* On 8 December, the Turkish Air Force launched night-time airstrikes consisting of 10 F-16s into Northern Iraq's Kandil, Harkuk, Zap and Avasin-Basyan regions.\n* On 11 December, the Turkish Government imposed an indefinite 24h curfew for Sur, Diyarbakır.\n* On 13 December, PKK militants launched 18 different explosive attacks on a police station in Dargeçit consisting of anti-armor RPG rockets and grenades injuring 3 police officers and 3 civilians just hours after counter-insurgency operation in the same town killed 11 militants.\n* On 14 December, the Turkish Government imposed an indefinite 24h curfew for the cities Cizre and Silopi.\n* On 15 December, the Turkish Army and Police launched a massive operation in Şırnak Province's towns of Cizre and Silopi\n* On 17 December, in Cizre and Silopi the Turkish Army and Police Special Operations units backed by tanks, armored vehicle units, and helicopters began an operation which killed over 127 Kurdish rebels in a week. Also 27 civilians were reported to have died due to the operation. Security forces raided cleared abandoned houses and trenches, destroyed barricades while fighting through and liberating militant stronghold neighborhoods. Tank shelling and artillery strikes in the surrounding mountains were also conducted, cut-off neighborhood strongholds and sniper positions targeting security forces. It is estimated half the towns population had been driven out since violence sparked-up earlier in the year leaving many unoccupied apartments and houses to be utilized by the PKK to fortify and reinforce their presence prior to this operation.\n* On 18 December, the Turkish minister of the interior Efkan Ala declared over 3,000 PKK militant had been neutralized, 10 tons of explosives had been seized, and 240 weapons had been captured since the collapse of the ceasefire earlier that year in late July\n* On 21 December, a roadside bomb in Bitlis killed 2 soldiers and injured 8 others during an anti-PKK operation.\n* On 30 December, 3 soldiers were wounded when PKK militants detonated an IED bomb in Sur.\n* On 31 December, 1 police officer was killed and 5 others were injured during a police operation to disassemble barricades and fill in ditches dug up by militants when PKK militants fired a rocket upon security forces in Cizre. Four of the injured officers who were in urgent condition were sent to the capital, Ankara for further medical treatment.\n* On 31 December, one police officer died after a PKK bomb attack in Sur during a house operation against militants. In the same operation Turkish security forces had seized an RPG, 3 rockets, an anti-tank missile, 30 electric bomb detonators and numerous PKK propaganda leaflets that police say aimed at provoking the public.\n2016 timeline\nJanuary\n* On 1 January, 12 PKK militants, two Police officers and a civilian were killed in Cizre.\nA Police officer was killed in Sur. A Soldier and one civilian was killed in Silopi A Turkish tank malfunctioned and was damaged in Cizre. A total of 18 were killed that day.\n* On 3 January, mine trap set by the PKK the previous night in a neighborhood killed 3 Turkish soldiers in Sur.\n* On 4 January, rocket attacks launched by the PKK's youth militant arm YDG-H at security forces in Şırnak resulted in an incurring shoot-out in which 2 militants were killed.\n* On 7 January, Turkish Forces killed 16 militants in Cizre and 2 in Sur bringing the PKK death toll over the last 3 weeks in the Şırnak Province to 426.\n* On 7 January, the Turkish Military captured 58 PKK militants fleeing to Iraq disguised as local villagers in the town of Silopi of the Şırnak Province\n* On 8 January, Turkish Police Special Operations, Rapid Response Force riot police and Police intelligence teams raided a HDP Kurdish opposition party's office in Istanbul arresting 5 Kurdish politicians after Police were informed that the murder weapon of 22 July 2015 murder of 2 police officers conducted by PKK militants in their sleep in Ceylanpınar was being held in that office.\n* On 9 January, a soldier and a police officer were shot-dead in an attack by PKK militants in Diyarbakır, Turkey's largest predominantly Kurdish south-eastern city.\n* On 10 January, heavy clashes during a counter-terrorism operation between the PKK and police in eastern Van killed 12 PKK militants and a police officer. Security forces say the operation successfully prevented a large scale attack against government buildings.\n* On 10 January, Turkish troops killed 20 PKK militants in Cizre, Silopi and Sur during clashes.\n* On 12 January, Turkish Police detained 16 suspects belonging to the YDG-H in Elazığ during a raid in which documents explicitly planning a crowd demonstration to harm public buildings and boast PKK propaganda was seized similar to the 7 January elementary school burning incident in Sirnak. The documents themselves are believed to be handed down from the PKK to the YDG-H youth group.\n* On 12 January, the Turkish Air Force conducted night-time airstrikes on PKK camps in the Great Zab, Gare, Avashin, and Basyan regions of northern Iraq using four F-16Ds and two F-4 Terminator 2020s technologically modernized heavy combat aircraft whilst using drones to locate camps, quartering caves and shelters prior to the strike. In the same statement to press the Turkish Armed Forces stated that 578 terrorists had been killed since 15 December, bringing the overall PKK death toll to 3,678 since July 2015.\n* On 14 January, a car bomb targeting a police station and police housing unit adjacent to the station killed 6 people and injured 40 in Çınar, Diyarbakır, southeastern Turkey. Amongst the dead where relatives of police including a family consisting of a wife, a 5-year-old and an infant. Upon the initial bomb attack, PKK militants opened fire using rockets and assault weapons on the security complex resulting in a fierce firefight. The PKK claimed the attack left over 30 Police officers dead as quoted by pro-Kurdish media, however said that more than five civilian were killed as a result of the attack.\n* On 14 January, Turkish Army troops killed 19 PKK militants in a government operations as-well as capturing a total of 10 PKK militants and affiliates.  According to the Turkish General Staff, 12 were killed in heavy clashes in Cizre, 5 were killed and 10 were captured in Silopi, and 2 were killed in Sur.\n* On 15 January, 1 Turkish Police Special Operations officer was wounded and killed in a raid on a PKK  Sleeper cell in Siirt by sniper fire from PKK militants. According to Turkish media reports, over 15,000 people attended the funeral of the slain officer Yalçın Yamaner in Tokat. The family of the slain officer whom were being accommodated in police family lodges are to be bought a house on the behalf of the General Directorate of Security.\n* On 18 January, a total of 3 service members of the Turkish Police Special Operation Department were killed and 7 were wounded in a night-time IED trap set the day before targeting the convoy in Idil. Ensuing heavy clashes reportedly lasted till dawn.\n* On 18 January, 2 Police Special Operations officers were killed and 12 were wounded in the Yenimahalle neighborhood of Şırnak Province when a police bus was struck by a rocket fired by PKK insurgents.\n* On 18 January, a Turkish Army specialized sergeant succumbed to his injuries and died shortly after being critically wounded by sniper fire in Sur.\n* On 19 January, Cizre municipal council member Abdülhamit Poçal and Selman Erdoğan were killed and IMC TV cameraman Refik Tekin along with 10 others were wounded during a firefight between Turkish security forces and Kurdish militants though it is not clear who opened fire on the group. Pro-Kurdish sources say that it was the Turkish side.\n* On 19 January, Turkish Forces conducted an operation extracting a family from their neighborhood who had received threats from the PKK to not leave and stopping those who attempt to. The PKK calls for Kurds in the region to not leave their houses and participate in the so-called resistance.\n* On 19 January, 3 Police Special Operations members were wounded when PKK militants opened fire on units removing roadblocks, dismantling barricades and filling up trenches set up by PKK elements.\n* On 21 January, new Turkish Military raids is Silopi led to the discovery of a U.S. made RQ-20 Puma UAV in the hands of PKK militants. Turkish Military officials believe that the aerial surveillance drone was handed to PKK elements by the YPG, the PKK's sister group based in Syria who are backed by the U.S. despite fierce Turkish objection. The discovery of the drone by Turkish troops further confirmed Turkey's suspicions of U.S. and various European weapons being supplied to the YPG would eventually end up in PKK hands.\n* On 27 January, while clearing out boobytrapped barricades in Sur, 4 members of the Turkish security forces were killed in a simultaneously launched attack consisting of pre-planted remote detonated explosives, rocket and sniper fire by PKK militants consisting of 3 army soldiers and a Police Special Operations officer while also wounding critically wounding 6 others. According to the Turkish Army, ensuing fierce clashes killed 9 PKK militants.\nFebruary\n* On 1 February, 3 Turkish soldiers and 2 police were killed in the Sur district of Diyarbakır.\n* On 3 February, the Turkish Air Force launched a massive scale air-strike operation consisting of around 40 jets and hit over 100 targets in Northern Iraq. Targets hit included a PKK meeting  in Qandil.\n* On 7 February, more than 150 civilians were reportedly burnt in a basement by Turkish security forces. 3 Turkish troops were wounded amongst the fierce clashes by a bomb trap.  During the raid, PKK militants were reportedly speaking on the phone with Faysal Sarıyıldiz, a HDP parliamentarian.\n* On 12 February, Turkish Army troops killed 16 PKK militants in the town of Cizre, 5 in Sur and 6 in Hakkâri Province bringing the overall PKK death toll to 27 while 24 bodies of PKK militants killed in previous operations were recovered the same day.\n* On 17 February, a Kurdistan Freedom Hawks (TAK) militant carried out a car bomb attack in Turkey's capital of Ankara killing 28 people, including 27 military personnel, and injuring a further 61. The attack targeted a bus full of military personnel in close proximity to the Turkish Armed Forces Department of Defense and parliament building. Security forces have currently detained 14 people in connection with the bombing.\nThe government held both the YPG and PKK responsible for the attack, even after the TAK claimed responsibility. It was later confirmed by  DNA reports that the perpetrator was a TAK militant.\n* On 18 February, Turkish Air Force fighter jets launched large scale air strikes in northern Iraq in response to the previous days Ankara bombing hitting a group of 60-70 militants including senior commanders in Qandil.\n* On 18 February, a roadside bomb in Diyarbakır Province killed 6 Turkish troops while another two were killed in armed attacks in the Şırnak Province.\n* On 23 February, Turkish Forces killed 6 PKK militants in clashes in Idil.\n* On 24 February, the Turkish Forces killed 20 PKK militants in heavy clashes during ongoing counter-insurgency operations in Idil.\n* On 24 February, Turkish Army AH-1 Super Cobra attack helicopters killed 12 PKK militants attempting to infiltrate the town of Idil from the Syrian border.\nMarch\n* On 2 March, the curfew in Cizre was lifted after 79 days.\n* On 6 March, Released data stating that 1,250 militants had been killed since July of last year in the Nusaybin, Dargecit and Derik districts of Mardin Province. The report further more stated that over 3,000 explosives targeting security forces had been defused and 2,307 barricades and ditches were dismantled and filled.\n* On 6 March, 6 convicted PKK militants broke out of Diyarbakır Prison. Roll call indicated 6 where shown missing. As a result, security measures at the prison were increased and an operation to locate the whereabouts of the escapees are underway.\n* On 7 March, Turkish troops killed 4 PKK militants in the Sur district of Diyarbakır Province and defused 16 explosive devices aimed at sabotaging troops.\n* On 7 March, Turkish counter insurgency operations killed 6 PKK militants in Idil. Turkish troops defused a total of 18 explosive devices in the same operation.\n* On 9 March Turkish airstrikes reportedly hit PKK shelters, ammunition depots and supply lines in northern Iraq.\n* On 11 March, Turkish Air Force airstrikes reportedly killed at least 67 PKK militants in northern Iraq. Turkish F-16's and F-4E Terminator 2020s reportedly struck PKK headquarters situated on the Iran-Iraq border. i\n* On 13 March, a suspected PKK car bombing in the capital Ankara killed 37 civilians and injured a further 125 when the car accelerated and crashed into a bus before exploding in one of the busiest areas in the city and just a few hundred yards from the prime ministers office. Those killed include the father of renowned soccer player Umut Bulut. Four days later, the TAK claimed responsibility for the attack.\n* On 14 March, a day after the Ankara bombing, 11 Turkish Air Force warplanes struck 18 different targets in Northern Iraq in response to the suspected PKK bombing. At least 45 suspect PKK militants were killed.\n* On 16 March, Turkish police detained 73 PKK terror suspects including lawyers throughout the country during simultaneous raids in connection to the March 2016 Ankara bombing.\n* On 22 March, an attack by PKK militants killed a Turkish soldier and injured 6 others in Nusaybin.\n* On 23 March, Turkish Air Force F-16s and F-4 Terminator 2020s struck several PKK targets in northern Iraq and in Turkey's bordering south eastern mountains including shelters, caves, weapons caches, and militants killing at-least 24 insurgents.\n* On 24 March Turkish forces killed a PKK linked YPS leader in Sirnak\n* On 28 March, documents were released by the Turkish government which indicated that they have made a decision to illegally confiscate 9,000 acres of property in the historic city center of Diyarbakir, including thousands of private properties and 6 churches owned by religious foundations. The Turkish Government states that they appropriated the land and properties in the historic district in order to rebuild and repair them, although locals are skeptical of this, with the appropriations sparking more conflict in the region.\n* On 29 March, Salih Zeki Cetinkaya, the chairman of the Justice and Development Party (AKP) in Ispir was kidnapped by PKK militants in Lice.\n* On 29 March, ongoing Turkish military operations killed 16 PKK militants in Nusaybin.\n* On 29 March, Turkish troops killed 9 PKK militants during clashes in Sirnak.\n* On 29 March, Turkish troops killed 3 PKK militants and recovered one body of a previously killed militant during clashes in Yüksekova\n* On 31 March, 7 police officers were killed and 27 people were injured by a PKK car bomb in Diyarbakır after a vehicle laden with explosives rammed into a police bus and detonated.\nApril\n* On 2 April, 5 Turkish troops and a Police Special Operations officer was killed in Nusaybin by an IED bomb planted by PKK militants.\n* On 3 April, Turkish Forces killed seventeen militants in Yuksekova, six in Nusaybin and four in Sirnak in anti-insurgency operations bringing the total to 27.\n* On 4 April, a member of the paramilitary Kurdish Village guard forces whom are fighting alongside Turkish Forces against PKK insurgents, was killed by PKK militants disguised as doctors in front of a clinic in Bitlis.\n* On 5 April, Turkish Air Force F-16s and F-4 Terminator 2020s attacked PKK targets in the Qandil Mountains of northern Iraq, targets struck include PKK weapons caches, ammunition depots & militant shelters killing 67 militants.\n* On 5 April, a Turkish army tank en route to ongoing regional military operations traveling as a part of an armored convoy through the mountainous terrain of Uludere fell off of a cliff tumbling into a canyon below killing 1 crew member and injuring another.\n* On 7 April, a Turkish soldier and Police Special Operations officer was killed by an IED bomb attack in Nusaybin during ongoing military operations to root out militants.\n* On 8 April, Turkish warplanes struck unspecified targets in south eastern Turkey and northern Iraq.\n* On 8 April, Turkish forces killed 12 PKK militants in military operations in the countries south-east. 7 in Nusaybin, 3 in Hakkari and 2 militants in Sirnak.\n* On 10 April, the Turkish Army launched an operation in Hakkari killing 19 PKK militants in various districts. Turkish troops recovered dozens of hand made bombs,  AK-47 style assault rifles, RPG-7 rockets and rocket launchers during the operation which lasted around an hour.\n* On 12 April, a massive truck-bomb attack by PKK militants on the Hani regional Gendarmerie headquarters killed 3 Turkish soldiers and injured 54 others.\n* On 12 April, during clashes between Turkish troops and PKK in Hakkari an explosion unknown and random explosion most likely from an IED bomb killed 1 soldier and injured 4 others.\n* On 12 April, a gun attack by PKK militants killed 1 soldier and injured 4 others during ongoing military operations in Sirnak.\n* On 13 April, Cemil Ates, a senior PKK militant leader was killed during clashes with security forces in Muş\n* On 16 April, 5 Police Special Operations officers were killed and 6 others were wounded by a roadside bomb in Savur.\n* On 17 April, 23 PKK militants were killed in the mountains of Tunceli in a military operation by troops and attack helicopters after a Turkish UAV spotted a group of militants.\n* On 21 April, Turkish F-16's carried out air-strikes in the mountains of Hakkari and Sirnak destroying PKK targets.\n* On 22 April, 3 Turkish soldiers were killed by a roadside bomb planted by PKK militants in Tunceli.\n* On 22 April, Turkish forces killed 8 PKK militants in ongoing military operations in Sirnak.\n* On 22 April, Turkish forces killed 4 PKK militants in ongoing military operations in Nusaybin.\n* On 22 April, Turkish troops killed 18 PKK militants attempting to cross the border into Syria's Qamishli region from Turkey's south eastern Nusaybin region.\n* On 22 April, Turkish troops killed 6 PKK militants in Mardin and Sirnak.\n* On 23 April, a Turkish Gendarmerie soldier was killed by PKK sniper fire in Mardin.\n* On 23 April,  Turkish Air Force F-16's and F-4E 2020 Terminator fighter jets struck several targets in northern Iraq.\n* On 28 April, two soldiers and 10 PKK members were killed in counter-terrorism operations.\n* On 30 April, 20 Turkish fighter jets struck scores of PKK targets in air-raids in Northern Iraq and Sirnak's vast and mountainous border region within Turkey.\nMay\n* On 1 May, 3 Turkish soldiers were killed and 14 others were wounded in the Nusaybin district when the PKK attacked an army bomb disposal team with rockets.\n* On 2 May, 24 PKK militants were killed in ongoing military operations in the south-east. 7 were killed in Sirnak, 6 in Nusaybin, 6 in Cukurca and 5 in Semdinli.\n* On 2 May, 18 PKK militants were killed in air-strikes by F-16 and F-4 Terminator 2020 fighter jets in the Qandil Mountains of northern Iraq.\n* On 6 May, PKK militants killed a Turkish soldier with a missile.\n* On 7 May, two PKK militants were killed in the province of Tunceli by Turkish forces.\n* On 8 May, 12 PKK militants were killed in northern Iraq in air-strikes launched by Turkish Air Force F-16's. Targets also included PKK bunkers, gun emplacements and ammunition depots.\n* On 12 May, 4 PKK militants and 13 civilians were killed in a premature explosion while loading a truck with heavy explosives in preparation of an attack on Turkish forces.\n* On 13 May, 6 Turkish troops and 22 PKK militants were killed in a PKK attack in Cukurca.\n* On 13 May, 2 Turkish pilots died in a helicopter crash caused by a PKK-fired MANPAD in the mountains of Hakkari. The attack helicopter was en route to engage PKK militants attacking Turkish troops in Cukurca. Turkish media initially thought the incident was an accident.\n* On 14 May, the Turkish Air Force launched a series of air-strikes killing 12 PKK militants in Turkey's southeast as well as northern Iraq.\n* On 15 May, the Turkish Military announced that it had killed 35 PKK militants in military operations. 18 were killed by air-strikes into the Qandil Mountains of northern Iraq, 8 killed in Sirnak, 4 in Sarikamis, 3 in Yuksekova and 2 in Nusaybin.\n* On 18 May, 4 Turkish soldiers were killed and 9 others were wounded when PKK militants detonated a roadside bomb in Hakkari ambushing a surpassing convoy.\n* On 18 May, Turkish Air Force F-16s and F-4E Terminator 2020s launched overnight air-strikes in northern Iraq killing 10 PKK militants.\n* On 22 May, 30 PKK militants were killed in Turkish airstrikes in northern Iraq\n* On 24 May, 6 Turkish soldiers were killed after a PPK attack on Van Province. [http://www.dailysabah.com/war-on-terror/2016/05/24/pkk-terror-attack-in-eastern-turkey-leaves-6-soldiers-dead-4-wounded (Daily Sabah)]\n* On 25 May, YPS said it withdrew its forces in Nusaybin. Also 67 PKK members surrendered in 20–25 May. HDP states they are civilians, not PKK fighters.\n* On 28 May, Turkey president Recep Tayyip Erdoğan made a speech to Islamist supporters in the town of Diyarbakir which gained global attention as he referred to \"our enemy\", presumed to be the PKK and its supporters, as \"atheists and Zoroastrians\".\n* On 29 May, Turkish Air Force fighter jets struck several PKK targets in northern Iraq killing at-least 14 PKK militants.\n* On 30 May, 2 Police Special Operations officers were killed by a bomb trap by PKK militants in İpekyolu.\n* On 31 May, the Turkish Air Force launched air strikes in northern Iraq hitting six different positions.\nJune\n* On 5 June, 7 PKK militants were killed in Şemdinli during ongoing military operations.\n* On 5 June, 20 PKK militants were killed in Hakkari border province and northern Iraq after a series of Turkish military air strikes. Turkish Air Force F-16's reportedly struck caves, shelters, weapons caches and other militant positions.\n* On 5 June, the Turkish General Staff announced that it has shifted the direction of operations against PKK militants from urban centers to rural areas in the country's southeastern and eastern parts.\n* On 6 June, Turkish Air Force jets launched another round of airstrikes into northern Iraq for the 2nd day in a row again hitting PKK positions and elements.\n* On 7 June, a TAK car bomb killed 12 people including 6 police officers in Istanbul as a vehicle laden with explosives detonated as a convoy of police buses were passing through a busy street during morning rush hour. Turkish Prime Minister Binali Yıldırım named the PKK as being responsible for the terrorist attack. However, the Kurdistan Freedom Hawks organisation took responsibility.\n* On 8 June, another car bomb killed 5 people including 2 female police officers in the south-eastern town of Midyat. One of the police officers killed was 6 months pregnant and former Turkish president Abdullah Gül's body guard.\n* On 11 June, the Turkish Air Force launched widespread air strikes in northern Iraq and in Turkey's Lice, Hakkari and Siirt regions killing 13 PKK militants. The strikes came after PKK movement was spotted by UAV's.\n* On 11 June, 3 PKK militants were killed in İpekyolu during ongoing military operations.\n* On 11 June, 2 Turkish army soldiers were killed while four others wounded in a PKK attack on the Tekeli military base in the Şemdinli district of southeastern province of Hakkari.\n* On 14 June, a first media source said that the new Turkish government under Prime Minister Binali Yıldırım had immediately after assuming office on 24 May come to an agreement with the PKK, entailing \"that PKK guerrillas must retreat from the Kurdish cities in southeastern Turkey, and the Turkish government, in return, will allow the Syrian Democratic Forces to control the areas in the west of Euphrates river in northern Syria\" and that \"Ankara has also agreed to move the jailed PKK leader Abdullah Öcalan, from İmralı Island Prison in the Marmara Sea to another location and place him under house arrest, and resume negotiations with PKK as part of the agreement.\" The SDF's Manbij offensive in northern Syria for the Federation of Northern Syria – Rojava has been going since 1 June.\n* On 15 June, a \"village guard\" was killed and another was wounded in a PKK attack in the eastern province of Muş.\n* On 15 June, Selahattin Demirtas and Figen Yüksekdağ, co-chairs of the HDP, released a statement stating that \"while armed clashes have stopped in all these [urban] districts, curfews are still in effect for full days in some districts, while at night in some others\" and that \"Erdoğan-AKP rule is directly responsible for all this destruction and suffering. The crimes against humanity committed by them are piling up with every passing day.\" They demanded that \"the ongoing round-the-clock curfews, blockades and destruction in Kurdish cities and towns should be immediately stopped. All the obstacles that prevent residents from safely returning to their homes should be removed.\"\n* On 16 June, HDP co-chairman Selahattin Demirtas called on the Kurdistan Freedom Hawks to dissolve.\n* On 21 June, Prime Minister and AKP chairman Binali Yıldırım declared the end of military operations in Turkey's southeast and said the government would now focus on reconstruction of cities damaged by clashes between the security forces and the PKK. However, he threatened to now take action against HDP councillors in municipalities in the southeast.\n* On 22 June, 1 Turkish army soldier was killed and 2 were wounded in a PKK attack in the province of Şırnak.\n* On 22 June, President Recep Tayyip Erdoğan said that in his handling of the conflict he considered himself successful in having \"civil society groups working against Turkish state largely destroyed\", a conclusion that had been confirmed some days earlier by Sedat Laciner, Professor of International Relations and rector of the Çanakkale Onsekiz Mart University: \"Outlawing unarmed and peaceful opposition, sentencing people to unfair punishment under erroneous terror accusations, will feed genuine terrorism in Erdoğan's Turkey. Guns and violence will become the sole alternative for legally expressing free thought.\"\n* On 24 June, 6 Turkish army soldiers were killed in two separate PKK attacks in the Çukurca district of the southeastern province of Hakkari and the Derik district of the southeastern province of Mardin.\n* On 25 June, Turkish warplanes conducted airstrikes against PKK targets in the southeastern province of Hakkari, with no casualties reported.\n* On 26 June, Figen Yüksekdağ, co-chair of the HDP, said that \"an ethnic cleansing war is being conducted against the Kurdish people. Lots of deaths and exiles have taken place; 600,000 Kurds have been forced to migrate from the lands they had been living in. But Kurds haven't abandoned their lands. Heavy weapons have been used during these sieges of provinces. For example, in Nusaybin [in southern Mardin province], F-16s have been used.\"\n* On 26 June, 2 Turkish army soldiers were killed in a PKK attack in the Lice district of the southeastern province of Diyarbakır.\n* On 27 June, 1 Turkish army soldier was killed and another two were wounded in a PKK attack in the eastern province of Bitlis.\n* On 29 June, 2 Turkish army soldiers were killed in two separate PKK attacks in the Lice and Bismil districts of the southeastern province of Diyarbakır.\n* On 29 June, 2 Turkish army soldiers were killed and three were wounded when a hand-made explosive laid on the ground was detonated by PKK militants in the Derik district of the southeastern province of Mardin.\nJuly\n* On 8 July, Turkish Air Force jets launched a round of airstrikes into Qandil mountains and Şemdinli, stating that 12 PKK militants were killed.\n* On 8 July, the PKK launched nine to ten simultaneous attacks in the Semdinli district and the city of Yuksekova in southeastern Turkey. The Turkish army outpost at Artuklu was leveled and 4 soldiers were killed.\n* On 9 July, 2 PKK militants were killed in Ağrı.\n* From 9 July to 12 July, sources in the Turkish government stated that a senior PKK figure under the name of Fehman Huseyin alias Bahoz Erdal would have been assassinated in Syria. The story was initially taken up by several international media, it was however debunked when Erdal gave a radio interview on 13 July and later thoroughly deconstructed as fake.\n* On 10 July, one PKK militant was killed in Van Province.\n* On 11 July, 4 Turkish army soldiers were killed in a PKK attack in the Şemdinli district. 4 PKK militants were killed and 2 were captured in Mardin, Kızıltepe.\n* On 20 July, Turkish Air Force jets launched a round of airstrikes into Northern-Iraq and killed 20 PKK militants. One Village guard was killed while another 2 were wounded during a PKK attack in Şirvan district of the southeastern province of Siirt.\n* On 30 July, 35 PKK militants were killed in Hakkari after military operations were launched against PKK elements in the region.\n* On 31 July, 3 Turkish soldiers were killed in Ordu by a PKK attack whom were conducting military operations.\nAugust\n* On 1 August, 5 police officers were killed in Bingöl after their convoy was ambushed by a remote detonated bomb.\n* On 11 August, Turkish Air Force fighters struck several positions in northern Iraq killing an unspecified amount of PKK militants following PKK attacks in Hakkari which killed 4 soldiers.\n* On 15 August, a PKK car bomb attack on a police station near Bismil killed 6 people including 4 police officers and a child.\n* On 17 August, a car bomb was detonated near the building by a PKK member at 23:15 in front of the Iki Nisan Police Station on Sıhke Street in the central İpekyolu District of Van.. A total of 4 people, 2 of whom were police officers, lost their lives in the attack, and 72 people, 20 of whom were police officers, were injured. The surrounding buildings were also damaged in the attack.\n* On 18 August, an alleged PKK car bomb attack on a police station in Elazığ killed 7 police officers and wounded 224 people.\n* On 18 August, Turkish president Recep Tayyip Erdoğan announced that his country does not differentiate between the Gulen Movement, PKK or ISIS designating them all as Terrorist organizations.\n* On 21 August, a PKK militant whom was on Turkey's most wanted list was killed by a police raid in Ordu. The militant was responsible for an attack that killed 3 soldiers in Turkey's south-east.\n* On 24 August, 5 Turkish soldiers were killed in PKK rocket attacks on a military outpost in Lice.\n* On 25 August, an unsuccessful assassination attempt was carried out by the PKK against the Republican party leader Kemal Kılıçdaroğlu as his convoy passed through Artvin Province sparking a shoot-out between his private security detail accompanied by local police against PKK militants.\n* On 25 August, during Operation Euphrates Shield while Turkish forces and pro-Turkish local militia factions liberated various towns and villages from ISIS control along the Turkish border, Kurdish YPG forces, whom Turkey states is a Syrian extension of the PKK, opened fire on Turkish troops and killed a Turkish soldier. Turkish fighter jets and artillery immediately after the incident reportedly struck YPG positions killing 25 YPG militants.\n* On 26 August, a PKK truck bomb attack on a security checkpoint near a police station killed 11 police officers in Cizre and damaged the police station.\n* On 28 August, a roadside bomb planted by PKK militants in Siirt injured 5 Turkish soldiers.\n* On 28 August, a botched PKK attack resulted in heavy clashes with Turkish troops in Hakkari killing 9 PKK militants and injuring 2 Turkish soldiers.\n* On 29 August, four Turkish Air Force F-16s carried out airstrikes on various PKK targets in northern Iraq.\nSeptember\n* On 1 September, 2 soldiers in Siirt and a village guard in Van were killed in PKK attacks while Turkish airstrikes killed 3 PKK militants in Cukurca.\n* On 2 September, Turkish riot police used tear gas and water cannon to disperse a group of protesters along the Syrian border, who demonstrated against Turkey building a wall on the Syrian border near the Kurdish-controlled Syrian town of Kobani. The UK-based Syrian Observatory for Human Rights states that one child had been killed and more than 30 people injured.\n* On 2 September, Turkish soldiers killed 27 PKK militants and captured a further 30 militants during ongoing military operations in Çukurca.\n* On 2 September, Prime Minister Binali Yildirim announced that peace talks with the PKK would not restart and that military operations would continue\n* On 4 September, multiple PKK attacks and relentless military operations in conjunction in Çukurca over the past weekend killed or wounded over a 104 PKK militants and 18 soldiers.\n* On 5 September, 30 PKK militants were killed in an airstrike in northern Iraq bringing the total number of PKK militants killed, wounded or captured over the past weekend to 157.\n* On 9 September, the Turkish Air Force hit 3 different PKK positions in airstrikes launched into northern Iraq.\n* On 9 September, 14 PKK militants were killed in Semdinli during military operations in the region.\n* On 10 September, 33 PKK militants were killed in airstrikes in northern Iraq after the Turkish Air Force launched another round of bombings into the region striking 9 locations.\n* On 10 September, the Turkish government granted the jailed leader of the PKK, Abdullah Öcalan a family visit to his Island prison in İmralı.\n* On 10 September, Turkey announced it was swapping 28 administrations of local government municipalities in the countries south-east on having suspected links to the PKK.\n* On 12 September, a PKK car bomb in-front of the government municipality headquarters building in Van injured over 50 people.\n* On 13 September, Dutch police announced that they would register the names of Turks and Kurds in the Netherlands who sympathize with the PKK into the national police database.\n* On 14 September, Turkish air strikes in Hakkari killed 16 PKK militants.\n* On 14 September, new evidence solidifying suspicions against 28 PKK linked mayors in various provinces in Turkey's southeast arose. According to the evidence, certain local counties and municipalities were providing local-government transportation and construction vehicles to PKK elements in order to transport ammunition, militants and other supplies while constructing barricades and barriers to be used against military and police targets.\n* On 15 September, 7 local village guards, 2 soldiers and a civilian was killed after a security checkpoint was attacked by PKK rockets and sniper-fire in Ağrı. One of the village guards was retired having rushed to the seen after hearing about the then-ongoing attack.\n* On 15 September, a civilian was killed in Nusaybin after a hidden explosive trap set by the PKK had detonated.\n* On 16 September, Mehmet Ferden Çarıkçı, Turkey's permanent representative to the U.N.'s Geneva office, harshly criticized the U.N.'s report on Thursday which does not refer to the PKK as a terrorist organization, although the group is recognized as a terrorist organization by many countries including the U.S., the EU, and Turkey.\n* On 16 September 11 PKK militants were killed in ongoing military operations in Hakkâri Province while a village guard in Van was killed after attempting to prevent militants from cutting off a road.\n* On 16 September, Turkeys third largest political parties, the Kurdish HDP's  Deputy co-chair along with 12 other members were arrested for reportedly of recruiting Kurdish youth to join the ranks of the PKK and having direct reported links with the militant organization.\n* On 18 September, the Turkish military killed 3 PKK militants during ongoing counter-insurgency operations in Sirnak.\n* On 19 September, the Turkish Air Force struck several targets in northern Iraq's Kirkuk Governorate destroying weapons positions and killing at-least 2 militants.\n* On 22 September, a Turkish shepherd was approached and killed by PKK militants in Sirnak.\n* On 26 September, 2 Turkish soldiers and 2 village guards were killed by an IED bomb in Mardin\n* On 26 September 6 Turkish soldiers were killed and 2 others were wounded in Uludere by a large-scale PKK rocket attack against troops patrolling a highway.\n* On 26 September, 12 PKK militants were killed Yüksekova after the Turkish military intensified combat operations in-spite of recent PKK attacks.\n* On 29 September, a Turkish military drone strike killed 4 PKK militants in Hakkari while Turkish Air Force jets struck several PKK shelters and weapons storages in northern Iraq during a day of widespread military aerial operations in the region.\n* On 29 September, PKK militants in the border province of Hakkari opened fire upon volunteer defense militia and killed 3 village guards.\n* On 30 September, 6 PKK militants were killed in Ordu during military operations.\nOctober\n* On 3 October, Turkish Army troops killed a total of 20 PKK militants during heavy clashes amidst ongoing counter-insurgency operations in Sirnak.\n* On 3 October, an IED attack on a Turkish army convoy killed 2 Turkish soldiers in Hakkari.\n* On 5 October, 3 PKK militants were killed in heavy clashes with Turkish forces in Cukurca.\n* On 6 October, 8 PKK militants were killed in a combination of air and land operations by Turkish forces ongoing in the Hakkari and Agri regions.\n* On 7 October, the bodies of 5 previously killed PKK militants were recovered from a cave in Cukurca along with weapon magazines, explosives and AK-type rifles used by the militants.\n* On 8 October, Turkish forces recovered the body of an individual who had been abducted by PKK militants in a ditch on the side of a road in Sur.\n* On 8 October, PKK militants executed a female militant attempting to flee the group.\n* On 9 October, a PKK truck bomb attack on a Turkish Gendarmerie outpost in Hakkari killed 18 people including 10 Turkish soldiers and eight civilians.\n* On 9 October, the Turkish Army killed 8 PKK militants during a raid on a PKK weapons and munitions depot in Cukurca.\n* On 10 October, Turkish police foiled a suicide bombing plot in the nation's capital, Ankara; the standoff ended with the militants detonating explosives during a police raid which only resulted in the death of the PKK militants\n* On 11 October, a Turkish army T-129 attack helicopter neutralized a vehicle rigged with explosives used by PKK as a car-bomb before it could ram into and detonate at nearby troops in Lice\n* On 11 October, during ongoing military operations across Turkey's south-east 20 tons of Ammonium nitrate intended for explosives use was captured in Sur, hundreds of AK magazines were captured in Batman along with explosives, and over a thousand of varying rifle magazines and rocket munitions were captured in Cukurca.\n* On 12 October, 9 PKK militants were killed in Cukurca by a Turkish military drone strike.\n* On 13 October, 5 PKK militants were killed in northern Iraq by Turkish Army artillery strikes.\n* On 13 October, Turkish Air Force F-16's struck PKK shelters in northern Iraq.\n* On 15 October, multiple shelters and caves used by the PKK were destroyed during Turkish military operations in Sirnak, Cukurca and Bitlis.\n* On 17 October, 10 PKK militants were killed in Tunceli by a Turkish military airstrike during ongoing counter insurgency operations in the region.\n* On 18 October, 4 PKK militants were killed by Turkish army operations in Cukurca.\n* On 19 October, Turkish fighter jets struck PKK shelters in Hakkari on the mountainous Turkish-Iraq border.\n* On 20 October, between 9:11&nbsp;p.m. and 11:59&nbsp;p.m. the Turkish Air Force conducted a massive aerial operation against PKK-linked Kurdish YPG targets in Syria's Aleppo province. The SOHR reported 14 militants have died due to the airstrikes. Turkey has previously militarily threatened the YPG and said it that Turkey wouldn't permit a terror corridor to be established at its southern border.\n* On 20 October, 26 PKK militants and 2 Turkish soldiers were killed in Hakkari during Turkish army counter-insurgency operations.\n* On 21 October, 12 PKK militants in Hakkari were killed by Turkish troops during ongoing military operations to root out the separatist militant organization.\n* On 21 October, 6 PKK militants in northern Iraq were killed by Turkish air-strikes.\n* On 21 October, about 100 rockets were fired by the Turkish army into regions of Syria held by the YPG striking several targets.\n* On 23 October, 7 PKK militants were killed by the Turkish armed forces in Tunceli during counter-insurgency operations.\n* On 24 October, Turkish Foreign Minister Mevlüt Çavuşoğlu in a meeting with his French counterpart Jean-Marc Ayrault assured the public with a statement that Turkey would begin to more actively fight the PKK in Iraq in addition the insurgency in the nations south-east.\n* On 24 October, 7 PKK militants were killed in Turkish army operations in Cukurca.\n* On 25 October, the co mayors of Diyarbakır, Gültan Kışanak and Firhat Anlı, were arrested.\nNovember\n* On 2 November, 6 PKK militants surrendered to Turkish forces in Silopi.\n* On 3 November, Turkish military operations killed 5 PKK militants, two in Bitlis, two in northern Iraq and one in Lice.\n* On 4 November, at least nine people were killed and more than 100 injured in a car bomb attack outside the police headquarters in central Diyarbakır. The governor of Diyarbakır Province, Cahit Kıraç, said the Kurdistan Workers' Party had claimed responsibility. The bombing took place just hours after the arrests of pro-Kurdish HDP leaders, Selahattin Demirtaş and Figen Yüksekdağ whom are said by the Turkish government to have ties to the outlawed PKK organization.\n* On 4 November, 14 PKK militants were killed in widespread Turkish military operations, seven in Sirnak, three in Hakkari, three in northern Iraq, and one in Lice while a separate militant surrendered in Nusaybin.\n* On 5 November, 17 PKK militants in ongoing Turkish military operations were killed, 14 in Sirnak and 3 in Hakkari.\n* On 20 November, 12 PKK militants were killed in by a Turkish military drone strike in Daglica.\n* On 29 November, Security forces killed at least 10 PKK insurgents in Şırnak.\nDecember\n* On 2 December, a military operation left 3 soldiers dead and another 3 were wounded in Hakkâri Province, Turkey. 20 PKK militants were killed or captured as well during the operation.\n* On 10 December, a twin TAK-linked suicide bombing attack in Istanbul against riot police maintaining security for a Besiktas soccer game killed 36 police officers and 8 civilians. Following the attack hundreds of suspects were arrested including dozens of pro-Kurdish HDP party members.\n* A Turkish fighter jet crashed near an airport in the Kurdish city of Diyarbakır on 12 Dec., the military said, but the pilot was able to safely eject from the plane. According to a government spokesman the plane had fallen due to a possible technical malfunction. Also PKK militants took responsibility for the downed Turkish jet.\n* On 17 December a PKK-linked group carried out another attack in Kayseri using a car bomb to ram a public bus full of off-duty paratrooper commandos killed 14 troops.\n2017 timeline\nJanuary\n* On 5 January, a shootout in İzmir kills two gunmen. During the shootout a car bomb explodes, killing a police officer and court employee. Veysi Kaynak states that the discovery of more weapons on the scene suggests that a larger attack was foiled. Provincial governor Erol Ayyıldız blames the attack on the PKK.\n* On 13 and 14 January, at least 57 PKK fighters were killed and scores of others injured in Turkish airstrikes in northern Iraq, the Turkish General Staff said in a statement. Although, it could not be independently verified.\n* Crisis group puts overall casualties at 30 people killed, including 16 PKK militants, 11 security personnel and 3 civilians for the month of January.\nFebruary\n* Overall, 31 people died, including 27 PKK militants and 4 civilians.\nMarch\n* On 9 March, 19 PKK militants and one Turkish soldier were killed in military operations in southeastern Diyarbakir and eastern Bingol provinces that was launched by Turkey on 5 March.\nOverall, 92 people died, including 82 PKK militants 8 security forces personnel and 2 civilians.\nApril\n* On 24 April, 90 YPG, Jezidi-YBŞ and Peshmerga fighters were killed in an air raid conducted by the Turkish Air Force against targets in Syria, and Iraq. Turkish authorities state YPG militants are directly affiliated with the PKK.\n* On 29 April, 45 PKK militants were killed in airstrikes by the Turkish Air Force against militant targets in Iraq.\n* Overall, 108 people died, including 84 PKK militants 23 security forces personnel and one civilian.\nMay\n* Overall, 64 people died, including 41 PKK militants 21 security forces personnel and two civilians.\nJune\n* Overall, 90 people died, including 61 PKK militants 28 security forces personnel and one civilian.\nJuly\n* Overall, 96 people died, including 74 PKK militants 12 security forces personnel and 10 civilians.\nAugust\n* Overall, 67 people died, including 44 PKK militants 14  security forces personnel and 9 civilians.\nSeptember\n* Overall, 102 people died, including 79 PKK militants 12 security forces personnel and 11 civilians.\nOctober\n* Overall, 48 people died, including 25 PKK militants 17 security forces personnel and 6 civilians.\nNovember\n* Overall, 77 people died, including 61 PKK militants 14 security forces personnel and 2 civilians.\nDecember\n* Overall, 26 people died, including 22 PKK militants 4 security forces personnel.\n2018 timeline\nJanuary\n, 31 March 2018]]\n* On 20 January 2018, the Turkish military began an attack in the Afrin region of Syria, code-named by Turkey as Operation Olive Branch (). The offensive is against the Kurdish-led Democratic Union Party  (PYD) in Syria, its armed wing People's Protection Units (YPG), and Syrian Democratic Forces (SDF) positions surrounding the Syrian city of Afrin. Turkey also says it is fighting ISIL, though ISIL does not exist in Afrin. Afrin and the surrounding area is claimed by the Democratic Federation of Northern Syria as the Afrin Region. It is the first major military operation by Turkey in Syria since Operation Euphrates Shield.\nFebruary\n* Overall, 17 people were killed, including 10 PKK militants and 7 security personnel.\nMarch\n* Overall, 81 people were killed, including 61 PKK militants, 18 security personnel and two civilians.\nApril\n* Overall, 63 people were killed, including 46 PKK militants, 16 security personnel and one civilian.\nMay\n* Overall, 40 people were killed, including 27 PKK militants, 11 security personnel and two civilians.\nJune\n* Overall, 95 people were killed, including 71 PKK militants, 23 security personnel and one civilian.\nJuly\n* Overall, 93 people were killed, including 82 PKK militants, 7 security personnel and four civilians.\nAugust\n* 15 August, a Turkish airstrike killed Zeki Shengali, as they bombed mourners returning from en event remembering Yazidi victims of the Islamic State of Iraq and the Levant (ISIL).\nOverall, 72 people were killed, including 58 PKK militants, 12 security personnel and two civilians.\nSeptember\n* Overall, 56 people were killed, including 50 PKK militants, 4 security personnel and two civilians.\n-controlled territory (green) and Turkish-occupied territory (red) in December 2018]]\nOctober\nOverall, 30 people were killed, including 15 PKK militants, 13 security personnel and two civilians.\nNovember\n* On 1 November, US officials confirmed that US and Turkish military forces had conducted two joint patrols on the outskirts of Manbij, Syria, which is held by the Manbij Military Council (MMC). MMC reported that YPG-aligned militants left the city.\n* Overall, 45 people were killed, including 34 PKK militants, 10 security personnel and one civilians.\nDecember\n* Turkey has amassed troops and tanks on the outskirts of Manbij, announcing an intention to drive out the PKK from that city. On 24 December, US President Donald Trump announced that he would order the withdrawal of the approximately 2,000 US service members on the ground in Syria in support of the YPG campaign against ISIS.  On 28 December, YPG tweeted an invitation to Syrian Arab Army (SAA) to enter SDF-held territory around Manbij, for the purpose of countering an anticipated invasion by Turkish-backed forces, in the absence of US support.  The SAA has moved into the SDF front lines facing Turkish-held areas to the east of Manbij.  US, French and British forces are still present in the front lines to the north of the city.\n2019 timeline\nJanuary\n* On 4 January 2019, one Turkish soldier was killed, and one PKK militant was 'neutralized' (killed/captured), and two others were injured in an attack which took place near Emince village of Aralik district, located in Igdir province bordering Iran, according to Hurriyet Daily News and Anadolu Agency.\n* On 23 January 2019, the PKK reportedly kidnapped four people, who crossed the Sarzeri border crossing in Duhok province. Because of this, Turkey decided to close the border gate. 13 days later, the border gate was reopened.\n* On 24 January 2019, the Turkish Armed Forces conducted airstrikes against the PKK in the region of Sheladiz village, Dohuk province. According to Kurdistan24, four civilians were killed in the strikes, whereas Mevlut Cavusoglu, the Turkish Foreign Minister said that the strikes were 'successful', and PKK got disturbed. Locals protested against both the Turkish military and the PKK, demanding to move their fight elsewhere, and attacked a Turkish military base, which resulted in the death of two (according to New Generation Movement, one protester(s), and in the injury of several more, as well as partial damage to some equipment and vehicles in the base. Cavusoglu said, \"They [the PKK] are disturbed by these. They started provoking local people. We know that there is PKK behind this\". He stated he had a telephone conversation with Nechirvan Barzani Nechirvan Barzani late Saturday.\n* The KRG (Kurdistan Regional Government) expressed concerns over the protests. They stated there is 'a disruptive hand' behind the events.\n* The Iraqi Foreign Ministry condemned the Turkish forces 'opening fire' on the protesters, and summoned Turkey's ambassador to Baghdad. However, the Foreign Ministry also condemned \"the use of its territory to threaten the security and safety of any neighboring country.\"\n* The Turkish Defense Minister, Hulusi Akar said: 'Since they [PKK terrorists] realized that they cannot fight against Turkish soldiers, they try to provoke the innocent locals'. He also stated 'Our effective operations will continue without interruption. All these provocations will be defeated and we will clear the area off terrorists'.\n* An NRT News team was arrested by KRG authorities, when they were filming in front of the Dohuk Emergency Hospital to report on the condition of the injured protesters, and several other NRT staff was arrested as well. They were all released later.\nMarch\n* On 16 March 2019, two Turkish soldiers were killed and eight more were wounded after an assault. Turkey stated that six PKK fighters were neutralized during the incident. On 20 March 2019, one Turkish soldier was killed in the southeastern part of Sirnak province by an IED while carrying out a search operation. Another soldier was wounded because of the explosion.\nApril\n* On 19 April 2019, four Turkish soldiers were killed, and six were wounded near Iraqi Kurdistan's border. The Turkish Defense Ministry said they were working 'to determine' whether there were Kurdish casualties.\n* On the same day, and on 20 April 2019, Turkish police used violence against Kurdish mothers protesting in solidarity with political prisoners in Kocaeli and in Turkey's Mardin province. Lawmakers in the Grand National Assembly of Turkey, Sezgin Tanrıkulu and Gursel Tekin expressed their concerns about the event in Kocaeli.\n* On 26 April 2019, five PKK militants were neutralized in Diyarbakir's Lice region.\n* On 29 April 2019, Turkish jets bombarded the Kurdistan Region's Chamanke district in Duhok province. No human casualties were reported.\n* On 30 April 2019, five PKK militants were neutralized in Siirt.\nMay\n* On 1 May 2019, five PKK militants were killed in the Amanos mountains in Hatay province.\n* On 4 May 2019, three Turkish soldiers were killed after a PKK mortar attack in the Sherwan Mazin region in Erbil Province. After the attack, gunfire was heard in the area, and Turkish gunships began to target suspected elements of PKK. The heaviest clashes occurred around Chama village. Turkish Defense Minister Hulusi Akar said 23 PKK militants were killed in the pursuit.\n* On 20 May 2019, it was reported that the Turkish forces have been locked in days of clashes in the Sidekan area of Erbil Governorate. Neither side has disclosed casualty figures yet.\n* On 27 May 2019, Turkish Armed Forces launched a counter-terrorism operation, Operation Claw (2019–2020) in northern Iraq to destroy caves and shelters used by PKK militants.\n* Overall, 69 people died in the month of May; 49 PKK militants, 17 security forces and 3 civilians.\nJune\n* Overall, 91 people died, including 70 PKK militants, 15 security forces and 6 civilians.\nJuly\n* Overall, 97 people died, including 80 PKK militants, 13 security forces and 4 civilians.\nAugust\n* Overall, 53 people died, including 38 PKK militants, 13 security forces and 2 civilians.\n* On 19 August, the mayors of the cities Mardin, Ahmet Türk, Diyarbakir, Adnan Selçuk Mizrakli, and Van, Bedia Özgökçe Ertan, all three from the HDP, where dismissed by the Turkish Government. The same day also hundreds of HDP politicians and members were detained.\nSeptember\n* Overall, 70 people died, including 51 PKK militants, 9 security forces and 10 civilians.\nOctober\n* On 9 October, the Operation Peace Spring began. Overall, 33 people died, including 28 PKK militants and 5 security forces.\nNovember\n* 21 PKK militants were killed in November.\nDecember\n* Overall, 8 people died, including 3 PKK militants, 4 security forces and 1 civilian.\n2020 timeline\nJanuary\nOverall, 7 people died, including 2 PKK militants and 5 security forces.\nFebruary\nOverall, 5 people died, including 4 PKK militants and 1 civilian.\nMarch\nOverall, 9 people died, including 5 PKK militants, 2 security forces and 2 civilians.\nApril\nOverall, 19 people died, including 11 PKK militants, 2 security forces and 6 civilians.\nMay\nOverall, 39 people died, including 29 PKK militants, 5 security forces and 5 civilians.\nJune\nOverall, 54 people died, including 46 PKK militants, 4 security forces and 4 civilians.\nJuly\nOverall, 41 people died, including 33 PKK militants, 6 security forces and 2 civilians.\nAugust\nOverall, 53 people died, including 44 PKK militants, 7 security forces and 2 civilians.\nSeptember\nOverall, 39 people died, including 31 PKK militants, 7 security forces and 1 civilian.\nOctober\nOn 26 October, two PKK militants ambushed the police in İskenderun and one of them detonated the bombs on him, injuring 1 police officer and 2 civilians.\nOverall, 12 people died, including 7 PKK militants, 2 security forces and 3 civilians.\nNovember\nOverall, 9 people died, including 3 PKK militants, 1 security force and 5 civilians.\n2021 timeline\nJanuary\n* Throughout January 2021, Turkey began threatening Iraq and the Kurdistan Regional Government about an attack towards Iraqi and Kurdish forces in Sinjar.\n* On 11 January 2021, the Ministry of Interior announced that the Eren Operations started. Operations were named in honor and memory of 15-year-old boy Eren Bülbül, who was killed by PKK members on 11 August 2017. The first of the operations called \"Eren-1 Tendürek Operation\", 1,071 personnel and 72 operational teams consisting of Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part to eliminate the insurgents in the Mount Tendürek area.\n* On 20 January 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in Lice. Eren-2 Lice Operation, in which 2,024 personnel and 116 operational teams took part, was initiated.\n* On 23 January 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in Mount Agri. Eren-3 Mount Agri Operation, Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part to eliminate the insurgents the Mount Agri area.\n* On 25 January 2021, the Ministry of Interior announced announces two simultaneous operations while the previous commenced operations continue. Eren-4 Karlıova-VartoEren-5 Bagok operations started simultaneously. Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part with 1.620 personnel total 93 operational teams for Karlıova - Varto area and  2550 personnel total 145 operational teams for Mount Bagok area to clear from insurgents.\nFebruary\n* On 2 February 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in Bitlis and Siirt area. Eren-6 Mergelo, in which 1,453 personnel and 82 operational teams took part, was initiated.\n* On 5 February 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in Tunceli area. Eren-7 Mercan Munzur, in which 1,062 personnel and 59 operational teams took part, was initiated.\n* On 8 February 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in the provinces of Hatay, Osmaniye, Gaziantep. Eren-8 Amanoslar, 1,670 personnel and 96 operational teams consisting of Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part to eliminate the insurgents in the Mount Amanos area.\n* On 10 February 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in the province of Hakkâri Province. Eren-9 Kazan Han Yaylasi, 2,218 personnel and 129 operational teams consisting of Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part to eliminate the insurgents in the Mount Amanos area.\n* On 12 February 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in the Şırnak-Siirt Provinces Eren-10 Gabar,  1,073 personnel and 68 operational teams consisting of Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part to eliminate the insurgents in the Mount Gabar area.\n* On 14 February 2021, Turkish Minister of Defense Hulusi Akar stated that 13 soldiers and police officers, who had been held hostage by the PKK since 2015 and 2016, were executed during an attempted rescue operation in northern Iraq. Erdoğan blamed the United States and Kurdish politicians for the failed operation, while opposition leader Kılıçdaroğlu accused Erdoğan of being responsible for the deaths. The Turkish Human Rights Association, who previously facilitated the return of hostages from the PKK, stated their offers to help negotiate were rejected by state officials.\n* The PKK originally claimed the hostages were killed by Turkish airstrikes. While the United States originally appeared ambiguous about who it believed bore responsibility for the deaths, Secretary of State Antony Blinken later stated that Washington view the PKK responsible. The father of one deceased hostage Semih Özbey was summoned to identify his son, and according to the Turkish Human Rights Association president, stated he saw a bullet wound in his son's head. In an interview with Sözcü, the father noted he believed the hostages were executed, but was only shown a picture of his son's face and was refused seeing his body. He added that during his sons imprisonment he spoke repeatedly to both HDP MPs and Erdoğan to no avail. The PKK later revised their claim to say that Turkey used poison gas which resulted in the captives deaths, who were then \"executed so that the blame could be put on us\".\n* On 24 February 2021, the Ministry of Interior announced that the continuation of Eren Operations is carried out in the Bitlis Siirt Provinces Eren-11 Sehi Frrest, 781 personnel and 51 operational teams consisting of Gendarmerie Commando, Gendarmerie Special Operations (JÖH), Police Special Operations (PÖH) and security village guard teams took part to eliminate the insurgents in the forest Sehi area.\nMarch\n* On 30 March 2021 The Ministry of Internal Affairs announced that the 'Eren-12 Güleşli' operation, in which 317 personnel consisting of Gendarmerie Special Operations, Police Special Operations and Village Security Guard teams took part, started in order to neutralize the insurgents staying in the Şırnak and Siirt area.\nApril\n* On 23 April 2021, Turkey launched a ground, air operation in northern Iraq. Targets located in Qandil, Zap, Gara and Avaşin-Basyan were destroyed by the Turkish Air Force and artillery tasked by the Turkish Army.\nMay\n* On 3 May 2021, Turkish Ministry of Defence announced the neutralization of 7 PKK militants. This has made the total loss of PKK throughout the Operation Claw-Lightning and Claw-Thunderbolt 53. According to the Turkish officials sixteen weapons and 3,000 ammunition have also been confiscated from the PKK militants and depots.\n* On 12 May 2021, Turkish Ministry of Defence announced the neutralization of 5 PKK militants during an air strike.\nSeptember\nOn September 11, a Turkish soldier was killed and another was injured during a PKK attack on a Turkish military vehicle in the 'Operation Pence-Simsek' zone.\n2022 timeline\nApril\n* On 17 April, Turkey Launches military Operation Claw-Lock against Kurdistan Workers' Party in Northern Iraq.\nMay\n* On 12 May, in response to the 2022 Russian invasion of Ukraine, Finnish president Sauli Niinistö and prime minister Sanna Marin announced in a joint press conference that they were in favour of seeking NATO membership \"without delay\".\n* On 16 May, Finnish Prime Minister Sanna Marin underlined that they are always ready for dialogue with Turkey regarding NATO membership and that the problem will be resolved as soon as possible.\n* On 17 May, Sweden's foreign minister Ann Linde signed Sweden's application to join NATO, following Finland's earlier intention to join NATO. On 18 May 2022, both countries formally applied to join NATO. Turkish president Recep Tayyip Erdoğan voiced his opposition to Finland and Sweden joining NATO, saying that it would be \"impossible\" for Turkey to support their application while the two countries allow groups which Turkey classifies as terrorist organizations, including the Kurdish militant groups Kurdistan Workers' Party (PKK), Democratic Union Party (Syria) (PYD) and People's Defense Units (YPG) and the supporters of Fethullah Gülen, a US-based Muslim cleric accused by Turkey of orchestrating a failed 2016 Turkish coup d'état attempt, to operate on their territory.\n* On 21 May, Finnish President Sauli Niinistö and Swedish Prime Minister Magdalena Andersson made a statement after their telephone conversation with Turkish President Recep Tayyip Erdoğan, stating that Finland and Sweden are always ready to engage in dialogue with Turkey on NATO membership, that the issue should be resolved as soon as possible and that they have always condemned terrorism, and that Finland and Sweden take terrorism seriously.\nJune\n* On 12 June, NATO Secretary-General Jens Stoltenberg stated that the Turkish government has \"legitimate concerns\" over agreeing to admit Sweden and Finland into NATO. “These are legitimate concerns, this is about terrorism, it's about weapons exports,” said Stoltenberg alongside Finnish President Sauli Niinistö. “We have to remember and understand that no NATO ally has suffered more terrorist attacks than Turkey.”\n* On 28 June, the first day of the 2022 NATO summit in Madrid, the Turkish delegation dropped their opposition to Finland and Sweden's NATO membership applications and signed a tripartite memorandum addressing Turkey's concerns regarding arms exports and the Kurdish–Turkish conflict.\n* On 30 June, Turkish President Recep Tayyip Erdoğan said that Sweden had made a promise to extradite to Turkey what he characterised as \"73 terrorists\". Swedish Prime Minister Magdalena Andersson refused to deny Turkey's claim that Sweden had promised to deport Turkish political refugees and opponents wanted by Erdoğan's government.\n2023 timeline\nFebruary\n* On 1 February, attackers fired eight rockets at a Turkish military base in northern Iraq, with two of them landing inside.\nApril\n* On 7 April, Iraq demanded an apology from Turkey after an apparent drone strike near an airport in Sulaymaniyah. US military officials claimed the strike was aimed at a convoy carrying American personnel. No casualties were reported from the incident.\n* On 15 April, two PKK fighters were killed and two others were wounded when a Turkish drone struck their vehicle near the Iranian border.\nJuly\n* On 9 July, two Turkish soldiers were killed by PKK militants in northern Iraq.\n* On 10 July, Kurdish militants attacked Turkish-backed fighters south of Afrin, killing five of them.\n* On 29 July, two Turkish airstrikes killed eight Kurdish militants in Iraq and Syria.\nAugust\n* On 10 August, Turkey's defense ministry announced that six Turkish soldiers were killed by Kurdish militants in fighting that started the previous day. Turkey responded with airstrikes that killed four PKK members.\n* On 11 August, a Turkish drone strike in northern Iraq killed three PKK members, including a senior official.\n* On 24 August, Turkish drone attacks in northern Iraq killed seven people, including a PKK official.\nSeptember\n* On 15 September, two fighters of the Syrian Democratic Forces were killed in a Turkish drone strike and two others were wounded.\n* On 16 September, a drone fired from the Turkish border struck a military airport in Arbid, killing three members of Iraq's counter-terrorism service and wounding three others.\n* On 18 September, the Syrian Democratic Forces carried out an attack on a Turkish-backed opposition group in northern Syria, killing 13 militants.\nOctober\n* On 1 October, a PKK attacker blew himself up outside the Ministry of the Interior in Ankara, while a second attacker was killed by police. Two police officers were injured during the incident. In response Turkey carried out air strikes against 20 Kurdish rebel targets in northern Iraq.\n* On October 3, police raids took place in 64 provinces of Turkey. According to Minister of the Interior Ali Yerlikaya's reports, 928 people were detained, of which at least 90 are allegedly associated with the PKK.\n* On 5 October, at least 11 people were killed in Turkish airstrikes in Kurdish-controlled areas in northern Syria, including five civilians.\n* On 7 October, Turkish forces killed 58 Kurdish militants in overnight attacks.\n* On 25 October, ten PKK militants were killed by Turkish drone strikes in northern Iraq.\nNovember\n* On 4 November, Turkish airstrikes on Kurdish military infrastructure killed 15 militants.\n* On 17 November, Turkey's defense ministry announced that it carried out airstrikes against Kurdish militants in northern Iraq, killing 13 of them.\nDecember\n* 11 December\n** A mine planted by the PKK exploded on a road in Aleppo's Manbij District, killing two agricultural workers and injuring 19 civilians.\n** Unidentified gunmen killed Ahmet Gün, an executive of the Peoples’ Equality and Democracy Party, and injured his son in Şırnak.\n* On 22 December, a PKK infiltration attempt of 1st Hakkari Mountain Commando Brigade base left six dead and six wounded Turkish soldiers.\n* 23 December\n** 5 PKK militants were killed by Turkish commandos while preparing for an attack in Euphrates Shield region.\n** Six Turkish soldiers were killed in clashes with Kurdish militants.\n* 25 December\n** The Turkish defense ministry said it killed at least 26 Kurdish militants throughout Iraq and Syria during an escalation of airstrikes in retaliation for the deaths of 12 Turkish soldiers during the weekend.\n** At least eight civilians were killed by Turkish airstrikes in northeastern Syria.\n2024 timeline\nJanuary\n* 13 January\n** 9 Turkish soldiers were killed and 8 wounded after infiltration attempt to base in Zab by PKK militants.\nFebruary\n* On 25 February, a Turkish military drone strike killed 4 PKK militants in Gara, Northern Iraq.\n* On February 28, three members of the Christian Syriac police were killed and others were wounded by Turkish drone strikes near Malikiyah, Syria.\nMarch\n* On 16 March, 2 PKK militants were killed in northern Iraq.\n* 19 March:\n** A Turkish soldier was killed and four were wounded in a PKK attack in Iraq.\n** The Turkish Air Force reportedly destroyed 27 PKK targets in Metina, Zap, Hakurk, Gara and Qandil regions, Iraq.\n* On 25 March, Turkish airstrikes on Northern Iraq killed 2 PKK militants.\nApril\n* On 2 April, a PKK commander was killed in an alleged Turkish drone strike in northern Iraq.\n* On 24 April, Turkish airstrikes on Northern Iraq killed 6 PKK militants.\nMay\n* On 31 May, four SDF fighters were killed and 11 civilians were wounded by Turkish drone strikes around Qamishli, Syria.\nJune\n* On 2 June, the Turkish Defence Ministry said that 14 PKK and two PKK/YPG militants were killed in operations in Syria and Iraq.\n* On 3 June, Turkish authorities arrested the mayor of Hakkari over alleged PKK ties.\nJuly\n* On 18 July, a civilian was killed in a bombing by Turkish aircraft in the village of Khastuzhuri in the Shiladze.\nOctober\n* On 23 October, the Turkish air force destroyed 32 PKK targets in northern Syria and Iraq in response to a deadly attack on Turkish Aerospace Industries (TUSAŞ) earlier that day.\nNovember\n* On 30 November, the Operation Dawn of Freedom began.\n2025 timeline\nOn 17 February, a PKK militant was killed.\nOn 1 March, the PKK declared a ceasefire in its conflict against Turkey.\nOn 12 May 2025, the PKK has declared the disbandment the group and announced to lay down arms after a decades long conflict.\nImpact\nCivilian impact\nruins in March 2016]]\nAccording to Turkish Human Rights Foundation, there have been 52 intermittent curfews in seven predominantly Kurdish towns where 1.3 million people live, sometimes lasting as long as 14 days. The organization puts the civilian death toll since the summer of 2015 at 124.  The situation in the South-East has little coverage in the Turkish media. The authorities have enforced a blockade over the region and have shut down both cell phone coverage and the internet. Hundreds of houses, dozens of schools and official buildings have been damaged by artillery and gun fire from militants, and civilians have been reportedly fired at. Turkish Forces have used measures like tank fire to clear out bomb-trapped barricades which lead to damage of residential buildings. It is estimated that more than 200,000 people have been displaced. According to the HRW, civilian death toll is around 100. Diyarbakir branch of the Human Rights Association said Turkish Armed Forces and Gendarmerie was targeting civilians under the pretext of fighting terrorism. Many residents in the southeastern cities have been trapped without food or electricity as clashes between Kurdish militants and Turkish security forces have intensified. In December 2015, town of Cizre, was under curfew for more than two weeks, with mounting civilian casualties. According to a teacher from the district of Silopi, some residential buildings were damaged by tank shells.\nInternal reactions\nAcademics petition\nOn  11 January 2016, more than 1000 scholars and academics from 90 Turkish Universities and abroad signed a petition entitled \"We won't be a party to this crime,\" calling for an end to the government's crackdown on the Kurdish activists and politicians, and a resumption of the peace process.  They also criticized the use of tanks in urban centers calling it a deliberate massacre of Kurdish people. On 12 January,  Recep Tayyip Erdoğan sharply criticized the dissident academics which included David Harvey, Immanuel Wallerstein, Slavoj Žižek and Noam Chomsky and said they were from the fifth column of foreign powers. He also called on the Turkish judiciary to move against the \"treachery\". All 1,228 Turkish signatories were subsequently placed under investigation.  Erdoğan invited Chomsky to visit the area in a televised speech to a conference of Turkish ambassadors in Ankara. However Chomsky rejected the offer and said: \"If I decide to go to Turkey, it will not be on his invitation, but as frequently before at the invitation of the many courageous dissidents, including Kurds who have been under severe attack for many years.\" He also said Erdoğan was aiding ISIS and the al-Nusra Front. On 14 January, the Düzce University in northwest Turkey dismissed an associate sociology professor after she signed the declaration and on 15 January Erdoğan attacked the signatories again, said they were supporting the Kurdish militants and said \" having a PhD title doesn't necessarily make you an intellectual. These are people in the dark. They are cruel and despicable.\" That same day, Turkish authorities arrested 14 signatories, including 12 academics from Kocaeli University,  said they were spreading \"terrorism propaganda\" and of insulting the state. U.S. Ambassador John Bass released a statement expressing his concern regarding the arrests. He also said \"Expressions of concern about violence do not equal support for terrorism. Criticism of government does not equal treason.\"  On 16 January, main opposition leader Kemal Killicdaroglu sharply criticized Erdoğan over detention of dissident academics and called him a dictator.   Two days later, lawyers for Turkish President  filed a lawsuit against him and a prosecutor from the Ankara prosecutors' office also launched an investigation into his comments on charges of \"openly insulting the president\", a crime punishable by up to four years in jail.\nResignation of UNESCO Ambassador\nOn 25 May 2016, Turkish author and poet Zülfü Livaneli resigned as Turkey's only UNESCO goodwill ambassador. In his post on Twitter, he said \"UNESCO's silence on human rights violations and lack of fundamental freedoms.\" and he also refused to take part in the World Humanitarian Summit in Istanbul. He highlighted destruction of the historical Sur district of Diyarbakir as his main reason for resignation.\nProtests in New York\nOn 31 March 2016, during a public speech by Erdoğan at the Brookings Institution, his supporters and opponents clashed outside the venue.  His security guards assaulted Brooking's employees and ordered a well-known Turkish journalist, Amberin Zaman, to leave, calling her a \"P.K.K. whore\".  Security staff members had to stop the guards from removing other journalists from inside the auditorium. Some Turkish guards were restrained by police officers. National Press Club released a statement and expressed alarm at the events.\nU.S. State Department 2016 Human Rights Report\nAccording to the report, in February 2016, Turkish security forces killed at least 130 people, including unarmed civilians,  who had taken shelter in the basements of three buildings in the town of Cizre. A domestic NGO, The Human Rights Association (HRA), said the security forces killed more than 300 civilians in the first eight months of 2016. It also reported retrieval of 171 bodies from three basements in Cizre after 5 February. The Human Rights Foundation of Turkey (HRF), reported that during the 79 day curfew in Cizre, close to 200 people were killed.   On 3 March 2016, HRF's president, Șebnem Korur Fincanci, found a human jawbone in the remains of a basement in the Sur district of Diyarbakir, where according to HRA seven people were killed in February 2016.\nInternational reactions\n*  - On 14 April 2016, Nils Muižnieks, the council's human rights commissioner, said after visiting the city of Diyarbakir:\nagainst Turkey's military offensive on 10 October 2019]]\n*  - The EU has frequently called for an immediate ceasefire and urged all sides to renew the settlement process with the Kurdish minority in Turkey. On 7 March 2016, EU foreign policy chief Federica Mogherini said:\nThe European Parliament has been highly critical with respect to human rights abuses and denial of political dialogue with respect to the Kurdish issue under the cloak of fight against terrorism in Turkey. The institutions of the European Union have persistently criticized the broad application of anti-terror legislation as well as a criminal law against \"denigrating Turkishness\" in Turkey as stifling peaceful advocacy for Kurdish rights.\n*  - On 19 January 2016, German Ambassador to Turkey Martin Erdmann has voiced Berlin's unconditional support to Ankara's ongoing fight against the outlawed Kurdistan workers' Party (PKK), while underlining that \"a final and permanent solution\" to the Kurdish issue could only be found on political grounds. The Ambassador quoted:\nConflict in Turkey's south-east has often reflected on Germany's Turkish and Kurdish minorities causing mass riots and the build up of ethnic tensions within Germany.\nand Turkish minister of foreign affairs Mevlüt Çavuşoğlu, 11 October 2019]]\n*  - On 7 July 2015, NATO Secretary General Jens Stoltenberg expressed solidarity with Turkey after an emergency session of the military alliance's 28 ambassadors in Brussels. Stoltenberg also expressed NATO is watching the developments \"very closely\". In October 2019, Turkey invaded the Kurdish areas in Syria. Stoltenberg said that Turkey has \"legitimate security concerns\" during press conference with Turkish FM Mevlüt Çavuşoğlu.\n*  - On 13 September 2016, Dutch police announced that they would register supports and sympathizers of the PKK into the national police database.\n*  - Russia has frequently said Turkish statements of Russian support to the PKK were not true, and called on Turkey to politically solve its \"Kurdistan Issue\", for example in this quote of the Russian Foreign Ministry on 5 June 2016:\n*  - On 14 January 2016, the British Ambassador to Turkey issued a statement on the behalf of the British government condemning the PKK, while calling on the militant organization to halt its attacks against Turkey. The Ambassador stated:\n*  - In May 2016, the UN High Commissioner of Human Rights Zeid Ra'ad Al Hussein raised an alarm over violence against civilians and reported human rights abuses in predominantly Kurdish south-east Turkey. He also raised concern over the Turkish government's refusal to allow a UN team to conduct research in the area amid reports that more than a hundred people had burned to death in buildings surrounded by security forces. The Commissioner stated:\nHowever, the Turkish foreign ministry offered an open invitation to U.N. agencies to visit the country's southeastern provinces after the reports were made and refuted those statements, saying they were \"based on insufficient information\". According to the UN Commissioner, unarmed civilians, including women and children, were shot by government snipers in the south-east during the clashes and Turkish forces also inflicted significant damage on the local infrastructure. Turkish sources, whose reports were confirmed by the Turkey's foreign ministry had said in late 2015 that the PKK were hiring foreign national snipers to target civilians and high ranking Military personnel in the same region.\n*  - According to Turkish Daily Sabah, on 28 April 2016, Secretary of Defense Ashton Carter reportedly confirmed that it believes the YPG militia in the Federation of Northern Syria – Rojava, which is supported by the United States, has some connections with the PKK, which is considered a terrorist organization by the U.S. and NATO. He also reportedly said Turkey is upset with the U.S.'s position on Syrian Kurds and that the Obama administration has \"extensive consultations\" with the Turks over the issue. Vice President Joe Biden called the PKK a terrorist group \"plain and simple\" and compared it to the ISIL. However, the U.S. support for the YPG secular militia in the Syrian Civil War was even expanded: During the May 2016 offensive against the Islamic State of Iraq and the Levant (ISIL) in Northern Raqqa, US Special Operation Forces were widely reported and photographed to be present, and to wear badges of YPG and YPJ on their uniforms. When in June 2016 the Manbij Offensive of the Syrian Democratic Forces started, the Washington Post reported it under the headline of \"Ignoring Turkey, U.S. backs Kurds in drive against ISIS in Syria\". The US has stated they don't consider the YPG a terrorist organization.\nSee also\n* Timeline of the Kurdistan Workers' Party insurgency (1978–2015)\n* Cizre operation (2015)\n* Ceylanpınar incident (2015's Casus belli)\n* Hunger strikes in Turkey (2016-2017)\n* Kurdish political violence\n* Şırnak clashes (2015–2016)\n* 2015 Hakkari assault\n* West Iran clashes\n* No friends but the mountains\n* A Modern History of the Kurds by David McDowall\nReferences\nBibliography\n* }}"
    }
  ]
}