{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of New France history (1534–1607)\n\nThis section of the timeline of New France history concerns the events between Jacques Cartier's first voyage and the foundation of the Quebec settlement by Samuel de Champlain.\n1500-1589\n*1534 - On July 24, Jacques Cartier plants a cross on the Gaspé Peninsula and claims it for France.\n*1535 - Cartier's expedition sails along the St. Lawrence River and stops in a little bay he names Baie Saint-Laurent on August 10.\n*1535 - On September 6, Cartier is the first European to discover L'Isle-aux-Coudres, Quebec.\n*1535 - Cartier continues to sail up the St. Lawrence to the village of Hochelaga on October 2.\n*1537 - On June 9, Pope Paul III proclaims that since the Sauvages (Indians) are real humans, they must receive the Roman Catholic faith.\n*1541 - Cartier builds the Charlesbourg-Royal fort, the first permanent European settlement in North America, near the confluence of the Rivière du Cap Rouge with the St. Lawrence.\n1590s\n*1598 - Following the 1521 landing on Sable Island  southeast of present-day Nova Scotia by the Portuguese, the French establish a settlement.\n1600-1607\n*1600 - Pierre de Chauvin de Tonnetuit founds a trading post at Tadoussac.\n*1603 - Samuel de Champlain takes possession of lands he calls (Newfoundland) and Acadie (Acadia).\n*1604 - Pierre Dugua, Sieur de Monts and Samuel de Champlain establish an ill-fated settlement on the lands of the Passamaquoddy Nation that they give the religious name of Île-Saint-Croix.\n*1605 - Dugua and Champlain move the settlement to Port Royal in the Mi'kmaq Nation lands in present-day Nova Scotia. See Acadia.\n*1606 - Marc Lescarbot put on the first European theatrical production in North America. It was called Le Théâtre de Neptune.\n*1607 - On May 14, Captain Christopher Newport founds the first English colony on lands of the  Paspahegh Indians  in what they called America: Jamestown, Virginia.\nSee also\n* New France\n* French colonial empire\n* Colonialism\n* France\nReferences"
    }
  ]
}