{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2002 Pacific hurricane season\n\nThe 2002 Pacific hurricane season consisted of the events that occurred in the annual cycle of tropical cyclone formation over the Pacific Ocean north of the equator and east of the International Date Line. The official bounds of each Pacific hurricane season are dates that conventionally delineate the period each year during which tropical cyclones tend to form in the basin according to the National Hurricane Center (NHC), beginning on May&nbsp;15 in the Eastern Pacific proper (east of 140°W) and June&nbsp;1 in the Central Pacific (140°W to the International Date Line), and ending on November&nbsp;30 in both areas. However, tropical cyclogenesis is possible at any time of year. The first tropical cyclone of the season, Hurricane Alma, developed on May&nbsp;24; the final system, Tropical Depression Sixteen-E, dissipated on November&nbsp;16.\nNineteen&nbsp;tropical depressions developed during the 2002 season, with fifteen further strengthening into named tropical storms; eight became hurricanes, of which six attained major hurricane status. Activity was generally near normal, with the number of tropical storms and hurricanes matching the respective 1991–2020 averages; however, the number of major hurricanes was above the average of four for the same period. Hurricanes Elida, Hernan, and Kenna achieved Category&nbsp;5 strength on the Saffir–Simpson scale, tying a record set in 1994 for the most storms to do so in one season since reliable records began in 1971.\nHurricane Kenna in late October was by far the most impactful storm of the season. After weakening from its peak intensity—which was marked by a minimum barometric pressure of , making it the fourth-most intense Pacific hurricane on record—Kenna made landfall on the coast of western Mexico at Category&nbsp;4 status with maximum sustained winds of 140&nbsp;mph (220&nbsp;km/h). These winds, combined with a storm surge of up to , devastated the area surrounding the fishing village of San Blas, Nayarit, where as many as 95% of homes were damaged or destroyed; four people were killed. The name Kenna would later be retired on account of the hurricane's effects in Mexico.\nAside from Kenna, effects on land were relatively light during the season. Tropical Storm Julio struck southern Mexico in late September, causing torrential rainfall; flash floods damaged structures, and slick roads contributed to a bus accident that killed three people. Tropical Storms Boris and Iselle generated heavy rainfall in Mexico without coming ashore, while Tropical Depression Eleven-E prompted the issuance of a tropical storm warning and hurricane watch for portions of the Baja California peninsula but dissipated off the coast without impact. Hurricanes Alma and Fausto were noted for unusual meteorological feats, though neither storm affected land; Alma followed 2001's Hurricane Adolph as only the second known Pacific major hurricane in the month of May, while Fausto regenerated into a tropical storm far to the north of the Hawaiian Islands, where tropical cyclones are rarely observed.\nPrior to 2015, two time zones were utilized in the Eastern Pacific basin: Pacific east of 140°W, and Hawaii−Aleutian from 140°W to the International Date Line. For convenience, each event is listed in Coordinated Universal Time (UTC) first, using the 24-hour clock (where 00:00 = midnight&nbsp;UTC), with the respective local time included in parentheses. Figures for maximum sustained winds and position estimates are rounded to the nearest five&nbsp;units (knots, miles, or kilometers) and averaged over one&nbsp;minute, following National Hurricane Center practice. Direct wind observations are rounded to the nearest whole number. Atmospheric pressures are listed to the nearest millibar and nearest hundredth of an inch of mercury. This timeline documents the formation of tropical cyclones as well as the strengthening, weakening, landfalls, extratropical transitions, and dissipations during the season. It also includes information that was not released while the storm was active, meaning that data from post-storm reviews by the National Hurricane Center and the Central Pacific Hurricane Center is included.\nTimeline of events\nMay\nMay 15\n*The 2002 Eastern Pacific hurricane season officially begins.\nMay 24\n|alt=A track map of a hurricane over the Eastern Pacific Ocean; the system initially moves westward before turning northward midway through its life]]\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression One-E forms from an area of low pressure about 560&nbsp;mi (900&nbsp;km) south-southeast of Manzanillo, Colima.\nMay 26\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Depression One-E strengthens into Tropical Storm Alma about 655&nbsp;mi (1,055&nbsp;km) south of Manzanillo, Colima.\nMay 28\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Alma strengthens into a Category&nbsp;1 hurricane about 785&nbsp;mi (1,260&nbsp;km) southwest of Manzanillo, Colima.\nMay 29\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Alma strengthens to Category&nbsp;2 intensity about 815&nbsp;mi (1,315&nbsp;km) west-southwest of Manzanillo, Colima.\nMay 30\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, May&nbsp;29) at Hurricane Alma strengthens to Category&nbsp;3 intensity about 635&nbsp;mi (1,020&nbsp;km) southwest of Cabo San Lucas, Baja California Sur, making it the first major hurricane of the season; it simultaneously reaches maximum sustained winds of 115&nbsp;mph (185&nbsp;km/h) and a minimum barometric pressure of .\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Alma weakens to Category&nbsp;2 intensity about 535&nbsp;mi (860&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\nMay 31\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, May&nbsp;30) at Hurricane Alma weakens to Category&nbsp;1 intensity about 490&nbsp;mi (790&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Alma weakens into a tropical storm about 500&nbsp;mi (805&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\nJune\nJune 1\n*The 2002 Central Pacific hurricane season officially begins.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, May&nbsp;31) at Tropical Storm Alma weakens into a tropical depression about 510&nbsp;mi (825&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Alma degenerates into a remnant low about 510&nbsp;mi (825&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\nJune 8\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at A tropical depression forms from an area of disturbed weather about 175&nbsp;mi (280&nbsp;km) west-southwest of Acapulco, Guerrero.\nJune 9\noff the southwest coast of Mexico on June&nbsp;9|alt=A satellite image of a tropical storm]]\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, June&nbsp;8) at The tropical depression strengthens into Tropical Storm Boris about 175&nbsp;mi (280&nbsp;km) south-southeast of Manzanillo, Colima.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, June&nbsp;8) at Tropical Storm Boris reaches maximum sustained winds of 60&nbsp;mph (95&nbsp;km/h) and a minimum barometric pressure of  about 155&nbsp;mi (250&nbsp;km) south of Manzanillo, Colima.\nJune 10\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Boris weakens into a tropical depression about 115&nbsp;mi (185&nbsp;km) south-southeast of Manzanillo, Colima.\nJune 11\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Boris degenerates into a remnant low about 160&nbsp;mi (260&nbsp;km) south-southeast of Manzanillo, Colima.\nJune 27\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Depression Three-E forms from a tropical wave about 1,115&nbsp;mi (1,800&nbsp;km) southwest of the southern tip of the Baja California peninsula; it simultaneously reaches maximum sustained winds of 35&nbsp;mph (55&nbsp;km/h).\nJune 28\n|alt=A track map of the path of a tropical depression over the Eastern Pacific basin; the system moves westward for its entire life]]\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, June&nbsp;27) at Tropical Depression Three-E reaches a minimum barometric pressure of  about 1,265&nbsp;mi (2,040&nbsp;km) southwest of the southern tip of the Baja California peninsula.\nJune 29\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, June&nbsp;28) at Tropical Depression Three-E is last noted as a tropical cyclone about 1,670&nbsp;mi (2,685&nbsp;km) west-southwest of the southern tip of the Baja California peninsula; it dissipates shortly thereafter.\nJuly\nJuly 9\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Depression Four-E forms from a tropical disturbance about 345&nbsp;mi (555&nbsp;km) south of Acapulco, Guerrero.\nJuly 12\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, July&nbsp;11) at Tropical Depression Four-E strengthens into Tropical Storm Cristina about 645&nbsp;mi (1,040&nbsp;km) south-southwest of the southern tip of the Baja California peninsula.\non July&nbsp;14|alt=A satellite image of a tropical storm]]\nJuly 14\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Storm Cristina reaches maximum sustained winds of 65&nbsp;mph (100&nbsp;km/h) and a minimum barometric pressure of  about 670&nbsp;mi (1,075&nbsp;km) southwest of the southern tip of the Baja California peninsula.\nJuly 15\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Storm Cristina weakens into a tropical depression about 680&nbsp;mi (1,095&nbsp;km) west-southwest of the southern tip of the Baja California peninsula.\nJuly 16\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Cristina is last noted as a tropical cyclone about 840&nbsp;mi (1,355&nbsp;km) west-southwest of the southern tip of the Baja California peninsula; it dissipates six hours later.\nJuly 17\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, July&nbsp;16) at The Joint Typhoon Warning Center (JTWC) begins tracking a tropical depression over the extreme southwestern portion of the Central Pacific basin, though it is operationally classified as a tropical disturbance at the time.\nJuly 19\nof the annual typhoon season; the system was unofficially a tropical depression in the Central Pacific basin|alt=A track map of the path of a tropical depression over the Central and Western Pacific Ocean]]\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, July&nbsp;18) at The JTWC issues a Tropical Cyclone Formation Alert for the aforementioned tropical depression.\nJuly 20\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, July&nbsp;19) at The Japan Meteorological Agency (JMA), which is the primary Regional Specialized Meteorological Centre for the Western Pacific basin, begins tracking the tropical depression over the extreme southwestern Central Pacific basin. One hour later, the JMA reports that the tropical depression has crossed the International Date Line; the agency soon upgrades it to Tropical Storm Kalmaegi.\n*12:00&nbsp;UTC (2:00&nbsp;a.m. HST) at The JTWC reports that the tropical depression has crossed the International Date Line; the agency issues its first official warning on the system six hours later, giving it the number 15W as part of the 2002 Pacific typhoon season.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Depression Five-E forms from a tropical wave about 425&nbsp;mi (685&nbsp;km) south-southwest of Manzanillo, Colima.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Five-E strengthens into Tropical Storm Douglas about 405&nbsp;mi (650&nbsp;km) south-southwest of Manzanillo, Colima.\nJuly 22\nweakening late on July&nbsp;23|alt=A satellite image of a hurricane well to the west of the Pacific coast of Mexico]]\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, July&nbsp;21) at Tropical Storm Douglas strengthens into a Category&nbsp;1 hurricane about 420&nbsp;mi (675&nbsp;km) west-southwest of Manzanillo, Colima.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Douglas strengthens to Category&nbsp;2 intensity about 520&nbsp;mi (835&nbsp;km) west-southwest of Manzanillo, Colima.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Douglas reaches maximum sustained winds of 105&nbsp;mph (165&nbsp;km/h) and a minimum barometric pressure of  about 565&nbsp;mi (910&nbsp;km) west-southwest of Manzanillo, Colima.\nJuly 23\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, July&nbsp;22) at Tropical Depression Six-E forms from a tropical wave about 295&nbsp;mi (475&nbsp;km) south of Puerto Escondido, Oaxaca.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Depression Six-E strengthens into Tropical Storm Elida about 290&nbsp;mi (465&nbsp;km) south-southwest of Puerto Escondido, Oaxaca.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Douglas weakens to Category&nbsp;1 intensity about 750&nbsp;mi (1,205&nbsp;km) west of Manzanillo, Colima.\nJuly 24\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, July&nbsp;23) at Tropical Storm Elida strengthens into a Category&nbsp;1 hurricane about 505&nbsp;mi (815&nbsp;km) west-southwest of Puerto Escondido, Oaxaca.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Elida rapidly strengthens to Category&nbsp;3 intensity, skipping Category&nbsp;2 status, about 580&nbsp;mi (935&nbsp;km) west-southwest of Puerto Escondido, Oaxaca. This makes it the second major hurricane of the season.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Douglas weakens into a tropical storm about 1,140&nbsp;mi (1,835&nbsp;km) west of Manzanillo, Colima.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Elida strengthens to Category&nbsp;4 intensity about 660&nbsp;mi (1,065&nbsp;km) west-southwest of Puerto Escondido, Oaxaca.\nat peak intensity early on July&nbsp;25|alt=A satellite image of a hurricane off the Pacific coast of Mexico]]\nJuly 25\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT) at Hurricane Elida strengthens to Category&nbsp;5 intensity about 835&nbsp;mi (1,345&nbsp;km) west of Puerto Escondido, Oaxaca, making it the first of three such storms this season. It simultaneously reaches maximum sustained winds of 160&nbsp;mph (260&nbsp;km/h) and a minimum barometric pressure of .\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Elida weakens to Category&nbsp;4 intensity about 930&nbsp;mi (1,500&nbsp;km) west of Puerto Escondido, Oaxaca.\nJuly 26\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, July&nbsp;25) at Tropical Storm Douglas weakens into a tropical depression about 1,755&nbsp;mi (2,825&nbsp;km) west of Manzanillo, Colima.\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, July&nbsp;25) at Hurricane Elida weakens to Category 3 intensity about 1,115&nbsp;mi (1,800&nbsp;km) west of Puerto Escondido, Oaxaca.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Douglas degenerates into a remnant low about 1,150&nbsp;mi (1,855&nbsp;km) east of the Hawaiian Islands.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Elida weakens to Category&nbsp;2 intensity about 1,250&nbsp;mi (2,010&nbsp;km) south of Los Angeles, California.\nJuly 27\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, July&nbsp;26) at Hurricane Elida weakens to Category&nbsp;1 intensity about 1,190&nbsp;mi (1,920&nbsp;km) south of Los Angeles, California.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Elida weakens into a tropical storm about 1,140&nbsp;mi (1,835&nbsp;km) south of Los Angeles, California.\nJuly 29\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Elida weakens into a tropical depression about 850&nbsp;mi (1,370&nbsp;km) southwest of Los Angeles, California.\nJuly 30\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Elida degenerates into a remnant low about 680&nbsp;mi (1,095&nbsp;km) west-southwest of Los Angeles, California.\nAugust\nAugust 6\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;5) at Tropical Depression Seven-E forms from a tropical wave about 900&nbsp;mi (1,445&nbsp;km) southwest of the southern tip of the Baja California peninsula.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;5) at Tropical Depression Seven-E reaches maximum sustained winds of 35&nbsp;mph (55&nbsp;km/h) and a minimum barometric pressure of  about 890&nbsp;mi (1,435&nbsp;km) southwest of the southern tip of the Baja California peninsula.\nAugust 8\n|alt=A track map of the path of a tropical depression well west of the Pacific coast of Mexico; the system moves northwestward for its entire life]]\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;5) at Tropical Depression Seven-E is last noted as a tropical cyclone about 1,070&nbsp;mi (1,725&nbsp;km) west-southwest of the southern tip of the Baja California peninsula; it dissipates six hours later.\nAugust 21\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at A tropical depression forms from a tropical wave about 460&nbsp;mi (740&nbsp;km) south-southwest of Manzanillo, Colima.\nAugust 22\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;21) at The aforementioned tropical depression strengthens into Tropical Storm Fausto about 520&nbsp;mi (835&nbsp;km) south-southwest of Manzanillo, Colima.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Fausto strengthens into a Category&nbsp;1 hurricane about 650&nbsp;mi (1,045&nbsp;km) south-southwest of Cabo San Lucas, Baja California Sur.\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Tropical Depression One-C forms from an area of disturbed weather about 1,245&nbsp;mi (2,000&nbsp;km) southeast of Honolulu, Hawaii.\nAugust 23\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Fausto strengthens to Category&nbsp;2 intensity about 710&nbsp;mi (1,140&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Fausto strengthens to Category&nbsp;3 intensity about 755&nbsp;mi (1,215&nbsp;km) southwest of Cabo San Lucas, Baja California Sur, making it the third major hurricane of the season.\nnear peak intensity on August&nbsp;24|alt=A satellite image of a powerful hurricane over the Eastern Pacific Ocean]]\nAugust 24\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;23) at Hurricane Fausto strengthens to Category&nbsp;4 intensity about 865&nbsp;mi (1,390&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Fausto reaches maximum sustained winds of 145&nbsp;mph (230&nbsp;km/h) and a minimum barometric pressure of  about 915&nbsp;mi (1,475&nbsp;km) southwest of Cabo San Lucas, Baja California Sur.\nAugust 25\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, August&nbsp;24) at Tropical Depression One-C strengthens into Tropical Storm Alika about 790&nbsp;mi (1,270&nbsp;km) southeast of Honolulu, Hawaii.\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, August&nbsp;24) at Tropical Depression Two-C forms from an area of disturbed weather about 795&nbsp;mi (1,280&nbsp;km) south of Honolulu, Hawaii.which eventually became Hurricane Elethe CPHC stated in their seasonal summary that the system did not develop until 48&nbsp;hours later.|group=\"nb\"}}\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;24) at Hurricane Fausto weakens to Category&nbsp;3 intensity about 1,065&nbsp;mi (1,715&nbsp;km) west-southwest of Cabo San Lucas, Baja California Sur.\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, August&nbsp;24) at Tropical Storm Alika reaches maximum sustained winds of 65&nbsp;mph (100&nbsp;km/h) and a minimum barometric pressure of  about 725&nbsp;mi (1,165&nbsp;km) southeast of Honolulu, Hawaii.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Fausto weakens to Category&nbsp;2 intensity about 1,130&nbsp;mi (1,815&nbsp;km) west-southwest of Cabo San Lucas, Baja California Sur.\nAugust 26\nlate on August&nbsp;25|alt=A satellite image of a tropical storm over the Central Pacific Ocean]]\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;25) at A tropical depression forms from a tropical wave about 565&nbsp;mi (910&nbsp;km) south of the southern tip of the Baja California peninsula.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;25) at Hurricane Fausto weakens to Category&nbsp;1 intensity about 1,345&nbsp;mi (2,170&nbsp;km) west of Cabo San Lucas, Baja California Sur.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Fausto weakens into a tropical storm about 1,420&nbsp;mi (2,290&nbsp;km) west of Cabo San Lucas, Baja California Sur.\nAugust 27\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, August&nbsp;26) at Tropical Storm Alika weakens into a tropical depression about 495&nbsp;mi (795&nbsp;km) south-southwest of Honolulu, Hawaii.\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;26) at The tropical depression that had formed 24&nbsp;hours earlier strengthens into Tropical Storm Genevieve about 650&nbsp;mi (1,045&nbsp;km) south-southwest of the southern tip of the Baja California peninsula.\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, August&nbsp;26) at Tropical Depression Two-C strengthens into Tropical Storm Ele about 1,055&nbsp;mi (1,695&nbsp;km) southwest of Honolulu, Hawaii.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Genevieve reaches maximum sustained winds of 70&nbsp;mph (110&nbsp;km/h) about 685&nbsp;mi (1,105&nbsp;km) south-southwest of the southern tip of the Baja California peninsula.\n*Just after 18:00&nbsp;UTC (8:00&nbsp;a.m. HST) near Tropical Storm Fausto crosses into the Central Pacific basin about 1,170&nbsp;mi (1,880&nbsp;km) east of Honolulu, Hawaii.\nAugust 28\nlate on August&nbsp;28|alt=A satellite image of a tropical storm over the Eastern Pacific Ocean]]\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, August&nbsp;27) at Tropical Storm Fausto weakens into a tropical depression about 1,095&nbsp;mi (1,760&nbsp;km) east-northeast of Honolulu, Hawaii.\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, August&nbsp;27) at Tropical Storm Ele strengthens into a Category&nbsp;1 hurricane about 1,295&nbsp;mi (2,085&nbsp;km) southwest of Honolulu, Hawaii.\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;27) at Tropical Storm Genevieve reaches a minimum barometric pressure of  about 680&nbsp;mi (1,095&nbsp;km) south-southwest of the southern tip of the Baja California peninsula.\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, August&nbsp;27) at Tropical Depression Alika is last noted as a tropical cyclone about 805&nbsp;mi (1,295&nbsp;km) west-southwest of Honolulu, Hawaii; it dissipates shortly thereafter.\n*12:00&nbsp;UTC (2:00&nbsp;a.m HST) at Tropical Depression Fausto degenerates into a remnant low about 890&nbsp;mi (1,435&nbsp;km) east-northeast of Honolulu, Hawaii.\nAugust 29\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, August&nbsp;28) at Hurricane Ele strengthens to Category&nbsp;2 intensity about 1,515&nbsp;mi (2,435&nbsp;km) west-southwest of Honolulu, Hawaii.\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Hurricane Ele strengthens to Category&nbsp;3 intensity about 1,560&nbsp;mi (2,510&nbsp;km) west-southwest of Honolulu, Hawaii, making it the fourth major hurricane of the season.\nAugust 30\njust west of the International Date Line on August&nbsp;30|alt=A satellite image of a typhoon just outside of the Central Pacific basin limits]]\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST) at Hurricane Ele reaches sustained winds of 125&nbsp;mph (205&nbsp;km/h) and a barometric pressure of  about 1,590&nbsp;mi (2,555&nbsp;km) west-southwest of Honolulu, Hawaii. This is Ele's peak intensity while in the Central Pacific basin; it crosses the International Date Line shortly afterwards and is re-designated as Typhoon Ele in the Western Pacific basin.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;29) at A tropical depression forms from an interaction between a tropical wave and the Intertropical Convergence Zone about 390&nbsp;mi (630&nbsp;km) south-southeast of Manzanillo, Colima.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Storm Genevieve weakens into a tropical depression about 840&nbsp;mi (1,355&nbsp;km) west-southwest of the southern tip of the Baja California peninsula.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at The tropical depression that formed six hours earlier strengthens into Tropical Storm Hernan about 365&nbsp;mi (585&nbsp;km) south of Manzanillo, Colima.\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at The remnants of Fausto regenerate into a tropical depression about 600&nbsp;mi (965&nbsp;km) north of Honolulu, Hawaii.\nAugust 31\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;30) at Tropical Storm Hernan strengthens into a Category&nbsp;1 hurricane about 290&nbsp;mi (465&nbsp;km) south-southwest of Manzanillo, Colima.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Hernan strengthens to Category&nbsp;2 intensity about 310&nbsp;mi (500&nbsp;km) southwest of Manzanillo, Colima.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Hernan strengthens to Category&nbsp;3 intensity about 330&nbsp;mi (530&nbsp;km) southwest of Manzanillo, Colima, making it the fifth major hurricane of the season.\nSeptember\nSeptember 1\nnear peak intensity late on September&nbsp;1|alt=A satellite image of a powerful hurricane off the Pacific coast of Mexico]]\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, August&nbsp;31) at The barometric pressure of Tropical Depression Fausto reaches a secondary minimum of  about 905&nbsp;mi (1,455&nbsp;km) north-northwest of Honolulu, Hawaii.\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, August&nbsp;31) at Hurricane Hernan strengthens to Category&nbsp;4 intensity about 345&nbsp;mi (555&nbsp;km) west-southwest of Manzanillo, Colima.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, August&nbsp;31) at Tropical Depression Genevieve is last noted as a tropical cyclone about 1,080&nbsp;mi (1,740&nbsp;km) west of the southern tip of the Baja California peninsula; it dissipates shortly thereafter.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Hernan strengthens to Category&nbsp;5 intensity about 395&nbsp;mi (640&nbsp;km) south of the southern tip of the Baja California peninsula, becoming the second of three such storms this season. It simultaneously reaches maximum sustained winds of 160&nbsp;mph (260&nbsp;km/h) and a minimum barometric pressure of .\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Tropical Depression Fausto restrengthens into a tropical storm about 1,090&nbsp;mi (1,750&nbsp;km) northwest of Honolulu, Hawaii; its sustained winds simultaneously reach a secondary peak of 40&nbsp;mph (65&nbsp;km/h).\nSeptember 2\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, September&nbsp;1) at Hurricane Hernan weakens to Category&nbsp;4 intensity about 410&nbsp;mi (660&nbsp;km) south-southwest of the southern tip of the Baja California peninsula.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Hernan weakens to Category&nbsp;3 intensity about 465&nbsp;mi (750&nbsp;km) southwest of the southern tip of the Baja California peninsula.\nSeptember 3\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, September&nbsp;2) at Tropical Storm Fausto is last noted as a tropical cyclone about 1,655&nbsp;mi (2,670&nbsp;km) north-northwest of Honolulu, Hawaii; it is absorbed by an extratropical cyclone six hours later.\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, September&nbsp;2) at Hurricane Hernan weakens to Category&nbsp;2 intensity about 550&nbsp;mi (890&nbsp;km) west-southwest of the southern tip of the Baja California peninsula.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Hernan weakens to Category&nbsp;1 intensity about 700&nbsp;mi (1,130&nbsp;km) west-southwest of the southern tip of the Baja California peninsula.\nSeptember 4\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Hernan weakens into a tropical storm about 795&nbsp;mi (1,280&nbsp;km) west-southwest of the southern tip of the Baja California peninsula.\nSeptember 5\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Storm Hernan weakens into a tropical depression about 905&nbsp;mi (1,455&nbsp;km) west of the southern tip of the Baja California peninsula.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Eleven-E forms from an area of unsettled weather about 140&nbsp;mi (220&nbsp;km) southwest of Cabo Corrientes, Jalisco.\nSeptember 6\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, September&nbsp;5) at Tropical Depression Eleven-E reaches maximum sustained winds of 35&nbsp;mph (55&nbsp;km/h) about 160&nbsp;mi (260&nbsp;km) west-southwest of Cabo Corrientes, Jalisco.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Hernan degenerates into a remnant low about 940&nbsp;mi (1,510&nbsp;km) west of the southern tip of the Baja California peninsula.\nSeptember 7\n|alt=A track map of the path of a tropical depression off the Pacific coast of Mexico; it takes an erratic trajectory, initially moving west-northwestward before turning to the west-southwest and then to the north, all while remaining fairly close to the coastline]]\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, September&nbsp;6) at Tropical Depression Eleven-E reaches a minimum barometric pressure of  about 155&nbsp;mi (250&nbsp;km) southwest of the southern tip of the Baja California peninsula.\nSeptember 8\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Depression Eleven-E degenerates into a remnant low about 260&nbsp;mi (415&nbsp;km) west of the southern tip of the Baja California peninsula.\nSeptember 15\n*06:00&nbsp;UTC (11:00&nbsp;a.m. PDT, September&nbsp;14) at A tropical depression forms from a tropical wave about 270&nbsp;mi (435&nbsp;km) south of Manzanillo, Colima.\nSeptember 16\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, September&nbsp;15) at The aforementioned tropical depression strengthens into Tropical Storm Iselle about 220&nbsp;mi (350&nbsp;km) southwest of Manzanillo, Colima.\nSeptember 17\nnear peak intensity on September&nbsp;17|alt=A satellite image of a tropical storm over the Eastern Pacific Ocean, off the coast of the southern Baja California peninsula]]\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Iselle reaches maximum sustained winds of 70&nbsp;mph (110&nbsp;km/h) and a minimum barometric pressure of  about 270&nbsp;mi (435&nbsp;km) west-southwest of Cabo San Lucas, Baja California Sur.\nSeptember 19\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Iselle weakens into a tropical depression about 65&nbsp;mi (100&nbsp;km) southwest of Puerto Cortés, Baja California Sur.\nSeptember 20\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, September&nbsp;19) at Tropical Depression Iselle degenerates into a remnant low about 65&nbsp;mi (100&nbsp;km) west of Puerto Cortés, Baja California Sur.\nSeptember 25\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, September&nbsp;24) at A tropical depression forms from an area of unsettled weather about 200&nbsp;mi (325&nbsp;km) southwest of Acapulco, Guerrero.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at The tropical depression strengthens into Tropical Storm Julio about 125&nbsp;mi (205&nbsp;km) west-southwest of Acapulco, Guerrero.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Julio reaches maximum sustained winds of 45&nbsp;mph (75&nbsp;km/h) about 70&nbsp;mi (110&nbsp;km) south-southwest of Lázaro Cárdenas, Michoacán.\nSeptember 26\nshortly before making landfall near peak intensity late on September&nbsp;25|alt=A satellite image of a tropical storm very near the Pacific coast of Mexico; much of the associated cloud cover is already over land]]\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, September&nbsp;25) at Tropical Storm Julio makes landfall a short distance west-northwest of Lázaro Cárdenas, Michoacán, with sustained winds of 45&nbsp;mph (75&nbsp;km/h); it simultaneously reaches a minimum barometric pressure of .\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Storm Julio weakens into a tropical depression inland about 25&nbsp;mi (35&nbsp;km) north of Manzanillo, Colima; it dissipates six hours later while continuing northwestward.\nOctober\nOctober 22\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, October&nbsp;21) at A tropical depression forms from an area of unsettled weather about 380&nbsp;mi (610&nbsp;km) south of Acapulco, Guerrero.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, October&nbsp;21) at The aforementioned tropical depression strengthens into Tropical Storm Kenna about 375&nbsp;mi (600&nbsp;km) south of Acapulco, Guerrero.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Another tropical depression forms from an area of unsettled weather over the western part of the Eastern Pacific basin.\nOctober 23\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, October&nbsp;22) at The aforementioned tropical depression strengthens into Tropical Storm Lowell.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Tropical Storm Lowell reaches a minimum barometric pressure of  and initial peak sustained winds of 45&nbsp;mph (75&nbsp;km/h).\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Kenna strengthens into a Category&nbsp;1 hurricane about 435&nbsp;mi (705&nbsp;km) south of Cabo Corrientes, Jalisco.\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Tropical Depression Three-C forms from an area of unsettled weather within a large monsoonal trough about 1,195&nbsp;mi (1,925&nbsp;km) east-southeast of Johnston Atoll.which eventually became Hurricane Hukothe CPHC stated in their seasonal summary that the system did not develop until 24&nbsp;hours later.|group=\"nb\"}}\nOctober 24\nreaching Category&nbsp;5 strength on October&nbsp;24|alt=A satellite image of a Category 5 hurricane over the Eastern Pacific Ocean, off the coast of Mexico]]\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, October&nbsp;23) at Hurricane Kenna strengthens to Category&nbsp;2 intensity about 410&nbsp;mi (660&nbsp;km) south-southwest of Cabo Corrientes, Jalisco.\n*06:00&nbsp;UTC (11:00&nbsp;p.m. PDT, October&nbsp;23) at Hurricane Kenna strengthens to Category&nbsp;3 intensity about 385&nbsp;mi (620&nbsp;km) south-southwest of Cabo Corrientes, Jalisco, making it the sixth and final major hurricane of the season.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Kenna strengthens to Category&nbsp;4 intensity about 345&nbsp;mi (555&nbsp;km) southwest of Cabo Corrientes, Jalisco.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Kenna strengthens to Category&nbsp;5 intensity about 295&nbsp;mi (475&nbsp;km) southwest of Cabo Corrientes, Jalisco, making it the record-tying third such storm this season.\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Tropical Storm Lowell weakens into a tropical depression.\nOctober 25\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, October&nbsp;24) at Hurricane Kenna reaches maximum sustained winds of 165&nbsp;mph (270&nbsp;km/h) and a minimum barometric pressure of  about 225&nbsp;mi (360&nbsp;km) southwest of Cabo Corrientes, Jalisco, making it the strongest storm of the season.\n*12:00&nbsp;UTC (5:00&nbsp;a.m. PDT) at Hurricane Kenna weakens to Category&nbsp;4 intensity about 50&nbsp;mi (85&nbsp;km) west of Cabo Corrientes, Jalisco.\n*16:30&nbsp;UTC (9:30&nbsp;a.m. PDT) at Hurricane Kenna makes landfall near San Blas, Nayarit, with sustained winds of 140&nbsp;mph (220&nbsp;km/h) and a barometric pressure of .\n*18:00&nbsp;UTC (11:00&nbsp;a.m. PDT) at Hurricane Kenna weakens to Category&nbsp;3 intensity inland about 40&nbsp;mi (65&nbsp;km) north-northeast of San Blas, Nayarit.\nOctober 26\n*00:00&nbsp;UTC (5:00&nbsp;p.m. PDT, October&nbsp;25) at Hurricane Kenna drastically weakens into a tropical storm, skipping both Category&nbsp;2 and Category&nbsp;1 status, inland about 190&nbsp;mi (305&nbsp;km) northeast of San Blas, Nayarit; it dissipates six hours later.\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, October&nbsp;25) at Tropical Depression Lowell crosses into the Central Pacific basin.\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, October&nbsp;25) at Tropical Depression Three-C strengthens into Tropical Storm Huko about 1,065&nbsp;mi (1,715&nbsp;km) east-southeast of Johnston Atoll.\nOctober 27\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Tropical Depression Lowell restrengthens into a tropical storm.\n|alt=A track map of the erratic but generally westward path of a tropical storm over the Eastern and Central Pacific Ocean]]\nOctober 28\n*12:00&nbsp;UTC (2:00&nbsp;a.m. HST) at Tropical Storm Lowell reaches maximum sustained winds of 50&nbsp;mph (85&nbsp;km/h) and reattains its minimum barometric pressure of .\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Tropical Storm Huko strengthens into a Category&nbsp;1 hurricane about 730&nbsp;mi (1,175&nbsp;km) east-southeast of Johnston Atoll; it simultaneously reaches its initial peak intensity with sustained winds of 75&nbsp;mph (120&nbsp;km/h) and a barometric pressure of .\nOctober 29\n*12:00&nbsp;UTC (2:00&nbsp;a.m. HST) at Tropical Storm Lowell weakens back into a tropical depression.\nOctober 30\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, October&nbsp;29) at Hurricane Huko weakens into a tropical storm about 580&nbsp;mi (935&nbsp;km) east-southeast of Johnston Atoll.\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, October&nbsp;29) at The JMA reports that Tropical Storm Maysak has crossed the International Date Line and entered the Central Pacific basin while still a tropical storm. Around this time or shortly thereafter, the JMA declares that the system has transitioned into an extratropical cyclone.\nearly on November&nbsp;3|alt=A satellite image of a hurricane over the Central Pacific Ocean]]\nOctober 31\n*00:00&nbsp;UTC (2:00&nbsp;p.m. HST, October&nbsp;30) at Tropical Depression Lowell is last noted as a tropical cyclone; it dissipates a short time later.\n*06:00&nbsp;UTC (8:00&nbsp;p.m. HST, October&nbsp;30) at Tropical Storm Huko reattains Category&nbsp;1 hurricane strength about 300&nbsp;mi (480&nbsp;km) southeast of Johnston Atoll.\nNovember\nNovember 1\n*12:00&nbsp;UTC (2:00&nbsp;a.m. HST) at Hurricane Huko reaches maximum sustained winds of 85&nbsp;mph (140&nbsp;km/h) about 220&nbsp;mi (350&nbsp;km) southwest of Johnston Atoll.\n*18:00&nbsp;UTC (8:00&nbsp;a.m. HST) at Hurricane Huko reaches a minimum barometric pressure of  about 220&nbsp;mi (350&nbsp;km) southwest of Johnston Atoll.\nNovember 3\n*12:00&nbsp;UTC (2:00&nbsp;a.m. HST) at Hurricane Huko crosses the International Date Line, becoming Typhoon Huko in the Western Pacific basin. as Huko's final position east of the International Date Line without providing any best track data on the storm's tenure in the Western Pacific basin. The JTWC and the International Best Track Archive for Climate Stewardship disagree with this assessment, listing Huko's final position east of the International Date Line as ; they also contradict the former two sources by providing a best track for Huko in the Western Pacific basin.|group=\"nb\"}}\nNovember 14\n*00:00&nbsp;UTC (4:00&nbsp;p.m. PST,|group=\"nb\"}} November&nbsp;13) at Tropical Depression Sixteen-E forms about 540&nbsp;mi (870&nbsp;km) south of the southern tip of the Baja California peninsula.\n|alt=A track map of the erratic but generally westward path of a tropical depression over the Eastern Pacific Ocean]]\n*06:00&nbsp;UTC (10:00&nbsp;p.m. PST, November&nbsp;13) at Tropical Depression Sixteen-E reaches maximum sustained winds of 35&nbsp;mph (55&nbsp;km/h) about 535&nbsp;mi (860&nbsp;km) south of the southern tip of the Baja California peninsula.\nNovember 15\n*12:00&nbsp;UTC (4:00&nbsp;a.m. PST) at Tropical Depression Sixteen-E reaches a minimum barometric pressure of  about 565&nbsp;mi (910&nbsp;km) south-southwest of the southern tip of the Baja California peninsula.\nNovember 16\n*06:00&nbsp;UTC (10:00&nbsp;p.m. PST, November&nbsp;15) at Tropical Depression Sixteen-E degenerates into a remnant low about 715&nbsp;mi (1,150&nbsp;km) southwest of the southern tip of the Baja California peninsula.\nNovember 30\n*The 2002 Pacific hurricane season officially ends.\nNotes\nSee also\n*Timeline of the 2002 Atlantic hurricane season\n*List of Pacific hurricanes\n*Pacific hurricane season\n*Tropical cyclones in 2002\nReferences\nExternal links\n*The National Hurricane Center's [https://www.nhc.noaa.gov/archive/2002/ advisory archive for 2002]"
    }
  ]
}