{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the BBC\n\nThis is a timeline of the history of the BBC and its predecessor, the British Broadcasting Company.\n1920s\n* 1922\n** 18 October – The British Broadcasting Company is formed.\n** 14 November – Following the closure of numerous amateur stations, the first BBC broadcasts from London (station 2LO).\n** 15 November – First broadcasts from Birmingham (station 5IT) and Manchester (station 2ZY).\n** 14 December – 33-year-old John Charles Walsham Reith becomes General Manager of the BBC.\n** 24 December – First broadcast from Newcastle upon Tyne (station 5NO).\n* 1923\n** 8 January – First outside broadcast, the British National Opera Company's production of The Magic Flute from Covent Garden.\n** 18 January – The UK Postmaster General grants the BBC a licence to broadcast.\n** 13 February – First broadcast from Cardiff (station 5WA).\n** 6 March – First broadcast from Glasgow (station 5SC).\n** 6 June – Edgar Wallace makes a report on The Derby, thus becoming the first British radio sports reporter.\n** 28 September – First publication of the Radio Times listings magazine.\n** 10 October – First broadcast from Aberdeen (station 2BD).\n** 17 October – First broadcast from Bournemouth (station 6BM).\n** 16 November – First broadcast from Sheffield (relay station 6FL).\n** 2 December – The first BBC radio broadcast in Scottish Gaelic (relay station 2EH).\n** 11 June – First broadcast from Liverpool (relay station 6LV).\n** 8 July – First broadcast from Leeds and Bradford (relay station 2LS).\n** 21 July – An experimental long-wave station (5XX) is established at the Chelmsford works of the Marconi Company.\n** 15 August – First broadcast from Kingston upon Hull (relay station 6KH).\n** 16 September – First broadcast from Nottingham (relay station 5NG).\n** 21 October – First broadcast from Stoke-on-Trent (relay station 6ST).\n** 12 November – First broadcast from Dundee (relay station 2DE).\n** 12 December – First broadcast from Swansea (relay station 5SX).\n* 1924\n** 23 April – First broadcast by King George V, opening the British Empire Exhibition at Wembley Stadium.\n** 27 July – Long-wave station 5XX moves from Chelmsford; Gaelic language is broadcast throughout Scotland.\n** 15 September – First broadcast from Belfast (station 2BE).\n* 1925\n** February – Heard on BBC radio since 1924, the six electronically generated 'pips' to indicate the Greenwich Time Signal (GTS) were invented by the Astronomer Royal Sir Frank Watson Dyson, and the Director General of the BBC, John Reith.\n** 28 March – First broadcast from Plymouth (relay station 5PY).\n** 1 May – First broadcast from Edinburgh (relay stad to Daventry transmitting station and becomes the first British radio station to achieve near national coverage: the first step in the establishment of the BBC National Programme.\n* 1926\n** 4 May – The General strike begins. The BBC broadcasts five news bulletins a day as no newspapers or Radio Times are published.\n* 1927\n** 1 January – The British Broadcasting Company becomes the British Broadcasting Corporation, when it is granted a Royal Charter. Sir John Reith becomes the first Director-General.\n** 15 January – First live sports broadcast on the BBC. The rugby union international England v Wales is commented on by Teddy Wakelam.\n** 22 January – First live football match broadcast, featuring Arsenal's home league fixture against Sheffield United from Highbury.\n** January – First BBC reference library established by Florence Milnes.\n** March – The BBC coat of arms is adopted.\n** 7 July – Christopher Stone presents a record programme, becoming the first British disc-jockey.\n** 21 August – The first high-powered regional station (5GB), forerunner of the Midland Regional Programme, opens at Daventry.\n* 1928\n**2 January – The first edition of The Daily Service is broadcast. It was originally called A Short Religious Service but was renamed The Daily Service in July.\n**12 March - The first broadcast of the BBC Dance Orchestra, led by Jack Payne, took place, performing until disbanding in 1939.\n* 1929\n** 20 August – First transmissions of John Logie Baird's experimental 30-line television system.\n** 6 November - The first edition of The Week in Westminster was broadcast on the Home Service, just after the 1929 General Election.\n1930s\n* 1930\n** 9 March – The majority of the BBC's existing radio stations are regrouped to form the BBC National Programme and the BBC Regional Programme.\n** April – The Research Department is formed after a renaming of the Development section of the BBC.\n** 14 July – Transmission of the first experimental television play, The Man With the Flower in His Mouth.\n** 30 September – BBC Yearbook 1931 states that \"The number of radio licences in force on September 30th, 1930, was 3,195,553, representing about 12,000,000 listeners, or roughly every second home in the country\".\n* 1931\n** 2 June – First live outside broadcast with transmission of the Epsom Derby.\n* 1932\n** 15 March – The first radio broadcast is made from Broadcasting House.\n** 15 May – Broadcasting House, the BBC's headquarters and home to its main radio studios, is officially opened.\n** 22 August – The first, experimental television broadcast is made from Broadcasting House.\n** 19 December – The Empire Service (precursor of the World Service) launches, broadcasting on shortwave from Daventry's Borough Hill.\n** 25 December – King George V becomes the first monarch to deliver a Christmas Day message by radio, on the Empire Service.\n* 1933\n** 24 May – The BBC broadcasts a speech by Prime Minister Ramsay MacDonald on Empire day.\n** 28 May - South Wales Stations 5WA & 5SX get replaced by BBC Regional Programme West\n*1934\n** Unknown – The Type A Microphone was first used.\n** 7 October – The new high-power long-wave transmitter at Droitwich takes over from Daventry 5XX as the main station radiating the BBC National Programme.\n** The BBC broadcasts a Tuning Signal for the first time. It was a simple line and circle broadcast using Baird's 30-line system, and was used to synchronise the mechanical scanning system.\n*1935\n** The BBC establishes its first Gaelic department.\n* 1936\n** 2 November – The BBC opens the world's first regular high-definition television service, from Alexandra Palace.\n* 1937\n** 24 April – The very first children's television show For the Children.\n** 12 May – First use of TV outside broadcast van, to cover the procession that followed the coronation of George VI and Elizabeth.\n** 21 June – The BBC broadcasts television coverage of the Wimbledon Tennis Championships for the first time.\n** 16 September – The BBC makes the world's first live television broadcast of a football match, a specially arranged local mirror match derby fixture between Arsenal and Arsenal reserves.\n* 1938\n** 3 January – The BBC begins broadcasting its first foreign-language radio service, in Arabic.\n** 11 February 1938 – The BBC broadcasts its first Science Fiction (SciFi) television programme, a thirty-five-minute adapted extract of the play R.U.R., written by the Czech playwright Karel Čapek, was broadcast live from the BBC's Alexandra Palace studios. See British television science fiction.\n** 14 March – Inauguration of the Latin American service, broadcasting on shortwave in English, Spanish and Portuguese.\n** 30 April – The BBC broadcasts television coverage of the FA Cup for the first time.\n** 27 September – Start of the European Service on radio, broadcasting in French, German and Italian. Portuguese and Spanish are added before the start of the Second World War.\n* 1939\n** Creation of BBC Monitoring\n** 1 September – The BBC Television Service is suspended, around 20 minutes after the conclusion of a Mickey Mouse cartoon (''Mickey's Gala Premier''), owing to the imminent outbreak of World War II and amid fears that the VHF transmissions would act as perfect guidance beams for enemy bombers attempting to locate central London. Additionally, the service's technicians and engineers will be needed for such war efforts as the development of radar. On radio, the National and Regional Programmes are combined to form a single Home Service.\n** 17 October – The First World Radio Broadcast, the most sensational live radio broadcast ever attempted by the BBC hit the airwaves. It took place at the RAF Hendon base in North London, in front of a specially invited audience of RAF personnel. The whole show was relayed worldwide across the airwaves, the first time a live show had ever been broadcast around the globe. The bill starred Adelaide Hall, Mantovani and His Orchestra, The Western Brothers, and Harry Roy and his Band.\n1940s\n* 1940\n** 7 January – Start of the BBC Forces Programme on radio, precursor of the post-war Light Programme.\n** 11 May – The BBC starts a news service in Hindi.\n* 1941\n** The BBC European Service moves to Bush House in Central London.\n* 1942\n**29 January – The first edition of Desert Island Discs is broadcast on the BBC Forces Programme.\n* 1943\n**23 November – British Forces Broadcasting Service begins operation.\n* 1944\n** 27 February – BBC General Forces Programme replaces the BBC Forces Programme (also broadcast on shortwave).\n* 1945\n** 29 July – Regional radio programming resumes on the Home Service (on the same medium-wave frequencies as used pre-war by the Regional Programme), while on the same day a new Light Programme begins, using the long-wave frequency of the pre-war National Programme.\n** 9 October – The first edition of Today in Parliament is broadcast.\n* 1946\n** 7 June – BBC Television broadcasts (405 lines) resume after the war including the coverages of cricket and Wimbledon Tennis. One of the first programmes shown is the same exact Mickey Mouse cartoon from its television service suspension in 1939.\n** 29 September – The Third Programme starts broadcasting on radio.\n** 7 October – ''Woman's Hour'' launches, covering issues about women.\n** October – For The Children is launched, the first ever Children block for the BBC.\n* 1947\n** 7 October – Adelaide Hall singing at a RadiOlympia variety show is the oldest surviving telerecorded programme in Britain.\n** 9 November – First use of telerecording of an outside broadcast: the Service of Remembrance from the Cenotaph is televised live, and a telerecording shown that evening.\n** 20 November – The wedding of Princess Elizabeth and Philip Mountbatten, Duke of Edinburgh is televised by the BBC. It is watched by an estimated 400,000 viewers.\n* 1948\n** January – The first ever news program, Newsreel is launched.\n** 29 July – The London Olympic Games is televised.\n** 26 December – The first Reith Lecture is broadcast on radio.\n* 1949\n** July - The revived BBC weather forecast was relaunched. The format would not change until 1954.\n** \"Briefe ohne Unterschrift\" begins broadcast (1949–1974) Austin Harrison reads and comments letters by East Germans.\n** 17 December – For the first time television extends beyond London when the Sutton Coldfield transmitter starts broadcasting, providing television reception across the Midlands.\n1950s\n* 1950\n** 29 May – The Archers is launched, initially as a six-episode trial, and only broadcast in the Midlands.\n** 21 May – Lime Grove television studios open.\n** 27 August – First live television from the European continent, using BBC outside broadcast equipment.\n** October – Democracy on TV first started, but was never shown in public. The first real broadcast wasn't until 1989.\n* 1951\n** 12 October – Television extends to the north of England following the switching on of the Holme Moss transmitting station.\n* 1952\n** 14 March – Television becomes available in Scotland for the first time following the switching on of the Kirk o' Shotts transmitting station.\n** 15 August – Television becomes available in Wales for the first time following the switching on of the Wenvoe transmitting station.\n* 1953\n** 1 May – Television becomes available in Northern Ireland for the first time although initially from a temporary transmitter, brought into service in time for the Queen's Coronation. A permanent mast at Divis is brought into service in 1955.\n** 2 June – The coronation of Queen Elizabeth II in Westminster Abbey is televised by the BBC and watched live by an estimated audience of 20 million people in the United Kingdom.\n** 11 November – The first edition of Panorama is presented by Daily Mail reporter Pat Murphy. Panorama is the world's longest-running current affairs programme and retains a peak-time slot to this day.\n** Watch with Mother, the pre-schoolers strand, debuts. It was replaced with the See Saw branding in 1975.\n* 1954\n** The BBC purchases Dickenson Road Studios, a converted church in Manchester, which becomes the BBC's first regional television studio.\n** 11 January – The very first in-vision weather forecast is broadcast, presented by George Cowling. Previously, weather forecasts had been read by an off-screen announcer with a weather map filling the entire screen.\n** 5 July – BBC newsreader Richard Baker reads the first televised BBC News bulletin.\n** 30 December – The first BBC Sports Personality of the Year award takes place.\n* 1955\n** 2 May – The BBC begins broadcasting its radio service on VHF (FM), using the Wrotham transmitter.\n** September – Kenneth Kendall becomes the BBC's first in-vision newsreader, followed by Richard Baker and Robert Dougall.\n** 10 October – Alexandra Palace begins test transmissions of a 405-line colour television service.\n* 1956\n** 28 March – Television transmissions begin from the new Crystal Palace site in south London.\n** The BBC broadcasts a trade test colour film for the first time.\n* 1957\n** 16 February – Six-Five Special first Rock and Roll programme first broadcast (16 February 1957 – 27 December 1958)\n** The first broadcast of Test Match Special takes place, providing listeners with ball-by-ball cricket commentary for the first time.\n** 24 April – The Sky at Night, a monthly astronomy programme presented by Sir Patrick Moore, is first broadcast.\n** 24 September– The first programmes for schools are broadcast.\n** September – The first broadcasts of regional news bulletins took place.\n** 30 September – Launch of Network Three, a strand of adult-education broadcasts transmitted on the frequencies of the Third Programme in the early part of weekday evenings.\n** 25 December – First TV broadcast of the Queen's Christmas Day message.\n* 1958\n** The BBC introduces a new 3 box system logo. The logo featured slanted lettering within upright boxes.\n** The BBC Radiophonic Workshop is established to create sound effects for BBC programmes.\n** 14 April – The newly magnetic videotape machine Vision Electronic Recording Apparatus or VERA for short, was given a live demonstration on-air in Panorama where Richard Dimbleby seated by a clock, talked for a couple of minutes about the new method of vision recording with an instant playback, and then the tape was wound back and replayed.\n** 5 May – First experimental transmissions of a 625-line television service.\n** 10 October – First broadcast of the United Kingdom's multi-sport television show Grandstand.\n** 16 October – First broadcast of the United Kingdom's longest-running children's television show Blue Peter.\n* 1959\n** The BBC North East and Cumbria region is created with localised bulletins from Newcastle-upon-Tyne aired for the first time. Previously, the area was part of a pan-Northern region based in Manchester.\n1960s\n* 1960\n** 26 March – BBC Television televises the Grand National for the first time.\n** 19 June – Nan Winton becomes the BBC's first national female newsreader.\n** 29 June – BBC Television Centre opens.\n** 8 October – The BBC Television Service is renamed as BBC TV.\n* 1961\n** 30 June – Final original episode of classic sitcom Hancock broadcast on BBC TV.\n** 1 October – Long-running religious music series Songs of Praise debuts on BBC TV.\n** 2 October – Long-running viewers' letters series Points of View debuts on BBC TV.\n** 15 December – First episode of Comedy Playhouse broadcast on BBC TV.\n* 1962\n** 4 January – Popular sitcom Steptoe and Son begins.\n** 27 June – The Pilkington Committee on Broadcasting publishes its report into the future of UK broadcasting. Long its recommendations are the introduction of colour television licenses, that Britain's third national television channel should be awarded to the BBC and that the BBC should extend its activities to the creation of local radio stations in order to prevent the introduction of commercial radio.\n** 28 August – Experimental stereo radio broadcasts begin.\n** The BBC runs a series of closed circuit experiments in local radio from a variety of locations across England.\n* 1963\n** The BBC logo was modified to slant the boxes with the lettering and to reduce the spaces between the lettering as well as between the boxes.\n** 30 September – A globe is used as BBCtv's channel identity for the first time.\n** 23 November – First broadcast of the world's longest-running science fiction television programme, Doctor Who.\n* 1964\n** 1 January – First broadcast of pop and rock music television show Top of the Pops.\n** 20 April – BBC2 starts broadcasting (on 625 lines). The existing BBC Television Service is renamed BBC1.\n** 22 August – First broadcast of top flight football television show Match of the Day.\n* 1965\n** 22 March – Launch of the daytime BBC Music Programme on the frequencies of Network Three / the Third Programme.\n** 1 May – The General Overseas Service is renamed the BBC World Service.\n** 10 October – A new service for Asian immigrants begins broadcasting. The programming consists of a weekly television and radio programme broadcast on Sunday mornings.\n* 1966\n**3 January – Camberwick Green is the first programme on BBC1 to be shot in colour and the first programme to feature the copyright year in the end credits; BBC1 would not broadcast in colour until almost four years later and regular BBC programmes also wouldn't show the copyright year in the end credits until six years later.\n** 5 April – The Money Programme – the BBC's first regular programme devoted to business and finance – debuts on BBC2.\n** 17 April – The first regular stereo radio transmissions begin, from the Wrotham transmitter.\n** A government White Paper paves the way for the launch of a small number (eight) of two-year experimental BBC Local Radio stations.\n* 1967\n**3 January – Trumpton is the second programme on BBC1 to be shot in colour and to also feature the copyright year in the end credits five years before regular BBC programmes would; only BBC2 became the first channel to broadcast colour nearly six months later. BBC1 however still wouldn't broadcast colour until almost three years later.\n** 25 June – The first worldwide live satellite programme, Our World, featuring the Pop band, the Beatles, is televised.\n** 1 July – Regular colour TV transmissions (625 lines) begin on BBC2, starting with the Wimbledon tennis championships.\n** 30 September – BBC Radio 1 is launched, as a response to the threat from pirate radio station broadcasts of popular music. At the same time, the Light Programme, the third network (Network Three / the Third Programme), and the Home Service are renamed Radios 2, 3 and 4 respectively.\n** 8 November – The BBC launches its first local radio station when BBC Radio Leicester launches.\n** 15 November – BBC Radio Sheffield launches.\n** 22 November – BBC Radio Merseyside launches.\n** 2 December – BBC2 becomes the first television channel in Britain to broadcast a full service in colour.\n* 1968\n** 31 January – BBC Radio Nottingham launches.\n** 14 February – BBC Radio Brighton launches.\n** 14 March – BBC Radio Stoke launches.\n** 25 March – BBC regional television from Leeds began and the first edition of Look North is broadcast. Previously, the Yorkshire area had been part of a wider North region based in Manchester.\n** 24 June – BBC Radio Leeds launches.\n** 3 July – BBC Radio Durham launches.\n** 31 July – The first episode of ''Dad's Army is broadcast.\n* 1969\n**10 July – The BBC publishes a report called \"Broadcasting in the Seventies\" proposing the reorganisation of programmes on the national networks and replacing regional broadcasting on BBC Radio 4 with BBC Local Radio.\n** 9 September – The first edition of Nationwide is broadcast.\n** 19–20 September – BBC News relocates from Alexandra Palace in North London to BBC Television Centre in West London.\n**6 October – Chigley'' is the third and final programme to be shot in colour on BBC1 before regular colour broadcasting and also happens to be the first programme to feature the copyright year in Roman numerals in the end credits nearly seven years ahead of most programmes by the BBC.\n** 15 November – BBC1 starts broadcasting in colour (simultaneous with rival ITV). First appearance of the Mirror Globe, coloured blue on black.\n**BBC Local Radio is made permanent after the two-year experiment is judged to have been a success.\n1970s\n* 1970\n** A number of BBC Local Radio stations launch – BBC Radio Manchester (10 Sept), BBC Radio Bristol (4 Sept), BBC Radio London (6 Oct), BBC Radio Oxford (29 October), BBC Radio Birmingham (9 Nov), BBC Radio Medway (18 December), BBC Radio Solent (31 Dec) and BBC Radio Teesside (31 December).\n** 4 April – BBC Radio's sports coverage transfers from BBC Radio 3 to BBC Radio 2.\n** 14 September – Robert Dougall presents the first edition of the ''BBC Nine O'Clock News''. The programme, launched in response to ITN's News at Ten, was controversially moved to 10pm in 2000.\n* 1971\n** The BBC logo's boxes rounds off the corners and increases the spaces.\n** The first programmes for the Open University are broadcast.\n** 2 January - BBC Radio Newcastle launches\n** 26 January – BBC Radio Blackburn launches.\n** 25 February –\n***BBC Radio Humberside launches.\n***The animated children's adventure series Mr Benn airs on BBC1 with the copyright year shown from the previous year (1970) in the end credits shortly before the BBC tv logo. However the other regular BBC programmes unlike The Trumptonshire Trilogy still wouldn't show any copyright years until the following year (1972).\n** 29 April – BBC Radio Derby launches.\n** 10 June – The BBC's new Pebble Mill Studios in Birmingham are opened by Princess Anne.\n* 1972\n** 4 April – The first edition of Newsround is broadcast.\n** 25 August – When the government restricted the BBC to twenty local radio stations, the corporation responds by closing BBC Radio Durham. Its resources are transferred to Carlisle where BBC Radio Carlisle, now BBC Radio Cumbria, was formed.\n** 2 October – Following a recent law change, BBC1 and ITV are allowed to begin broadcasting a full afternoon schedule with both broadcasters now broadcasting non-stop from lunchtime. BBC1's afternoon schedule launches with the first edition of a new lunchtime magazine programme Pebble Mill at One.\n** 4 November – Radios 2 and 4 begin broadcasting in stereo in South East England. Stereo was rolled out to the rest of the country over subsequent years.\n* 1973\n** 4 January – The pilot episode of Last of the Summer Wine airs on television. The regular series, which begins on 12 November, becomes the longest-running sitcom in the world, running for 37 years.\n** 2 April – BBC2 broadcasts the first programme produced by the BBC's Community Programme Unit. It had been commissioned the previous year to help members of the public create programmes to be broadcast nationally.\n**24 August – BBC2 broadcasts a trade test colour film for the final time, having done so during daytime closedowns to provide colour broadcasting in these intervals for use by television shops and engineers (the 'trade') to adjust their television sets.\n** 10 September – Newsbeat bulletins air on BBC Radio 1 for the first time.\n** 24 November – BBC Radio Carlisle launches.\n** 17 December – The British government imposes early close downs of all three television channels in the UK from this date in order to save electricity during the crisis which culminates in imposition of a Three-Day Week from 31 December. The restrictions force BBC1 and BBC2 to end their broadcasting day at 10:30pm. They are lifted temporarily on Christmas Eve to allow the public to enjoy festive programming, then recommence on Monday 7 January 1974, ending on 8 February 1974.\n* 1974\n** 7 January – A two-minute mid-afternoon regional news summary is broadcast on BBC1 for the first time. It is transmitted immediately before the start of the afternoon's children's programmes.\n** 1 April – BBC Radio Teesside is renamed BBC Radio Cleveland.\n** 23 September – Teletext service Ceefax goes live.\n**December – The BBC1 Mirror globe changes colour from blue on black to yellow on blue.\n* 1975\n** 1 January – BBC Radio Ulster is launched.\n** 4 January – Due to cutbacks at the BBC, BBC Radio 2's broadcasting hours are cut back, with the station now starting their day at 6:00am instead of 5:00am, and their broadcasting day concluding at around 12:33am instead of 2:02am.  Later in the autumn of 1975, BBC Radio 2 would end their day slightly earlier at around 12:10am, except on Saturdays and Sundays when the station would continue until around 12:33am. These cutbacks would remain until 1978, however at Christmas 1975, 1976 and 1977 BBC Radio 2 hours were extended over the festive season.\n** 6 January – Due to these cutbacks, BBC1 stops broadcasting regular programmes on weekday afternoons between 2&nbsp;pm and 4&nbsp;pm other than schools programmes and sport. This meant ITV was often the only channel providing afternoon viewing. As an additional economy measure, BBC2 transmitters were turned off for much of the daytime if no programmes were being broadcast.\n* 1976\n**September – The credits of each programme produced by the BBC reveals the copyrighted years in Roman numerals for the first time since Chigley in 1969.\n* 1977\n** 3 January – BBC Radio Cymru is launched.\n** 9 May – BBC Radio Orkney and BBC Radio Shetland launch as opt-out stations from BBC Radio Scotland.\n** 19 October – The first edition of a new weekly magazine programme for Asian women, Gharbar, is broadcast. The programme had only been intended to run for 26 weeks but continued for around 500 weeks, finally ending in April 1987.\n** 25 December – The Morecambe & Wise Christmas Show on BBC One attracts an audience of more than 28 million, one of the highest ever in UK television history.\n* 1978\n** The BBC organises its first Young Musician of the Year competition.\n** 24 May – Nationwide airs the famous Skateboarding duck report.\n** 23 November –\n*** All BBC national radio stations change their medium or long wave transmission wavelength as part of a plan for BBC AM broadcasting in order to improve national AM reception, and to conform with the Geneva Frequency Plan of 1975. Radio 1's transmission wavelength is moved from 247m (1214&nbsp;kHz) to 275 & 285m (1053 & 1089&nbsp;kHz) medium wave. Radio 2's wavelength is moved from 1500m (200&nbsp;kHz) long wave to 433 & 330m (693 & 909&nbsp;kHz) medium wave.  Radio 3 is moved from 464m (647&nbsp;kHz) to 247m (1215&nbsp;kHz) medium wave.  Radio 4 is moved from various medium wavelengths to 1500m (200&nbsp;kHz) long wave.\n*** The shipping forecast transfers from BBC Radio 2 to BBC Radio 4 so that the forecast can continue to be broadcast on long wave.\n*** The Radio 4 UK Theme is used for the first time to coincide with the network becoming a fully national service for the first time and to underline this the station officially becomes known as Radio 4 UK, a title that remains until mid 1984.\n** November – Due to Radio 4's transfer from medium wave to long wave, BBC Radio Scotland and BBC Radio Wales launch as full-time stations on Radio 4's former Scottish and Welsh medium wave opt-out wavelengths of 370m (810&nbsp;kHz) and 340m (882&nbsp;kHz) respectively, albeit initially with very limited broadcast hours due to very limited coverage of BBC Radio 4 on FM in both countries.\n** 21–22 December – The BBC is crippled by its most famous strike, which leads to record viewing figures for ITV. BBC1 and BBC2 television are off the air on 21 and 22 December. On 22 December the unions called out their radio colleagues on strike, meaning BBC Radio 1, 2, 3 and 4 were \"collapsed\" into one emergency \"All Network Service\" from 4:00pm until the end of their broadcasting day at 2:05am.  The strike was settled by 10:00pm on 22 December with a pay increased awarded to BBC staff. BBC Television and Radio stations resumed normal broadcasting on 23 December.\n** The BBC Film and Videotape Library is created as a permanent archive for its television programmes. Prior to this the BBC had no central archive and material stored in the BBC's various libraries were often either wiped or discarded so that new programmes could be recorded as videotape was expensive, and also because the BBC Film Library and the Engineering Department, which had handled videotape, had no mandate to retain material.\n* 1979\n** 27 January – BBC Radio 2 becomes the first national 24-hour radio station in the UK.\n** 1 March – BBC Two unveils its computer generated ident, the first computer-generated ident in the world. The second such ident is unveiled by US broadcaster NBC.\n** 27 August – The murder of Lord Mountbatten by the IRA sets a record audience of 26 million for a news bulletin. Strike action at ITN led to the record viewing figures.\n** 11 September – BBC Radio Foyle launches as an opt-out station from BBC Radio Ulster.\n** 25 September – The first edition of Question Time is broadcast.\n1980s\n* 1980\n** 28 January – Newsnight is launched.\n** February – BBC Radio Deeside is launched as an opt-out service from BBC Radio Wales.\n** March – The very first in-vision Ceefax transmissions are broadcast. Three 30-minute transmissions are aired at various points during weekday daytime downtime.\n** Summer – Due to the continued expansion of BBC Local Radio, regional opt-out programming on BBC Radio 4 ends, apart from in the south west as this is now the only part of England still without any BBC local station.\n** 6 September – BBC Two launches a computer generated clock, probably the first of its kind in the world.\n** 8 September – Watchdog is launched as a weekly slot on BBC One's news magazine programme Nationwide.\n** 11 September – BBC Radio Norfolk launches.\n** 19 September – Regional peak time continuity on BBC1 ends and with it the weeknight closedown regional news bulletin.\n** 11 November – BBC Radio Lincolnshire launches.\n** 21 November – The charity appeal Children in Need is launched.\n* 1981\n** 17 May – Sunday Grandstand launches. It broadcasts during the summer months on BBC Two.\n** 4 July – BBC Radio Blackburn expands to cover all of Lancashire and is renamed accordingly.\n** 29 July – The Wedding of Charles, Prince of Wales and Lady Diana Spencer is produced by BBC Television & Radio with an audience of 750 million viewers and listeners in over 60 countries.  Welsh Actor Richard Burton and Scottish writer, actor & royal expert Tom Fleming are among the commentators.\n** Autumn – BBC Micro is produced for BBC Computer Literacy Project.\n** 4 September – The final edition of the Midday News is broadcast.\n** 5 September – The BBC1 Mirror globe changes colour from yellow on blue to green on blue.\n** 7 September – News After Noon is launched as a 30-minute lunchtime news programme, replacing the much shorter Midday News.\n** October – BBC Radio Deeside is expanded to cover all of north east Wales and is renamed BBC Radio Clwyd.\n** 23 October – The last teatime block of Open University programmes are transmitted on BBC2. From the 1982 season, only a single Open University programme is aired at 5:10pm, ahead of the start of the channel's evening programmes.\n** 23 November – BBC Radio Birmingham expands to cover the West Midlands, South Staffordshire, north Worcestershire and north Warwickshire and is relaunched as BBC Radio WM.\n* 1982\n** March – The BBC proposes to launch a satellite television service following the Corporation being awarded two of the five DBS satellite channels.\n** 15 and 16 March – BBC Local Radio starts broadcasting to the Channel Islands when BBC Radio Guernsey and BBC Radio Jersey launch.\n** 1 May – BBC Radio Cambridgeshire launches.\n** 25 May – BBC Radio Carlisle expands to cover all of Cumbria and is renamed accordingly and as part of the expansion, BBC Radio Furness launches as an opt-out service.\n** 16 June - BBC Radio Northampton launches.\n** 20 June – The BBC relaunches its Sunday morning programme for the Asian community when Asian Magazine replaces Apna Hi Ghar Samajhiye which had been on air since 1968.\n** September – The BBC World Service becomes available to UK listeners for the first time, albeit only in south east England.\n** 10 September – After 32 years on air, Listen with Mother is broadcast on BBC Radio 4 for the final time.\n** 1 November – BBC-produced Welsh-language programming is transferred from BBC One to the new S4C channel.\n** 23 December – Service Information is broadcast for the final time.\n** 31 December – The last remaining opt-out regional programming on BBC Radio 4 ends when the final edition of ''Morning Sou'West is broadcast, ahead of the launches of BBC Radio Devon and BBC Radio Cornwall.\n* 1983\n** January – BBC1 starts broadcasting a full afternoon service, consisting of regional programmes, repeats and old feature films.\n** 17 January –\n*** Breakfast Time'', the UK's first national breakfast television service, is launched, ahead of the ITV franchise TV-am, which follows on 1 February.\n*** BBC Radio Devon and BBC Radio Cornwall launch.\n** late February/early March – BBC One begins broadcasting a 30-minute Ceefax slot prior to the start of Breakfast Time. It is called Ceefax AM. It is first mentioned in the Radio Times on 21 March.\n** 11 April – BBC Radio Tweed launches as an opt-out from BBC Radio Scotland.\n** 16 April – BBC Radio Solway launches as an opt-out from BBC Radio Scotland.\n** 18 April – BBC Radio Gwent launches as an opt-out service from BBC Radio Wales.\n** 2 May – From today Pages from Ceefax is broadcast during all daytime downtime although BBC2 continues to fully close down for four hours after Play School. The broadcasts are still known as Ceefax in Vision and were not listed in the Radio Times until 7 January 1984 when they became known as Pages from Ceefax.\n** 2 July – BBC Radio Medway is expanded to cover all of the county of Kent and is renamed accordingly.\n** 4 July –  BBC Radio York launches on a permanent basis – the station had been on air briefly the previous May to cover the visit to York of Pope John Paul II.\n** 5 August – The final edition of Nationwide is broadcast.\n** 16 September – BBC2 closes down during the day for the final time – all future daytime downtime is filled by Pages from Ceefax.\n** 19 September – Programmes for schools and colleges are transferred to BBC Two and an all-day educational strand called Daytime on Two is launched. Consequently, the morning broadcast of Play School transfers to BBC One.\n** 22 October – BBC Radio Brighton expands to cover all of Sussex and is renamed accordingly.\n** 24 October – Sixty Minutes launches as the new evening news programme to replace Nationwide.\n** Autumn – Shortly after the Home Secretary announced that the three remaining satellite channels would be given to the Independent Broadcasting Authority (IBA) to allow the private sector to compete against the BBC, the BBC starts talking with the IBA about a joint project to help cover the cost. The Government subsequently gives permission and a consortium emerges consisting of the BBC, Granada, Anglia Television, Virgin, Thorn-EMI, Pearson Longman and Consolidated Satellite Broadcasting. The BBC holds a 50% stake in the consortium.\n* 1984\n** The BBC conducts five trials of citywide community stations in Greater Manchester. Each trial lasts for a few weeks and was on air for a few hours each day, opting out of BBC Radio Manchester. The experiment has not been repeated.\n** 7 June – The first edition of Crimewatch UK is broadcast on BBC1.\n** 27 July – The final edition of Sixty Minutes is broadcast.\n** 3 September – First broadcast of the ''Six O'Clock News on BBC One. The programme continues to this day.\n** October – BBC2 launches a full afternoon service, consisting of repeats of Dallas and old feature films.\n** 5 October – The last teatime Open University programme is broadcast on BBC2. However Open University programmes continue to be shown on BBC2 on weekday lunchtimes on an ad-hoc basis until 1988.\n** 18 November – The BBC launches its first Sunday lunchtime political interview show, called This Week, Next Week. It is replaced in 1988 by On the Record.\n** December – BBC1 stops broadcasting a late night news summary.\n* 1985\n** 3 January – The last day of transmission using the 405 lines system.\n** 7 January – The BBC ends its experiment with afternoon broadcasting and from this date afternoon Pages from Ceefax'' is shown on BBC1 between the end of lunchtime programmes and the start of children's programmes, and on BBC2 Ceefax pages are shown continuously between 9am and 5:25pm apart from when Daytime on Two is in season and when sporting events are being shown.\n** 23 January – Television coverage of proceedings in the House of Lords begins.\n** 18 February – BBC1 is given a major relaunch, along with the introduction of a new ident, the COW (Computer Originated World). Also, computerised weather maps were used for the first time for all weather forecasts – prior to this date computerised maps had only been used during Breakfast Time.\n** 19 February – EastEnders premieres on BBC One.\n** March – The charity appeal Comic Relief is launched.\n** 23 April – BBC Radio Shropshire launches.\n** May – The consortium which has been planning to launch satellite television in the UK, of which the BBC is part, collapses on costs grounds.\n** 24 June – BBC Radio Bedfordshire launches.\n** 13 July – Live Aid is broadcast to the world on BBC One and BBC Radio 1, the first broadcast of its kind.\n** 6 September – The weekly regional programmes slot moves to BBC2, airing at 8pm on Fridays. They had previously been shown late in the evening on BBC1.\n** 9 September – The weekday afternoon block of children's programming is rebranded as Children's BBC, and for the first time the children's block has dedicated idents and an in-vision presenter. Previously children's programming had been introduced by BBC1's team of regular duty announcers.\n** 1 October – BBC Radio nan Gàidheal launches.\n* 1986\n** 6 January – A regional news bulletin is broadcast after the ''Nine O'Clock News'' for the first time. It had originally been planned to appear the previous September to co-inside with last year's relaunch of the ''Nine O'Clock News''.\n** 30 March – BBC2 receives a new look with the word TWO. BBC2's \"TWO\" logo features the red, green and blue coloured pieces two years and two months ahead of the BBC's corporate logo adding underlines.\n** 1 April – All commercial activities of the BBC are now handled by BBC Enterprises Ltd.\n** 9 June – BBC Television broadcasts its first Parliamentary review programme when the first edition of The Lords This Week is broadcast on BBC2.\n** 18 July – The Crystal Palace transmitter becomes the first in the world to transmit stereophonic sound using the NICAM digital sound system when it broadcasts the BBC's coverage of the First Night of the Proms in stereo.\n** 24 October – The final edition of News After Noon is broadcast.\n** 27 October – BBC One starts a full daytime television service. Among the new programmes is a new lunchtime news bulletin – the ''One O'Clock News. The programme continues to this day. Before today, excluding sport and special events coverage, BBC1 had closed down at times during weekday daytime, broadcasting trade test transmissions and, from May 1983, Pages from Ceefax''. BBC Two also expands its programming hours, providing a full afternoon service but it wasn't until the end of the decade that BBC2 was on air all day every day.\n** 5 November – BBC Essex launches.\n** 8 December – Six weeks after launching its daytime service, BBC TV starts broadcasting hourly news summaries. Morning bulletins are shown on BBC1 and early afternoon summaries (at 2pm, 3pm and 3:50pm) are shown on BBC2. Each bulletin is followed by a weather forecast.\n**28 December – After more than 20 years, BBC radio's national programme for the Asian community, Apna Hi Ghar Samajhiye (Make Yourself at Home), and broadcast on Sunday morning on BBC Radio 4, ends.\n* 1987\n** The BBC World Service launches BBC 648 from the Orfordness transmitting station. The service provides a tailor-made service for northern Europe featuring some French and German programming programmes interwoven with the main output in English.\n**28 April – BBC television programming in Hindi and Urdu ends after more than 20 years. Three months later, on 25 July, a new English language programme for the Asian community launches.\n** 4 June – BBC 1/2 Mix, is launched as a subscription-funded television service, serving continental Europe, initially serving Scandinavia.\n** 22 June – The BBC's lunchtime children's programme moves from BBC1 to BBC2. It is shown slightly earlier, at 1:20pm.\n** 31 October – BBC Radio 1 starts broadcasting on VHF in London.\n* 1988\n** 11 April – BBC Somerset Sound launches as an opt-out station from BBC Radio Bristol.\n** 9 May – The BBC launches a youth strand on BBC2 called DEF II.\n** 1 September –\n*** BBC External Services is renamed the World Service.\n*** Radio 1 starts regular broadcasts on VHF/FM in [https://web.archive.org/web/20040616182006/http://www.radiorewind.co.uk/sounds/New_Tmitter_88_LQ.wma Scotland], [https://web.archive.org/web/20050417052213/http://www.vintagebroadcasting.org.uk/audio/35.mp3 northern England], the Midlands, and south Wales, Avon and Somerset. FM coverage is rolled out across the rest of the UK in stages over the next few years.\n** 20 September – The Radio Data System (RDS) launches, allowing car radios to automatically retune, display station identifiers and switch to local travel news.\n** 3 October – BBC Radio Gloucestershire launches.\n** 7 October – BBC Radio London stops broadcasting and is replaced on 25 October by BBC GLR.\n** 30 October –\n***The Asian Network launches as a 70 hours-a-week service on the MW transmitters of BBC Radio Leicester and BBC Radio WM.\n***BBC Radio Manchester is relaunched as BBC GMR.\n** Autumn – The BBC takes its first tentative steps into later closedowns – previously weekday programmes ended no later than 12:15am and weekend broadcasting had finished by 1:30am.\n** Regular late evening weeknight programming starts to appear on BBC Local Radio. The programming tends to be regional rather than local with the same programme networked on several local stations. Consequently, stations are now starting to provide local/regional programming on weeknights until midnight. Previously stations had ended local programming by mid-evening, handing over to BBC Radio 2 until the following morning.\n* 1989\n** 16 January – The BBC launches The Late Show, Britain's first daily television arts programme. It is broadcast four nights a week on BBC 2 directly after Newsnight.\n** 14 February – BBC Hereford and Worcester launches.\n** 4 March – BBC Wiltshire Sound launches.\n** 1 April – BBC 1/2 Mix is relaunched as BBC TV Europe. The service also now becomes available to other parts of Europe.\n** May – The BBC Night Network is launched on the BBC's six local radio stations in Yorkshire and north east England. The service broadcasts seven nights a week from 6:05pm (6pm at the weekend) until 12midnight. Two years later the service is expanded to include the BBC's four stations in the north west.\n** 19 June – For the first time, BBC2 broadcasts during the morning when not showing Daytime on 2. Programmes begin at 10am, as opposed to lunchtime.\n** 29 September – The final edition of Breakfast Time is broadcast.\n** 2 October – The first edition of BBC Breakfast News is broadcast.\n** 21 November – Television coverage of proceedings in the House of Commons begins.\n1990s\n* 1990\n** 17 January – BBC CWR launches.\n** 25 March – At 7pm BBC Radio 2 becomes available on FM 24/7 for the first time after the final ever 'borrow' of its FM frequencies by BBC Radio 1.\n** 12 April – BBC Radio Suffolk launches.\n** 27 August – BBC Radio 5 begins broadcasting on BBC Radio 2's MW frequencies. BBC Radio's sports coverage transfers to the new station from Radio 2 and educational and children's programmes transfer from Radio 4 FM. Consequently, BBC Radio 2 becomes the first national BBC station to broadcast exclusively on FM and the full BBC Radio 4 schedule becomes available on FM for the first time.\n** 5 September – The new BBC building at White City opens.\n* 1991\n** 7 January – The BBC East Midlands region is created and the first edition of East Midlands Today is broadcast.\n** 16 January – Radio 4 News FM starts Gulf War broadcasts on BBC Radio 4 FM frequencies.\n** 16 February – BBC1 and BBC2 receive new idents generated from laserdisc, BBC1 with a '1' encased in a swirling globe, and BBC2 with eleven idents based around the numeral '2'.\n** 2 March – Radio 4 News FM closes and BBC Radio 4 returns to FM.\n** 11 March – The BBC launches its first global television station – BBC World Service Television. In Europe it replaces BBC TV Europe.\n** March – After nearly eight years on air, BBC Radio Gwent closes.\n** 1 April – The BBC becomes the statutory authority for issuing television licences, assuming the responsibility of licence fee collection and enforcement.\n** 15 April – The World Service Television News service is launched. Unlike World Service radio which is funded by direct grant from the Foreign and Commonwealth Office, WSTV is commercially funded and carries advertising, which means that it cannot be broadcast in the UK.\n** 1 May – BBC Radio 1 begins 24-hour transmission, but only on FM – Radio 1's MW transmitters still close down overnight, between 12 midnight and 6am.\n** 31 July – The BBC's Lime Grove Studios close.\n** 31 August – BBC television starts officially broadcasting in stereo using the NICAM system after five years of test stereo broadcasts.\n** 16 September – The main BBC Radio 4 service moves from long wave to FM as FM coverage has now been extended to cover almost all of the UK – Radio 4 didn't become available on FM in much of Scotland and Wales until the start of the 1990s. Opt-outs are transferred from FM to long wave.\n** 14 October – World Service TV launches its Asian service.\n** 14 November – BBC Radio Surrey launches.\n* 1992\n** 21 January –\n***BBC Select is launched as an overnight subscription service.\n***BBC Radio Berkshire launches, initially as a sister station of Radio Oxford, broadcasting for part of the weekday and weekend mornings.\n** 29 February – BBC Radio 3 ceases broadcasting on medium wave (AM).\n** 17 April – BBC Radio Nottingham ends transmissions on one of its MW transmitters. BBC Radio Cleveland, BBC Radio Northampton and BBC Radio Oxford also stop broadcasting on MW.\n** 1 November – The satellite TV channel UK Gold, run by the BBC with Thames Television, starts broadcasting.\n** BBC Local Radio stations start broadcasting the BBC World Service rather than BBC Radio 2 when not on air.\n* 1993\n** 5 April – BBC Radio Bedfordshire expands to cover the counties of Buckinghamshire and Hertfordshire and is renamed BBC Three Counties Radio.\n** 13 April – For the first time all BBC News programmes have the same look following a relaunch of all of the main news bulletins.\n** 26 April – BBC Dorset FM launches as an opt-out service from BBC Radio Devon.\n** Autumn – BBC GLR stops broadcasting on MW. Also, BBC GMR stops broadcasting on MW.\n** October – BBC Radio Clwyd closes, although news opt-outs continue until 2002.\n** BBC Research & Development is formed from the merger of the BBC Designs Department and the BBC Research Department.\n* 1994\n** 27 March – BBC Radio 5 ends transmission.\n** 28 March – At 5&nbsp;am, BBC Radio 5 Live, a dedicated news and sport network, starts broadcasting.\n** 13 April – First BBC website created for the BBC2 series The Net. This is followed a month later by the launch of the subscription-based BBC Networking Club.\n**23 May – The BBC2 youth strand DEF II comes to an end after six years.\n** 1 July – BBC Radio 1 ceases broadcasting on medium wave (AM) at 9am.\n** July – Arabic Television television service launched with funding from the Saudi Arabian Mawarid Group.\n** 1 August – BBC Radio Surrey and BBC Radio Sussex merge to form BBC Southern Counties Radio.\n** 19 September – BBC2 launches a weekday afternoon business, personal finance and consumer news programme Working Lunch, which broadcasts for 42 weeks per year.\n* 1995\n** 16 January – BBC World Service Television was renamed as BBC World it was launched as an international free-to-air news channel on 26 January at 19:00 GMT.\n** 30 January – BBC Prime launches as a local encrypted variety and light entertainment channel by BBC Enterprises.\n** May – BBC CWR closes as a stand-alone station and becomes an opt-out of BBC Radio WM.\n** 27 September – The BBC begins regular Digital Audio Broadcasting, from the Crystal Palace transmitting station.\n** 9 October – BBC Learning Zone is launched, broadcasting education programmes all night on BBC2. It replaces BBC Select and Night School.\n** BBC Enterprises, the BBC's commercial arm, is restructured as BBC Worldwide Ltd.\n* 1996\n** March – BBC Dorset FM closes and is replaced by a rebroadcast of BBC Radio Solent with localised news bulletins.\n** 9 April – BBC Radio Oxford and BBC Radio Berkshire merge to form BBC Thames Valley FM.\n** 21 April – Arabic Television closes down when the Saudi backer pulls out following a row over coverage of the execution of a princess accused of adultery.\n**4 May – Radio 3 commences 24-hour transmission.\n** 9 May – The BBC announces its plans for digital television. They include a free-to-air news channel, widescreen versions of BBC1 and BBC2, \"side channels\" which will broadcast extra programmes related to what is on the main channels and several paid-for channels featuring programming from the BBC archives.\n** June – Radio 1 starts live streaming on the internet.\n** 7 June – The BBC is restructured by the Director-General, John Birt. In the new structure BBC Broadcast will commission programmes, and BBC Production will make them.\n** 13 October – BBC Television's long standing coverage of Formula One ends following ITV's acquisition of the rights from 1997 onwards (Formula One returns to the BBC in 2009). This is one of several high-profile sports rights that the BBC loses at around this time. These include losing the rights to the FA Cup and England football internationals to ITV and England rugby union internationals to Sky.\n** 4 November – The Asian Network expands into a full-time station when it increases the number of hours on air from 80 hours a week to 126 hours a week (18 hours a day). The station, which broadcasts on the MW frequencies of BBC Radio Leicester and BBC Radio WM, is renamed BBC Asian Network. Consequently, Radios Leicester and WM become FM only stations.\n** 29 December – What was billed as the last episode of Only Fools and Horses before the new millennium is watched by 24.35 million viewers, the largest ever TV audience for a sitcom.\n** During 1996, www.bbc.co.uk becomes the home of the corporation's online activities.\n* 1997\n** The BBC broadcasts the much praised \"Perfect Day\" corporate advertisement, featuring 27 artists singing lines of Lou Reed's original. The song later becomes a fund-raising single for Children in Need.\n** 28 February – The BBC sells its transmitters and transmission services to Castle Transmission Services for £244 million, to help fund its plans for the digital age.\n** 4 March – The BBC and Flextech agree on a deal to provide several BBC-branded channels – BBC Showcase, for entertainment; BBC Horizon, for documentaries; BBC Style, for lifestyle; BBC Learning, for schools, and BBC Arena, for the arts – plus three other channels: BBC Catch-Up, for repeats of popular programmes within days of their original transmission, a dedicated BBC Sport channel and a TV version of Radio 1.\n** 6 September – The funeral of Diana, Princess of Wales is broadcast on BBC Radio & Television and aired to over 200 countries worldwide.  Nearly 3 billion viewers and listeners watch the ceremonies. In the US, the BBC's coverage is aired on A&E and C-SPAN Cable Networks. David Dimbleby hosts the coverage with Tom Fleming narrating the service inside Westminster Abbey.\n** 4 October – New corporate identity adopted. At a reported cost of £5m the new logo was introduced due to the increase in digital services, as it is designed to be more visible at small size it is better suited for use in websites and on screen \"DOGs.\" On Screen Identities changed, with BBC One adopting the Balloon Idents, and BBC Two retaining their 2's used from 1991, with new legend.\n** 4 November – BBC News Online, a web-based news service, launches.\n** 9 November – BBC News 24, the corporation's UK television news service, launches at 17.30, and is shown on BBC One through the night during closedown.\n** December – BBC Online is officially launched.\n* 1998\n** 25 January – Sunday Grandstand becomes a year-round programme. Previously it had only broadcast between May and September.\n** March – The BBC closes the BBC Radiophonic Workshop, 40 years after it had first been established to create sound effects for BBC programmes.\n** August – The BBC's domestic TV channels become available on Sky Digital's satellite service. An unintended consequence of this is that people in the rest of Europe can now watch BBC One and Two, using viewing cards from the UK, as the signal is encrypted for rights reasons. This applies even within the UK: people in England can now watch BBC channels from Scotland, Wales and Northern Ireland, and vice versa.\n** 23 September –\n***The BBC launches BBC Choice, its first new TV channel since 1964, available only on digital TV services. However viewers can only watch the launch online due to digital receivers not being on sale to the general public.\n***Following its purchase of the cable-only Parliamentary Channel, the BBC launches BBC Parliament on digital satellite and analogue cable with an audio feed of the channel on DAB.\n** 15 November – The public launch of digital terrestrial TV in the UK takes place. Consequently, BBC Choice is now viewable by the general public via their television sets which have digital equipment.\n** BBC Radio 5 Live replaces the BBC World Service as BBC Local Radio's overnight downtime filler.\n* 1999\n**BBC 648, which provided French and German language content for northern Europe from the Orfordness transmitting station, ends with the closure of the BBC's German service. – the French for Europe service had closed in 1995. Consequently, all programming from this transmitter was in English only.\n** 10 May – BBC network news is relaunched with new music, titles and a red and ivory set. This design was used for the 25 October relaunch of News 24, enhancing cross-channel promotion of the service.\n** 1 June – BBC Knowledge starts broadcasting on digital services.\n** 20 June – The BBC broadcasts live cricket for the final time when it shows live coverage of the 1999 Cricket World Cup Final, bringing to an end of sixty years of continuous cricket coverage on the BBC. The terrestrial rights transfer to Channel 4.\n** 23 September – BBC Text is launched, initially on digital terrestrial services before being rolled out onto satellite and cable platforms.\n** 31 December – BBC One airs live coverage of millennium celebrations from Britain and all around the world in 2000 Today''. The presenting team is led by David Dimbleby, Michael Parkinson and Gaby Roslin.\n2000s\n* 2000\n** 14 February – BBC Thames Valley FM closes and BBC Radio Oxford and BBC Radio Berkshire relaunch as separate stations although Radio Berkshire operates as an opt-out service of Radio Oxford.\n** 25 March – BBC GLR closes and is relaunched as BBC London Live 94.9.\n** 20 May – Due to the loss of many major sports rights in recent years, the BBC does not broadcast this week's edition of Grandstand – ITV was showing the FA Cup Final. Apart from when Christmas Day fell on a Saturday or a major national event taking place, this had been the first time that Grandstand had not been broadcast on a Saturday afternoon since the programme's inception in 1958.\n** 15 September – Final edition of Breakfast News on BBC One and BBC News 24, the last conventional news broadcast in the morning.\n** 2 October – The first edition of BBC Breakfast is broadcast, the new morning show on BBC One and News 24 from 6:00–9:30. (9:00 on BBC News 24).\n** 13 October – Final edition of the ''BBC Nine O'Clock News on BBC One.\n** 16 October – The BBC Ten O'Clock News'' launches on BBC One amid controversy, having been moved from 9pm to cash in on the axing of ITN's News at Ten the previous year.\n** 16 October – Oxfordshire, once part of the South East, becomes part of South Today.\n* 2001\n** 3 March – A bomb explodes outside Television Centre. The blast was later attributed to dissident Irish Republican terrorists and it is suggested the BBC Panorama programme which named individuals as participants in the Omagh bomb was the motive.\n** 30 March – The national variations of BBC Choice are discontinued in favour of introducing regional opt-outs on BBC Two to digital services, which are introduced later in the year.\n** 3 September – As part of a major reorganisation of the BBC's south east region, Kent and Sussex get their own news programme, South East Today, replacing Newsroom South East.\n** 1 October – BBC London News is launched as a London-only news programme.\n** October – BBC Three Counties Radio launches opt-out programming for the county of Buckinghamshire.\n** 5 November – BBC 2W is launched, broadcasting on digital services in Wales on weekday evenings.\n** 19 November – Last showing of the then-current BBC Two idents. These set of idents would have ended in 1997 with BBC One's ident change but due to popularity the 1991 idents continued only with a new BBC logo and some newer ident sets. The new idents were ivory 2's, interacting in a yellow world, with the purple box logo, the first BBC channel to have one.\n** November –  BBC Text is renamed BBCi which is conceived as being a cohesive multi-platform brand name for all the BBC's digital interactive services, encompassing the corporation's digital teletext, interactive television and website services.\n* 2002\n** 2 February – BBC Radio 5 Live Sports Extra is launched.\n** 11 February – The CBBC and CBeebies channels begin broadcasting.\n** 2 March – BBC Four is launched at 19:00 in a simulcast with BBC Two. It replaces BBC Knowledge.\n** 11 March – BBC 6 Music is launched.\n** 29 March – BBC One rebrands with the controversial Rhythm and Movement Idents, including dancers in red dancing in different locations. The red box logo was also used for these idents. For the first time in 39 years, a globe is not included in the presentation.\n** 16 August – BBC Radio 1Xtra is launched.\n** 9 September – The BBC transfers its England regional current affairs programming from BBC Two to BBC One and launches a new programme called Inside Out. The series, which is broadcast for roughly half the year and in blocks spread across the year, focuses on stories from the local area of each BBC region, It replaces a number of different titles previously used on BBC Two.\n** 28 October – BBC Asian Network launches as a national station.\n** 30 October – BBC Parliament launches on digital terrestrial television, having previously only been available as an audio-only service. However capacity limitations mean that the picture is squeezed into just one quarter of the screen.\n** 11 November –\n*** The first edition of East Yorkshire and Lincolnshire edition of BBC Look North is broadcast, while the Leeds-based Look North programme now covers West, North and South Yorkshire and the North Midlands.\n*** BBC Radio Swindon outputs from the renamed BBC Radio Wiltshire begin.\n** 15 December – BBC Radio 4 Extra is launched as BBC7.\n* 2003\n** 9 February – BBC Three is launched at 19:00 in a simulcast with BBC Two. It replaces BBC Choice.\n** 8 December – BBC News 24 is relaunched with a new set and titles, as well as a new Breaking News sting. Networked news on BBC One and Two remains with the same titles though the set was redesigned in a similar style to that of News 24.\n* 2004\n** 28 January – Publication of the Hutton Inquiry, and subsequent resignation of the Chairman Gavyn Davies.\n** 30 January – Resignation of the Director General, Greg Dyke. Mark Byford takes over as acting Director General.\n** 16 February – Network news titles are relaunched in the style of BBC News 24, introduced two months earlier.\n** 6 May –  The BBC website is renamed bbc.co.uk, after the main URL used to access the site.\n** 17 May – Appointment of Michael Grade as new chairman.\n** 21 May – Appointment of Mark Thompson as new Director General.\n** June – The BBC North region is fully split to form the BBC Yorkshire and North Midlands region and the BBC Yorkshire and Lincolnshire region.\n** 1 October – BBC Technology, incorporating the BBC's Broadcast Engineering division, is sold to Siemens Business Services for approximately £200m, and a £2bn, 10-year outsourcing contract.\n*2005\n** 20 March – Mark Thompson announces staff of 27,000 to be cut by 3,780.\n** 26 March – Doctor Who returns to the air, sixteen years after the last full series was broadcast.\n** 23 May – Over one third of staff join strike in response to job cuts, dropping programmes.\n** 1 August – BBC Broadcast, formerly Broadcasting & Presentation and responsible for the playout and branding of all BBC Channels, is sold to Creative Broadcast Services, owned by the Macquarie Capital Alliance Group and Macquarie Group. It is renamed Red Bee Media on 31 October.\n** 3 November – BBC CWR returns as a stand-alone station.\n** December – The Czech and Polish sections of the BBC World Service cease to exist. Eight other sections are to follow soon.\n* 2006\n** 3 April – BBC GMR changes its name back to BBC Radio Manchester.\n** 23 April – The \"Radio 4 UK Theme\" is used for the final time. It is replaced by a news bulletin.\n** 27 May – The BBC's first scheduled HDTV broadcast on BBC HD\n** 14 August – The One Show is first broadcast on BBC One, initially as a four-week trial. It is seen as a modern-day version of highly popular series Nationwide with the programme resulting in popular journalism returning to BBC One's early evening schedule. The programme returned on a permanent basis the following July.\n** 1 September – BBC Entertainment replaces BBC Prime in global markets.\n** 7 October – BBC One rebrands from the Rhythm and Movement idents to the \"Circle\" Idents.\n**13 November – BBC Parliament broadcasts in full screen format for the first time on the Freeview service, having previously only been available in quarter screen format. The BBC eventually found the bandwidth to make the channel full-screen after receiving \"thousands of angry and perplexed e-mails and letters\", not to mention questions asked by MPs in the Houses of Parliament itself\n** 28 November – Resignation of Chairman Michael Grade, to join ITV.\n** 16 December – After more than 35 years, BBC Two airs the final Open University course-related television broadcast. With Open University course content now available through media such as podcasts and DVDs it is deemed no longer necessary for the programmes to be aired on television. However, the Open University continues to make programming for a broader audience, with series including Coast and Child of Our Time.\n** 31 December – The BBC's then-current Royal Charter and Agreement expires.\n* 2007\n** 22 January – BBC News 24 is relaunched with new titles and new Astons.\n** 28 January – The final edition of Grandstand is broadcast.\n** 18 February – BBC Two rebrands from the yellow 2's, to the Window on the World 2's.\n** July – BBC Knowledge launched as a global channel by BBC Worldwide.\n** 11 August – BBC Radio Cleveland is rebranded as BBC Tees due to its broadcasting area no longer being associated with the name Cleveland.\n** 3 September – CBBC identity relaunched, with its third marketing campaign since the launch of the CBBC Channel.\n** 20 October – BBC Switch, a teenage block of shows is launched to cater for the under-served 12- to 16-year-olds, launches.\n** 1 December – BBC HD channel is officially launched after around eighteen months of trial broadcasts.\n** 3 December – BBC Somerset Sound is rebranded as BBC Somerset and becomes available on FM for the first time.\n** 25 December – BBC iPlayer, an online service for watching previously aired shows, is launched.\n* 2008\n** 12 February – BBC Three has its identity relaunched, showcasing new shows such as Lily Allen and Friends.\n** 11 March – BBC Arabic Television launches.\n** 21 April – BBC News 24 and BBC World are renamed BBC News and BBC World News respectfully.\n** 19 September – BBC Alba, a Scottish Gaelic language digital television channel, launched through a partnership between BBC and MG Alba.\n** The BBC gradually drops the BBCi name from its digital interactive TV services also, replacing it with the name BBC Red Button.\n* 2009\n** 2 January – BBC 2W closes.\n** 14 January – The BBC's Persian language TV channel is launched.\n** 30 March – BBC Southern Counties Radio closes resulting in the return of BBC Surrey and BBC Sussex as stand-alone separate stations.\n** 4 April – BBC Radio Swindon, which had opted out of BBC Radio Wiltshire, is closed. The two stations are merged as BBC Wiltshire.\n2010s\n*2010\n**19 February – EastEnders celebrates 25 years with a special live edition, where the murderer of Archie Mitchell is revealed. Over 16 million viewers tuned in to find Stacey Slater to be the killer.\n**31 March – BBC One Wales's analogue system shuts down after 58 years.\n**30 July – BBC Two broadcasts its final Working Lunch.\n**3 November – BBC One HD; a high-definition simulcast of a national version of BBC One is launched across all digital platforms.\n** 18 December – BBC Switch is switched off.\n** After 44 years, the final edition of The Money Programme is broadcast on BBC Two.\n*2011\n**27 March – Due to budget cuts, transmission of the BBC World Service on 648&nbsp;kHz MW ends. The transmissions, from the Orfordness transmitting station in Suffolk, had been on air since 1982 and had provided coverage of the World Service to much of northern Europe.\n**2 April – BBC7 is relaunched as BBC Radio 4 Extra.\n*2012\n**7 March – Brighton moves from South region, to South-East region, after the Meridian digital switch-over.\n**May – BBC Somerset launches as a full-time station.\n**12 July – The BBC World Service relocates to Broadcasting House after 70 years at Bush House.\n**27 July-12 August – The 2012 Summer Olympics take place and with the exception of news programming BBC One is devoted entirely to live coverage of the Games and BBC Radio 5 Live operates a temporary station – 5 Live Olympics Extra – to provide additional coverage of the Games.\n**17 August – BBC Radio Kent, BBC Radio Lincolnshire, BBC Radio Merseyside and BBC Radio Nottingham stop broadcasting regular programmes on medium wave. It is part of a five-week trial to find out if listeners will miss or complain about the lack of AM services. At the end of the trial, the BBC decides that BBC Radio Nottingham's MW transmitter and Radio Kent's relay at Rusthall near Tunbridge Wells, will remain off-air.\n**17 September – George Entwistle is appointed as Director-General.\n**3 October – Broadcast of Exposure: The Other Side of Jimmy Savile which uncovered allegations of sexual abuse by Jimmy Savile.\n**23 October –\n***The BBC's teletext service Ceefax is switched off following all regions switching to digital broadcasting. The very last Pages from Ceefax transmission had taken place two days earlier.\n***BBC One Northern Ireland commences broadcasting in HD.\n**10 November – George Entwhistle resigns as Director-General, to be replaced temporarily by Tim Davie. Entwistle's 54-day tenure as Director-General is the shortest in the corporation's history.\n**14 November – 90th anniversary broadcast at 17:33.\n**22 November – Tony Hall is announced as the new Director-General, taking the post in March 2013.\n**21 December – Children's Programmes air on BBC One for the last time.\n**At the end of 2012 the BBC loses the rights to show horse racing. This brings to an end a relationship between the BBC and televised horse racing which dates back to the 1950s.\n*2013\n**4 January – Children's Programmes air on BBC Two for the last time.\n**7 January – The debut of a national networked evening programme on BBC Local Radio, hosted by former Classic FM presenter Mark Forrest. The show, introduced as part of cost-cutting measures, replaces all local programming, apart from local sport coverage.\n**14 January – BBC One Scotland commences broadcasts in HD.\n**29 January – BBC One Wales commences broadcasts in HD.\n**26 March – BBC Two commences broadcasting in HD following the closure of BBC HD.\n**31 March – BBC Television Centre closes in Shepherd's Bush with the majority of TV services moved to Broadcasting House in central London.\n**2 April – Tony Hall, Baron Hall of Birkenhead becomes the new Director-General.\n**5 April – BBC Monitoring moves to Licence Fee funding.\n**8 July – After eight years, BBC Local Radio returns to Dorset when a breakfast show for the county, as an opt-out from BBC Radio Solent, is launched.\n**25 October – The BBC hosts 100 Women, a day of debate and discussion across radio, television and online featuring a hundred women from around the world.\n**10 December – HD broadcasts begin for BBC Three, BBC Four, BBC News, CBBC and CBeebies.\n*2014\n**The BBC broadcasts the much praised \"God Only Knows\" corporate advertisement, featuring 21 artists singing lines of The Beach Boys' original. The song also became a fund-raising single and an advertisement for BBC Music for the first time since \"Perfect Day\" in 1997 for Children in Need.\n**6 March – The BBC announce that BBC Three will become internet-only from February 2016, in an effort to save £90m. Their plans were approved on 26 November 2015\n**30 August – Rona Fairhead becomes the first woman to be appointed as Chair of the BBC Trust.\n*2015\n**6 October – After 27 years, the name BBC Radio London returns to the airwaves following a name change from BBC London 94.9.\n*2016\n**16 February – BBC Three closes as a linear channel and becomes an over-the-top Internet television service although all of the long-form programmes commissioned for BBC Three are to be shown at a later date on BBC One.\n**19 February – BBC Radio Bristol stops broadcasting on MW following the sale of the land on which the transmitter was located, to developers.\n**31 March – BBC Three fully closes down on all digital television platforms – it had carried promotional information regarding the BBC Three internet service since 16 February.\n**11 April – CBBC extends its broadcast hours from 7pm to 9pm, using capacity which had previously been used by BBC Three.\n*2017\n** 20 March – The final edition of Crimewatch is broadcast on BBC One. The programme ends as a monthly evening programme after nearly 33 years on air although it isn't until October that its cancellation is confirmed when it is announced that its daytime spin-off series Crimewatch Roadshow (now Crimewatch Live) would continue to air.\n**2 April – The BBC Trust is closed at the expiry of the 2007 Royal Charter, which had a 10-year lifespan. The Trust is replaced by the BBC Board.\n*2018\n**15 January – The MW transmissions of BBC Radios Sussex, Surrey, Humberside, Wiltshire, Nottingham, Kent and Lincolnshire end and MW coverage for BBC Devon, Lancashire and Essex is reduced. Altogether a total of 13 MW transmitters are switched off.\n** 28 January – After nearly 78 years on air, The Sunday Hour is broadcast on BBC Radio 2 for the final time.\n** 29 January – BBC Radio Cymru 2 began broadcasting at 6:30&nbsp;am on 29 January 2018. It airs as an opt-out service from 7 to 9&nbsp;am on Mondays–Saturdays and from 7 to 10&nbsp;am on Sundays.\n** 8 May – Another long-running BBC Radio 2 programme ends when, ahead of schedule changes, The Organist Entertains is broadcast for the final time after 49 years on air.\n** 24 October – The FM frequency of BBC Radio 3 at more than 30 relay transmitters in Wales is reallocated to BBC Radio Wales. Consequently, the reach of Radio Wales on FM increases from 79% to 91% but Radio 3's FM availability in Wales falls to 92%.\n** 1 November – BBC Sounds is launched.\n** 29 November – HD versions of BBC Two Wales and BBC Two Northern Ireland start broadcasting.\n*2019\n**17 February – Ahead of the launch of BBC Scotland, BBC Two Scotland closes.\n**19 February – Virgin Media becomes the first platform to stop broadcasting some BBC channels in standard definition when it removes the standard definition feeds of BBC Four, BBC News, CBBC and CBeebies.\n**24 February – BBC Scotland launches. It broadcasts between 7:00&nbsp;p.m. and midnight and includes an hour-long 9:00&nbsp;p.m. newscast called The Nine. Between noon and 7:00&nbsp;p.m., the channel simulcasts BBC Two but with BBC Scotland continuity, thereby accommodating the daytime sport and politics programming opt-outs which had been displaced following the closure of BBC Two Scotland.\n2020s\n*2020\n**15 January – The BBC announces a further switching off of MW transmitters. The switch-offs, being done as a cost-cutting measure, see the end of MW transmissions of Radios Cornwall, Newcastle, Merseyside, Solent, BBC Three Counties Radio and BBC Radio York. Also, BBC Radio Cumbria stops broadcasting on MW in Whitehaven and BBC Radio Norfolk's Norwich MW transmitter goes silent. In addition, BBC Radio Scotland stops broadcasting on MW in Aberdeen and BBC Radio Wales loses some MW coverage in central Wales. The transmitters broadcast a retune advice loop prior to full switch-off in early April.\n**15 July – BBC One Wales and BBC Two Wales transmission and presentation comes from the new BBC Wales headquarters building for the first time, the first broadcast to come from the building, replacing the presentation suites at Broadcasting House, Cardiff.\n**25 July – BBC Cymru Wales's new headquarters building broadcasts its first radio programmes on BBC Radio Cymru.\n** 28 July – The BBC axes the teatime edition of Newsround after 48 years after concluding that the typical child no longer turns on traditional television channels when they return home from school. They will focus on the morning edition instead which will be aimed at schools, where it is often used by teachers in classrooms, in addition to investing in the programme's website.\n**1 September – Tim Davie becomes the new Director-General.\n**28 September – BBC Wales Today and Newyddion are broadcast from their new studios in Central Square, Cardiff for the first time, completing BBC Cymru Wales's move from their old headquarters at Broadcasting House, Cardiff.\n**9 October – BBC Radio 1 Dance launches. It is the BBC's first full time radio service to be broadcast exclusively online, and is available only via BBC Sounds.\n** 7 December – BBC Radio Bradford launches, broadcasting on the MW frequency of BBC Radio Leeds each weekday between 6&nbsp;am and 2&nbsp;pm.\n* 2021\n**15 January – Launch of BBC Radio Wolverhampton on DAB, a station broadcasting to Wolverhampton until 31 March between 6&nbsp;am and 2&nbsp;pm.\n**18 January – Launch of BBC Radio Sunderland, on DAB, a station broadcasting to Sunderland until 31 March between 6&nbsp;am and 2&nbsp;pm.\n**2 March – The BBC confirms that BBC Three will be relaunched as a television channel in January 2022, six years after going online.\n**15 April –\n***The BBC confirms that more BBC Local Radio stations will switch off their mediumwave frequencies during May and June 2021. The stations that will no longer be available on AM are BBC Essex, BBC Radio Cambridgeshire, BBC Radio Devon, BBC Radio Leeds, BBC Radio Sheffield, BBC Hereford & Worcester, BBC Radio Stoke and BBC Radio Lancashire.\n***The BBC launches its second online station – BBC Radio 1 Relax.\n**6 May – BBC Radio Ulster and BBC Radio Foyle stop broadcasting on MW.\n**20 October – The BBC launches a new 'modernised' appearance, including new logo and idents, to provide a better experience for customers in response to research conducted a year ahead of the BBC's 100th Anniversary. The new logo which increases the spaces between the boxes again replaces the Gill Sans font (used since 1997) with Reith Sans, bringing it in line with the rest of the BBC brand.\n* 2022\n**10 January – BBC Three begins test broadcasts ahead of its linear relaunch on 1 February.\n**1 February – BBC Three relaunches as a television station, six years after it became an online only service.\n** 13 July – Dedicated evening continuity for BBC One viewers in Northern England launches but it is not accompanied by any additional north-specific programming and there is no special on-screen BBC North branding.\n* 2023\n**22 March and 26 April – The roll-out of regional BBC One takes place, in two parts.\n** 3 April – The BBC News Channel closes as a stand-alone channel. It merges with BBC World News to form a single worldwide news channel called BBC News with programmes based on BBC World News output although the ability to break away from international programming for a major UK news story is to be retained. The weekday simulcasts of the BBC One news bulletins and BBC Breakfast continue to be shown on the channel and a simulcast of Newsnight is launched.\n** 14 August – The BBC's Maida Vale Studios, which have been the venue for performances by artists including The Beatles and Adele, are sold to a group led by composer Hans Zimmer.\n** September – Test Match Special ends on Radio 4 long wave after 30 summer seasons of cricket commentary on that frequency.\n*2024\n**8 January – The BBC stops broadcasting in standard definition on satellite.\n** 7 February – The BBC announces plans to launch four new radio stations on DAB+, including a Radio 2 spin-off playing music from the 1950s, 60s and 70s, and a Radio 1 spin-off playing music from the 2000s and 2010s.\n**31 March – Radio 4's long wave opt-outs end. Yesterday in Parliament and The Daily Service move to BBC Radio 4 Extra and Shipping Forecasts are reduced from four bulletins to two on weekdays and three at the weekend. The opt-outs end ahead of an intention to end Radio 4's long wave broadcasts.\n** 15 April – BBC Radio 4 switches off its medium wave frequencies. They had been used to provide reception on AM where the long wave signal was weak, such as in London, Northern Ireland and south west England. It broadcast a retune loop informing listeners to retune to other ways of reception.\n** 4 November – BBC Radio 3 Unwind, a radio station playing relaxing classical music, launches.\n** 8 November – Radio 1 Anthems launches on BBC Sounds, joining an enhanced Radio 1 Dance which commenced earlier this year.\n** 18 November - A man in his 20s accuses the former BBC newsreader Huw Edwards of trying to groom him when he was 18 years old.\n*2025\n**24 March - BBC Radio 4 expands its weekday broadcast hours and now begins broadcasting 20 minutes earlier, at 05:00 with a news bulletin replacing News Briefing. Yesterday In Parliament returns to Radio 4, airing at 05:04, and the Shipping Forecast moves to 05:34. Weekend programmes continue to start at 05:30.\n** 11 September –  BBC Radio 1 Dance, BBC Radio 1 Anthems and BBC Radio 3 Unwind launch on DAB+.\nSee also\n* Timeline of BBC One\n* Timeline of BBC Two\n* Timeline of non-flagship BBC television channels\n* Timeline of the BBC News Channel\n* Timeline of BBC Parliament\n* Timeline of the BBC Television Service\n* Timeline of BBC Local Radio\n* Timeline of BBC Radio 1\n* Timeline of BBC Radio 2\n* Timeline of BBC Radio 3\n* Timeline of BBC Radio 4\n* Timeline of BBC Radio 5 Live\n* Timeline of BBC Radio London\n* BBC Archives\nReferences\nExternal links\n*[https://www.bbc.com/historyofthebbc History of the BBC]"
    }
  ]
}