{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Islamic State (2015)\n\nThis article contains a timeline of events from January 2015 to December 2015 related to the Islamic State (IS). This article contains information about events committed by or on behalf of the Islamic State, as well as events performed by groups who oppose them.\nTimeline\nJanuary 2015\nIS's official spokesman Abu Muhammad al-Adnani released an audio statement in which he accepted the earlier pledge of allegiance and announced the expansion of IS's caliphate with the creation of Wilayat Khorasan (Khurasan Province), a historical region incorporating parts of modern-day Afghanistan and Pakistan. Hafiz Khan Saeed was appointed as its local leader, or Wāli (Governor). Abdul Rauf was named as Khan's deputy, however he was killed by a US drone strike in Afghanistan several weeks later.\n* 4 January: IS troops attacked Saudi Arabia again, near the border city of Arar, Saudi Arabia, killing four Saudi border guards. Four IS militants were also killed in the clashes.\n* 5 January: In Kobanî, Kurdish YPG units captured the governmental and security district and the al-Refia, al-Sena'a, al-Tharura, and al-Banat schools. YPG also advanced in the Mishtanour neighbourhood south of the town. According to SOHR, the YPG now controls at least 80% of Kobanî. At least 14 IS militants were killed in the clashes.\n* 6 January: A female suicide bomber detonated her vest at a police station in Istanbul's central Sultanahmet district, the perpetrator was identified as Diana Ramazova, a Chechen-Russian citizen from Dagestan. Turkish police are currently investigating Ramazova's possible links to al-Qaeda or the Islamic State. Further investigation revealed that suspect had photos with insurgents from IS\n* 10 January: Suicide bombing in the Tripoli café in Lebanon kills 9 and wounds 30. It is initially attributed to IS militants, though other reports claim that only the al-Nusra Front is responsible.\n* 12 January: IS battles for the town of Gwer, which was re-taken by Iraqi forces in August 2014. IS kills 30 Kurds in the conflict, despite US-led Coalition airstrikes. IS kidnapped 21 Christians in Tripoli, Libya.\n* 13 January: Someone claiming to represent IS hacked U.S. Military's Twitter account and threatened vengeance on American soldiers for the US's intervention against IS, and inserted a video that warned IS about a U.S Military attack. IS affiliate group, Ansar Beit al-Maqdis, claimed to have kidnapped and killed an Egyptian police officer, Ayman al-Desouky.\n* 14 January: Christopher Lee Cornell, an alleged IS sympathiser, was arrested for plotting to bomb the US Capitol.\n* 15 January: 2 suspected terrorists linked with IS were shot dead by Belgian police and another wounded in the Belgian town of Verviers, during an anti-terrorist raid.\n* 17 January: Fighting broke out in the Syrian town of Al-Hasakah between Syrian government forces and Kurdish militia, namely the People's Protection Units (YPG). The two sides, having previously coexisted and having focused on other enemies, clashed when government forces took control of buildings understood to be demilitarised, according to the SOHR.\n* 18 January: Israel arrests 7 Arabs who admitted being IS members. The allegation was that they were caught just before executing an attack and were practising on animals how to behead people.\n* 19 January: A Canadian special forces commander said that Canadian snipers \"neutralized\" IS militants in Iraq, after \"advisers\" operating at the front lines of the conflict came under fire. Also, in Kobanî, YPG fighters fully recaptured the Mistanour Hill south of Kobanî, killing 11 IS militants. By recapturing this hill, the YPG controlled the IS supply routes to Aleppo and Raqqa. By that time, IS control ofKobanî was reduced to 15%. Additionally, Syrian government loyalists and Kurdish fighters in Al-Hasakah reached a cease-fire, although sporadic clashes continued.\n* 20 January: IS threatens to kill two Japanese hostages, Kenji Goto Jogo, a journalist, and Haruna Yukawa, a military company operator, unless a ransom of 200 million USD is paid.\n* 21 January: Kurdish Peshmerga fighters began a planned operation to capture Mosul, liberating multiple villages neighbouring Mosul, and disrupting essential IS supply routes between Mosul, Tal Afar, and Syria. Also, U.S. airstrikes were conducted to assist the Kurdish Peshmerga fighters prior to and during the liberation operation. An estimated 200 IS fighters were killed on the first day of the clashes. The Peshmerga also positioned themselves on three fronts near Mosul. U.S. airstrikes near the Iraqi towns of Sinjar, Kirkuk, and Ramadi destroyed ISIä heavy weaponry and killed an unknown number of fighters.\n* 23 January: Kurdish forces reported firing 20 Grad missiles into Mosul, upon receiving intelligence that IS militants were gathering to meet near the city's Zuhour neighbourhood. Firing from about  north of Mosul, Captain Shivan Ahmed said that the rockets hit their targets. IS claimed that the rockets also hit civilians.\n* 24 January: The Lebanese Army repelled another joint IS–al-Nusra incursion near Arsal, leading to the deaths of 5 Lebanese soldiers.\n* 25 January: IS published a video declaring the execution of Haruna Yukawa, and have revised their demands. They no longer seek the $200 million USD ransom; instead, they demand the release of Sajida Mubarak Atrous al-Rishawi in exchange for Kenji Goto and Muath al-Kasasbeh, a Jordanian fighter pilot. Also, the village of Mamid was recaptured by YPG and FSA fighters. IS lost 12 militants and a vehicle in the clashes. On the same day, YPG fighters cut the IS supply route to Kobanî, forcing IS into retreat.\n* 25 January: 392 Special Action Force (SAF – a unit of the Philippine National Police) commandos have been engaged to hunt Malaysian bomb-maker and Jemaah Islamiyah leader Zulkifli bin Hir, known as Marwan, and Filipino bomb maker Abdul Basit Usman. Both of them 2 most wanted terrorists protected by the Bangsamoro Islamic Freedom Fighters (BIFF)a Muslim insurgent group which pledged allegiance to IS in 2014. One of the SAF teams raided the hut where they believed Marwan was located and succeeded to kill him. The commandos were retreating from the assault on their targets when they came under fire from members of the BIFF. In maneuvering away from the BIFF assault, they strayed into territory controlled by the MILF (another Muslims insurgent group which signed peace agreement with Philippinas Government) several kilometers away, and a \"misencounter\" ensued, resulting in the death of 44 Police troopers killed in action and 16 wounded. At least 18 MILF fighters were killed and 5 BIFF fighters.\n* 26 January: The YPG, with some assistance from US airstrikes, forced remaining IS forces in the city of Kobanî to retreat, and the YPG managed to enter the eastern outlying areas, thus fully recapturing the city of Kobanî. However, IS resistance persists in the eastern outskirts of Kobanî, and the surrounding Kobanî region remains under IS occupation.\n* 27 January: Suspected IS militants in Libya killed eight people, after storming the Corinthia Hotel in Tripoli and detonating a car bomb. Also, YPG fighters recaptured the Helnej village southeast of Kobanî, and they also besieged IS forces in the southern countryside of the city. The next day, YPG and FSA fighters recaptured Kolama village, Seran mall, and Noroz hall. Later on 27 January, YPG fighters drove out the remaining IS forces in the southeastern corner of the City of Kobanî, thus securing 100% control of the city.\n* 29 January: An IS militant claimed that IS has smuggled 4,000 militants into the European Union under the guise of civilian refugees. IS claimed that the fighters were planning retaliatory attacks.\n* 31 January: IS claims to have beheaded Japanese hostage journalist Kenji Goto, the second IS execution of a Japanese person.\nFebruary 2015\n, with U.S. Ambassador to Jordan Alice Wells, meets with King Abdullah II of Jordan, Crown Prince Hussein bin Abdullah, Jordanian Foreign Minister Nasser Judeh, and advisers in Washington, D.C., 3 February 2015.]]\n* 3 February: IS released a video of Jordanian hostage Muath al-Kasasbeh being burned to death while locked in a cage. Protests occurred in Jordan with some Jordanians demanding revenge on IS. Also, IS launched another incursion into Arsal, Lebanon, from their base in the countryside near the Syrian border to the west of Flitah, making it the deadliest IS incursion into Lebanon since their incursion into Arsal in August 2014.\n* 4 February: Jordan executed two of its Al-Qaeda in Iraq prisoners, in retaliation against IS's burning of the Jordanian pilot. Sajida al-Rishawi, the Al-Qaeda in Iraq failed suicide bomber that IS wanted released in the proposed prisoner swap, was one of the executed terrorists. Jordanian TV also stated that Jordanian pilot Muath Al-Kaseasbeh was believed to have been executed by IS as early as 3 January 2015. Jordan's King Abdullah II vowed a \"relentless war\" against IS on its own territory, for killing Al-Kaseasbeh. Syrian Kurds fighting IS forces near Kobanî stated that they faced \"no resistance\" due to the fact that IS kept \"withdrawing its fighters\" whenever the Kurds entered another village. Later on 4 February, Jordan began launching airstrikes on IS positions in Iraq, in retaliation for IS's killing of Jordanian pilot Muath al-Kasasbeh. The airstrikes killed 55 IS militants in Mosul, including a senior IS commander known as the \"Prince of Nineveh\".\n* 5 February: Jordanian F-16s continued an elevated airstrike campaign against IS, targeting militants near the de facto IS capital of Raqqa, Syria.\n* 6 February: A continued round of Coalition airstrikes at Raqqa killed over 30 IS militants.\n* 7 February: IS claimed that American female hostage Kayla Mueller was killed in the Jordanian airstrike on Raqqa on 5 February. However, some experts believe that she may have been killed before the date of the video's release, in order for IS to try to drive a wedge between the US and Jordan by blaming her death on the Jordanian airstrikes.\n* 8 February: IS reportedly took over the town of Nofaliya in Libya, after a convoy of 40 heavily armed vehicles arrived from Sirte and ordered Nofaliya's residents to \"repent\" and pledge allegiance to Abu Bakr al-Baghdadi. The fighters appointed Ali Al-Qarqaa as the IS emir of the town.\n* 9 February: US airstrikes targeted IS strongholds in and around the town of Hawija, a mixed Kurdish-Arab city to the west of Kirkuk, which has been under ISIL control since June 2014.\n* 10 February: President Obama confirmed the death of U.S. hostage Kayla Mueller by IS.\n* 12 February: IS fighters seized most of the town of Khan al Baghdadi, with some reports indicating 90%, which is located 85&nbsp;km northwest of Ramadi. It was also reported that IS had launched a direct attack on the Al Asad Airbase, where nearly 300 US soldiers are stationed.\n* 14 February: The Libyan parliament confirmed the deaths of 21 kidnapped Egyptian Coptic Christian workers in Libya, after the IS English language publication Dabiq had released photos claiming their execution.\n* 16 February: Egypt retaliated against IS for the beheading of 21 Egyptian Christians by bombing IS camps, training sites, and weapons storage depots in neighbouring Libya. 50 IS militants in Derna were killed by the initial airstrikes.\n* 17 February: It was revealed that IS had launched another major assault on Erbil, coming within  of the city.\n* 20 February: Pierre Choulet, known as \"Abou-Talha al-Faransi\" (the Frenchman) who left France for Syria in October 2013, blew up himself in suicide bombing during an attack on a military base in Iraq.\n* 21 February: Pope Tawadros II of the Coptic Orthodox Church canonised 21 Coptic Christians murdered by IS. He announced they will be commemorated on the 8th Amshir of the Coptic calendar, or 15 February of the Gregorian calendar as Holy Martyrs and Saints. Syrian Kurds launched an offensive to retake IS-held territories in the Al-Hasakah Governorate, specifically in the Tell Hamis area, with support from US airstrikes. At least 20 villages were captured, and 12 militants were killed in the clashes.\n* 23 February: IS stormed the central library of Mosul, destroying about 100,000 books, manuscripts, and newspapers. IS abducted 150 Assyrian Christians from villages near Tal Tamr (Tell Tamer) in northeastern Syria, after launching a large offensive in the region. It was reported that IS had burned around 8,000 rare books and manuscripts after destroying the Library of Mosul in Iraq.\n* 25 February: Experts believe that three missing British schoolgirls who had gone to Turkey had travelled to Syria and joined IS.\n* 26 February: The total number of Assyrian Christians abducted by IS from villages in northeastern Syria from 23 to 25 February rose to at least 220, according to the Syrian Observatory for Human Rights (SOHR), a monitoring group based in Britain. Media report about the mass destruction of historical artefacts in the Mosul Museum by IS is released, including statues of Lamassu. Jihadi John is identified as Mohammed Emwazi, a 27-year-old Kuwaiti-born British man from a middle-class family who grew up in West London, and graduated from the University of Westminster with a computer programming degree.\n* 27 February: The Kurdish Democratic Union Party and Syrian Observatory for Human Rights reported that Kurdish fighters, aided by Coalition airstrikes, had recaptured the town of Tal Hamis, as well as most of the villages in the region that had once been occupied by IS. At least 175 IS militants and 30 YPG fighters were killed in the clashes.\nMarch 2015\nA group of IMU militants in northern Afghanistan, led by Sadulla Urgenji, released a video in which they stated they no longer view the Taliban's Mullah Omar as leader and pledged allegiance to IS's Abu Bakr al-Baghdadi.\n* 2 March: The Iraqi government launched a massive military operation to recapture Tikrit, with 30,000 Iraqi soldiers, backed by aircraft, besieging the city on three fronts.\n* 5 March: It was reported that IS had destroyed the ancient Assyrian city of Nimrud and its archaeological site, claiming that the city and its extensive collection of related antiquities were blasphemous.\n* 6 March: An Iraqi antiquities official confirmed IS's bulldozing of the ancient Assyrian city of Nimrud, a town founded in the thirteenth century BC, with unconfirmed amounts of damage. Iraqi forces and allies searched houses in Garma. 47 IS fighters and 5 Iraqi fighters were killed in Garma.\n* 7 March: Iraqi forces took control of the town of Khan al Baghdadi, with the support of coalition airstrikes.\n* 7 March: Boko Haram declared allegiance to IS, although some experts believe that the pledge is largely symbolic.\n* 8 March: Mohammed Emwazi, also known as \"Jihadi John\", apologized to his family for the shame and scrutiny he brought on them after his identity was unmasked.\n* 9 March: Iraqi forces and allies recaptured Al-Alam, Iraq. Infighting in IS left nine IS members dead near al-Bab city. Coalition airstrikes killed and destroyed IS units, including workers at an oil-pumping station in the Deir ez-Zor province of Syria.\n* 10 March: IS has reportedly destroyed the 10th-century Assyrian monastery of St. George and a Chaldean Catholic seminary near Mosul.\n* 12 March: IS's spokesman Abu Mohammad al-Adnani released an audiotape in which he welcomed a pledge of allegiance made to IS by Boko Haram; he described it as an expansion of the group's caliphate to West Africa. Jamaat-ul-Ahrar left IS and rejoined Tehrik-i-Taliban.\n* 13 March: A group of militants from the Islamic Movement of Uzbekistan in Northern Afghanistan swore allegiance to IS.\n* 15 March: Fighting around the city of Tikrit led to the near-complete destruction of the tomb of Saddam Hussein located in Al-Awja. The former President's body had been moved from the mausoleum and taken to an unknown location last year, according to the local Sunni population.\n* 18 March: Abu Bakr al-Baghdadi was reportedly seriously wounded in a Coalition airstrike at the al-Baaj District, in the Nineveh Governorate, near the Syrian border. It was reported that his wounds were so serious that the top IS leaders had a meeting to discuss who would replace him if he died.\n* 18 March: IS has claimed responsibility for the terrorist attack at a museum in Tunisia that killed 21 people and injured dozens more.\n* 20 March: IS took responsibility for a quadruple suicide bombing, carried out in Sana'a mosque in Yemen, which killed nearly 150 people.\n* 26 March: From 25 to 26 March, US-led Coalition airstrikes were reported to have killed over 150 IS militants in Mosul.\n* 30 March: The senior Sharia official of Ansar al-Sharia in Libya, Abdullah al-Libi, defected to IS, along with many other Ansar al-Sharia militants.\n* 31 March: Iraqi forces recaptured the city center of Tikrit, with pockets of IS resistance consisting of 400 IS fighters remaining.\nApril 2015\n* 8 April: The Canadian military conducted its first airstrike on an IS target in Syria. Two Canadian CF-18s were involved in the airstrike against an IS garrison near Raqqa. A total of 10 coalition aircraft, including six from the U.S., took part in the airstrike.\n* 8 April: IS destroyed the 12th century Bash Tapia Castle in Mosul.\n* 12 April: The Iraqi government declared that Tikrit was free of IS forces, stating that it was safe for residents to return home. However, many refugees from Tikrit still feared returning to the city, and cleanup operations to remove the 5,000–10,000 IEDs are expected to take at least several months. Additionally, Abu Maria, the top IS leader in Tikrit, was killed along with his top aide by Iraqi forces at the Ajeel Oil Field, near Tikrit, who caught the IS leaders trying to flee from the city. Also, Wilayat Sinai, a group that has pledged allegiance to IS in the Sinai Peninsula, claimed responsibility for a bombing attack in Egypt that killed at least 13 people and wounded dozens more.\n* 17 April: 130 IS sleeper agents hiding in Tikrit were found and killed by Iraq security forces, which finally ended the Second Battle of Tikrit. Additionally thousands of families fleeing Iraq's western city of Ramadi choked checkpoints leading to Baghdad on Friday, after an Islamic State advance spread panic and left security forces clinging to control. U.S. and Iraqi officials have warned that the city is at risk of falling to the Islamic State despite seven months of airstrikes by U.S. planes in Anbar.\n* 18 April: IS's Wilayat Khorasan claimed responsibility for a suicide bombing in Afghanistan on 18 April that killed at least 33 people and injured more than 100, according to a statement believed to be from the movement.\n* 19 April: IS produced a video showing the murder by shooting and decapitation of approximately 30 people, who were identified as Ethiopian Christians.\n* 20 April: An 18-year-old boy from New Zealand joins IS and is reported missing. New Zealand and Australia are concerned about IS-related terrorism at Anzac day.\n* 21 April: It was reported that al-Bagdadi had not yet recovered enough from the injuries he received from an 18 March Coalition airstrike to reassume daily control of IS.\n* 22 April: The Iraqi Army regained ground in Ramadi from IS forces. Additionally, it was reported that Abu Ala al-Afri, the self-proclaimed Caliph's deputy and a former Iraqi physics teacher, has now been installed as the stand-in leader while Baghdadi recuperates from his injuries.\n* 25 April: A video was released, in which IS executioners in the Homs province were shown staging a purported display of sympathy wherein they embrace and forgive two gay men for their sins, before bludgeoning them to death with huge rocks. after breaching IS's defense line, with reports that IS militants had retreated to the urban areas of Sarrin. According to at least one source, YPG and FSA forces managed to enter the northern part of Sarrin.\nMay 2015\n* 1 May: The Guardian reported that Abu Bakr al-Baghdadi, the leader of IS, was recovering in a part of Mosul from severe injuries he received during a March 2015 airstrike. It was reported that due to al-Baghdadi's incapacitation from his spinal injury, he may never be able to resume direct control of IS again.\n* 5 May: IS claims that it was related to the Curtis Culwell Center attack in Garland, Texas on 3 May. The Chicago Tribune reported that there is a link between the gun used in the militant attack and the Fast and Furious U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) gunwalking scandal.\n* 7 May: IS-backed Taliban forces launched a major offensive against the north-eastern Afghan city of Kunduz, triggering a humanitarian crisis and a wave of fleeing refugees.\n* 13 May: The clashes, in Maiduguri, between Boko Haram fighters and the Nigerian army resulted in the death of 27 people in addition to 3 Nigerian soldiers killed in gunfights and 6 vigilantes who were killed and 12 more injured by 3 female bombers. Boko Haram lost 35 members including the suicide bombers.\n* 14 May: An Al-Mourabitoun commander called Adnan Abu Walid Sahraoui pledged the group's allegiance to IS, expanding IS's area of operation into Mali. The group's founder, Mokhtar Belmokhtar, later issued a statement rejecting Sahraoui's announcement.\n* 15 May: During the night, IS militants entered the city of Ramadi, the capital of Al Anbar Governorate, using six near-simultaneous car bombs. IS also released an audio tape message, with Abu Bakr al-Baghdadi calling all Muslims to fight against the Iraqi government in Saladin and Al Anbar Governorates, claiming that this is their duty as Muslims. The message breaks the rumors of his death.\n* 15–16 May: U.S. Special Operations forces killed a senior IS commander named \"Abu Sayyaf\" during a raid intended to capture him in Deir ez-Zor, eastern Syria overnight. At least six people from IS were killed while no US soldiers were killed.\n* 17 May: IS forces captured the city of Ramadi, after Iraqi government forces abandoned their posts; more than 500 people were killed.\n* 19 May: Algerian troops ambushed and killed at least 22 militants allied to Islamic State as they held a meeting east of the capital.\n* 21 May: IS forces captured the Syrian town of Tadmur and the ancient city of Palmyra, beheading dozens of Syrian soldiers. Two gas fields also fell into IS hands. According to the Syrian Observatory for Human Rights, IS had by then seized 95,000 square kilometers of land, nearly half of Syria's territory. IS also reportedly kidnapped a Syriac Catholic priest, Fr. Jacques Mourad, in the area between Palmyra and Homs.\n* 22 May: Al-Walid, the last border crossing between Syria and Iraq that was held by the Syrian Army, fell to IS. IS also carried out its first terror attack in Saudi Arabia, when a suicide bomber killed at least 21 people in a Shiite mosque in the city of Qatif.\n* 22 May: Abu Maryam al Faransi and Abu Abdul Aziz al Faransi, 2 French IS militants, blew up themselves in bomb suicide attack during coordinated assault on the western Iraqi town of Haditha. After the bombings, clashes continued with the Iraqi Security Forces, the Sunni militia Kata'ib al Hamza, and Sunni tribesmen from the Al Jughayfa tribe.\n* 26 May: IS militants burned an 80-year-old Assyrian woman to death for \"failing to comply with the strict laws of the Islamic State.\"\n* 27 May: IS seizes the Khunayfis phosphate mines  south of Palmyra, depriving the Syrian government of a key source of revenue.\n* 28 May: IS claims the seizure of Sirte Airport.\n* 30 May: A suicide bomber has killed at least 16 people at a mosque in the Nigerian city of Maiduguri. Dozens more were wounded in the attack. It follows an overnight assault on the north-eastern city by Boko Haram, in which at least 13 people were killed before troops were able to push back the militants' advance.\n* 31 May: IS launched an assault on the Syrian city of Al-Hasakah, with IS clashing with Syrian government forces on the southern outskirts, and Kurdish forces announcing their intent to protect their portion of the city. Kurdish forces killed 200–450 IS members and captured more than 20 in clashes accused of being IS and burned homes of suspected IS supporters near Ras al-Ayn and Tell Tamer.\nJune 2015\n* 1 June: IS begins mandating that male civilians in Mosul wear full beards and imposes harsh punishments for shaving, up to and including beheading.\n* 2 June: IS forces close the gates of a dam in Ramadi, shutting off water to Khaldiyah and Habbaniyah.\n* 3 June: IS forces in Afghanistan reportedly capture and execute ten militants of the Taliban in the Nangarhar province claimed by the Afghan National Army.\n* 7 June: The Syrian Army reported it repelled an offensive by IS on the town of Hasakah. Kurdish forces also seized several villages west of Ras Al Ayn, including al-Jasoum and Sawadieh.\n* 10 June: President Obama authorized the deployment of 450 American advisors to Iraq to help train Iraqi forces in fighting IS.\n* 13 June: The Syrian Kurdish YPG militia announced it had begun to move towards the IS-controlled border town of Tell Abyad after encircling the town of Suluk 20&nbsp;km to the southeast.\n* 15 June: A spokesman for Kurdish YPG units announced Syrian Kurdish fighters had taken the town of Tell Abyad from IS.\n* 15 June: Ali bin Tahar-Al Awni-al Harzi was killed in a drone strike in Mosul, Iraq. He was the brother of the top IS leader Tariq bin Tahar-Al-Awni-al-Harzi and not only a top IS leader himself, but also a person of interest in the deadly 2012 attack on the U.S. consulate in Benghazi, Libya.\n* 16 June: Tariq bin Tahar-Al-Awni-al-Harzi (A top IS leader) was killed in a US airstrike in Syria, one day after his brother.\n* 23 June: A Kurdish YPG spokesman announced the town of Ayn Issa and surrounding villages, located 50&nbsp;km (30 miles) from Raqqa, were under the militia's \"total control\". Abu Mohammad al-Adnani announced the expansion of IS to Russia's North Caucasus region as a new Wilayat.\n* 24 June: IS attacks Kobanî, killing at least 146 people. Kurdish forces and the Syrian government claimed the vehicles had entered the city from across the border, an action denied by Turkey.\n* 26 June: IS claims responsibility for the Saint-Quentin-Fallavier attack in which one person was beheaded in France, the bombing of a Shiite mosque in Kuwait City, killing at least 27 people, and the attacks on tourists in Sousse, Tunisia, where 38 people were killed.\n* 27 June: IS demolished the ancient statue Lion of al-Lat in Palmyra.\n* 29 June: A senior IS commander, named Hesam Tarrad nicknamed Abu Bakr, was executed by the rival militant group, the Al-Nusra Front, in Eastern Lebanon.\n* 30 June: Alaa Saadeh, a 23-year-old resident of West New York, New Jersey, is arrested at his home on charges of conspiring to provide material support to IS, and aiding and abetting an attempt to do so. His brother, designated by the United States Department of Justice as Co-Conspirator 1 (CC-1), left the United States on 5 May to join IS. Other co-conspirators residing in Fort Lee, New Jersey and Queens, New York were arrested on 13 and 17 June on similar charges, as part of an investigation of a group of individuals from New York and New Jersey that the Department says conspired to provide material support to IS.\nJuly 2015\n* 1 July: A full-scale offensive in Sinai by the Islamic State affiliate began after sunrise with simultaneous assaults on more than a dozen military checkpoints. For hours, as the militants laid siege to the town of Sheikh Zuwaid, Sinai Province even released updates on its progress. The police station was under siege. To finally overcome the militants, the military called in warplanes and helicopters, conducting airstrikes that left the remains of the militants still sitting in their pulverized vehicles, witnesses said. The death toll reached 21 soldiers killed along with 100 of the militants.\n* 2 July: Not less than 22 Ansar Beit Al-Maqdis militants were killed in an air strike launched early Thursday in Rafah, North Sinai, by Egyptian air forces, reported Reuter's Aswat Masriya. Military sources told Aswat Masriya that the 22 militants were killed in the early hours of Thursday (2 July) by an Apache helicopter after information was received on a number of militants who participated in an attack against Egyptian security forces at a checkpoint in Sheikh Zuweid also Thursday (2 July).\n* 2 July: Rockets were shot at southern Israel by an IS-affiliated group.\n* 3 July: Coalition forces targeted IS positions with 14 air strikes near the cities of Hasakah, Kobane, Aleppo and Tal Abyad, destroying tactical units, fighting positions, vehicles and structures. Some more 9 Air strikes occurred in Irak Near the cities of Al Huwayjah, Fallujah, Makhmur, Mosul, Sinjar.\n* 4 July: Coalition forces conducted 16 airstrikes late Saturday and early Sunday against key IS buildings and transit routes in the terror group's stronghold of Raqqa, Syria, a U.S. Army official said.\n* 5 July: The Egyptian army has killed 241 militants in North Sinai over the past five days, the army's spokesman said in a statement on Monday. From 1 to 5 July, the army also arrested four wanted terrorists and 29 other suspects. Four militant headquarters were also destroyed, spokesman Mohamed Samir added in a statement on his official Facebook page that also included pictures of the mangled bodies of dead alleged terrorists. The statement added that 26 vehicles used by militants were destroyed, including 11 land cruisers, while 16 bombs, prepared to attack army and police personnel in the peninsula, were made safe. Army personnel confiscated a number of militant weapons, including RPGs, machine guns, mortar shells, and hand grenades.\n* 6 July: IS militants have retaken the key Syrian city of Ain Issa from Kurdish forces.\n* 7 July: The Syrian Arab Army's 154th Brigade of the 4th Mechanized Division – in coordination with the 104th Airborne Brigade of the Republican Guard, Shaytat Tribesmen (Kata'eb Aswad Al-Sharqiyah), and the National Defense Forces (NDF) – launched a counter-assault at the Al-Liliyah and Al-Nishwa Quarters of Al-Hasakah City, killing scores of enemy combatants from IS in the process. Among the IS casualties there was the IS field commander of operations in Al-Hasakah City, \"Abu Qatada Al-Leebi\" (Libyan) – he is believed to be the highest ranking IS casualty that has been reported during this battle.\n* 9 July: Mawlawi Shahedullah Shahed, a senior IS commander was killed in an air strike in Achin district, Nengarhar, Afghanistan. The IS leader was killed in the same strike with the group's \"number two\" – the head of military operations – Gol Zaman, according to the Afghan intelligence agency. Shahid was a former member of the Pakistani Taliban, he was ousted from the group in October 2014, and was one of the first to pledge allegiance to IS in Afghanistan.\n* 10 July: Hafiz Saeed Khan, the Emir of IS's Khorasan Province, was killed in a drone strike in Afghanistan. At least 30 other insurgents were killed in the airstrike.\n* 10 July: A Swedish member of IS, known as Abu Othman, died after a bombing on an IS media center in Anbar Province in Iraq. At least 23 members of IS were reportedly killed in the raid in Anbar, according to the Swedish Foreign Ministry.\n* 11 July: IS claims responsibility for a car bomb blast at the Italian consulate in Cairo, Egypt.\n* 16 July: IS militants in Sinai attack an Egyptian Navy ship with a guided anti-tank missile.\n* 17 July: IS claims responsibility for a bombing in a Khan Bani Saad marketplace that killed 130, injured 130.\n* 20 July: A bomb exploded on the Suruç district of Şanlıurfa, Turkey, killing 32 people and injuring 104. A politician from the pro-Kurdish party of DBP stated that the suicide bomber was a member of IS.\n* 20 July: 13 IS fighters were killed by SAAF airstrikes in the city of Al-Hasakah.\n* 26 July: At least 13 suspected Boko Haram militants and three civilians were killed in separate attacks over the weekend after the insurgents raided several remote localities around Lake Chad in Nigeria. The insurgents are also suspected of kidnapping some 30 people in Katikine village.\n* 28 July: The United States and its allies conducted 11 air strikes in Iraq against the Islamic State and also targeted the militant group with three strikes in Syria\nAugust 2015\n* 1 August: End of the Battle of Al-Hasakah resulting with a decisive Syrian Army & YPG/J victory. During the different clashes the IS lost at least 312 fighters including 26 child soldiers. 125 Syrian Army soldiers at least were killed, and at least 100 more wounded. The YPG/J sustained dozens of killed\n* 2 August: Russian security forces killed 8 IS fighters in the North Caucasus region.\n* 5 August: US launches its first attacks against IS from Turkey.\n* 12 August: US launches its first manned air strikes against IS from Turkey.\n* 13 August: IS truck-bombing of a market in a Shia district of Baghdad kills scores, wounds hundreds.\n* 16 August : IS informed families of 4 IS militants from the city of al- Shaddadah, Syria, that IS organization executed them for \"cooperating with the international coalition\".\n* 18 August: The No. 2 figure in IS, Haji Mutazz, was killed in an 18 August drone strike near Mosul, Iraq. Mutazz was traveling in a car with an Islamic State media operative named Abu Abdullah when the vehicle was hit.\n* 19 August: IS beheaded Dr. Khaled al-Asaad, who was a retired chief of antiquities for Palmyra because IS accused him of being an \"apostate\" and lists his alleged crimes, including representing Syria at \"infidel conferences,\" serving as \"the director of idolatry\" in Palmyra, visiting Iran and communicating with \"a brother in the Syrian security services\".\n* 21 August: IS destroyed the historic Mar Elian monastery near the town of Al-Qaryatayn in the Homs Governorate. Two British Islamic State jihadists who died in Syria were killed by an RAF drone strike The target of the RAF drone attack was Reyaad Khan, a 21-year-old from Cardiff who had featured in a prominent IS recruiting video last year. The second British was Ruhul Amin, from Aberdeen. Two other IS fighters were killed in the attack on the Syrian city of Raqqa\n* 21 August: Ten Abu Sayyaf militants were killed, raising to 25 the number of Islamic militants slain and 16 others wounded the past three days as the military continued its operations using 105&nbsp;mm cannons against the fleeing terror group in Patikul, Sulu, Philippines.\n* 22 August: Ayoub El Khazzani, a Moroccan who has links to Islamic State, attempted to kill passengers of a French train leaving from Brussels and going to Paris. He injured seriously 2 people and another one slightly while 3 American passengers overpowered him. El Khazzani had lived in Spain until 2014, moved to France then travelled to Turkey then Syria where he is believed to have trained with IS before returning to France.\n* 23 August: IS destroyed the 2,000-year-old Baalshamin Temple (Temple of Ba'al) in Palmyra\n* 23 August: Suspected Boko Haram militants ambushed a convoy carrying Nigeria's chief of army staff on a tour of towns in troubled Borno state. One Nigerian soldier died while 10 militants were killed and another five captured.\n* 24 August: Junaid Hussain, 21 and from Birmingham, UK, was killed in air strike by US forces in Raqqa. The Pentagon confirmed that a U.S. drone strike killed Junaid Hussain, an IS operative linked to the Garland, Texas, cartoon contest attack.\n* 25 August: IS suicide bomber assassinated two Iraqi generals identified by state television as Maj. Gen. Abdul-Rahman Abu-Regheef, deputy chief of operations in Anbar, and Brig. Gen. Sefeen Abdul-Maguid, commander of the 10th Army Division.\n* 26 August: Kurdish forces backed by international coalition airstrikes drove Islamic State militants out of 10 villages in Iraq's Kirkuk province in an offensive to secure their territory to the north.  Five peshmerga had been killed, most of them by improvised explosive devices.\n* 28 August: 3 members of the Abu Sayyaf group were killed and 5 wounded, as well as 10 Marines were wounded, in an encounter, in the mountain of Patikul town, Sulu, Philippines.\n* 29 August: Turkish military aircraft launches first airstrikes against IS targets as part of the Western coalition.\n* 30 August: IS destroyed the Temple of Bel in Palmyra. The bricks and columns were reported as lying on the ground and only one wall was reported as remaining, according to a Palmyra resident.\nSeptember 2015\n* 1 September: At least one Turkish soldier was killed and two others wounded in the southern province of Kilis by cross-border fire near Syria. The fire came from Syrian territory held by IS militants.\n* 5 September: The international coalition carried out 21 airstrikes against the Islamic State in Iraq and Syria over the weekend of 5 September. The largest concentration of attacks occurred near Fallujah, Iraq, where five airstrikes hit staging areas, a building and a bunker. Another 12 attacks were carried out across six other cities in Iraq.\n* 5 September: An Iraqi woman, believed to be a member of the Yazidi-Kurdish minority, shot dead a senior Islamic State commander known as Abu Anas, as bloody revenge for making her a sex slave.\n* 10 September: A coalition airstrike kills Abu Bakr al-Turkmani, an IS administrative emir, at Tal Afar, Iraq.\n* 14 September: Two Australian Hornet fighter aircraft destroyed an IS armoured personnel carrier with a precision-guided missile in east Syria.\n* 15 September: Egyptian security forces killed 55 militants in Sinai on the ninth day of an operation against Islamists in the area 2 Egyptian soldiers were killed.\n* 16 September: The international coalition have carried out 22 air strikes on Islamic State in Iraq and Syria in the past 24 hours. There were three strikes near Hasaka in northeast Syria hitting a tactical unit and destroying IS fighting positions, bunkers and excavators. Another strike near Aleppo hit an IS tactical unit. Kobani, near the Turkish border, also took a hit destroying three fighting positions and a tactical unit. And in a co-ordinated attack with the Iraqi Government, there were fifteen strikes in Iraq targeting Islamic State buildings and equipment near Baiji, Fallujah, Mosul and Sinjar.\n* 18 September: Syrian army jets have carried out at least 25 airstrikes on Islamic State positions in the city of Palmyra leaving at least 26 people dead, including 12 IS militants.\n* 18 September: Abu Sayyaf militants are suspected to have bombed a bus killing 1 woman and injuring 16 more people, in Zamboanga, Philippines.\nAt least 38 IS fighters were killed in airstrikes by the Damascus regime against Palmyra and two other towns held by IS in Homs province.\n* 22 September: At least 38 IS fighters were killed in airstrikes by the Damascus regime against three jihadi-held towns in central Syria.\n* 22 September: Cameroon's army killed 11 Boko Haram militants in clashes in the northern town of Amchide.\n* 24 September: Yemen's branch of IS claimed responsibility for a suicide bombing at a mosque in the Yemeni capital Sanaa that killed at least 29 people.\n* 25 September: Some 200 members of the Boko Haram Islamist militant group have given themselves up, in the town of Banki, Nigeria, on the border with Cameroon.\n* 27 September: This airstrike resulted in the death of 30 IS members, including 12 child soldiers, and 20 wounded.\n* 29 September: IS claimed responsibility for the shooting death of an Italian aid worker in Dhaka, Bangladesh; if confirmed this would be their first attack in Bangladesh.\n* 29 September: The United States Department of State designates IS's Caucasus and Khorasan Provinces as global terrorist groups.\n* 30 September: Russian aerospace force jets supposedly delivered pinpoint strikes on eight IS terror group targets in Syria. In total, 20 flights were made. As a result, arms and fuel depots and military equipment were hit. Supposed IS coordination centers in the mountains were totally destroyed.  The de facto IS capital Raqqa, was also targeted, killing at least 12 jihadists.\nOctober 2015\n* 2 October: Boko Haram attack on a village in southeastern Niger killed two Nigerien soldiers, wounded 7 others and also destroyed an army vehicle.\n* 2 October: 3 IS members were arrested in Chechnya.\n* 3 October: IS claimed responsibility for shooting and killing a Japanese man in the Rangpur District of Bangladesh. The second murder of a foreigner committed by IS in the country within a week; they warned of more attacks.\n* 5 October: IS launched a full-scale assault on the provincial capital of the Deir Ezzor Governorate, attacking the Syrian Armed Forces' frontline defenses at the Military Airport; the Al-Sina'a, Al-Haweeqa, and Al-'Amal Districts; and the village of Al-Muri'iyah. This offensive totally failed and resulted in the death of around 150 IS members.\n* 6 October: Russian jets hit IS targets in the Syrian city of Palmyra. The strikes destroyed 20 vehicles and 3 weapons depots in Islamic State-held Palmyra.\n* 7 October: IS suffered heavy losses, against Syrian Army, after another failed offensive in Deir Ezzor military airport, in Syria.\n* 7 October: The Nigerian Army killed over 100 Boko Haram militants after they made attempts to attack 120 Task Force Battalion troops, located at Goniri, Yobe State. During the encounter, the militants killed 7 soldiers and wounded 9 others.\n* 8 October: General Hossein Hamedani, An Iranian military commander, who was overseeing the Quds Force and advising Syrian Army, was killed by IS militants on the outskirts of Aleppo city, Syria. IS sent 3 suicide bombers and hundreds of combatants to swarm the Syrian Army Base outside of the Deir Ezzor Military Airport, killing 23 soldiers from the 137th Brigade before IS was able to impose complete control over the last building situated between the Artillery Battalion Base and the Airbase.\n* 8 October: 11 Chadian soldiers have been killed in the most recent Boko Haram attack in the country, while 13 others have been reportedly wounded.\n* 8 October: Antiterror police in Russia's Chechen Republic have killed 3 suspected IS militants, coming back from Syria, in two separate shootouts. 2 law enforcement officials were wounded during the operation.\n* 8 October: 3 Assyrians, kidnapped in February 2015, were executed on video tape.\n* 9 October: 2 French Rafale jets carried out a second wave of strikes in Syria on an IS training camp. IS launched 4 suicide bombers towards the southeastern gate of the Deir Ezzor Military Airport; however, all of the vehicles were destroyed by the Syrian Armed Forces before they could reach their destination. the Syrian Armed Forces suffered another 16 casualties. IS sustained a total of 73 casualties and the destruction of 14 armored vehicles (suicide vehicles included) that were either mounted with a 23&nbsp;mm or 57&nbsp;mm anti-aircraft machine gun during those tense 48 hours.\n* 10 October: During the last 24 hours, the Syrian army, in coordination with the Russian Air Force, captured the city of Jabboul (6&nbsp;km from the surrounded Kuweires Military Airport, also called Rasin El Aboud, held by the Syrian Army) after intense firefights with IS. Fierce clashes took place in the vicinity of Marouh village (15&nbsp;km south of Sirrin town).\n* 16 October: A gunman shot and killed 5 people in an Islamic State-claimed attack on a Shia meeting hall in Saudi Arabia before being shot dead by police.\n* 16 October: Lebanese militant group Hezbollah fired rockets and mortars at what it said were Islamic State fighters trying to infiltrate in the north of the country, killing 5 of them.\n* 18 October: An IS convoy of 16 vehicles was hit as it drove through an eastern part of Hama province overnight. It resulted in the death of at least 40 militants. The planes which conducted the airstrikes could be Russian or Syrian.\n* 18 October: A British IS fighter has carried out a devastating suicide bomb attack near the jihadi held city of Ramadi in Iraq. An IS statement claimed that the fighter, known only as Abu Omar al-Britani, had taken part in a twin suicide bomb attack, killing and wounding 80 people. The second suicide bomber is thought to be a Syrian national, named as Abu Qatiba al-Shami.\n* 22 October: A Kurdish and United States commando raid to free prisoners being held by IS militants resulted in the release of 69 people including more than 20 Iraqi security forces. Intelligence suggested freshly dug graves were intended for the hostages, and a hostage interviews after the rescue said they expected to die after morning prayers. An American service member was deadly wounded (first American military death in the war against IS) and 4 Kurds were wounded. More than 20 IS members were killed and 6 captured. The US released video of the prison being bombed after the raid.\n* 29 October: IS recently executed more than 200 of its own militants after they tried to break off and join al-Qaeda in Syria.\n* 31 October: Lebanese security forces arrested an IS member planning suicide attack against army.\n* 31 October: A Russian airliner flying from Sharm el-Sheikh Egypt crashes, killing all 224 people on board. IS claims responsibility in a video saying it is in retaliation for Russia sending planes against them.\nNovember 2015\n* 1 November: An elderly South Korean man who was kidnapped by Abu Sayyaf militants in the southern Philippines 10 months ago has been found dead apparently due to an illness.\n* 2 November: The Syrian Democratic Forces advanced towards the strategic town of al-Hawl on the border with Iraq, after storming the nearby village of Bahrat al-Khatooniya. Russian Su-25 jets bombed IS positions, in ancient city of Palmyra, destroying a fortification, an underground bunker and anti-aircraft guns.\n* 3 November: International coalition forces launched air raids on military bases of the Islamic State group inside Shingal and Baaj, killing at least 10 militants.\n* 4 November:  John Gallagher, a Canadian man, fighting alongside the Syrian Democratic Forces, has been reportedly killed by a suicide bomber during fighting against Islamic State militants in north-eastern Syria.\n* 4 November: At least nine people, including four Egyptian policemen, were killed and 10 others injured, when a suicide bomber rammed his vehicle into a police club in the Sinai Peninsula, Egypt. IS claimed responsibility for the attack.\n* 4 November: IS claimed responsibility for an attack near the Bangladeshi capital that left 1 police officer dead and another wounded.\n* 5 November: Niger's air force bombed a Boko Haram base in the country's southeast and arrested more than 20 militants.\n* 6 November: Airstrikes by Russian warplanes on the IS-held Syrian city of Raqqa killed 42 people earlier this week, including 27 civilians, 15 IS fighters made up the remainder of the death toll.\n* 7 November: An Abu Sayyaf sub-leader was critically wounded in Sulu clash during a Filipino military operation.\n* 8 November: An Abu Sayyaf leader was killed along with another bandit by Filipino government troops in Basilan. 3 soldiers were injured in the clash.\n* 10 November: Robert Zankishiyev, aka Abdullah, an IS leader in North Caucasus was killed in a counter-terrorist operation in Nalchik, Russia.\n* 11 November: Boko Haram killed 5 civilians in their initial attack in  the village located Bosso district, Niger. Niger soldiers drove back the militants, killing around 20 of them.\n* 11 November  The Peshmerga launch an offensive to recapture Sinjar after an almost year-long stalemate from its positions on the Sinjar Mountain and the old city, backed by significant artillery bombardment and Coalition air support. The HPG and the YPG also participate in the offensive from their own positions though independently from the Peshmerga. Yezidis make up a significant portion of the Kurdish force, either as units within the Peshmerga, the PKK-affiliated YBŞ, or the HPŞ. IS abandons the city by the second day, and in the following days the peshmerga set up a defensive zone around the city and sever IS access to Highway 47, which runs between the Syrian border and Tal Afar through Sinjar.\n* 12 November: IS claimed responsibility for a pair of suicide bombings which struck southern Beirut, killing 43 people and wounded at least 239.\n* 12 November: The British IS militant Mohammed Emwazi, also known as Jihadi John, was announced killed in a US drone strike in Raqqa.\n* 13 November: IS reportedly claimed responsibility for a suicide bomb in Baghdad that killed at least 18 people.\n* 13 November: IS claimed responsibility for terror attacks in Paris, France that left 130 dead and 352 injured, including at least 99 seriously. Seven terrorists were killed in the attacks, six of them blew themselves up and one was killed by French police.\n* 13 November: At least 9 Boko Haram terrorists were killed and one Nigerian soldier wounded, during an attack on a military base in Gwoza, Borno State, Nigeria.\n* 14 November: A suicide bomber opened fire on Turkish police and then blew himself up during their raid on a suspected IS hideout in Gaziantep near the border with Syria, leaving 5 police officers wounded. The raid came hours after another incident in which Turkish soldiers clashed with IS fighters who fired at them near Gaziantep. 4 IS fighters were killed.\n* 16 November: Troops from the Theatre Command of the 'Operation Lafiya Dole' in Borno State, Nigeria, have killed 37 militants, captured 23 of them alive and destroyed many of their camps.\n* 16 November: U.S. warplanes hit 116 IS fuel trucks in eastern Syria.\n* 17 November: Russian Air Force destroyed 140 targets in Raqqa, Deir Ezzor and Aleppo.\n* 17 November: Anonymous began leaking the personal information of suspected extremists, after it \"declared war\" on IS in the wake of the deadly attacks in Paris.\n* 17 November: IS-affiliated Abu Sayyaf militants beheaded a Malaysian hostage in Philippines.\n* 18 November: The French police raided an apartment in search of suspects linked to the 13 November Paris attacks. 2 terrorists have been killed, including Abdelhamid Abaaoud, a Belgian IS militant who allegedly co-ordinated the November Paris attacks. 5 police officers were slightly injured and a police dog was killed. Another woman was found dead in the apartment and a total of 5 people have been taken into custody.\n* 18 November: A suspected Islamic State militant was killed while trying to illegally cross into Turkey from Syria.\n* 18 November: IS claimed they had killed two hostages hailing from Norway and China.\n* 18 November: In Nigeria, at least 34 people were killed and another 80 wounded in suicid bombing, in Yola, a town packed with refugees from Nigeria's Islamic uprising. Later, 2 female suicide bombers killed at least 15 people in the northern city of Kano and injured 53.\n* 19 November: An IS sniper was reportedly killed by a British missile fired from a RAF tornado, backing Kurdish forces.\n* 19 November: Six men suspected of belonging to an IS terror cell were arrested by authorities in Kuwait. One of those arrested, a Lebanese-born Syrian Osama Mohammed Saeed Khaiyat, used a website under his supervision to help fund and support IS.\n* 20 November: IS claimed responsibility for an attack on the army in the eastern region of Hadramawt, in Yemen, that a security source said killed at least 19 Yemeni soldiers and 35 militants.\n* 20 November: Afghan army forces reportedly killed 12 IS militants and injured 5 more, in the eastern province of Nangarhar. 3 government troopers were injured in the operation as well.\n* 20 November: An Abu Sayyaf member, reportedly involved in the kidnapping of foreigners in Malaysia, was killed during military operations, in Tawi-Tawi, in a Filipino army and police joint operation.\n* 21 November: Turkey arrested a Belgian man of Moroccan origin, named Ahmet Dahmani, suspected of being involved in the November Paris attacks. He was arrested with 2 Syrian men suspected of planning to help Dahmani cross safely into Syria.\n* 22 November: 14 IS members were killed in two special anti-terror operations, near Nalchik, in Russia 11 IS militants were neutralised by the FSB in the first operation and 3 more in the second one.\n* 22 November: The Dubai police detained an Indian man, who was being tracked for over a year by Indian authorities for suspected online activities linked to IS.\n* 23 November: The Syrian Army recaptured Maheen and surrounding villages from IS. The regime's army targeted IS positions near al-Shaer gas field with heavy artillery, killing at least 21 insurgents.\n* 24 November: IS claimed responsibility for a hotel attack that killed 7 people, including 2 judges, 4 policemen and 1 civilian, and wounded 10 in Egypt's Sinai. At least 2 terrorists were killed.\n* 24 November: The Lebanese Army arrested an IS militant based in Tripoli.\n* 25 November: IS claimed responsibility for a suicide bombing attack against a bus of the Tunisian presidential guards, killing 12 of them and wounding 20 others in Tunis.\n* 25 November:  Samra Kesinovic, an Austrian teenager who traveled to Syria to join the Islamic State, is reported dead, having been beaten to death by the group after trying to escape from Raqqa. Her companion, Sabina Selimovic, was reported to have been killed in fighting in Syria in September.\n* 26 November: German Federal Security Council decided to join the military campaign against Islamic State militants with six Panavia Tornado Recce reconnaissance airplanes to support identifying targets. Also it will send one frigate to convoy French aircraft carrier Charles de Gaulle in the eastern Mediterranean. Furthermore, it will support aerial refueling with Airbus A310 MRTT. The mission will have to be approved by the Bundestag and essentially be justified with article 51 of the UN-Charta and the invoked article 42.7 of the Treaty of Lisbon. This mission will not include military attacks and will avoid participation in battles.\n* 26 November: 8 armed men carrying the IS flag, and including a suspected Indonesian national, were killed in an encounter with government troops, in Palimbang town, Sultan Kudarat, in the Philippines.\n* 26 November: A Syrian man accused of transporting the two IS suicide bombers who blew themselves up in the 2015 Beirut bombings has been killed in a joint Hezbollah-Syrian army operation.\n* 26 November: At least 5 gunmen opened fire on a Shiite mosque in northern Bangladesh, killing at least one person and injuring 3 others. IS, reportedly claimed responsibility for the attack.\n* 26 November: At least 4 IS militants were arrested from Paghman district of Kabul.\n* 26 November: The Ghost Sec, a hacking group related to Anonymous, gained control of a website supporting IS and replaced it with a Viagra advertisement.\n* 28 November: The Syrian Arab Army's elite special operations division known as the \"Tiger Forces\" reportedly captured the village of 'Aqulah after a fierce battle with IS in the Kuweires Military Airport's southern countryside. At least 20 enemy combatants were reportedly killed during this military operation to liberate 'Aqulah.\n* 28 November: IS claimed an attack led by masked gunmen on a motorcycle killing 4 Egyptian policemen in south of Cairo.\n* 28 November: Filipino authorities caught an Abu Sayyaf member linked to the kidnappings of 2 Malaysians in Sandakan earlier this year, one of whom, Bernard Then, was beheaded this month.\n* 28 November: Boko Haram members raided a border village in Niger, killing 4 people and torching some 50 homes. 2 other people were wounded in the assault, the attackers then fled to Nigeria. 11 people, including a soldier, were killed and another soldier seriously wounded in two separate attacks by Boko Haram in Cameroon's north.\n* 29 November: The international coalition conducted 15 strikes against IS in Iraq and Syria. In Iraq, 12 air strikes near 7 cities, including 5 near Ramadi, struck 6 of the militant group's tactical units as well as several fighting positions and vehicles. 3 strikes near Dayr Az Zawr and Al Hawl in Syria hit another tactical unit and destroyed an IS checkpoint as well as several pieces of equipment used by the militants.\n* 29 November: Afghan security forces killed at least 5 IS militants in eastern Afghanistan.\n* 29 November: At least four persons were killed and an unspecified number of teenage girls were abducted by Boko Haram insurgents from Bam village in Biu Local Government Area, Nigeria.\n* 30 November: Two men with French nationality were arrested attempting to join IS fighters in Libya via Tunisia.\nDecember 2015\n* 1 December: Georgian security services have announced the arrest of 4 men suspected of having ties to the Islamic State group.\n* 1 December: Boko Haram killed 8 people in an attack on a village in the southeast of Niger. At least 6 people have been killed and several others injured during a raid by Boko Haram insurgents on Gamgara, Nigeria.\n* 1 December: A Moroccan man was arrested, in Pamplona in Spain, for planning to join IS in Syria, by officers from Civil Guard.\n* 2 December: Cameroon's army has killed at least 100 Boko Haram militants and freed 900 hostages in a Nigeria border operation.\n* 2 December: Police in Italy and Kosovo detained 4 Kosovars, with IS contacts, for making threats against the pope and a U.S. diplomat.\n* 2 December: IS members have killed 2 members of an influential tribe in southeastern Yemen.\n* 2 December: 14 people were killed and 21 more injured in a mass shooting at San Bernardino, California, U.S. The suspects, married couple Rizwan Farook and Tashfeen Malik, were killed by the police and a police officer was wounded in the shootout. The female shooter, Tashfeen Malik, pledged allegiance to IS leader on Facebook.\n* 3 December: After a year of bombing IS in Iraq, the United Kingdom parliament authorized airstrikes against it in Syria.\n* 4 December: Abdullahi Abubakar who is reportedly number 58 on the published list of 100 wanted Boko Haram insurgents released by the military authorities  was arrested in Uba Askira area, Nigeria.\n* 5 December Three female suicide bombers killed about 30 at a crowded market on the island of Koulfoua in Lake Chad.\n* 5 December Three female Boko Haram suicide bombers killed about 30 at a crowded market on the island of Koulfoua in Lake Chad.\n* 6 December: At least 6 IS loyalists were killed by Afghan security forces, as ground and air operations continue to suppress the operations of the terror group in eastern Nangahrar province.\n* 6 December: The governor of the major Yemeni city of Aden and 6 bodyguards were killed in a car bombing. An attack IS said it committed.\n* 6 December: 3 soldiers were killed as the Nigerian military commenced an attack on Boko Haram deep inside the Sambisa Forest.\n* 7 December: A Danish Islamist tied to Paris attacks was allegedly killed by a drone attack on in the Syrian city of Raqqa. He has been reportedly killed along with a high-ranking IS member.\n* 9 December: Government troops intercepted a suspected ammunition courier of the Abu Sayyaf group in Sulu and recovered rounds of grenade launcher, in the Philippines.\n* 10 December: 7 civilians were killed by Boko Haram in the Kamuya village, which is located along the border between Borno and Yobe State, Nigeria. Dozens of civilians were abducted.\n* 11 December: The U.S. announces that a drone strike in Iraq in \"late November\" had killed IS finance minister Abu Saleh, a former Al Qaeda member. Two other finance figures had also been recently killed in Iraq: Abu Maryam and Abu Rahman al-Tunisi.\n* 11 December: The Catalan Police arrested Ali Charef Damache an IS militant, in a security raid. Damache is wanted by the US and the Interpol for providing support to terrorists. The suspect is originally from Algeria and has Irish nationality. IS forces captured the UNESCO heritage site of Sabratha.\n* 11 December: 14 people were killed, some of them decapitated, in a Boko Haram raid on a village in northeast Nigeria.\n* 12 December: Police and military authorities arrested a notorious member of the Abu Sayyaf Group who is facing a string of criminal cases for kidnapping and illegal detention, in Zamboanga, Philippines.\n* 15 December: 13 Abu Sayyaf bandits and 2 soldiers were killed in a firefight while 10 other soldiers were injured in Al Barka, Basilan, Philippines. 7 Army soldiers were wounded following an attack by 150 suspected Abu Sayyaf terrorists on a battalion headquarters in Patikul Sulu.\n* 16 December:  Serious offensive by ISIä forces, with 300 fighters attacking several Kurdish positions north and east of Mosul. Reports on the number of IS casualties varied, from 42 dead to hundreds.\n* 24 December: Some 200 al-Shabab fighters operating in the border region between Somalia and Kenya have pledged allegiance to IS. This move signifies a split within al-Shabab between those who are still loyal to al-Qaeda and this new splinter group. By switching allegiance the latter have answered a call made by Nigerian-based IS-affiliate Boko Haram to join IS. The group has already committed at least two attacks in the last two weeks, killing one soldier and two civilians.\n* 28 December: Iraqi forces retake a central government complex in Ramadi, viewed as the last major hurdle in the effort to expel IS from the city.  An Iraqi official, off record, stated that roughly 45% of the city remains under IS control, largely in the north and west.  A spokesman for Iraq's counter-terrorism forces has said that only about 100 IS members remain in the city.\n* 28 December On the morning two female Boko Haram suicide bombers detonated their explosives at a crowded market in Madagali. According to a local resident at least 28 were killed.\n* 30 December: IS's Caucasus branch attacked a group of tourists visiting the Naryn-Kala fortress in Dagestan; one person was killed and eleven injured.\n* 31 December: The United States Department of Justice announces the arrest of a Rochester, New York man alleged to have planned an IS-inspired attack on local New Year's Eve festivities.\nReferences"
    }
  ]
}