{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Ottawa history\n\nThis is a timeline of the history of Ottawa.\nHistory\n17th century\n*1610 – Étienne Brûlé is the first European to see the Chaudière Falls.\n*1613 – Samuel de Champlain passes the site of the future Ottawa on June 4.\n*1613 to 1663 – A 1613 royal charter from the King of France evolved to give successive groups monopolies to invest in the vast territory of New France, control the fur trade and manage colonization. Eventually, unable to cope with numerous difficulties including territorial battles with the British and First Nations, the charter was surrendered in 1663.\n*1650 – Nicolas Gatineau, a clerk in the Company of One Hundred Associates, an organization of fur traders, gives his family name to the river flowing into the Ottawa River, two miles (3&nbsp;km) from the present-day Hull sector of Gatineau.\n*1670 – The Hudson's Bay Company is formed by British royal charter and given trading monopoly over the watershed of all rivers and streams flowing into Hudson Bay – Rupert's Land.\n18th century\n*1759 – During the Seven Years' War, the British defeat the French on the Plains of Abraham and capture Quebec City\n*1763 – The Treaty of Paris is signed by Great Britain, France and Spain to mark the end of the Seven Years' War. It gives Britain control of all French territories in North America except the islands of Saint-Pierre and Miquelon near Newfoundland.\n*1776 – The American Revolution leads to the 1776 Declaration of Independence by thirteen colonies of British North America and the beginning of the United Empire Loyalists migration to Canada.\n*1783 – Britain and the United States sign the Treaty of Paris of 1783. By this agreement, Britain recognizes the independence of the thirteen colonies that rebelled in 1776.\n*1791 – The Constitutional Act of 1791, passed by the British Parliament, establishes the individually administered regions of Upper Canada and Lower Canada.\n*1792\n**Township B, later becoming Gloucester Township, was established.\n**Township D, later becoming Nepean Township, was established.\n*1800 – Philemon Wright establishes a farming community on the north bank of the Ottawa River at the Chaudière Falls arriving from Woburn Massachusetts on March 7 with his own and five other families and twenty-five labourers.  The community is known as Wright's Town and later becomes the City of Hull and subsequently the City of Gatineau.\n19th century\n*1805 – The Napoleonic Wars make the Ottawa Valley an attractive source of timber for the Royal Navy.\n*1806 – Philemon Wright, his 18-year-old son, Tiberius, and a party of men set out on June 11 to guide his first timber raft, named \"Colombo\", down the Ottawa River to the port of Quebec City. The voyage takes two months and marks the beginning of the boom in the timber, lumber and pulp and paper industries in the Ottawa Valley.\n*1809 – Jehiel Collins and his family become the first settlers in the region later known as Bytown.\n*1810 – Braddish Billings establishes a homestead and becomes the first settler in Gloucester Township, Ontario.\n*1811 – Ira Honeywell is the first settler in Nepean Township.\n*1812 – War of 1812.\n*1816 – The Duke of Wellington pointed out the necessity of making an interior water communication with Lake Ontario, so that supplies and boats might be thrown into the upper part of the country, in case of need.\n*1819\n**Royal Staff Corps constructed the Grenville Canal.\n**Isaac Firth opens the area's first tavern at Richmond Landing, near the present-day LeBreton Flats.\n*1821\n**Nicholas Sparks, one of Philemon Wright farmhands, purchases  of land on the south shore of the Ottawa River for 95 pounds. Today the original Sparks property, which includes the site of the parliament buildings and the downtown business district, is assessed at over one hundred million dollars.\n**Philemon Wright Jr, Philemon Wright's eldest son, dies in a stagecoach accident. In 1826, Philemon Jr's widow, Sarah (Sally) Olmstead-Wright, will marry Nicholas Sparks, who will in turn adopt her children. In 1833, Sarah's daughter Erexina will become the wife of Andrew Leamy.\n*1823\n**Three exploring parties were organized to explore the country from Lake Ontario to the Ottawa. One starting at Belleville came out at Pembroke, another from Kingston, arrived at this point, and a third party came out at Hawkesbury. The Duke of Wellington, gave his advice, and the line of the Rideau Canal was selected.\n**Sir George Ramsay, the Earl of Dalhousie and Governor-in-Chief of British North America purchases an extensive tract of land fronting the Ottawa River in preparation for the construction of the Rideau Canal.\n*1826\n**On September 26, Lieutenant Colonel By and the Earl of Dalhousie choose the location for the entrance to the Rideau Canal and consequently found a community where the City of Ottawa exists today. He negotiated reasonable terms with Mr. N. Sparks, who owned the land.\n**The town was laid out. From these points the town extended itself by contiguity: Wellington street, west of Bank street, from its being on the line from Hull; Sparks and Rideau streets, on each side of Sappers' bridge, from their proximity to the Locks, where work was going on, and the middle of Sussex and York streets, from the nearness of the wharf and market. Daly street and neighbourhood were thrown into the market, and Sandy Hill took a start.\n**The steamer began to call at the wharf near Stirling's Brewery.\n*1827\n**ByWard Market built.\n**Colonel By constructed the weir causeway, a truss bridge to connect Hull to Bytown.\n**Sir John Franklin, the famed Arctic explorer, lays the first stone of the Rideau Canal locks on August 16.\n**The name Bytown is first used to identify the community growing up around the Rideau Canal construction.\n**Bytown's first school, the English Mercantile and Mathematical Academy is established on Rideau Street.\n*1829\n**The first timber slide on the Ottawa River is constructed.  *1831–34 – Maplelawn constructed.\n**John Rochester, sen., and James Rochester established the Victoria Brewery\n*1832\n**The construction of the Rideau Canal is complete and the population of Bytown reaches 1,000.\n**On June 20, the first Board of Health in Bytown is formed to combat an epidemic of Asiatic cholera. A temporary hospital is built where the Royal Canadian Mint now stands on Sussex Drive. The location is selected to facilitate the care of boat passengers from Montreal as they disembark at what came to be known as Cholera Wharf.\n**Peter Dufour established a carriage & wagon works\n*1830s – Shiners' War: Labour unrest erupts within the lumber industry as some Irish immigrants unemployed upon completion of the Rideau Canal in 1832, a group known as Shiners, compete with the more experienced French Canadian timbermen for jobs\n*1836 – Bytown's first newspaper the Bytown Independent and Farmer's Advocate are published by James Johnston (Upper Canada politician).\n*1838 – Rideau Hall built.\n*1839 – An Assessment Roll sets the population of Bytown at 2,073.\n*1841 – The first election in Bytown for a seat in the Legislative Assembly of United Canada is held March 8.\n*1843\n**William Harris founds the Packet, a weekly newspaper. In 1851, the Packet becomes the Ottawa Citizen.\n**The Arch Riot takes place on Sunday August 20. Animosity between the Orangemen and Papists of Bytown erupts in fighting and stone throwing.\n**Lisgar Collegiate Institute founded.\n*1845\n**The Ottawa Hospital established.\n**On May 8, Élisabeth Bruyère and the Sisters of Charity establish a single ward hospital on Saint Patrick Street. The name General Hospital is taken from the description contained in its charter.\n**Élisabeth Bruyère established Ottawa Convent on Sussex at Nunnery Streets\n*1847\n**John Scott, a lawyer, became the first mayor of Bytown.\n**The Health Department was established in a basic form\n*1848\n**The College of Ottawa was founded\n**The City Foundry was established by T.M. Blasdell on Wellington Street\n**French Canadian Institute, a literary & scientific society, was organized\n**The City Foundry relocated to the Chaudiere Falls\n*1849\n**The Stony Monday Riot takes place on September 17.\n**First City Hall (Ottawa) built.\n*1850\n**After some controversy, the village of Bytown is incorporated as a town.\n**On March 11, the first town council meeting is held.\n*1851 – the Ottawa and Prescott Railway was opened.\n*1852 – The area of centertown lying between Bank and Elgin streets was built upon\n*1853\n**The Government sold the water-power of the Chaudiere Falls, causing the settlement of LeBreton flats\n**Andrew Leamy builds his steam powered sawmill on the south bank of the lake that today, still bears his name: Leamy Lake\n**Bytown boasts of having 60 stores, 3 banks, 3 insurance offices, 3 newspapers, 1 telegraph office and 7 schools.\n**J. B. Turgeon became the first French-Canadian mayor of Bytown.\n**Mechanics' Institute and Athenreum, a literary institute, was organized\n*1854\n**Bytown is linked by rail with the larger centers of Montreal and Toronto.\n**Stockdale & Brother's, established a Carriage & Wagon factory on Rideau Street\n*1855 – On January 1, Bytown is formally incorporated as a city. In gaining city status, Bytown adopts the name of Ottawa.\n*1856 – English-language Separate District School Board No. 53 is formed (in 1998, Ottawa and Carleton merged separate school boards, and in 2007, was renamed to the current name of Ottawa Catholic School Board).\n*1857\n**Queen Victoria approves choice of Ottawa as the capital of the Province of Canada.\n**Construction of buildings begins to prepare for arrival of government, with influx of workers.\n*1858\n**The Chaudiere Brewery was established\n**The County of Russell agricultural society was organized\n*1860\n**Prince Albert Edward, Prince of Wales (later King Edward VII) arrived in Ottawa as part of his wider royal tour of the province, and laid the cornerstone of the growing Centre Block, with a luncheon on the grounds for the workers and their families.\n**James McCullough established a tannery in 1860\n*1861 – The Ottawa Academy and Young Ladies' Seminary was established on Sparks Street.\n*1862\n**Nicholas Street Gaol built, Horsey, architect\n**The Royal Horticultural Society is established\n*1863\n**The first professional police force is established.\n**The Ottawa Literary Association was organized\n*1865\n**University of Ottawa founded.\n**St. Joseph's Orphanage established\n**General Hospital was erected by the Sisters of Charity, with accommodation for about 120 patients.\n**Society of Saint Vincent de Paul established to support the Roman Catholic population\n*1866 – Roman Catholic Archdiocese of Ottawa established.\n*1866–68 – 24 Sussex Drive, the future official residence of the Prime Minister of Canada, is built by lumberman and Member of Parliament, Joseph Merrill Currier, as a wedding gift for his wife to be.\n*1867\n**The British North America Act is ratified. Ottawa, with a population of 18,000, becomes the permanent capital of Canada.\n**The Ottawa Rowing Club is established with Sir John A. MacDonald (President);  His Worship the Mayor Robert Lyon (Vice-President) along with other notable gentlemen.\n**The Young Men's Christian Association was incorporated\n*1868 – On April 7, Thomas D'Arcy McGee is assassinated. Patrick J. Whelan is found guilty on circumstantial evidence and is hanged at the Nicholas Street Jail on February 11, 1869.\n*1870 – A vast fire burns its way from Arnprior to Ottawa. The city is saved from destruction only when a water barrier is created by cutting through a dam at Dows Lake.\n*1871\n**The seven lumber mills of Ottawa employ nearly 1,300 men and the value of lumber produced annually reaches $1.5 million. By this year, Ottawa's yearly output of lumber is unsurpassed in all Ontario.\n**Stadacona Hall built.\n**St. Charles' Home for the Aged established\n*1872 – Ottawa Trades Council founded.\n*1874\n**Major's Hill Park designated first city park.\n**Until this year a number of private companies were responsible for providing firefighting services with the City council providing a premium of 20 shillings to the first company to hose a fire. This arrangement led to arguments and fistfights between companies, often to the detriment of the poor householder as his home burnt to the ground. On December 20, 1874, Ottawa establishes a professional fire brigade.\n**Ottawa Normal School built.\n*1876 – Construction of first underground pipes and sewers. Ottawa households have running water.\n*1877\n**Victoria Tower Bell installed in Victoria Tower (Canada).\n**First demonstration of telephone in Ottawa.\n*1878 – Laurier House built.\n*1879 – First Great Dominion Exhibition is held in Ottawa and chaired by Charles Herbert Mackintosh. Later the exhibition grounds become Landsdowne Park, named after the Marquess of Lansdowne. Many citizens question the location of the park so far out in the country.\n*1881 – Ottawa’s population exceeds 25,000.\n*1883 – Original Ottawa Senators NHL team founded.\n*1885\n**Electricity comes to Ottawa.\n**Ottawa Journal founded.\n*1886\n**The Central Experimental Farm is established on  of land beyond the city’s south-western limits.\n**Smallpox epidemic kills 23.\n*1887 – Britannia Yacht Club founded\n*1888 – First annual Central Canada Exhibition held.\n*1889 – Old Supreme Court (Canada) opened.\n*1890 – Saint Brigid's Church (Ottawa) completed.\n*1891\n**Ottawa Car Company founded.\n**First electric streetcar line opens.\n*1892 – Ottawa Horticultural Society founded.\n*1895 – Ottawa's first paved street exists as of this date.\n*1897 – Caplan's opened.\n*1900\n**Hull-Ottawa fire decimates much of Hull and many buildings in Ottawa.\n**Goodwin House completed.\n20th century\n*1901 – The Duke and Duchess of Cornwall and York cap a visit to Ottawa with a run down the lumber slide at LeBreton Flats.\n*1906\n**Ottawa Public Library founded.\n**Booth House built.\n*1908 – Lansdowne Park site of city's first auto show.\n*1909 – Murphy-Gamble opened.\n*1912\n**Château Laurier and Canadian Museum of Nature completed.\n**Union Station opened.\n*1913\n**Ottawa Little Theatre founded.\n**1916 Federal Plan Commission (FPC) – planning of the Capital\n*1914 – Stornoway (residence) built.\n*1916\n**Connaught Building completed.\n**Victoria Tower (Canada) burns down. The present Peace Tower serves as a Canadian icon.\n*1917–1939 Federal District Commission (FDC) – planning of the Capital\n*1918 – Ottawa receives first delivery of airmail, from Toronto. An estimated 25,000 people and 1,000 automobiles pour onto the streets to celebrate the end of the war.\n*1919 – Influenza epidemic claims more than 500 lives.\n*1920\n**Ottawans crowd into Château Laurier ballroom to hear first local radio transmission of live concert from Montreal.\n**The Capital Cinema was constructed. With 2,530 seats, it was the largest movie theatre ever built in Ottawa and was regarded as one of the best cinemas designed by famed theatre-architect Thomas W. Lamb.  It was demolished in 1970.\n*1922 – A confrontation between 10,000 Orangemen and a gathering of Irish Catholics is narrowly averted when police persuade groups to go separate ways.\n*1924 – Champagne Bath and Plant Bath built.\n*1925 – Arches crack in the Victoria Museum and other buildings are damaged as Ottawa is rocked by its most severe earthquake since 1653.\n*1928 – Ottawa Flying Club incorporated.\n*1929 – 1929 Ottawa sewer explosion.\n*1931 – Statute of Westminster 1931.\n*1932 – British Empire Economic Conference.\n*1936 – First dial telephones installed in homes.\n*1937 – National War Memorial (Canada) relocated to Ottawa.\n*1938 – Gatineau Park created.\n*1943–1946 – The Federal Crown expropriated 24 Sussex Drive as the residence for the Prime Minister.\n*1948 – Ottawa Transportation Commission formed.\n*1951 – Louis St. Laurent became the first prime minister to take up residence at 24 Sussex Drive.\n*1953 – Montfort Hospital founded.\n*1959\n**National Capital Commission (NCC) – planning of the Capital\n**Ottawa Memorial unveiled by Queen Elizabeth II.\n**Streetcar service ends, transit now buses-only.\n*1964 – Diefenbunker completed.\n*1966\n**Ottawa Train Station built.\n**Centennial Flame inaugurated.\n*1967\n**Ryan Tower erected.\n**Library and Archives Canada opened.\n*1971 – transition to regional government\n*1972 – Mitel is established\n*1975\n**St. Pius X High School shooting.\n**National Capital Marathon started.\n**Great Canadian Theatre Company established.\n*1980 – Ottawa Jazz Festival founded.\n*1980s – Nabu Network operated.\n*1983 – The Transitway opens between Baseline and Hurdman stations.\n*1986 – Ottawa Courthouse opened.\n*1990 – Canadian Tribute to Human Rights monument unveiled.\n*1992\n**New Ottawa Senators NHL team founded.\n**Peacekeeping Monument built.\n*1993 – Ottawa Dragon Boat Race Festival founded.\n*1994\n**CKCU Ottawa Folk Festival (later CityFolk Festival) founded.\n**Ottawa Bluesfest founded.\n*1996 – The Palladium (later Canadian Tire Centre) opened.\n*1997 – Ottawa Fringe Festival founded.\n*1998 – Ottawa-Carleton District School Board created.\n21st century\n*2001\n**The O-Train (later Line 2) opened.\n**Ottawa metropolitan population: 1,070,000.\n*2004 – CBC Ottawa Broadcast Centre opened.\n*2006\n**National Capital Region (Canada) has a total population of 1,130,761.\n**Valiants Memorial dedicated.\n*2010 – Last Ottawa SuperEX held.\n*2013 – A collision between an OC Transpo bus and a Via Rail train leaves 6 dead and 35 injured.\n*2014\n**Lansdowne Park reopens after a large-scale renovation.\n**A terrorist attack takes place at the National War Memorial and Parliament Hill.\n*2017 – Several events are held in the city to celebrate the 150th anniversary of Canada\n*2019\n**An OC Transpo bus crash leaves 3 dead and 23 injured.\n**The City of Ottawa population surpasses 1,000,000.\n**The Confederation Line opened.\n*2022 – Convoy protests take place.\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.civilization.ca/cmc/exhibitions/cmc/archeo/kichisibi/welcome.shtml Ancient history of the Ottawa Valley] – The Canadian Museum of Civilization\n*[https://archive.today/20130110180820/http://www.bytownmuseum.com/EN/fifteen-1.html History of Ottawa] – Bytown Museum\n*[https://web.archive.org/web/20111006082708/http://www.virtualmuseum.ca/Exhibitions/Bytown/index_e.html History of the canal] – Virtual Museum of Canada"
    }
  ]
}