{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the history of Islam (15th century)\n\nThis is a timeline of major events in the Muslim world from 1400 AD to 1499 AD (803 AH – 905 AH).\n1400–1409\nGolden Horde\n* ca. 1400: Temur Qutlugh dies and is succeeded by Shadi Beg.\n* 1407: Shadi Beg is deposed and Edigu installs Pulad Khan as his successor.\nMamluk Empire\n*1400: The Burji Mamluks lose Syria to Tamerlane.\nOttoman Empire\n* 1402–1403: Beyazid I is defeated at the Battle of Ankara and  taken captive by Tamerlane. An interregnum period begins when the sons of Beyazid I compete for the Ottoman throne.\nTimurid Empire\n* 1405: Tamerlane dies and is succeeded by his son, Shah Rukh.\n1410–1419\nGolden Horde\n* 1410: Pulad Khan is deposed in favor of Timur.\n* 1412: Timur is deposed in favor of Jalal ad-Din khan, the first of Tokhtamysh's sons to take power since his death.\n* 1413: Jalal ad-Din khan is deposed in favor of his brother, Karim Berdi.\n* 1414: Karim Berdi is deposed in favor of Kebek.\n* 1416: Kebek Khan is deposed in favor of Yeremferden, the brother of Karim Berdi and Jalal ad-Din khan.\n* 1419: Yeremferden is assassinated; control of the Horde is split between Dawlat Berdi and Olugh Mokhammad.\nOttoman Empire\n* 1413: Interregnum period ends and Mehmed I becomes Sultan.\nNogai Horde\n* 1419: Edigu is assassinated by Olugh Mokhammad, who assumes his place as Khan, re-uniting it with the Golden Horde.\n1420–1429\nGolden Horde\n* 1420: Dawlat Berdi captures Sarai and expands his sphere of influence beyond the Crimean Peninsula.\n* 1423: Baraq defeats Dawlat Berdi and Olugh Mokhammad and takes control of the Horde. Olugh Mokhammad flees to Lithuania.\n* 1427: With the assistance of Vytautas the Great, Olugh Mokhammad and Dawlat Berdi defeat and kill Baraq.\nKara Koyunlu\n* 1420: Qara Yusuf dies and is succeeded by his son, Qara Iskander.\nMorocco\n* 1420: Abu Said Othman is assassinated and succeeded by Abdul Haq, his infant son.\nTunisia\n*1424: The Hafsids come to power.\n*1429: The Hafsids attack the island of Malta and take 3000 slaves although they do not conquer the island. Piracy against Christian shipping particularly grows during the rule of Abd al-Aziz II (1394–1434).\nUzbeks\n* 1425: Abul Khayr takes control of the Little jüz.\n1430–1440\nAk Koyunlu\n* 1434: Qara Osman dies and is succeeded by Ali Beg.\n* 1438: Ali Beg is overthrown by his brother, Hamza.\nGolden Horde\n* 1432: Dawlat Berdi is assassinated and Hacı I Giray conquers the Crimea, founding the Crimean Khanate.\n* 1437: Olugh Mokhammad is defeated by Sayid Ahmad I, who takes control of the Horde.\nKara Koyunlu\n* 1434: Qara Iskandar is deposed in favor of his brother, Jahan Shah.\nKhanate of Kazan\n*1438: Olugh Mokhammad founds the Khanate of Kazan.\nMamluk Empire\n* 1438: Barsbay dies and his son, Jamaluddin Yusuf, is prevented from taking power in a coup orchestrated by Saifuddin Gakmuk.\nTunisia\n* 1434: Abdul Faris dies after forty years of rule and is succeeded by Abu Abdullah Muhammad.\n* 1435: Abu Abdullah Muhammad is deposed in favor of Abu Umar Othman.\nUzbeks\n* 1430: Abul Khayr occupies Khwarezmia.\n1440–1449\nAk Koyunlu\n* 1440: Hamza is overthrown by Jahangir, a son of Ali Beg.\nOttoman Empire\n* 1444: The Anti-Ottoman League of Lezhe in Albania is formed by Scanderbeg. Murad II voluntarily abdicates from his throne in favor of his son Mehmed II after the former's defeat at the hands of crusaders at the Battle of Varna.\n* 1446: Murad II reclaims the throne.\n* 1448: The Ottomans are victorious at the Second Battle of Kosovo. Serbia is annexed and Bosnia is made a vassal.\nTimurid Empire\n* 1446: Shah Rukh dies and is succeeded by Ulugh Beg.\n* 1449: Ulugh Beg dies and is succeeded by 'Abd al-Latif.\nUzbeks\n* 1449: Abul Khayr captures Farghana.\n1450–1459\nAk Koyunlu\n* 1453: Jahangir dies and is succeeded by his son, Uzun Hassan.\nGreat Horde\n* 1459: Küchük Muhammad dies and is succeeded by his son, Maxmud.\nMamluk Empire\n* 1453: Gakmuk dies and is succeeded by his son, Fakhruddin Othman, who is then overthrown by Saifuddin Inal.\nOttoman Empire\n* 1451: Murad II dies and is succeeded by his son, Mehmed II.\n* 1453: Constantinople is captured.\n* 1456: Wallachia is made a vassal.\nTimurid Empire\n* 1450: 'Abd al-Latif is assassinated and succeeded by Abu Sa'id.\n1460–1469\nOttoman Empire\n* 1462: Albania is annexed.\nMamluk Empire\n* 1461: Saifuddin Inal died and is succeeded by his son, Shahabuddin Ahmad, who is then overthrown by Saifuddin Khushqadam.\nGreat Horde\n* 1465: Maxmud founds the Astrakhan Khanate after he is deposed by his brother, Akhmat Khan.\nKara Koyunlu\n* 1467: Jahan Shah is killed in a surprise attack arranged by his rival, Uzun Hasan, leader of Ak Koyunlu. Ak Koyunlu then annexes Kara Koyunlu.\nMorocco\n* 1465: Abdul Haq is assassinated, ending the Marinid dynasty. Sharif Muhammad al Jati assumes power.\nMamluk Empire\n* 1465: Khushqadam dies and is succeeded by his son, Saifuddin Yel Bey, who is then deposed by Temur Bugha.\n* 1468: Temur Bugha is deposed by Qaitbay.\nKazakh Khanate\n* 1465: Kazakh nobles Abu Sa'id Janibek Khan and Kerei Khan rebel against Uzbek ruler Abu'l-Khayr Khan and form their own independent state, the Kazakh Khanate.\nUzbeks\n* 1468: Abu'l-Khayr Khan dies and is succeeded by his son Haidar Sultan.\nAk Koyunlu\n* 1467: Kara Koyunlu is annexed.\n* 1468: The Timurids are defeated at the Battle of Qarabagh. Ak Koyunlu then becomes the masters of Persia and Khorasan.\nTimurid Empire\n* 1469: Abu Sa'id dies; the Timurid state. In Husayn Bayqarah maintains control of Greater Khorasan.\n1470–1479\nMorocco\n* 1472: Sharif Muhammad al Jati is overthrown by Muhammad al Shaikh, establishing the Wattasid dynasty.\nKazakh Khanate\n* 1473: Kerei Khan, the first ruler of the Kazakh Khanate, dies and Abu Sa'id Janibek Khan succeeds him as the empire's second ruler.\nOttoman Empire\n* 1473: Mehmed II defeats sultan Uzun Hasan of Ak Koyunlu at the Battle of Otluk Beli.\n* 1475: The Khanate of Crimea is conquered and made a vassal state. Venice is defeated and the Ottoman Empire becomes master of the Aegean Sea.\nAk Koyunlu\n* 1478: Uzun Hasan dies and is succeeded by his son, Khalil ibn Uzun Hasan.\n* 1479: Khalil Hasan is overthrown by his uncle, Y‘aqub ibn Uzun Hasan.\n1480–1489\nGreat Horde\n* 1480: Akhmat Khan is assassinated and succeeded by his son, Said Ahmad II.\n* 1481: Said Ahmad II is overthrown by his brother Murtada.\nKazakh Khanate\n*1480: Abu Sa'id Janibek Khan dies and is succeeded by his nephew Burunduk, who is the son of Kerei Khan.\nOttoman Empire\n* 1481: Mehmed II dies and is succeeded by Beyazid II. Cen Sultan rebels.\nUzbeks\n* 1488: Haider Sultan dies and is succeeded by his nephew, Shaybani Khan.\nTunisia\n* 1488: Abu Umar Othman dies and is succeeded by Abu Zikriya Yahya.\n* 1489: Abu Zikriya Yahya is overthrown by Abul Mumin.\n1490–1500\nTunisia\n* 1490: Abul Mumin is overthrown and Abu Zikriya Yahya retakes the throne.\nIberia\n* 1492: Granada is captured by Spain, ending 800 years of Muslim rule in Spain.\nAk Koyunlu\n* 1493: Y‘aqub ibn Uzun Hasan dies and is succeeded by his son, Baisonqur ibn Y‘aqub.\n* 1495: Baisonqur is overthrown by his cousin, Rustam ibn Maqsud.\n* 1497: Maqsud is overthrown by his cousin, Ahmad Gövde ibn Muhammad.\nMamluk Empire\n* 1496: Qaitbay abdicates and is succeeded by his son, Nasir Muhammad.\n* 1498:  Nasir Muhammad is deposed and replaced by Zahir Kanauh.\nUzbeks\n* 1499: Shaybani Khan conquers Transoxiana.\nGreat Horde\n* 1499: Murtada dies and is succeeded by Said Ahmad III.\nOttoman Empire\n* 1499: the Ottoman fleet defeats the Venetians in the Battle of Zonchio.\nSee also\nTimeline of Muslim history\nReferences\n*Bosworth, Clifford Edmund, The New Islamic Dynasties: A Chronological and Genealogical Manual, p.&nbsp;253. Edinburgh University Press, 2004."
    }
  ]
}