{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of women in warfare and the military in the United States, 2000–2010\n\nThis article lists events involving women in warfare and the military in the United States from 2000 until 2010. For 2011 onward, please see Timeline of women in warfare and the military in the United States, 2011–present.\nEleanor Mariano, USN (Ret.)]]\nCoral Wong Pietsch, United States Army, (Ret.)]]\nVernice Armour, USMC (Ret.)]]\nAnnette E. Brown, USN (Ret.)]]\nDeborah Loewer, USN (Ret.)]]\n, former acting United States Secretary of the Navy]]\nJessica Lynch, United States Army (Ret.)]]\nShoshana Johnson, United States Army (Ret.)]]\nFrances M. Vega, United States Army]]\n, former General Counsel of the Air Force]]\nCarol I. Turner, USN]]\nKimberly Hampton, United States Army]]\nBarbara Fast, United States Army, (Ret.)]]\nDana H. Born, USAF (Ret.)]]\nRebecca S. Halstead, Army (Ret.)]]\nMichelle S. Jones, USAR (Ret.)]]\nJeanine Menze, USCG]]\nJanis Karpinski, United States Army (Ret.)]]\nRamona M. Valdez, USMC]]\nElizabeth Jacobson, USAF]]\nSusan Y. Desjardins, USAF]]\nMargaret C. Wilmoth, USAR]]\nNicole Malachowski, USAF]]\nJill Metzger, USAF]]\nEmily Perez, United States Army]]\nGale Pollock, United States Army (Ret.)]]\nMargaret D. Klein, USN]]\nMegan McClung, USMC]]\nMaritza Sáenz Ryan, United States Army]]\nNancy Elizabeth Brown, USN (Ret.)]]\nAngela Salinas, USMC (Ret.)]]\nMaría Inés Ortiz, United States Army]]\nGretchen S. Herbert, USN]]\nLori Robinson USAF, Ret.]]\nElizabeth Hight, USN]]\nMelissa Stockwell, United States Army (Ret.)]]\nTracy L. Garrett USMC]]\nAnn E. Dunwoody, United States Army (Ret.)]]\nSuzanne Lachelier, USN]]\nLee Price, United States Army (Ret.)]]\nTeresa King, United States Army (Ret.)]]\nEleanor V. Valentin, USN]]\nSandra L. Stosz, USN (Ret.)]]\nColleen L. McGuire, United States Army (Ret.)]]\nHolly Graf, United States Navy (Ret.)]]\nCarol M. Pottenger, United States Navy]]\nNora Tyson United States Navy(Ret.)]]\nMargaret G. Kibben, United States Navy]]\n, United States Army]]\n2000\n* Spring: The first woman commands a U.S. Navy warship at sea (Kathleen McGrath). The vessel is assigned to the Persian Gulf.\n* 1 June: Deborah Walsh became the first woman in the U.S. Coast Guard promoted to chief warrant officer in Aviation Engineering (AVI).\n* 1 July: Regina Mills became the U.S. Navy's first female Aviation Deck LDO.\n* July: Lucille \"Pam\" Thompson became the first African-American woman to serve as a U.S. Coast Guard special agent. She served in this capacity until July 2004.\n* The U.S. Air Force promoted the first female pilot to brigadier general.\n* U.S. Navy women are among the victims when the USS Cole is attacked by a suicide bomber in Yemen.\n* The Women at Sea (WAS) Distribution and Assignment Working Group was established in the U.S. Navy.\n* The Army National Guard promoted the first woman to major general.\n* First woman in the U.S. Coast Guard promoted to Flag Officer: RADM Vivien Crea.\n* First woman in the U.S. Coast Guard promoted to Reserve RADM: Mary P. O'Donnell, USCGR.\n* First African-American woman in the U.S. Coast Guard promoted to master chief petty officer: Angela McShan.\n* Eleanor Mariano became the first Filipino-American woman to be promoted to rear admiral in the navy.\n2001\n* Spring: Coral Wong Pietch became the first woman Army Judge Advocates General (JAG), and the first Asian-American woman to reach the rank of general in the United States Army.\n* 11 September: During the 9/11 terror attacks, U.S combat pilots Lt. Col. Marc H. Sasseville and Lt. Heather \"Lucky\" Penney-García were ordered to bring down the hijacked airliner United Airlines Flight 93 by ramming their F-16s into it. The plane crashed in Pennsylvania before they could do so, however. Furthermore, in the attack at the Pentagon ten active duty, reserve, and retired servicewomen were among the casualties. Servicewomen were activated and deployed in support of the war on terrorism.\n* The first female Blue Angel flight surgeon was Lt. Tamara Schnurr, who was a member of the 2001 team.\n* An Air National Guard security force woman became the first woman to complete the U.S. counter-sniper course, the only U.S. military sniper program open to women at the time.\n* Soledad Rodriguez became the first woman assigned to the Deep Submergence Unit (DSU) in the Navy.\n* The US Army Women's Museum opened at Ft. Lee, Virginia.\n* Susan Woo became the first female West Point cadet to win an East/West Center Scholarship.\n* Kimberly Pienkowski became the first female West Point cadet to win a first team all-America in air rifle.\n* COL Ann Horner became the first female garrison commander at West Point.\n* CDR Sharon Donald-Baynes became the first African-American woman to command an operations ashore unit in the U.S. Coast Guard when she took command of Group Lower Mississippi River based in Memphis, Tennessee.\n* ENS Andrea Parker became the first black woman to graduate with an engineering degree from the U.S. Coast Guard Academy.\n* CAPT Norma Hackney became the first woman in the U.S. Navy to have a major combatant command afloat, USS Saipan (LHA 2).\n* CMDCM Evelyn Banks became the first female Command Master Chief of an Airwing in the U.S. Navy, CVW-14.\n2002\n* March: Vernice Armour becomes the first African-American female combat pilot in the United States military. She flew the AH-1W SuperCobra attack helicopter in the 2003 invasion of Iraq and eventually served two tours in support of Operation Iraqi Freedom.\n* June: CAPT Jane M. Hartley, USCGR, was designated as the Commanding Officer of Marine Safety Office Wilmington, North Carolina and as such became the first woman in the U.S. Coast Guard to become Captain of the Port.\n* October: Diane E. Beaver lawyer and former officer in the United States Army. drafted a legal opinion Judge Advocate General Corps advocating for the legality of harsh interrogation techniques that were being proposed for use at Guantanamo, including waterboarding; exposure to extremes of temperature; the use of non-injurious physical contact; and \"scenarios designed to convince the detainee that death or severely painful consequences are imminent for him and/or his family.\" She also advised that Category II and III methods (the harshest) \"undergo a legal review prior to their commencement\".\n* 29 October: Rear Admiral Annette E. Brown, USN assumed duties as commander, Navy Region Southeast on 29 October 2002. Brown was the first woman to command Navy Region Southeast.\n* Lieutenant Junior Grade Angelina Hidalgo, USCG, became the second Hispanic-American female to command an afloat unit.\n* An enlisted female U.S. Marine (Sergeant Jeannette L. Winters) is killed in an aircraft crash in Pakistan, the first woman to die in the Global War on Terror (specifically Operation Enduring Freedom).\n* The U.S. Defense Advisory Committee on Women in the Services (DACOWITS) is issued a new charter narrowing its focus to issues pertaining to military families, recruitment, readiness and retention. A retired Marine three-star general is appointed chairman of the new, downsized advisory committee.\n* For the first time in US history, a woman becomes the top enlisted advisor in one of the military components. She is sworn in as the Command Sergeant Major of the US Army Reserve.\n* Jeannie Huh becomes the first female West Point cadet to win a Mitchell Scholarship.\n* Lauren Rowe becomes the first West Point cadet to win Patriot League \"Defensive Player of the Year\" award in women's soccer and only the second to win regional first-team all-America recognition.\n* Then-CDR Gail Kulisch took command of the Atlantic Strike Team, becoming the first female commanding officer of a Strike Team in the U.S. Coast Guard.\n* Cadet 1/c Sarah Salazar became the first Hispanic female regimental commander at the U.S. Coast Guard Academy.\n* CAPT Deborah Loewer became the first female SWO (1110) to be selected for flag officer in the U.S. Navy.\n* MIDN 1/C Emelia Spencer became the first woman from the U.S. Naval Academy to be selected as a Rhodes Scholar.\n* CMDCM Jacqueline DiRosa became the first female Force Master Chief in the U.S. Navy (Bureau of Medicine and Surgery – BUMED).\n* Sheryl Gordon became the Alabama National Guard's first female general officer.\n2003\n* January: 2003 US Air Force Academy sexual assault scandal emerges.\n* March: PFC Jessica Lynch, USA, is embroiled in a controversy over differing accounts of her capture and rescue in Iraq.\n* March: Shoshana Johnson becomes the first black female prisoner of war in United States history.\n* 23 March: SPC Lori Piestewa, USA, is killed in action. She is the first woman soldier to be killed in action in the 2003 Iraq Conflict, and the first Native American woman to be killed in action while serving in the United States Military.\n* 7 April: Capt Kim Campbell, USAF, gains favorable notice when she successfully pilots her aircraft back to base despite extensive damage in a combat mission.\n* October, RDML Deborah Loewer, SWO, became the first warfare qualified woman promoted to flag rank in the U.S. Navy.\n* 15 September: SPC Alyssa Peterson, United States Army, died a \"non-hostile weapons discharge\" at the Tal Afar airbase on the Syrian–Iraqi frontier. Subsequent investigation revealed that she had been placed under suicide watch after refusing further participation in interrogation sessions which she said constituted torture of Iraqi prisoners.\n* 2 November: SPC Frances M. Vega, United States Army, was killed as a surface-to-air missile was fired by insurgents in Al Fallujah and it hit the U.S. Chinook helicopter that she was in. She was one of 16 soldiers who lost their lives in the crash that followed.\n* December: U.S. Coast Guard helicopter pilot LCDR Sidonie Bosin was recognized by the First Flight Centennial Commission's 100 Heroes Committee (formed for the commemoration of the Wright Brothers first powered flight) as being one of the \"top 100 aviators of all time.\" She was also the first female aviation officer in charge of air crews deployed to the Coast Guard cutter Polar Sea in the Antarctic, including one of an all-female flight crew.\n* Kayla Williams, United States Army, was deployed to Iraq. She later wrote about her experiences in her book, Love My Rifle More Than You.\n* Mary L. Walker, the General Counsel of the Air Force, gained notoriety for her role in a 2003 review by the United States Department of Defense of the so-called Torture Memos.\n* The U.S Marine Corps Logistics Base's first female brown belt instructor was certified (Cpl. Theresa Barnes).\n* First active-duty women in the U.S. Coast Guard to serve in a combat zone: when CGC Boutwell served in the Persian Gulf in support of Operations Enduring Freedom and Iraqi Freedom from January 2003 to June 2003.\n* LT Holly Harrison became the first U.S. Coast Guard woman to command a cutter in a combat zone. She was also the first Coast Guard woman to be awarded the Bronze Star Medal.\n* Rear Admiral Carol I. Turner became the first female chief of the U.S. Navy Dental Corps.\n* Sarah Schechter became the first female rabbi in the U.S. Air Force.\n* Air Force Academy removed its sign stating \"Bring Me Men\". In 2004 they replaced it with a sign stating \"Integrity First. Service Before Self. Excellence in All We Do,\" which is the Air Force's statement of core values.\n* The U.S. Navy opens Sea Operational Detachments (SEAOPDETS) to women.\n* CMDCM Beth Lambert became the first female command master chief of an aircraft carrier in the U.S. Navy, .\n* CMDCM Evelyn Banks became the first female CNOCM of U.S. Navy Recruiting.\n2004\n* 2 January: CPT Kimberly Hampton, USA, becomes the first female military pilot to be shot down and killed by an enemy in United States history. She is also the first female combat casualty in Iraq from South Carolina.\n* 9 April: SPC Michelle Witmer is killed in Baghdad. She is the first woman from the United States National Guard to be killed in action in history. Her sister was subsequently removed from action by the military, citing the risk that enemy forces might target her in an effort to harm U.S. morale.\n* 13 August:  MGySgt. Abigail D. Olmos, support equipment asset manager, became the first female Master Gunnery Sergeant in her field.\n* 25 August: Publication of the Fay Report on Abu Ghraib torture and prisoner abuse. Major General Barbara Fast, United States Army, the senior military intelligence officer serving in Iraq during the period of time when the abuses occurred, was exonerated of any wrongdoing. She also received praise for improving intelligence collection efforts when the Iraqi insurgency was growing in the summer of 2003, and changes she put in place \"improved the intelligence process and saved the lives of coalition forces and Iraqi civilians,\" according to Army Maj. Gen. George Fay.\n* September: Brig Gen Dana H. Born, USAF, becomes the dean of faculty at the United States Air Force Academy. She is the first woman to hold that position.\n* 30 October: SPC Megan Ambuhl, USA, is convicted of dereliction of duty at Abu Ghraib prison in Iraq in relation to detainee abuse.\n* 12 November: MAJ Tammy Duckworth, USA, loses both legs when the UH-60 Black Hawk helicopter she was co-piloting was hit by a rocket-propelled grenade fired by Iraqi insurgents. This makes her the first female double amputee from the Iraq war.\n* Katie MacFarlane graduates West Point as the Patriot League's all-time leading rebounder in both men's and women's basketball and is the Army women's basketball record-holder in scoring, rebounding and field goals.\n* BG Rebecca S. Halstead (USMA '81) becomes the first female West Point graduate to attain the rank of general officer. Before the end of the year, BG Anne Macdonald (USMA '80) becomes a second.\n* Michelle Weinbaum, a West Point cadet, becomes the first fencer in the 72-year history of the Intercollegiate Women's Fencing Association to win three consecutive invitational titles.\n* Master Sergeant Lisa Girman, United States Army, as well as other members of the Army, received discharges for misconduct for allegedly mistreating Iraqi prisoners. Their discharges were eventually reversed and the allegations misconduct were cleared. Another soldier, Shawna Edmondson, agreed to an \"other-than-honorable\" discharge in exchange for dismissal of criminal charges\n* The Commanding Officer billet aboard Patrol Coastal (PC) ships was opened to female officers in the U.S. Navy.\n* The first woman in US Air Force history takes command of a fighter squadron.\n* Then-CDR Meredith Austin of the U.S. Coast Guard took command of the National Strike Force Coordination Center, becoming the first female commanding officer of the center.\n* YNC Crystal A. Sparks of the U.S. Coast Guard became the first female Company Commander School Chief at TRACEN Petaluma.\n* LCDR Rhonda Fleming-Makell was the first African-American female U.S. Coast Guard officer to earn a 20-year retirement.\n* YNCM Pamela J. Carter was the first female active duty master chief petty officer in the U.S. Coast Guard to retire with 30 years of active-duty service when she retired on 1 June 2004.\n* First female commanding officer of the U.S. Coast Guard Institute: Theresa Tierney, August 2004.\n* Wendi Carpenter became the U.S. Navy's first female aviator admiral.\n* LCDR Louvenia A. McMillan became the U.S. Coast Guard's first African American female Intelligence Officer and the first African American female Field Intelligence Support Team Leader.\n* Jill Morgenthaler, a retired U.S. Army Reserve Colonel, handles press duties for the army, including the Abu Ghraib scandal.\n* First Lieutenant Melissa Stockwell, a U.S. Army officer, becomes the first American female soldier to lose a limb in the Iraq War.\n* American Iraq veterans Kelly Dougherty and Diana Morrison co-found Iraq Veterans Against the War with other veterans.\n* By year's end, 19 U.S. servicewomen had been killed as a result of hostile action since the war in Iraq had begun in 2003, the most servicewomen to die as a result of hostile action in any war that the nation had participated in.\n* Daniella Kolodny became the first female rabbi enlisted in the U.S. Naval Academy.\n* Sergeant Lacey, a military interrogator in the Guantanamo Bay detention camp in Cuba, was implicated in FBI reports to the Department of Defense, alleging that she had been observed inflicting abuse on her interrogation subjects.\n* Sandy Cooper became the first female fire chief in the Air Force Reserve.\n* After Merryl Tengesdal completed her Navy obligation, she continued her military career by transferring to the Air Force to fly the Lockheed U-2S Dragon Lady at Beale Air Force Base in Northern California. She was promoted to Major and began flying the U-2 in 2004, the first African-American woman to do so.\n2005\n* 18 March: Kathlene Contres became the Commandant of the Defense Equal Opportunity Management Institute (DEOMI). She was the first Latina woman to lead the institute since it was established in 1971.\n* April: Major General Kathryn Frost retired as commander of the United States Army and Air Force Exchange Service. At the time of her retirement, she was the highest-ranking woman in the United States Army.\n* May: Janis Karpinski, USA, is demoted from brigadier general to colonel, although her demotion is not formally related to the abuse at Abu Ghraib torture and prisoner abuse scandal.\n* 3 May: SPC Lynndie England, USAR, pleads guilty to abusing Iraqi prisoners in Abu Ghraib torture and prisoner abuse scandal.\n* 16 May: SPC Sabrina Harman, USAR, is convicted of one count of conspiracy to maltreat detainees, four counts of maltreating detainees and one count of dereliction of duty in connection with the Abu Ghraib torture and prisoner abuse scandal.\n* 23 June: Cpl. Ramona M. Valdez and Lance Cpl. Holly A. Charette became the first female Marines killed in Iraq when an improvised explosive device detonated near their convoy vehicle in Fallujah. Navy Petty Officer 1st Class Regina R. Clark dies in the same incident, becoming the first female Seabee killed in action. Valdez was posthumously honored by the U.S. Marine Corps when the II MEF Communications Training Center was dedicated as the Valdez Training Facility.\n* 27 June: Bunny Greenhouse, a former chief contracting officer Senior Executive Service (Principal Assistant Responsible for Contracting (PARC)) of the United States Army Corps of Engineers, testified to a Congressional panel, alleging specific instances of waste, fraud, and other abuses and irregularities by Halliburton with regard to its operations in Iraq since the 2003 invasion. She described one of the Halliburton contracts (secret, no-bid contracts awarded to Kellogg, Brown and Root (KBR)a subsidiary of Halliburton) as \"the most blatant and improper contract abuse I have witnessed during the course of my professional career\".\n* 19 July: Private first class Lavena Johnson, United States Army, was found dead. Her death was officially ruled a suicide, but it has attracted international attention due to allegations that it was actually a rape and murder.\n* August: U.S. Army soldier Selena M. Salcedo pleads guilty to assaulting an Afghan prisoner, Dilawar, who died as a result of mistreatment.\n* 28 September: United States Airman First Class Elizabeth Jacobson is killed in Operation Iraqi Freedom. She is the first female airman to be killed in Operation Iraqi Freedom.\n* December: Brig Gen Susan Y. Desjardins, USAF becomes the first female commandant of cadets at the United States Air Force Academy, and the first woman in the history of any of the academies to be appointed to this position.\n* Margaret C. Wilmoth, United States Army Reserve, was promoted to brigadier general, becoming the first nurse and first woman to command a medical brigade as a general officer.\n* Khara Keegan becomes the first female West Point cadet to receive the \"Outstanding Boxer Awards\" at the 49th Brigade Boxing Open.\n* 1LT Laura Walker (USMA '03) becomes the first female West Point graduate to be killed in action when she is killed in Kandahar, Afghanistan.\n* Michele S. Jones was the first woman in the United States Army Reserve to reach the position of command sergeant major of the U.S. Army Reserve.\n* LT Marisa McClure reported as first female CO of a PC in the U.S. Navy.\n* RDML Wendi Carpenter became the second woman warfare qualified flag officer and the first woman aviator of that rank in the U.S. Navy.\n* LTJG Jeanine McIntish-Menze became the first African-American female U.S. Coast Guard aviator on 24 June 2005.\n* SGT Leigh Ann Hester, USA, received the Silver Star for her actions in Iraq during an enemy ambush on their convoy near the town of Salman Pak. She killed at least 3 of the attacking insurgents. Hester was the first female soldier to receive the award for exceptional valor since World War II and the first woman ever to receive the silver star for close combat.\n* Captain Carolyn Wood, United States Army was alleged by Amnesty International to be centrally involved in the 2003 Abu Ghraib and 2002 Bagram prisoner abuse cases.\n* Selena M. Salcedo pleaded guilty to charges of dereliction of duty and assault in connection with the abuse of an Afghan prisoner, Dilawar,  who later died. Salcedo had been a sergeant at the time of the deaths.  Following her conviction she was reduced in rank to Specialist.\n2006\n* March: Public debut of Maj Nicole Malachowski, USAF, the first woman pilot selected to fly as part of the Air Force Air Demonstration Squadron (Thunderbirds), and the first woman on any US military high performance jet team. She was selected in 2005.\n*April: 2LT Balreet Khaira and 1LT Jasleen Khaira become the first pair of siblings of Indian descent to commission into the U.S Army National Guard. [https://www.americanbazaaronline.com/2014/10/10/indian-american-khaira-sisters-pride-california-army-national-guard/ Indian American Khaira sisters are the pride of the California Army National Guard]\n* 13 March: Capt. Elizabeth A. Okoreeh-Baah, USMC, became the first female MV-22 Osprey pilot.\n* August: Vice Admiral Nancy Elizabeth Brown assumed duties as the director, Command, Control, Communications and Computer Systems (C4 Systems), The Joint Staff.\n* On 2 August 2006, Angela Salinas became the first Hispanic woman to become a United States Marine Corps general officer. She also is the first woman to command a Marine Corps Recruit Depot.\n* September: Major Jill Metzger, USAF disappears for three days in Bishkek, Kyrgyzstan. Although initially accused of going AWOL, she was cleared of the charges when it was confirmed that she was kidnapped.\n* 8 September: SFC Meredith Howard, USA, is killed in action in Afghanistan. At age 52, she is the oldest American female soldier to be killed in combat.\n* 12 September: Second lieutenant Emily Perez is killed in Iraq. She was the Command Sergeant Major in the history of the United States Military Academy at West Point. She was the first female graduate of West Point to die in Iraq.\n* October: MG Gale Pollock, RN, CRNA, BSN, became acting Surgeon General of the United States Army for nine months following 20 March 2007 retirement of her predecessor, Kevin C. Kiley, due to fallout from the Walter Reed Army Medical Center neglect scandal. She is the first woman and the first non-physician to hold the position. During her tenure, she received criticism in a brewing scandal involving personality disorder discharges from the military.\n* December: The number of American servicewomen killed in Iraq and Afghanistan reaches 70, more than the total from the Korean War, the Vietnam War, and Operation Desert Storm. The 70 women represent less than two percent of the American deaths in Iraq and Afghanistan.\n* December: Margaret D. Klein, USN, becomes the first female Commandant of Midshipmen at the United States Naval Academy.\n* 6 December: Maj Megan McClung, USMC, became the first female Marine officer to die in Iraq. Her death also made her the first female graduate of the U.S. Naval Academy to be killed in the line of duty.\n* 12 December: Major Gloria D. Davis, United States Army, was found dead from a gunshot wound, one day after allegedly confessing to financial improprieties. Her death was ruled a suicide, however, this is disputed. The gunshot wound to her head was in her left temple, but she was right-handed.\n* The U.S. Coast Guard appointed the first female Vice Commandant of the Coast Guard, making her the first woman in history to serve as a deputy service chief in any of the U.S. Armed Forces.\n* Vivien Crea became the first female Vice Commandant of the United States Coast Guard and the Coast Guard's first female vice admiral.\n* Judith Keene became the first female commandant of cadets at the United States Coast Guard Academy. During her tenure, she had to deal with a court martial in which cadets testified that sexual assault issues at the academy were not taken seriously.\n* The U.S. Marine Corps assigns the first female Marine in history to command a recruit depot.\n* CWO3 Mary Ward became the first female warrant boatswain to command a U.S. Coast Guard station when she took command of Station Port Canaveral in 2006, where she served until her retirement on 16 June 2006.\n* CWO2 Apple G. Pryor, assigned as the main propulsion assistant on board the CGC Boutwell, was the first African-American female naval engineering chief warrant officer of the U.S. Coast Guard.\n* LT Isabel Papp was the first female medical officer to be assigned to a PSU in the U.S. Coast Guard. She was also the first Hispanic female MD to be assigned to a PSU and was also the first Hispanic female Physician's Assistant in the Coast Guard Reserve.\n* LT Rachel Lewis was the first African-American female officer in the U.S. Coast Guard to serve aboard USCGB Eagle as command cadre (operations officer), 2006–2008.\n* Chief of Naval Operations-directed Command Master Chief (SW/AW) FLTCM Jacqueline DiRosa assumed duties as fleet master chief, U.S. Fleet Forces Command, on 17 July 2006, making her the first U.S. woman to hold the office of a fleet-level master chief.\n* CAPT Cindy Talbert became the first female LDO to obtain the rank of captain in the U.S. Navy.\n* HTCS(SW)Tanya DelPriore became the first female selected as a command senior chief in the U.S. Navy.\n* CMDCM April Beldo became the first female command master chief of Recruit Training Command, Great Lakes, in the U.S. Navy.\n* MC1 Jackey Bratt became the first female combat photographer to be awarded the Bronze Star in the U.S. Navy.\n* Maritza Sáenz Ryan became the first woman and first Hispanic (Puerto Rican and Spanish heritage) West Point graduate to serve as an academic department head at West Point.\n* Sue C. Payton became United States Assistant Secretary of the Air Force (Acquisition).\n2007\n* February: Kimberly Rivera, formerly United States Army, went AWOL and fled to Canada. She was the first female U.S. military deserter to flee to Canada.\n* 2 March: Sara Joyner became the first woman in the U.S. Navy to assume command of an operational fighter squadron.\n* Spring: Spc Sorimar Perez and Spc Amanda Landers become the first women in the history of the United States military to become Avenger crewmembers. The positions were restricted to males until October 2006.\n* April: Monica Lin Brown, Specialist in the United States Army stationed in Afghanistan, saves the lives of her fellow soldiers by running through gunfire and using her body as a shield while mortars fell nearby. She earned a Silver Star medal for her actions.\n* April: Yvette Gonzalez Davids became the first Hispanic woman to command a U.S. Navy warship.\n* 10 July: María Inés Ortiz became the first American nurse to die in combat during Operation Iraqi Freedom and the first U.S. Army nurse to die in combat since the Vietnam War.\n* 21 September: Lori J. Robinson became the first Air Battle Manager and first woman 552nd ACW commander to be frocked to brigadier general while stationed at Tinker AFB, Oklahoma.\n* 25 September: AMT2 Katrina Cooley became the first African-American female HH-65 Flight Mechanic in the U.S. Coast Guard.\n* 28 September: Ciara Durkin, a member of the Massachusetts National Guard, died while deployed in Afghanistan. Her death was ruled a suicide but her family disputed this. She was a lesbian and the first known LGBT soldier to die in Iraq or Afghanistan.\n* December: RADM Elizabeth Hight, USN, became Vice Director of the Defense Information Systems Agency (DISA).\n* Elizabeth Loncki was the first woman from Delaware to die in combat in Operation Iraqi Freedom.\n* HTCS(SW) Tanya DelPriore became the first woman in the U.S. Navy to be awarded the Expeditionary Warfare Pin.\n* CMDCM Evelyn Banks became the first female Command Master Chief of the U.S. Naval Academy.\n* NCCS(SW/AW) Cynthia Patterson became the first female Command Senior Chief of a Littoral Combat Ship (LCS) in the U.S. Navy – USS Independence, LCS 2 BLUE.\n* CMDCM Laura Martinez became the first African American female Force Master Chief of Bureau of Medicine and Surgery (BUMED) in the U.S. Navy.\n* Lana Hicks was the first African American woman selected to the ranks of CWO5 in the U.S. Navy.\n* Mary Cunningham became the first African-American female and the first active-duty female in the U.S. Coast Guard to make Chief Damage Controlman when she was promoted from DC1 to DCC on 1 August 2007.\n* Martha E. Utley became the first female master chief for the Health Services rating in the U.S. Coast Guard.\n* The first woman in US Naval history took command of a fighter squadron.\n* U.S. Spec. Jamiell Goforth became the first female soldier to win the Forces Command Soldier of the Year competition.\n* The Service Women's Action Network was established in 2007 to provide U.S. female veterans with resources and community support to help them heal their wounds and readjust to civilian society. SWAN has since become a 501(c)3 human rights organization providing national policy advocacy and direct services to U.S. servicewomen and female veterans.\n* LCDR Louvenia A. McMillan became the U.S. Coast Guard's first African-American woman to hold the Advanced Boat Force Operations Insignia.\n* Tracy L. Garrett was promoted to Brigadier General, and subsequently served as the first female Inspector General of the Marine Corps.\n2008\n* April: Melissa Stockwell becomes the first American Iraq War vet to be chosen for the Paralympics.\n* 10 April: Squaw Peak, Arizona is renamed Piestewa Peak in honor of Lori Piestewa.\n* 1 June: Jennifer Lowden became the first female school chief for Training Center Yorktown in the U.S. Coast Guard. She also became the first female MKCS in the Coast Guard when she was promoted on 1 August 2008.\n* 26 June: VADM Vivien Crea becomes the first and only woman to be recognized as the USCG Ancient Albatross.\n* 30 September: As of this date, over 200,000 women are serving active duty in the United States military.\n* 14 November: Lieutenant General Ann E. Dunwoody, U.S. Army, becomes the first U.S. military female officer to be promoted to the rank of four-star general.\n* Anita K. Blair served as acting Assistant Secretary of the Navy (Manpower and Reserve Affairs) in 2008.\n* Lieutenant colonel Nancy J. Paul, USAF, was appointed as the Presiding Officer for Ibrahim al Qosi's Guantanamo military commission.\n* Commander Suzanne Lachelier, USN was among the military attorneys assigned to defend detainees at Guantanamo Bay detention camp. She is the first defense lawyer to be allowed to a top-secret location, known as Camp 7 or Camp Platinum, where former CIA detainees are held at Guantanamo.\n* The Pentagon reports that the number of reports of sexual assault in the U.S. military rose by 8 percent this year from 2007.\n* Shawna Kimbrell becomes the first black female fighter pilot in the U.S. Air Force.\n* Christy Isis Achanzar becomes the first Filipina to graduate from West Point.\n* The U.S Marines began using Female Engagement Teams.\n* Gender-neutral lyrics were incorporated into West Point's \"Alma Mater\" and \"The Corps\"replacing lines like \"The men of the Corps\" with \"The ranks of the Corps\".\n* Kisha Makerney became the first female U.S. soldier deployed to a combat zone after losing a limb.\n2009\n* January: Kim Rivera, the first female soldier to flee the U.S. military for Canada, is deported back to the United States after losing her appeal in Canadian court.\n* 20 February: Lt. Col. Brenda Cartier becomes the first female flying squadron commander in the United States Air Force Special Operations Command.\n* 15 April: The book The Lonely Soldier: The Private War of Women Serving in Iraq is published. It consists of forty interviews of female veterans discussing their experiences of rape, sexual assault, and sexual harassment by their male counterparts.\n* 20 November: Lee Price became the first female program executive officer in the United States Army.\n* September: The United States Army makes Command Sgt. Maj. Teresa King the first woman to oversee drill sergeant training in its 235-year history.\n* October: Eleanor Valentin became the first female flag officer to serve as director of the United States Navy Medical Service Corps.\n* 24 November: Jene Newsome is outed as a lesbian by Rapid City Police Department after they saw an Iowa marriage license on her kitchen table. She was honorably discharged under Don't Ask, Don't Tell. This raised controversy about the policy.\n* The first pregnant midshipman graduated from the United States Naval Academy in 2009. While regulations expressly forbade this, the woman was able to receive a waiver from the Department of the Navy.\n* CMDCM(AW/SW) JoAnn Ortloff became the first female Operational (numbered) Fleet Command Master Chief in the U.S. Navy, when assigned to COMTHIRDFLT.\n* LT Felicia Thomas took command of the CGC Pea Island on 19 June 2009. She is the first African-American female commanding officer of a U.S. Coast Guard cutter.\n* LT Carrie Wolfe and LT Olivia Grant became the first African-American female Engineering Officers on a \"major\" cutter in the U.S. Coast Guard when they reported aboard the CGC Spencer and CGC Venturous respectively in the summer of 2009.\n* CAPT Sandra L. Stosz was promoted to RADM, becoming the first female graduate of the Coast Guard Academy to reach flag rank.\n* Roslyn L. Schulte was killed in action in the U.S. war in Afghanistan, making her the first female United States Air Force Academy graduate to be killed by enemy action and the second female graduate killed in action.\n* Statistics from the U.S. Defense Department state that one in 10 U.S. soldiers in Iraq and Afghanistan are female, and more women have fought and died in the Iraq war than any since World War II.\n2010\n* 14 January – BG Colleen L. McGuire assumed command as the commanding general of the United States Army Criminal Investigation Command and the 13th Provost Marshal General, the first woman to hold either position.\n* 23 January – Captain Holly Graf, USN, was relieved of command of USS Cowpens by Rear Admiral Kevin Donegan, commander of Carrier Strike Group Five, as non-judicial punishment stemming from an admiral's mast. The punishment followed an investigation which verified allegations of cruelty and maltreatment of her crew, and conduct unbecoming an officer.\n* February – The Secretary of Defense signed a letter notifying Congress that the U.S. Submarine Forces were being opened to women.\n* March – DoD announced that RADM Carol M. Pottenger was nominated for appointment to the rank of VADM and an assignment as Deputy Chief of Staff for Capability Development, Supreme Allied Command Transformation, in Norfolk, VA. She is the first female SWO 3-star Admiral in the U.S. Navy.\n* 5 March – Jackalyne Pfannenstiel became Assistant Secretary of the Navy (Installations and Environment).\n* 9 April – LTJG La'Shanda Holmes became the first African-American female helicopter pilot in the U.S. Coast Guard.\n* 29 April – The Department of the Navy announced authorization of a policy change allowing women to begin serving on board U.S. Navy submarines. The new policy and plan is set to begin with the integration of female Officers. A group of up to 24 female Officers (three Officers on each of eight different crews) are scheduled to enter the standard nuclear submarine training pipeline in July 2010 and expected to report to submarine duty by late 2011 or early 2012. Integration of enlisted females into submarine crews is expected to begin soon thereafter.\n* June – Engineman 1st Class (SW) Isa Grace became the first enlisted woman in the U.S. Navy to qualify as Engineering Officer of the Watch (EOOW) aboard the USS Mesa Verde (LPD-19).\n* 1 June – Martha E. Utley became the first woman to serve as command master chief for the U.S. Coast Guard HSWL service center.\n* July – The United States Department of Veterans Affairs increases its gender-specific services by 21 percent.\n* 29 July – Nora W. Tyson began serving as the commander of Carrier Strike Group Two (CCSG2). Tyson was the first female commander of a U.S. Navy Carrier Strike Group.\n* 14 October – Command Sgt. Maj. Donna A. Brock, United States Army, retired. At the time of her retirement, she was the Army's longest serving enlisted female soldier on active duty.\n* Ifong Lee became the first Samoan CWO2 in the U.S. Coast Guard.\n* CWO2 Rosie McNeill became the first female ISS warrant officer in the U.S. Coast Guard.\n* Rear Adm. Margaret Kibben became the first female chaplain of the U.S. Marine Corps.\n* Ali Thompson becomes the first female U.S. Marine pilot to command a squadron. Lt. Col. Ali Thompson, a CH-53E pilot, took command of HMH-464 on board MCAS New River, NC, relieving Lt Col Richard Rush.\n* For the first time, all four of the U.S. Navy's sailors of the year are women. They are: Pacific Fleet Sailor of the Year – Operations Specialist 1st Class (SW) Samira McBride, assigned to the destroyer Lassen; Fleet Forces Sailor of the Year – Hospital Corpsman 1st Class (SW/AW) Ingrid J. Cortez, amphibious assault ship Bataan; Reserve Sailor of the Year – HM1 Shalanda Brewer, Navy Expeditionary Medical Unit 10; CNO Shore Sailor of the Year – Cryptologic Technician (Technical) 1st Class (SW) Cassandra Foote, Center for Information Dominance Learning Site, Pensacola, Fla.\n* In 2010 Sgt. Sherri Gallagher became the first woman to win the title of Soldier of the Year at the Best Warrior Competition.\n* Army Women's Iraqi Freedom Veterans (AWIFV), America's first all-female, all-Native American color guard, was founded in 2010 by Mitchelene BigMan. This organization would be reorganized under Native American Women Warriors (NAWW) in 2013.\n* Candice Griffith became the first woman officer from Montana to lead soldiers into Afghanistan.\n* Dawn Dunlop took command of the 412th Test Wing at Edwards Air Force Base in California, making her the first female commander of a test wing in the U.S. Air Force.\n* Courtney Beard became the first female airman to complete the 18-hour Army Cavalry Spur Ride.\nSee also\n*Timeline of women in war in the United States, pre-1945\n*Timeline of women in warfare in the United States from 1900 to 1949\n*American women in World War I\n*American women in World War II\n*Timeline of women in warfare in the United States from 1950 to 1999\n*Timeline of women in warfare and the military in the United States from 2011–present\nReferences"
    }
  ]
}