{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Gaza war (7 October 2023 – 27 October 2023)\n\nThis timeline of the Gaza war covers events from 7 October until 27 October 2023.\nOctober 2023\nsatellite data of fires on the day of Al-Aqsa Flood; the 41 km (25 mi) long Gaza Strip is shown nearly in full. (Top is west.)]]\n7 October\n* At 6:30&nbsp;a.m. IST, air raid sirens were activated in southern and central Israel in response to Hamas missiles. Concurrently, Muhammad Deif, the leader of the Hamas' military wing, announced in a ten-minute recorded message published online the start of \"Operation Al-Aqsa Flood\", and that \"the enemy will understand that the time of their rampaging without accountability has ended\", urging Palestinians to attack Israeli settlements with whatever weapons they had. Approximately 1,200 Israeli civilians and soldiers were killed in the Hamas-led attack, while around 250 others were kidnapped.\n* 06:56 First militants arrive to Be’eri and initiate the Be'eri massacre.\n* 07:00: The Supernova Music Festival near the Re'im kibbutz was attacked by Hamas militants, some of whom arrived via motorized paragliders. Of the approximately 3,000 to 5,000 people at the festival, 364 were killed and 40 abducted.\n* 07:40: The Israel Defense Forces (IDF) confirmed that Hamas militants had entered southern Israel and asked residents of Sderot and other cities to remain indoors.\n* 08:15: Sirens were activated in Jerusalem following a rocket barrage that landed in the forested hills on the city's western edge.\n* 08:23: Israel declared a state of alert for war, activating its reservists, in response to continued rocket attacks.\n* 08:34: Israel announced that it had begun counteroffensive operations against Hamas.\n* 10:47: The Israeli Air Force (IAF) began attacking Gaza.\n* 11:35: Prime Minister Benjamin Netanyahu made his first statement about the conflict via Twitter, declaring that Israel is at war.\n* 12:21: the IDF began operations to relieve cities in southern Israel as the number of rockets launched from Gaza increased to over 1,200.\n* 12:29: The United States made its first statement, through the National Security Council, which condemned the terrorist attack and reaffirmed US support for Israel.\n* 16:08: President Joe Biden spoke with Netanyahu and expressed his condolences and support, later declaring during a speech that US support for Israel was \"...solid and unwavering\".\n* 18:00: The Israeli security cabinet said on 8 October that a state of war had officially begun at this time.\n* It was later discovered that the 7 October rocket attacks included a strike on a putative nuclear missile site. The rocket hit the grounds of Sdot Micha military base, on the outskirts of East Jerusalem.\n* Bruno Mars' concert in Tel Aviv scheduled that evening was cancelled due to the attack on Israel.\n8 October\n* Israel formally declared a state of war under Article 40A for the first time since the 1973 Yom Kippur War. 300,000 reservists are called up, the most in the nation's history. Its declared aim is to eliminate Hamas's military capabilities and end its rule over the Gaza Strip.\n* Evacuations of residents in Israel living near the Gaza Strip were ordered, and Netanyahu appointed former brigadier general Gal Hirsch as the government's point man on missing and kidnapped citizens. A total lockdown was imposed on the West Bank by the IDF.\n* US Defense Secretary Lloyd Austin ordered the deployment of the USS Gerald Ford carrier strike group to the eastern Mediterranean. The US Air Force augmented its F-35, F-15, F-16, and A-10 squadrons in the region. Hamas condemned the US Navy deployment as \"aggression against the Palestinian people\".\n* The Israeli Air Force conducted strikes on sites in Gaza City, including destroying Palestine Tower which housed around 100 apartments, a cinema, and Hamas radio stations.\n*Israeli forces killed a Palestinian during confrontations at the northern entrance to Jericho, three Palestinians during clashes at the Qalandia military checkpoint and another Palestinian was shot dead during clashes in Hebron city. Subsequently a fourth Palestinian died from his wounds.  Israeli forces killed a Palestinian during confrontations at Beita.\n*OCHA confirmed that in the West Bank, including East Jerusalem, \"between 7 and 8 October, as of 21:00, 13 Palestinians, including a 12-year-old child, were killed by Israeli forces in various areas across the West Bank.\" One was killed while attacking or allegedly attempting to stab a soldier near Ramallah. Another was killed during clashes near Nablus. The remaining eleven Palestinians were all killed \"during demonstrations in solidarity with the Gaza Strip and other confrontations involving stone throwing.\"\n9 October\n* Defense Minister Yoav Gallant announced a \"total\" blockade of the Gaza Strip that would cut electricity and block the entry of food and fuel, adding that \"We are fighting human animals and we are acting accordingly.\"\n* The IAF flew C-130 and C-130J heavy transport planes to various locations in Europe to collect hundreds of off-duty IDF personnel to be deployed in the conflict.\n* Alim Abdallah, deputy commander of the 300th Brigade of the IDF's 91st Division, was killed by a Hezbollah attack at the Lebanese border.\n*OCHA confirmed that in the West Bank, including East Jerusalem, \"between 7 and 9 October, as of 16:00, 15 Palestinians, including four children, were killed by Israeli forces in various areas across the West Bank.\"\n10 October\n* The United Nations Relief and Works Agency (UNRWA) announced that four of its employees had died in airstrikes in Gaza.\n* The IAF struck more than 70 targets in and around Daraja and Tuffah districts of Gaza City.\n* Advanced weaponry from the US arrived in Israel, its first such shipment of the war.\n* President Biden noted in a briefing that \"Hamas does not stand for the Palestinian people's right to dignity and self-determination. Its stated purpose is the annihilation of the State of Israel and the murder of Jewish people.\" and characterized its assault as \"an act of sheer evil\".\n* Houthi leader Abdul-Malik al-Houthi announced that any intervention in Gaza by the US would result in their intervention.\n* Israel's Coordinator of Government Activities in the Territories (COGAT) revoked all work permits issued to Gaza residents, stripping Gazan workers of their legal status under Israeli law and triggering a wave of administrative detentions.\n*OCHA confirmed that \"Between 7 and 10 October, as of 16:00, 19 Palestinians, including three children, were killed by Israeli forces in various areas across the West Bank.\"\n*An Israeli airstrike on a house in Deir el-Balah killed 18 people and injured 23 others including five children and three women.\n11 October\n* Israeli warplanes attacked and destroyed several buildings in and around the Islamic University of Gaza.\n* The sole power plant in Gaza ceased operations after running out of fuel because of Israel's blockade.\n* Pope Francis called for the release of all hostages held by Hamas and expressed concern over Israel's \"total siege\" of Gaza.\n* Hezbollah took responsibility for attacks made against IDF forces with \"precision missiles\".\n* The Israel Border Police fatally shot two Palestinians in East Jerusalem.\n* The United States held talks with Egypt regarding a humanitarian corridor via its Gaza border crossing near the city of Rafah.\n* Israeli forces bombed the Gaza–Egypt Rafah Border Crossing.\n* Israeli forces killed at least 27 Palestinians during clashes in the West Bank since October 7. It is reported that the entire West Bank has been placed under an Israeli lockdown.\n*Israeli settlers attacked the village of Qusra, killing four Palestinians. A 16-year old was fatally shot by the IDF in Bani Naim, while another person was also shot dead by the IDF near Bethlehem.\n12 October\n* US military equipment arrived at Nevatim Airbase, and the USS Gerald Ford strike group arrived in the eastern Mediterranean.\n* The IAF attacked more than 200 targets in Gaza.\n* The IDF carried out artillery strikes in Syria after a number of mortars were launched toward northern Israel.\n* Israel announced that Gaza would not receive water, fuel, or electricity until the hostages were freed.\n* Israel confirmed the bombing of Damascus and Aleppo International Airports in Syria.\n13 October\n* An internal leaked US State Department e-mail advised senior diplomats to avoid three phrases in their public statements: \"de-escalation/ceasefire\", \"end to violence/bloodshed\", and \"restoring calm\". Accordingly, the word \"ceasefire\" was scarcely mentioned on subsequent communications.\n* Gazans began fleeing to the south of the enclave (de facto beyond Wadi Gaza) after an IDF warning the day before of combat operations of 24 hours notice. The UN, warning of a humanitarian catastrophe, urged Israel to rescind its evacuation order, as did Amnesty International.\n* An evacuation route on Salah al-Din street was bombed; the Gaza health ministry claimed 70 dead.\n* Hamas told Gazans in the northern region (some 1.1&nbsp;million people) to remain in place.\n* The Vatican offered mediation.\n* The IDF launched localized raids on Hamas cells.\n* Turkish aid arrived in Egypt bound for Gaza.\n* Tensions are reportedly high in East Jerusalem and the occupied West Bank. Israel refused entry to Palestinians younger than 60 who came for Friday noon prayer at al-Aqsa Mosque. Israeli forces have killed at least 35 Palestinians in the West Bank since October 7, authorities said.\n*16 Palestinians have been killed by Israeli forces in the West Bank, for a total of 51 since October 7, according to the Palestinian health ministry.\n14 October\n* The IDF announced two routes with safe passage between 10:00&nbsp;a.m. and 4:00&nbsp;p.m. IDT (07:00–13:00 UTC) for mass evacuation.\n* Israel and Egypt announced that the Rafah crossing would be opened to foreign nationals from noon to 5:00&nbsp;p.m.\n* The US authorized the departure of non-emergency personnel from its embassy in Jerusalem.\n* Red Crescent ambulances in Gaza were struck by the IAF.\n* The IAF bombed a building in southern Khan Yunis.\n* The commander of Hamas's aerial unit, who was intimately involved in planning the 7 October attack, was killed by an Israeli airstrike.\n* UNRWA announced on Twitter that its shelters were no longer safe, deeming it an unprecedented situation. It also said water was running out.\n* Israel said that the war could take months. A record number of 360,000 reservists had reported for duty.\n* During a meeting with UN diplomat Tor Wennesland, Iranian foreign minister Hossein Amir-Abdollahian asserted that Iran will intervene in the war if Israel continues its military operations or launches a ground invasion against Gaza.\n* Under-Secretary-General for Humanitarian Affairs and Emergency Relief Coordinator Martin Griffiths said \"the noose around the civilian population in Gaza is tightening\".\n* According to a statement by the Archbishop of Canterbury, Justin Welby, a rocket damaged the upper two floors of the Al-Ahli Arab Hospital cancer treatment center, which contained the ultrasound and mammography wards, and injured four staff members.\n15 October\n* Israel Border Police arrested more than 50 Palestinians in the occupied West Bank according to the Palestinian news agency Wafa. Minor clashes between Hezbollah and the IDF continued in and around the Shebaa Farms and elsewhere at the Lebanon–Israel border.\n* Israel informed US National Security Advisor Jake Sullivan that water pipes had been turned back on in southern Gaza.\n* The Egyptian Red Crescent, WHO, and other NGOs and volunteer groups began stockpiling humanitarian supplies at Rafah Crossing.\n* UNRWA chief Philippe Lazzarini noted that Gaza's supply of clean drinking water was running out, stating at a press conference that Gaza \"was running out of life\".\n* Four Gazan hospitals were rendered inoperable while the IDF demanded that 21 hospitals in northern Gaza evacuate according to the WHO.\n* The Committee to Protect Journalists said at least twelve journalists had been killed and eight wounded to date, while two others were missing. They variously free-lanced or worked for Agence France-Press, Ain Media, Al-Aqsa Radio, Al-Ghad, Al-Jazeera, Al-Khamsa News, Fourth Authority News Agency, Khabar Agency, Israel Hayom, Sky News Arabia,  Reuters, Sowt Al-Asra Radio (Radio Voice of the Prisoners, and Smart Media.\n* Hamas fired multiple rockets towards jerusalem.\n16 October\n* The carrier USS Eisenhower left Naval Station Norfolk in Virginia to join the USS Gerald R. Ford as an added measure of deterrence in the eastern Mediterranean.\n* Iran threatened \"pre-emptive\" attacks against Israel, indicating further region-wide escalation of the war.\n*President Biden in an interview on 60 Minutes said that an Israeli occupation of Gaza \"would be a big mistake\", adding that he was \"confident Israel will act under the rules of war\". He also said that Hamas must be eliminated, that there must be a path to a Palestinian state, and regarded the initial Hamas attack as consequential as \"The Holocaust\".\n* Khan Yunis, a city of 400,000, was swamped by a million refugees.\n* Hamas released its first video of a hostage (an Israeli). Abu Obeida, the spokesperson for the military wing of Hamas, claimed that the group was holding ~200 hostages, with \"dozens\" in the hands of various factions.\n* Israel attacked the Rafah border crossing.\n* Israeli Minister without portfolio Gideon Sa'ar stated that \"Gaza must be smaller at the end of the war\".\n* The World Health Organization stated there were only \"24 hours of water, electricity and fuel left\" before \"a real catastrophe\" in Gaza, adding that the situation was \"spiralling out of control.\"\n*Doctors warned of an impending disease outbreak due to hospital overcrowding and unburied bodies.\n* The same day, the World Health Organization stated there were only \"24 hours of water, electricity and fuel left\" before \"a real catastrophe.\"\n17 October\n* An explosion occurred at the al-Ahli Arab Hospital where displaced Palestinians were seeking shelter; according to Al Jazeera, nearly 500 people have been killed. The IDF claimed that a Palestinian Islamic Jihad (PIJ) rocket attack had failed, whereas the Gazan Health ministry claimed that it was an IDF airstrike. Initially, independent analyses indicated that it was likely a failed Palestinian rocket attack. These analyses turned out to be based on misidentification of an unrelated Israeli rocket as a malfunctioning Palestinian rocket, but media organizations, notably AP, maintained this was the most likely explanation. Two videos of a different explosion in Gaza, which took place less than a minute earlier, were often incorrectly described (by AP and Fox News) as depicting the al-Ahli explosion.\n* Protests related to the al-Ahli explosion erupted worldwide, including in Ramallah and Hebron in the occupied West Bank. Protestors from Ramallah demanded the \"downfall\" of Palestinian president Mahmoud Abbas.\n* The US State Department raised its travel advisory to Lebanon to Level 4: Do Not Travel.\n*Updating the ongoing Gaza-Israel hostilities, OCHA reported 1300 fatalities in Israel according to Israeli official sources and 3000 in Gaza plus 61 fatalities in the West Bank, according to the Palestinian Ministry of Health since October 7.\n18 October\n*President Biden arrived in Tel Aviv, but a planned summit in Amman, Jordan with Jordanian, Egyptian, and Fatah leaders was cancelled due to the al-Ahli hospital bombing. He expressed support for Israel and for the \"legitimate aspirations of the Palestinian people\", but did not call for a ceasefire.\n*The World Health Organization stated the situation in Gaza was \"spiralling out of control.\"\n*The United States vetoed a UN resolution urging humanitarian aid to Gaza.\n* Doctors Without Borders stated severely wounded patients would die as the health system collapsed.\n19 October\n*British Prime Minister Rishi Sunak visited Israel, during which Netanyahu called Hamas \"the new Nazis\".\n*While patrolling the Red Sea, the American destroyer USS Carney shot down three cruise missiles and several drones launched from Yemen by Houthis, apparently towards Israel.\n* The campus of the Greek Orthodox St. Porphyrius Church in Gaza was struck by the IAF.\n* The US State Department issued a rare world-wide alert advising American citizens \"to exercise increased caution\".\n*Biden delivered his second Oval Office speech, calling the conflict \"an inflection point in history\", and tying it with the 2022 Russian Invasion of Ukraine.\n* The IAF bombed around 100 targets in multiple airstrikes over the night of 18–19 October.\n* Airstrikes hit the area around al-Quds Hospital.\n* Updating the ongoing Gaza-Israel hostilities, OCHA reported 1400 fatalities in Israel according to Israeli official sources and 3785 in Gaza plus 79 fatalities in the West Bank, according to the Palestinian Ministry of Health since October 7.\n* Amid clashes all over the West bank, Palestinian health authorities said that 13 Palestinians, including five children, were killed in clashes in Nur Shams while the Israeli military reported one of its officers killed. A spokesperson for U.N. human rights chief Volker Türk said \"We are extremely alarmed by the rapidly deteriorating human rights situation in the occupied West Bank and the increase in unlawful use of lethal force.\"\n*Gaza's only cancer hospital announced it had \"perilously low\" levels of remaining fuel.\n* Doctors stated pediatric patients had developed gastroenteritis infections because of the lack of clean water.\n* The Red Cross stated Gaza's entire health system was \"on its knees\".\n20 October\n* Two UNRWA workers were killed in Gaza.\n* United Nations Secretary-General António Guterres visited the Rafah Crossing.\n* Israeli Defense Minister Yoav Gallant announced that after the destruction of Hamas, Israel would relinquish control of the Gaza Strip and that a new security regime shall be set up for Israel.\n*President Biden said the first trucks of humanitarian aid to Gaza would be delivered within \"24 to 48 hours.\"\n* Doctors Without Borders stated thousands of people were at risk of dying \"within hours\" because it was \"impossible\" to give them medical attention.\n21 October\n*Hamas released two hostages to the International Red Cross: namely American-Israeli mother and daughter Judith and Natalie Raanan; Their release followed mediation by Qatar.\n*Protests broke out in the West Bank in support of Gaza. Footage showed protesters flying the flags of Fatah and Russia, and holding portraits of Russian president Vladimir Putin, and North Korean leader Kim Jong Un.\n*Israel's National Security Council told its citizens to leave Lebanon and Egypt \"as soon as possible\".\n*Twenty trucks of the first humanitarian aid (excluding fuel) to Gaza entered through the Rafah crossing.\n* An online appeal was launched in Pakistan to find volunteer healthcare workers for the Gaza Strip. By the following week, about 1,000 doctors had signed up to travel to Gaza.\n*OCHA reported 1400 fatalities in Israel according to Israeli official sources and 4385 in Gaza plus 84 fatalities in the West Bank, according to the Palestinian Ministry of Health, since October 7.\n* Medical Aid for Palestinians and UNICEF issued an \"urgent warning\" that 130 premature babies would die if fuel did not reach Gaza hospitals soon.\n22 October\n* A second tranche of humanitarian aid arrived at Rafah Crossing consisting of 17 trucks, some of which carried fuel.\n*14 more Israeli communities were evacuated near the border with Lebanon due to continuing clashes.\n*Israeli forces conducted a raid into Khan Yunis to locate hostages held by Hamas and target \"terrorist infrastructure\". They were engaged by Hamas's Qassam Brigades, which reported destroying two bulldozers and a tank. The IDF reported one soldier was killed and three injured by an anti-tank missile.\n*Israel conducted an airstrike on the Al-Ansar Mosque in Jenin in the occupied West Bank, killing two and injuring three.\n*UNRWA announced it would run out of fuel within three days, resulting in \"no water, no functioning hospitals and bakeries\".\n* The People's Liberation Army of China deployed six warships to the Middle East.\n* A UN statement signed by UNDP, UNFPA, UNICEF, WFP and WHO stated deaths could soon \"skyrocket\" from disease and \"lack of healthcare\".\n23 October\n* Omar Daraghmeh, a Hamas official, died in an Israeli prison in what Hamas claimed to be an assassination. He had been arrested in the West Bank by the IDF on October 9, along with his son.\n*Hamas released two more hostages to the Red Cross, both elderly female Israelis, following mediation by Egypt and Qatar. Their husbands remained in captivity.\n* The Qassam and Al-Quds Brigades announced they had attacked IDF positions near Erez with rockets, mortars and drones, at around 4:30 PM local time.\n*OCHA reported 1400 fatalities in Israel according to Israeli official sources and 5087 in Gaza according to the Gaza Ministry of Health plus 95 fatalities in the West Bank, since October 7.\n* A Health Ministry spokesman announced the healthcare system had \"totally collapsed\", with 65 medics killed, 25 ambulances destroyed, and many hospitals soon shutting down due to lack of fuel.\n24 October\n* At a press conference, one of the released Hamas hostages, 85-year old Yocheved Lifshitz, said that she \"went through hell\", but that she was treated well in captivity. She said the hostages in her group walked through kilometers of tunnels; she was eventually sequestered with several others under sanitary albeit spartan conditions with medical care and sustenance.\n25 October\n* Israel said it hit multiple Hezbollah targets in Lebanon, including a military compound.\n* The family of Al-Jazeera journalist Wael Al-Dahdouh was killed in an Israeli airstrike in Gaza.\n* Turkish President Recep Tayyip Erdogan said in a speech that \"Hamas is not a terrorist organization, but a \"mujahideen liberation group struggling to protect its people and lands.\"\n*OCHA reported ~1400 fatalities in Israel according to Israeli official sources and 6547 in Gaza according to the Gaza Ministry of Health plus 102 fatalities in the West Bank, since October 7. There were two Israeli fatalities, one in each of Gaza and the West Bank.\n* (Dr.) Ashraf al-Qudra, of the Health Ministry, stated the health system was \"completely out of service\".\n26 October\n* Netanyahu stated Israel had \"already eliminated thousands of terrorists – and this is only the beginning\".\n* The Israel Defense Forces entered the village of As-Siafa with military vehicles.\n27 October\npassed Resolution ES-10/21 calling for an \"immediate and sustained\" humanitarian truce and cessation of hostilities.]]\n* Israel conducted a heavy round of airstrikes and said that it was \"expanding its ground forces\" in besieged Gaza. Several of these air strikes reportedly hit near the vicinity of both al-Shifa Hospital and the Indonesia Hospital.\n* Hamas launched rockets from Gaza that hit apartment blocks in Tel Aviv.\n* Gaza suffered a complete communications blackout. ActionAid stated it was \"nearly impossible\" for people to call or receive emergency services.\nReferences"
    }
  ]
}