{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Tigray war (January–June 2021)__disambig_1\n\nThis Timeline of the Tigray War (January to June 2021) is part of a chronology of the military engagements of the Tigray War, a civil war that began in the Tigray Region of Ethiopia in early November 2020.\nAbbreviations\nAbbreviations repeatedly used throughout this timeline include:\n* EDF = Eritrean Defence Forces\n* EEPA = Europe External Programme with Africa\n* ENDF = Ethiopian National Defense Force\n* TDF = Tigray Defense Forces\n* TPLF = Tigray People's Liberation Front\nTimeline\nBeginning to December 2020\nJanuary 2021\n1 January\nBUDGET REPORT WAS PERPLEXED. TPLF AND OTHER POLITICAL PARTIES ADMINISTRATION HAD GOT REDRESSING BY OROMO PEOPLE DEMOCRATIC ORGANIZATION.(OPDO) IN 2004, before Ethiopian renaissance dam was constructed more Tigrayans were expelled following wronged Eritrea trend of 1991. Political beauraus inhabitation by Amhara investors were the crucial cause of this road stewed ambition.\nThe ENDF released the names of TPLF officials that had been captured, surrendered or killed. ENDF Brigadier General Tesfaye Ayalew said that TPLF were found hiding in caves and churches and many members of the militia and Tigray Special Forces have surrendered.\nThe number of Ethiopian refugees in Sudan rose to 61,000 due to resumed clashes in northern Tigray. In the Um Rakoba refugee camp, Amhara and Tigray refugees clashed with one another and workers have had to avoid placing the two ethnic groups together. Sudanese military intelligence removed 45 TPLF fighters from the Hamdayet reception centre.\nEEPA reported there had been widespread looting including Voice of America reporting damage and looting of their property worth billions of birr in Southern Tigray. Eritrean soldiers were hindered from exiting Tigray with looted goods because of clashes between ENDF and TDF along the major roads into Eritrea. Shire and Egela woreda were being occupied by Eritrean soldiers.\n2 January\nAn EEPA report stated that the TPLF was in control of the mountainous areas of Tigray and the ENDF was having a hard time dislodging them. It also claimed the ENDF is launching an offensive towards Samre. It reported that civilians in Humera, Shire, Aksum, Adwa, Adigrat, Wukro, Mekelle, Hewane, Workamba, Abi Adi, and Hagerselam had been hit with heavy artillery fire. Civilian casualties from December included 300 in Edagahamus, 1,000 in Aksum, 500 in Wukro, and hundreds in Hazwzen, Digum, and Nebelet.\n3 January\nEEPA report:\n* The provisional mayor of Mekelle, Ataklti Haile Selassie, urged for the immediate withdrawal of Eritrean troops from Tigray.\n* Dozens of ENDF were wounded when shooting broke out among ENDF forces in Mekelle when ENDF troops refused an order from Prosperity Party military officials to fight the TPLF in mountainous areas.\n* Eritrean forces were reportedly kidnapping people with relatives abroad, for ransom.\n* Though Eri-TV said Eritrean captain Gubssa Kahsay died from an illness, Tigray sources said he died in military operations. At least 5 high ranking Eritrean military officials were reported to have died from illness in the prior few weeks.\n5 January\nEDF killed 29 civilians including 5 priests and 4 deacons in the Medhane Alem church of Gu'itelo. An additional 11 people were killed in the adjacent village of Firedashum and 5 in Ara'iro.\nENDF killed dozens of civilians in Debre Abbay on 5–6 January 2021. A 4-minute video of the victims, apparently made by a member of the perpetrators' group, and described as \"too graphic to publish\", shows around 40 bodies in civilian clothes. EEPA's report mentioned 80 youths killed.\n6 January\nThe UN OCHA said there were reports of fighting in rural areas and in the peripheries of Mekelle, Shiraro, Shire, and other locations. It also said the refugee camps of Hitsats and Shimelba are still not accessible. According to its Southern Tigray mission findings, things are gradually going back to normal in Alamata, Mehoni and Mekelle. This assessment is later rejected by the EEPA which in a later situation report on 9 January claims that according to its sources things in Alamata, Mehoni and Mekelle are not going back to normal.\n7 January\nThe Ethiopian national defense force announced that it has killed four top leaders of the TPLF officials and captured nine others. ENDF's Deployment Department Head, Brigadier General Tesfaye Ayalew told that they included TPLF spokesperson Sekoture Getachew, the former head of the Tigray Finance Bureau, Daniel Assefa, Head of Dimtsi Woyane Radio and Television, Abebe Asgedom and former General Director of Ethiopian Television and Broadcast Authority, Zeray Asgedom.\n8 January\nThe Ethiopian National Defense Force (ENDF) killed 170 civilians in Bora (Southern Tigray) on 8–10 January 2021. Soldiers went house to house and executed more than 160 people. Done killing, the soldiers stopped families from taking their dead. Only two days after the slaughter were gravediggers allowed to set about their grim task; one of them buried 26 corpses in the graveyard of the Abune Aregawi Church, survivors said.\nOne of the seven founders of TPLF and who is accused by current Ethiopian government as the master mind to initiate the war by massacring the North Force army, , has been caught, according to Ethiopian National Defense Force (ENDF). ENDF Deployment Department Head, Brigadier General Tesfaye Ayalew told Ethiopian News Agency (ENA) that Sebhat Nega was captured hiding in a ravine extremely difficult to reach. Together eight top TPLF officials are captured.\nEEPA stated that the ENDF announced the capture of nine Tigray officials and the killing of four others. This includes Getachew Reda, former head of the Tigray finance bureau, and two other core members. The EEPA claimed that ENDF reinforcements were seen moving from Alamata to Mekelle. There were reports of heavy fighting in Mekelle and its outskirts and heavy artillery bombing in Wurko. It also claimed that satellite images have shown fire in Baeker, Humera where fighting has been reported. It also said that Eritrean troops are in all administrative zones except Debubawi Zone.\nAccording to a later EEPA situation report, 8 January was the first time since the start of the conflict that a Sudanese TV channel reported no refugees crossing the border into Sudan.\n9 January\nAccording to Ethiopian National Defense Force, the group of nine captured TPLF leaders including the TPLF's strategist, Sibhat Nega, arrived in Addis Ababa. Former Tigray Region leader Abay Weldu was among the nine detainees.\nThe Ethiopian National Defense Force (ENDF) killed twelve religious people in the church of Adi'Zeban Karagiorgis in Ari Giyergis (Southern Tigray) on 9 January 2021.\nAn EEPA situation report claimed that the ENDF built a fence near the Sudanese border to stop refugees from exiting to Sudan. The ENDF presence on the border was growing. Ethiopian TV stated that the TPLF had earlier executed 300 refugees in Hitsats camp and an anonymous source stated the opposite: \"The Hitsats story is a lie. Eritrean forces massively killed their own citizens in Hitsats refugee camp to punish them for leaving Eritrea escaping their shoot to kill policy.\"\nBloomberg reported satellite images showing the destruction of UN facilities, a health-care unit, a high school, and houses in Shimelba and Hitsats camps. In Hitsats camp there were 14 actively burning buildings and 55 others were damaged or destroyed.\n10 January\nEthiopia's military said on 10 January that it had killed 15 members of the Tigray region's former ruling party and captured eight others, according to state-run TV.\nCiting a brigadier-general from Ethiopia's National Defence Force, the state-run Ethiopian Broadcasting Corporation said that those captured included the region's former president Abay Weldu, who was also a former chairman of the region's ruling party. Those killed included the region's former deputy police commissioner, it said.\nThe prisoners further include:\n* Teklewoini Assefa, the executive director of the Relief Society of Tigray (REST); he did a lot to alleviate poverty in Tigray, already in the period of the 1980s civil war; REST is internationally known as a very efficient NGO.\n* Dr. Muleta Yirga, staff of the Economics Department at Mekelle University and founding head of the established Tigray Statistics Agency.\nNeither are listed on the arrest warrant that was announced by the Federal Police Commission In the ETV report of the transfer of prisoners to Addis Ababa, Eritrean military were visible.\n11 January\nThere was fighting in Debano (north of Werkamba) between ENDF and TDF; the people fled to the mountains near Weri’i River, away from the road.\nThe Amhara forces who came following the Ethiopian army entered the village and massacred at least thirty civilians.\n13 January\nThe government said it killed former foreign minister Seyoum Mesfin, former minister of federal affairs Abay Tsehaye, and Asmelash Woldeselassie in fighting. The three officials were killed after refusing to surrender, according to a statement by Brig. Gen. Tesfaye Ayalew. In addition to the three officials who were killed, five other party members of the TPLF were also apprehended, Reuters added.\nAn EEPA situation report stated that in Ruwa Gered a battalion of ENDF/EDF forces were destroyed by Tigrayan forces. The battalion was on its way from Adwa to Edaga Arbi.\n15 January\nAn EEPA situation report stated that 4,000 ENDF/EDF were reportally killed during 3 days of fighting with the TPLF in Daero Hafash (East of Axum). The TPLF has captured a lot of weapons. Fighting is also going on in Tsigereda and around Wukro.\nA UN team reported that it had encountered uniformed Eritrea troops.\nOn 15 January, or the days thereafter, the Mahbere Dego massacres were filmed at a cliff; it received international media attention.\n17 January\nThe TPLF reportedly captured 30 Eritrean military personnel in the town of Wajirat.\n18 January\nIt was reported that 370 Somali soldiers had died during the war.\nAn ambush was reported on ENDF troops near the town of Sero, the ambush destroyed 10 trucks, 4 armored car, and an anti aircraft gun.\nThe Ethiopian Human Rights Commission (EHRC) produced a report on the Humera massacre, finding that 92 people died and that houses, businesses, and food storage warehouses were looted by Fano, Amhara Liya Hayl, Amhara militias, and some ENDF and EDF soldiers. The EHRC called for government forces to restore judicial bodies' presence in Humera, to provide security, and to investigate and prosecute the crimes attributed to security forces.\n20 January\nTigray TV journalist Dawit Kebede Araya and businessman Bereket Berhe were shot dead at around 20:10 EAT near the Adi Haus area in Mekelle, with relatives blaming security forces for their deaths.\n21 January\nThe United Nations Special Representative on Sexual Violence in Conflict, Pramila Patten, brought attention to sexual violence in the Tigray War. She expressed \"great concern\" at claims of rape in Mekelle, people forced to rape family members, \"sex in exchange for basic commodities\", and \"increases in the demand for emergency contraception and testing for sexually transmitted infections\".\n26 January\nPeace researcher Mulugeta Gebrehiwot visited a small village where 21 people had been killed.\n27 January\nMulugeta Gebrehiwot, former EPRDF member and founder of the Institute for Peace and Security Studies, telephoned Horn of Africa researcher Alex de Waal, and described the war as \"genocide by decree\". He stated that United Arab Emirates drones had played the main role in disarming TPLF forces about a month after the war started.\n29 January\nDebretsion Gebremichael, the deposed elected leader of Tigray Region, made a speech in which he called on Tigrayans to oppose the ENDF and EDF. He described the war as genocidal and called on the international community to prosecute Abiy Ahmed and Isaias Afwerki in an international court.\n30 January\nOn 30 January, battles of the second phase of the military campaign, with a strong presence of EDF troops, many showing the Ethiopian flag and wearing ENDF uniforms, included fighting in Daero Hafash, Semema, Mahbere Dego, Feresemay, Nebelet and Edaga Arbi in the Central Zone, and Hawzen in the Eastern Zone. Thirteen trucks of EDF forces were moved towards Hawzen and Nebelet; 163 trucks of ENDF and EDF soldiers were moved to Central Zone.\nFebruary 2021\n1 February\nThe Ethiopian National Defense Force (ENDF) and Eritrean Defence Forces (EDF) killed five priests in church of Gergera Da Mariam at Kerebera (Southeastern Tigray) on 1 February 2021.\n7 February\nThe EDF presence in Tigray increased, including mechanised divisions. EDF vehicles moved from northern to southern parts of Tigray. In attacks by the ENDF and EDF against TPLF forces, military battles took place in Samre, Nekseged and Korem.\nReports of senior ENDF officers killed by TPLF forces in the preceding week included Kedir Bekele, a colonel, and Zekaris Goshu and Hussen, sergeants, all in the 25th ENDF division.\n9 February\nThe Ethiopian government declared the burnt-down and abandoned Hitsats and Shimelba refugee camps to be officially closed.\nIn Mekelle on 9 February, a delegation of religious leaders concluded a 2-day visit that had been initially announced for 16–17 February. The religious leaders met with Mulu Nega, head of the Transitional Government of Tigray, called for peace and increased humanitarian efforts and expressed their willingness to strengthen the morale of Tigrayans. Residents speculated that the unannounced change in dates was intended to avoid street protests, and perceived the visit as a public relations exercise. Protests against the visit took place and included street blockades, burning tyres and boycotting the public meeting with the religious leaders. Five protestors were shot dead by security forces in Mekelle, and 23 other protestors were shot dead in other towns around Tigray. Some residents attended the public meeting. One woman spoke critically against the religious leaders, claiming that they had failed to object to the rapes, murders and starvation of Tigrayans. She stated, \"As far as I am concerned what you are doing now is tantamount to breaking someone's leg on purpose and then donating a wheelchair to aid with their mobility.\" She called for the religious leaders to \"denounce the atrocities\" carried out by the EDF.\n10 February\nThe EDF killed 18 young protestors in Wukro.\nAt least one Sudanese soldier and five Ethiopian militiamen were killed during clashes as Sudanese forces continue to advance further into the Fashaga triangle. Fighting is sporadic. Sudanese sources claim 50,000 acres of land were taken in the fighting.\nThe Ethiopian National Defense Force (ENDF) and Eritrean Defence Forces (EDF) killed dozens of civilians in a killing spree across villages in Kola Tembien (Central Tigray) on 10 February 2021.\nThe same also killed hundreds of civilians in Saharti and Samre (Southeastern Tigray) on 10–25 February 2021.\n11 February\nThere was a report that 20 youths were executed in Adwa and 10 in Shire during protests.\n12 February\nUNOCHA stated on 12 February that a total of 53 international staff of United Nations agencies and NGOs had received approval to enter Tigray Region. \"Large swathes\" of Tigray remained cut off from \"telecommunications, electricity, cash and fuel\", \"many local markets\" remained inactive, and reports on \"grave violations\" of human rights against civilians continued to be received.\nAt an ENDF meeting around 12 February, the ENDF said that it needed reinforcements sent to Tigray to face the \"thousands\" of TPLF forces involved in simultaneous battles on several fronts. Two Antonov planes carrying reinforcements arrived at Mekelle on a date prior to 15 February.\n14 February\nIn protests during the days preceding 14 February 20 young protestors were executed in Adwa and 10 were executed in Shire.\nEEPA stated that the Debre Damo monastery had been bombed, looted and \"completely destroyed\" by the EDF prior to 14 February, with 12 buildings destroyed and one monk killed.\nHeavy fighting between the ENDF and TPLF forces took place near Samre. The TPLF claims that the 32nd division of the ENDF was \"destroyed\".\n15 February\nThe ENDF started constructing trenches around Mekelle. A four-day battle ended with TPLF forces taking control of Samre, Gijet and Maykinetal. Locals state that 2000 EDF soldiers were killed in the Maykinetal battle. In the Gijet battle, the 32nd division and one brigade of the 11th division of the ENDF were \"destroyed\".\nIn Shire, 10 civilians are killed.\n16 February\nMilitary battles took place in Shire and Wajirat. Civilians were bombed in Samre and Gijet by ENDF aircraft. Electricity availability was intermittent in Mekelle and throughout Tigray Region. Military flights above Mekelle increased. The TPLF claimed to have shot down two ENDF aircraft.\n19 February\nThe TPLF, describing itself as the government of Tigray, declared its desire for peace negotiations, setting eight preconditions.\nEEPA states that around 19 February, a massacre of 100 civilians in Khisret village near Gijet followed a military attack by TPLF forces. EEPA attributed the perpetrators as ENDF and stated that a video showed some of the dead bodies.\n20 February\nThe National Congress of Great Tigray (Baytona), Tigray Independence Party (TIP) and Salsay Weyane Tigray (SAWET) published six peace process related demands to the international community.\n21 February\nSeb Hidri made similar peace process demands on 21 February 2021 to those made by the TPLF and Baytona–TIP–SAWET on 19 and 20 February, and additionally demanded a United Nations human rights monitoring and peacekeeping force and a UNESCO-led investigation of the destruction of cultural heritage.\n22 February\nDX Open Network, a research organization based in the UK, reported having analysed before and after satellite imagery of the town of Gijet. The imagery showed at least 508 structures had been destroyed by fire, intentionally burned, and that the destruction was not caused by shelling.\nThe Eritrean Defence Forces (EDF) killed nine civilians in Debrekerbe (northwestern Tigray).\n23 February\nThe Ethiopian National Defense Force (ENDF) and Eritrean Defence Forces (EDF) killed 80 civilians in May Weyni, new Gijet (Southeastern Tigray).\n26 February\nFitsum Berhane, translator for The Financial Times (FT), was arrested at his home in Mekelle for a reason unknown to FT. 26 civilians were reportedly killed by Ethiopian security forces in Benishangul Gumuz district.\n27 February\nMilitary fights intensified throughout Tigray Region, especially in the Central Zone. Alula Akalu, translator for AFP, was arrested at a restaurant in Mekelle for a reason unknown to AFP. Journalist Tamirat Yemane was detained by security forces.\n28 February\nWomen studying at the Ayder Referral Hospital in Mekelle were raped by the ENDF while en route from the library to their dormitories.\nMarch 2021\n1 March\nBBC News journalist Girmay Gebru was detained with four other people by military forces in Mekelle, for a reason unknown to the BBC. Journalists and fixers supporting international journalists from AFP and FT stated that they had been threatened with arrest or death if they showed their guests to mass graves or other \"sensitive\" locations. In reaction to the arrests of Fitsum Berhane, Alula Akalu, Tamirat Yemane and Girmay Gebru, Muthoki Mumo of the Committee to Protect Journalists called for the Ethiopian authorities to \"release [the] journalists and media workers immediately and provide guarantees that the press can cover the conflict in Tigray without intimidation.\". N.B. Alula Akalu and Tamirat Yemane were hardly tortured during the five days arrest.\nCNN interviewed Debretsion Gebremichael, who classified the events in Tigray Region as genocide by the ENDF and the EDF. Debretsion called for an independent investigation.\n2 March\nEEPA claimed that there had been several reports of Amhara Region militias killing 250 people near Humera over the preceding days.\n3 March\nAlso on 3 March, the Eritrean Defence Forces (EDF) killed seven civilian youngsters in Zamr (Central Tigray).\nThe Eritrean Defence Forces, and according to some witnesses, also the Ethiopian National Defense Force killed 24 civilians in Awulo (Tembien).\n4 March\nThe TDF claimed it had repelled an offensive by the ENDF/EDF in Alaje and that they had killed 640+ ENDF/EDF soldiers and wounded 1000+ more.\nAn ENDF convoy was struck by TDF landmines in the May Megelta area, destroying one vehicle and resulting in the deaths of 8 ENDF soldiers and left 9 more wounded.\n5 March\nThe TDF claimed it had killed 100+ ENDF and EDF soldiers after they repelled an offensive in Keyih Gobo, Samre district in Southeastern Tigray.\nThe Ethiopian National Defense Force (ENDF) and Eritrean Defence Forces (EDF) killed sixteen civilians in Berezba (Southeastern Tigray).\nThat same day, the Eritrean Defence Forces (EDF) also killed five civilians in Finarwa (Southeastern Tigray).\n8 March\nReports were made of mass extrajudicial and summary executions of c. 110 civilians by EDF and ENDF between 8 and 14 March in Saharti and Samre.\n9 March\nThe ENDF withdrew from Abiy Addi and the EDF took control of the town in early March. The EDF \"penetrated deep into the mountains near Adigrat\", confiscating cattle and food.\n11 March\nThe EEPA claimed that another massacre had taken place in Enkikumel town, between Shire\nand Endabaguna. According to this report, over 100 young men were executed by Ethiopian and Eritrean forces.\n14 March\nThere was a mass extrajudicial killing of 123 civilians by EDF and ENDF on 14 March in Gijet.\nAccording to EEPA, ENDF soldiers shot 5 civilians, killing 3 of them in the town of Wukro. According to the locals, these killings were a retaliation for recent attacks by Tigray regional forces.\n22 March\nThe 22nd division of the EDF, led by Haregot Furzun, arrived in Oromia Region to fight against the Oromo Liberation Army (OLA) after leaving Tigray Region, according to Freedom Friday.\n23 March\nEEPA reported fighting between ENDF allied forces and Tigray forces near Negash district. There were reports of dozens of civilians allegedly killed by Eritrean and Ethiopian soldiers in Teka Tesfay village.\nMédecins Sans Frontières staff witnessed four men taken out of a minibus and executed by ENDF forces on the road between Mekelle and Adigrat.\nEHRC published its preliminary report on the Aksum massacre, confirming that the main massacre was carried out by the EDF on 28–29 November 2020 and setting a lower limit of 100 civilians executed.\n24 March\nThirteen civilians were killed by Ethiopian soldiers in Grizana.\n27 March\nThe EDF continued to enter Tigray Region, with 37 trucks of EDF soldiers arriving through Adigrat.\n29 March\nFreedom Friday stated that the EDF was \"everywhere\" in Addis Ababa, wearing ENDF uniforms and badges.\n30 March\nThe Ethiopian National Defense Force (ENDF)  and Eritrean Defence Forces (EDF) killed around 161 civilians in and around Wukro Maray (Central Tigray) on 30 March to 5 April 2021.\nApril 2021\n1 April\nThe Eritrean Defence Forces (EDF) killed around 140 civilians in May Atsmi, Tisha and Haddush Addi, three municipalities south of Wukro Maray (Central Tigray) on 1 April 2021.\n4 April\nAbiy declared that war in Ethiopia was taking place in many places, stating, \"Currently, the national defence forces and the federal forces are in a major fight on eight fronts in the north and the west...\"\n5 April\nThe Eritrean Defence Forces (EDF) killed 30 civilians in May Kado (Eastern Tigray) on 5 April 2021. First there was shelling, and after the Eritreans lost a battle with TDF, they went on a killing spree.\nOn the same day, the Eritrean Defence Forces (EDF) killed 116 civilians in Debrekerbe (Zana woreda, northwestern Tigray). Victims were killed in the caves where they were hiding, or thrown from cliffs.\n8 April\nThe EEPA reported on a series of massacres committed by Eritrean and Ethiopian forces in Tigray Region. The EEPA reported death toll of these massacres was over 230 civilians killed.\n12 April\n* 12 April: Amnesty International stated the EDF had fired on civilians, killing three and wounding 19 others in Adwa. Reuters reported it was nine dead. A representative of the Transitional Government of Tigray, stated that the ENDF had defended the residents against the EDF, preventing further casualties.\n* 12 April: EEPA wrote that Tigrai Media House reported \"15 young unarmed men were killed by Amhara militia and ENDF soldiers in Hugumbrda, Southern Tigray.\"\n* 12 April: EEPA wrote that Tigrai Media House reported that Eritrean troops killed over 300 civilians, mainly priests and elders, in three villages near Wukro Maray town.\n15 April\nMark Lowcock, UN Under-Secretary-General for Humanitarian Affairs and Emergency Relief Coordinator, informed in a report that the humanitarian situation was deteriorating following a report that 150 civilians had died of hunger earlier in the day in Ofla near Mekelle. Lowcock stated that the EDF soldiers had begun to camouflage their identities by putting on Ethiopian military uniforms and continuing to carry out \"atrocities\". There were more reports of women being raped by men in uniforms, including very young girls under the age of eight.\nLowcock stated that there was no evidence of the EDF leaving Tigray Region.\n16 April\nEritrea for the first time has publicly admitted its participation in Ethiopia's Tigray conflict, as it confirmed to the UN Security Council that it has approved to commence exiting its troops from the region. The Eritrean information minister released a letter online, written by the Eritrean Ambassador to the UN, confirming the country's involvement in the Tigray conflict. Also, the Eritrean U.N. Ambassador Sophia Tesfamariam strongly criticized the rape accusations alongside other crimes that were made against Eritrean troops, which she described as damaging to the credibility of the Eritrean culture.\n19 April\nEDF and ENDF started an offensive against the TDF guerrilla in Central Tigray, south of Shire.\n20 April\nFighting between Ethiopian and Eritrea allied forces and Tigray defense forces was reported in Central and Northwestern parts of Tigray. Furthermore, an Ethiopian MI-35 helicopter was shot down by Tigray forces near Guya, killing the Ethiopian deputy commander of the East Air Base Division.\n22 April\nThe Ethiopian National Defense Force (ENDF) killed 12 civilians in Gira Aras (Eastern Tigray) on 22 April 2021. Witnesses reported the perpetrators of this massacre as being Ethiopian soldiers.\n26 April\nThe EEPA reported that the TDF had entered the Amhara region and had completely destroyed the Amhara special forces that were stationed around Nirak, Abergele, Amhara. Over 300 Ethiopian army soldiers were killed after they responded to the TDF attack. It is unclear how many casualties were sustained by the TDF. A battle report describes light TDF units capturing weapons and medicines from the Amhara Special forces, while destroying their heavy equipment.\nMay 2021\n1 May\nOn 1 May, the government designated the TPLF and the OLF as terrorist groups. The organizations were listed as terrorist groups by the council of ministers as a result of their collaboration in violent activities, including participation in attacks. Gedion Timothewos, Ethiopia's attorney general has cautioned foreign countries from working with the two groups, and also maintained that the new move would not affect ordinary civilians.\n6 May\nOn 6 May, the head of the Transitional Government of Tigray, Mulu Nega, was replaced by Abraham Belay. According to Abiy Ahmed's spokesman, Mulu was removed in accordance to a six-month performance review of the position. The newly appointed Abraham Belay, had been serving as minister of innovation and technology in the Ethiopian federal government, the spokesman added.\n8 May\nThe Eritrean Defence Forces (EDF) killed 19 civilians in Guh (Eastern Tigray). Most of the victims in the attack were women and young children.\n21 May\nOn 21 May, Ethiopia's military prosecutors have convicted three soldiers of rape and pressed charges against 28 others suspected of killing civilians in Tigray. 25 other soldiers are charged with rape and other forms of sexual violence, according to the statement by attorney general's office. The statement also confirmed reports of two massacres in Tigray: It said 229 civilians were killed in the town of Mai Kadra at the beginning of November 2021. Ethiopian government also, for the first time, accused troops from Eritrea of killing civilians: 110 civilians were killed in the city of Axum on 27 and 28 November 2021.\n30 May\nThousands of Ethiopian protesters took to the streets in Addis Ababa to protest against the international government over the Tigray conflict. Over 10,000 people were said to have participated at the rally, which was organized by authorities to back the pro-government protesters. The protesters held banners condemning the US and other international communities' intervention.\nJune 2021\n1 June\nThe UN's World Food Programme (WFP) has warned that at least 90 per cent of the people in Ethiopia's war-torn Tigray region are in dire need of food aid. According to the UN's top emergency relief coordinator Mark Lowcock if aid is not increased in the next two months, there would be a dangerous risk of food shortage.\n2 June\nThe UK urged for a declaration of ceasefire by all conflict parties in Tigray, in order to facilitate humanitarian access and avoid famine in the region.\n3 June\nEritrean troops had begun the pulling out of its troops from Ethiopia's Tigray region, following the official request made by the Ethiopian government, the spokesman of the Ethiopian PM disclosed.\nMeanwhile, the Ethiopian government has ignored the international calls for a ceasefire in Tigray, as they claimed that their forces are wrapping up operations to eliminate all armed opposition.\n17–19 June\nThe TDF has beaten ENDF at Shiw'ate Hegum, north of Yechila. Reportedly at least 100 government soldiers died and 900 were captured.\n21 June\nThe TDF attacked the city of Adigrat and Wukro taking them and destroying military vehicles and capturing some soldiers before leaving.\n22 June\nAn EEPA report stated that the TDF's 'Operation Alula' has resulted in defeat of Ethiopian and allied troops in many areas from Abiy Adi to the river Giba. TDF is close to the outskirts of Mekelle. Agulae has also reportedly fallen to the TDF. The TDF claim that 10,000 Ethiopian soldiers were killed in the offensive.\nOn 22 June 2021, there was an airstrike by the Ethiopian Air Force on the town of Togoga in the Tigray Region of Ethiopia on market day during the Tigray War on 22 June 2021. 64 people were killed and 180 others were injured. Ambulances travelling between Mekelle and Togoga were delayed or turned back by soldiers.\n23 June\nAn Ethiopian Air Force Lockheed C-130 Hercules was shot down near Gijet, destroying the plane. According to witnesses, the plane was shattered into a field, about 15 miles south of the Tigray capital Mekelle, The New York Times added.\n24 June\nThree Doctors Without Borders staff were found dead after being pulled from their vehicle in Tigray. The staff killed were emergency coordinator María Hernández, assistant coordinator Yohannes Halefom Reda, and the driver Tedros Gebremariam Gebremichael.\n26 June\nBattles between the Tigray Defense Forces and ENDF nearby Soqota in Amhara Region.\n28 June\nTigray Defense Forces recaptured Mekelle after the Ethiopian military withdrew from the city, on their retreat out of the city they looted the banks and the UN agency in the city. After the TDF moved into the city the Ethiopian government declared a ceasefire. Celebrations erupted in the streets of Mekelle as the TDF moved into it.\n29 June\nEritrean soldiers withdrew from Shire Inda Selassie, Axum, and Adwa allowing the TDF to capture the cities.\nThe Tigray Regional government said that they will not accept the ceasefire and will continue the war until their enemies don't have the capability to invade Tigray and they will chase the EDF and ENDF into Eritrea and Amhara if necessary to achieve that goal.\nJuly 2021–present\nReferences\n}}"
    }
  ]
}