{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Vietnamese history\n\nThis is a timeline of Vietnamese history, comprising important legal and territorial changes and political events in Vietnam and its predecessor states. To read about the background to these events, see History of Vietnam.\n__NOTOC__\nPrehistory / Millennia: 3rd BC2nd BC–1st BC1st–2nd3rd\nPrehistoric Vietnam\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 25000 BC || The Soi Nhụ culture appeared.\n|-\n| 23000 BC || The Ngườm culture appeared.\n|-\n| 20000 BC || The Sơn Vi culture appeared in modern Lâm Thao district.\n|-\n| 12000 BC || Hoabinhian artifacts began to be produced in Northern Vietnam.\n|-\n| 10000 BC || The Bắc Sơn culture appeared.\n|-\n| 8000 BC || The Quỳnh Văn culture appeared.\n|-\n| 5000 BC || The Cái Bèo culture appeared.\n|-\n| rowspan=\"2\" valign=\"top\" | 4000 BC|| The first rice cultivation of which evidence survives in modern Vietnam took place.\n|-\n| The Đa Bút culture appeared in what is now Vĩnh Lộc district.\n|-\n| 3500 BC|| Wet rice was cultivated in the Red River Delta.\n|}\nCenturies: 30th BC29th BC28th BC27th BC26th BC25th BC24th BC23rd BC22nd BC21st BC\n29th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| valign=\"top\" | 2879 BC || Kinh Dương Vương unified all vassal states in his territory into the single state of Xích Quỷ, which he ruled as Hùng king from the capital at Phong Châu. He also sponsored the development of martial arts in Xích Quỷ at the time.\n|}\n28th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2793 BC || Kinh Dương Vương was succeeded as Hùng king of Xích Quỷ, since renamed Văn Lang, by his son Lạc Long Quân.\n|}\n27th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2637 BC || The lunar calendar came into use in Văn Lang.\n|}\n26th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2524 BC || The first Hùng king of the Cấn line came to power in Văn Lang.\n|}\n25th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2500 BC || The Hùng king ordered an increase in rice cultivation.\n|}\n24th century BC\n23rd century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2253 BC || The last Hùng king of the Cấn line ended his rule of Văn Lang.\n|-\n| 2252 BC || The first Hùng king of the Chấn line came to power in Văn Lang.\n|}\n22nd century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2200 BC || The earliest surviving artifacts indicating use of the Vietnamese calendar appeared.\n|}\n21st century BC\nCenturies: 20th BC19th BC18th BC17th BC16th BC15th BC14th BC13th BC12th BC11th BC10th BC9th BC8th BC7th BC6th BC5th BC4th BC3rd BC2nd BC1st BC\n20th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 2000 BC || The Phùng Nguyên culture appeared.\n|-\n| 1913 BC || The last Hùng king of the Chấn line ended his rule of Văn Lang.\n|-\n| 1912 BC || The first Hùng king of the Tốn line came to power in Văn Lang.\n|}\n19th century BC\n18th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 1712 BC || The first Hùng king of the Ly line came to power in Văn Lang.\n|}\n17th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 1700 BC || Burial rituals and tomb building came into practice.\n|-\n| 1631 BC || The first Hùng king of the Khôn line came to power in Văn Lang.\n|}\n16th century BC\n15th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 1500 BC || The Đồng Đậu culture appeared.\n|-\n| A sophisticated agricultural society developed on the Vietnamese coast.\n|-\n| 1432 BC || The last Hùng king of the Khôn line ended his rule of Văn Lang.\n|-\n| 1431 BC || The first Hùng king of the Đoài line came to power in Văn Lang.\n|}\n14th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 1331 BC || The first Hùng king of the Giáp line came to power in Văn Lang.\n|}\n13th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event|| style=\"width:10%\" | Date\n|-\n| 1251 BC || The first Hùng king of the Ất line came to power in Văn Lang.||\n|}\n12th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 1200 BC || The Lạc Việt discovered bronze casting.\n|-\n| Irrigation was first used in rice cultivation in the plains of the Mã and Red Rivers.\n|-\n| 1162 BC || The last Hùng king of the Ất line ended his rule of Văn Lang.\n|-\n| 1161 BC || The first Hùng king of the Bính line came to power in Văn Lang.\n|}\n11th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 1100 BC || The Gò Mun culture appeared.\n|-\n| 1055 BC || The last Hùng king of the Bính line ended his rule of Văn Lang.\n|-\n| 1054 BC || The first Hùng king of the Đinh line came to power in Văn Lang.\n|}\n10th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| rowspan=\"4\" valign=\"top\" | 1000 BC || The Đông Sơn culture appeared in the valley of the Red River.\n|-\n| Copper casting began to be used in Văn Lang in the manufacture of brass tools, weapons, and ornaments.\n|-\n| The population of Văn Lang reached one million.\n|-\n| The Lạc Việt developed observational astronomy.\n|-\n| 969 BC || The last Hùng king of the Đinh line ended his rule of Văn Lang.\n|-\n| 968 BC || The first Hùng king of the Mậu line came to power in Văn Lang.\n|}\n9th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 853 BC || The first Hùng king of the Kỷ line came to power in Văn Lang.\n|}\n8th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 754 BC || The first Hùng king of the Canh line came to power in Văn Lang.\n|}\n7th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 700 BC || Refugees from the increasingly fragile Zhou dynasty began to arrive in the Red River Delta.\n|-\n| 661 BC || The last Hùng king of the Canh line ended his rule of Văn Lang.\n|-\n| 660 BC || The first Hùng king of the Tân line came to power in Văn Lang.\n|}\n6th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 600 BC || The metallurgical style unique to the Đông Sơn drums was invented.\n|-\n| An elaborate system of canals and dikes was invented which made possible the tidal irrigation of rice fields.\n|-\n| 569 BC || The last Hùng king of the Tân line ended his rule of Văn Lang.\n|-\n| 568 BC || The first Hùng king of the Nhâm line came to power in Văn Lang.\n|}\n5th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 500 BC || The earliest artifacts suggesting the celebration of Tết appeared.\n|-\n| rowspan=\"2\" valign=\"top\" | 470 BC || King Goujian of Yue sent messengers to Văn Lang demanding submission.\n|-\n| The last Hùng king of the Nhâm line ended his rule of Văn Lang.\n|-\n| 408 BC || Hùng Duệ Vương became Hùng king of Văn Lang.\n|}\n4th century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| 400 BC || A mass migration of refugees to the Red River Delta took place due to the ongoing collapse of the Zhou dynasty.\n|}\n3rd century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 300 BC || Buddhist missionaries from Maurya Empire arrived in Văn Lang.\n|-\n| The Âu Việt settled across the northern border of Văn Lang and opened trade relations with the Lạc Việt.\n|-\n| 257 BC || Thục Phán, ruler of the Âu Việt, invaded and conquered Văn Lang.  He renamed the country Âu Lạc and took the regnal name An Dương Vương, ruling as king from Cổ Loa Citadel.\n|-\n| 250 BC || The Hùng Temple was built.\n|-\n| 210 BC || The Battle of Tiên Du took place.\n|-\n| rowspan=\"2\" valign=\"top\" | 207 BC || The Qin general Zhao Tuo captured Cổ Loa Citadel. An Dương Vương fled and later committed suicide.\n|-\n| Zhao Tuo divided the territory under his control into the commanderies of Jiaozhi and Jiuzhen.\n|-\n| 206 BC || The warlord Xiang Yu led an army into the Qin capital Xianyang, burned the Epang Palace and killed the Qin emperor Ziying and the royal family.\n|-\n| rowspan=\"2\" valign=\"top\" | 203 BC || Zhao Tuo declared himself king of Nanyue, with his capital in modern Panyu, Guangzhou.\n|-\n| Nanyue conquered Guilin.\n|}\n2nd century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 198 BC || || Two delegates were assigned to oversee the affairs of Jiaozhi and Jiuzhen.\n|-\n| 196 BC || || The Han official Lu Jia gave Zhao Tuo a seal recognizing him as king of Nanyue in exchange for his nominal submission to the Han emperor.\n|-\n| rowspan=\"3\" valign=\"top\" | 183 BC || || Empress Lü, the Han empress dowager and regent for her grandson Emperor Houshao of Han, ordered a trade blockade of Nanyue.\n|-\n| || Zhao Tuo sacked the Han capital Chang'an.\n|-\n| || The nearby polities of Minyue, Yelang and Tongshi declared their allegiance to Nanyue.\n|-\n| 181 BC || || A punitive Han invasion of Nanyue stalled after much of the invading army fell to illness.\n|-\n| 180 BC || || Lü Zhi died. Nanyue conquered some Han territory near the border.\n|-\n| rowspan=\"3\" valign=\"top\" | 179 BC || || In exchange for the restoration of his family in modern Zhengding County and the withdrawal of Han forces from the Nanyue border, Zhao Tuo renounced the title emperor and pledged submission to the Han dynasty.\n|-\n| || Luy Lâu was founded.\n|-\n| || Zhao Tuo died. He was succeeded as king of Nanyue by his grandson Zhao Mo.\n|-\n| 135 BC || || A border war took place between Nanyue and Minyue.\n|-\n| 122 BC || || Zhao Mo died. He was succeeded as king of Nanyue by his eldest son Zhao Yingqi.\n|-\n| 118 BC || || Confucian ideas were introduced to Nanyue.\n|-\n| 115 BC || || Zhao Yingqi died. He was succeeded by his son Zhao Xing.\n|-\n| 112 BC || || Lü Jia, the prime minister of Nanyue and a Lạc Việt chief, killed Zhao Xing and his Han Chinese mother Juishi after the latter agreed to full submission to the Han dynasty in order to preserve her authority in Nanyue. He declared Zhao Xing's elder brother Zhao Jiande king.\n|-\n| rowspan=\"2\" valign=\"top\" | 111 BC || || Han conquest of Nanyue: Han forces invaded Nanyue. Zhao Jiande was captured in flight and executed. The zhou of Jiaozhou was organized on the territory of the defunct Nanyue and divided into the commanderies of Nanhai, Cangwu, Yulin, Jiaozhi, Hepu, Zhuya, Taner, and Jiuzhen. Shi Dai was appointed its governor.\n|-\n| || Tây Vu Vương launched a revolt against Han forces.\n|-\n| 110 BC || || Tây Vu Vương was assassinated by his assistant Hoàng Đồng.\n|}\n1st century BC\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 86 BC || || Shi Dai's rule of Jiaozhou ended.\n|-\n| 48 BC || || The commandery of Rinan in Jiaozhou was organized south of the Hoành Sơn Range.\n|}\nCenturies: 1st2nd3rd4th5th6th7th8th9th10th11th12th13th14th15th16th17th18th19th20th\n1st century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 2 || Tích Quang became governor of Jiaozhou.\n|-\n| A census in Jiaozhou counted some hundred thousand households and nearly one million people.\n|-\n| 31 || Tích Quang's rule of Jiaozhou ended.\n|-\n| 34 || Su Ding became governor of Jiaozhou.\n|-\n| 39 || Thi Sách was assassinated.\n|-\n| 40 || ''Trung sisters' rebellion: The Trưng Sisters launched a rebellion against Han authority in the Red River Delta.\n|-\n| 43 || Trung sisters' rebellion'': the Trưng Sisters committed suicide by drowning themselves before The Han general Ma Yuan could capture them.\n|}\n2nd century\n3rd century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 229 || June 23 || Sun Quan declared himself emperor, founding the state of Eastern Wu, separating from the Han dynasty.\n|-\n| 246 || || Lady Triệu uprising.\n|}\n4th century\n5th century\n6th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 544 || February || Following his rebellion and expulsion of Liang forces from Jiaozhou, Lý Nam Đế was proclaimed emperor of Vạn Xuân.\n|-\n| 545 || Winter || The Liang general Emperor Wu of Chen launched a surprise attack on the Vạn Xuân capital Long Biên, forcing Lý Nam Đế and the imperial administration to flee to the Gia Ninh Citadel in modern Việt Trì.\n|-\n| 546 || || Lý Nam Đế was forced to retreat to Khuất Lão Cave, where he reorganized his army under the command of Triệu Việt Vương.\n|-\n|  547 || || Vạn Xuân forces defended Dạ Trạch in modern Khoái Châu District from Liang forces.\n|-\n| rowspan=\"2\" valign=\"top\" | 548 || February || Lý Nam Đế ceded rule of Vạn Xuân to Triệu Việt Vương and his older brother Lý Thiên Bảo.\n|-\n| April || Lý Nam Đế was assassinated in modern Laos.\n|-\n| 550 || || Triệu Việt Vương expelled Liang forces from Vạn Xuân and reestablished the capital at Long Biên.\n|-\n| 555 || || Lý Thiên Bảo died without heirs.\n|-\n| 557 || || Hậu Lý Nam Đế, Lý Nam Đế's cousin and claimant to the throne of Vạn Xuân, signed a truce with Triệu Việt Vương establishing a boundary between their two territories.\n|-\n| 571 || || Hậu Lý Nam Đế surprised and conquered Triệu Việt Vương and moved his capital to Phong Châu.\n|}\n7th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 602 || || Sui–Former Lý War: Sui conquered Vạn Xuân following a brief rebellion by Hậu Lý Nam Đế.\n|}\n8th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 713 || || Mai Thúc Loan uprising.\n|-\n| 776 || || Phùng Hưng uprising.\n|}\n9th century\n10th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"1\" valign=\"top\" | 938 || || Battle of Bạch Đằng: Ngô Quyền defeated the Southern Han kingdom at the Battle of Bạch Đằng north of modern Haiphong and ended 1,000 years of Chinese domination dating back to 111 BC under the Han dynasty, founding the Ngô dynasty.\n|-\n| 965 || || Anarchy of the 12 Warlords\n|-\n| rowspan=\"4\" valign=\"top\" | 979 || || Emperor Đinh Bộ Lĩnh of Đại Cồ Việt was assassinated along with his crown prince Đinh Liễn by a minor palace official. His surviving son, the young Đinh Phế Đế, succeeded him under the regency of the commander-in-chief Lê Hoàn.\n|-\n| || Lê Hoàn declared himself viceroy of Đại Cồ Việt with the support of the empress dowager Dương Vân Nga.\n|-\n| || The nobles Nguyễn Bặc and Đinh Điền attacked the Đại Cồ Việt capital Hoa Lư in response to Lê Hoàn's apparent usurpation.\n|-\n| || Nguyễn Bặc and Đinh Điền were executed.\n|-\n| rowspan=\"3\" valign=\"top\" | 981 || || Lê Hoàn declared himself emperor at Hoa Lư.\n|-\n| || Battle of Bạch Đằng (981): Đại Cồ Việt forces defeated a Song invasion near Lạng Sơn, forcing the Song fleet on the Bạch Đằng River to withdraw.\n|-\n| || Nam quốc sơn hà, a poem celebrating the sovereignty of Đại Cồ Việt over its territory, was written.\n|-\n| 982 || || Đại Cồ Việt forces sacked the Champa capital Indrapura.\n|}\n11th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1005 || || Lê Hoàn died.\n|-\n| 1009 || || The imperial court acclaimed Lý Thái Tổ emperor of Đại Cồ Việt.\n|-\n| 1010 || Autumn || Lý Thái Tổ issued the chiếu dời đô, an edict ordering the transfer of the capital from Hoa Lư to Đại La.\n|-\n| 1028 || || Lý Thái Tổ's son Lý Thái Tông became emperor of Đại Cồ Việt.\n|-\n| 1038 || || The Nùng warlord Nùng Tồn Phúc launched a failed rebellion against Lý Thái Tông.\n|-\n| 1054 || || Lý Thái Tông died. He was succeeded by his son Lý Thánh Tông.\n|-\n| 1070 || || The Temple of Literature, Hanoi, a Confucian temple, was constructed.\n|-\n| 1072 || January || Lý Thánh Tông died. He was succeeded as emperor by his young son Lý Nhân Tông, with the latter's mother Ỷ Lan and the chancellor Lý Đạo Thành acting as regents.\n|-\n| rowspan=\"2\" valign=\"top\" | 1075 || || Minor officials were chosen by examination for the first time.\n|-\n| Autumn || Lý–Song War: Đại Cồ Việt invaded Song in response to a trade blockade.\n|}\n12th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1127 || 15 January || Lý Nhân Tông died.\n|-\n| 1176 || || The young Lý Cao Tông became emperor under the regency of Tô Hiến Thành.\n|}\n13th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1209 || || The general Quách Bốc entered the capital, dethroned Lý Cao Tông and installed his young son Lý Thẩm as emperor.\n|-\n| 1226 || 11 January || Trần Thái Tông was crowned emperor of Đại Việt.\n|-\n| 1258 || January || Mongol invasions of Vietnam: The Mongol Empire invaded Đại Việt and conquered the capital at modern Hanoi. Trần Thái Tông fled to an island.\n|-\n| 1278 || November || Trần Thánh Tông ceded the throne to his son Trần Nhân Tông.\n|-\n| 1282 || || The Bình Than Conference took place.\n|-\n| 1284 || || The Diên Hồng Conference took place.\n|-\n| 1285 || || Mongol invasions of Vietnam: The Đại Việt commander-in-chief Trần Hưng Đạo drew out and harassed a Yuan invasion force, forcing their retreat.\n|-\n| 1287 || || Mongol invasions of Vietnam: The Mongol navy was destroyed, forcing the army, left without provisions, to begin its retreat from Đại Việt.\n|-\n| 1293 || 3 March || Trần Nhân Tông ceded the throne to his son Trần Anh Tông.\n|}\n14th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1306 || || Trần Anh Tông's sister Huyền Trân married the Champa king Chế Mân in Huế.\n|-\n| 1341 || || The young Trần Dụ Tông was crowned emperor of Đại Việt under the regency of his father, the retired emperor Trần Minh Tông.\n|-\n| 1360 || || Champa launched several border attacks against Đại Việt.\n|-\n| rowspan=\"2\" valign=\"top\" | 1400 || || Hồ Quý Ly overthrew the Đại Việt emperor, enthroned himself, renamed the country Đại Ngu and moved the capital to the citadel of the Hồ dynasty.\n|-\n| || The Cham-Vietnamese War (1400–1407) began.\n|}\n15th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1401 || || Hồ Quý Ly ceded the throne to his son Hồ Hán Thương.\n|-\n| 1406 || 19 November || Ming–Hồ War: Ming forces captured the Đại Ngu capitals.\n|-\n| rowspan=\"2\" valign=\"top\" | 1428 || || Lê Lợi was declared emperor of an independent Đại Việt.\n|-\n| || The Bình Ngô đại cáo was published, affirming that Đại Việt was independent from and equal to China.\n|-\n| 1460 || || Lê Thánh Tông was crowned emperor of Đại Việt.\n|-\n| 1479 || || The Đại Việt sử ký toàn thư, an official history of Đại Việt, was completed.\n|-\n| 1483 || || The Hồng Đức legal code was promulgated.\n|-\n| 1497 || 30 January || Lê Thánh Tông died.\n|}\n16th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1509 || || Lê Oanh assassinated his cousin, the tyrant Lê Uy Mục, and replaced him as emperor Lê Tương Dực.\n|-\n| 1511 || || The Trần Tuân Uprising took place.\n|-\n| rowspan=\"3\" valign=\"top\" | 1516 || || Trần Cao rebellion: Trần Cao, a mandarin of Đại Việt who identified himself as an incarnation of Śakra, launched a revolt against the government.\n|-\n| || Portuguese seafarers arrived.\n|-\n| || Lê Tương Dực was murdered in the capital by a group of palace guards.\n|-\n| 1527 || || Mạc Đăng Dung forced Emperor Lê Cung Hoàng to abdicate, establishing the Mạc dynasty.\n|-\n| 1533 || || Lê–Mạc War.\n|-\n| 1592 || || The Revival Lê dynasty defeated the Mạc dynasty and regained control of the country.\n|}\n17th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1627 || || Trịnh–Nguyễn War.\n|}\n18th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 1778 || || The forces of the Tây Sơn dynasty took Gia Định in modern Saigon and massacred the Nguyễn lords, the de facto rulers of southern Đại Việt, sparing only the young Nguyễn Thế Tổ.\n|-\n| || Nguyễn Văn Nhạc proclaimed himself emperor of Đại Việt with his capital at Quy Nhơn.\n|-\n| 1783 || || Nguyễn Thế Tổ fled the country.\n|-\n| 1785 || 20 January || Battle of Rạch Gầm-Xoài Mút: Đại Việt forces under a banner of truce surprised and defeat a Siamese force, then invade with the intention of installing Nguyễn Thế Tổ on the throne, on the Mekong River in modern Tiền Giang Province.\n|-\n| rowspan=\"2\" valign=\"top\" | 1786 || || The Phú Xuân Campaign (1786) took place.\n|-\n| || The Thăng Long Campaign took place.\n|-\n| rowspan=\"2\" valign=\"top\" | 1787 || || The Nguyễn Nhạc-Nguyễn Huệ split occurred.\n|-\n| 21 November || The French priest Pierre Pigneau de Behaine signed the Treaty of Versailles on behalf of Nguyễn Thế Tổ.  The French government agreed to support the latter in taking the throne of Đại Việt in exchange for Côn Sơn Island and exclusive trading rights.\n|-\n| rowspan=\"3\" valign=\"top\" | 1788 || October || Battle of Ngọc Hồi-Đống Đa: Qing forces invaded Đại Việt in support of the deposed emperor Lê Chiêu Thống.\n|-\n| || Nguyễn Văn Nhạc's younger brother Nguyễn Văn Huệ proclaimed himself emperor of Đại Việt.  Nguyễn Văn Nhạc relinquished the title, taking that of king instead.\n|-\n| || Nguyễn Thế Tổ conquered Gia Định in modern Saigon.\n|-\n| 1790 || || The Battle of Bình Thuận took place.\n|-\n| 1792 || || Nguyễn Văn Huệ died, probably from a stroke.  He was succeeded by his young son Nguyễn Quang Toản.\n|-\n| 1800 || || The Siege of Quy Nhơn took place.\n|}\n19th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1801 || || Battle of Thị Nại.\n|-\n| rowspan=\"4\" valign=\"top\" | 1802 || || Battle of Trấn Ninh\n|-\n| || The Nguyễn defeat last of Tây Sơn forces.\n|-\n| || Capital moved to Huế.\n|-\n| || Emperor Cảnh Thịnh died, Emperor Gia Long became ruler of Vietnam.\n|-\n|1806\n|\n|Tang thương ngẫu lục (Random Record of Great Changes) is finalized.\n|-\n| 1809 || || Nguyễn Du completes The Tale of Kieu.\n|-\n| rowspan=\"2\" valign=\"top\" | 1815 || || Hoàng Việt law enforced.\n|-\n| || Emperor Gia Long (1802–1820) ended his rule of Vietnam.\n|-\n| valign=\"top\" | 1820 || || Emperor Minh Mạng (1820–1841) became ruler of Vietnam.\n|-\n|1825\n|\n|Phan Bá Vành Uprising.\n|-\n| rowspan=\"3\" valign=\"top\" | 1833 || || Nông Văn Vân Uprising.\n|-\n| || Lê Văn Khôi Revolt.\n|-\n| || Emperor Minh Mạng (1820–1841) ended his rule of Vietnam.\n|-\n| rowspan=\"2\" valign=\"top\" | 1845 || || Emperor Thiệu Trị (1841–1847) became ruler of Vietnam.\n|-\n| || USS Constitution lands in Da Nang as a company of US Marines moves overland to Huế and rescues a French Bishop who had been captured by the Vietnamese.\n|-\n| rowspan=\"2\" valign=\"top\" | 1847 || || French bombardment of Da Nang in response to persecution of Catholic missionaries.\n|-\n| || Emperor Thiệu Trị (1841–1847) ended his rule of Vietnam.\n|-\n| rowspan=\"2\" valign=\"top\" | 1854 || || Emperor Tự Đức (1847–1883) became ruler of Vietnam.\n|-\n| || Cao Bá Quát Uprising.\n|-\n| 1858 || || Cochinchina Campaign.\n|-\n| 1859 || || Thủ Khoa Huân Uprising.\n|-\n| rowspan=\"2\" valign=\"top\" | 1861 || || Sinking of ''L'Esperance\n|-\n| || Trương Định Uprising.\n|-\n| 1862 || || Treaty of Saigon.\n|-\n| 1867 || || The French establishes the colony of Cochinchina.\n|-\n|1880s\n|\n|Discovery of Quang Yen coalfield\n|-\n| 1883 || || Emperor Tự Đức (1847–1883) ended his rule of Vietnam.\n|-\n| rowspan=\"4\" valign=\"top\" | 1885 || || Ruler: Emperor Hàm Nghi (1884–1885)\n|-\n| || Battle of the Huế Imperial City. Hàm Nghi leads resistance.\n|-\n| || Emperor Đồng Khánh (1885–1889) became ruler of Vietnam.\n|-\n| || Cần Vương Movement.\n|-\n| rowspan=\"2\" valign=\"top\" | 1888 || || Hàm Nghi captured and exiled to Algeria.\n|-\n| || Emperor Đồng Khánh (1885–1889) ended his rule of Vietnam.\n|}\n20th century\n* Films about vietnamese history\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 1904 || || Ruler: Emperor Thành Thái (1889–1907)\n|-\n| || Đông Du Movement.\n|-\n| 1906 || || The Duy Tân movement, initiated by Phan Châu Trinh, was launched.\n|-\n| rowspan=\"2\" valign=\"top\" | 1917 || || Ruler: Emperor Khải Định (1916–1925)\n|-\n| || Thái Nguyên uprising.\n|-\n| rowspan=\"3\" valign=\"top\" | 1930 || || Emperor Bảo Đại (r. 1926–1945) became ruler of Vietnam.\n|-\n| || Nghệ Tĩnh Revolt.\n|-\n| 3 February || Communist Party of Vietnam (CPV) is the founding and ruling communist party of the Socialist Republic of Vietnam.\n|-\n| rowspan=\"3\" valign=\"top\" | 1945 || 11 March || The Empire of Vietnam is established under Japanese sponsorship.\n|-\n|16–30 August || August Revolution by the Viet Minh. Emperor Bảo Đại abdicates. Civil conflicts in Vietnam (1945–1949) begins.\n|-\n| September ||   Allied forces disarm the Japanese in Indochina after World War II, with British-Indian troops operating south of the 16th parallel and Chinese nationalist forces operating north of the 16th parallel.\n|-\n| rowspan=\"1\" valign=\"top\" | 1949 || July 2 || The State of Vietnam is established within the French Union.\n|-\n| rowspan=\"6\" valign=\"top\" | 1954 || 13 March || Battle of Dien Bien Phu: French troops begin the battle against the Viet Minh in Dien Bien Phu.\n|-\n| 23 March || Battle of Dien Bien Phu: the Viet Minh capture the main airstrip of Dien Bien Phu. The remaining French Army units there are partially isolated.\n|-\n| 26 April || An international conference on Korea and Indo-China opens in Geneva.\n|-\n| 7 May || Battle of Dien Bien Phu'' ends in a French defeat.\n|-\n| 21 July || The Geneva Conference sends French Union forces to the south, and Viet Minh forces to the north, of a ceasefire line, and calls for elections to decide the government for all of Vietnam by July 1956. Failure to abide by the terms of the agreement leads to the establishment de facto of regimes of North Vietnam and South Vietnam, and the Vietnam War.\n|-\n| 1 August || The First Indochina War ends with the Vietnam People's Army in North Vietnam, the Vietnamese National Army in South Vietnam, the Kingdom of Cambodia in Cambodia, and the Kingdom of Laos in Laos, emerging victorious against the French Army.\n|-\n| rowspan=\"2\" valign=\"top\" | 1955 || 26 October || Ngô Đình Diệm proclaims Vietnam to be a republic with himself as its President (following the State of Vietnam referendum on 23 October) and forms the Army of the Republic of Vietnam.\n|-\n| 1 November || The Vietnam War begins between North Vietnam and South Vietnam; the north is allied with the Viet Cong.\n|-\n| rowspan=\"1\" valign=\"top\" | 1959 || 26 September || First large unit action of the Vietnam War takes place, when two companies of the ARVN 23d Division are ambushed by a well-organized Viet Cong force of several hundred, identified as the \"2d Liberation Battalion\".\n|-\n| rowspan=\"1\" valign=\"top\" | 1960 || 6 March || Vietnam War: The United States announces that 3,500 American soldiers will be sent to Vietnam.\n|-\n| rowspan=\"2\" valign=\"top\" | 1961 || 18 November || Vietnam War: U.S. President John F. Kennedy sends 18,000 military advisors to South Vietnam.\n|-\n| 11 December || The American involvement in the Vietnam War officially begins, as the first American helicopters arrive in Saigon along with 400 U.S. personnel.\n|-\n| rowspan=\"8\" valign=\"top\" | 1963 || 2 January || Vietnam War: The Viet Cong win their first major victory in the Battle of Ap Bac.\n|-\n| 8 May || Huế Phật Đản shootings: The Army of the Republic of Vietnam opens fire on Buddhists who defy a ban on the flying of the Buddhist flag on Vesak, the birthday of Gautama Buddha, killing 9. Earlier, President Ngô Đình Diệm allowed the flying of the Vatican flag in honour of his brother, Archbishop Ngô Đình Thục, triggering the Buddhist crisis in South Vietnam.\n|-\n| 3 June || Huế chemical attacks: The Army of the Republic of Vietnam rains liquid chemicals on the heads of Buddhist protestors, injuring 67 people. The United States threatens to cut off aid to the regime of Ngô Đình Diệm.\n|-\n| 11 June || Thích Quảng Đức, Vietnamese Buddhist monk (suicide).\n|-\n| 7 July || Double Seven Day scuffle: Secret police loyal to Ngô Đình Nhu, brother of President Ngô Đình Diệm, attack American journalists including Peter Arnett and David Halberstam at a demonstration during the Buddhist crisis in South Vietnam.\n|-\n| 21 August || Xá Lợi Pagoda raids: The Army of the Republic of Vietnam Special Forces loyal to Ngô Đình Nhu, brother of President Ngô Đình Diệm, vandalise Buddhist pagodas across South Vietnam, arresting thousands and leaving an estimated hundreds dead. In the wake of the raids, the Kennedy administration by Cable 243 orders the Embassy of the United States, Saigon to explore alternative leadership in the country, opening the way towards a coup against Diệm.\n|-\n| 2 November || 1963 South Vietnamese coup d'état: Arrest and assassination of Ngo Dinh Diem, the South Vietnamese President.\n|-\n| 6 November || 1963 South Vietnamese coup d'état: Coup leader General Dương Văn Minh takes over as leader of South Vietnam.\n|-\n| rowspan=\"9\" valign=\"top\" | 1964 || 30 January || General Nguyễn Khánh leads a bloodless military coup d'état, replacing Dương Văn Minh as Prime Minister of South Vietnam.\n|-\n| 2 May || Vietnam War: Attack on USNS Card – An explosion caused by Viet Cong commandos causes carrier USNS Card to sink in the port of Saigon.\n|-\n| 19 July  || Vietnam War: At a rally in Saigon, South Vietnamese Prime Minister Nguyễn Khánh calls for expanding the war into North Vietnam.\n|-\n| 20 July  || Vietnam War: Viet Cong forces attack a provincial capital, killing 11 South Vietnamese military personnel and 40 civilians (30 of which are children).\n|-\n| 27 July  || Vietnam War: The U.S. sends 5,000 more military advisers to South Vietnam, bringing the total number of United States forces in Vietnam to 21,000.\n|-\n| 2 August  || Vietnam War: United States destroyer Maddox is attacked in the Gulf of Tonkin. Air support from the carrier USS Ticonderoga sinks one gunboat, while the other two leave the battle.\n|-\n| 5 August  || Vietnam War: Operation Pierce Arrow – Aircraft from carriers USS Ticonderoga and USS Constellation bomb North Vietnam in retaliation for strikes against U.S. destroyers in the Gulf of Tonkin.\n|-\n| 7 August  || Vietnam War: The United States Congress passes the Gulf of Tonkin Resolution, giving U.S. President Lyndon B. Johnson broad war powers to deal with North Vietnamese attacks on U.S. forces.\n|-\n| 16 August  || Vietnam War: In a coup, General Nguyễn Khánh replaces Dương Văn Minh as South Vietnam's chief of state and establishes a new constitution, drafted partly by the U.S. Embassy.\n|-\n| rowspan=\"15\" |1965\n|\n|Vietnam War: Korean People's Army Air Force sent 200 pilots to Vietnam.\n|-\n| 2 March || Vietnam War: Operation Rolling Thunder – The United States Air Force 2nd Air Division, United States Navy and South Vietnam Air Force begin a 3½-year aerial bombardment campaign against North Vietnam.\n|-\n| 8 March || Vietnam War: Some 3,500 United States Marines arrive in Da Nang, South Vietnam, becoming the first American ground combat troops in Vietnam.\n|-\n| 29 April || Australia announces that it is sending an infantry battalion to support the South Vietnam government.\n|-\n| 10 June || Vietnam War – Battle of Đồng Xoài: About 1,500 Viet Cong mount a mortar attack on Đồng Xoài, overrunning its military headquarters and the adjoining militia compound.\n|-\n| 24 July || Vietnam War: Four F-4C Phantoms escorting a bombing raid at Kang Chi are targeted by antiaircraft missiles, in the first such attack against American planes in the war. One is shot down and the other 3 sustain damage.\n|-\n| 28 July || Vietnam War: U.S. President Lyndon B. Johnson announces his order to increase the number of United States troops in South Vietnam from 75,000 to 125,000, and to more than double the number of men drafted per month - from 17,000 to 35,000.\n|-\n| 18 August || Vietnam War – Operation Starlite: 5,500 United States Marines destroy a Viet Cong stronghold on the Van Tuong peninsula in Quảng Ngãi Province, in the first major American ground battle of the war. The Marines were tipped-off by a Viet Cong deserter who said that there was an attack planned against the U.S. base at Chu Lai.\n|-\n| 20 September || Vietnam War: An USAF F-104 Starfighter piloted by Captain Philip Eldon Smith is shot down by a Chinese MiG-19 Farmer. The pilot is held until 15 March 1973.\n|-\n| 9 October || A brigade of South Korean soldiers arrive in South Vietnam.\n|-\n| 30 October || Vietnam War: Near Da Nang, United States Marines repel an intense attack by Viet Cong forces, killing 56 guerrillas. A sketch of Marine positions is found on the dead body of a 13-year-old Vietnamese boy who sold drinks to the Marines the day before.\n|-\n| 8 November || Vietnam War – Operation Hump: The United States Army 173rd Airborne is ambushed by over 1,200 Viet Cong.\n|-\n| 14 November || Vietnam War – Battle of Ia Drang: In the Ia Drang Valley of the Central Highlands in Vietnam, the first major engagement of the war between regular United States and North Vietnamese forces begins.\n|-\n| 28 November || Vietnam War: In response to U.S. President Lyndon B. Johnson's call for \"more flags\" in Vietnam, Philippines President-elect Ferdinand Marcos announces he will send troops to help fight in South Vietnam.\n|-\n| 21 December || The Soviet Union announces that it has shipped rockets to North Vietnam.\n|-\n| rowspan=\"10\" valign=\"top\" | 1966 || 15 May || The South Vietnamese army besieges Da Nang.\n|-\n| 29 June || Vietnam War: U.S. planes begin bombing Hanoi and Haiphong.\n|-\n| 4 July || North Vietnam declares general mobilization.\n|-\n| 7 July || A Warsaw Pact conference ends with a promise to support North Vietnam.\n|-\n| 24 July || A USAF F-4C Phantom #63-7599 was shot down by a North Vietnamese SAM-2 45 miles (72 km) northeast of Hanoi, in the first loss of a US aircraft to a Vietnamese SAM in the Vietnam War.\n|-\n| 18 August || Vietnam War – Battle of Long Tan: D Company, 6th Battalion of the Royal Australian Regiment, meets and defeats a Viet Cong force estimated to be four times larger, in Phuoc Tuy Province, Republic of Vietnam.\n|-\n| 16 September || In South Vietnam, Thích Trí Quang ends a 100-day hunger strike.\n|-\n| 9 October || Vietnam War: Bình Tai massacre.\n|-\n| 24 October || Negotiations about the Vietnam War begin in Manila, Philippines.\n|-\n| 6 December || Vietnam War: Bình Hòa massacre.\n|-\n| rowspan=\"10\" valign=\"top\" | 1967 || 6 January || Vietnam War: USMC and ARVN troops launch Operation Deckhouse Five in the Mekong Delta.\n|-\n| 8 January || Vietnam War: Operation Cedar Falls starts.\n|-\n| 7 August || Vietnam War: The People's Republic of China agrees to give North Vietnam an undisclosed amount of aid in the form of a grant.\n|-\n| 21 August || Two U.S. Navy jets stray into the airspace of the People's Republic of China following an attack on a target in North Vietnam and are shot down. Lt. Robert J. Flynn, the only survivor, is captured alive and will be held prisoner by China until 1973.\n|-\n| 3 September || Nguyễn Văn Thiệu is elected President of South Vietnam.\n|-\n| 4–15 September || Vietnam War – Operation Swift: The United States Marines launch a search and destroy mission in Quảng Nam and Quảng Tín provinces. The ensuing 4-day battle in Que Son Valley kills 114 Americans and 376 North Vietnamese.\n|-\n| 17 October || Vietnam War: The Battle of Ong Thanh takes place.\n|-\n| 26 October || U.S. Navy pilot John McCain is shot down over North Vietnam and taken prisoner. His capture is confirmed two days later, and he remains a prisoner of war for more than five years.\n|-\n| 3–23 November || Vietnam War – Battle of Dak To: Around Đắk Tô (located about 280 miles north of Saigon near the Cambodian border), heavy casualties are suffered on both sides; U.S. troops narrowly win the battle on 22 November.\n|-\n| 4 December || Vietnam War: U.S. and South Vietnamese forces engage Viet Cong troops in the Mekong Delta (235 of the 300-strong Viet Cong battalion are killed).\n|-\n| rowspan=\"16\" valign=\"top\" | 1968 || 21 January || Vietnam War – Battle of Khe Sanh: One of the most publicized and controversial battles of the war begins, ending on 9 July.\n|-\n| 30 January || Vietnam War: The Tet Offensive begins, as Viet Cong forces launch a series of surprise attacks across South Vietnam.\n|-\n| 1 February || Vietnam War: A Viet Cong officer named Nguyễn Văn Lém is executed by Nguyễn Ngọc Loan, a South Vietnamese National Police Chief. The event is photographed by Eddie Adams. The photo makes headlines around the world, eventually winning the 1969 Pulitzer Prize, and sways U.S. public opinion against the war.\n|-\n| 12 February || Vietnam War: Phong Nhị and Phong Nhất massacre.\n|-\n| 24 February || Vietnam War: The Tet Offensive is halted; South Vietnam recaptures Huế.\n|-\n| 25 February  || Vietnam War: Hà My massacre.\n|-\n|1–30 March\n|Vietnam War: Operation Patrick.\n|-\n| 7 March || Vietnam War: The First Battle of Saigon ends.\n|-\n| 10–11 March || Vietnam War: Battle of Lima Site 85, the largest single ground combat loss of United States Air Force members (12) during the (at this time) secret war later known as the Laotian Civil War.\n|-\n| 16 March || Vietnam War – My Lai massacre: American troops kill scores of civilians. The story will first become public in November 1969 and will help undermine public support for the U.S. efforts in Vietnam.\n|-\n|30 March\n|Vietnam War: Operation Cochise Green starts.\n|-\n| 26 July || Vietnam War: South Vietnamese opposition leader Trương Đình Dzu is sentenced to 5 years hard labor, for advocating the formation of a coalition government as a way to move toward an end to the war.\n|-\n| 23 September || Vietnam War: The Tet Offensive comes to an end in South Vietnam.\n|-\n| 8 October ||  Vietnam War – Operation Sealords: United States and South Vietnamese forces launch a new operation in the Mekong Delta.\n|-\n| 31 October || Vietnam War: Citing progress in the Paris peace talks, U.S. President Lyndon B. Johnson announces to the nation that he has ordered a complete cessation of \"all air, naval, and artillery bombardment of North Vietnam\" effective 1 November.\n|-\n| 15 November || Vietnam War: Operation Commando Hunt is initiated to interdict men and supplies on the Ho Chi Minh trail, through Laos into South Vietnam. By the end of the operation, 3 million tons of bombs are dropped on Laos, slowing but not seriously disrupting trail operations.\n|-\n| rowspan=\"5\" valign=\"top\" | 1969 || 13–20 May || The Battle of Hamburger Hill, also known as Dong Ap Bia, begins during the Vietnam War.\n|-\n| 8 June || U.S. President Richard Nixon and South Vietnamese President Nguyễn Văn Thiệu meet at Midway Island. Nixon announces that 25,000 U.S. troops will be withdrawn by September.\n|-\n| 8 July || Vietnam War: The very first U.S. troop withdrawals are made.\n|-\n| 25 July || Vietnam War: U.S. President Richard Nixon declares the Nixon Doctrine, stating that the United States now expects its Asian allies to take care of their own military defense. This starts the \"Vietnamization\" of the war.\n|-\n| 2 September || Ho Chi Minh, the president of the North Vietnam, dies at the age of 79.\n|-\n| rowspan=\"5\" valign=\"top\" | 1970 || 5 September || Vietnam War – Operation Jefferson Glenn: The United States 101st Airborne Division and the South Vietnamese 1st Infantry Division initiate a new operation in Thua Thien Province (the operation ends in October 1971).\n|-\n| 12 October || Vietnam War: U.S. President Richard Nixon announces that the United States will withdraw 40,000 more troops before Christmas.\n|-\n| 30 October || In Vietnam, the worst monsoon to hit the area in six years causes large floods, kills 293, leaves 200,000 homeless and virtually halts the Vietnam War.\n|-\n| 4 November || Vietnam War – Vietnamization: The United States turns control of the air base in the Mekong Delta to South Vietnam.\n|-\n| 21 November || Vietnam War – Operation Ivory Coast: A joint Air Force and Army team raids the Sơn Tây prison camp in an attempt to free American POWs thought to be held there (no Americans are killed, but the prisoners have already moved to another camp; all U.S. POWs are moved to a handful of central prison complexes as a result of this raid).\n|-\n| rowspan=\"4\" valign=\"top\" | 1971 || 13 February || Vietnam War: Backed by American air and artillery support, South Vietnamese troops invade Laos.\n|-\n| 18 August || Vietnam War: Australia and New Zealand decide to withdraw their troops from Vietnam.\n|-\n| 29 October || Vietnam War – Vietnamization: The total number of American troops still in Vietnam drops to a record low of 196,700 (the lowest since January 1966).\n|-\n| 12 November || Vietnam War – Vietnamization: U.S. President Richard M. Nixon sets 1 February 1972, as the deadline for the removal of another 45,000 American troops from Vietnam.\n|-\n| rowspan=\"11\" valign=\"top\" | 1972 || 24 February || North Vietnamese negotiators walk out of the Paris Peace Talks to protest U.S. air raids.\n|-\n| 30 March || Vietnam War: The Easter Offensive begins after North Vietnamese forces cross into the Demilitarized Zone (DMZ) of South Vietnam (ends in October 1972)\n|-\n| 16 April || Vietnam War – Nguyen Hue Offensive: Prompted by the North Vietnamese offensive, the United States resumes bombing of Hanoi and Haiphong.\n|-\n| 8 May || U.S. President Richard Nixon orders the mining of Haiphong Harbor in Vietnam.\n|-\n| 10 May || Operation Linebacker and Operation Custom Tailor begin with large-scale bombing operations against North Vietnam by tactical fighter aircraft.\n|-\n| 8 June || Vietnam War: Associated Press photographer Nick Ut takes his Pulitzer Prize-winning photograph of a naked nine-year-old Phan Thi Kim Phuc running down a road after being burned by napalm.\n|-\n| || U.S. actress Jane Fonda tours North Vietnam, during which she is photographed sitting on a North Vietnamese anti-aircraft gun.\n|-\n| 26 October || Following a visit to South Vietnam, U.S. National Security Advisor Henry Kissinger suggests that \"peace is at hand.\"\n|-\n| 11 November || Vietnam War – Vietnamization: The United States Army turns over the massive Long Binh military base to South Vietnam.\n|-\n| 22 November || Vietnam War: The United States loses its first B-52 Stratofortress of the war.\n|-\n| 25 December || The Christmas bombing of North Vietnam causes widespread criticism of the U.S. and President Richard Nixon.\n|-\n| rowspan=\"4\" valign=\"top\" | 1973 || 15 January || Vietnam War: Citing progress in peace negotiations, U.S. President Richard Nixon announces the suspension of offensive action in North Vietnam.\n|-\n| 27 January || U.S. involvement in the Vietnam War ends with the signing of the Paris Peace Accords.\n|-\n| 29 March || The last United States soldier leaves Vietnam.\n|-\n| 15 August || The U.S. bombing of Cambodia ends, officially halting 12 years of combat activity in Southeast Asia according to the Case–Church Amendment-an act that prohibites military operations in Laos, Cambodia, and North and South Vietnam as a follow-up of the Paris Peace Accords.\n|-\n|1974\n|19 January\n|Vietnam War: The battle of the Paracel Islands between People's Republic of China and South Vietnam. This is the most famous and the only major battle involve China in Vietnam War.\n|-\n| rowspan=\"8\" valign=\"top\" | 1975 || 20 January || In Hanoi, North Vietnam, the Politburo approves the final military offensive against South Vietnam.\n|-\n| 10 March || Vietnam War: North Vietnamese troops attack Ban Mê Thuột, South Vietnam, on their way to capturing Saigon.\n|-\n| 13 March || Vietnam War: South Vietnam President Nguyễn Văn Thiệu orders the Central Highlands evacuated. This turns into a mass exodus involving troops and civilians (the Convoy of Tears).\n|-\n| 4 April || Vietnam War: The first military Operation Babylift flight, C5A 80218, crashes 27 minutes after takeoff, killing 138 on board; 176 survive the crash.\n|-\n| 25 April || Vietnam War: As North Vietnamese Army forces close in on the South Vietnamese capital Saigon, the Australian Embassy is closed and evacuated, almost 10 years to the day since the first Australian troop commitment to South Vietnam.\n|-\n| 29 April || Vietnam War:\n* Operation Frequent Wind – Americans and their allies are evacuated from South Vietnam by helicopter.\n* North Vietnam concludes its East Sea Campaign by capturing all of the Spratly Islands that were being held by South Vietnam.\n|-\n| 30 April || The Vietnam War ends with the Fall of Saigon: The Vietnam War concludes as Communist forces from North Vietnam take Saigon, resulting in mass evacuation of the remaining American troops and South Vietnam civilians. As the capital is taken, South Vietnam surrenders unconditionally and is replaced with the temporary Provisional Government.\n|-\n| 1 May || The Cold War between Cambodia and Vietnam begins, which eventually leads to the Cambodian–Vietnamese War.\n|-\n| rowspan=\"3\" valign=\"top\" | 1976 || || President Tôn Đức Thắng (1976–1980) became ruler of Vietnam.\n|-\n| || The National Assembly proclaims unification of the country as the Socialist Republic of Vietnam.\n|-\n| || Fourth National Party Congress. The Vietnamese Workers Party renamed the Vietnam Communist Party.\n|-\n| 1977 || || Admittance to United Nations.\n|-\n| rowspan=\"3\" valign=\"top\" | 1978 || || Admittance to the Comecon.\n|-\n| || 25-year \"Treaty of Friendship and Cooperation\" with the Soviet Union.\n|-\n| 25 December || Vietnam launches a major offensive against the Khmer Rouge of Cambodia.\n|-\n| rowspan=\"2\" |1979\n| 17 February || The People's Republic of China invades northern Vietnam, launching the Sino-Vietnamese War. The war ended with no border changes on 16 March.\n|-\n| || President Tôn Đức Thắng (1976–1980) ended his rule of Vietnam.\n|-\n| 1980 || || Ruler: President Nguyễn Hữu Thọ (1980–1981)\n|-\n| rowspan=\"2\" valign=\"top\" | 1982 || || Trường Chinh, Chairman of the State Council (1981–1987) became ruler of Vietnam.\n|-\n| March|| Fifth National Party Congress.\n|-\n| rowspan=\"1\" valign=\"top\" | 1986 || December|| Sixth National Party Congress. Trường Chinh, Chairman of the State Council (1981–1987) ended his rule of Vietnam. Đổi Mới begins.\n|-\n| rowspan=\"2\" valign=\"top\" | 1988 || || Võ Chí Công, Chairman of the State Council (1987–1992) became ruler of Vietnam.\n|-\n| March|| Johnson South Reef skirmish.\n|-\n| rowspan=\"3\" valign=\"top\" | 1991 || June|| Seventh National Party Congress.\n|-\n| || Võ Chí Công, Chairman of the State Council (1987–1992) ended his rule of Vietnam.\n|-\n| || Dissolution of the Soviet Union ends the existence of the Soviet Union and aid throughout Vietnam.\n|-\n| rowspan=\"2\" valign=\"top\" | 1995 || || President Lê Đức Anh (1992–1997) became ruler of Vietnam.\n|-\n| 28 July|| Admittance to ASEAN.\n|-\n| rowspan=\"2\" valign=\"top\" | 1996 || || Eighth National Party Congress.\n|-\n| || President Lê Đức Anh (1992–1997) ended his rule of Vietnam.\n|}\n21st century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"1\" valign=\"top\" | 2001\n| April || Ninth National Party Congress.\n|-\n| rowspan=\"1\" valign=\"top\" | 2002\n| || President Trần Đức Lương starts his second term.\n|-\n| rowspan=\"2\" valign=\"top\" | 2006 || April || Tenth National Party Congress.\n|-\n| || Trần Đức Lương (1997–2006) resigns as President of Vietnam, replaced by Nguyễn Minh Triết.\n|-\n| rowspan=\"1\" valign=\"top\" | 2007\n| || Admittance to World Trade Organization.\n|-\n| rowspan=\"2\" valign=\"top\" | 2011 || January || Eleventh National Party Congress.\n|-\n| || President Nguyễn Minh Triết (2006–2011) ends his term, replaced by Trương Tấn Sang.\n|-\n| rowspan=\"1\" valign=\"top\" | 2013 ||  || Amendment of Constitution. Democratic recommendations are ignored by the National Assembly. The new constitution comes into effect on the first day of next year.\n|-\n| rowspan=\"1\" valign=\"top\" | 2014 || May–July ||  Hai Yang Shi You 981 standoff: Tensions arises from the Chinese state-owned China National Offshore Oil Corporation moving its Hai Yang Shi You 981 oil platform to waters near the disputed Paracel Islands, resulting in large anti-China protests across Vietnam.\n|-\n| rowspan=\"1\" valign=\"top\" | 2015 || 1 January || Vietnam’s new marriage law goes into effect. Same-sex marriages are no longer prohibited, but are not recognized as being legally valid.\n|-\n| rowspan=\"3\" valign=\"top\" | 2016 || January || Twelfth National Party Congress.\n|-\n| || President Trương Tấn Sang (2011–2016) ends his term, replaced by Trần Đại Quang.\n|-\n| April–July || 2016 Vietnam marine life disaster.\n|-\n| rowspan=\"1\" valign=\"top\" | 2020 || || First year of the COVID-19 pandemic in Vietnam.\n|-\n| rowspan=\"2\" valign=\"top\" | 2021 || January || Thirteenth National Party Congress. Unprecedented third term of the CPV General Secretary Nguyễn Phú Trọng starts.\n|-\n| || The COVID-19 situations worsen significantly, particularly in Ho Chi Minh City.\n|-\n| rowspan=\"1\" valign=\"top\" | 2022 || || Việt Á scandal, 'Rescue flights' scandal, and other corporate scandals are exposed.\n|-\n| rowspan=\"1\" valign=\"top\" | 2023 || January|| Nguyễn Xuân Phúc resigns as President of Vietnam, replaced by Võ Văn Thưởng.\n|-\n| rowspan=\"4\" |2024\n|\n|Trial of Trương Mỹ Lan and Van Thinh Phat Holdings Group.\n|-\n|March\n|Võ Văn Thưởng resigns as President of Vietnam, replaced by Tô Lâm.\n|-\n|July\n|CPV General Secretary Nguyễn Phú Trọng dies in his third term. Tô Lâm succeeds.\n|-\n|October\n|Tô Lâm resigns as President of Vietnam, replaced by Lương Cường.\n|-\n| rowspan=\"1\" valign=\"top\" | 2025 || July || Following the merger of administrative units, Vietnam has 34 provincial-level units, comprising 28 provinces and 6 centrally governed cities.\n|}\nSee also\n*Timeline of Vietnam under Chinese rule\n*Timeline of early independent Vietnam\n*Timeline of the Lý dynasty\nNotes\nReferences\n*Cao Xuân Đỉnh. Người anh hùng làng Dóng. NxbKHXH 1969.\n*Dao, T. T. 1985. Types of rice cultivation and its related civilization in Vietnam. East Asian Cultural Studies 24: 41—56.\n*Doh Chull Shin (2011).  Confucianism and Democratization in East Asia. Cambridge University Press.\n*Hauptly, Denis J. (1985), In Vietnam, New York.\n*Iwona Czerwinska Pawluk and Walery Zukow (2011).\n*Jeffrey, Laura S. (2007). Celebrate Tet. Enslow Publishers, Inc.\n*Lê Trung Vũ & Lê Hồng Lý. Lễ hội Việt Nam. Hương Trang Cultural Company Ltd. & NXB Văn hóa Thông tin, 2005.\n*Mark W. McLeod & Nguyen Thi Dieu (2001). Culture and Customs of Vietnam. Greenwood Publishing Group.\n*McCrum, Mark (2008). Going Dutch in Beijing: How to Behave Properly When Far Away from Home. Macmillan.\n*\n*Tarling, Nicholas. The Cambridge History of Southeast Asia. Cambridge University Press, 1999.\n*Taylor, Keith Weller, The Birth of Vietnam. University of California Press, 1991."
    }
  ]
}