{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Szczecin\n\nThe following is a timeline of the history of the city of Szczecin, Poland.\nPrior to 16th century\nSzczecin Cathedral]]\n* 967 - Szczecin became part of Poland under Mieszko I of Poland.\n* 1121 - Bolesław III Wrymouth in power.\n* 1124 -  founded.\n* ca. 1185 - Ducal mint founded.\n* 1186 - Stay of the future Polish monarch Władysław III Spindleshanks at the court of Bogusław I, Duke of Pomerania in Szczecin, on behalf of his father, Duke of Greater Poland (and periodically also High Duke of Poland) Mieszko III the Old.\n* 1243 - Szczecin granted Magdeburg city rights by Duke Barnim I the Good.\n* 1273 - Wedding of duke of Poznań and future King of Poland Przemysł II with princess Ludgarda, granddaughter of Barnim I, Duke of Pomerania.\n* 1275 - The city's inhabitants granted the right of free movement in the Principality of Rügen by Slavic Duke of Rügen Vitslav II.\n* 1277 - The city purchases the villages, present-day districts, Krzekowo and Osów.\n* 1278 - King Eric V of Denmark exempts the city's inhabitants from customs duties for a fair organised in Zealand, Denmark, along with a promise of peace and protection.\n* 1284 - The city helps Duke Bogislaw IV to guarantee a peace treaty between the Duchy of Pomerania and the Margraviate of Brandenburg.\n* 1295 - The city becomes capital of a splinter eponymous duchy under Otto I, and a residential city of Pomeranian dukes.\n* 1360 - Szczecin becomes part of Hanseatic League.\n* 1384 -  becomes mayor.\n* 1478 - The city becomes the capital of the reunified Duchy of Pomerania.\n16th to 19th centuries\n* 1532 - The city becomes again the capital of a splinter eponymous duchy.\n* ca. 1532 - Stoppage of minting coins in the local mint.\n* 1535 - Protestant reformation.\n* 1570 - Peace treaty, ending the Northern Seven Years' War between Denmark and Sweden signed in the city.\n* 1577 - Printing press in operation.\n* 1580 - Resumption of mint work.\n* 1582 - Ducal Castle rebuilt.\n* 1606 - Start of reign of Duke Philip II, the greatest patron of the arts among all Pomeranian dukes.\n* 1625 - Under Bogislaw XIV the city becomes again the capital of the reunited Duchy of Pomerania.\n* 1630 -  becomes mayor.\n* 1637 - Death of Bogislaw XIV, the last Pomeranian duke of the House of Griffin.\n* 1648 - City becomes part of Sweden.\n* 1654 - Burial of Bogislaw XIV in the Ducal Castle.\n* 1677 - City taken by Frederick William of Brandenburg.\n* 1679 - Swedes in power again per Treaty of Saint-Germain-en-Laye.\n* 1709 - Ducal mint closed down.\n* 1711 - Stay of King Stanisław Leszczyński in the city.\n* 1720 - City becomes part of Prussia.\n* 1721\n** 6 June: French commune founded for the Huguenots, with separate French law and a separate French court.\n** 20 July: First French church service held at the castle.\n* 1740 -  built.\n* 1806\n** October: Capitulation of Stettin without resistance to France.\n** City occupation by French forces begins.\n* 1809 - French courthouse ceases to exist.\n* 1813\n** Siege by combined Prussian-Russian-Swedish forces.\n** December - City occupation by French forces ends.\n* 1827 - Royal Archives established.\n* 1851 - Schiffswerft und Maschinenfabrik Früchtenicht & Brock (shipbuilder) in business in nearby Drzetowo (then Bredow).\n* 1870–1871 - Prussian prisoner-of-war camp for around 1,700 French soldiers located in the city during the Franco-Prussian War, death of around 600 French soldiers.\n* 1871 - City becomes part of the German Empire.\n* 1878 - Hermann Haken becomes mayor.\n* 1885 - Population: 99,475.\n* 1895 - Population: 140,724.\n* 1898 - Harbour built.\n20th century\n* 1901 - Central Cemetery in Szczecin established.\n* 1907 - Friedrich Ackermann becomes mayor.\n* 1909 -  (cinema) opens.\n* 1911 - Pogodno and Świerczewo included within city limits.\n* 1919 - Population: 232,726.\n* 1925 - Consulate of the Republic of Poland opened.\n* 1933 - Stettin-Bredow concentration camp established by Nazi Germany in Drzetowo.\n* 1934\n** 15 February: Polish scout troop Gryf founded.\n** 9 March: Stettin-Bredow concentration camp dissolved.\n]]\n* 1939\n** Population: 374,017.\n** Gemeinschaftslager Tiergarten forced labour camp established by the Germans.\n* 1940\n**  begins.\n** Merkurlager 4-Am Lenzweg forced labour camp established by the Germans.\n* 1941\n** Stalag 322 prisoner-of-war camp briefly based in the city, but soon relocated.\n** Gemeinschaftslager Tiergarten forced labour camp dissolved.\n* 1943 - September: Dulag transit camp for prisoners of war established by the Germans.\n* 1943–1944 - The Polish resistance movement facilitated escapes of Polish and British prisoners of war who fled from German POW camps via the city's port to neutral Sweden.\n* 1944 - Merkurlager 4-Am Lenzweg forced labour camp dissolved.\n* 1945\n** May–June:  newspaper published.\n** 5 July: City becomes again part of Poland.\n**  becomes mayor.\n** Szczecin Shipyard and National Museum in Szczecin established.\nin 1949]]\n* 1946\n** 12 May: Consulate of France opened.\n** Population: 72,948.\n* 1947\n** 8 March: Polish-French Friendship Society founded.\n** 19 June:  newspaper begins publication.\n* 1948\n** 21 April: Pogoń Szczecin, the city's most popular football club, founded.\n** 26 April: French Institute founded.\n** 25 October: Szczecin Philharmonic inaugurated.\n* 1956\n** Mass raising of medical supplies and blood donation for the Hungarian Revolution of 1956 (see also Hungary–Poland relations).\n** 10 December: Protests against the Soviets and communist rule and in solidarity with Hungary. Protesters seized and demolished the Soviet consulate.\n* 1962 - 9 October: 1962 Szczecin military parade debacle.\n* 1965 - September: City co-hosts the 1965 FIVB Volleyball Men's World Cup.\n* 1966 - Arkonia Szczecin wins its first Polish Water Polo Championship.\n* 1970 - December: 1970 Polish protests.\n* 1972\n** 1 January: Śmierdnica included within city limits.\n** 28 June: Roman Catholic diocese of Szczecin-Kamień established.\n* 1974 - Population: 360,500.\n, 1980]]\n* 1980\n** August: .\n** 30 August: Szczecin Agreement signed, strike ends.\n* 1982 - August: Solidarity demonstration.\n* 1983 - Pogoń Szczecin wins its first Polish women's handball championship.\n* 1984 - University of Szczecin established.\n* 1985 - Morze Bałtyk Szczecin wins its first Polish volleyball championship.\n* 1987 - Visit of Pope John Paul II.\n* 1988 - August: Labor strike.\n* 1990 - Sister city partnership signed between Szczecin and Esbjerg, Denmark.\n* 1992 - Sister city partnership signed between Szczecin and St. Louis, United States.\n21st century\n* 2001 -  (shipyard) active.\n* 2002 - Honorary Consulate of Estonia opened (see also Estonia–Poland relations).\n* 2006 - Piotr Krzystek becomes mayor.\n* 2007 - Monument to the victims of Nazi German forced labour camps in the Pomorzany neighbourhood unveiled by one of its survivors, Florian Nowacki.\n* 2011 - Szczecin hosts the 2011 European Short Course Swimming Championships.\n]]\n* 2012\n** Jan Czekanowski monument unveiled.\n** Population: 408,900.\n* 2014 - Szczecin Philharmonic Hall built.\n* 2016\n** 1 January: City limits slightly expanded by including a part of the village of Rzęśnica.\n** July: Monument to the victims of the Ponary massacre unveiled.\n** December: Hungarian-funded \"Boy of Pest\" monument unveiled to commemorate the gratitude of Hungarians for Polish support of the Hungarian Revolution of 1956.\n* 2017 - Szczecin co-hosts the 2017 Men's European Volleyball Championship.\n* 2018 - Lech Kaczyński monument unveiled.\n* 2019\n** February: Monument to the victims of Massacres of Poles in Volhynia and Eastern Galicia unveiled.\n** April: Szczecin hosts the 2019 European Artistic Gymnastics Championships.\n** Monument of Wojtek, the Soldier Bear unveiled.\n* 2021\n** September: Honorary Consulate of Luxembourg opened (see also Luxembourg–Poland relations).\n** 17 October: Jerzy Popiełuszko monument unveiled.\n** 27 October: Monument of , doctor and member of the Home Army during World War II, unveiled in the Pomorzany neighbourhood.\n* 2024 - June: Pogoń Szczecin wins its first Polish women's football championship.\nSee also\n* History of Szczecin\n* Etymology of Szczecin and Other names of Szczecin e.g. Stedyn, Stetin\nReferences\nThis article incorporates information from the Polish Wikipedia and German Wikipedia.\nBibliography\nin English\n*\n*  (with details about Stettin)\n*\n*\n*\n| title-link = Encyclopædia Britannica Eleventh Edition\n}}***Please note that a wikilink to the article on [Stettin] in [EB1911] is not available***\n*\n|title-link = Haydn's Dictionary of Dates |hdl = 2027/loc.ark:/13960/t89g6g776?urlappend=%3Bseq=1324 }}\nin other languages\n*\n*\n*\n*\n*\nExternal links\n* Links to fulltext [https://de.wikisource.org/wiki/Adressbücher#S city directories for Szczecin] via Wikisource\n* Digital Public Library of America. [http://dp.la/search?utf8=✓&page_size=100&q=Szczecin+OR+stettin Items related to Szczecin], various dates"
    }
  ]
}