{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of strikes in 1978\n\nIn 1978, a number of labour strikes, labour disputes, and other industrial actions occurred.\nBackground\nA labour strike is a work stoppage caused by the mass refusal of employees to work. This can include wildcat strikes, which are done without union authorisation, and slowdown strikes, where workers reduce their productivity while still carrying out minimal working duties. It is usually a response to employee grievances, such as low pay or poor working conditions. Strikes can also occur to demonstrate solidarity with workers in other workplaces or pressure governments to change policies.\nTimeline\nContinuing strikes from 1977\n* Coors strike and boycott\n* 1977–78 British firemen's strike\n* 1977–78 Indonesia student protests\n* Grunwick dispute, in the United Kingdom.\n* 1977–78 Lockheed strike, 12-week strike by Lockheed Corporation workers in the United States.\n* 1977–78 Maharashtra public sector strike, 54-day strike by Maharashtra governement workers.\n* 1975–80 Sonacotra rent strike, rent strike by immigrant workers in France.\n* UMW Bituminous coal strike of 1977–1978, 110-day strike by coal miners in the United States.\n* 1977–79 Wien Air Alaska strike, 22-month strike by Wien Air Alaska pilots.\nJanuary\n* Iranian revolution\n* 1978 Israeli seamen's strike, 80-day strike by seamen in Israel.\n* January 1978 Nicaraguan general strike, 17-day general strike in Nicaragua following the assassination of Pedro Joaquín Chamorro Cardenal\n* 1978 massacre at Multan Colony Textile Mills\nFebruary\n* 1978 Sime Darby strike, 29-day strike by Sime Darby plantation workers in Malaysia.\nMarch\n* 1978–1980 ABC Paulista strikes, series of strikes in the ABC Region; part of the Redemocratization in Brazil.\nApril\n* 1978 Israeli journalists' strike, 11-day strike by journalists in Israel over a lack of wage increases.\nMay\n* 1978 Fleck strike, in Canada.\n* 1978–79 Puretex Knitting Company strike, by Puretex Knitting Company workers in Toronto, Canada, against workplace surveillance.\nJune\n* 1978 British Columbia brewery lockout\n* 1978 Montreal Star strike, 8-month strike by Montreal Star workers in Canada.\n* 1978 Safeway strike, in Manitoba, Canada.\nJuly\n* 1978 Memphis fire and police strike, strike by firefighters and police officers in Memphis, Tennessee, United States.\nAugust\n* 1978 Australian telecom strike\n* 1978 New York City newspaper strike, 88-day strike by newspaper workers in New York City, United States.\nSeptember\n* 1978 Inco strike, by Inco Limited workers in Greater Sudbury, Ontario; one of the longest strikes in Canadian history.\n* 1978 Israeli teachers' strike\nOctober\n* 1978 Canada Post strike\n* 1978 Vinmonopolet strike, strike by Vinmonopolet workers in Norway.\nNovember\n* 1978 Ghanaian public sector strike\n* 1978–79 West German steelworkers' strike\n* 1978 Indian port strike\n* Winter of Discontent, series of strikes in the United Kingdom for greater wages.\nDecember\n* 1978 Canary Islands hotel strike\n* 1978–79 West Bengal printers' strike\nReferences"
    }
  ]
}