{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of LGBTQ Mormon history in the 1980s\n\nThis is a timeline of LGBT Mormon history in the 1980s, part of a series of timelines consisting of events, publications, and speeches about LGBTQ+ individuals, topics around sexual orientation and gender minorities, and the community of members of the Church of Jesus Christ of Latter-day Saints (LDS Church). Although the historical record is often scarce, evidence points to queer individuals having existed in the Mormon community since its beginnings. However, top LDS leaders only started regularly addressing queer topics in public in the late 1950s. Since 1970, the LDS Church has had at least one official publication or speech from a high-ranking leader referencing LGBT topics every year, and a greater number of LGBT Mormon and former Mormon individuals have received media coverage.\nTimeline\n1980\nin part from believing it would lead to same-sex marriage and parenting.]]\n* March – The Ensign published the article \"The Church and the Proposed Equal Rights Amendment: A Moral Issue\" outlining the church's arguments against the Equal Rights Amendment. These included the possibility it could give \"constitutional protection to immoral same-sex—lesbian and homosexual—marriages\", thus, \"giving legal sanction to the rearing of children\" in a \"homosexual home\".\n* April – Apostle Bruce R. McConkie gave an April conference address in which he grouped homosexuals with liars, thieves, and murderers in a list of evil \"covering the earth\".\n* October – Kimball again addressed homosexuality in the October General Conference asserting that \"[s]ometimes masturbation is the introduction to the more serious ... sin of homosexuality.\"\n1981\n* 1981 – Church leaders sent every bishop and stake president a copy of a book on human sexuality and families by Church Welfare Services director Victor Brown Jr. The book stated that it was disturbing that renowned sexologists had stated that bisexual individuals were privileged for not experiencing sexual prejudice and that they pointed the way for society at large. Brown further stated that equating same-sex relationships with opposite-sex marriage was fallacious and inconsistent and that homosexual people were less disciplined and orderly in their relationships than heterosexuals.\n* 1981 – The church issued a guide for LDS Social Services employees called Understanding and Changing Homosexual Orientation Problems, instructing them that because of agency it is \"inconsistent\" to think that a \"homosexual orientation is inborn or locked in, and there is no real hope of change,\" and that \"the homosexually oriented man ... does not fully understand how a masculine man is supposed to think and act.\" The guide further states that the homosexual's \"thoughts of the opposite sex are often fearful or threatening.\"\n* 1981 – The First Presidency and Twelve Apostles also issued a guide for church leaders simply called \"Homosexuality\" which stated \"modern-day prophets have clearly promised that homosexuality can be changed\", and that it was \"inconceivable that ... [the Lord] would permit ... his children to be born with [homosexual] desires and inclinations\". It advised \"full rehabilitation\" could take 1 to 3 years, and that being \"cured\" does not mean \"the old thoughts never return\". The booklet gave guidelines for \"treatment and prevention of homosexuality\" and \"lesbianism\". It taught that homosexual behavior is learned and influenced by \"unhealthy emotional development in early childhood\", a \"disturbed family background, \"poor relationships with peers\", \"unhealthy sexual attitudes\", and \"early homosexual experiments\". \"Early masturbation experiences\" were also cited as reinforcing \"homosexual interests\". Church leaders recommended the leader encourage the member to disclose the names of sexual partners, to read The Miracle of Forgiveness and \"To the One\", to begin dating, and to pray in order to help change their sexual orientation.\n* April – Church Welfare Services director Victor Brown Jr. published an article in the Association of Mormon Counselors and Psychotherapists journal which outlined his theory on how men become gay stating that \"homosexuality is learned not inherent\" and caused by \"parent-child disturbances, gender and role distortion, relationship skill deficits\", \"masturbatory fantasy\", \"a severe realization of being different\", and then a merging of the \"person and [homosexual] role\".\n* April – In General Conference, church Seventy Hartman Rector Jr. gave a speech in which he stated the earth would be wasted if Jesus returns and \"finds nothing but birth control, sterilization, and homosexuals.\" He added, \"If children have a happy family experience they will not want to be homosexual.\" Rector also stated he was \"sure\" that homosexuality \"is an acquired addiction, just as drugs, alcohol and pornography are.\" He also stated \"I do not believe\" that homosexuals \"were born that way\" because \"[t]here are no female spirits trapped in male bodies and vice versa.\"\n* April – In the same conference apostle Ezra Taft Benson denounced how some public schools gave sanction to \"alternative life-styles\" and \"perverse practices\" such as \"lesbianism\".\n* October – A march of about 15 gay post-Mormons calling themselves \"Ethyl and Friends for Gay Rights\" was given city permission to protest on public property around Temple Square during the church's general conference with signs like \"We are God’s Children.\" The leader Randy Smith (whose drag performance name was Ethel) had previously undergone electroshock aversion therapy at BYU.\n1982\n* August – In a speech to BYU on August 28 then president of Ricks College Bruce C. Hafen counseled students to avoid homosexuality \"at all costs, no matter what the circumstances\". He further cited the 1973 removal of homosexuality as a mental disorder from the DSM as an example of something gone wrong \"deep within our national soul\".\n* August – The Church-owned television station KBYU refused to air the third segment of a documentary on homosexuality in Utah in part because it contained interviews of anonymous gay BYU students. The producer Kevin Mitchell stated their faces were not shown as he believed they would be kicked out of BYU if their identities were revealed.\n* October – Apostle Ezra Benson stated in general conference that homosexuality was one of the most obvious great problems in our society  and that it was a symptom of failure in the home.\n1983\n* 1983 – The Church Handbook was updated to state that a church court \"may be convened to consider\" serious transgressions including \"homosexuality\" and \"lesbianism\" but is not required. Additionally, a section on gender confirmation surgery was added stating the receiving or administering the procedure requires disciplinary action including excommunication for any member changing their sex with no chance for rebaptism. Individuals joining the church after the procedure would be ineligible for receiving the priesthood or temple rites.\n* September – Salt Lake City native Michael Painter died of HIV-related causes, the first known AIDS death in Utah. He had served an LDS mission and had been married to a woman, though he was gay.\n* October – Apostle Ezra Taft Benson gave a conference address in which he called homosexuality one of the \"great problems in our society\" and decried the use of the term \"alternative life-style\" as an attempt to justify homosexuality.\n* November – Benson published an article stating that a priesthood holder is virtuous and thus will not exhibit \"homosexual behavior, self-abuse, child molestation, or any other sexual perversions.\"\n1984\n* July – Gay former Mormon Gerald Pearson died of complications due to AIDS under the care of his former spouse Carol Lynn Pearson. After Gerald confessed same-sex sexual experimentation to his bishop, he told Gerald to marry a woman to make his life right. He later met Carol at BYU in 1965 and they were married in 1966. Carol would go on to write a memoir Goodbye, I Love You in 1986, a landmark work on the intersection of homosexuality and Mormonism.\n* August – Apostle Oaks wrote a church memo that informed church action on LGBT legislation for more than three decades. In it he recommended the church make a public statement to \"oppose job discrimination laws protecting homosexuals\" unless there were exceptions for allowing employers to \"exclude homosexuals from employment that involves teaching ... young people\". He also noted \"the irony [that] would arise if the Church used [Reynolds v. United States],\" the principal 1878 ruling stating that marriage is between a man and a woman, \"as an argument for the illegality of homosexual marriages [since it was] formerly used against the Church to establish the illegality of polygamous marriages.\" Oaks also clarified that the word homosexuality is used in two senses: as a \"condition\" or \"tendency\", and as a \"practice\" or \"activity\".\n* October – Church seventy Richard G. Scott gave a discourse in which he says \"stimulation can lead to acts of homosexuality, and they are evil and absolutely wrong\".\n1985\n* 1985 – A few members of Affirmation including Antonio Feliz formed a Latter Day Saint church for lesbian and gay Mormons known as the Restoration Church of Jesus Christ.\n1986\n* January – BYU published a study by BYU professor and area Church Welfare Services director Victor Brown Jr. stating that people can eliminate homosexual feelings.\n* March – Twenty-six-year-old Clair Harward, who was dying from complications due to AIDS, was excommunicated for his homosexuality and told by his Ogden, Utah bishop Bruce Don Bowen to disclose the identities of and avoid his gay friends, and banned from church meetings for fear of spreading the disease. His story made national headlines and prompted a statement from a church spokesperson.\n* June – Church seventy Theodore Burton stated in a BYU-wide address that pornography is a selfish indulgence that leads to homosexuality.\n* October – The president of the church Ezra Taft Benson announced in conference that a priesthood holder is virtuous and does not participate in, \"fornication, homosexual behavior, self-abuse, child molestation, or any other sexual perversion.\"\n* October – The New York Times published an article on AIDS in Utah citing the strong influence that Mormon teachings have on the state since 65% of the population were Mormon. The article stated that church members identified as homosexual were directed by the church to marry and that they faced great pressure not to acknowledge their gay feelings often leading to double lives. It further stated that since 1983, 47 Utahns had been diagnosed with AIDS and 24 had died. Several gay Mormon men were quoted saying that they had faced church pressure to marry with the belief that marriage would \"cure\" their feelings.\n* December – An article for parents appeared in the Ensign reaffirming that \"sometimes masturbation is the introduction to ... the gross sin of homosexuality\" which \"is a perversion of the Lord’s designated roles of men and women\".\nhas been an influential figure in church interactions with homosexual people, instituting a system of surveillance to identify and expel or attempt to \"cure\" homosexual students as president of BYU in the 1970s, and doing numerous important video interviews and articles on the topic in the 1980s, 1990s, and 2000s.]]\n* December – Dallin H. Oaks commented in a December 30 CBS-TV interview that \"marriage is not doctrinal therapy for homosexual relations\" and that \"he did not know whether individual leaders have given such advice.\"\n1987\n* April – Gordon B. Hinckley of the First Presidency gave a conference address in which he stated, \"homosexual relations ... are grievous sins.\" He continued by saying \"marriage between a man and a woman is ordained of God .... Marriage should not be viewed as a therapeutic step to solve problems such as homosexual inclinations or practices, which first should clearly be overcome with a firm and fixed determination never to slip to such practices again.\"\n* June – Seventy Theodore M. Burton implied a link between a \"selfish indulgence\" in pornography and homosexuality in his address to BYU on June 3.\n* October – At BYU the president of the church Ezra Taft Benson discussed the US AIDS epidemic stating that the Americans should abstain from any sex outside of marriage and that the issue \"began primarily through widespread homosexuality.\"\n* November – Joy Evans of the Relief Society General Presidency stated that \"there are lesbian women, as well as homosexual men, in the Church\" to whom \"the Lord has decreed 'Thou shalt not. She acknowledges it is a hard task but states they must \"keep the commandments\" since \"intimate relationships ... between those of the same sex, is forbidden\". The article appeared in that month's issue of the Ensign.\n1988\n* 1988 – Gay BYU history professor and former BYU student Michael Quinn resigned under increasing pressure for publications on controversial aspects of Mormon history after working for the university since 1976. He was later excommunicated in September 1993 along with other LDS scholars referred to as the September Six.\n* 1988 – Gay, Mormon convert and activist David Sharpton founded the People With AIDS Coalition of Utah (PWACU) to serve the HIV-positive population of Utah after contracting HIV in 1985. He died in 1992 after living with AIDS for seven years.\n*1988 – A document was published by Jerry Falwell and the Moral Majority titled the Family Manifesto. The document was an assertion of belief on traditional marriage, gender roles between men and women, and the responsibility of parents to children. Mormon Stories later discussed how this document may have been used as a source by the church in writing the Family Proclamation 7 years later in 1995.\n* May – The First Presidency released a statement on AIDS stating, \"Members of the Church should extend compassion to those who are ill with AIDS,\" and urging members to only have sex in an opposite-sex marriage.\n* October – The Ensign featured an article from BYU psychologist Allen Bergin in which he stated that homosexuality was \"caused by some combination of biology and environment\".\n* November – On November 22 a 20-year-old man from a prominent Mormon family in Delta, Utah, and another Utah man raped, tortured, and brutally murdered Gordon Ray Church, a 28-year-old, gay, Mormon, student—near Cedar City, Utah, in an anti-gay hate crime before US hate crime laws existed.\n1989\n* 1989 – The Church Handbook was updated to and signalled a small softening by switching focus from the attractions themselves to actions. It additionally stated that a church court is required for any \"homosexual relations\" committed by a member while holding a \"prominent church position\" such as a bishop\n* 1989 – Evergreen International was founded to help Mormons who want to \"diminish same-sex attractions and overcome homosexual behavior\".\n* February – A national TV story hosted by Peter Jennings featured Malcolm Pace, a former-Mormon gay man who was dying of AIDS, and his deathbed reconciliation with his Mormon parents. The father stated, \"I love my son and my religious beliefs. They don't mix.\"\nSee also\n* Homosexuality and The Church of Jesus Christ of Latter-day Saints\n* Law of adoption (Mormonism)\n* LGBT rights in Utah\n* LGBT Mormon suicides\n* List of Christian denominational positions on homosexuality\n* Mormonism in the 20th century\n* Sexuality and Mormonism\nReferences"
    }
  ]
}