{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Irish War of Independence\n\nThis is a timeline of the Irish War of Independence (or the Anglo-Irish War) of 1919–21. The Irish War of Independence was a guerrilla conflict and most of the fighting was conducted on a small scale by the standards of conventional warfare.\nAlthough there were some large-scale encounters between the Irish Republican Army (IRA) and the state forces of the United Kingdom (Royal Irish Constabulary (RIC)/Auxiliary Division and Dublin Metropolitan Police (DMP) paramilitary units—the Black and Tans, the Ulster Special Constabulary (USC) and the regular British Army), most of the casualties were inflicted in assassinations and reprisals on either side. The war began with an unauthorised ambush by IRA volunteers Dan Breen and Seán Treacy at Soloheadbeg in 1919 and officially ended with a truce agreed in July 1921. However, violence continued, particularly in the disputed territory of Northern Ireland, until mid-1922 (see The Troubles in Northern Ireland (1920–1922)). In the rest of Ireland, the war was followed by the Irish Civil War between supporters and opponents of the Anglo-Irish Treaty.\n1919\nJanuary 1919\n*21 January:\n**Sinn Féin TDs assembled in Dublin, forming the First Dáil and issuing the Irish Declaration of Independence.\n**Soloheadbeg ambush: IRA volunteers of the 3rd Tipperary Brigade, acting on their own initiative, ambushed and killed RIC officers Patrick O'Connell and James McDonnell at Soloheadbeg, County Tipperary. The volunteers, who had planned to seize the gelignite explosives the officers were escorting, said that the officers aimed their rifles when asked to surrender. The two officers were accompanied by two council workers who were unharmed.\n*31 January: following a meeting of the Executive of the Irish Volunteers, the editorial of An t-Óglach (the official publication of the Irish Volunteers) stated that the formation of Dáil Éireann \"justifies Irish Volunteers in treating the armed forces of the enemy – whether soldiers or policemen – exactly as a National Army would treat the members of an invading army\".\nFebruary 1919\n*3 February 1919: Éamon de Valera (president of Sinn Féin) escaped from Lincoln Gaol, along with Seán McGarry and Seán Milroy. The escape was masterminded by Harry Boland and Michael Collins. All were members of Sinn Féin.\n*23 February 1919: at a Brigade meeting in Nodstown Tipperary, officers of the Third Tipperary Brigade drafted a proclamation (signed by Seumus Robinson as O/C) ordering all British military and police forces out of South Tipperary and, if they stayed they would be held to have \"forfeited their lives\". The leadership of the Irish Volunteers in Dublin refused to sanction the proclamation and demanded it not be publicly displayed. Despite this it was still posted in several places in Tipperary.\nMarch 1919\n*19 March 1919: IRA volunteers raided Collinstown Airfield, now Dublin Airport. They captured 75 rifles and 4,000 rounds of ammunition. (Henderson says the raid occurred on 20 March and that 6,000 rounds of ammunition were captured.)\n*29 March 1919: Resident Magistrate John Charles Milling was assassinated in Westport, County Mayo for sending IRA volunteers to prison for unlawful assembly and drilling.\nApril 1919\n*1 April 1919: Second meeting of Dáil Éireann – Éamon de Valera was elected President of Dáil Éireann (or Príomh Aire) and appointed the government of the 1st Dáil. De Valera issued a statement that \"There is in Ireland at this moment only one lawful authority, and that authority is the elected Government of the Irish Republic\".\n*6 April 1919:\n**Limerick City IRA volunteers attempted to free a prisoner from Limerick Prison. RIC officer Martin O'Brien (aged 35) was killed, and another wounded. The prisoner, Robert Byrne, was also wounded and died later that day.\n**An RIC patrol was ambushed at Eyeries, County Cork. Three officers were shot and wounded.\n*10 April 1919: Third meeting of Dáil Éireann – the Dáil passed a motion calling on Irish people to ostracise the RIC. De Valera stated, \"The Minister of National Defense is, of course, in close association with the voluntary military forces which are the foundation of the National Army\". The British authorities declared counties Limerick, Tipperary, Cork, Kerry and Roscommon to be in a state of disturbance.\n*15–27 April 1919: The Limerick Soviet – the British declared Limerick to be a \"Special Military Area\" under the Defence of the Realm Act. Special permits were to be issued by the RIC and would have been required to enter the city. In protest, the Limerick Trades & Labour Council called a general strike and boycott of British troops. A strike committee was set up to print money, control food prices and publish newspapers.\nMay 1919\n*13 May 1919: Rescue at Knocklong, County Limerick – captured IRA volunteer Seán Hogan was rescued from a train by his comrades while being guarded by four armed RIC officers. Two of the RIC officers were killed—Sergeant Peter Wallace (aged 47) and Constable Michael Enright (aged 35)—and several IRA volunteers were wounded.\n*17 May 1919:\n**First of the Dáil Courts was set up at Ballinrobe, County Mayo.\n**Dáil Éireann sent a letter to the head of the Paris Peace Conference, repudiating Britain's claim to speak for Ireland. Soon after, it sent a statement concerning \"Ireland's Case for Independence\" to the Conference.\nJune 1919\n*1 June 1919: De Valera departed for the United States. He sought to gain official recognition of the Irish Republic from the US government, to secure the support of the American people and to raise money for Dáil Éireann and the IRA.\n*6 June 1919: The United States Senate passed a resolution asking for the delegation appointed by Dáil Éireann to be given a hearing at the Paris Peace Conference and expressing sympathy with the \"aspirations of the Irish people for a government of their own choice\".\n*16 June 1919: IRA volunteers ambushed a six-man British Army-RIC patrol at Rathclarin, County Cork and seized their rifles. A soldier and a volunteer were injured.\n*18 June 1919: The Dáil officially established the Dáil Courts. The next day it approved the First Dáil Loan.\n*23 June 1919: IRA volunteers assassinated RIC District Inspector Michael Hunt in Thurles, County Tipperary.\n*24 June 1919: Two RIC officers were attacked and disarmed near Meenascarthy, County Kerry. Ten IRA volunteers were later arrested and five of them sentenced to prison terms.\nJuly 1919\n*4 July 1919: Sinn Féin, the Irish Volunteers, Cumann na mBan and the Gaelic League were declared illegal in County Tipperary.\n*12 July 1919: Ulster Unionist Party leader Edward Carson warned that if any moves were made to separate Ulster from the United Kingdom he would call out the Ulster Volunteers.\n*30 July 1919: RIC Detective Sergeant Smith was shot and fatally wounded outside his home in Drumcondra, Dublin. It was the first assassination authorised by Michael Collins and carried out by The Squad.\nAugust 1919\n*4 August 1919: Two RIC officers were fatally shot by the IRA while on patrol near Ennistymon, County Clare. An IRA volunteer was wounded in the action.\n*20 August 1919: Motion passed by Dáil that an Oath of Allegiance (to the Republic) should be taken by all members and officials of Dáil Éireann and all Irish Volunteers. Volunteers began taking the oath on 25 August. O'Malley (new ed. 1990) says that with this oath the Irish Volunteers became the Irish Republican Army (IRA).\n*23 August 1919: Francis Murphy (15), a member of Fianna Éireann, was shot dead by British soldiers who fired into his home near Ennistymon, County Clare. It was allegedly retaliation for the recent IRA ambush nearby. Although the British Army denied responsibility, an inquest found them responsible.\nSeptember 1919\n*2 September 1919: An RIC Sergeant was killed and another wounded when their bicycle patrol was ambushed by IRA volunteers from the 1st Tipperary Brigade in Lorrha. Authorisation for the attack was given by Treacy and Breen, who were on the run in the area after the Soloheadbeg ambush and Knocklong attack earlier in the year.\n*7 September 1919: Fermoy ambush: The IRA ambushed British soldiers on their way to a church service outside the Methodist church in Fermoy, County Cork, where the service was being held. The IRA aim was to seize weapons. It was the first such action against the British Army. The ambush involved twenty-three Cork IRA volunteers, under the leadership of Liam Lynch, augmented by Mick Mansfield and George Lennon of Waterford. One soldier, Private William Jones, 2nd Battalion King's Shropshire Light Infantry, was killed. Lynch himself was wounded but survived. Fifteen rifles were captured by the IRA. Following the ambush, approximately 200 British soldiers attacked and looted businesses in the town.\n*10 September 1919: The Dáil was outlawed by the British government.\n*12 September 1919: Detective Constable Daniel Hoey of G Division (Dublin Metropolitan Police) was assassinated by the IRA in Dublin.\n*19 September 1919: Official founding of \"the Squad\", an IRA counter-intelligence and assassination squad.\nOctober 1919\n*19 October 1919: Constable Michael Downing of G Division (Dublin Metropolitan Police) was assassinated by the IRA in Dublin.\n*31 October 1919: The IRA attacked Ballivor RIC barracks in County Meath, killing an RIC officer and seizing weaponry.\nNovember 1919\n*4 November 1919: The British government's Irish Committee settled on a policy of creating two Home Rule parliaments—one in Dublin and one in Belfast—with a Council of Ireland to provide a framework for possible unity.\n*11 November 1919: First edition of the Irish Bulletin was produced by Dáil Éireann's Department of Publicity. It was to be produced every few days from this date onward and became very important in getting the Irish side of events known to a wide audience.\n*17 November 1919: Men of the 3rd Cork Brigade raided a British sloop whilst it was docked at a pier in Bantry, County Cork. The IRA men succeeded in capturing a number of arms and ammunition from the ship, greatly increasing the brigade's military capabilities in West Cork.\n*29 November 1919: Detective John Barton of G Division (Dublin Metropolitan Police) was assassinated by the IRA in Dublin.\nDecember 1919\n*12 December 1919: In response to the arrest of three volunteers, the IRA shot and wounded a group of four RIC officers outside Dungloe, County Donegal. It was the first IRA action in the county during the conflict.\n*14 December 1919: An RIC officer was killed by the IRA in Kilbrittain, County Cork.\n*19 December 1919: The IRA attempted to assassinate the Lord Lieutenant of Ireland, British Field Marshal Viscount French, in his car at Phoenix Park, Dublin. French was unhurt, but one IRA volunteer, Martin Savage, was killed. Dan Breen and two Dublin Metropolitan Policemen and a driver were wounded. An RIC Sergeant was knocked unconscious.\n*22 December 1919: The Government of Ireland Act 1920 also known as the Better Government of Ireland Bill was introduced into the House of Commons. It proposed two parliaments; one for the six counties of north-east Ulster and one for the other twenty-six counties of Ireland.\n1920\nJanuary 1920\n*In elections to urban councils, republicans won control of Dublin, Cork and Limerick, among others. Unionists lost control of Derry city to Irish nationalists/republicans for the first time, heightening political tensions in Derry.\n*2 January 1920: IRA volunteers under Mick Leahy of the 1st Cork Brigade captured Carrigtwohill RIC barracks. This is reported as the first \"officially-sanctioned\" attack on an RIC barracks.\n*6 January 1920: Drumlish RIC barracks in County Longford was attacked by IRA volunteers led by Sean Connolly.\n*17 January 1920: the IRA West Waterford Brigade, commanded by George Lennon, attacked Ardmore RIC barracks.\n*19 January 1920: The IRA ambushed an RIC truck and its cycle escort outside Cooraclare, County Clare. The RIC returned fire and an IRA member (Michael Darcy) drowned crossing the Doonbeg River.\n*20 January 1920: RIC Constable Luke Finnegan was fatally shot in Thurles, County Tipperary in an ambush by three IRA volunteers. Afterward, policemen attacked property belonging to local republicans as well as some public property. This is the first reported instance of police reprisals.\n*21 January 1920: County Armagh-born RIC District Inspector William Redmond, Assistant Commissioner of G Division (Dublin Metropolitan Police), was shot dead by \"the Squad\" in Dublin.\nFebruary 1920\n*11 February 1920: Séamus O'Brien, commander of the IRA's Wicklow Brigade, was shot dead during an attack on an RIC patrol in Rathdrum, County Wicklow.\n*12 February 1920: An IRA unit led by Seán Hales attacked Allihies RIC barracks, County Cork, killing RIC officer Michael Neenan. Afterwards, the RIC abandoned several small barracks in the area.\n*14 February 1920: An IRA unit led by Diarmuid Hurley captured Castlemartyr RIC barracks, County Cork.\n*15 February 1920: Thirty IRA volunteers—led by Ernie O'Malley and Eoin O'Duffy—attacked and captured Shantonagh RIC barracks, near Castleblaney, County Monaghan. Following a firefight, the IRA blew a hole in the wall, wounding four RIC officers, and seized their weaponry.\n*18 February 1920: Timothy Quinlisk ex-POW/German Irish Brigade member and informer was killed by the IRA at Ballyphehane, County Cork for trying to betray Michael Collins.\n*20 February 1920:\n**Counties Dublin, Wicklow, Louth, Longford, Westmeath, Sligo and Waterford were proclaimed as being in a state of disturbance.\n**DMP officer John Walsh was shot dead and another officer (Dunleavy) was wounded in the stomach on Grafton Street, Dublin.\n*24 February 1920: IRA Vice Commandant Martin Devitt was killed in action during an ambush of an RIC patrol to take their rifles and ammunition. The ambush took place on the road between Fermoyle and Inagh, County Clare.\n*29 February 1920: A group of British soldiers from the Sherwood Foresters transporting explosives were stopped and disarmed by the IRA outside Cobh, County Cork. One of the soldiers ran and was shot dead.\nMarch 1920\n*2 March 1920: British intelligence operative of Irish descent, John Charles Byrnes (alias \"Jack Jameson\"), was killed by \"the Squad\" in Dublin.\n*3 March 1920: Frank Shawe-Taylor, land agent, was shot dead near Athenry, County Galway.\n*5 March 1920: An RIC officer (John Martin Heanue) was shot dead as he called at a village grocers shop in Bouladuff, County Tipperary.\n*9 March 1920: An RIC officer (Thomas Ryan) was fatally wounded during an IRA bomb attack on Hugginstown RIC barracks, County Kilkenny.\n*10 March 1920: the IRA shot two RIC officers in a hotel in Rathkeale, County Limerick, killing Sergeant George Neazer.\n*11–12 March 1920: An RIC officer (Timothy Scully) was shot dead when his patrol was ambushed returning to barracks in Glanmire, County Cork. In reprisal, RIC officers attacked homes in Cork City.\n*16 March 1920: Two RIC officers were shot dead outside a church in Toomevara, County Tipperary.\n*19 March 1920: An RIC officer (Joseph Murtagh) was shot dead in an IRA ambush in Cork city while returning from a colleague's funeral.\n*20 March 1920: Tomás Mac Curtain, the Lord Mayor of Cork and commander of the IRA's 1st Cork Brigade, was assassinated in front of his wife at his home, by men with blackened faces later reportedly seen entering the local police barracks.\n*22 March 1920: British soldiers singing \"God Save the King\" drew a hostile crowd at Portobello Bridge, Dublin. Troops from the nearby barracks arrived and opened fire, killing two civilians.\n*24 March 1920: British intelligence operative of Irish descent, Frederick McNutley (alias British Army RASC clerk Brian Fergus Malloy) was killed by \"the Squad\" in Dublin after he had tried to lead the IRA into a trap.\n*25 March 1920: The Black and Tans arrived in Ireland.\n*26 March 1920: Resident Magistrate Alan Bell, from Banagher, County Offaly was killed. He was pulled from a tram in south Dublin and shot at point blank range. His death was instantaneous. He was tasked by the British to track down Sinn Féin funds; he had successfully confiscated over £71,000 from Sinn Féin's HQ and, by investigating banks throughout the country, was set to seize much more.\n*29 March 1920: Better Government of Ireland Bill was passed by 348 votes to 94 in Westminster.\n*March 1920:\n**West Limerick IRA volunteers killed a man for spying. This was the first such killing in the conflict.\n**County Kerry; Upon being told of a shoot-to-kill order on members of the IRA and burning of their homes, 4 RIC Constables resigned in protest. Two members of the IRA, Morris Welch and William Connell, were killed and their homes burned. In the town of Clohohim two Irish girls were beaten with gun butts by soldiers until stopped by EX-RIC officer Daniel F. Crowley\nApril 1920\n*3–4 April 1920: The IRA burned over 300 abandoned RIC barracks in rural areas and almost 100 income tax offices. A further 150 barracks were destroyed on the night of 5–6 April. While raiding the Excise Office in Ballyhaunis, County Mayo, the IRA shot and wounded two RIC officers of a three-man patrol which approached an IRA sentry post.\n*5 April 1920: IRA prisoners began a hunger strike in Mountjoy Prison, demanding prisoner of war status.\n*14 April 1920:\n**After large demonstrations and a general strike in support of the prisoners on hunger strike, all 90 were released. In Milltown Malbay a group of RIC and British Army shot into a crowd celebrating the prisoners' release, killing three people and wounding nine others. In Balbriggan, an RIC officer was shot dead following a demonstration in support of the hunger strikers.\n**Detective Constable Harry Kells of Dublin Metropolitan Police (DMP) \"G\" Division was assassinated in Dublin by \"the Squad\".\n*15 & 17 April 1920: Clashes erupted in Derry when republican prisoners were brought to Derry Gaol. British soldiers fired on a Catholic crowd (which included women and children) to disperse them. Later, an assault on patrolling British soldiers in Derry sparked clashes between Irish nationalists and unionists in the city. This culminated in an attack on an RIC barracks, apparently by the IRA, during which the RIC shot six people.\n*18 April 1920: The IRA attacked a group of RIC officers leaving a church in Kilmihil, County Clare. An RIC officer and an IRA volunteer were killed and several wounded.\n*21 April 1920: IRA prisoners began a hunger strike in Wormwood Scrubs Prison, London.\n*24 April 1920: the IRA assassinated a DMP sergeant in Clonakilty, County Cork.\n*25 April 1920: the IRA ambushed and killed two RIC officers (Sgt Cornelius Crean and Constable Patrick McGoldrick) near Ballinspittle, County Cork.\n*27 April 1920:\n**The IRA captured and destroyed the RIC barracks at Ballylanders, County Limerick, seizing arms and ammunition. In reprisal, Black and Tans went on a rampage in Limerick City.\n**A British soldier of the Royal Welch Fusiliers was shot dead by the IRA during clashes between a group of civilians and British soldiers on Wolfe Tone Street, Limerick.\n*29 April 1920: The IRA attacked Rush RIC barracks, County Dublin, fatally wounding an RIC sergeant John Brady.\nMay 1920\n*3 May 1920: An RIC sergeant was killed and two wounded when IRA volunteers attempted to disarm them at Gale Bridge, near Listowel, County Kerry.\n*8 May 1920: The IRA 1st Cork Brigade, led by Mick Leahy, captured Cloyne RIC barracks, County Cork.\n*9 May 1920: Some 200 IRA volunteers under Frank Aiken attacked the RIC barracks in Newtownhamilton, County Armagh. After a two-hour firefight, the IRA breached the barracks wall with explosives and stormed the building. The RIC refused to surrender until the building was set alight with petrol from a potato-spraying machine.\n*10 May 1920: Three RIC officers were killed in an IRA ambush at Ahawadda Cross, near Timoleague, County Cork.\n*11 May 1920: IRA volunteers destroyed the RIC barracks at Hollyford, County Tipperary.\n*12 May 1920:\n**Destruction of vacated RIC barracks at Kill O'the Grange, Dublin, by members of 6th Battalion Dublin Brigade IRA. During this operation two IRA volunteers (Lt Tom Dunne and Q/M Pat Meaney) were badly burned and died on the 14th and 20th, respectively.\n**The surrendered RIC barracks at Rockbrook, Dublin was destroyed.\n*13 May 1920: W.J. McCabe, an employee of Laurence Ambrose Waldron (MP for County Dublin), was shot dead in Killiney.\n*14–15 May 1920: Every member of the Dáil (not already in prison) received a note through the post that said \"An eye for an eye, a tooth for a tooth. Therefore, a life for a life\".\n*15–16 May 1920: Loyalists attacked a Catholic district of Derry, sparking a four-hour gun battle between armed republicans, loyalists and the RIC. A Detective Sergeant from RIC Special Branch was shot dead, the first RIC officer to be killed in Ulster. A Catholic man was also killed. Armed UVF members took over Carlisle Bridge and assaulted Catholics attempting to cross, despite the presence of British troops and police.\n*19 May 1920: The IRA assassinated two RIC sergeants on Upper Mallow Street, Limerick. RIC officers then ran amok in Limerick, firing indiscriminately and destroying several buildings. A civilian was shot dead and others wounded.\n*20 May 1920: Dublin dock workers refused to handle British military supplies and were soon joined by members of the Irish Transport and General Workers Union; especially railway workers, who refused to drive trains carrying British troops. Despite hundreds of sackings, the strike continued until December.\n*28 May 1920: The IRA attacked Kilmallock RIC barracks, County Limerick, held by 18 to 28 RIC men. They fired on it, broke a hole in the roof and threw petrol bombs inside. Two RIC men were killed, two were wounded and ten more surrendered. An IRA volunteer (Capt Liam Scully) was killed.\n*29 May 1920: IRA volunteer Thomas Sheridan was shot dead while attempting to disarm two RIC men in Crossdoney, County Cavan. An RIC officer and another volunteer were wounded. Sheridan was one of only three IRA volunteers to be killed in County Cavan during the war.\nJune 1920\n*1 June 1920:\n**At least 200 IRA volunteers led by Roger McCorley attacked the RIC barracks in Crossgar, County Down. They opened fire on the building, wounding two officers, and attempted to breach the walls with explosives before withdrawing.\n**IRA volunteers destroyed Blarney and Carrigadrohid RIC barracks in County Cork.\n*2 June 1920: The IRA attacked and burned down Fenit RIC barracks and pier in County Kerry\n*3/4 June 1920: IRA volunteers destroyed Drangan RIC barracks in County Tipperary and captured weapons.\n*6 June 1920: The IRA opened fire on RIC officers in Cullyhanna, County Armagh. Three officers were wounded, one fatally. The RIC returned fire, killing a civilian.\n*11 June 1920: An RIC detective was shot dead in the Railway Hotel on Parnell Street, Limerick.\n*12 June 1920:\n**In county council elections, Sinn Féin won control of all but four county councils (Antrim, Armagh, Londonderry and Down). Republicans also won control of 172 out of 206 rural district councils. The republican-controlled councils gave allegiance to the Irish Republic.\n**An RIC officer was shot dead outside Glengarriff barracks, County Cork.\n*15 June 1920: Percival Lea-Wilson (or Lee-Wilson), an RIC District Inspector in Gorey, was shot dead by the IRA outside his home on the orders of Michael Collins. Lea-Wilson had ordered Seán Mac Diarmada's execution as one of the leaders of the Easter Rising.De Rosa, Peter. The Irish Rising of 1916, Ballantine Books; 4th printing edition (18 February 1992); /\n**Constable Pierce Doogue (aged 42) was killed by a stone while on leave aiding colleagues at a disturbance at Belmullet, County Mayo.\n*16 June 1920: The IRA raided the RIC barracks in Cookstown, County Tyrone, with help from four sympathetic RIC officers. In a brief firefight, IRA volunteer Patrick Loughran was killed. He was the first IRA volunteer killed on active service in what became Northern Ireland.\n*18–19 June 1920: Sectarian clashes erupted in Derry. Catholic homes were attacked and burned in the mainly-Protestant Waterside. The Derry Journal wrote that the streets looked \"as if an avenging army had passed through them\". The Catholics fled by boat across the River Foyle but the UVF fired on them from the bridge. Later, loyalists fired into the Catholic Long Tower and Bogside districts, and republicans returned fire. Much of the loyalist shooting came from the city walls and Fountain neighbourhood. Two Catholic civilians were killed on Long Tower Street by a loyalist sniper on 19 June.\n*21–24 June 1920: The UVF occupied the centre of Derry and UVF snipers fired on Catholic districts from rooftops and the city walls. The IRA returned fire and engaged the UVF in the Diamond. There was fierce fighting around St Columb's College. Armed with rifles and machine-guns, the IRA occupied the college and dislodged the loyalist snipers, inflicting an estimated twenty casualties. Shortly after, 1,500 British Army reinforcements arrived in Derry and imposed a curfew. An IRA commander, seven Catholic civilians and three Protestant civilians were killed throughout the city between 21 and 24 June.\n*26 June 1920:\n**About 200 IRA volunteers attacked an RIC barracks at Borrisokane, County Tipperary. The attack was unsuccessful, but the building was so badly damaged that it was evacuated the next day.\n**British General Cuthbert Lucas was captured near Fermoy, County Cork, and held as prisoner of war by the IRA East Clare Brigade. He was commander of the British 17th Infantry Brigade and was the highest ranking British officer captured by the IRA during the conflict. He was held until 30 July, during which time he came to admire the discipline and efficiency of the volunteers he met. The IRA arranged for Lucas to exchange letters with his wife in England. Lucas kept his word to the volunteers not to reveal their names or where he had been held prisoner.\n*June 1920: British courts of assize failed across the south and west and trials by jury could not be held because potential jurors refused to participate. The Chief Secretary for Ireland at the time, Hamar Greenwood, told the British government that \"the administrative machinery of the courts has been brought to a standstill\". The collapse of the court system demoralised the RIC: many officers left the force.\nJuly 1920\n*2 July 1920: The IRA ambushed a four-man RIC patrol near the village of Dualla, County Tipperary. An RIC sergeant was killed and a constable was wounded. A man was arrested on 9 August to await trial by court martial for the incident.\n*4 July 1920: An IRA volunteer was killed during an ambush of an RIC truck at Shevry, County Tipperary.\n*11 July 1920: A Black and Tan was killed by a bomb during an IRA attack on Rathmore RIC barracks, County Kerry.\n*13 July 1920: Two RIC officers were killed when their mobile patrol was ambushed by the IRA in Dingle, County Kerry.\n*17 July 1920:\n**British Colonel Gerald Smyth was assassinated by the IRA in a Cork City country club. Smyth had told RIC officers to shoot civilians who disobeyed orders. Railway workers refused to carry Smyth's body back to his native Banbridge, County Down. The assassination provoked retaliation by loyalists against Catholics in Banbridge and Belfast.\n**Two British soldiers of the Border Regiment were severely wounded in an ambush at Swinford, County Mayo.\n*19/20 July 1920: IRA volunteers ambushed an RIC patrol on the Tuam–Dunmore road, County Galway. Two officers were killed while the other two surrendered and were released unharmed. After searching unsuccessfully for the ambushers, RIC reinforcements rioted in Tuam, firing and throwing grenades in the streets, burning down the town hall, a Sinn Féin hall and a warehouse, and threatening to kill republican suspects. Townspeople who tried to douse the flames were shot at. The riot inspired copycat reprisals across Ireland in the summer and autumn of 1920.\n*21 July 1920:\n**Thirty IRA volunteers ambushed a British Army truck at Coolavokig, County Cork. Four soldiers were wounded, two fatally.\n**British troops killed two IRA volunteers who had allegedly ambushed their truck outside Mitchelstown, County Cork.\n**An RIC officer was killed and another wounded by IRA volunteers attempting to disarm them in Ballina, County Mayo.\n**A civilian was fatally wounded when British forces blew up the house of an IRA volunteer on Davis Street, Limerick, in reprisal for the assassination of Colonel Smyth.\n*21–23 July 1920:\n**In Belfast, Loyalists forced more than 7,000 Catholics and Irish nationalists from their jobs at Harland and Wolff shipyards (see The Troubles in Northern Ireland (1920–1922)). This sparked a wave of sectarian clashes in the city. At the Falls-Shankill interface, seven Catholics and two Protestants were killed, mostly by British soldiers firing machine-guns to disperse rioters. One was a Catholic priest, killed in Clonard Monastery by British Army gunfire. Another Catholic civilian was shot dead by soldiers during clashes in the Markets. Loyalists attempted to burn down a Catholic convent on Newtownards Road. British soldiers guarding the building opened fire, wounding 15 Protestants, three of them fatally.\n**After Smyth's funeral (see 17 July 1920), about 3,000 Loyalists took to the streets in Banbridge. Many Catholic homes and businesses were attacked, burned and looted, despite police being present. A member of the Orange Order was shot dead, it was determined that the bullet had been fired by the police. A Protestant was killed when a republican fired on loyalists who were besieging his home.\n**On 23 July 1920, in Dromore, County Down sectarian motivated riots occurred. An estimated crowd of 500 attacked Catholic homes, businesses and the Catholic parochial house. A Protestant was killed when police fired to disperse loyalists who were attacking Catholic homes. At the end of these two days of violence, virtually the entire Catholic populations of Banbridge and Dromore were forced to flee their homes.\n*23 July 1920: A critical meeting of the British government was held in London. The cabinet was divided on how to proceed. Some Liberal ministers and Dublin Castle officials were in favour of offering dominion status to Ireland. Unionist ministers argued that the Government must crush the insurgency and proceed with the Government of Ireland Bill. Debate continued after the meeting: Walter Long warned of \"the gravest consequences in Ulster\" if the Government changed course; by 2 August, the hawks prevailed.\n*25 July 1920: The chief RIC intelligence officer for west Cork, D/Sgt William Mulherin, was assassinated by the IRA outside a church in Bandon, County Cork.\n*26 July 1920: IRA volunteers attacked an RIC cycle patrol at Ballyrush, County Sligo.\n*26 July 1920: Thomas Hales, commander of the Third Cork Brigade of the IRA, along with Pat Harte, quartermaster of the West Cork Brigade, were arrested by soldiers from the Essex Regiment. The pair were taken to a nearby military barracks, where they were severely beaten while being interrogated by officers of the regiment.However, neither Hales nor Harte gave up any information and were eventually sent to a military hospital to recuperate. Hales was tried and was eventually sentenced to two years' penal servitude, which he served in Pentonville and Dartmoor prisons in England. He was commander of the Irish prisoners at Pentonville, but was released following a general amnesty after the Anglo-Irish Treaty in December 1921. According to Tom Barry, Harte suffered brain damage and went insane before dying in Broadmoor Hospital in 1925.\n*27 July 1920: An RIC constable (Constable James Murray) was shot dead by IRA volunteers on the Main St. in Clonakilty, County Cork.\n*28 July 1920: Two British soldiers were killed and two wounded in an IRA ambush at Oola, County Limerick.\n*29 July 1920: A party of about twenty British Military Police on guard outside the old House of Parliament on College Green, Dublin were surprised and disarmed by IRA volunteers.\n*30 July 1920:\n**In County Limerick, two British soldiers were killed in an ambush of a lorry at Oola, and another British soldier is killed in an ambush of a cycle patrol at Tankardstown.\n**Members of the IRA assassination unit (known as The \"Squad\") led by Paddy Daly, shot and killed Frank Brooke, director of Great Southern and Eastern Railway in his office in Dublin. Brooke was a member of the British military's Advisory Council. The killing was characterised by historian Peter Hart as \"the only outright political assassination of the War of Independence\".\n**British Brigadier-General Cuthbert Lucas escaped from the IRA and after being picked up by the British Army immediately drove into an ambush in which two soldiers were killed and two wounded. Later he praised the IRA and refused to reveal to the British the names of Volunteers he met or where he was held (see Timeline entry for 26 June 1920).\nAugust 1920\n*2 August 1920: Holywell Ambush: There was a battle between British soldiers and the IRA at Holywell on the Ballyhaunis–Claremorris Road, County Mayo. Five British soldiers and an IRA commander were wounded.\n*7 August 1920: Kildorrery Ambush: The IRA's East Limerick Flying Column under Donnacha O'Hannigan and George Lennon, joined forces with a Cork column under Tom Barry. Numbering twenty-five men, they ambushed an eight-man RIC foot patrol near Kildorrery, County Cork. All the Black and Tans/RIC men were wounded, one fatally. Six revolvers and 250 rounds of ammunition were seized.\n*9 August 1920: The Restoration of Order in Ireland Act received royal assent. The Act gave the British administration the power to govern by regulation; to replace criminal courts with courts martial; to replace coroners' inquests with military courts of inquiry; and to punish disaffected local governments by withholding their grants of money.\n*12 August 1920: Terence McSwiney, Lord Mayor of Cork, was arrested. McSwiney began a hunger strike (died 25 October 1920) in protest and was joined by ten other prisoners. IRA officers Liam Lynch (commandant Cork No. 2 brigade) and ten others were also arrested at City Hall, Cork, but mistakenly released by the British.\n*14 August 1920:\n**The IRA fired on a group of British soldiers guarding an RAF plane which had been forced to land at Drominagh, County Cork. One British soldier was killed and others wounded.\n**British soldiers shot dead a civilian after searching his home in Hospital, County Limerick. It is suggested he was mistaken for an IRA volunteer.\n**John Coughlan is kidnapped by the IRA on a charge of allowing his daughters to be prostitutes for the British; he commits suicide in IRA custody\n*15 August 1920: An RIC officer was killed in an ambush on Edward Street, Limerick. Disturbances followed, during which an ex-serviceman was severely beaten by police. He died the next day.\n*16 August 1920:\n**Two IRA volunteers were shot dead during a police and military raid on a house near Kanturk, County Cork.\n**The IRA assassinated an RIC District Inspector in Templemore, County Tipperary. Police and military burned several businesses and the town hall in reprisal. Two officers of the Northamptonshire Regiment were mistakenly killed in the fires.\n*17–18 August 1920: The IRA ambushed two RIC patrols in Ardara, County Donegal, wounding six officers.\n*18 August 1920: IRA volunteers led by Seán Mac Eoin raided the British Army barracks in Longford and Ballymahon for weaponry.\n*21 August 1920:\n**The IRA ambushed an RIC patrol in Kill, County Kildare. One officer was killed and another fatally wounded. It was the first such attack in the county.\n**Another RIC officer was killed when a patrol was ambushed near Merlin Park in Galway City.\n**A third RIC patrol was ambushed in Dundalk, County Louth, killing one officer and wounding four. In revenge, loyalists attacked and looted businesses belonging to prominent Irish nationalists.\n*22 August 1920:\n**RIC District Inspector Oswald Swanzy was assassinated by Cork IRA volunteers while leaving a church in Lisburn, County Antrim. Swanzy had been among those blamed by an inquest jury in the killing of Cork Mayor Tomás Mac Curtain. In revenge, the UVF burned hundreds of Catholic homes and businesses in Lisburn, causing many Catholics to flee the town. Several Special Constables later had their charges in relation to the arson dropped. Violence soon spread to Belfast.\n**An RIC sergeant was shot dead while off duty after leaving a club in Athlone.\n**The IRA ambushed an RIC truck at Kilmurry, County Cork. Several officers were wounded and an IRA volunteer was killed in the exchange of fire.\n**IRA forces from East Mayo, led by Seán Corcoran and Seán Walsh, captured Ballavarry RIC barracks in County Mayo and seized weaponry.\n*24 August 1920: An RIC officer was shot dead and another wounded at pub in Glengarriff, County Cork.\n*25 August 1920: An RIC officer was killed in ambush in Bantry, County Cork.\n*26 August 1920:\n**The IRA raided Drumquin RIC barracks, County Tyrone. One RIC officer was shot dead, others wounded and the weaponry in the barracks was seized.\n**An RIC officer was killed in ambush at Knockcroghery, County Roscommon.\n**The IRA forced two RIC officers out of Shanagolden, County Limerick. In response, a large RIC group arrived in the village, burned several buildings and shot dead a local civilian.\n*27 August 1920:\n**A British soldier was killed and two others wounded in attack on a British Army vehicle at Churchtown, near Midleton, County Cork. British troops arrested two Sinn Féin members in Midleton. One was shot dead and the other wounded, allegedly when they tried to escape.\n**An RIC officer was killed in an ambush on an RIC vehicle in Drumlish, County Longford.\n*29 August 1920: Sectarian clashes erupted in Belfast in response to the burning of Catholic homes in Lisburn. British troops fired a Hotchkiss machine gun to disperse the rioters. Six Catholics and a Protestant were killed in the violence.\n*31 August 1920: Volunteers of the IRA's Monaghan Brigade carried out raids for weapons at the homes of several unionist families with UVF links. Although some weaponry was seized, four IRA volunteers were fatally shot by the unionists.\n*On various dates in August, IRA volunteers swore allegiance to Dáil Éireann. They had previously sworn to obey their Executive Councils.\n*In late August and during most of September, there was a truce between the IRA and British forces in Templemore, as Marian apparitions had supposedly occurred in town, resulting in thousands of pilgrims coming to the area daily (see Templemore apparitions).\nSeptember 1920\n*1 September 1920: The IRA ambushed an RIC cycle patrol at Ratra Crossroads, County Roscommon. Two RIC officers and IRA volunteer Thomas McDonagh were killed before the IRA withdrew. The RIC then dragged McDonagh's body through the streets of Ballaghaderreen and destroyed several buildings in the town.\n*5 September 1920: British soldiers, hidden in a lorry which appeared to have broken down, shot dead an IRA volunteer and a civilian who approached it in Ballymakeera, County Cork.\n*8 September 1920: Two RIC officers were killed in an ambush outside Tullow barracks, County Carlow.\n*9 September 1920: IRA volunteer Seán Mulvoy was shot dead while disarming lone Black and Tan Edward Krumm at Galway railway station. Krumm was also killed during the struggle. The RIC retaliated by killing local IRA volunteer Seamus Quirke and wrecking the offices of the Galway Express, a republican newspaper.\n*10 September 1920: IRA volunteer Patrick Gill was shot dead by Black and Tans in Drumsna, County Leitrim as was volunteer S. Mulvoy from Galway.\n*14 September 1920:\n**Civilian James Connolly was shot dead by Black and Tans at his home in Kinlough, County Leitrim. They came to arrest his son; being deaf, he did not hear an order to put up his hands.\n**Three IRA volunteers (Pat Glynn, Michael Keane and Michael Glavey) were killed in an ambush by British troops at Ballinlough, County Roscommon.\n*20 September 1920:\n**The IRA ambushed a lorry of British soldiers on Church Street, Dublin. Three soldiers were killed and others wounded the first in the city since the Easter Rising of 1916. IRA volunteer Kevin Barry, aged 18, was arrested at the scene and charged with murder.\n**RIC Head Constable Peter Burke and Sergeant Michael Burke were shot by IRA volunteers at a pub in Balbriggan, County Dublin. In retaliation, Black and Tans burned and looted many homes and businesses in Balbriggan and killed two suspected IRA volunteers (Séamus Lawless and Seán Gibbons). The incident, known as \"the Sack of Balbriggan\", gained widespread publicity in the local and international press.\n**The IRA ambushed an RIC patrol outside Abbeyfeale, County Limerick. Two RIC officers were killed and the rest took cover in a nearby presbytery. The following night, a Black and Tan killed two civilians in the town.\n*21 September 1920: An RIC officer was shot dead while part of a police/army patrol searching houses in Ferbane, County Offaly.\n*22 September 1920: Rineen ambush – Six RIC officers were killed when the IRA ambushed their truck near Rineen, County Clare. The IRA volunteers were then attacked by ten truck-loads of British soldiers sent as reinforcements. However, they held off this attack long enough to withdraw, with only two wounded. At nearby Caherfenick, a resident magistrate Alan Lendrum was shot dead by the IRA in an attempt to commandeer his car. In reprisal for the ambush, the RIC and British Army raided three nearby villages, burning many buildings and killing five civilians.\n*23 September 1920: Sinn Féin County Councillor John Aloysius Lynch of Kilmallock, County Limerick was assassinated at the Exchange Hotel in Dublin by a British agent (Captain John Fitzgerald, a native of Cappawhite, County Tipperary, who was later assassinated himself on Bloody Sunday).\n*26 September 1920: Black and Tans burned the village of Kilkee, County Clare.\n*27 September 1920: Black and Tans burned the town centre of Trim, County Meath.\n*28 September 1920: IRA volunteers, led by Liam Lynch and Ernie O'Malley, raided Mallow British Army barracks in County Cork. They seized weaponry, freed prisoners and killed British sergeant W.G. Gibbs of the 17th Lancers/\"Duke of Cambridge's Own\". It was the only British Army barracks to be captured during the war. British troops burned many buildings in the town in reprisal.\n*29 September 1920:\n**Two RIC officers were killed in an ambush of patrol outside Borrisoleigh, County Tipperary.\n**Two RIC officers were shot dead in a pub in O'Brien's Bridge, County Clare.\n**Four Catholic civilians were killed by British soldiers firing from a military truck during disturbances on Falls Road, Belfast.\n*30 September 1920: An IRA ambush of an RIC lorry near Tobercurry, County Sligo, killed District Inspector James Brady and wounded several others. In reprisal, a group of RIC and Black and Tans burned homes and businesses in the town. The IRA engaged them but were forced to withdraw.\n*In late August and during most of September, there was a truce between the IRA and Crown forces in Templemore, as Marian apparitions had supposedly occurred in town, resulting in thousands of pilgrims coming to the area daily (see Templemore apparitions).\nOctober 1920\n*2 October 1920: RIC officers shot dead a Sinn Féin member while searching his house at Lackagh, County Galway.\n*7 October 1920: Two RIC officers were killed in an ambush at Feakle post office, County Clare. The RIC burned several buildings that had been used by the ambushers.\n*8 October 1920: A British soldier was killed and others wounded when their truck was attacked with grenades and gunfire on Barrack Street, Cork.\n*9 October 1920: A Royal Air Force lieutenant was killed and a British Army lieutenant fatally wounded in an ambush on military trucks at Newcestown, County Cork.\n*11 October 1920: One civilian was killed and IRA volunteer Dan Breen badly wounded in a shoot-out at an IRA safe house in Drumcondra, Dublin. Two British officers died of their wounds the next day, Major E. Smyth and Captain A.P. White. Major Smyth was a brother of Colonel Gerard Smyth, who had been killed by the IRA in July.\n*12 October 1920:\n**Four RIC officers were killed in an ambush at Ballinderry, County Roscommon.\n**In County Wexford, five IRA volunteers were killed and nine injured (five severely), when explosives being prepared for an attack on Foulksmills RIC barracks accidentally detonated in an old unoccupied house at St Kearns, Saltmills.\n*14 October 1920:\n**British soldiers raided an IRA safe house on Talbot Street, Dublin. IRA volunteer Seán Treacy was killed by British undercover agents, but managed to kill one of the agents, a Lieutenant Price, before being shot. Two civilian bystanders were also killed by British machine-gun fire.\n**An IRA volunteer was killed in an attack on British armoured car in Phibsborough, Dublin.\n*15 October 1920: Auxiliaries rounded up every man in the village of Ballyvourney, County Cork. They fired indiscriminately and killed a civilian.\n*16 October 1920: Peter O'Carroll, a prominent republican with two IRA volunteer sons, was shot dead by British forces at his home in Manor Street, Dublin. David Neligan identified the organiser as Major Jocelyn Lee Hardy (DSO).\n*17 October 1920: An RIC sergeant was assassinated by members of the Squad on Little Strand Street, Dublin.\n*18 October 1920: Two IRA volunteers (brothers Ned and Frank O'Dwyer) were killed by British forces in Bansha, County Tipperary.\n*19 October 1920: In Galway, Sinn Féin councillor and local businessman Michael Walsh was murdered. He was confronted at his pub, the Old Malt, by an armed group of \"English secret service men\". He was subsequently taken to the docks, where he was shot and his body dumped in the river.\n*22 October 1920:\n**Tooreen Ambush – the IRA's 3rd Cork Brigade attacked a lorry carrying British troops from the Essex Regiment on the road between Bandon and Cork. Two soldiers were killed outright. Five were wounded, including one who died the next day. Those alive were disarmed (fourteen rifles, bayonets, equipment, several Mills bombs, around 1,400 rounds of ammunition and a couple of revolvers were taken from them) and then released.\n**A Black and Tan was killed in an ambush of RIC trucks near Moate, Westmeath. When the trucks arrived in Athlone, there was another exchange of fire and a civilian was killed by RIC gunfire.\n*25 October 1920:\n**Terence MacSwiney died on hunger strike in Brixton Prison, London. Two other Cork IRA volunteers, Michael Fitzgerald and Joe Murphy, died during the hunger strike. Both men, along with eight others, had been arrested along with MacSwiney. They were known as the Cork Ten because all ten went on the hunger strike together. After this, Arthur Griffith called off the hunger strike and the other eight recovered. See 1920 Cork hunger strike.\n**Four RIC officers were killed and two wounded of a nine man patrol in an ambush at Moneygold, County Sligo. Three IRA volunteers and their female driver were later arrested and imprisoned.\n**IRA volunteers raided the home of an RIC officer in Kill, County Waterford. The officer threw a grenade, fatally wounding an IRA volunteer.\n**IRA volunteers raided the RIC barracks in Tempo, County Fermanagh, fatally wounding an RIC sergeant. The IRA were driven off by armed UVF members. A Catholic civilian, believed to have republican sympathies, was then shot in the doorway of his family's pub in the village and later died of his wounds.\n*28 October 1920:\n**Private G. Robertson of the Royal Scots Regiment was killed by the IRA near Connolly, County Clare.\n**The IRA's 3rd Tipperary Brigade ambushed a British Army lorry at Thomastown, near Golden, County Tipperary. Three soldiers were killed (two from the Northamptonshire Regiment and one from the Royal Engineers) and six were wounded.\n*31 October 1920:\n**RIC Detective Philip Kelleher was shot dead by IRA volunteers at The Greville Arms, Granard, County Longford.\n**Ten people were killed in County Kerry. Two RIC constables were shot dead in Abbeydorney by IRA volunteers. Two other constables were killed and two more wounded in nearby Ballyduff. Black and Tans burned the creamery in Ballyduff in reprisal and shot and bayoneted a local man, James Houlahan. That night, two Black and Tans were shot dead by IRA volunteers in Killorglin and two more were wounded in Dingle. Black and Tans burned the Sinn Féin hall, the Temperance Hall, a garage and the home of a Sinn Féin activist in Killorglin. A local civilian was shot and seriously wounded; he later died of his injuries. One RIC Constable Waters and one RIC/Black and Tan Auxiliary Constable Ernest Bright were kidnapped by IRA volunteers in Tralee. It is thought that they were shot and killed. This provoked a week of police violence in Tralee (called in several international newspapers \"the Siege of Tralee\") as RIC personnel tried to recover the bodies. Reportedly, the remains of one of the two missing men was found later.\nNovember 1920\n*1 November 1920:\n**Siege of Tralee – In reprisal for IRA attacks in the area, Black and Tans attacked Tralee, County Kerry. They destroyed the town hall and several shops and fired indiscriminately in the streets. Civilian John Conway was shot dead as he left his home on Rock Street. Tommy Wall, an ex-serviceman, was beaten and shot in the Mall, dying of his wounds on 3 November.\n**IRA volunteer Kevin Barry was hanged in Dublin for his part in an ambush in which three British soldiers were killed on 20 September 1920.\n**An RIC detective was shot dead at Breaghy Crossroads near Ballinalee, County Longford. Another RIC sergeant was shot dead near the barracks in Tullamore, County Offaly.\n**Black and Tans fatally shot civilian Eileen Quinn at Kiltartan, near Gort, County Galway. Quinn was pregnant and sitting outside her house holding a young child, when Black and Tans shot her from a passing lorry. They were apparently drunk and had been firing randomly as they drove through the district. At the military court of inquiry, police claimed no shots were fired, though the court returned a verdict of \"death by misadventure\" and the opinion that Quinn was shot by a member of the police.\n**IRA fighters from West Waterford, led by George Lennon, ambushed a RIC/British army patrol from the 2nd Hampshires under Lieutenant Griffin at Pilltown, near Kinsalebeg in County Waterford. One soldier was killed, 2 wounded and seventeen captured (who were later released). Some 18 rifles, carbines and revolvers plus grenades and ammunition were captured. See Piltown Cross ambush.\n*2 November 1920:\n**Battle of Ballinalee – Seán Mac Eoin's North Longford IRA column defended the village of Ballinalee from an assault by the Black and Tans, launched in response to the shooting of a RIC constable (Peter Cooney) there the previous day (1 November). Cooney was suspected of being a spy and his execution was allegedly ordered by Michael Collins. At the time of his killing, Cooney allegedly was carrying coded dispatches with the names of Longford IRA men. British forces, consisting of eleven lorries of troops, retreated after a two and a half-hour gunfight. The IRA column remained in the village for a week.\n**The IRA ambushed two RIC trucks near Athlone, Westmeath. A Black and Tan and an IRA member were killed.\n**An RIC officer was shot dead at a hotel bar in Cloghjordan, County Tipperary.\n*3 November 1920:\n**An RIC sergeant was shot dead at the fair in Ballymote, County Sligo. Lorries of British soldiers later arrived and burnt down a creamery, a bakery and several houses.\n**The RIC shot dead an IRA volunteer in a raid on his home at Rathconnor, County Roscommon.\n*4 November 1920: A British Intelligence Officer was ambushed and killed outside Nenagh, Country Tipperary. Two IRA volunteers were arrested nearby and bayoneted to death.\n*5 November 1920: An IRA unit waiting in ambush positions in Causeway, County Kerry, were surrounded by the RIC. The IRA fought their way out of the village, but an IRA scout was killed. Later, there was an exchange of fire between the IRA and British forces in nearby Ardfert. A young civilian girl was shot dead by Black and Tans, while an IRA volunteer was captured and shot dead.\n*6 November 1920: Two Auxiliaries were captured at Emmet Place in Cork and shot dead.\n*8 November 1920: An IRA column ambushed a British Army lorry at Grange, County Limerick. Three British soldiers were wounded. The IRA column under Tomás Malone retreated when seven more British troop lorries arrived. Two IRA were wounded and two alleged IRA were taken prisoner.\n*9 November 1920: IRA volunteers commanded by Tom McEllistrim halted a train at Ballybrack station, County Kerry. Two Black and Tans were taken off the train and shot dead.\n*10 November 1920:\n**An IRA volunteer was killed in an exchange of fire with Auxiliaries searching houses in Tooreenduff, County Cork.\n**A Protestant IRA member was shot dead after being stopped and searched by the RIC at Farmers Bridge, near Tralee, County Kerry.\n*12 November 1920: Two IRA volunteers were killed when an RIC convoy fired on an IRA unit at Ballydwyer, near Tralee, County Kerry.\n*13 November 1920:\n**Four RIC officers were killed when their truck was ambushed at Lisvernane, County Tipperary.\n**British troops fired on a group of civilians who fled from them on Charlemont Street, Dublin. An 8-year-old girl was killed and another wounded.\n*14 November 1920: A pro-republican Catholic priest, Father Michael Griffin, disappeared after leaving his residence at St Joseph's Church in Galway. It emerged afterwards that he had been abducted and killed by loyalist forces (most likely Auxiliaries) at Barna. Griffin had given the last rites to Seamus Quirke and taken part in the funeral mass for Michael Walsh.\n*15 November 1920: Three British Army officers were captured and killed by the IRA at Waterfall, County Cork.\n*16 November 1920:\n**Three IRA volunteers and a civilian were arrested by Auxiliaries near Killaloe, County Clare. They were beaten, interrogated and then shot dead.\n**The IRA captured and killed two Auxiliaries and secretly buried them in the Macroom area, County Cork.\n*17–18 November 1920: The IRA assassinated an RIC sergeant on White Street, Cork. Hours later, disguised RIC officers shot three people dead at their homes. One was a member of Fianna Éireann and another the brother of an IRA volunteer.\n*18 November 1920: An RAF plane crashed near Cratloe, County Clare, and a platoon of British soldiers was sent to guard it. The IRA opened fire on the soldiers, killing one and fatally wounding another.\n*19 November 1920: Four IRA officers were captured by Auxiliaries in Durris, County Cork. Only the intervention of a colonel Hudson of the King's Liverpool Regiment prevented the men from being summarily killed.\n*21 November 1920: Bloody Sunday:\n**Morning: The IRA carried out an assassination operation targeting British intelligence agents in Dublin (most of whom were part of the \"Cairo Gang\"). Eight addresses were raided and fifteen men were killed or fatally wounded. Most were believed to have been British agents, although some were ordinary British Army officers and civilians. Two were Auxiliaries responding to the attacks.\n**Afternoon: British RIC, Auxiliaries and soldiers raided Croke Park during a Gaelic football match between Dublin and Tipperary in response to the IRA shootings that morning. For some unknown reason, police opened fire on the crowd. Fourteen spectators and players were killed. That evening, Dublin Castle claimed that the raiding party came under fire; this claim was contradicted by the press and, later, by the findings of military courts of inquiry, which were suppressed by the British government. The shootings were generally considered to be a reprisal.\n**Evening: Two IRA operatives (Dick McKee and Peadar Clancy) who had helped compile the intelligence used in the assassinations, along with Conor Clune (who had been arrested with them), were \"shot while trying to escape\" in Dublin Castle.\n**Attacks on RIC barracks at Bray, Cabinteely, Enniskerry and Dundrum were carried out by the 6th Battalion, under specific order of the Dublin Brigade IRA in an effort to draw reinforcements from the city and relieve pressure on the Dublin city battalions. The attacks continued until the early hours of Monday 22nd. A British armoured car was attacked at Temple Hill, Blackrock, Dublin.\n*22 November 1920:\n**IRA lieutenant Jack McCann was taken from his home by unidentified British forces and shot dead in Rush, County Dublin.\n**Another IRA lieutenant was killed when the RIC surprised an IRA unit in Ballylongford, County Kerry.\n**RIC Head Constable John Kearney was assassinated outside a church in Newry.\n*23 November 1920:\n**Three IRA volunteers were killed and others wounded in a grenade attack on Patrick's Street, Cork, after leaving a meeting. It had been thrown by a Black in Tan in civilian clothes.\n**An RIC officer in Strokestown, County Roscommon was captured by the IRA and believed to have been killed.\n*25 November 1920: Sinn Féin leaders Arthur Griffith and Eoin Mac Neill were arrested by British troops in Dublin.\n*26 November 1920:\n**Two British soldiers were killed when a military lorry was ambushed by IRA volunteers under Tom Barry outside Glanworth, County Cork.\n**IRA volunteer brothers Patrick and Harry Loughnane were captured, interrogated and killed by Auxiliaries at Drumharsna Castle, County Galway. They were beaten, tortured, set on fire and then their bodies were dumped in a pond where they were found more than a week later.\n*27 November 1920: An IRA volunteer and RIC officer were killed in an exchange of fire in Castlemartyr, County Cork.\n*28 November 1920: Kilmichael ambush. The West Cork Brigade of the IRA, under Tom Barry, ambushed a patrol of 18 Auxiliaries at Kilmichael, killing 17. Three IRA volunteers were killed in the action.\n*29 November 1920: An RIC officer was shot dead outside a hotel in Cappoquin, County Waterford.\n*30 November 1920: Two IRA volunteers were taken from their homes and killed by unidentified British forces in Ardee, County Louth.\n*November 1920: Attack on a military lorry on the Bray Road at Crinken, Shankill, Dublin, by IRA volunteers from the Shankill/Bray Coy 6th Battalion Dublin Brigade. One soldier was killed and three others wounded.\nDecember 1920\n*2 December 1920: Three IRA volunteers were shot dead by British soldiers in Bandon, County Cork. They had been on their way to meet a British soldier supposedly willing to give information.\n*3 December 1920: An RIC officer was killed when his patrol came under fire in Youghal, County Cork.\n*6 December 1920: British forces raided a Republican Court at Craggaknock, County Clare. They fired on people fleeing the building, killing a civilian.\n*8 December 1920: An IRA volunteer was killed in an ambush of an RIC truck at Gaggin, County Cork.\n*10 December 1920:\n**The British authorities proclaimed martial law in counties Cork, Kerry, Limerick and Tipperary. On December 30 martial law is extended to Counties Kilkenny, Clare, Wexford and Waterford.\n**The IRA ambushed a British Army truck at Castlelyons, County Cork. A British soldier was killed while eight were captured, disarmed and released.\n**An IRA volunteer was fatally wounded in an exchange of fire with British forces near Knocklong, County Limerick.\n**IRA volunteer William Owens was shot dead by a Major Shore of the British military during a raid on the Sinn Féin hall in Shankill, Dublin. Several unsuccessful attempts were later made by the Shankill IRA to kill Shore.\n**British troops captured an IRA bomb making factory in Dublin. Ernie O'Malley was captured by British troops in Kilkenny, in possession of a pistol and incriminating documents.\n*11 December 1920: The Burning of Cork. A lorry of Auxiliaries was ambushed by the IRA near Dillons Cross: several Auxiliaries were wounded, one fatally. Shortly after, British forces killed two IRA volunteers (the Delaney brothers) at their home nearby, set fire to the commercial centre of Cork city and burned down City Hall and the Carnegie Library. The next day, the Roman Catholic Bishop of Cork, Daniel Colahan, issued a decree saying that \"anyone within the diocese of Cork who organises or takes part in ambushes or murder or attempted murder shall be excommunicated\". The edict went unheeded.\n*12 December 1920: About 200 IRA volunteers, led by Frank Aiken, attacked Camlough RIC barracks, County Armagh. They exchanged fire with the RIC, threw grenades and set fire to the building. British troops sent from Newry were ambushed by the IRA who opened fire and threw grenades from a bridge overhead. Three volunteers were fatally wounded at the bridge. The next day, British forces set fire to several homes and businesses in Camlough in reprisal.\n*13 December 1920:\n**Two IRA officers, Michael McNamara and William Shanahan, were abducted and shot by British forces in Clare. Their bodies were found near Kilkee on 19 December.\n**The IRA attacked Ballinalee RIC barracks, County Longford. A Black and Tan was killed when the IRA blew a hole in the barracks wall. In reprisal, British forces set half of the village on fire.\n*14 December 1920:\n**An IRA volunteer was shot dead by non-uniformed police at a house near Thurles, County Tipperary.\n**Passenger services were suspended on the Cavan and Leitrim Railway, until 1921, due to the refusal of drivers and enginemen to carry the Black and Tans on trains at Mohill and Ballinamore, leading to the arrest and internment of railway employees.\n*15 December 1920:\n**An Auxiliary officer, Vernon Anwyl Hart, shot dead a Catholic priest (Thomas Magner) and a young man (Tadgh O'Crowley) on the roadside near Dunmanway, County Cork.Coogan, Tim Pat. Michael Collins: A Biography, Head of Zeus Ltd, 16 December 2015; ,  Hart was in charge of two trucks of Auxiliaries on their way to Cork for the funeral of an Auxiliary killed by the IRA. He was discharged and declared insane by the British authorities.\n**An IRA volunteer was shot dead by masked men, believed to be non-uniformed Auxiliaries, at a house near Frenchpark, County Roscommon.\n*16 December 1920: The IRA ambushed an RIC truck at Kilcommon, County Tipperary. Four RIC officers were killed and three wounded.\n*17 December 1920:\n**The IRA ambushed two trucks of British soldiers (Lincolnshire Regiment) at Glenacurrane, County Limerick. Two soldiers were killed and four wounded, while the others surrendered and had their weapons seized.\n**The Roman Catholic Bishop of Kilmore, Patrick Finnegan, stated that \"Any war... To be just and lawful must be backed by a well-grounded hope of success... What hope of success have you against the mighty forces of the British Empire? None, none whatever... and if it unlawful as it is, every life taken in pursuance of it is murder\".\n*18 December 1920: The British Army and RIC carried out a sweep of Inishmore, off the coast of County Galway. Thirteen islanders were detained and one was fatally shot for failing to halt.\n*20 December 1920: The West Kilkenny IRA ambushed a joint RIC/military patrol at Nine Mile House, County Kilkenny; eight soldiers and one constable killed.\n*22 December 1920:\n**Two IRA volunteers were arrested by Auxiliaires at a safe house near Doonbeg, County Clare. One was shot dead on the road to Ennis and the other killed in Ennis allegedly while trying to escape.\n**An RIC officer was shot dead in Newtownbarry (Bunclody), County Wexford.\n*23 December 1920:\n**The British Government of Ireland Act 1920 received royal assent. It was to come into force in May 1921 and partition Ireland into Northern Ireland and Southern Ireland, each with its own parliament.\n**A civilian was shot dead by Auxiliaries near Tralee, County Kerry, allegedly while trying to escape their custody.\n*24 December 1920: Auxiliaries killed two IRA volunteers when they raided a house in Ballydwyer, County Kerry, before setting the house on fire.\n*27 December 1920: Republicans took over the unoccupied mansion at Caherguillamore, County Limerick, for a secret fundraising dance attended by 200 people. However, British troops and police surrounded the mansion. Five IRA volunteers and a Black and Tan were killed in the exchange of fire. More than 100 men were arrested and most tried by court-martial and imprisoned in England.\n*29 December 1920: Three RIC officers were killed and several wounded in an ambush in Midleton, County Cork. In reprisal, the British Army destroyed several buildings in the town.\n*30 December 1920:\n**The British authorities extended martial law to counties Clare, Kilkenny, Waterford and Wexford. British generals attended a meeting of the Cabinet and predicted victory in Ireland by the spring. Archbishop Clune, who had been mediating between the British and Irish Republic's governments, was informed that all prospect of a truce had been closed.\n**British soldiers shot dead an IRA volunteer they had arrested near Caherconlish, County Limerick. They claimed he had tried to escape, but were charged with murder and one was removed from the army.\n1921\nJanuary 1921\n*1 January 1921:\n**The IRA ambushed an RIC patrol in Ballybay, County Monaghan, killing one officer and wounding others. A civilian was also killed when he ran to fetch reinforcements. The RIC attacked several homes in reprisal and twelve volunteers were later arrested.\n**Seven houses were burnt in Midleton, County Cork as a reprisal for the killing of three RIC officers.\n*2 January 1921:\n**Two RIC men were shot dead by the IRA in a Belfast hotel.\n**West Waterford Column under George Lennon ambush a British patrol at the intersection outside Cappoquin on the Cappoquin-Mt Mellary road.\n*5 January 1921: Martial law was extended to Clare and Waterford.\n*7 January 1921:\n*The RIC raided a cottage near Ballinalee, County Longford, looking for Seán Mac Eoin, who fired from the cottage, killing District Inspector Thomas McGrath and wounding a constable, then escaping.\n*8 January 1921: Thomas Kirby was abducted near Golden, County Tipperary and shot dead by the IRA as an alleged spy and informer. His body was never recovered until 1990, some four miles from where he disappeared.\n**A British Army patrol was ambushed by a combined Waterford force at Pickardstown following a feint attack on the Tramore RIC barracks. Present were W. Waterford O/C Pax Whelan, E. Waterford O/C Paddy Paul and Flying Column O/C George Lennon. Two IRA volunteers (Thomas O'Brien and Michael McGrath) were reportedly taken away and shot dead by members of the Devon Regiment. McGrath was the first Waterford City Volunteer killed in the War.\n*12 January 1921: The IRA ambushed a British troop train carrying 150 soldiers at the Barnesmore Gap, County Donegal. A number of soldiers were wounded. They returned fire with a Lewis machine gun mounted on the train. The IRA also fired on another troop train sent to recover the first.\n*13 January 1921:\n**British troops manning a checkpoint at O'Connell Bridge, Dublin, opened fire on a crowd of civilians, killing two - Martha Nowlan & James Brennan (aged 10) and wounding six.\n**Hunston House, Birr, County Offaly One British soldier of K.S.L.I. killed.\n*14 January 1921: An RIC sergeant was fatally wounded in an IRA grenade attack in Armagh town.\n*15 January 1921: Private R.G. Brown 1165 Company, RASC, who had deserted at Doroughmore in Co.Cork on 13 January 1921, was captured at Ballyvalloon by the IRA and shot as a suspected spy.\n*15–17 January 1921: British soldiers imposed a curfew in an area bounded by Capel, Church and North King Streets and the quays in Dublin's inner city, sealing them off, allowing no-one in or out. They then conducted a house-to-house search, but no significant arrests or arms finds were made.\n*20 January 1921: The IRA in Clare, under Michael Brennan, ambush an RIC lorry at Glenwood, between Sixmilebridge and Broadford. Six constables were killed and two others wounded but escaped. The IRA took their weapons and over 1,000 rounds of ammunition before burning the lorry. Among the dead was RIC District Inspector William Clarke. In reprisals, British forces burned homes and business premises in the vicinity and arrested 22 people.\n*21 January 1921: An abortive IRA ambush took place at Drumcondra. One IRA volunteer, Michael Francis Magee, was wounded and died the next day at King George V Hospital. Five men were captured: Patrick Doyle, Francis X Flood, Thomas Bryan and Bernard Ryan, all of whom were hanged at Mountjoy Prison on 14 March 1921. A fifth, Dermot O'Sullivan, was imprisoned. The last, Séan Burke, successfully escaped.\n*22 January 1921: The IRA shot dead three RIC officers near Stranoodan RIC barracks, County Monaghan.\n*23 January 1921: An Ulster Special Constabulary officer was killed and another wounded after their 15-strong group fired on an RIC patrol which interrupted their looting of a pub in Clones, County Monaghan.\n*24 January 1921: The Roman Catholic Archbishop of Tuam, Thomas Gilmartin, issued a letter saying that IRA volunteers who took part in ambushes \"have broken the truce of God, they have incurred the guilt of murder\".\n*January 1921:\n**IRA volunteer John Doran abducted from his home in Camlough, South Armagh and killed by unknown gunmen.\n**An IRA ambush was mounted at Freeduff, County Armagh. Two RIC men killed and others injured.\n**K Coy, 3rd Battalion Dublin Brigade ambushed a number of lorries of British soldiers at the junction of Merrion Square/Mount Street. IRA men were posted at various points along the route of the convoy (at Holles Street, midway along Merrion Square and from Merrion Street). Clare St. was barricaded and a standing fight developed. The British withdrew after some time. British casualties were believed to be high. No IRA casualties (this was the only operation carried out in Dublin where all of the IRA involved were from a single company)\n**IRA members from E Coy, 3rd Battalion Dublin Brigade attacked government forces at Mespil Road.\n*End of January 1921: The British army in Dublin started carrying republican prisoners in their trucks when on patrol to stop grenade attacks on them, with signs saying \"Bomb us now\". This was discontinued when foreign journalists in the city reported it. They later covered the trucks with a mesh to prevent grenades from entering the vehicles, to which the IRA responded by attaching hooks to what were then referred to as \"Mills bombs\", which would catch in the mesh.\nFebruary 1921\n*1 February 1921:\n**The first execution under martial law of an IRA man took place. Captain Cornelius Murphy of Millstreet, County Cork, was shot by firing squad in Cork city. He was arrested on 4 January and charged with carrying a loaded revolver.\n*2 February 1921:\n**Led by Seán Mac Eoin, the North Longford IRA attacked two lorries of Auxiliaries at the Clonfin Ambush. A landmine was exploded under the lorries, followed by a two-hour firefight. Four Auxiliaries and a driver were killed and eight wounded. The IRA volunteers captured 18 rifles, 20 revolvers and a Lewis gun.\n**Volunteers under the command of Tom Barry occupied Burgatia House, a small country house owned by a loyalist family, and intended to use it as a staging point for an attack on the RIC barracks in Rosscarbery. However, later that day, their position was given away after a postman had stumbled on them, leading to a contingent of Black and Tans being sent out to arrest them. The column managed to beat them back and successfully withdraw.\n*3 February 1921:\n**The Limerick IRA ambushes an RIC patrol at Dromkeen, County Limerick, killing 11 constables.\n**An IRA volunteer is shot dead when British troops raided his safe house in west Cork.\n*5 February 1921:\n**British Intelligence officer Lance Corporal MPC/MFP John Ryan is assassinated by IRA volunteers in a pub on Corporation Street in Dublin.\n**James (Shanker) Ryan, the one who allegedly betrayed Peadar Clancy and Dick McKee on the eve of Bloody Sunday (1920) was killed in Dublin.\n*6 February: There were two attacks on British soldiers at Merrion Square and Camden Street, Dublin by the 3rd Battalion Dublin Brigade.\n*7 February 1921:\n**The IRA ambushed an Ulster Special Constabulary (USC) patrol in Warrenpoint, County Down. A USC officer was killed and two wounded by gunfire and grenades.\n**British army killed 14-year-old boy and wounds two other boys in Knocknagree, County Cork.\n*9 February 1921: Irish republicans James Murphy and Patrick Kennedy were arrested by Auxiliaries in Dublin. Two hours later, Dublin Metropolitan Police found the two men shot in Drumcondra: Kennedy was dead and Murphy was dying when they were discovered. Murphy died two days later in Mater Hospital, Dublin. Before the end, he declared that he and Kennedy were shot by their Auxiliary captors. A court of inquiry was held and Captain H L King, commanding officer of F Company ADRIC and two cadets, were tried for Murphy's murder but acquitted on 15 April 1921.\n*11 February 1921:\n**3rd Cork Brigade volunteers made an attack on a troop train at Drishabeg, near Millstreet, County Cork. One British soldier is killed, five wounded and fifteen captured but later released. The IRA seized arms and ammunition.\n*13 February 1921: Attacks on Crown forces at Merrion Square and Nassau Street, Dublin by 3rd Battalion Dublin Brigade volunteers.\n*14 February 1921:\n**IRA prisoners Ernie O'Malley, Frank Teeling and Simon Donnelly escape from Kilmainham Gaol in Dublin.\n**Two IRA volunteers, the Coffey brothers, were assassinated in their beds by unknown gunmen in Enniskeane, Cork.\n**Pvt A. Mason of the Manchester Regiment went missing near Ballincollig.\n*15 February 1921:\n**Upton Train Ambush: an IRA column from the 3rd Cork Brigade, led by Charlie Hurley mounts a disastrous attack on a train containing British soldiers at Upton, Cork. Three volunteers are killed and three captured. Six civilian passengers are killed and ten wounded in crossfire. Six British soldiers are wounded, three seriously.\n**An IRA ambush position at Mourne Abbey, County Cork, is allegedly betrayed by an informer, William Shields. Five IRA volunteers were killed by British troops, four more were wounded and captured. Two of the captured volunteers - Thomas Mulcahy and Patrick Ronayne were sentenced to death by court martial and shot by firing squad on 28 April 1921.\n*16 February 1921:\n**Four unarmed IRA volunteers, who had been digging a trench at Kilbrittain, County Cork, were arrested by troops of the Essex Regiment and then shot dead.\n**British soldiers attacked at Lower Mount Street Dublin by 3rd Battalion Dublin Brigade volunteers.\n*18 February 1921:British soldiers impose a curfew on the Mountjoy Square area of North Dublin and conduct a house-to-house search. Shortly afterwards another similar curfew was imposed on the Nassau Street/Kildare Street area. Few arrests were made but some arms were seized.\n*19 February 1921: Three British soldiers (privates) of the Oxford Regiment were found by IRA men, unarmed and wearing civilian clothes near Feakle, County Clare. The soldiers said they were deserters but the IRA suspected they were spies, shot them and dumped their bodies near Woodford, County Galway.\n*20 February 1921:\n**The Clonmult Ambush – A dozen IRA volunteers were killed at Clonmult, County Cork, near Midleton, after being surrounded in a house. The British alleged a false IRA surrender and killed all the IRA volunteers in the house. Four other IRA volunteers were wounded and another four were captured unscathed. Only one escaped. The IRA claimed an informer was to blame and a spate of shootings of six alleged informers ensued during the following week.\n**Pvt B. Tinehes of the Manchester Regiment went missing near Ballincollig.\n*21 February 1921:\n**In reprisal for the shooting of a USC officer, Ulster Special Constabulary and UVF men burned ten nationalist-owned homes and a priest's house in Roslea, County Fermanagh. A UVF member mistakenly shot and killed himself.\n**Two IRA volunteers were killed and two wounded in a failed ambush in Friary Street in Kilkenny.\n*22 February 1921:\n**The IRA ambushed a British Army/RIC group outside Mountcharles, County Donegal, killing an RIC officer and wounding others. In reprisal, the RIC and Auxiliaries attacked and looted buildings in Mountcharles and Donegal. In Mountcharles, they shot dead a civilian woman and a drunken Auxiliary mistakenly shot dead an RIC sergeant.\n**The bodies of three British soldiers (Privates Williams, Walker and Morgan of the Oxford and Buckinghamshire Light Infantry) were discovered by a farmer on the Woodford–Cahir road near Lough Atorick by the Clare–Galway border. The three, who had said that they were deserting, were shot dead by the IRA's East Clare Brigade, which believed the three were spies not deserters. One of the victims had a label hung around his neck which read, \"Spies. Tried by courtmartial and found guilty. All others beware\".\n*23 February 1921:\n**IRA volunteers from The Squad, attacked RIC men returning from lunch to Dublin Castle on Parliament street. The policemen were in Dublin to help identify suspects. Two policemen were killed, another was badly wounded and died later that night.\n**One RIC officer was killed, another wounded and two British soldiers of the Essex Regiment were killed in an IRA attack led by Tom Barry in Bandon, County Cork.\n*25 February 1921:\n**The IRA Cork Number One Brigade led by Dan \"Sandow\" O'Donovan attacked a large convoy of mixed military and police at Coolavokig, County Cork (see Coolavokig Ambush). Major James Grant, a British officer was killed. Several Auxiliaries and soldiers were wounded.\n**A British review stated that two British soldiers (excluding RIC personnel) had been killed in the preceding week, the lowest total so far for a week in 1921. The review listed ten ambushes in the preceding seven days. Seven people had been killed as spies by the IRA during the week.\nin Tipperary Town, killed in Cork on 28 February 1921.]]\n*28 February 1921:\n**Sean (John) Allen, a 24 year old IRA man from Tipperary town was executed after a military court found him guilty of possession of a revolver. Allen was buried in Cork Prison yard.\n**An IRA column led by Seán Moylan ambushed an RIC patrol at Tureengariff, County Cork. Two RIC constables were killed and two rifles were taken.\n**Six IRA prisoners executed by Crown forces at Cork County Gaol.\n**Attack on British soldiers at Camden Street, Dublin, by the 3rd Battalion Dublin Brigade.\n*28 February 1921: In retaliation for the previous day's executions, the IRA shot and killed seven off-duty British soldiers and wounded five more in separate incidents in Cork. The British soldiers killed were John Beattie, Private Thomas Wise, Albert Whitear, G. Bowden, Corporal Corporal Hodnett and Private William Gill, [http://www.cwgc.org/find-=-dead/casualty/900161 L.D. Hodnett].\n*February 1921:\n**British soldiers were ambushed at the junction of Aungier Street/Bishop Street by C Company, 3rd Battalion Dublin Brigade.\nMarch 1921\n*1 March 1921:\n**IRA North Longford commander Seán Mac Eoin was captured at Mullingar and charged with the murder of an RIC detective.\n**Two IRA volunteers are killed in a skirmish with British forces at Ballynamrossagh, County Tipperary.\n**Attack on Crown forces at College Green Dublin by IRA volunteers from the 3rd Battalion Dublin Brigade.\n*2 March 1921:\n**IRA fighters from the 2nd Cork Brigade and 2nd Kerry Brigade lay landmines near Millstreet. Thirteen British soldiers are killed and fifteen wounded when the mines explode under their lorry.\n**Attack on Crown forces at South Richmond Street Dublin by Volunteers from the 3rd Battalion Dublin Brigade.\n*3 March 1921: A plan to hold up a train of jurors bound for the spring assizes in Waterford (and ambush the expected convoy of troops) by the West Waterford Column under George Lennon, at Durrow/Ballyvoile. The resulting engagement at Durrow railway tunnel lasted most of the day and the IRA withdrew under the cover of darkness. One British soldier was seriously wounded and two others suffered minor wounds.\n*4 March 1921: The South Leitrim Brigade of the IRA ambush a Black and Tan Convoy, at the Sheemore ambush, near Carrick on Shannon. Several casualties result, including the death of a captain in the Bedfordshire Regiment. Black and Tans later ran amok in Carrick, burning and looting, and burned both the premises of the Leitrim Observer newspaper and the local rowing club to the ground.\n*5 March 1921:\n**An IRA column mounted an ambush at Clonbanin, County Cork. A British general, Cumming, and three other soldiers were killed when their armoured car broke down and they were exposed to IRA fire.\n**Two ambushes took place in Dublin, one near present-day Parnell Square, the other in Clontarf, both in the north of the city. In both incidents, IRA volunteers threw hand grenades and exchanged fire with British troops. One civilian was killed and four wounded. No combatant casualties were reported.\n*6 March 1921: The Limerick Curfew Murders. The Mayor of Limerick, George Clancy, former mayor Michael O'Callaghan and IRA volunteer Joseph O'Donoghue, were all shot dead in their homes at night after curfew by a British intelligence agent, George Nathan, assisted by an Auxiliary from G Company ADRIC.\n*7 March 1921: The South Mayo IRA flying column under Tom Maguire surrounded a British army patrol at Kilfaul, near Partry between Ballinrobe and Castlebar, forcing it to surrender and give up its arms. Corporal Bell of The Border Regiment died the following day as a result of wounds. An innocent civilian, Thomas Horan (57 years) of Srah, Tourmakeady, was killed in reprisal when three men in police uniforms entered his home and shot him in the head.\n*9 March 1921: A party of masked policemen entered the home of the Loughnane family in Mitchel St., Thurles. William Loughnane (23 years old) was shot dead in his bed.\nWilliam, his father and 3 brothers were active members of local IRA company. The same night, Laurence Hickey (a well-known republican) was also shot in his home in Main St., Thurles. A third man, Denis Regan, prominent in the Thurles IRA, was shot several times the same night, by masked Auxiliary men, in a separate incident but survived the attempted killing. It is thought that the 3 attacks were reprisals for the IRA's execution of 2 informants in Thurles who were close friends of local RIC and Black and Tans on March, 1st, 1921. (For extra details see records from Commandant Leahy, No. 2 Mid-Tipp-Brigade. His details are present in the Irish Bureau of Military History statements: (See File No S.790. Document No. w.s. 1454. pp.&nbsp;66–69.))\n*10 March 1921: A large British force carried out a large scale sweep at Nad, County Cork (in the Boggeragh Mountains). A house was raided with six members of the Mallow IRA column asleep in it. Two made their escape (Joe Morgan and John Moloney) but the other four volunteers are shot dead.\n*11 March 1921:\n** British troops in County Cork were tipped off by Mrs Mary (or Maria) Lindsay, a local Protestant, about an impending IRA ambush at Dripsey, on 28 January 1921 to which she had somehow become privy. She first told the local Catholic priest who tried unsuccessfully to dissuade the IRA from the ambush. At the ambush eight Volunteers were captured, two IRA volunteers were killed and five IRA prisoners were later executed under martial law. On 11 March 1921 the IRA killed Mrs Lindsay and her chauffeur, James Clarke, and burned down her home, Leemount House, in reprisal.\n**Dáil Éireann debated, resolved and finally on 11 March declared war on the British administration.\n**The North Longford IRA officer Seán Connolly and five other IRA volunteers were killed by British troops at the Selton Hill ambush, near Mohill, County Leitrim when their ambush position was allegedly betrayed by a local Orangeman.\n**Three RIC men attacked and killed by the IRA near the corner of Victoria Square and Church Street in Belfast. Two civilians injured in the attack, one of whom later died in the hospital.\n*12 March 1921: A firefight took place between the Kilkenny IRA unit and British forces at Garryricken House on the Clonmel-Kilkenny road. One RIC constable was killed.\n*13 March 1921: A Moyasta farmer and Sinn Féin magistrate named Tom Shannon was murdered in his home by unknown assailants-suspected to be British Forces.\n*14 March 1921:\n**Six IRA prisoners were hanged by the British in Mountjoy Prison including Thomas Whelan and Patrick Moran.\n**The Battle of Brunswick Street. An Auxiliary patrol of two lorries and an armoured car, which was on its way to raid St Andrews Club, 144 Brunswick Street, Dublin, was attacked on Brunswick Street (now Pearse Street) near the corner of Erne Street. In the gun battle that followed, three IRA volunteers and two policemen as well as two civilians were killed. A number of IRA volunteers were captured. One, Thomas Traynor, was hanged on 25 April.\n*16 March 1921:\n**The IRA in Galway attacked the RIC barracks in Clifden, killing two constables. The Auxiliaries and Black and Tans burned and looted 16 buildings in Clifden in reprisal for the attacks. One civilian was shot dead during the reprisals. The IRA column retreated to the Maam valley, where they ambushed British reinforcements at Munterowan and Screebe.\n**Dublin: A troop lorry from Wellington Barracks, carrying British soldiers from the South Lancashire Regiment, was hit by two grenades hurled from overlooking buildings on Wexford Street, killing two soldiers (Lance Corporal Jarvis and Private G. Thomas) and wounding six others, one of whom, Private Whiting, died from his wounds two days later.\n*18–19 March 1921:\n**Burgery ambush - West Waterford IRA under Pax Whelan, George Lennon (Commander of the local Flying column) and George Plunkett from Dublin HQ, ambushed a convoy of Black and Tans returning to Dungarvan via the Burgery. One Black and Tan was killed along with two IRA volunteers (Pat Keating and Seán Fitzgerald).\n**An IRA firing squad killed a Dungarvan constable, Michael Hickey. Affixed to his tunic was the notation \"police spy\". He was later interred, upon the intercession of the parish priest, in an unmarked grave belonging to his fiancée's family at St Mary's Roman Catholic Church, Dungarvan.\n*19 March 1921:\n**Crossbarry Ambush - The IRA Cork no. 3 Brigade under Tom Barry fought an action against 1,200 British troops at Crossbarry, County Cork. The IRA column, comprising roughly 100 men, escaped encirclement. One RIC constable and six soldiers killed. The British claimed six IRA volunteers were killed; however, the IRA claimed only three were killed and the other three were wounded.\n**An RIC Constable and a RIC Sergeant killed in IRA ambushes.\n*20 March 1921: A County Donegal IRA column under Peadar O'Donnell attacks the RIC station at Falcarragh; one constable is killed.\n*21 March 1921:\n**The Kerry IRA attacked a train carrying military personnel at Headford Junction near Killarney. The IRA claimed twenty British soldiers were killed, as well as two IRA volunteers and three civilians. The British reported only 8 soldiers killed and 12 wounded.\n**In an ambush at Lispole, County Kerry, three IRA volunteers were killed\n**The IRA attacked the homes of up to sixteen Ulster Special Constabulary officers in the Roslea district of Fermanagh, killing three and wounding others. IRA volunteers were also wounded and one captured.\n**Attack on RIC patrol at Rosemount, Dundrum, County Dublin. Two RIC constables wounded.\n*22 March 1921:\n**Three members of the West Mayo IRA flying column under the command of Michael Kilroy attacked a four-man RIC patrol at Clady, County Tyrone. Three policemen were wounded and one was killed.\n**Attack on Auxiliaries at the Royal Marine Hotel, Dún Laoghaire. 3 Auxiliaries killed and at least 1 wounded. One IRA volunteer (Lt. Jim McIntosh) was killed.\n**\n*23 March 1921:\n**An IRA ambush on the Strokestown-Longford road by the IRA's South Roscommon Brigade claims the lives of one British soldier and two constables. Two Black and Tan constables {Agnew and Buchanan} surrender and are \"missing\" (i.e. killed by the IRA). Arms and ammunition including a Hotchkiss machine gun were captured by the IRA. One volunteer was killed in the Scramogue Ambush.\n**The Press reports that 28 people were killed and 33 wounded in various ambushes on this day, bringing the total for the previous five days to 65 killed and 67 wounded.\n**Six IRA volunteers of the Cork number 1 Brigade were captured Cork by British forces at Clogheen, County Cork and summarily shot. It was alleged that an ex-British soldier/informer Patrick Joseph \"Cruxy\" O'Conner from within the IRA provided the location of the IRA unit and then fled the country to New York. Over a year later on April 13, 1922 he was shot four times and seriously wounded on a New York City street by an IRA ASU squad but survived the murder/revenge attempt. O'Conner died in Canada in the 1950s.\n*24 March 1921: IRA Volunteer Louis Darcy was murdered (while being held prisoner) by Black and Tans. His body was dragged for several miles behind a lorry and dumped at Merlin Park, County Galway.\n*24 March 1921: A bomb was thrown at a group of soldiers at Westport, County Mayo. British reprisals took place that night throughout West Mayo.\n*28 March 1921: Attack on mixed patrol of Auxiliaries and military on Marine Road, Dún Laoghaire. One lorry was hit by a grenade and sped away to George's Street, where it ran into a burst of fire from an IRA patrol. This convoy then proceeded to the Blackrock area where it was ambushed at Temple Hill. Tender disabled by bomb. Several auxiliaries and one IRA volunteer were wounded\n*29 March 1921: A Black and Tan, Const. William Stephens, was shot and mortally wounded in Ballyhaunis, County Mayo.\n*30 March 1921: Two RIC men were killed and one wounded in an ambush in Ballyfermot, County Dublin.\n*March 1921:\n**The West Cork IRA column under Tom Barry attacked the RIC barracks at Rosscarbery.\n**An informer (identified as Dan Shields) reportedly betrayed the position of an IRA column in Nad, County Cork. Three IRA volunteers were killed in the subsequent British ambush.\nApril 1921\n*1 April 1921:\n**The IRA's East Mayo Brigade commander, Seán Corcoran, was killed by British troops at Crossard near Ballyhaunis, County Mayo. Vice Cmdt. Maurice Mullins also captured and almost beaten to death. Later that day, Michael Coen an IRA volunteer from Lecarrow, Ballyhaunis was captured, tortured, murdered and his body mutilated in retaliation for the killing of William Stephens in Ballyhaunis on 29 March.\n**In Derry, the IRA attacked the RIC barracks on Lecky Road and a British Army post on Strand Road with gunfire and grenades. Two RIC officers were killed.\n*2 April 1921: An IRA informer, Vincent Fovargue (aged 20) from Dublin, was shot dead at a golf course near London, England. A note was left saying, \"let spies and traitors beware, IRA\". The shooting was reported carried out by IRA Officer Reginald Dunne, who was later be executed for the killing of British Field Marshall Sir Henry Wilson, 1st Baronet.\n*3 April 1921: The South Leitrim Brigade of the IRA hold up the Cavan and Leitrim Railway and intercept the Mail Car. A letter implicates a local farmer, John Harrison, as an informer; he is later killed.\n*6–7 April 1921: An RIC officer was killed and four wounded in an IRA ambush in Dromore, County Tyrone. The next day, an RIC sergeant shot a Catholic girl on the main street in a sectarian attack. He was then shot dead by an IRA volunteer, the girl's brother. In reprisal, the Ulster Special Constabulary kidnapped and killed three local IRA volunteers.\n*9 April 1921: An abortive IRA ambush took place in Mullinglown, County Carlow - no casualties resulted but several IRA volunteers are arrested including the Officer Commanding.\n*10 April 1921:\n**The IRA ambushed Ulster Special Constabulary (USC) officers outside a church in Creggan, County Armagh, killing one and wounding others with gunfire and grenades. The IRA had evacuated civilians from the area. In reprisal, the USC attacked nationalists and burned their homes in Killylea, where the officers came from.\n**Privates George Motley and John Steer, both of the East Lancashire Regiment, were captured by the IRA at Barraduff, County Kerry. Moved around the countryside for about six months before being shot, their bodies were dumped in Anablaha bog and not recovered until January 1927 when Motley was buried in Nab Wood Cemetery near his home town of Shipley, West Yorkshire, and Steer in Immanuel Church, Accrington, Lancashire, both with full military honours.\n*13–15 April 1921: Captain W.L. King, commanding officer of F Company Auxiliary Division, RIC, was tried by court-martial for the murder of James Murphy on 9 February 1921. Murphy's dying declaration was ruled inadmissible. Two Auxiliaries provided alibis for Captain King at the time of the murder. King was acquitted.\n*14 April 1921: Sir Arthur Vicars is assassinated in Kilmorna County Kerry by IRA. It was thought that Vickers had British forces at his home and he was accused of being a spy. Vickers home (KIlmorna House) and its contents were also destroyed.\n*15 April 1921: Major McKinnon, an RIC Auxiliary officer, is shot dead by the IRA at Tralee golf course, County Kerry.\n*16 April 1921:Bomb Thrown into the Unionist Club, County Clare. Sgt Sydney T. Rew of the Royal Scots killed; a Constable and two civilians injured.\n*18 April 1921: Attack on Cabinteely RIC barracks in County Dublin.\n**A mixed patrol of British army and RIC came upon armed men drilling in a field in Mullannagaun, Ballymurphy, Borris, County Carlow. Four IRA Volunteers were killed and six were wounded. One civilian was also killed by a stray bullet.\n*19 April 1921:\n**A group of Auxiliaries mistook a group of off-duty RIC constables drinking in a hotel in Castleconnell, County Limerick for IRA volunteers and opened fire on them. Two RIC men, one Auxiliary and the hotel landlord (Denis O'Donovan) were killed in the gunfight until the mistake was realised.\n**After a shootout near Loughglynn, County Roscommon, Black and Tans killed two IRA volunteers, Sean Bergin (23) and Stephen McDermott (19), and injured two others, Joe Satchwell and Thomas Scally. One soldier was seriously injured during the gun battle.\n**Two RIC officers were taken from a train at Ballysadare, County Sligo, and summarily killed by the IRA.\n*23 April 1921:\n**In central Belfast, two IRA officers Seamus Woods and Roger McCorley shot dead two Black and Tans. They exchanged fire with other RIC men as they made their escape and two civilians were injured in the crossfire. Loyalist gunmen killed two Catholic civilians in reprisal. Uniformed RIC men assassinated two republicans, the Duffin brothers, in revenge.\n**The Third Tipperary Brigade, IRA ambushed a small party of British soldiers accompanying two horse-drawn carts approached from Clogheen, near Curraghcloney, close to the village of Ballylooby. The IRA volunteers withdrew southwards towards the Knockmealdown Mountains leaving one British soldier dead and two others wounded, one fatally. By chance, RIC District Inspector Gilbert Potter was returning by car from police duties at Ballyporeen, drove into a section of the withdrawing Column. Potter was held as a hostage for the safe release of Thomas Traynor, an IRA Volunteer under sentence of death. Following Traynor's hanging, Potter was shot dead by the IRA.\n*26 April 1921: The IRA ambushed an Ulster Special Constabulary patrol in Newry, killing one and wounding others. Some of the IRA unit were captured shortly after.\n*28 April 1921:\n**IRA volunteers Patrick Ronayne of Greenhill, Mourneabbey, Mallow, County Cork and Thomas Mulcahy were executed at Cork Military Detention Barracks for their involvement in the failed Mourneabbey Ambush. Both men were buried in Cork Prison yard. The number of volunteers killed/wounded in this action is unclear.\n*29 April 1921: West Waterford Flying Column under George Lennon ambushed a train carrying British troops at the Ballylinch level crossing. The exchange of gunfire continued for half an hour, one volunteer was wounded and two British military were killed in a fire-fight.\n*30 April 1921: Major Geoffrey Lee Compton-Smith (DSO), of the 2nd Battalion Royal Welch Fusiliers, shot dead by the IRA (captured 18 April in Blarney, County Cork, the IRA promised the Majors release in return for the release of IRA prisoners being held under the sentence of death. The request was refused and 6 prisoners were executed, in reprisal the IRA Volunteers killed the Major near Donoughmore, County Cork on 28 April 1921).\n*April 1921:\n**The Dublin IRA carried out 67 attacks on British forces in the city in the course of the month.\n***Road trenching by IRA party on Churchtown Road, Churchtown Park, County Dublin surprised by two parties of RIC and B&T's coming from two different directions. Running battle ensued for more than two hours and was eventually broken at Milltown.\n***Large quantities of clothing belonging to the Auxiliaries and military officers in Dublin Castle and other barracks in the city seized in Milltown and Dundrum laundries and destroyed. These operations were repeated weekly until the enemy stopped sending its soiled clothes to the laundries.\n***A party of IRA engaged in destroying Classons bridge, Milltown, Dublin, were attacked by a large force of military and Auxiliaries who had penetrated a ring of outposts owing to the defection of one of the outposts. They advanced to within 50 yards of the bridge and then opened fire with machine guns. Ensuing engagement lasted over an hour. One IRA volunteer was wounded and three members of the Crown forces were wounded; one of whom later died of his injuries.\n***Telephone and telegraph equipment seized in all post offices and telephone exchanges in south County Dublin.\n***General attack on RIC, B&T and Military posts in Barracks, Courthouse, Royal Hotel and Coastguard station in Bray. Shooting lasted for 2 hours. Several B&T's and civilians wounded.\n***Attack on mixed patrol of Auxiliaries and B&T near Bray RIC barracks. 1 B&T and Auxie wounded.\n***Attack on residence of Mr Cross (an Orangeman) in Ballycorus, County Dublin. The attack continued until a shortage of ammunition forced the IRA to retire. One IRA volunteer (Peter Little) was wounded. It was later reported that one occupant of the house had been killed and another wounded.\n***Attack on RIC barracks, Dundrum, County Dublin. IRA party advanced to positions behind a wall at the railway accommodation and attacked the courthouse and barracks machine gun post which was put out of action and gunner wounded.\n***British soldiers held up at the Dodder banks, South Dublin while they were meeting girlfriends. They were ordered to return to the city minus all clothing except trousers and shirt.\n***Attack on Dundrum RIC barracks, County Dublin by seven IRA riflemen who shot only one round each at delayed intervals. The RIC continued firing for many hours after the attackers had withdrawn.\n***Attack on military lorry at Jamestown, Sandyford, County Dublin. Lorry raced away with the occupants shooting wildly. Casualties unknown.\n***Attack on military and B&T's in lorries at William Park near Booterstown, County Dublin. British casualties unknown.\n***Attack on private car carrying British Colonel McCabe and escort lorry at Kilgobbin, County Dublin. Two vehicles speed up and race away. One member of the escort party wounded.\nMay 1921\n*1 May 1921:\n**An abortive IRA ambush at Islandeady, County Mayo led to the death of two IRA volunteers.\n**The IRA shot dead two Black and Tans outside Arvagh, County Cavan.\n*2 May 1921: An IRA column ambushed British troops near Lackelly, County Limerick, but took heavy casualties in the ensuing fire fight. The IRA columns was itself ambushed another three times as it retreated during a five and a half-hour running fight. Between five and fourteen IRA volunteers were killed and up to thirty wounded.\n*3 May 1921: The South Mayo IRA flying column under Tom Maguire ambush British troops at Tourmakeady, killing four RIC policemen (Sgt John Regan, Constable William Power, Constable Christopher O'Regan, Constable Herbert Oates). The IRA volunteers were then pursued across the Partry Mountains. They managed to escape despite Maguire being badly wounded. Two IRA volunteers were killed in this engagement (Michael O'Brien and Patrick Feeney) and another died later in 1922 as a result of an infection picked up from lying in a ditch while on the run.\n*4 May 1921: The Kerry IRA ambushed an RIC patrol. Eight out of nine constables were killed or died of their wounds. Five houses and a creamery were burned in reprisal. The IRA had left the body of an 80-year-old informer, Thomas Sullivan, whom they had killed, at the side of the road near Rathmore, to lure the police into the ambush.\n*8 May 1921:\n**An IRA training camp was surrounded by British troops and Auxiliaries in the Lappanduff Hills, County Cavan, sparking a two-hour firefight. An IRA volunteer was killed and eleven captured, all of them from the Belfast Brigade.\n**British forces in Carrigtouhil, Cork, shot dead an IRA volunteer.\n**RIC Constable Frederick Sterland killed while leaving a hotel off duty by four men he befriended\n**RIC Head Constable William K. Storey Shot dead from behind while returning from church with his wife.\n**RIC Sgt Constable Thomas McCormack Fatally shot when the patrol he was part of was ambushed by a large IRA unit.\n*9 May 1921:\n**In Kerry, near Castleisland, two RIC men were shot by IRA volunteers on their way home from Mass. One (RIC Constable Alexander Thomas Clark) was killed, the other saved when his wife covered him with her body.\n**Attack on Dundrum RIC barracks, County Dublin. When the IRA attacking party had withdrawn the RIC and B&T's came out of the Barracks presumably to search for the attackers. Some IRA men had remained hidden near to the barracks and threw two grenades into the middle of the assembled RIC and B&T's. One IRA volunteer was wounded. Number of constables and B&Ts killed unclear.\n**Two Black and Tans/RIC Constables, Thomas Clarke and Charles Murdock, were shot dead by the IRA near Clonmany, County Donegal. The body of Clarke was washed up on the shore the next day, the other was reportedly buried in a bog.\n*RIC Constables James Cullen and Martin Fallon killed when shop was fired on and Bombed. Each Posthumously awarded Constabulary Medal for Gallantry.\n*10 May 1921\n**There was an attack on Cabinteely RIC barracks, County Dublin with grenades from a motor car at the front entrance and with rifles from the rear by IRA men from the 6th Battalion Dublin Brigade. Casualties were admitted by RIC but no number was given.\n*11 May 1921: A party of Black and Tans shot dead Christopher Folan, Woodquay, Galway, and injured Joseph Folan, while searching the family home for James Folan, Battalion-Quartermaster of the Galway Brigade, who had just been released from prison for republican activities. They then went to another house and shot dead Hubert Tully, a republican suspect and contact of Seán Broderick, a Galway republican leader.Henry, William. Blood For Blood, The Black and Tan War in Galway. Mercier Press, Dublin, 2012.\n*12 May 1921:\n**A group of Black and Tans travelling from Listowel towards Athea arrested three young men in Gortaglanna. Prior to this the barracks in Listowel had been burnt out and the troops decided to execute the young men in revenge. One of the men, Dalton, attempted to free himself from captivity and escaped, though injured by a bullet. Both of the other two men are shot on the spot.\n**Attack on Cabinteely RIC barracks, County Dublin. One IRA volunteer was wounded and later died on 28 May.\n*13 May 1921: Attack on Cabinteely RIC barracks. 1 B&T (Constable Skeates) shot dead by IRA sniper.\n*13–15 May 1921: \"Black Whitsun\": a general election for the parliament of Southern Ireland was held on 13 May. Sinn Féin won 124 of the new parliament's 128 seats unopposed (unionists won four seats) and its elected members refused to take their seats. Over the next two days (14–15 May) the IRA killed fifteen policemen.\n*14 May 1921:\n**IRA volunteers, led by Paddy Daly and Emmet Dalton seized an armoured car on the North Circular Road in Dublin, killing two British soldiers. The car was then used to gain entrance to Mountjoy Prison in an effort to free Seán Mac Eoin. However, the plot was discovered and the IRA volunteers in the car had to shoot their way out of the prison. The car was later abandoned in Clontarf.\n**IRA in Castletownbere, led by Michael Óg O'Sullivan, kill four soldiers of the King's Own Scottish Borderers and wound two others at Furious Pier.\n**RIC Head Constable Francis Benson Shot and killed by an IRA gang as he left his home in Tralee.\n**RIC Constable Peter Coghlan fatally wounded by the explosion of an IRA bomb thrown at the patrol he was part of.\n**RIC Constables Harold Thompson and Thomas Cornyn both Shot dead going to summon a priest after a colleague was shot by the IRA.\n**RIC Sgt Joseph E. Coleman Shot dead in a public house by the IRA.\n**RIC Constable Robert Redmond Fatally shot while off duty on leave.\n**RIc Constable John McKenna Shot dead in a field near his barracks by four IRA gunmen.\n**RIC Constable Thomas Bridges Attacked by IRA gunmen and shot dead as he went for provisions.\n**IRA volunteers in Tipperary assassinated an RIC Detective Inspector, Harry Biggs, and a local Protestant woman, Miss Barrington, sitting beside him in a police car.\n**IRA Volunteer Edward McCusker shot dead during an attack on RIC in Dromore, County Tyrone.\n**RIC Constable Peter Carolan Fatally wounded together with two constables who died on 15 and 24 May, by the explosion of an IRA bomb thrown at their patrol.\n*15 May 1921:\n**Ballyturin House Ambush: An IRA unit in County Galway ambushed a motor car as it left Ballyturin House near Gort. Two Army officers were shot dead, along with an RIC District Inspector Cecil Arthur Maurice Blake  and his wife. Margaret Gregory, daughter-in-law of Lady Gregory, was unharmed. The RIC came under fire when they arrived at the scene; one constable was wounded and died six days later.\n**British forces in Carrigtouhil, Cork, shot three civilians dead.\n**Execution of Peter Grey (or Graham), a purported spy, at Killiney, County Dublin golf links by IRA Volunteers from the 6th Battalion Dublin Brigade.\n**Sgt S Goldsmith of Royal Fusiliers thrown off bicycle and seriously wounded by two men at Kenmaore County Kerry; dies of injuries 25 May 1921\n*16 May 1921: Two IRA volunteers are killed in an attempted ambush of an RIC patrol at Barrowhouse, County Kildare.\n*17 May 1921: Pvt of 8th Royal Marine Battalion RMLI was kidnapped and killed.\n*18 May 1921:\n**An RIC officer was killed and another wounded in an IRA ambush in Letterkenny, County Donegal. In reprisal, Black and Tans attacked several businesses and civilians in the town.\n**A British sergeant was taken from his home in Inchicore by members of the 4th Battalion Dublin Brigade IRA and killed near Crumlin.\n*19 May 1921:\n**Kilmeena ambush, British troops surprised an IRA ambush party at Kilmeena, County Mayo; 6 IRA volunteers were killed and seven wounded. The remainder of the column fled over the mountains to Skerdagh. One RIC man and one Black and Tan were killed in the action. British forces threw the dead and wounded IRA volunteers into the street outside the Police barracks in Westport, causing widespread revulsion. The Marquess of Sligo visited the Police station to complain.\n**Two RIC men were killed by IRA members in Kinnitty, County Offaly.\n**Farmer Joseph Hayden shot to death in apparent reprisal for the earlier wounding of a RIC member. Haydens brother was wounded in the back with a bayonet.\n*21 May 1921:\n**IRA ambush at Ballyvaughan of ten members of the British 8th Royal Marine Battalion RMLI (RMBs). At least two RMBs were killed and another two wounded.\n** RIC Constable Peter McDonagh shot to death in ambush in Mountfield, County Tyrone.\n** Thomas McEver, a chemist in Dunmore, Co. Galway was abducted from his home in the middle of the night and murdered by crown forces.\n*22 May 1921: Attack on military lorry at Foxrock, County Dublin. One soldier is wounded.\n*23 May 1921:\n**The IRA in Clare ambushed an RIC patrol at Glenwood, between Sixmilebridge and Broadfoot. Six RIC constables were killed including a District Inspector and two were wounded. The IRA volunteers captured ten rifles.\n**A British Army Officer disappears, presumed killed, in County Cork.\n**Two British soldiers of the 1st Battalion Machine Gun Corps [names unknown] [PVts Cagney and Musgrave[?] claim to be deserters to the IRA near Charleville, County Cork; however they are both killed as being suspected Intelligence operatives\n*24 May 1921: Members of K Coy, 3rd Battalion Dublin Brigade IRA attacked Black and Tans on Merrion Row. Heavy Tan casualties. No IRA casualties.\n*25 May 1921:\n**Dublin IRA units occupied and burned the Custom House, centre of local government in Ireland in Dublin city centre. The building and the IRA units were quickly surrounded by first two companies of Auxiliaries and then several hundred more British Army troops. Five IRA volunteers and three civilians were killed and about eighty volunteers were captured. Four Auxiliaries were wounded in the firing. The operation was a publicity coup but a military disaster for the Dublin IRA.\n**Attacks on Dundrum RIC barracks, Cabinteely RIC barracks (twice), Enniskerry RIC barracks, Military patrol on the Bray road at Stillorgan, Naval base and wireless station Dún Laoghaire, Military lorry, Alma Road, Monkstown. These attacks were carried out by IRA Volunteers from the 6th Battalion on orders from Dublin Brigade HQ to relieve pressure on the city Battalions as a result of the Customs House attack.\n*26 May 1921:\n**There was an IRA attack on the Naval base and wireless station at Dún Laoghaire. While the attack was in progress, an armoured car leading a party of troops from the naval base advanced up Marine Road. Another party from the wireless station proceeded from Clarence Street. Both patrols were attacked on the way and shortly after capturing Georges Street. They (the British patrols) clashed and opened fire on each other. They suffered some killed and 5 wounded before they realised their mistake.\n**Pvt E. Budd of Machine Gun Corps [attached to the Royal Irish Constabulary] was killed.\n*27 May 1921: Cpt. Paddy Boland O/C Crossard Coy, Ballyhaunis IRA killed by Crown forces.\n*29 May 1921: The IRA ambushed an Ulster Special Constabulary patrol at Mullaghfad, County Fermanagh, killing two officers and wounding others.\n*30 May 1921:\n**Volunteer Tommy Murphy was shot dead in his home in Foxrock, County Dublin, by British forces. Before leaving his house the raiders attached a label to Murphy's body \"Executed by the IRA\". This allegation was refuted in a subsequent issue of An tÓglach.\n**After an attack on RIC patrol at Kill O'The Grange, IRA volunteers from the Deansgrange Coy, 6th Battalion, Dublin Brigade encountered another party of RIC at Monaloe under Sergeant Cullen. An engagement ensued but both sides retired safely.\n*31 May 1921: IRA volunteers explode a remotely detonated mine under a British Military band at Youghal, County Cork. Seven British soldiers (military bandsmen from Hampshire regiment) are killed. 20 others are wounded in the explosion.\n*May 1921:\n**Pope Benedict XV issued a letter that encouraged the \"English as well as Irish to calmly consider ... some means of agreement\".\n**Ulster Special Constable George Lynas is shot dead in County Armagh; the B-Specials shot dead two local Catholics in reprisal.\n**Lt. Breeze of the Warwickshire Regiment is shot dead by IRA at Foxrock, County Dublin.\n**Attack on military lorry at Castle Street, Dalkey, by IRA volunteers from the 6th Battalion Dublin Brigade. The driver was shot dead. The lorry crashed and was later destroyed. An undisclosed amount of ammunition was seized by the IRA.\n**Destruction of Jamestown Bridge near Sandyford.\n**Second attack on the home of a member of the Orange Order, Mr Cross, Ballycorous, County Dublin. One occupant wounded and two killed. 6th Battalion Cmdt. Andy McDonnell (IRA) is wounded and taken to hospital.\nJune 1921\n*1 June 1921: IRA volunteers ambushed a police bicycle patrol near Castlemaine, County Kerry. An RIC District Inspector and three constables were killed outright; a sergeant was wounded and died later.\n*2 June 1921: Carrowkennedy ambush, County Mayo. Michael Kilroy and the IRA's West Mayo Flying Column ambushed a convoy of RIC and Black and Tans. The fighting lasted three and a half hours in which seven policemen were killed and six were wounded, two mortally. The surviving seventeen police surrendered and the IRA seized a large quantity of arms. Many of the locals went into hiding to avoid retribution from the Black and Tans. Volunteers went on the run throughout the region sheltering in safe houses.\n*3 June 1921: IRA volunteers ambushed British troops at Kylebeg near Modreeny in County Tipperary. Members of the IRA's Northern Tipperary Flying Column led by Sean Gaynor attacked a mixed group of 25 British soldiers, RIC policemen and Black & Tans, travelling from Borrisokane to Cloughjordan killing four RIC men and wounding 14.\n**Chief Secretary for Ireland (Hamar Greenwood) issues order that official reprisals are to cease.\n*4–14 June 1921: Around 800 British troops swept the Macroom area, of County Cork.\n*5 June 1921:\n**Three members of Manchester Regiment were killed at Kilcrea, Ovens, Cork.\n**The IRA ambushed Ulster Special Constabulary officers outside their barracks in Swatragh, County Londonderry, killing one. Shortly after, a Sinn Féin supporter was shot dead at Ballintemple, near Garvagh.\n*7 June 1921:\n**The Lord Lieutenant of Ireland appoints James Craig as the first Prime Minister of Northern Ireland. Several other members of the new Northern government are also appointed.\n**Two republicans, Patrick Maher and Edmond Foley, are hanged at MountyJoy Prison after being found guilty of a killing of a Policeman during attempted rescue of an IrA prisoner by a military tribunal [Both men had been previously twice acquitted by Civilian Courts]. Also hanged is a Black and Tan Temporary Constable William Mitchell on a charge of being an accessory in the robbery-murder of Dunlavin magistrate Robert Dixon in February 1921-although the prime suspect had committed suicide and apparently Mitchell's \"guilt\" was determined before his trial despite no evidence of his guilt in the original crime.\n*8 June 1921: The IRA ambushed an Ulster Special Constabulary (USC) patrol at Carrogs, near Newry, County Down. In reprisal, USC officers went to the nearest Catholic home and fatally shot two civilian men. The IRA fired on the USC from a nearby hill, killing one and forcing them to withdraw.\n*10 June 1921:\n**Seven Waterford IRA men were captured when a party of Marines, having crossed from Youghal by boat to Ferrypoint by night, surprised them near Piltown, County Waterford.\n**Two Auxiliary Cadets were surprised by the IRA near Woodstock, County Kilkenny; one escaped. The Other Cadet Leonard French was missing but apparently killed.\n*11 June 1921: Royal Scots Private George Duff Chalmers captured in West Clare while serving a summons and killed by IRA\n*12 June 1921: Three RIC men were shot by the IRA on the Falls Road in Belfast. Two were wounded and one died. Uniformed RIC/Black & Tans including DI Nixon arrested and murdered three Catholic male civilians in north Belfast. Over the following two days, loyalist gunmen killed six more Catholics and the IRA assassinated three Protestants in the city.\n*15 June 1921:\n**Members of the East Clare Brigade IRA were ambushed by British soldiers at Woodcock Hill, Meelick, while attempting to raid the Limerick to Ennis train. Captain Christopher McCarthy of the IRA was wounded during the ambush and Captain Michael Gleeson returned under fire to rescue McCarthy. Both men were subsequently captured by British soldiers and killed.\n*16 June 1921: Rathcoole ambush – 2nd Cork Brigade ambushed a convoy of Auxiliaries near Rathcoole, County Cork, killing two Auxiliaries and wounding fourteen others.\n*17 June 1921:\n**Two brothers with republican links were taken from their home in Dundalk, County Louth, and summarily killed by Black and Tans. In reprisal, the IRA killed an RIC officer in the town.\n**Ballyhaunis RIC barracks in County Mayo was attacked.\n*18 June 1921:\n**36 IRA volunteers in Kilkenny try to ambush a British Army convoy between Castlecomer and Athy, travelling with a mine. However the British were tipped off by a local woman informer, Florrie Draper. British troops crept up on the would-be ambushers and opened fire, killing two volunteers (Seán Hartley and Nicholas Mullins) and injuring another. Draper's house was burned in reprisal.\n**The 9th Battalion of the Kilkenny IRA ambushed a patrol of Black and Tans from Fiddown Barracks at Sinnotts Cross, near Clogga, Mooncoin, County Kilkenny. One Black and Tan was killed and another injured. No volunteers captured or lost.\n**Three British officers, dressed in civilian clothes but carrying pistols, were captured near Fethard, County Tipperary, by IRA volunteers under Ernie O'Malley. The three were shot by firing squad at dawn the next day in reprisal for the execution of captured IRA men by the British.\n, printed in the Daily Mirror, 27 June 1921]]\n*19 June 1921: While escorting a coffin of a slain R.I.C. man by Devonshire Regiment, New Bridge, Carrick-on-Suir County Tipperary, ambushed by IRA; one British Soldier Pvt W. Smith killed\n*20 June 1921: Group Returning from a tennis party at Benown House, Glasson about six miles from Athlone, County Westmeath ambushed by IRA. Colonel Commandant Thomas Stanton Lambert [General Staff] dies of shotgun wounds\n*22 June 1921: King George V addressed the first session of the parliament of Northern Ireland, calling on \"all Irishmen to pause, to stretch out the hand of forbearance and conciliation, to forgive and to forget, and to join in making for the land they love a new era of peace, contentment, and good will\".\n**Over 1000 British troops mounted a sweep of Millstreet, County Cork and environs.\n**An IRA column was encircled by British forces in Ballycastle, County Mayo; one IRA volunteer was killed and seven volunteers were captured.\n**The IRA derailed a British troop train with a bomb at Adavoyle, County Armagh. It carried the king's armed escort, the 10th Royal Hussars, back from the opening of the Northern Ireland Parliament. Five soldiers and a civilian train guard were killed or fatally wounded, as were fifty horses. Some soldiers fired at civilians in surrounding fields, killing one.\n*23 June 1921: an IRA unit in a car threw a number of bombs at an RIC post on Grand Parade, Cork. The RIC returned fire, killing Josephine Scannell (19), a civilian who was working on a sewing machine at her home in French's Quay.\n*24 June 1921:\n**The British Coalition Government's Cabinet decided to propose talks with the leaders of Sinn Féin. Coalition Liberals and Unionists agreed that an offer to negotiate would strengthen the Government's position if the revolutionaries refused. Austen Chamberlain, the new leader of the Unionist Party, said that \"the King's Speech ought to be followed up as a last attempt at peace before we go to full martial law\".\n**The IRA mounted an attack on Grafton Street, central Dublin, killing two Auxiliaries.\n*26 June 1921: IRA volunteers in Dublin killed RIC Auxiliary Division William F. H. Hunt (35) in the dining-room of the Mayfair Hotel on Baggot Street. Hunt was from Watford, England and had also been a British Army officer.\n**The Dublin IRA attacked a cricket match involving British soldiers in Trinity College Dublin. One woman spectator was killed in the crossfire.\n*30 June 1921: In Coolacrease, County Offaly (near Cadamstown), Richard Pearson (aged 24) and his brother Abraham (aged 19) were shot in their genitals and buttocks in front of their mother and sisters. It took 14 hours for the two brothers to slowly bleed to death from their groin injuries. The family home was later burned. There are conflicting versions of the incident. Some contend that the two were killed for sectarian reasons and to steal the family's property. Others claim the family were British informers and had fired at an IRA party some days before.\n*June 1921:\n**The Dublin IRA carried out 93 attacks on British forces in the city in the course of the month.\n**A reported deserter, Lt John Watts, is captured and killed by the IRA near Rivertown, County Sligo.\nJuly 1921\n*1 July 1921: Seven-man RIC patrol was ambushed by the IRA; the RIC had 4 casualties-2 wounded and two captured and later shot dead by the IRA in County Sligo.\n*4 July 1921: Local IRA Volunteers joined West Waterford Column under George Lennon in an attack on a Waterford-bound military train. After a fire fight of some fifteen minutes the train smashed through the crossing gates. This was the last engagement between British forces and the Waterford Brigade Flying Column.\n*6 July 1921: Disguised Ulster Special Constabulary officers raided homes at Altnaveigh (near Newry), County Armagh and summarily killed four Catholic civilian men.\n*8 July 1921: IRA volunteer Dennis Spriggs taken from his home in Cork and killed by British forces.\n*9 July 1921:\n**Truce terms were signed in Dublin, to be effective on 11 July.\n**Filling in a trenched area at Kilgobnet, just north of Dungarvan, four civilians were killed when a secretly buried British mine exploded.\n**4 British soldiers (Alfred Cannim, Albert Powell, Harold Daker and Henry Morris) were captured and shot dead at Ellis Quarry, Cork City by the IRA.\n**The IRA mistakenly killed Draper Holmes, a Protestant railway worker, during a reprisal attack in Newry, County Down. The reprisal attack was in response to the four killings at Altnaveigh (see 6 July 1921).\n**IRA Volunteer James McSorley shot to death in an attack by Ulster Special Constabulary near Dunteague, County Tyrone.\n*10 July 1921:\n**Belfast's Bloody Sunday The IRA mounted an ambush in Raglan Street in Belfast, killing two policemen. This sparked an outbreak of ferocious fighting between Catholics and Protestants in west Belfast in which 16 civilians (11 Catholics and 5 Protestants) lost their lives and 161 houses were destroyed. Of the houses destroyed, 150 belonged to Catholics. Four more civilians died in the shooting over the next two days.\n**The IRAs Kerry No. 2 Brigade attacked a British Army patrol in Castleisland, County Kerry; three IRA volunteers and four British soldiers were killed. Three British troops were wounded in the action.\n*11 July 1921: The Truce: Actions commanded by IRA HQ ended outside Northern Ireland at midday under the Truce. Violence in Northern Ireland and unofficial violence in the south and west continue.\n**Mary McGowan, aged 12 was shot and killed as she and her mother crossed the street in front of there home on Derby Street, Belfast. Shots were fired from an Ulster Special Constabulary (USC) armoured car, her mother was also wounded. An inquest jury specified that USC members were responsible for her death.\n*12 July 1921: The IRA shot dead Special Constable Thomas Sturdy at the junction of Dock and North Thomas streets in Belfast. Later that night, the USC took Patrick Milligan and Thomas Millar from their homes (on Dock Lane and New Dock Lane respectively) and shot them dead in the street.\n*July 1921: In County Kildare, an RIC constable was wounded and died of his wounds on 14 September 1922.\nAugust 1921\n*26 August 1921: Workers in Bruree, Limerick seized the Mill they worked in and hoisted the Red flag over the building & hung a banner over the building proclaiming \"Bruree Workers Soviet Mills – We Make Bread Not Profits\". The Soviet lasted until 3 September 1921.\n*27 August 1921: A house in Belfast was bombed by loyalists. Over the next two days, two Protestants are killed by republican snipers.\n*30–31 August 1921: Eighteen people were killed during street battles in Belfast; nine Protestants and nine Catholics.\nSeptember 1921\n*7 September 1921: In a letter to de Valera regarding counties Fermanagh and Tyrone, Lloyd George acknowledged that his government had a very weak case on the issue of \"forcing these two counties against their will\" to be part of Northern Ireland.\n*11 September 1921: De Valera received nationalist delegations from counties Down, Londonderry, Antrim and the city of Belfast who expressed anxiety at partition. Referring to the unionists, one Protestant member of the Belfast delegation (Councillor James Baird - trade unionist and expelled workers' representative) said that \"partition would place power in the hands of those responsible for the pogroms\".\n*15–18 September 1921: There was further riots in Belfast and two Protestants were killed by a sniper.\n*24 September 1921:\n**Speaking in Dundee, Winston Churchill threatened war if the Dáil refused to accept the British offer.\n**During rioting in Belfast, a grenade was thrown at a loyalist mob advancing towards a nationalist area. Two were killed and more than twenty injured.\n*25 September 1921:\n**In Belfast, an IRA volunteer was killed by a loyalist mob; one civilian was killed by a stray RUC bullet; and another civilian was killed by a grenade thrown into his home.\n**Galway Town hall, A dispute between Crown forces and republican stewards at a dance for relief for republican prisoner relief result in shots being fired; a stray bullet killed Lt G.H. Souchen of the 17th Lancers, who is passing by with several others on his way back to camp\nOctober 1921\n*9 October 1921: Large crowds greet the Irish delegation from Dáil Éireann as they arrived in London for negotiations on the Anglo-Irish Treaty.\n*11 October 1921: The first meeting of the British-Irish conference was held. Over the next two months there were seven plenary sessions, 24 sub-conferences and 9 meetings of special committees.\n*From July–October 1921, membership of the IRA's Belfast Brigade had gone from 998 to 1,506. In addition it was bringing in a considerable number of weapons.\nNovember 1921\n*15 November 1921: Tadhg Barry was shot and killed while interned at Ballykinlar Internment Camp in County Down. Barry was a long-time Irish republican, leading trade unionist and alderman on Cork City Council. Barry was shot while waving good bye to departing prisoners.\n*21–25 November 1921: Thirty people (all civilians) were killed during violence in Belfast.\n*28 November 1921: After Westminster decided to hand over responsibility for local government to Stormont, Tyrone County Council pledged its allegiance to Dáil Éireann. Eight smaller public bodies followed. That same day a bill was introduced in Stormont which allowed it to dissolve any local authority. Offices of Tyrone County Council were subsequently raided by the police and their records seized on 2 December 1921. For Fermanagh statement see Partition of Ireland and below - 21 December 1921.\n*30 November 1921:\n**Speaking to the IRA's Mid Clare Brigade, de Valera said \"We know the terrorism, we know the savagery that can be used against us, and we defy it\". He and Cathal Brugha had spent a week reviewing IRA brigades in counties Galway, Clare and Limerick. Preparations were being made in case the negotiations broke down.\n**In the NI Parliament, James Craig blamed Sinn Féin for the recent violence and stated that 700 A-Specials and 5,000 B-Specials would be enrolled immediately. Around this time, Divisional Commissioner of the RIC in the North ordered his men to regard the truce as non-existent.\nDecember 1921\nin December 1921.]]\n*2 December 1921: Two RIC men were killed during a failed escape attempt from Derry Gaol.\n*6 December 1921: Anglo-Irish Treaty was signed between the British Government and the Irish delegation. It was signed in London.\n*9 December 1921: IRA prisoners begin to be released.\n**As internees reach Thurles railway station, a bomb is thrown at the train. Vol. Declan Hurton is injured and later dies of his wounds.\n*10 December 1921:\n**At a meeting of the Supreme Council of the IRB, 11 supported the Treaty and 4 opposed it.\n**In Belfast, nationalist areas came under sustained attack from loyalist gunmen.\n*14 December 1921: Both the British Parliament and Dáil Éireann began to debate the Treaty.\n*16 December 1921: Anglo-Irish Treaty is passed in the British House of Commons (401 support, 58 oppose) and House of Lords (166 support, 47 oppose).\n*17 December 1921: In Belfast, four people were shot dead. Meanwhile, six IRA volunteers were captured in an attempted raid at Balmoral military base, also in Belfast.\n*21 December 1921: Fermanagh County Council passed a resolution that said in part: \"...do direct our Secretary to hold no further communications with either Belfast or British Local Government Departments, and we pledge our allegiance to Dáil Éireann.\"\n*27 December 1921: In Belfast there was a shootout between an RIC patrol and an IRA unit, one RIC constable and one IRA volunteer were killed.\n1922\nJanuary 1922\n*1–2 January 1922: In Belfast, five people were shot dead by snipers.\n*7 January 1922:\n**The Anglo-Irish Treaty was approved by Dáil Éireann (64 support, 57 oppose, 3 do not vote).\n**In Ireland, 328 statutory public bodies endorsed the Treaty; 5 declared against. Curran says 369 elected and other bodies endorsed the Treaty by this date; 14 had declared against.\n*10 January 1922: Arthur Griffith was elected President of Dáil Éireann. De Valera and all anti-Treaty deputies abstained and walked out of the Dáil.\n*12 January 1922: In Belfast, loyalists threw five grenades at groups of Catholic civilians.\n*14 January 1922:\n**In County Tyrone (Northern Ireland) members of the Monaghan Gaelic football team were arrested on their way to a match in Derry. Among them were IRA volunteers, who carried plans to free IRA prisoners from Derry prison.\n**Sixty Pro-Treaty TDs and four unionist MPs (from Trinty College Dublin) met as the \"Southern Parliament\" and set up a Provisional Government. Michael Collins was elected chairman.\n*16 January 1922: Dublin Castle was surrendered to the Provisional Government under the terms of the Treaty.\n*31 January 1922: The first regiment of the Irish National Army was set up in Dublin.\nFebruary 1922\n. ]]\n*1 February 1922: An RIC officer was shot dead in battle with the IRA in Killarney, County Kerry.\n*3 February 1922: Two RIC officers were shot dead after leaving a pub in Lisdoonvarna, County Clare.\n*7–8 February 1922: IRA units crossed the border into Northern Ireland and took 43 Ulster Special Constabulary (USC) officers and prominent loyalists captive in counties Fermanagh and Tyrone. They were to be held as hostages for the Monaghan Gaelic footballers and IRA volunteers who had been arrested in January. Most were taken from their homes. Two trucks of USC officers were also ambushed near Newtownbutler and they were captured after a firefight in which seven of them were wounded. A number of IRA volunteers were also captured during the raids. This operation had been approved by Michael Collins, Richard Mulcahy, Frank Aiken and Eoin O'Duffy. In response, many cross-border roads were sealed-off by the Northern Ireland authorities.\n*9–10 February 1922: A USC platoon was forced to withdraw from Clady, County Tyrone two nights in a row after coming under fire from the IRA. One USC officer was killed.\n*11 February 1922: IRA volunteers stopped a group of armed USC officers on a train in Clones, County Monaghan. Unbeknownst to the Irish Provisional Government, the USC unit had boarded a train which crossed the border on its way from Belfast to Enniskillen (Northern Ireland). The IRA called on the USC men to surrender for questioning, but one of them shot dead an IRA sergeant. This sparked a firefight in which four USC officers were killed and several wounded. Five others were captured. The incident threatened to spark off a major confrontation between North and South, and the British government temporarily suspended the withdrawal of British troops from the South.\n*12–15 February 1922: In Belfast, violence erupted in response to the Clones shootings. See: The Troubles in Ulster (1920–1922) Between 37 and 39 people were killed. This included six children who were killed when loyalists threw a grenade into their school yard. Forty other children were injured in this attack.\n*20 February 1922: 2 British soldiers killed outside village of Bluebell County Dublin; a passing Army Lorry is then attacked by Co A 4th battalion, Dublin IRA. Two additional soldiers in Lorry also killed.\n*22 February 1922: Michael Collins secretly authorised the formation of a specially-paid unit of 70 IRA volunteers (Parkinson says 72, including 12 officers), known as the Belfast City Guard, to protect districts from loyalist attacks. It operated until August 1922, the same month that Collins was killed.\n*26 February 1922:\n**The Anti-Treaty IRA under Ernie O'Malley captured an RIC barracks in Clonmel, County Tipperary, and seized a large number of weapons.\n**It was reported that there had been 80 attacks on the RIC in Southern Ireland since the previous December, resulting in the deaths of 12 officers.\nMarch 1922\n*2 March 1922: The Anti-Treaty IRA smuggled weapons from Germany to Helvic Head, County Waterford.\n*3 March 1922: IRA volunteers ambushed RIC vehicles in Tipperary town, killing two officers.\n*4 March 1922: IRA volunteers under Mick Mansfield seized the RIC barracks in Dungarvan, County Waterford.\n*6 March 1922: In Belfast, four people were shot dead (three civilians and one IRA volunteer).\n*7 March 1922: In Belfast, four people were shot dead.\n*9 March 1922: In Belfast, three people were shot dead.\n*10 March 1922: In Belfast, six people were shot dead (three civilians, two RIC constables, one British soldier).\n*15 March 1922: IRA volunteers shot dead two RIC constables and wounded another at St Brigid's Hospital, Galway.\n*16 March 1922:\n**In the Northern Ireland Parliament, Dawson Bates, (Minister of Home Affairs (Northern Ireland) 1921-1943) declared \"we are at war\" with the IRA.\n**In Belfast, four people were killed and numerous others injured by grenades.\n*18 March 1922: In Belfast, the RIC and Ulster Special Constabulary (USC) raided IRA headquarters, seizing weapons and the names of IRA volunteers. The Irish Provisional Government condemned this as a breach of the truce. Meanwhile, four people were killed in the city.\n*19 March 1922: IRA volunteers raided two RIC barracks in the North, in Maghera and Pomeroy, County Tyrone, seizing rifles and ammunition. In the Pomeroy raid approximately 18 service rifles, 20 service revolvers and a large number of bombs were taken and distributed to the Pomeroy and Carrickmore companies.\n*20 March 1922: IRA volunteers crossed into the North and attacked the USC barracks at Aughnacloy, County Tyrone.\n*21–22 March 1922: IRA volunteers shot dead two RIC men in Trillick, County Tyrone (Northern Ireland); in reprisal, local loyalists shot dead three Catholic civilians.\n*23 March 1922: McMahon Murders – In Belfast, members of the RIC/USC shot dead six members of the Catholic McMahon family at their home. Prior to this incident, six people had been shot dead in Belfast (including two USC constables).\n*24 March 1922: The IRA shot dead an off-duty USC officer while carrying out a bomb attack on the Moyola Bridge at Castledawson, County Londonderry (Northern Ireland).\n*28 March 1922: A column of fifty IRA volunteers crossed into the North and seized the RIC barracks in Belcoo, County Fermanagh (Northern Ireland) after a three-hour battle. Fifteen officers were captured and marched across the border and held until 18 July.\n*29 March 1922:\n**IRA volunteers shot dead two RIC officers in Cullaville, County Armagh (Northern Ireland).\n**IRA volunteers under Seán O'Hegarty seized the British ship Upnor off the coast of Ballycotton, County Cork, taking a large cache of weapons.\n*31 March 1922:\n**In Newry, the IRA ambushed a USC patrol, killing one and wounding another.\n**In Belfast, the IRA killed a USC officer and wounded another. In retaliation, the USC killed four Catholic civilians in the area.\nApril 1922\n*1 April 1922: Arnon Street Massacre – Ulster Special Constabulary officers killed six Catholic civilians in their homes in the Arnon Street area of Belfast as revenge for the IRA having killed a fellow officer.\n*2 April 1922: A force of 500 Ulster Special Constabulary officers carried out a major sweep to arrest suspected IRA members in the Sperrin Mountains between Cookstown, Draperstown and Greencastle (Northern Ireland). Many homes were raided and 300 men were arrested but only four were believed to be IRA members.\n*6 April 1922:\n**Six ex-RIC men were shot dead and six wounded in counties Mayo, Clare and Kerry.\n**The IRA ambushed two Ulster Special Constabulary (USC) patrols in Northern Ireland. A foot-patrol was ambushed near Garrison, County Fermanagh. One USC officer was killed and three wounded by machine gun fire. Another was ambushed at Roughan's Cross, County Armagh, resulting in the death of a USC Head Constable.\n*12 April 1922: Dún Laoghaire; Two British Privates are loading furniture in a car; one armed with a rifle is ordered by a man to put up his hands; he is then shot and mortally wounded\n*13 April 1922:\n**In Belfast, IRA volunteers shot dead two RIC men.\n**In New York, IRA volunteers from Cork shot and wounded a suspected informer.\n**The Anti-Treaty IRA under Rory O'Connor took over the Four Courts building in Dublin sparking a new armed confrontation with British forces.\n*19 April 1922: In Belfast, four people were shot dead and many others injured.\n*21 April 1922:\n**In Belfast, six people were killed. Fr Bernard Laverty (chair of the Belfast Catholic Protection Committee) sent a telegram to Winston Churchill saying that Catholics were \"being gradually but certainly exterminated\".\n**The Ulster Council of the IRA met in Clones and agreed that every division with territory inside Northern Ireland would carry out operations in two weeks. Author Jim McDermott says Collins sanctioned this policy. He goes on to say that \"The aim of the new campaign was to make the government of the six counties as difficult as possible, rather than the overthrow of the state\".\n*24 April 1922: A general strike took place, called by the Labour Party (and supported by 75,000 workers) against the prospect of civil war.\n*26 April 1922: The Provisional Government's Northern Advisory Committee met and urged Collins to restart IRA operations in Northern Ireland by 2 May if Craig did not accede to his three demands. At this time, Collins was preparing for a major Northern offensive (without the knowledge of his cabinet colleagues). Northern IRA staff were paid as part of the pro-Treaty army and supplied with arms from anti-Treaty divisions after Collins negotiated this with Liam Lynch.\n*26–28 April 1922: Dunmanway Massacre: After the fatal shooting of a local anti-Treaty IRA officer, Michael O'Neill, in a dispute over a car which the IRA wanted to commandeer, elements of the local IRA shot 14 local Protestant men in and around Dunmanway, County Cork, killing all but one, in revenge.\n*28 April 1922: 3 British officers, their army driver and a Newfoundland dog on a hunting trip are captured at Dick William Hotel at Macroom, County Cork by the IRA. The next day all four men and the dog are shot at Kilgobnet.\nMay 1922\n*2 May 1922: The IRA launched a series of attacks on RIC barracks in counties Londonderry and Tyrone, Northern Ireland. One RIC officer was killed and one wounded in an attack on Bellaghy barracks. An IRA volunteer was also killed and three captured. Draperstown and Coalisland barracks were also attacked.\n*3 May 1922:\n**Two Catholic civilian men were shot dead on a road outside Coalisland, allegedly by Ulster Special Constabulary officers.\n**Three USC officers were shot dead by the IRA in Ballyronan, County Londonderry. Another was killed in an ambush of a mobile patrol at Corvanaghan, County Tyrone.\n**The IRA ambushed a USC patrol at Annaghmore, County Armagh, killing one officer. The IRA had attacked the home of a USC officer to draw the patrol into the ambush.\n*6 May 1922:\n**The IRA ambushed a USC group at Trew and Moy railway station, County Tyrone. No casualties were reported.\n**Two Catholic civilian men were shot dead at a house at Cluntygeeragh, near Dungiven, County Londonderry. It is believed the USC were responsible.\n*8 May 1922: The IRA attacked the homes of three unionists in Castlecaulfield, County Tyrone. The owners returned fire but a USC officer and another man were killed.\n*11 May 1922: USC officers shot three Catholic brothers of the McKeown family at their home in Ballyronan, killing James McKeown Jr.\n*12 May 1922: Dublin: Two unarmed gunners of the Royal Garrison artillery are held up by two men armed with a pistol; one demands a bandolier. When one gunner asks for a receipt for stolen item he is given it but then shot and mortally wounded\n*18 May 1922:\n**The IRA's new Northern offensive began. Twenty Belfast IRA volunteers, under Roger McCorley, attacked Musgrave Street RIC barracks and seized weaponry. Two RIC officers were shot, one fatally. A number of IRA volunteers were also wounded. The IRA attacked other RIC barracks, commercial buildings, railway stations and stately homes.\n**Loyalists boarded a tram in central Belfast and killed three workers whom they identified as Catholics. The next day, IRA volunteers entered Garret's cooperage on Little Patrick Street in Belfast and shot four Protestant workers in retaliation, killing three.\n*19 May 1922:\n**In revenge for the burning of a unionist-owned mill, a mob of Ulster Special Constabulary (USC) officers and loyalists attacked and burned many Catholic homes and businesses in Desertmartin, County Londonderry. USC officers took four Catholic men from their homes outside the village and summarily killed them.\n**The IRA attacked Martinstown RIC barracks in County Antrim with gunfire and grenades. They also ambushed a group of USC reinforcements, killing one. Three weeks later, a Catholic civilian was shot dead by USC officers at his home in nearby Cloughmills, apparently in revenge.\n*22 May 1922: Unionist MP William Twaddell was assassinated by the IRA in Belfast city centre. The unionist government of Northern Ireland introduced internment in response and arrested up to 350 republican suspects. A total of 724 people were interned in Northern Ireland up to the end of 1924.\n*24 May 1922:\n**There were lengthy gun battles between loyalists and republicans on the Falls Road in Belfast. Three people were killed and 20 wounded.\n**Two IRA volunteers were killed in a firefight with USC officers in Glenariff, County Antrim.\n*26 May 1922: The IRA planted seven bombs at the Protestant Model School on Divis Street in Belfast, destroying the school, but causing no casualties.\n*26–27 May 1922: The IRA carried out several attacks in south County Armagh, killing a USC officer in the Jonesborough/Forkhill area.\n*28 May 1922: An IRA unit of 100 men occupied Pettigo, just on the Northern side of the border, sparking a firefight with a group of 100 USC officers, in which one USC man was killed. A battalion of British troops and an artillery battery of six field guns was then mobilised to dislodge the IRA party.\n*31 May 1922: IRA volunteers shot dead a USC officer in central Belfast and wounded another. That night, nine Catholics were killed by loyalists and USC men in the city. At least one Protestant civilian was also killed.\n*May 1922: A total of 75 people were killed in Belfast during the month. Many refugees from Belfast go South.\nJune 1922\n*1 June 1922:\n**The new Royal Ulster Constabulary (RUC) took over policing in Northern Ireland.\n**Fighting between the IRA and USC took place around Pettigo. Two civilians were killed in the crossfire.\n*4 June 1922: The IRA shot dead a magistrate at Newry Cathedral.\n*6 June 1922: A USC officer was killed by a sniper near Caledon, County Tyrone.\n*7 June 1922: British troops re-took Pettigo and Belleek with the help of artillery. Seven IRA volunteers were killed, six wounded and four captured. Another 50 IRA volunteers were later captured. The remainder made it back across the border. One USC officer died in the engagement.\n*13 June 1922: USC officers took two Catholic civilian men from their homes in south County Armagh and shot them dead near Lislea.\n*17 June 1922: IRA volunteers under Frank Aiken retaliated for the killing of the two Catholic men and the sexual assault of a Catholic woman in south County Armagh. A group of fifty IRA volunteers ambushed a USC patrol at Drumintee, killing two. Another IRA group attacked nine Protestant homes and shot dead six Protestant civilians at Altnaveigh.\n*20 June 1922: Two USC officers were killed in an ambush at Derrynoose, County Armagh.\n*22 June 1922: British General Sir Henry Wilson, who had been a military adviser to the Northern Ireland government, was shot dead at his home in London by IRA volunteers Reginald Dunne and Joseph O'Sullivan, purportedly in reprisal for attacks against Catholics in Ulster; two policeman and a passerby were also wounded. The two IRA volunteers were captured and hanged on 10 August 1922.\n*23 June 1922: A group of USC officers and British soldiers opened fire on civilians in the mainly-Catholic village of Cushendall, County Antrim. USC officers summarily killed three young Catholic men. They claimed they were ambushed by the IRA and returned fire, but a British government inquiry concluded that this was not true. The report was not made public for almost a century.\n*28 June 1922: Fighting broke out in Dublin between pro- and anti-Treaty units of the IRA. This marked the start of the Irish Civil War, which effectively ended serious violence in Northern Ireland as it distracted attention from the continued British presence there.\n*30 June 1922: A British army truck is fired upon in Dublin; One RAF Private mortally wounded.\nAugust 1922\n*30 August 1922: A British lieutenant found dead in Dublin, shot by person or persons unknown; 2 additional British soldiers killed.\nSee also\n*Timeline of the Irish Civil War\nReferences\n*Tom Barry, Guerilla Days in Ireland, Anvil, Cork 1981.\n*Richard Abbott, Police Casualties in Ireland, 1919-1922, Mercier Press, Dublin 2000.\n*M.E. Collins, Ireland 1866-1966, Educational Company of Ireland, Dublin 1993.\n*T. Ryle Dwyer, The Squad and the Intelligence Operations of Michael Collins, Mercier Press, Dublin 2005.\n*Michael Hopkinson, The Irish War of Independence, Gill & MacMillan, Dublin 2004.\n*Toby Harnden, Bandit country, The IRA and South Armagh, Hodder & Stoughton, London, 1999.\n*Jim McDermott, Northern Divisions: The Old IRA and the Belfast Pogroms 1920-22, Beyond the Pale Publications, Belfast, 2001.\n*David Leeson, \"Death in the Afternoon: The Croke Park Massacre, 21 November 1920\", Canadian Journal of History, vol 38, no. 1 (April 2003).\n*Eunan O'Halpin & Daithí Ó Corráin, The Dead of the Irish Revolution. Yale University Press, London, 2020.\n*Ernie O'Malley, Raid and Rallies, Anvil Books, Dublin 1982.\n*Alan F Parkinson, ''Belfast's Unholy War, Four Courts Press, Dublin 2004.  hbk\n*Robert Lynch, The Northern IRA and the Early Years of Partition'', Irish Academic Press, Portland Oregon, 2006.\nFootnotes\nExternal links\n* [https://web.archive.org/web/20100310060013/http://www.warofindependence.net/ War of Independence: Clare and Galway]\n* [https://web.archive.org/web/20131212004410/http://www.dcu.ie/~foxs/irhist/index.htm Chronology of Irish History, 1919-1923]\n* [http://www.policememorial.org.uk/Forces/IRELAND/RIC_Roll.htm RIC Memorial Roll 1837-1922]\n* [http://homepage.eircom.net/~corkcounty/index.html Cork's War of Independence]\n* [https://web.archive.org/web/20090823075636/http://archives.tcm.ie/kildarenationalist/2007/08/09/story26078.asp Killdare and the War of Independence]"
    }
  ]
}