{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Champa\n\nThis is a timeline of the history of the Kingdom of Champa and its people–the Cham–an Austronesian-speaking ethnic group in Southeast Asia.\nNeolithic\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1000 BC || || Austronesian Chamic people migrated to Hue, Central Vietnam coast and forged a metal-age culture in Sa Huỳnh.\n|}\nChinese rule\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 111 BC || || Han conquest of Nanyue\n|-\n| AD 100 || || People of Xianglin county revolted against the Chinese Han dynasty and destroyed Han administration buildings.\n|-\n| 136 || || Xianglin inhabitants revolted against the Han dynasty.\n|-\n| 144 || || Xianglin revolt spread to the Red River Delta and was suppressed.\n|-\n| 192 || || Cham leader Khu Liên led a successful revolt against the Chinese Han dynasty. Khu Liên found the kingdom of Lâm Ấp, allegedly the first Cham state.\n|}\nFrom 3rd to 15th centuries\n3rd century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 220 || || Phạm Hùng became King of Lâm Ấp.\n|-\n| 248 || || Lâm Ấp attacked Jiaozhou and provoked a rebellion in Jiuzhen.\n|-\n| 270 || || Phạm Hùng raided Jiaozhou with aid from king of Funan Fan Hsün.\n|-\n| 284 || || Phạm Dật became king of Lâm Ấp and sent the first mission to Imperial China.\n|-\n| 286 || || Kingdom of Quduqian sent an envoy to the Jin dynasty\n|}\n4th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 336 || || The chief minister of Phạm Dật, Phạm Văn (Fan Wen) became king. Phạm Văn was a Chinese man who was being sold as a slave to Champa when he was a child.\n|-\n| 340 || || Phạm Văn pacified barbarian tribes and sent a mission to Imperial China.\n|-\n| 347 || || Phạm Văn seized part of Rinan south of the Hoành Sơn mountain.\n|-\n| 349 || || Phạm Phật (Fan Fo) succeeds his father Phạm Văn, who died in early that year.\n|-\n| 351–359 || || Phạm Phật launched several incursions on the Chinese province of Jiaozhou.\n|-\n| 372 || || Phạm Phật sent mission to China.\n|-\n| 380 || || Phạm Phật was succeeded by his son Phạm Hồ Đạt (Fan Huda), who was supposedly Bhadravarman I.\n|-\n| 399 || || Fan Huda launched an invasion of Rinan, but was driven back by the Chinese governor Du Yian.\n|}\n5th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 405 || || Cham raided Rinan.\n|-\n| 413 || || Fan Huda launched another invasion on Rinan, but was defeated and beheaded by Du Xuedu.\n|-\n| 413 || || Gangaraja pilgrimed to the Ganges River, India.\n|-\n| 420 || || The new king of Lâm Ấp, Phạm Dương Mại I attacked the Jin dynasty, but suffered a defeat. Half of Lâm Ấp's population was massacred.\n|-\n| 431 || || Phạm Dương Mại II attacked Jiaozhou but was driven back.\n|-\n| 432 || || Phạm Dương Mại II requested the Liu Song court for the chairman of the Prefect of Jiao.\n|-\n| 446 || May || Liu Song dynasty invaded Lâm Ấp, besieged the Cham capital of Kandarapura, sacked the city, killed the Cham king, and looted 100,000 pounds of gold.\n|-\n| 456 || || Son of Phạm Dương Mại II, Fan Chen-ch'eng, sent embassy to China.\n|-\n| late 5th century || || Lâm Ấp's economy flourished.\n|-\n| ~ 480 || || The throne of Lam Ap was usurped by a man named Fan Dānggēnchún/Jiū Chóuluó with help of rebels. Fan Dānggēnchún received support from the Chinese.\n|-\n| 484 || || King of Funan Jayavarman Kaundinya requested the Chinese Qi empire to launch a punitive expedition against Linyi.\n|}\n6th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 529 || || Bicuibamo died. A descendant of Gangaraja named Rudravarman became king.\n|-\n| 530 || || Rudravarman sent mission to the Liang dynasty.\n|-\n| 541 || || Rudravarman attacked the Jiǔdé/Cửu Đức province (today Hà Tĩnh).\n|-\n| 544 || || Pham Tu, a general of Ly Bon, defeated Rudravarman.\n|-\n| 572 || || Rudravarman died. Sambhuvarman became king of Lâm Ấp.\n|-\n| 595 || || Sambhuvarman sent an embassy to the emperor of new unified Sui China.\n|}\n7th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 600 || || Sambhuvarman constructed the Bhadresvara temple of Mỹ Sơn and a new sanctuary called Sambhubhadresvara.\n|-\n| 605 || || Sino–Cham war: Chinese general Liu Fang invaded Lâm Ấp and overcame Sambhuvarman's army; Cham capital Simhapura was sacked; Lâm Ấp was briefly occupied into three Chinese counties; Liu Fang died of disease during withdraw.\n|-\n| 623 || || Sambhuvarman reasserted Cham independence and sent a mission to the new Tang Empire.\n|-\n| 629 || || Sambhuvarman died and was succeeded by his son Kandarpadharma. Since then, Chams have used Champa to refer to their state.\n|-\n| 631 || || Kandarpadharma sent missions to the Tang.\n|-\n| 640 || || Prabhasadharma became king of Champa and sent mission to the Tang.\n|-\n| 645 || || Prabhasadharma was assassinated by his minister.\n|-\n| 646 || || Prince Bhadreśvaravarman fled to Cambodia while the throne was occupied by a minister.\n|-\n| 650 || || A sister of Prabhasadharma, princess (Daughter of Kandarpadharma) became ruler of Champa.\n|-\n| 653 || || Prakasadharma, a son of a Cham prince named Jagaddharma (grandson of Kandarpadharma) and Khmer princess  Sarväni (daughter of Isanavarman I of Chenla), ascended the throne of Champa as Vikrantavarman I.\n|-\n| 658–669 || || Cham territories expanded to the south.\n|-\n| 667 || || Cham envoy to Cambodia.\n|-\n| 686 || || Vikrantavarman II became king of Champa.\n|}\n8th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 722 || || Champa and Chenla assisted Mai Thúc Loan's rebellion against the Tang Empire.\n|-\n| 740 || || The Simhapura dynasty interrupted and vanished with no available explanation.\n|-\n| 749 || || The last Lâm Ấp envoy to the Tang Empire.\n|-\n| 757 || || Prithindravarman became king of Champa.\n|-\n| 770 || || Satyavarman became king of Champa.\n|-\n| 774 || || Javanese raiders pillaged and destroyed the Po Nagar temple in Nha Trang.\n|-\n| 784 || || Satyavarman restored and rebuilt the temple.\n|-\n| 787 || || Satyavarman's younger brother, Indravarman, became king of Champa. Javanese raiders destroyed Bhadrädhipatisvara Temple in Phan Rang.\n|-\n| 793 || || Indravarman sent a mission to China.\n|-\n| 799 || || Indravarman driven off the Javanese and restored the temple of Bhadrädhipatisvara.\n|}\n9th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 802 || || Harivarman I became king of Champa.\n|-\n| 803 || || Harivarman I attacked the Chinese protectorate of Annan.\n|-\n| 804 || || The Senäpati Par launched incursion on Khmer Empire.\n|-\n| 818 || || Vikrantavarman III succeeded Harivarman I.\n|-\n| 875 || || Indravarman II became the king of kings and relocated the capital to Indrapura. Mahayana Buddhism was evaluated as the state religion; Indravarman built the great Buddhist complex of Lakshmindralokesvara in Đồng Dương.\n|-\n| 889 || || Khmer ruler Yasovarman I led an invasion of Champa, but was repelled by Indravarman II.\n|-\n| 890 || || Indravarman II died and was succeeded by his nephew Jaya Simhavarman I.\n|}\n10th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 904 || || Saktivarman, son of Simhavarman, became king of Champa.\n|-\n| 905 || || Prince Bhadravarman II became king of Champa.\n|-\n| 918 || || Bhadravarman's son Indravarman III became king of Champa.\n|-\n| 950 || || Khmer–Cham wars: Indravarman III defeated a Khmer invasion of Nha Trang.\n|-\n| 958 || || Indravarman III's envoy Abu'l Hassan brought petrol bombs from Champa to the Chinese Later Zhou court as tribute.\n|-\n| 960 || || Jaya Indravarman I became king of Champa.\n|-\n| 965 || || Jaya Indravarman I restored the temple of Po Nagar which previously plundered by the Khmer.\n|-\n| 967 || || Ngô Nhật Khánh, a Vietnamese prince and grandson of Ngô Quyền, fled to Champa.\n|-\n| 971 || || An Arab named Ali Nur became the deputy king of Champa.\n|-\n| 972 || || Paramesvaravarman I became king of Champa and kept a close relationship with the Song dynasty\n|-\n| 979 || || Paramesvaravarman I and Ngô Nhật Khánh led a fleet to attack Dai Viet after its king Dinh Bo Linh was assassinated. The invasion however was stopped by a typhoon; Ngô Nhật Khánh was drowned and abandoned.\n|-\n| 980 || || The new Viet ruler, Le Hoan, sent embassy to Champa to establish relationship. However, Paramesvaravarman arrested the envoys.\n|-\n| 982 || || Cham–Vietnamese War (982): Le Hoan launched a naval invasion that killed Paramesvaravarman and destroyed much of the capital Indrapura then withdrew.\n|-\n| 983 || || A Viet official in the Cham government name Lưu Kế Tông seized the power in Indrapura and successfully resisted Le Hoan's attempt to remove him.\n|-\n| 986 || || Indravarman IV died. Lưu Kế Tông proclaimed as king of Champa and sent a mission to China to seek international recognition. Thousands of Cham and Muslims fled the country.\n|-\n| 988 || || The Cham populace protested against Lưu Kế Tông by enthroning a Cham native in Vijaya.\n|-\n| 989 || || Lưu Kế Tông died and the Cham leader in Vijaya was known as Harivarman II, the seventh dynasty of Champa began.\n|-\n| 999 || || Harivarman II's reign ended.\n|}\n11th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1007 || || Harivarman III became king of Champa\n|-\n| 1008 || || Civil war broke out in Champa, Harivarman III defeated the rebels.\n|-\n| 1018 || || An unknown king ruling the kingdom\n|-\n| 1020 || || Cham army clashed with Vietnamese prince Lý Phật Mã in modern-day northern Quảng Bình Province.\n|-\n| 1030 || || Vikrantavarman IV allegedly became king of Champa\n|-\n| 1041 || || Vikrantavarman IV's son Simhavarman II was enthroned.\n|-\n| 1042 || || Simhavarman II sent a mission to China to request investiture.\n|-\n| 1043 || || Simhavarman II raided the coast of Dai Viet.\n|-\n| 1044 || || Lý Thái Tông led a sea attack on the Cham city of Kandarapura. Simhavarman II resisted the invaders but was slain. The Vietnamese then plundered the Cham capital Vijaya and took away the royal family and national treasures.\n|-\n| 1050 || || The new Cham king Jaya Paramesvaravarman I sent his nephew Mahäsenäpati to suppress a revolt in Pänduranga. To satisfy the southern populace, Paramesvaravarman restored the Po Nagar temple and provided them slaves from Cambodia, China, Burma, and Siam.\n|-\n| 1060 || || Bhadravarman III became king of Champa.\n|-\n| 1061 || || Rudravarman III became king of Champa.\n|-\n| 1062 || || Rudravarman III sent a mission to the Song court.\n|-\n| 1068 || || Rudravarman III sent a mission led by Abu Mahmud to the Song court; Rudravarman III attacked Dai Viet; Lý Thánh Tông responded by launching a new seaborne campaign on Champa.\n|-\n| rowspan=\"2\" valign=\"top\" | 1069 || Spring || Vietnamese raiders led by Lý Thánh Tông besieged Vijaya and ransacked the city; Chế Củ (supposedly Rudravarman) fled to Cambodia.\n|-\n| April || Chế Củ was taken as a prisoner in Cambodian territory. After exchanging for three northern provinces to the Viets, the Cham king was spared.\n|-\n| 1069–1074 || || Civil war exploding in Champa; Rudravarman III was deposed by rebels; more than ten warlords proclaimed themselves king of Champa.\n|-\n| 1074 || || Prince Thäng destroyed all opposite factions, becoming king Harivarman IV and found the Harivarmanid dynasty.\n|-\n| 1075 || || Harivarman IV repulsed a Vietnamese raid.\n|-\n| 1077 || || Harivarman IV made peace with Dai Viet.\n|-\n| 1080 || || Khmer–Cham wars: The Khmers attacked Champa, but was repelled. Harivarman IV restored numerous temples while organizing raids penetrating Cambodia as far as Sambor and the Mekong. Nine-year-old Prince Vak was crowned as Jaya Indravarman II.\n|-\n| 1081 || || Jaya Indravarman II's uncle Pang became Paramabhodhisatva.\n|-\n| 1086 || || Paramabhodhisatva was overthrown by Jaya Indravarman II.\n|}\n12th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1103 || || A Vietnamese encouraged Indravarman II to retake three northern provinces. The campaign went successful at first, however, Indravarman II was able to hold them in several months.\n|-\n| 1114 || || Harivarman V became king of Champa.\n|-\n| 1132 || || Khmer–Vietnamese war (1123–1150): Khmer Empire and Champa launched naval attack on Dai Viet, briefly seized Nghe An, pillaged the coastal of Thanh Hoa.\n|-\n| 1139 || || Khmer–Cham wars: An adopted son of Harivarman V became king Jaya Indravarman III. He refused to cooperate with the Khmers.\n|-\n| 1145 || || Khmer–Cham wars: Suryavarman II invaded and annexed Champa. Rudravarman IV from Pänduranga became the puppet monarch of the Khmers, but then fled.\n|-\n| 1147 || || Khmer–Cham wars: Prince Sivänandana, son of Rudravarman IV, returned to Champa and proclaimed king of Champa. He took the reign name Jaya Harivarman I.\n|-\n| 1148 || || Khmer–Cham wars: Jaya Harivarman I inflicted a defeat on Khmer force.\n|-\n| 1149 || || Khmer–Cham wars: Jaya Harivarman I and the Chams retook the capital Vijaya from the Khmer.\n|-\n| 1150 || || Jaya Harivarman I's brother-in-law Vamsaräja rebelled against him. Vamsaräja mobilized 5,000 Vietnamese troops and attacked Harivarman in Quang Nam, but were defeated.\n|-\n| 1151 || || Jaya Harivarman I recaptured Amarävati.\n|-\n| 1160 || || Jaya Harivarman I recaptured Pänduranga from rebels.\n|-\n| 1166 || || Jaya Harivarman II became king of Champa.\n|-\n| 1167 || || Jaya Indravarman IV became king of Champa, and sent a mission to Southern Sung court.\n|-\n| 1170 || || Jaya Indravarman IV made peace with Dai Viet\n|-\n| 1177 || || Khmer–Cham wars: Jaya Indravarman IV led a surprising invasion of Angkor through the Mekong. Cham forces defeated the Khmer forces at Battle of Tonlé Sap and killed Khmer ruler Tribhuvanāditya. Angkor was sacked.\n|-\n| 1181 || || Khmer–Cham wars: Jayavarman VII of Cambodia liberated the country and ousted the Cham invaders.\n|-\n| 1190 || || Khmer–Cham wars: Jayavarman VII invaded Champa and made it a vassal with Vidyanandana as client king.\n|-\n| 1191 || || Khmer–Cham wars: Cham revolted against Khmer rule. The northern king Jaya Indravarman oṅ Vatuv hailed from Quang Binh and drove the Khmer out of Vijaya.\n|-\n| 1193 || || Khmer–Cham wars: Vidyanandana defeated Jaya Indravarman oṅ Vatuv, then declared himself Suryavarman of independent Champa.\n|-\n| 1193, 1195, 1198–1199, 1201-1203 || || Khmer–Cham wars: Jayavarman VII invaded Champa but met fierce resistance from Suryavarman.\n|}\n13th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1203 || || Khmer–Cham wars: Jayavarman VII finally defeated the Chams, sent Vidyanandana to exile and turned Champa into a Khmer province.\n|-\n| 1220 || || Khmer rule of Champa ended voluntarily. Jaya Paramesvaravarman II became king of independent Champa.\n|-\n| 1252 || || The new king of Dai Viet, Tran Thai Tong attacked Champa and took Queen Bo-da-la and Cham concubines as prisoners.\n|-\n| 1254 || || Jaya Indravarman VI became king of Champa.\n|-\n| 1257 || || Indravarman VI was assassinated by his nephew Indravarman V, who would become king of Champa.\n|-\n| 1278 || || Indravarman V was asked to be present in the court of Kublai's Yuan Empire, but he refused.\n|-\n| 1282 || December || Kublai sent Sogetu leading the invasion of Champa.\n|-\n| rowspan=\"4\" valign=\"top\" | 1283 || February || Mongol invasion of Champa: Yuan fleet anchored the coast of Champa.\n|-\n| 13 February || Battle of Thị Nại Bay: Yuan army defeated Cham army.\n|-\n| 17 February || Mongol invasion of Champa: Yuan forces captured Vijaya; Indravarman V and Prince Harijit withdrew to highlands, the Chams waged guerrilla resistance against the Yuan occupation.\n|-\n| 16 March || Mongol invasion of Champa: Cham forces ambushed and inflicted heavy casualties on the Yuan.\n|-\n| 1284 || March || Mongol invasion of Champa: Yuan reinforcements led by Ataqai and Ariq Qaya arrived Champa to assist Sogetu.\n|-\n| rowspan=\"3\" valign=\"top\" | 1285 || February || Second Mongol invasion of Dai Viet: The Mongols advanced to the north to campaign against the Vietnamese; Champa launched counteroffensives.\n|-\n| 24 June || Battle of Chương Dương: Cham–Vietnamese forces defeated the Yuan at Chương Dương port; Sogetu was killed in battle and decapitated; destruction of the Yuan army.\n|-\n| 6 October || Indravarman V sent an ambassador to Kublai and then died afterward.\n|-\n| 1288 || || Prince Harijit became king Jaya Simhavarman III of Champa.\n|}\n14th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1306 || || Simhavarman III married with Vietnamese queen Paramesvari, king Trần Anh Tông's younger sister as he ceded two provinces O and Ly to Dai Viet. He built Po Klaung Gara temple in Phan Rang and Yang Prong temple in Dak Lak.\n|-\n| 1307 || May || Simhavarman III died, but Paramesvari refused to die with him. Jaya Simhavarman IV became king of Champa.\n|-\n| 1312 || || Simhavarman IV set out to recapture the two provinces but failed. Trần Anh Tông sent army and took Simhavarman IV as a prisoner to Tonkin where he died in next year. His brother Chế Năng became Dai Viet vassal king.\n|-\n| 1313 || || Siamese raiders from Sukhothai Kingdom attacked Champa but were fend off by Dai Viet.\n|-\n| 1314 || || Chế Năng rebelled against Trần Anh Tông.\n|-\n| 1318 || || Chế Năng was defeated and then took refuge in Java. The Vietnamese placed a man named Jaya Ananda as client king of Champa.\n|-\n| 1326 || || Ananda regained independence of Champa from the Vietnamese. Odoric of Pordenone visited Champa.\n|-\n| 1342 || || Ananda died and his brother-in-law Maha Sawa became king while legitimate crown prince Che Mo went to Dai Viet to seek help, but failed.\n|-\n| 1345 || || Ibn Battuta visited Champa.\n|-\n| 1360 || || Po Binasuor (Chế Bồng Nga) became king of Champa. He reunited the Chams and strengthened the kingdom.\n|-\n| 1368 || || Cham–Vietnamese War (1367–1390): Cham troops defeated a Vietnamese army in modern-day Quang Nam.\n|-\n| 1369 || || The emperor of China recognised Po Binasuor as king of Champa.\n|-\n| 1371 || || Cham–Vietnamese War (1367–1390): Po Binasuor led a naval invasion that sacked Hanoi.\n|-\n| rowspan=\"2\" valign=\"top\" | 1377 || Spring || Battle of Vijaya: Po Binasuor defeated and killed king Trần Duệ Tông in Vijaya.\n|-\n| Winter || Cham–Vietnamese War (1367–1390): Cham forces sacked Hanoi second time.\n|-\n| 1378 || || Cham–Vietnamese War (1367–1390): Cham forces sacked Hanoi third time.\n|-\n| rowspan=\"2\" valign=\"top\" | 1383 || Summer || Cham–Vietnamese War (1367–1390): Po Binasuor launched a mountain offensive that routed the Vietnamese forces.\n|-\n| Autumn || Cham–Vietnamese War (1367–1390): Cham troops ransacked Hanoi fourth time.\n|-\n| 1389 || || Cham–Vietnamese War (1367–1390): Cham army advanced to the Red River Delta.\n|-\n| rowspan=\"2\" valign=\"top\" | 1390 || February || Cham–Vietnamese War (1367–1390): Po Binasuor and the Cham army were surrounded and defeated on Hải Triều River; ended the Cham–Vietnamese war.\n|-\n| || Po Binasuor's general La Khai withdrew the Cham remnant to Vijaya and abandoned most of Po Binasuor's reconquered territories; La Khai became king Simhavarman VI of Champa.\n|-\n| 1400 || || Simhavarman VI died, his son Ngauk Klaung Vijaya became king Virabhadravarman of Champa.\n|}\n15th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1402 || || The new king of Dai Viet, Hồ Hán Thương made war with Champa and forced Virabhadravarman to ceded Amaravati to Dai Viet.\n|-\n| 1403 || || Hồ Hán Thương besieged Vijaya (Vietnamese chronicles) /or raided the Cham countryside (Ming Shilu).\n|-\n| 1407 || || Ming Empire conquered Dai Viet. The province of Amaravati was returned to Champa.\n|-\n| 1409 || || Virabhadravarman-Indravarman VI established the city of Samṛddhipurī.\n|-\n| 1421 || || Virabhadravarman-Indravarman VI annexed the eastern half of the Mekong Delta.\n|-\n| 1428 || || Virabhadravarman reestablished peaceful relations with the Vietnamese ruler Le Loi.\n|-\n| 1432 || || Virabhadravarman changed his name to Indravarman VI.\n|-\n| 1441 || || Indravarman VI died; one of his nephews, prince Śrīndra-Viṣṇukīrti Virabhadravarman, ascended the throne; succession troubles led to civil war.\n|-\n| 1445 || Winter || The regents of Dai Viet attacked Champa and installed prince Maha Kali as a puppet king.\n|-\n| 1449 || || Maha Kali was murdered by his elder brother Maha Kaya.\n|-\n| 1458 || || Maha Saya became king of Champa.\n|-\n| 1460 || || Maha Sajan became king of Champa.\n|-\n| 1470 || November || Cham–Vietnamese War (1471): Maha Sajan commanded 100,000 troops and attacked Vietnamese garrisons at Huế, former Cham land.\n|-\n| rowspan=\"4\" valign=\"top\" | 1471 || February 18 || Cham–Vietnamese War (1471): Vietnamese forces led by king Lê Thánh Tông laid siege of Vijaya.\n|-\n| 22 February || Cham–Vietnamese War (1471): Vijaya fell; king Maha Sajan, Cham royal family, a fendedan  and 30,000 people were taken as prisoners and deported to the north.\n|-\n| 1 March || A Cham general named Jayavarman Mafoungnan fled to Phan Rang; Cham refugees escaped to Cambodia, Malaysia and Indonesia en masse.\n|-\n| 7 March || Jayavarman Mafoungnan submitted to Thánh Tông; ending the independent Kingdom of Champa.\n|}\nPanduranga–Trấn Thuận Thành\n16th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1509 || || Thousands of Cham slaves in Hanoi were massacred by king Lê Uy Mục.\n|-\n| 1526 || || Cham rump state Panduranga stopped paying tribute to Dai Viet court.\n|-\n| 1543 || || The last diplomatic relation between China and Champa.\n|-\n| 1578 || || Panduranga attacked Nguyen Hoang's territories.\n|-\n| 1585 || || Champa became a Muslim nation, according to Spanish report.\n|-\n| 1594 || || Panduranga sent troops to aid Johor Sultanate fight against the Portuguese.\n|}\n17th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1611 || || Panduranga attacked the Vietnamese in Phu Yen, but was beaten by lord Nguyen Phuc Nguyen. Kauthara became Vietnamese territories.\n|-\n| 1627 || || Po Rome–the first Cham mountain sovereign. Po Rome opened for trade with the Dutch.\n|-\n| 1653 || || Po Nraup raided Phu Yen. Lord Nguyễn Phúc Tần launched a counterattack and captured Po Nraup.\n|-\n| 1692 || || Lord Nguyễn Phúc Chu invaded Panduranga, created Bình Thuận district within Panduranga made it free land for ethnic Vietnamese.\n|-\n| 1693 || December || Chams revolted against Vietnamese rule.\n|-\n| 1697 || || Nguyễn Phúc Chu decided to abolish the Bình Thuận district, granting Cham ruler autonomy and set up the so-called Principality of Thuận Thành while encouraging Viet settler colonialism.\n|}\n18th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1700 || || Thousands of Cham Muslim refugees took asylum in tolerant Principality of Hà Tiên.\n|-\n| 1712 || || Cham–Nguyen treaty of vassalage signed. Nguyen military outposts were set up in Panduranga.\n|-\n| 1728 || || Cham revolted against the Nguyen.\n|-\n| 1746 || || Cham revolted against the Nguyen.\n|-\n| 1750 || || First Cham settlement in lower Mekong established by lord Nguyễn Phúc Khoát.\n|-\n| 1775 || || Chams joined the Tayson rebellion against Nguyen lord.\n|-\n| 1794 || || Nguyen loyalists recaptured Panduranga; pro-Tayson Cham ruler Po Tisuntiraidapuran was executed and replaced with pro-Nguyen ruler Po Ladhuanpuguh.\n|-\n| 1795 || || Cham anti-Nguyen revolt.\n|-\n| 1799 || || Nguyen Anh installed pro-Nguyen Po Saong Nyung Ceng as ruler of Panduranga.\n|}\n19th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1822–1823 || || Cham leader Ja Lidong revolted against Vietnamese rule.\n|-\n| 1826 || || Anti-Viet Nduai Kabait rebellion was brutally suppressed.\n|-\n| 1829 || || Governor Lê Văn Duyệt approved Po Thak The as king of Champa.\n|-\n| 1832 || August || Minh Mang of Vietnam annexed Panduranga and abolished the Cham monarchy.\n|-\n| 1833 || || Katip Sumat uprising: Cham religious teacher Sumat declared a jihad against Minh Mang. Minh Mang was complete mesmerized and ordered a reign of terror over the Cham and indigenous highlanders in Panduranga.\n|-\n| 1834 || || Ja Thak Wa uprising: Cham revolted against Minh Mang, calling for independence. Both movements were bloody suppressed.\n|-\n| 1835 || || The last king of Champa, Po Phaok The, was executed. The last vestiges of Champa and the Cham civilization were annihilated.\n|}\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}