{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Hurricane Katrina\n\nThis article contains a historical timeline of the events of Hurricane Katrina on August 23–30, 2005, and also its aftermath.\nFormation\nTuesday, August 23, 2005\nWhat would eventually become Katrina started as Tropical Depression Twelve which formed over the Bahamas at 5:00&nbsp;p.m. EDT (2100 UTC) on August 23, 2005, partially from the remains of Tropical Depression Ten, which had dissipated due to the effects of a nearby upper trough. While the normal standards for numbering tropical depressions in the Atlantic indicate that the old name/number is retained when a depression dissipates and regenerates, satellite data indicated that the surface circulation from Tropical Depression Ten had separated from the mid level low and dissipated as it moved ashore in Cuba. A second tropical wave combined with mid-level remnants of Tropical Depression Ten north of Puerto Rico to form a new, more dynamic system, which was then designated as Tropical Depression Twelve. Simultaneously, the trough in the upper troposphere weakened, causing wind shear in the area to relax, thereby allowing the new tropical depression to develop.\nIn a later re-analysis, it was determined that the low-level circulation Ten had completely detached and dissipated, with only the remnant mid-level circulation moving on and merging with the aforementioned second tropical wave. As a result, the criteria for keeping the same name and identity were not met.\nWednesday, August 24, 2005\nTwelve strengthened into Tropical Storm Katrina.\nThursday, August 25, 2005\nKatrina strengthened to a hurricane. Less than two hours later Katrina made landfall on Keating Beach, just two miles south of the Fort Lauderdale International Airport. Sustained winds were  and the pressure was 989 mbar. During its passage, the eye of the tropical storm moved directly over the office of the National Hurricane Center, which reported a wind gust of . The strongest sustained winds in Florida was a report of  on the roof of the Rosenstiel School of Marine, Atmospheric, and Earth Science in Virginia Key. The same station recorded a gust of . Unofficially, wind gusts reached  at Homestead General Aviation Airport.\nKatrina lasted six hours on land over the water-laden Everglades as a tropical storm before reaching the Gulf of Mexico just north of Cape Sable.\nGulf of Mexico\nFriday, August 26, 2005\nAt 1:00 AM EDT, maximum sustained winds had decreased to  and Katrina was  downgraded to a tropical storm. At 5:00 AM EDT, the eye of Hurricane Katrina was located just offshore of southwestern Florida over the Gulf of Mexico about 50&nbsp;miles (80&nbsp;km) north-northeast of Key West, Florida. Maximum sustained winds had again increased to 75&nbsp;mph (121&nbsp;km/h) and Katrina was upgraded again to a Category 1 hurricane.\nAt 5:00 AM EDT, the National Hurricane Center officially shifts the possible track of Katrina from the Florida Panhandle to the Mississippi/Alabama coast.[http://www.ctwatch.org/quarterly/print.php%3Fp=99.html]  Governor Kathleen Babineaux Blanco declared a state of emergency for the state of Louisiana. The declaration included activation of the state of Louisiana's emergency response and recovery program under the command of the director of the state office of Homeland Security and Emergency Preparedness to supply emergency support services. Following the declaration of a state of emergency, federal troops were deployed to Louisiana to coordinate the planning of operations with the Federal Emergency Management Agency (FEMA). 922 Army National Guard and 8 Air National Guard are deployed.\nBy 4:00 PM EDT, Katrina was upgraded to a Category 2 storm. Buras-Triumph, Louisiana, 66&nbsp;miles (106&nbsp;km) southeast of New Orleans.\nSaturday, August 27, 2005\nBy 5:00 AM EDT, Hurricane Katrina reached Category 3 intensity.\nAt 10:00 AM EDT, officials in St. Charles Parish, Louisiana, St. Tammany Parish, and Plaquemines Parish ordered a mandatory evacuation of all of their residents. Jefferson Parish and St. Bernard Parish ordered voluntary evacuations, recommending that all residents evacuate, particularly those living in lower areas. Jefferson Parish officials did declare a mandatory evacuation for the coastal areas of Grand Isle, Crown Point, Lafitte, and Barataria. Tolls were suspended on the Lake Pontchartrain Causeway as well as the Crescent City Connection, to speed up the evacuation process.\nAt 11:00 AM EDT, The National Hurricane Center issued a Hurricane Watch from Morgan City, Louisiana to the LA/MS border including New Orleans.\nAt 5:00 PM EDT, New Orleans Mayor Ray Nagin announced a state of emergency and a called for a voluntary evacuation. He added that he would stick with the state's evacuation plan and not order a mandatory evacuation until 30 hours before the expected landfall. This would allow those residents in low-lying surrounding parishes to leave first and avoid gridlocked escape routes. However, he did recommend that residents of low-lying areas of the city, such as Algiers and the 9th Ward, get a head start. Nagin said the city would open the Superdome as a shelter of last resort for evacuees with special needs. He advised anyone planning to stay there to bring their own food, drinks and other comforts such as folding chairs. \"No weapons, no large items, and bring small quantities of food for three or four days, to be safe,\" he said. The Louisiana National Guard had delivered three truckloads of water and seven truckloads of MRE's to the Superdome, enough to supply 15,000 people for three days. The Hurricane Watch was expanded to Intracoastal City, Louisiana to the east and AL/FL border to the west.\nAt 11:00 PM EDT, the Hurricane Watch was upgraded to a Hurricane Warning from Morgan City, Louisiana to the AL/FL border. In the forecast discussion, the National Hurricane Center stated that Katrina \"is expected to be an intense and dangerous hurricane.\"\nMap of Louisiana parishes eligible for assistance.\nGovernor Blanco sends a letter to President George W. Bush asking him to declare a major disaster for the State of Louisiana, in order to release federal financial assistance.\nIn response to Governor Blanco's request, President Bush declared a federal state of emergency in Louisiana under the authority of the Stafford Act, which provided a, \"means of assistance by the Federal Government to State and local governments in carrying out their responsibilities to alleviate the suffering and damage which result from such disasters,...\"\nThe emergency declaration provided for federal assistance and funding, as well as assigned, by law, the responsibility for coordinating relief efforts with those government bodies and relief agencies which agree to operate under his advice or direction, to the FEMA federal coordinating officer (FCO). It also provided for military assets and personnel to be deployed in relief and support operations, although the Posse Comitatus Act imposes strict limitations on the use of Active Duty soldiers in law enforcement. 1701 Army National Guard and 932 Air National Guard are deployed (2633 total).\nThat night, National Hurricane Center director Max Mayfield briefed President Bush, Governor Blanco, Governor Haley Barbour of Mississippi, and Mayor Nagin on the status of Hurricane Katrina.\nSunday, August 28, 2005\nJust after midnight, at 12:40 AM CDT (0540 UTC), Hurricane Katrina reached Category 4 intensity with  winds. By 7:00 AM CDT (1200 UTC), it was a Category 5 storm, with maximum sustained winds of , gusts up to  and a central pressure of 902 mbar.\nIn a press conference at roughly 10:00 AM CDT (1500 UTC), Nagin declared that \"a mandatory evacuation order is hereby called for all of the parish of Orleans.\" \"We are facing a storm most of us have long feared,\" he told the early-morning news conference, with the governor at his side. Following Nagin's speech, Governor Blanco stated that President Bush called her \"just before\" the press conference and said that he was \"concerned about the [storm’s] impact\" and asked her \"to please ensure that there would be a mandatory evacuation of New Orleans.\" Katrina was expected to make landfall overnight. Shortly after the meeting, at 10:00 AM CDT (1500 UTC), the National Weather Service issued a bulletin predicting \"devastating\" damage and that anyone without shelter would face \"certain death.\"\nAt 12:00 PM CDT (1700 UTC), the Louisiana Superdome was opened as a, \"refuge of last resort,\" for those residents that were unable to obtain safe transport out of the city. 20,000 people entered the Dome. The Louisiana National Guard had delivered three truckloads of water and seven truckloads of MRE's to the Superdome, enough to supply 15,000 people for three days. 4444 Army National Guard and 932 Air National Guard are deployed (5,376 total).\nPresident Bush declared a state of emergency in Alabama and Mississippi, and a major disaster in Florida, under the authority of the Stafford Act.\nSecond and Third landfall\n-Louisiana border.]]\nMonday, August 29, 2005\nBetween 4:30 AM CDT (0930 UTC) and 5:00 AM (1000 UTC), levees along the Industrial Canal near the I-10 bridge failed on both sides due to metal barriers along this portion of the canal not working causing sandbags to be put up on both sides. These were destroyed by the 9&nbsp;ft. storm surge entering the canal.\nAt 5:00 AM CDT (1000 UTC), power in the Superdome goes out.\nAt 6:10 AM CDT (1110 UTC), Hurricane Katrina made its second landfall as a strong Category 3 hurricane near Buras, LA, with sustained winds of more than 125&nbsp;mph (205&nbsp;km/h), although Category 4 winds may have briefly affected the area.  Katrina continued north into St. Bernard Parish, crossed Lake Borgne, and made its final landfall near the mouth of the Pearl River on the Louisiana-Mississippi border as a Category 3 storm with winds of 120&nbsp;mph. Water began to rush through the Mississippi Gulf Outlet and Lake Borgne converging at the \"Funnel\" with the Gulf Intracoastal Waterway, north of the Lower Ninth Ward. Levees along the eastern portion of the Mississippi Gulf Outlet began to be overtopped and/or destroyed causing water to start rushing to the Lower Ninth Ward.\nBy 6:30 AM CDT (1130 UTC), power was lost in much of New Orleans.\nAt 6:30 AM CDT (1130 UTC), Levees at the Funnel were overtopped. Water in the Lower Ninth Ward began to rise faster while water rushed into the Industrial Canal.\nAt 6:50 AM CDT (1150 UTC), levees all along the Industrial Canal were overtopped. Water surged into the Lower Ninth Ward as levees on three sides of the neighborhood had failed.\nAt 7:45 AM CDT (1245 UTC), the levees on the eastern side of the southern end of the Industrial Canal explosively break sending 20&nbsp;ft. of water into the Lower Ninth Ward. Houses in the vicinity of the break were destroyed or pushed off of their foundations.\nBy 8:00 AM CDT (1300 UTC), water was seen rising on both sides of the Industrial Canal in New Orleans. Mayor Nagin says that a pumping system in the Lower Ninth Ward had failed.\nAt approximately 8:14 AM CDT (1314 UTC), the National Weather Service's New Orleans office issued a Flash Flood Warning for Orleans and St. Bernard parishes, citing a levee breach at the Industrial Canal. The National Weather Service predicted three to eight feet of water and advised people in the warning area to \"move to higher ground immediately.\"\nAt 8:30 AM CDT (1330 UTC), it was reported that a \"twenty-foot tidal surge\" had \"breached...the canal.\"\nBy 9:00 AM CDT (1400 UTC), there was 6–8&nbsp;feet of water in the Lower Ninth Ward.\nAt 9:30 AM CDT (1430 UTC), levees along the eastern end of the London Avenue Canal near the Mirabeau Avenue Bridge break sending water into the Gentilly.\nAt 9:14 AM CDT (1414 UTC), the Transportation Security Administration also reported a levee breach on the Industrial Canal.\nAt 10:00 AM CDT (1500 UTC), Hurricane Katrina made its third landfall near Pearlington, Mississippi and Slidell, Louisiana, with sustained winds of 120&nbsp;mph (193&nbsp;km/h) after crossing Breton Sound. Waveland, Bay St. Louis, Pass Christian, Long Beach, Gulfport, and Biloxi, Mississippi were decimated. At the same time, President Bush, who was at a Medicare event in El Mirage, Arizona, said, \"I want to thank the governors of the affected regions for mobilizing assets prior to the arrival of the storm to help citizens avoid this devastating storm.\" Levees along Lake Pontchartrain near the New Orleans Lakefront Airport were overtopped.\nAt 10:30 AM CDT (1530 UTC), another breach occurred on the London Avenue Canal, this time on the western portion near the Robert E. Lee Boulevard Bridge (present day Allen Toussaint Avenue Bridge). Water cascaded into the Fillmore neighborhood and surrounding areas. The 17th Street Canal on the western side of the city also suffered a break on the eastern side of the canal near the Metairie Hammond Highway on the very north side of the canal. Water poured into the West End and Lakeview neighborhoods.\nBy 11:00 AM CDT (1600 UTC), there was approximately 10&nbsp;feet (3 m) of water in St. Bernard Parish.  Many of its rooftops were submerged and could not be seen. NPR reporter John Burnett reported from his hotel that there was a levee breach in the Lower 9th Ward, but stated \"...it was the best eventuality of the worst possible scenario. They dodged the bullet, but they still got a sound bruising,\" downplaying the events that were taking place.\nShortly after 11:00 AM CDT (1600 UTC), an oil rig, pushed by the large storm surge, broke off its mournings and rammed into the Cochrane-Africatown Bridge in Mobile, AL.\nAt 11:51 AM CDT (1651 UTC), a breach on the 17th street canal is reported by FEMA Special Assistant Michael Heath.\nAt 2:00 PM CDT (1900 UTC), New Orleans officials confirmed a breach of the 17th Street Canal levee.\nIn a press conference at 3:00 PM CDT (2000 UTC), New Orleans Homeland Security Director Terry Ebbertt said that \"Everybody who had a way or wanted to get out of the way of this storm was able to. For some that didn't, it was their last night on this earth.\" Emergency workers had answered a number of calls from people trapped in trees and attics, and in some cases, had been disconnected with those pleading for help. Police fanned out across the city to assess damage and rescue people before nightfall. Governor Blanco sent 68 school buses from surrounding parishes to begin evacuating survivors in New Orleans. 6,908 Army National Guard and 933 Air National Guard were deployed (7,841 total). The hardest-hit areas of the city were the Lower Ninth Ward, New Orleans East, Gentilly, St. Bernard and Plaquemines parishes, and Lakeview.\nFEMA Director Michael Brown asked United States Department of Homeland Security Secretary Michael Chertoff to dispatch 1,000 Homeland Security workers to the region to assist with disaster relief from the \"near catastrophic event.\" DHS personnel were told to \"establish and maintain positive working relationships with disaster affected communities\" and \"collect and disseminate information and make referrals for appropriate assistance.\" In addition, they were supposed to identify \"potential issues within the community\" and report them while conveying \"a positive image of disaster operations to government officials, community organizations and the general public.\"\nPresident Bush declared a major disaster for Louisiana, Mississippi, and Alabama under the authority of the Stafford Act.\nAftermath\nTuesday, August 30, 2005\nAs news organizations failed to understand the severity of the effects, the New York Times front page read \"Escaping Feared Knockout Punch, Barely, New Orleans Is One Lucky Big Mess.\"\nAt some point during the day, the Associated Press reported that there were two holes in the Superdome roof and water was pouring into the elevator shaft and stairwell.\nAt 12:00 PM CDT (1700 UTC), Homeland Security Secretary Michael Chertoff became aware that the New Orleans levee breaches could not be plugged. Governor Blanco ordered the evacuation of New Orleans, including the Superdome. There were many reported instances of looting, and some reports of looting by police officers. 9,668 Army National Guard and 956 Air National Guard were deployed (10,624 total).\nUSCG helicopters rescued 350 people off roof tops.\nWednesday, August 31, 2005\nNational Guard multi-purpose utility truck brings supplies to the Louisiana Superdome in downtown New Orleans.]]\nHurricane Katrina is downgraded to a tropical depression.\nWater stopped rising in New Orleans. The average home was under 6–9&nbsp;ft. of water.\nAt 10:00 PM CDT (0300 UTC), Mayor Ray Nagin announced that a plan to sandbag the breach in the 17th Street Canal levee had failed. At the time, 85 percent of the city was underwater.\nMichael Chertoff released a memo to other cabinet members and the Environmental Protection Agency stating that \"the President has established the 'White House Task Force on Hurricane Katrina Response.' He will meet with us tomorrow to launch this effort.\" The memo also declared Hurricane Katrina to be an Incident of National Significance and designated Michael Brown, Under-Secretary for Emergency Preparedness and Response (EP&R), as the Principal Federal Official (PFO) for incident management purposes.\nIn a national news conference presided by Chertoff, EPA Administrator Stephen L. Johnson announced the relaxation of federal fuel and emissions standards in response to Katrina.\nThe USS Bataan was positioned off the coast of Gulfport, Mississippi to support relief efforts. The United States Navy moved additional ships and helicopters into the region at the request of FEMA. The number of National Guardsmen on duty in the Gulf Coast rose to approximately 8,300 [actually 10,428 Army National Guard and 960 Air National Guard were deployed—11,388 total]. They remained under their respective governor's control, which enabled them to provide law-enforcement support in affected regions, which is prohibited [to the military] by the Posse Comitatus Act.\nover New Orleans, August 31.]]\nPresident Bush returned to Washington early from vacationing at his ranch in Crawford, Texas. Though he did not stop in Louisiana, Air Force One flew low over the Gulf Coast so Bush could view the devastation from the air. He later declared a Public Health Emergency for the Gulf Coast.\nMayor Nagin ordered almost the entirety of New Orleans's police force to abandon search-and-rescue missions in order to turn their attention toward controlling looting.\nState workers began closing the 17th Street Canal breach, and the U.S. Army Corps of Engineers added additional resources.\nAt 11:00 PM EDT (0300 UTC), the National Hurricane Center announced that the center of the remnant low of what was Hurricane Katrina had been completely absorbed by a frontal boundary in southeastern Canada, with no discernible circulation. Roads in northern Quebec were eroded by heavy rainfall from the hurricane's remnants, and north shore communities were isolated for several days.\nBNSF Railway announced that it expected to restore limited freight service to southern Louisiana by September 1. Crews working to reopen the line were hindered by debris and damage to the Bayou Boeuf bridge in Morgan City, Louisiana, which had been struck by a barge propelled by the storm's winds and wave action. BNSF sent crews to repair damaged railway signal systems on August 30, and it transferred freight through other hubs—such as St. Louis, Chicago, and Memphis—until service was restored.\nNorfolk Southern announced that their mainlines that had been damaged by Hurricane Katrina were operational. They removed almost 3,700 fallen trees and inspected over 1,400 miles (2,253&nbsp;km) of track before setting trains in motion. Tracks directly into New Orleans, however, remained out of service due to washouts, continued flooding, and the city's evacuation order. Freight that would have normally transferred in New Orleans was routed to other terminals across the NS system. The company's experience with prior hurricanes helped it prepare action plans before Katrina made landfall. They moved repair equipment, supplies, and employees into nearby areas and quickly deployed them to inspect and repair the system after the storm passed.\nUSCG helicopters rescued 1,259 more people from roof tops to total of 1,609.\nThursday, September 1, 2005\nThe U.S. Senate passed a relief package.\nPresident Bush appeared on Good Morning America and said that he understood the frustration of Katrina victims, many of whom were still waiting for food, water, and other aid. \"I fully understand people wanting things to have happened yesterday,\" Bush said. \"I understand the anxiety of people on the ground. … So there is frustration. But I want people to know there's a lot of help coming.\" He said the government's first priority was to save lives, and he described the \"very emotional,\" devastation in the hardest-hit areas; but he admitted he was optimistic about the prospects of New Orleans's recovery.\nA 50-member search-and-rescue team from Vancouver, British Columbia save trapped residents in a flooded New Orleans suburb.\nNational Guard began delivering food, water, and ice in New Orleans.\nAmerican Red Cross National President Marsha Evans and Vic Howell, of the agency's Louisiana Capital Area Chapter, requested permission to enter and set up a shelter in New Orleans to pass out relief supplies, but Louisiana officials ultimately rejected the request due to concerns that relief efforts might clash with ongoing military rescue operations.\nMeanwhile, conditions at the Superdome, as well as the Ernest N. Morial Convention Center, continued to deteriorate. Food and potable water were unavailable, with mostly false reports and rumors of rescuers coming under fire from people seeking to hijack supplies or transportation, and few buses were arriving to evacuate the survivors. About 5,000 refugees made it by bus to Reliant Astrodome, yet there were only about 2,000 cots available. Secretary Chertoff is criticized by NPR's Robert Siegel during an interview on All Things Considered, as he had no knowledge of the approximately 2,000 survivors at the Convention Center with no food or water. He said, \"I have not heard a report of thousands of people in the Convention Center who don't have food and water.\" FEMA Director Brown said that FEMA only became aware of crisis at the Convention Center on this date, yet later claims to have known about it 24 hours earlier.\nSecretary Chertoff announced that 4,200 National Guard troops trained as military police would be deployed to New Orleans over the next three days. Governor Blanco requested the mobilization of an additional 40,000 National Guard troops. 14,284 Army National Guard and 972 Air National Guard were currently deployed (15,256 total).\nCalifornia swift water rescue crew units deployed to the area rescued hundreds in New Orleans and Jefferson Parish. However, FEMA later halted the swift water rescue crews from conducting further rescues, citing safety concerns.\nUSAF Aeromedical Evacuation units from 43d Aeromedical Evacuation Squadron, Pope AFB and 433 Aeromedical Evacuation Squadron, Lackland AFB arrive Louis Armstrong Airport. These teams begin to work with State Disaster Medical Assistance (DMAT) teams to move nursing home patients that had sheltered the storm in the airport and those injured during the storm to Medical care in San Antonio Texas.\nSealing of the 17th Street Canal from Lake Pontchartrain with sheet pilings begins, while closing the breach continues.\nThe New Orleans suburb of Gretna seals the Crescent City Connection bridge across the Mississippi River, turning back fleeing flood victims at gunpoint. Evacuees blamed the incident on racism, but the chief of police stated that the city was in lockdown and was not equipped to handle evacuees from New Orleans.\nThe Kansas City Southern Railway reopened its Meridian Speedway railway line between Meridian, Mississippi, and Shreveport, Louisiana, after clearing debris and repairing damage caused by Hurricane Katrina. The line is also used by Norfolk Southern as a bridge route for NS intermodal trains between the Meridian and Alliance, Texas. KCS is also working with CSX Transportation and Meridian and Bigbee Railway to transfer additional intermodal traffic through Meridian rather than New Orleans or Birmingham.\nBiloxi.]]\nPresident Bush signed a $10.5&nbsp;billion relief package that was passed by Congress which included supplemental funds for FEMA, as well as $500&nbsp;million for the Pentagon for its relief efforts. He also toured the hurricane-battered Gulf Coast, saying that he is ordering additional active duty forces to the region, and authorized a withdrawal of oil from the Strategic Petroleum Reserve.\nThe Bush administration sent Governor Blanco a proposed legal memorandum asking her to request a federal takeover of the evacuation of New Orleans. Louisiana officials eventually rejected the request after talks throughout the night, concerned that such a move would be comparable to a federal declaration of martial law.\nSheet piling blocks water flow into the 17th Street Canal, making closure of the breach not relevant to city flooding. Work on closing the breach continues for purposes of pumping.\nIn a letter to the governors of Louisiana, Mississippi and Alabama, BNSF Railway (headquartered in Fort Worth, Texas) pledged a contribution of $1&nbsp;Million, and offered rail transportation to aid in relief efforts for the areas affected by Hurricane Katrina. The monetary contribution came from the Burlington Northern Santa Fe Foundation as a donation to the American Red Cross relief efforts, while the transportation assistance was organized by the Association of American Railroads, the Federal Emergency Management Agency, the Federal Railroad Administration, as well as other railroads that serve the area. The letter also stated that repairs to the Bayou Boeuf bridge were now completed and BNSF's mainline was reopened as originally planned at 6:00 PM CST on September 1.\nUSCG helicopters rescue 2,859 people off roof tops for a total of 4,468.\nFriday, September 2, 2005\n* Bush signs the $10.5 billion relief package after Congress passed it. [https://web.archive.org/web/20050912010254/http://www.cnn.com/2005/POLITICS/09/02/katrina.congress/index.html]\n* Bush tours the hurricane-battered Gulf Coast, saying that he is ordering additional active duty forces to the region. He also authorizes a drawdown of oil from the Strategic Petroleum Reserve. [https://web.archive.org/web/20050912213112/http://www.cnn.com/2005/POLITICS/09/02/bush.katrina.ap/]\n* 18,678 Army National Guard and 2,464 Air National Guard were deployed (21,142 total).\n* USCG operated 48 helicopters in the greater New Orleans area Medevacing all sick and injured people from the Superdome, rescues 6,500+ people\nSaturday, September 3, 2005\n25,548 Army National Guard and 3,998 Air National Guard were deployed (28,546 total).\nCoast Guard air operations have saved 1,245 lives and conducted 385 sorties in the past 24 hours (as of 1600 EDT / 2000Z 3 SEP 05).\n•\nSunday, September 4, 2005\nThe evacuation of the Superdome has been completed. 29,588 Army National Guard and 4,596 Air National Guard were deployed (34,184 total).\nUSCG helicopters rescue 1,037 people from roof tops. USCG air & surface units assist with the evacuation of 9,400+ patients and staff from hospitals in the greater New Orleans area.\nMonday, September 5, 2005\nThe 17th Street Canal levee breach was closed with truckloads of rock and sandbags. The canal reopened so that it could be used to pump water out of the city. 33,608 Army National Guard and 6,613 Air National Guard were deployed (40,221 total).\nUSCG Air Operations conducted 650 sorties rescuing 6,900 people. USCG Surface Operations conducted 31 sorties rescuing 10,950 people. For a total of 17,940 people rescued in the greater New Orleans area.\nTuesday, September 6, 2005\nRescue workers said that there were still many, \"holdouts,\" who were not heeding the mandatory evacuation order first issued by Nagin on August 28. They were concerned about their property being looted, were unaware of the full extent of the disaster, worried about their pets, or concerned that conditions would be worse in the shelters. Due to unsanitary conditions in the city, as well as contaminations of E. coli bacteria in the standing water in the city, Nagin ordered the forced evacuation of everyone that was not involved in cleaning up after Hurricane Katrina.\n38,093 Army National Guard and 5,770 Air National Guard were deployed (43,863 total).\nSenator Barbara Mikulski (D-MD) called for Michael D. Brown's resignation. House Minority Leader Nancy Pelosi (D-CA)and Senate Minority Leader Harry Reid (D-NV) voiced criticism of the disaster's handling, and of the Bush administration's management, delegation of control, leadership, and human consideration.\nUSCG Air & Surface Operations rescue 10,182 people in the greater New Orleans area.\nWednesday, September 7, 2005\n39,736 Army National Guard and 5,952 Air National Guard were deployed (45,688 total).\nThursday, September 8, 2005\nPresident Bush issued an executive order suspending the Davis-Bacon Act of 1931, allowing federal contractors rebuilding after Katrina to pay below the prevailing wage. This action upset labor leaders and Democrats in Congress, who feared that it would make it more difficult for union contractors to win bids.\n40,667 Army National Guard and 5,735 Air National Guard were deployed (46,402 total).\nUSCG Air & Surface Operations rescue 342 people in the greater New Orleans area.\nFriday, September 9, 2005\nFederal Emergency Management Agency (FEMA) Director Michael Brown was removed from directing Hurricane Katrina relief efforts in New Orleans by Homeland Security Secretary Michael Chertoff. He was replaced by Vice Admiral Thad W. Allen, Chief of Staff of the United States Coast Guard.\nU.S. Army Lieutenant General Russel L. Honoré and New Orleans Director of Homeland Security Terry Ebbert announced a \"zero access\" policy with regards to the media, in order to prevent members of the media from reporting on the recovery of dead bodies in New Orleans. CNN filed a lawsuit, then obtained a temporary restraining order to prevent government agencies from interfering with news coverage of recovery efforts.\n42,164 Army National Guard and 4,347 Air National Guard were deployed (46,511 total).\nUSCG Air & Surface Operations rescue 162 people in the greater New Orleans area.\nSaturday, September 10, 2005\nThe federal government subsequently agreed not to attempt to restrict media coverage of events and Honoré's deputy says that the original statement referred to a policy of not allowing embedded journalists on relief operations.\n42,257 Army National Guard and 4,581 Air National Guard were deployed (46,838 total - the peak deployment, with the military then arriving).\nSunday, September 11, 2005\nLouisiana's Department of Environmental Quality issued an administrative order for information on railroad car status information from seventeen railroads in the areas affected by Hurricane Katrina. The Department sought to obtain a listing of all car reporting marks, types, contents, locations and physical status within the region. Previous flyovers of the area revealed a number of cars derailed in various states of damage, but it is as yet unknown the amount or types of hazardous materials that were involved.\nMeanwhile, under the orders of Gov. Kathleen Blanco, Illinois police officers on loan to Louisiana were sent out with flat bottomed boats to rescue hundreds of frozen embryos from New Orleans Lakewood Hospital's Fertility Institute, the first of which was born on Jan. 16, 2007.\nMonday, September 12, 2005\nMichael D. Brown resigned as Director of FEMA for, \"the best interest of the agency and the best interest of the president.\"\nWednesday, September 14, 2005\nCongress approved the Katrina Emergency Tax Relief Act of 2005 for Hurricane Katrina victims, which included the elimination of the early withdrawal penalty on retirement accounts, forgiven debts not being taxable, and more.\nKarl Rove is reported to have been put in charge of reconstruction projects.\nThursday, September 15, 2005\nPresident Bush addresses the nation from Jackson Square, New Orleans, outlining many of the steps that the federal government was taking to provide assistance and relief to Katrina victims. In his speech, he said \"This government will learn the lessons of Hurricane Katrina. We are going to review every action and make necessary changes so that we are better prepared for any challenge of nature, or act of evil men, that could threaten our people\".\nSunday, September 18, 2005\nA new tropical storm, Rita, forms over the Bahamas. Forecasters predict that it too would enter the Gulf of Mexico and become a borderline major hurricane in 5 days.\nMonday, September 19, 2005\nAfter starting to allow residents back into the city, Mayor Nagin ordered yet another evacuation due to Hurricane Rita. With the levees and pumping systems in a weakened state, even a near-miss could bring flooding back to areas that have begun to dry out.\nWednesday, September 21, 2005\nHurricane Rita rapidly intensifies into a Category 5 hurricane and becomes even stronger than Katrina. Forecasters predict a Category 4 landfall somewhere around Houston.\nThe official death toll was raised to 1,036, with 63 additional deaths recognized in Louisiana. This marked the first time since 1928 that a natural disaster in the U.S. had been officially acknowledged to have killed at least 1,000 people. State-by-state death tolls: Louisiana 799, Mississippi 218, Florida 14, Alabama 2, Georgia 2, Tennessee 1.\nFriday, September 23, 2005\nHurricane Rita headed towards Houston, with its outer bands bringing rain to the New Orleans area. Efforts continued to shore up the levees weakened by Katrina.\nSaturday, September 24, 2005\nHurricane Rita made landfall as a Category 3 hurricane with 115 mph winds near Johnson's Bayou, LA, compounding the already growing problems as it makes landfall just west of where Hurricane Katrina had.\nBrig. Gen. Doug Pritt and the 41st Brigade Combat Team of Oregon were designated as the head of Joint Task Force Rita, leading the multi-state National Guard relief efforts in the aftermath of Hurricanes Katrina and Hurricane Rita.\nThe official region wide death toll from Hurricane Katrina was upgraded to 1,080. Mississippi still had not officially increased its death toll by much, but added 2 to the count. Thousands feared dead in Mississippi and Louisiana remain out of the official death toll. State-by-State death tolls: Louisiana 841, Mississippi 220, Florida 14, Alabama 2, Georgia 2, Tennessee 1.\nSaturday, October 1, 2005\nThe official death toll from Hurricane Katrina was upgraded to 1,135. It had been 33&nbsp;days since landfall in Louisiana and Mississippi. State-by-State death tolls: Louisiana 896, Mississippi 220, Florida 14, Alabama 2, Georgia 2, Tennessee 1.\nTuesday, October 4, 2005\nTo date, approximately 1.5&nbsp;million people were evacuated from the damaged areas in Louisiana, roughly 1&nbsp;million have applied for hurricane-related federal aid, 30,000 are in out-of-state shelters, 46,400 are in state shelters and 972 people have perished in the storm.\nThe official death toll was upgraded to 1,836 with more than 2,500 still missing. State-by-State death tolls: Louisiana 1,577, Mississippi 238, Florida 14, Alabama 2, Georgia 2, Tennessee 1, Kentucky 1.\nWednesday, October 5, 2005\nMayor Nagin announced that, due to lack of funds, New Orleans would lay off 3,000 non-essential employees from the city's payroll, or about half of its workforce, over the next two weeks.\nSee also\n*Meteorological history of Hurricane Katrina\n*Timeline of the 2005 Atlantic hurricane season\nReferences\nExternal links\n* [http://www.thinkprogress.org/katrina-timeline Think Progress Katrina Timeline]\n* [https://web.archive.org/web/20060418003157/http://www.cooperativeresearch.org/project.jsp?project=hurricane_katrina Hurricane Katrina: Open-Content Timeline]\n* [https://web.archive.org/web/20050909221725/http://www.ojr.org/ojr/wiki/Katrina_Timeline/ A timeline of government response to Hurricane Katrina]\n* [https://web.archive.org/web/20050923125136/http://www.salon.com/news/feature/2005/09/15/katrina_timeline/index.html Timeline to disaster: Salon.com's hour-by-hour account]"
    }
  ]
}