{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the North African campaign__disambig_2\n\nThis is a timeline of the North African campaign of World War II.\n1940\n* May 1940 — Army of Africa (France) — 14 regiments of zouaves, 42 regiments of Algerian, Tunisian and Moroccan tirailleurs, 12 regiments and demi-brigades of the Foreign Legion and 13 battalions of African Light Infantry were serving on all fronts.\n* 10 June: The Kingdom of Italy declares war upon France and the United Kingdom\n* 14 June: British forces cross from Egypt into Libya and capture Fort Capuzzo\n* 16 June: The first tank battle of the North African campaign takes place, the \"Engagement at Nezuet Ghirba\"\n* 3 July: British navy shells French warships in the port of Oran (Mers El Kébir) to keep them out of German hands.\n* 13 September: Italian forces invade Egypt from Libya\n* 16 September: Italian forces establish front east of Sidi Barrani\n* 9 December:\n** British and Indian forces launch Operation Compass with the Battle of Marmarica (Battle of the camps)\n** Indian forces capture Nibeiwa with cover from British artillery\n** British tanks and Indian troops overrun Tummar West followed by Tummar East\n* 10 December: Indian forces capture Sidi Barrani with support from British artillery\n* 11 December: British armoured forces arrive in Sofafi but Libyan and Italian divisions escape\n* 16 December: Sollum retaken by Allies\n1941\n* 5 January: Bardia captured by British and Australian force\n* 22 January: Tobruk captured by British and Australian force\n* 30 January: Australians capture Derna, Libya\n* 5 February: Beda Fomm captured by British\n* 6 February:\n** Fall of Benghazi to the Western Desert Force\n** Lieutenant-General Erwin Rommel is appointed commander of Afrika Korps\n* 7 February: What remains of the Italian Tenth Army surrenders\n* 9 February: Churchill orders halt to British and Australian advance at El Agheila to allow withdrawal of troops to defend Greece\n* 14 February: First units of the Afrika Korps under Erwin Rommel start to arrive in Libya during Operation Sonnenblume\n* 24 March: Allied forces at El Agheila defeated; Erwin Rommel starts his advance.\n* 4 April: Australian & British forces withdraw from Benghazi; Benghazi and Msus captured by Axis.\n* 6 April: British 3rd Armored Brigade is captured in Derna\n* 8 April: British, Indian and Australian forces captured at Mechili\n* 10 April: Siege of Tobruk begins with Australian, British and Indian forces defending\n* 15 April: British forces are pushed back to Sollum on Egyptian border with Libya\n* 30 April: Australian forces lose a small part of their positions in Tobruk during the Battle of Salient, roughly a 6th of Tobruk is now held by Germans\n* 3 May: Australian counterattack at Tobruk fails\n* 15 May: British troops launch Operation Brevity to gain more territory from which to launch Operation Battleaxe later in the year\n* 16 May:\n** Italian forces attack Australian forces in Tobruk forcing them to withdraw [who withdrew?]\n** Operation Brevity called off. Allied forces fall back onto the Halfaya Pass, captured the previous day\n* 26 May: German forces launch Operation Skorpion and move up to Halfaya Pass\n* 27 May: German forces recapture Halfaya Pass; British troops are forced to withdraw\n* 15 June: British and Indian troops launch Operation Battleaxe which fails\n* 5 July: Auchinleck replaces Wavell as C-in-C Middle East Command\n* 15 August: German Panzer Group Afrika activated with Rommel in Command\n* 18 September: German air raid on Cairo in which 39 Egyptian civilians are killed and nearly 100 injured, bringing condemnation against the Axis from the Arab and Muslim press. Radio Berlin later apologizes to its Arab listeners.\n* 1 October: 5th Light Division renamed 21st Panzer Division\n* 18 November: Auchinleck's Operation Crusader begins (Operation Crusader (18 November – 30 December 1941) with British, Indian, South African and New Zealander forces\n* 19 November: British forces attack Italian positions at Bir El Gubi, but are defeated.\n* 21 November: British armoured division defeated at Sidi Rezegh and withdraws\n* 22 November:\n** New Zealand forces attack Bir Ghirba but fail\n** Indian forces capture Sidi Omar\n* 23 November:\n** New Zealand forces capitalize on Indian advances to wreck Afrika Korps HQ at Bir el Chleta\n** Rommel launches Panzer attacks on the British XXX Corps but faces resistance from SA, NZ and British forces\n** British and NZ forces withdraw towards Bir el Gubi\n* 25 November:\n** Panzer attack on Indian forces at Sidi Omar is repulsed\n** In the second attack in the evening, Indian forces destroy the 5th Panzer Regiment of the 21st Panzer Division\n* 26 November: Ritchie replaces Cunningham as commander Eighth Army\n* 27 November: New Zealand troops at Sidi Azeiz defeated by overwhelming advance of Panzers and German infantry\n* 28 November: 15th Panzer despite being outnumbered 2:1 forces British tanks to retreat, exposing the New Zealand forces at Ed Duda on the Tobruk by-pass\n* 1 December: New Zealand troops in Sidi Rezegh suffer heavy casualties from Panzers\n* 3 December:\n** German infantry suffers big defeat at the hand of New Zealand forces on the Bardia road near Menastir\n** German forces suffer losses against Indian forces and withdraw at Capuzzo (Trigh Capuzzo)\n* 4 December:\n** NZ forces repulse German attack on Ed Duda\n** Indian forces face attrition in an uphill attempt to capture Point 174 against entrenched Italian forces without artillery support\n* 7 December: Another British assault on Italian positions at Bir El Gubi results in failure.\n* 9 December: Tobruk siege relieved by Eighth Army consisting of British, Indian, New Zealand and South African forces; White Knoll captured by the Polish Carpathian Brigade from the elements of the Italian Brescia Division\n* 13 December:\n** 8th Army attacks Gazala line\n** NZ forces stopped at Alem Hamza\n** Indian forces take Point 204\n** Indian infantry face Afrika Korps and against heavy odds destroy 15 of 39 Panzers\n* 14 December: Indian troops repel repeated Panzer attacks on Point 204\n* 15 December: German advance overruns British forces en route to Point 204 but Indian forces at Point 204 hold on\n* 16 December: Rommel facing reduced Panzer numbers orders withdrawal from the Gazala line\n* 24 December: British forces capture Benghazi\n* 25 December: Agedabia reached by the Allies\n* 27 December: Rommel inflicts many losses on British tanks who have to withdraw allowing Rommel to fall back to El Agheila\n* 31 December: Front lines return to El Agheila\n1942\n* 21 January:\n** Rommel's second offensive begins\n** A lone He 111 of the Sonderkommando Blaich successfully bombs the Fort Lamy air field\n**  begins Operation Theseus\n* 23 January: Agedabia captured by Axis forces\n* 29 January: Benghazi captured by Axis forces\n* 4 February: Front line established between Gazala and Bir Hakeim\n* 26 May: Axis forces assault the Gazala line, the Battle of Gazala (26 May to 21 June 1942) and Battle of Bir Hakeim begins\n* 11 June: Axis forces begin offensive from \"the Cauldron\" position\n* 13 June: \"Black Saturday\". Axis inflicts heavy defeat on British armoured divisions\n* 21 June: Axis capture of Tobruk\n* 28 June: Mersa Matruh, Egypt, falls to the Axis\n* 29 June: U.S. reports from Egypt of British military operations stop using the compromised \"Black Code\" which the Axis were reading\n* 30 June: Axis forces reach El Alamein and attack the Allied defences, the First Battle of El Alamein begins\n* 4 July: First Battle of El Alamein continues as Axis digs in and Eighth Army launches series of attacks\n* 31 July: Auchinleck calls off offensive activities to allow Eighth Army to regroup and resupply\n* 13 August: Alexander and Montgomery take command respectively of Middle East Command and Eighth Army\n* 30 August: Rommel launches unsuccessful Battle of Alam el Halfa\n* 13 September: Allies launch unsuccessful Operation Agreement, a large scale amphibious raid directed against Tobruk\n* 23 October: Montgomery launches Operation Lightfoot starting the Second Battle of El Alamein (23 October – 11 November 1942)\n* 5 November: Axis lines broken at El Alamein\n* 8 November: Operation Torch is launched under the command of General Eisenhower, Allied forces land in Morocco and Algeria\n* 9 November: Sidi Barrani captured by Eighth Army\n* 10–27 November: Case Anton\n* 13 November: Tobruk captured by Eighth Army\n* 15 November: British forces capture Derna in Libya\n* 17 November: First Army (Operation Torch's Eastern Task Force) and Axis meet at Djebel Abiod in Tunisia\n* 20 November: Benghazi captured by Eighth Army\n* 27 November: First Army advance halted between Terbourba and Djedeida, 12 miles from Tunis, by Axis counterattack\n* 10 December: First Army front line pushed back to defensive positions east of Medjez el Bab\n* 12 December: Eighth Army starts an offensive towards Axis forces near El Agheila\n* 22 December: First Army starts three-day offensive towards Tebourba which fails\n* 25 December: Sirte captured by Eighth Army\n1943\n* Creation of the French Expeditionary Corps (1943–44)\n* The French Liberation Army (French: , AFL) a reunified French Army, is created in 1943 when the Army of Africa () led by General Giraud is combined with the Free French Forces () of General de Gaulle\n* Italian campaign (World War II) begins (1943 to 1945)\n* 23 January: Tripoli captured by British Eighth Army\n* 30 January: Axis forces capture Faïd pass in central Tunisia\n* 4 February: Axis forces in Libya retreat to Tunisian border south of the Mareth Line\n* 14 February: Axis advance from Faïd to launch Battle of Sidi Bou Zid and enter Sbeitla two days later\n* 19 February: Battle of Kasserine Pass launched by Axis forces\n* 6 March: Axis launch Operation Capri against Eighth Army at Medenine but lose 55 tanks. Patton takes command of II Corps.\n* 9 March: Rommel returned to Germany.  Command of the Army Group Africa was handed over to General Hans-Jürgen von Arnim.\n* 16 March: Battle of the Mareth Line begins\n* 19 March: Eighth Army launches Operation Pugilist\n* 23 March: U.S. II Corps emerge from Kasserine to match the Axis at Battle of El Guettar.  Battle of Mareth ends.\n* 26 March: Eighth Army launch Operation Supercharge II outflanking and making the Axis position at Mareth untenable.  Battle of Tebaga Gap takes place.\n* 4 April: The 9-man crew of the US Air Force B-24 Liberator Lady Be Good fails to return from a bombing raid; the crew parachute from the aircraft but become lost and perish in the Libyan desert\n* 6 April: Right wing of First Army links with Eighth Army. Battle of Wadi Akarit takes place.\n* 22 April: Allied forces launch Operation Vulcan\n* 6 May: Allied forces launch Operation Strike\n* 7 May: British enter Tunis, Americans enter Bizerte\n* 13 May: Axis powers surrender in Tunisia\n* 14 May: Moncef Bey deposed in Tunisia\n* 15 May: Muhammad VIII al-Amin installed as Bey of Tunisia\n* 1 August: Operation Tidal Wave attacks Nazi oil refineries in Romania, from remote base at Benghazi, Libya\n* 10 December: the Moroccan Istiqlal Party holds first congress under Gaulist/US auspices\n1944\n* Food shortages and growth of Tunisian and Algerian nationalist movements\n* 15 August – Operation Dragoon, Allied landing in Provence: Capture ports of Toulon and Marseille; AFL make up the majority of troops landing on French soil\n1945\n* 8 May: Sétif massacre of Algerian demonstrators for independence on the day of German surrender\nSee also\n* Western Desert Campaign\n* Operation Torch\n* Tunisia Campaign\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}