{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Walt Disney Company__disambig_1\n\nThis is a timeline of the Walt Disney Company, listing notable milestones for the Walt Disney Company.\n1923–1925\n{| class=\"wikitable\"\n|-\n! Year\n! Events\n!Notable film releases\n|-\n|1923\n|\n* In Los Angeles, Walt Disney sells his short live-action cartoon reel titled \"Alice's Wonderland\", produced by Laugh-O-Gram. Soon after, Walt and his brother Roy sign a contract to make 6 more such films, called Alice Comedies, which New York-based Margaret J. Winkler would distribute at $1,500 per reel. The brothers would thereby join Winkler as a production partner.\n**In order to produce the series, the two brothers officially establish Disney on October 16, 1923, originally as Disney Brothers Cartoon Studio, with both Walt and Roy as equal partners. This studio is based in the back half of a real estate office on Kingswell Avenue in Hollywood.\n**The brothers then persuade both Virginia Davis (who played Alice) and their collaborator Ub Iwerks to join them in Hollywood.\n|\n|-\n|1924\n|\n* The first Alice Comedies cartoon titled ''Alice's Day at Sea is released on March 1.\n|\n|-\n| 1925\n|\n*The Disney Brothers Cartoon Studio produces 15 more Alice Comedies cartoons including: Alice the Toreador, Alice Gets Stung and Alice Solves the Puzzle.\n|\n|}\n1926–1975\n{| class=\"wikitable\"\n|-\n! Year\n! Events\n!Notable film releases\n|-\n| 1926\n|\n* Disney Brothers Cartoon Studio move into the new studio at 2719 Hyperion Avenue in the Silver Lake district of Los Angeles.\n**Shortly after, the studio changes its name to The Walt Disney Studio.\n|\n|-\n|1927\n|\n* After four years of working on his Alice Comedies'' series, Walt Disney decided to move on to an all-cartoon series.\n**To star in this series, Walt Disney creates the character Oswald the Lucky Rabbit.\n*Charles Mintz, who had taken over M. J. Winkler's film company (Winkler Pictures), signs a contract with Universal Pictures for Winkler Pictures to produce 27 Oswald the Lucky Rabbit cartoons. Disney is brought on to do Oswald's design and animation for the cartoons.\n**The first Oswald the Lucky Rabbit cartoon titled Trolley Troubles is released on September 5.\n**Walt Disney soon realizes that Universal retains the copyrights to all of his Oswald cartoons.\n|\n|-\n|1928\n|\n* The studio loses the contract of the Oswald series.\n** Several animators leave for Winkler Pictures where the series continues production.\n*Walt Disney comes up with an idea for a new character to replace Oswald: Mickey Mouse, who became Disney's first cartoon star.\n**Walt wanted to call him Mortimer Mouse, but his wife suggested Mickey instead.\n* Steamboat Willie is released at New York's Colony Theater on November 18, marking the first public appearance of Mickey Mouse, as well as being the first cartoon released with synchronized sound.\n|\n|-\n|1929\n|\n* The first Silly Symphony cartoon titled The Skeleton Dance is released on August 22.\n*On December 16, The Walt Disney Studio is renamed to Walt Disney Productions, Ltd. Three other companies are also renamed to Walt Disney Enterprises, Disney Film Recording Company, and Liled Realty and Investment Company.\n*Mickey speaks for the first time in The Karnival Kid; his words were \"Hot dog, hot dog.\"\n**Unhappy with how Mickey sounded, Walt Disney himself would provide the voice of Mickey until 1947.\n|\n|-\n|1930\n|\n* The first Mickey Mouse comic strips begin on January 13.\n*Film distribution is moved to Columbia Pictures.\n*Mickey Mouse shorts released this year include: The Barnyard Concert, Just Mickey, and The Cactus Kid.\n**Pluto (unnamed at the time) makes his first appearance with the premiere of The Chain Gang on September 5.\n*The first Disney book (Mickey Mouse Book) is published in November.\n|\n|-\n|1931\n|\n* Mickey's dog receives the name Pluto in The Moose Hunt.\n|\n|-\n|1932\n|\n* Distribution moved from Columbia Pictures to United Artists.\n* Goofy, under the name \"Dippy Dawg\", makes his first appearance with the premiere of \"Mickey's Revue\" on May 27.\n*Flowers and Trees becomes the first full-color cartoon.\n**It wins the 1932 Academy Award for Short Subjects, Cartoons, the first year that such a category was offered by the academy. (Disney would win in this category every year for the rest of the decade.)\n* Walt Disney wins an Academy Honorary Award at the 5th Academy Awards for his creation of Mickey Mouse.\n|\n|-\n|1933\n|\n* Three Little Pigs premieres on May 25.\n|\n|-\n|1934\n|\n* Following the success of the Mickey Mouse shorts, Walt begins producing a feature-length film. Some would dub this project as “Disney’s Folly,” as it went 400% over budget and required more than 300 animators, artists, and assistants. (The resulting 1937 film would later be heralded as groundbreaking.)\n* Donald Duck makes his first appearance with the premiere of \"The Wise Little Hen\" on June 9.\n|\n|-\n|1935\n|\n* \"The Band Concert\" premieres on February 23, becoming the first Mickey Mouse cartoon in color.\n|\n|-\n|1936\n|\n* Distribution moved from United Artists to RKO Radio Pictures.\n|\n|-\n|1937\n|\n* Disney releases its first feature film, Snow White and the Seven Dwarfs, on December 21 at Carthay Circle Theatre, becoming the highest-grossing film of all time up to that point.\n|\n* Snow White and the Seven Dwarfs\n|-\n|1938\n|\n* On September 29, Walt Disney Productions, Ltd., along with Walt Disney Enterprises, Disney Film Recording Company, and Liled Realty and Investment Company, are merged to form Walt Disney Productions.\n|\n|-\n|1939\n|\n* For Snow White and the Seven Dwarfs (1937), Walt wins another Honorary Academy Award. (The award consisted of a regular-size Oscar statuette along with seven miniature versions, in reference to the dwarfs.)\n|\n|-\n|1940\n|\n* Studio moves to Burbank, California\n* Walt Disney Productions goes public and issues its first stock.\n|\n*Pinocchio\n*Fantasia\n|-\n|1941\n|\n* A bitter animators' strike occurs.\n* The studio begins producing propaganda films for the US during World War II. Such shorts produced this year include The Thrifty Pig and 7 Wise Dwarfs.\n**The U.S. army move into the Disney studio lot on December 8.\n|\n* Dumbo\n* The Reluctant Dragon\n|-\n|1942\n|\n* Walt receives his third Honorary Academy Award, this time for Fantasia (1940) and its contribution to sound design.\n* The Disney propaganda film released this year, starring Donald Duck, include:\n** The New Spirit, which would be nominated for an Academy Award.\n** ''Der Fuehrer's Face, which pokes fun of the Nazis and would win an Academy Award.\n|\n* Bambi''\n|-\n|1943\n|\n* As another Disney propaganda film, Walt adapted Alexander de Seversky's book Victory Through Air Power (1942) as a live action-animated feature of the same name.\n|\n* Saludos Amigos\n|-\n|1944\n|\n* Short on money, the company re-releases Snow White and the Seven Dwarfs, generating much-needed revenue and beginning a reissue pattern for their animated films.\n|\n|-\n|1945\n|\n|\n* The Three Caballeros\n|-\n|1946\n|\n|\n* Make Mine Music\n* Song of the South\n|-\n|1947\n|\n*Walt Disney lends his voice to Mickey Mouse for the last time in the \"Mickey and the Beanstalk\" segment of Fun and Fancy Free. Disney claims he has become too busy to continue voicing Mickey.\n|\n* Fun and Fancy Free\n|-\n|1948\n|\n* The True-Life Adventures nature film series begins with the premiere of Seal Island on December 21, continuing until 1960.\n|\n* Melody Time\n* Seal Island\n|-\n|1949\n|\n* The studio begins production on its first all-live action feature, Treasure Island.\n* Disney licenses characters for use in Ice Capades.\n*The Walt Disney Music Company is formed in October.\n|\n* The Adventures of Ichabod and Mr. Toad\n|-\n|1950\n|\n*Treasure Island becomes the studio's first completely live-action feature.\n*Premiering on Christmas Day, One Hour in Wonderland becomes the first-ever Disney television production.\n|\n*Cinderella\n*Treasure Island\n|-\n|1951\n|\n|\n* Alice in Wonderland\n|-\n|1952\n|\n* Disney forms a second company, Walt Disney Inc., to build his new theme park.\n* The Story of Robin Hood and His Merrie Men is the studio's second full live-action film.\n|\n* The Story of Robin Hood and His Merrie Men\n|-\n|1953\n|\n* Walt hires a research firm to find the ideal location in southern California for a large-scale theme park.\n*Walt Disney Inc. is renamed WED Enterprises, controlling the rights to Disney and holding the Disneyland design team (the \"Imagineers\"). Disney's idea to make moving figures of people that could also talk, would be used by WED to create Audio-Animatronics.\n**WED would later own and operate several attractions inside Disneyland, including the Disneyland Monorail System and the Disneyland Railroad.\n* Disney makes the Disneyland programming deal with American Broadcasting-Paramount Theatres to fund Disneyland.\n*The first People & Places short film, The Alaskan Eskimo, premieres on February 18.\n*The Living Desert premieres on November 10 as the first film distributed by the new Buena Vista Distribution Company.\n|\n* Peter Pan\n* The Living Desert\n|-\n|1954\n|\n* Construction for Disneyland begins in July.\n*The studio ends its distribution deal with RKO Radio Pictures and founds Buena Vista Film Distribution Company, Inc. to distribute its feature films.\n* Disney debuts its anthology TV series, initially named Disneyland (before 6 title changes), on October 27. The show would run for 29 years, making it the longest-running primetime television series ever.\n**The story of Davy Crockett is told on the show on December 15.\n|\n* 20,000 Leagues Under the Sea\n|-\n|1955\n|\n* Disneyland opens in Anaheim, California, on July 17, 1955. It would be regarded as the first modern theme park of the US.\n**The park's debut is showcased via a live TV broadcast co-hosted by then-actor Ronald Reagan.\n* The Mickey Mouse Club debuts.\n|\n* Lady and the Tramp\n|-\n| 1956\n|\n|\n* The Great Locomotive Chase\n|-\n|1957\n|\n* Zorro debuts on October 10.\n|\n* Old Yeller\n|-\n|1958\n|\n|\n*White Wilderness\n*Tonka\n|-\n|1959\n|\n* Then-Vice-president Richard Nixon dedicates Monorail.\n* On June 14, the Matterhorn and Submarine Voyage rides open at Disneyland.\n|\n*Sleeping Beauty\n*The Shaggy Dog\n*''Darby O'Gill and the Little People\n|-\n|1960\n|\n|\n*Pollyanna\n*Swiss Family Robinson''\n|-\n|1961\n|\n* Disney purchases the film and merchandise rights to A.A. Milne's Winnie-the-Pooh books.\n|\n*One Hundred and One Dalmatians\n*The Absent-Minded Professor\n*The Parent Trap\n|-\n|1962\n|\n|\n*The Legend of Lobo\n*In Search of the Castaways\n|-\n|1963\n|\n* The Enchanted Tiki Room, the first attraction to feature Audio-Animatronics, opens at Disneyland on June 23.\n|\n* The Sword in the Stone\n|-\n|1964\n|\n* Mary Poppins became Disney's top-grossing film up to this point, as well as one of the top-grossing films of all-time.\n** It wins in five categories at the Academy Awards, though losing the Best Picture award.\n* Four Disney exhibits open at the New York World's Fair.\n|\n* Mary Poppins\n|-\n|1965\n|\n* Walt Disney is awarded the Presidential Medal of Freedom by President Lyndon B. Johnson.\n|\n|-\n|1966\n|\n* In an October 1966 interview, Walt Disney described his vision of creating a planned community called the \"City of Tomorrow;\" \"a showcase for American industry and research, schools, cultural and educational opportunities.\" Disney called this idea the \"Environmental Prototype Community of Tomorrow\" (EPCOT). Disney World's EPCOT would pay tribute to this idea.\n*Walt Disney dies on December 15.\n**His comments on EPCOT would be among the last public statements he ever made.\n|\n* Winnie the Pooh and the Honey Tree\n|-\n|1967\n|\n* Construction begins on Walt Disney World Resort near Orlando, Florida; the underlying governmental structure, called the Reedy Creek Improvement District, is signed into law.\n* The release of The Jungle Book marks the last full-length animated film made with Walt Disney's direct involvement.\n* Pirates of the Caribbean opens at Disneyland.\n|\n* The Jungle Book\n|-\n|1968\n|\n|\n* The Love Bug\n|-\n|1969\n|\n* The Haunted Mansion opens at Disneyland.\n*“Disney on Parade” debuts in Chicago.\n*Released on December 24, 1968, The Love Bug becomes 1969's biggest box office hit and the second-highest-grossing film in Disney history after Mary Poppins.\n|\n|-\n|1970\n|\n* The Walt Disney Archives are established.\n|\n* The Aristocats\n|-\n|1971\n|\n* Walt Disney World opens in the eponymous filmmaker's honor on October 1.\n* Company co-founder Roy O. Disney dies.\n*In Roy's place, Donn Tatum becomes chairman and CEO, and Card Walker becomes president.\n|\n* Bedknobs and Broomsticks\n|-\n|1972\n|\n|\n*''Now You See Him, Now You Don't\n*Snowball Express\n|-\n|1973\n|\n|\n* Robin Hood\n|-\n|1974\n|\n|\n* Herbie Rides Again\n|-\n|1975\n|\n|\n* Escape to Witch Mountain\n|}\n1976–2025\n{| class=\"wikitable\"\n|-\n! Year\n! Events\n!Notable film releases\n|-\n|1976\n|\n* Card Walker replaces Donn Tatum as CEO\n|\n* Freaky Friday\n* Gus\n|-\n|1977\n|\n* Roy E. Disney, son of Roy O. Disney, resigns from the company, citing a decline in overall product quality and issues with management.\n*The Many Adventures of Winnie the Pooh'' becomes the only package feature released after Walt Disney's death.\n|\n*The Many Adventures of Winnie the Pooh\n*The Rescuers\n*Herbie Goes to Monte Carlo\n*''Pete's Dragon\n|-\n|1978\n|\n|\n* Return from Witch Mountain\n|-\n|1979\n|\n* The release of The Black Hole'' marks the first Disney film to be rated PG. Costing $20 million to produce, the film would also be Disney's most expensive film ever up to that point.\n**The film would ultimately get lost in the wide success of Star Wars (1977) and its 1979 re-release.\n* Don Bluth and 12 fellow animators left Disney to found their own studio.\n|\n* The Black Hole\n|-\n|1980\n|\n* Card Walker replaces Donn Tatum as chairman\n*Ron W. Miller, son-in-law of Walt Disney, replaces Walker as president.\n*The first Disney home video titles are released.\n|\n* Popeye (co-produced with Paramount Pictures)\n|-\n|1981\n|\n* The release of Dumbo on home video marks Disney's first animated home video release.\n* Plans for a cable network are announced.\n* The first Walt Disney's World on Ice show, produced by Feld Entertainment under license by Walt Disney Productions, tours the United States.\n|\n*The Fox and the Hound\n*Dragonslayer (co-produced with Paramount Pictures)\n|-\n|1982\n|\n* EPCOT Center opens at Walt Disney World Resort on October 1, with an investment of over a billion dollars.\n|\n* Tron\n|-\n|1983\n|\n* The anthology television series ends, after running for 29 years on all three networks.\n*The Disney Channel begins broadcasting on April 23, quickly becoming the fastest-growing channel on cable television.\n**Earlier that year, to prepare for the launch, the Company left network television.\n*New Fantasyland opens at Disneyland.\n* Ron W. Miller replaces Walker as CEO and Raymond Watson replaces Walker as chairman.\n* Tokyo Disneyland opens in Japan on April 15, as the first foreign Disney park.\n|\n* ''Mickey's Christmas Carol\n* Never Cry Wolf\n* Something Wicked This Way Comes\n|-\n|1984\n|\n* The Touchstone Films label is created to produce films aimed towards more mature audiences.\n**On March 9, Splash becomes the first film release under Touchstone.\n* The Hollywood Pictures label is created, like Touchstone, to produce comedy films aimed towards mature audiences.\n*The studio narrowly escapes a buyout attempt by Saul Steinberg. In its aftermath, Roy Edward Disney and his business partner, Stanley Gold, remove Ron W. Miller as CEO & president and Raymond Watson as chairman, replacing them with Michael Eisner and Frank Wells.\n**Eisner became the first person with no personal connection to Walt Disney to lead Walt Disney Productions. His first 4 years as CEO would see Disney surge from last place to first in box-office receipts among the 8 major studios.\n|\n* Splash (Touchstone)\n|-\n|1985\n|\n* In a reversal of a three-decade studio policy, the studio begins making cartoons for television.\n**Its first Saturday morning cartoons, Adventures of the Gummi Bears and The Wuzzles'', air on September 14.\n* Touchstone Television is established to produce television programs and maintain Disney's strong network presence.\n**The division begins The Golden Girls soon after.\n* The home video release of Pinocchio becomes a best-seller.\n|\n* The Black Cauldron\n* The Journey of Natty Gann\n* Return to Oz\n* One Magic Christmas\n* My Science Project\n|-\n|1986\n|\n*Walt Disney Productions is renamed to The Walt Disney Company.\n* Down and Out in Beverly Hills (released by Touchstone Pictures) becomes the studio's first R-rated film\n*In collaboration with filmmaker Francis Ford Coppola, Captain EO opens as an attraction at Disneyland.\n*Touchstone Television brings Disney's return to Sunday night television with the Disney Sunday Movie.\n*Disney features and television shows begin syndication, first airing on September 4.\n|\n*The Great Mouse Detective\n*Down and Out in Beverly Hills\n*The Color of Money\n*Ruthless People\n|-\n|1987\n|\n* The first Disney Store opens at Glendale Galleria in California.\n*Partnering with filmmaker George Lucas, the Star Tours attraction opens in Disneyland.\n* The Company and the French government sign an agreement for the creation of the first Disney resort in Europe\n**The Euro Disney project starts.\n*The first Disney Dollars are sold at Disneyland.\n* DuckTales debuts in syndication.\n* 50% of Metrocolor was acquired from Lorimar-Telepictures on December 9.\n|\n*Ernest Goes to Camp\n*Good Morning, Vietnam\n*Three Men and a Baby\n|-\n|1988\n|\n* Walt Disney Computer Software is established\n*Disney's Grand Floridian Beach and Caribbean Beach Resorts open.\n*For the first time ever, Disney leads Hollywood studios in the box-office, with several films passing the $100-million milestone.\n*The first Disney/Soviet Film Festival opens on October 16.\n*The TV station KHJ is acquired by Disney on December 2.\n|\n*Oliver & Company\n*Who Framed Roger Rabbit\n*Beaches\n*Cocktail\n*Ernest Saves Christmas\n|-\n|1989\n|\n* Three new gated attractions open in Walt Disney World: Disney-MGM Studios, Pleasure Island, and Typhoon Lagoon; and Splash Mountain opens in Disneyland.\n* Disney and Jim Henson discuss the possible acquisition of Jim Henson Productions, including The Muppets; Henson's death in 1990 ends the discussions.\n*Hollywood Pictures begins operations on February 1.\n*Hollywood Records is formed, offering recordings ranging from rap to movie soundtracks.\n*The Little Mermaid marks the beginning of an era of wide success for Disney, a period now known as the Disney Renaissance. It would win Academy Awards for Best Original Score and Best Original Song (for \"Under the Sea\").\n|\n*The Little Mermaid\n*Honey, I Shrunk the Kids\n*Dead Poets Society\n|-\n|1990\n|\n* Hollywood Records begins operations.\n*The Disney Afternoon television syndication block debuts.\n* Arachnophobia becomes the first release under the new Hollywood Pictures label.\n*DuckTales the Movie: Treasure of the Lost Lamp becomes the first feature animated film not produced by Disney's main animation studio.\n|\n*The Rescuers Down Under\n*DuckTales the Movie: Treasure of the Lost Lamp\n*Pretty Woman\n*Dick Tracy\n*Arachnophobia\n*Ernest Goes to Jail\n|-\n|1991\n|\n* The first Disney Vacation Club Resorts opens at Walt Disney World.\n*Disney moves into publishing for the first time, forming Hyperion Books, Hyperion Books for Children, and Disney Press.\n**Hyperion Books publishes its first book on September 26.\n*The studio's 30th feature-length animated film, Beauty and the Beast, breaks the record for the most successful opening of an animated film, as well as becoming the highest-grossing picture of its genre. Accordingly, the film would go on to win the Academy Awards for Best Original Score and Best Original Score, and become the first-ever animated feature to be nominated for a Best Picture Oscar.\n|\n*Beauty and the Beast\n*The Rocketeer\n*Father of the Bride\n*Ernest Scared Stupid\n|-\n|1992\n|\n* Disney and Pixar sign their first three-picture deal.\n*The company gets a National Hockey League expansion franchise; it is named the Mighty Ducks of Anaheim to coincide with the release of the film The Mighty Ducks.\n* Euro Disney Resort opens outside Paris on April 12.\n*The company commits to a record-high 25 new films in 1992, after Disney studios surpassed the theme parks in profitability by the second quarter of 1991.\n|\n*The Hand That Rocks the Cradle\n*Newsies\n*Sister Act\n*'The Mighty Ducks'\n*Aladdin\n*The Muppet Christmas Carol\n|-\n|1993\n|\n* Disney acquires independent film distributor Miramax Films.\n* Winnie-the-Pooh merchandise outsells Mickey Mouse merchandise for the first time.\n* The Mighty Ducks of Anaheim play their first game at the Anaheim Arena, a new arena located  east of Disneyland.\n* The Disney Wilderness Preserve is established.\n* Disney, LWT, STV, Guardian Media Group and Carlton Communications back a new ITV breakfast franchise, GMTV.\n|\n*Homeward Bound: The Incredible Journey\n*The Adventures of Huck Finn\n*Cool Runnings\n*Hocus Pocus\n*The Nightmare Before Christmas\n|-\n|1994\n|\n* Frank Wells, president of The Walt Disney Company, dies in a helicopter crash.\n* Jeffrey Katzenberg resigns as studio chairman to co-found his own studio, DreamWorks SKG.\n*The first Walt Disney Gallery opens at the MainPlace Mall in Santa Ana, California on November 4.\n*Disney Interactive is formed on December 5.\n* Plans for Disney's America, a historical theme park in Haymarket, Virginia, are abruptly dropped.\n* Euro Disneyland is renamed Disneyland Paris.\n*Beauty and the Beast opens on Broadway.\n*The Lion King becomes one of the highest-grossing films of all time.\n|\n*The Lion King\n*Angels in the Outfield\n*Pulp Fiction\n*The Santa Clause\n*The Jungle Book (1994 live-action)\n|-\n|1995\n|\n* Disney announces plans to merge with Capital Cities/ABC, whose assets include ABC, and stakes in A&E Television Networks, ESPN, and DIC Entertainment.\n*Blizzard Beach opens at Walt Disney World on April 1.\n*Disney Online is founded.\n*The Disney Channel begins operation in the UK on October 1.\n*Michael Ovitz becomes president on October 2.\n*Walt Disney Pictures releases Toy Story, which would be the first feature-length film of Pixar Animation Studios and the first completely computer-animated feature film ever.\n|\n*A Goofy Movie\n*Pocahontas\n*Crimson Tide\n*Toy Story\n|-\n|1996\n|\n* The Disney Institute opens at Disney World on February 9.\n*Disney.com is launched on the World Wide Web on February 22.\n*The merger of equals with Capital Cities/ABC is completed at $19 billion, becoming the second-largest merger in US history.\n**Radio Disney debuts on the ABC Radio Networks on November 18.\n*Disney acquires Jumbo Pictures.\n* Disney makes a deal with Tokuma Shoten for dubbing and releasing of Studio Ghibli films in the U.S., as well as home video rights in Japan.\n|\n* Muppet Treasure Island\n* James and the Giant Peach\n*The Hunchback of Notre Dame\n*The Rock\n*101 Dalmatians (1996 live-action)\n*Scream\n|-\n|1997\n|\n* In January, Michael Ovitz, president of The Walt Disney Company, leaves the company.\n* The home video division releases its first DVDs.\n* Disney takes control of the Major League Baseball franchise the California Angels of the American League, renaming the team the Anaheim Angels in order to match the Mighty Ducks and to draw more tourism to Anaheim and nearby Disneyland.\n*Lyric Street Records is founded in June as a country music label.\n*At Walt Disney World, Disney's Wide World of Sports and Downtown Disney West Side opens.\n* The Lion King musical opens on Broadway.\n* Disney enters a 10-year distribution partnership with Pixar.\n* Playhouse Disney launches.\n|\n*Hercules\n*Con Air\n*George of the Jungle\n*Flubber\n|-\n|1998\n|\n* Animal Kingdom opens at Disney World on April 22; and Tomorrowland at Disneyland is redesigned.\n* Disney and the Hong Kong Government announce a new resort in Hong Kong.\n* Disney Magic, the first ship of the Disney Cruise Line, is launched on July 30.\n*ESPN Magazine debuts on March 23.\n**In Baltimore, Maryland, the first ESPN Zone opens on July 12.\n* Toon Disney launches.\n|\n*Mulan\n*Armageddon\n*The Parent Trap\n*''A Bug's Life\n*Shakespeare in Love (co-produced with Universal Pictures)\n|-\n|1999\n|\n* The GO Network is launched on January 12.\n**GO.com stock begins trading on the New York Stock Exchange on November 18.\n*All-Star Movies Resort opens at Disney World on January 15\n*Disney Cruise Line ship Disney Wonder sets sail on August 15.\n*Mickey Mouse Works debuts on television on May 1.\n*The Hunchback of Notre Dame musical opens in Berlin, Germany.\n|\n*Tarzan\n*Inspector Gadget\n*The Sixth Sense\n*Toy Story 2\n*Fantasia 2000''\n|-\n|2000\n|\n* Bob Iger becomes president.\n* Soapnet launches.\n* Disney sells off DIC Entertainment back to the company's CEO Andy Heyward.\n|\n*Dinosaur\n*Remember the Titans\n*102 Dalmatians\n*''The Emperor's New Groove''\n|-\n|2001\n|\n* Disney purchases Fox Family Worldwide for $3 billion in October. The purchase of the franchise included the Fox Family Channel, the library assets of Saban Entertainment and Fox Kids' brand name, the Fox Children's Productions library of shows, and its European and Latin American channels. Fox Family is renamed ABC Family shortly after the purchase.\n* Fort Worth billionaire Sid Bass is forced to sell his Disney holdings due to a margin call caused partially by the stock market fall that followed the 9/11 attacks.\n*For the first time, Walt Disney Parks and Resorts open 2 new theme parks in the same year: Disney California Adventure Park in February, and Tokyo DisneySea in September.\n*Disney acquires The Baby Einstein Company on November 7.\n*The DVD release of Snow White and the Seven Dwarfs sold over 1 million units on its first day.\n|\n*Atlantis: The Lost Empire\n*Monsters, Inc.\n*Pearl Harbor\n*The Princess Diaries\n|-\n|2002\n|\n* Walt Disney Studios Park opens in March, adjacent to Disneyland Paris.\n* Disney purchases a minority stake in the then-sold Saban International Paris, which is then renamed to SIP Animation.\n|\n*Lilo & Stitch\n*Signs\n*The Santa Clause 2\n*Treasure Planet\n|-\n|2003\n|\n* Mission: Space opens at Epcot, followed by the opening of the Pop Century Resort at Disney World.\n*Roy E. Disney resigns as the chairman of Feature Animation and from the board of directors, citing similar reasons to those that drove him off 26 years earlier.\n**Fellow director Stanley Gold resigns with him and the two establish a group called \"Save Disney\" to apply public pressure to oust Michael Eisner.\n* Talks to extend distribution agreement with Pixar break down, and Pixar announces plans to seek a new distribution partner.\n* Disney sells the Angels to billboard magnate Arturo Moreno.\n* Walt Disney Animation France is closed.\n*Disney becomes the first studio in history to surpass $3 billion in global box office.\n|\n*The Lizzie McGuire Movie\n*Finding Nemo\n*Pirates of the Caribbean: The Curse of the Black Pearl\n*Freaky Friday\n*Brother Bear\n|-\n|2004\n|\n* Comcast makes an unsuccessful and hostile $54.1-billion bid in stock for the company, plus the assumption of $11.9 billion in Disney debt, $66 billion in total.\n* Circle 7 Animation is founded.\n* Eisner is stripped of his chairmanship following a 45% vote of no-confidence from shareholders in the spring.\n**He is replaced by George J. Mitchell as chairman of the board.\n* On February 17, Disney purchases The Muppets and Bear in the Big Blue House franchises from The Jim Henson Company for $75 million, founding The Muppets Holding Company in the process.\n* ABC Family Worldwide, Fox Kids Europe, and Fox Kids Latin America launch Jetix, a brand name that would be used as a block for Toon Disney in the United States and as a rebranding of the Fox Kids channels in Latin America and Europe. Fox Kids Europe is renamed to Jetix Europe in the process.\n* Walt Disney Animation Japan is closed.\n* The Disney Store chain is sold to The Children's Place\n|\n*The Incredibles\n*National Treasure\n*Home on the Range\n|-\n| 2005\n|\n* Disney sells the Mighty Ducks of Anaheim to Henry Samueli of Broadcom Corporation, who changes the team name to Anaheim Ducks.\n* Roy E. Disney rejoins the company as a consultant with the title of \"Director Emeritus.\"\n*Eisner announces that will step down as CEO in September.\n** He is replaced by Bob Iger.\n* Bob and Harvey Weinstein leave Miramax Films and take the Dimension Films banner with them, founding The Weinstein Company.\n* Hong Kong Disneyland opens in September.\n*On October 12, Disney becomes the first to license television episodes for download on Apple's iTunes Music Store.\n*Disney releases Chicken Little, the studio's first completely computer-generated effort.\n|\n*Ice Princess\n*Chicken Little\n*Herbie: Fully Loaded\n*The Chronicles of Narnia: The Lion, the Witch and the Wardrobe\n|-\n| 2006\n|\n* Disney acquires Pixar for $7.4 billion on January 24, before their latest contract could expire in June.\n** The deal is formally completed on May 5, after which Steve Jobs would serve as a director on Disney's board, while Pixar's leading creative John Lasseter would become COO of Pixar Studios, as well as the principal creative adviser at Walt Disney Imagineering.\n*** Pixar maintains its headquarters in Emeryville, California.\n*** Circle 7 Animation ceases operations.\n* Walt Disney Animation Australia is closed.\n* High School Musical airs and its soundtrack goes platinum, breaking all Disney Channel records.\n** On March 14, High School Musical becomes the first full-length film to be sold via digital download, on the iTunes Store.\n* On February 9, Disney acquires the rights to Oswald the Lucky Rabbit (namely the character and 27 Walt Disney shorts) from NBCUniversal, trading ABC Sports commentator Al Michaels to NBC Sports in exchange.\n* After its July release, ''Pirates of the Caribbean: Dead Man's Chest'' became Disney's highest-grossing feature.\n|\n*High School Musical\n*Cars\n*''Pirates of the Caribbean: Dead Man's Chest\n*The Prestige (co-produced with Warner Bros. Pictures)\n|-\n| 2007\n|\n* ABC Radio Networks, along with 22 non-Radio Disney and ESPN Radio, affiliates are sold to Citadel Broadcasting.\n* In January, George J. Mitchell, chairman of The Walt Disney Company, leaves the company.\n* Walt Disney Feature Animation is renamed to Walt Disney Animation Studios.\n* The Muppets Holding Company is renamed to The Muppets Studio.\n* The company begins to drop the Buena Vista brand from its divisions (e.g. Buena Vista Pictures Distribution is renamed to Walt Disney Studios Motion Pictures and Buena Vista Games is renamed to Disney Interactive Studios).\n* Disney acquires Club Penguin on August 1.\n* High School Musical 2 set cable records on its debut on Disney Channel on August 17.\n* Pirates of the Caribbean: At World's End is the top-grossing film of the year worldwide.\n|\n*Meet the Robinsons\n*Pirates of the Caribbean: At World's End\n*High School Musical 2\n*Ratatouille\n*Enchanted\n*National Treasure: Book of Secrets''\n|-\n| 2008\n|\n* The Disney Store chain is reacquired from The Children's Place.\n* Control of The Muppets Studio is transferred from Disney Consumer Products to the Walt Disney Studios.\n* Disney announces plans to fully acquire Jetix Europe N.V. and take it off the Euronext, alongside rebranding the channels.\n* Disney-MGM Studios is renamed to Disney's Hollywood Studios.\n** Toy Story Midway Mania! is opened there as well as at Disney's California Adventure.\n* It's a Small World opens at Hong Kong Disneyland.\n* Disney English, the first Disney-operated language training center, is opened in China.\n* The Little Mermaid opens on Broadway.\n* WALL-E wins the 2008 Academy Award for Best Animated Feature\n|\n*The Chronicles of Narnia: Prince Caspian\n*WALL-E\n*Camp Rock\n*High School Musical 3: Senior Year\n*Roadside Romeo\n*Bolt\n|-\n| 2009\n|\n* Disney launches its official fan club, D23.\n**The Disney twenty-three magazine begins publication.\n**The first biennial D23 Expo is held in Anaheim.\n* Disney XD launches, replacing Toon Disney in the United States, Germany and Japan, and Jetix in most regions.\n**Jetix would also be replaced by the Disney Channel brand in some regions.\n* Disney becomes an equity owner of Hulu on April 30.\n*Disney enters a distribution deal with DreamWorks Pictures, wherein upon DreamWorks' films will be distributed through Touchstone Pictures.\n* SIP Animation ceases operations.\n*The Walt Disney Family Museum opens in San Francisco on October 1.\n* Director Emeritus Roy E. Disney dies of stomach cancer.\n* Disney acquires Marvel Entertainment and its properties.\n*The Book of Masters (Kniga Masterov) is released as the first Disney film locally produced in Russia.\n|\n*Race to Witch Mountain\n*Hannah Montana: The Movie\n*Up\n*The Proposal\n*A Christmas Carol\n*The Princess and the Frog\n|-\n| 2010\n|\n* Disney sells the Power Rangers franchise and other related shows to Saban Brands for USD $100 million.\n* Disney sells Miramax Films to filmyard holdings for $660 million.\n*World of Color debuts at the renamed Disney California Adventure.\n*Do Dooni Chaar ('Two Times Two Equals Four') premiers on October 10, becoming the first live-action Hindi film released by Disney in India.\n*The video game Epic Mickey is released.\n|\n*Alice in Wonderland\n*Toy Story 3\n*Prince of Persia: The Sands of Time\n*Tangled\n*Tron: Legacy\n|-\n| 2011\n|\n* Disney licenses theme-park rights to the Avatar franchise from 20th Century Fox and Lightstorm Entertainment\n**Disney announces Pandora – The World of Avatar at Animal Kingdom in Disney World.\n*Aulani, A Disney Resort & Spa opens in Hawai‘i; The Little Mermaid: Ariel's Undersea Adventure debuts at Disney California Adventure; and groundbreaking ceremonies are held for Shanghai Disneyland.\n* ImageMovers Digital ceases operations\n* Playhouse Disney relaunches as Disney Junior on Valentine's Day.\n* The Disney Dream ship sets sail.\n*Disney begins distributing DreamWorks films in theatres, including The Help.\n**I Am Number Four becomes the first DreamWorks film under the Touchstone banner.\n*Sister Act opens on Broadway and Peter and the Starcatcher opens off-Broadway.\n|\n*Pirates of the Caribbean: On Stranger Tides\n*Cars 2\n*Winnie the Pooh\n*The Help\n*The Muppets\n*War Horse\n|-\n| 2012\n|\n* Rich Ross resigns as Chairman of The Walt Disney Studios, and is replaced by Alan F. Horn.\n* Disney Junior launches its own channel, replacing Soapnet on most cable providers.\n* On October 30, Disney announces its agreement to purchase Lucasfilm.\n** Disney acquires Lucasfilm, owner of the Star Wars and Indiana Jones properties, from George Lucas for approximately $4.06 billion.\n* Disney's Art of Animation Resort and a new Test Track open at Disney World.\n* Cars Land opens at Disney California Adventure.\n* Disney Cruise Line's Disney Fantasy sets sail.\n* Newsies opens on Broadway and wins two Tony Awards.\n|\n*John Carter\n*''Marvel's The Avengers\n*Brave\n*Frankenweenie\n*Wreck-It Ralph\n*Lincoln\n|-\n| 2013\n|\n* Soapnet ceases operations.\n*Fantasy Faire opens in Disneyland; and Mystic Point opens at Hong Kong Disneyland.\n*Disney sells The Baby Einstein Company to Kids II, Inc. on October 14.\n*Frozen becomes the highest-grossing animation film to date.\n|\n*Oz the Great and Powerful\n*Iron Man 3\n*Monsters University\n*Thor: The Dark World\n*Frozen\n*Saving Mr. Banks''\n|-\n| 2014\n|\n* Disney acquires Maker Studios for $500 million.\n*Seven Dwarfs Mine Train opens in Disney World's Magic Kingdom; and Ratatouille: L’Aventure Totalement Toquée de Rémy opens in Disneyland Paris' Walt Disney Studios Park.\n|\n*Captain America: The Winter Soldier\n*Maleficent\n*Guardians of the Galaxy\n*Big Hero 6\n*Into the Woods\n|-\n| 2015\n|\n* Disney combines its Consumer Products and Interactive Media divisions into one unified segment, Disney Consumer Products and Interactive Media.\n* Marvel Studios is reorganized under the Walt Disney Studios.\n* Pixar releases two films in the same calendar year for the first time.\n|\n*Cinderella\n*Tomorrowland\n*Bridge of Spies\n*Avengers: Age of Ultron\n*Inside Out\n*Ant-Man\n*Descendants\n*The Good Dinosaur\n*Star Wars: The Force Awakens\n|-\n| 2016\n|\n* Shanghai Disneyland opens on June 16.\n* Construction on a 14-acre Star Wars-themed land begins at Disneyland and Disney's Hollywood Studios.\n* ABC Family is renamed to Freeform.\n* Disney acquires stock in BAMTech on August 9.\n* DreamWorks ends its film distribution deal with Disney.\n** Touchstone Pictures ceases operations.\n*The Jungle Book (live action) wins the 2016 Academy Award for Best Visual Effects\n|\n*Zootopia\n*Captain America: Civil War\n*The Jungle Book\n*Finding Dory\n*Doctor Strange\n*Moana\n*Rogue One: A Star Wars Story\n|-\n|2017\n|\n* Club Penguin shuts down on March 30.\n** Club Penguin Island is released on the same day.\n* Maker Studios is renamed to Disney Digital Network.\n* Disney announces plans to launch a subscription video-on-demand service.\n* Iron Man Experience opens in Hong Kong as the first Marvel-themed ride at any Disney park.\n* Pandora – The World of Avatar opens at Disney's Animal Kingdom; and Guardians of the Galaxy – Mission: Breakout! opens at Disney California Adventure.\n* In November, John Lasseter announces that he is taking a 6-month leave of absence from the company, after acknowledging \"missteps\" in his behavior with employees. Media outlets report that Lasseter had a history of alleged sexual misconduct towards employees.\n* Disney announces its acquisition of key assets and businesses of 21st Century Fox from Rupert Murdoch.\n|\n*Beauty and the Beast\n*Guardians of the Galaxy Vol. 2\n*Pirates of the Caribbean: Dead Men Tell No Tales\n*Cars 3\n*Thor: Ragnarok\n*Coco\n*Star Wars: The Last Jedi\n|-\n|2018\n|\n* Toy Story Land opens at Shanghai Disneyland and Disney's Hollywood Studios; Pixar Pier debuts at Disney California Adventure; and the Tropical Hideaway opens in Disneyland's Adventureland.\n* In June:\n** Disney announces that John Lasseter would leave the company, with Pete Docter and Jennifer Lee assuming the roles of chief creative officers for Pixar and Walt Disney Animation Studios, respectively.\n** Comcast announces a $65 billion all-cash counter-offer to acquire the Fox assets that Disney was set to purchase. Disney counterbids with a $71.3 billion offer.\n*** Comcast drops offer in pursuit of Sky Group and Disney is free to acquire 21st Century Fox and most of their assets.\n** Disneytoon Studios ceases operations.\n* Soundstage A at Walt Disney Studios is dedicated to Disney veterans Richard M. Sherman and Robert B. Sherman.\n* The Play Disney app is launched.\n* The ESPN+ streaming service is launched.\n* Minnie Mouse receives a star on the Hollywood Walk of Fame.\n* Frozen: The Broadway Musical premieres.\n* Club Penguin Island shuts down on December 20.\n|\n*Black Panther\n*Avengers: Infinity War\n*Solo: A Star Wars Story\n*Incredibles 2\n*Ant-Man and the Wasp\n*Christopher Robin\n*Ralph Breaks the Internet\n*Mary Poppins Returns\n|-\n|2019\n|\n* Disney's acquisition of 21st Century Fox is completed on March 20.\n* Disney Digital Network shuts down on April 30.\n* Avengers: Endgame becomes the company's highest-grossing film worldwide ever.\n* Star Wars: Galaxy's Edge opens at Disneyland and Disney's Hollywood Studios opens.\n* Disney+ launches\n|\n*Captain Marvel\n*Avengers: Endgame\n*Aladdin\n*Toy Story 4\n*The Lion King\n*Ford v. Ferrari\n*Jojo Rabbit\n*Frozen II\n*Star Wars: The Rise of Skywalker\n|-\n|2020\n|\n* 20th Century Fox and Fox Searchlight Pictures are renamed to 20th Century Studios and Searchlight Pictures respectively.\n** Its television counterparts ABC Studios, 20th Century Fox Television, and Fox 21 Television Studios are renamed to ABC Signature, 20th Television, and Touchstone Television respectively.\n* Bob Chapek replaces Iger as CEO.\n* Disney is majorly impacted by the COVID-19 pandemic, resulting in multiple delays in film and television production and distribution, temporary closure of all of its theme parks and cruise lines, massive layoffs, and billion-dollar losses in revenue.\n*In December, Alan Bergman is named chairman of the Disney Studios Content division to oversee Disney's film studios.\n* Touchstone Television ceases operations.\n|\n*Onward\n*Mulan\n*Nomadland\n*Soul\n|-\n|2021\n|\n* Blue Sky Studios ceases operations.\n* Sony Pictures makes a multi-year licensing agreement with Disney for its films to stream across Disney's streaming and linear platforms.\n* Fox 2000 Pictures ceases operations.\n* Soul wins the 2021 Academy Award for Best Animated Feature.\n* Nomadland wins the 2021 Academy Award for Best Picture.\n* Avengers Campus opens at Disney California Adventure.\n* Future World was permanently closed and it was divided into four different lands: World Celebration, World Nature, World Discovery, and World Showcase at EPCOT.\n* Iger's contract expires, with Susan Arnold replacing him as chair.\n|\n*Raya and the Last Dragon\n*Cruella\n*Luca\n*Black Widow\n*Free Guy\n*Shang-Chi and the Legend of the Ten Rings\n*Nightmare Alley\n*Eternals\n*Encanto\n*West Side Story\n|-\n|2022\n|\n* Encanto wins the 2022 Academy Award for Best Animated Feature.\n* Avengers Campus opens at Walt Disney Studios Park.\n* Bob Iger rejoins the company as CEO, replacing Chapek.\n* On April 22, amidst a dispute between Disney and Governor Ron DeSantis, the Reedy Creek Improvement Act is repealed.\n|\n*Turning Red\n*Doctor Strange in the Multiverse of Madness\n*Lightyear\n*Thor: Love and Thunder\n*Black Panther: Wakanda Forever\n*The Banshees of Inisherin\n*Strange World\n*Avatar: The Way of Water\n|-\n|2023\n|\n* The company's centennial year.\n* Mark Parker replaces Arnold as chair.\n* 20th Digital Studio ceases operations.\n* On June 1, The Reedy Creek District fully dissolves, renamed the Central Florida Tourism Oversight District, and placed under the control of a Governor-appointed board.\n* Disney is majorly impacted by the 2023 Hollywood labor disputes.\n|\n*Ant-Man and the Wasp: Quantumania\n*Guardians of the Galaxy Vol. 3\n*The Little Mermaid\n*Elemental\n*Indiana Jones and the Dial of Destiny\n*Haunted Mansion\n*The Creator\n*Wish\n*Poor Things\n|-\n|2024\n|\n* Disney acquires a 10% stake for $1.5 billion in Epic Games.\n* Sony takes over Disney's physical home video releases in North America.\n* Inside Out 2 becomes the highest-grossing animated film to date.\n* Jennifer Lee steps down as chief creative officer of Walt Disney Animation Studios, and is succeeded by Jared Bush.\n|\n*Kingdom of the Planet of the Apes\n*Inside Out 2\n*Deadpool & Wolverine\n*Alien: Romulus\n*Moana 2\n*Mufasa: The Lion King\n*A Complete Unknown\n|-\n|2025\n|\n* James P. Gorman replaces Parker as chairman.\n* Disney announced that it would not renew its lease with Fox Corporation and that it would vacate the Fox Studio Lot in Century City at the end of 2025. and relocate to the Walt Disney Studios in Burbank.\n* Disney acquires a 2% equally stake of Webtoon Entertainment.\n* Disney announced acquires NFL Network and NFL RedZone from NFL.\n|\n* Captain America: Brave New World\n* Snow White\n* Thunderbolts*\n* Lilo & Stitch\n* Elio\n* The Fantastic Four: First Steps\n* Freakier Friday\n* Tron: Ares\n* Predator: Badlands\n* Zootopia 2\n* Avatar: Fire and Ash\n|}\n2026–present\n{| class=\"wikitable\"\n|-\n! Year\n! Events\n!Notable film releases\n|-\n|2026\n|\n|\n* Hoppers\n* The Devil Wears Prada 2\n* The Mandalorian and Grogu\n* Toy Story 5\n* Moana\n* Hexed\n* Avengers: Doomsday\n|}\nSee also\n* Disney Renaissance\n* List of Disney theatrical animated feature films\n* List of remakes and adaptations of Disney animated films\n* List of Walt Disney Pictures films\nReferences\nBibliography\n*"
    }
  ]
}