{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the war in Donbas (2016)\n\nThis is a timeline of the war in Donbas for the year 2016.\nJanuary–March\n* 13 January:  The spokesman of the Ukrainian operational headquarters reported in the morning that pro-Russian troops had opened fire on 70 occasions during 13 January and at least on 10 occasions during the first hours of 14 January. The militias concentrated their activities around Donetsk city and Horlivka. Ukrainian positions were the target of small arms fire, heavy machine arms fire and rocket-propelled grenades at Pisky, Avdiivka, Opytne, Maryinka, Zaitseve, Novhorodske and Maiorsk. Zaitseve was also shelled with 82&nbsp;mm mortars, and snipers harassed Ukrainian troops at Novhorodske and Maiorsk. In the morning, the rebels raked Ukrainian outposts at Pisky and Verhnetoretske, pounded Opytne with automatic grenade launchers, fired rocket-propelled grenades on Novhorodske and heavy machine guns on Zaitseve.\n* 22 January: The Ukrainian military reported that their positions were fired at by pro-Russian forces on 69 occasions during 21 January.  Rebel militants pounded the Ukrainian strongholds of Maryinka, Opytne and Krasnohorivka, in the surroundings of Donetsk city. Zaitseve, in the area between Horlivka and Svitlodarsk, was the target of heavy machine gun fire, while rocket-propelled grenades landed in Maiorsk. In the northern front, the separatists fired heavy machine guns at Troitske -on the border between Donetsk and Luhansk oblasts- and automatic grenade launchers at Zolote, east of Popasna. In the region of Mariupol, pro-Russian troops fired antitank missiles on Talakivka and 120&nbsp;mm mortars on Starohnativka.\n* 26 January: The Ukrainian military said that their positions were attacked by pro-Russian forces on 66 occasions. In the main incidents, pro-Russian armoured fighting vehicles engaged Ukrainian positions at Novhorodske, supported by heavy machine guns and automatic grenade launchers. Marinka received fire from heavy machine guns, grenade launchers and anti-aircraft guns. Troitske and Zaitseve were hit by mortar fire.\n* 28 January: The spokesman of the Ukrainian operational headquarters reported that pro-Russian troops had opened fire on 71 occasions on Ukrainian positions.  In the region between Horlivka and Svitlodarsk, pro-Russian armoured fighting vehicles attacked Ukrainian redoubts around Novhorodske and Maiorsk, supported by heavy machine gun fire, while 82&nbsp;mm mortar volleys landed in Zaitseve. West of Donetsk city, Ukrainian redoubts at Krasnohorivka were harassed with small arms fire, machine gun fire, anti-aircraft cannons, 82&nbsp;mm mortars and 120&nbsp;mm mortars, the latter banned by the Minsk agreements. The rebels also fired heavy machine guns and grenade launchers at Opytne, Pisky and Butivka mining complex. Late in the evening, a Ukrainian Border Guard checkpoint was attacked by an armoured fighting vehicle supported by an automatic grenade launcher. In the northern front, pro-Russian forces launched antitank guided missiles on Sokolniki, in the area of Bakhmutka road. On the border between Donetsk and Luhansk oblasts, Troitske was the target of heavy machine guns and grenade launchers.\n* 4 February: The Ukrainian military reported that their positions were fired at by pro-Russian forces on 81 occasions, 12 of them using banned heavy weapons, in the worst spell of violence on the past six months. In the main incidents, BTR armoured personnel carrier attacked Ukrainian positions at Novhorodske, while 82&nbsp;mm and 120&nbsp;mm mortar barrages landed in Marinka, Pisky and Opytne.\n* 5 February: The spokesman of the Ukrainian operational headquarters reported that pro-Russian troops had opened fire on 84 occasions, in what became the record for the year until then. In the main incidents, Talakivka, Hnutove, Avdiivka, Zaitseve, Maiorske and Butivka mining complex came under 82&nbsp;mm and 120&nbsp;mm mortar fire. Krasnohorivka received fire from small arms, grenade launchers and 82&nbsp;mm mortars.\n* 14 February: The Ukrainian military reported that their positions received fire from pro-Russian forces on 71 occasions. In the main incidents, pro-Russian infantry launched an assault on Ukrainian entrenchments at Hnutove supported by mortars and anti-aircraft artillery. Zaitseve and Krasnohorivka were hit by 120&nbsp;mm mortar barrages. An anti-tank guided missile was launched at Luhanske.\n* 15 February: The spokesman of the Ukrainian operational headquarters reported that pro-Russian troops had opened fire on 79 occasions on 15 February. On at least one occasion, the separatist targeted Ukrainian forces with self-propelled artillery. The self-propelled guns were fired on Ukrainian redoubts at Zaitseve, north of Horlivka. The same positions were shaken by 120&nbsp;mm mortar volleys. Mortar rounds also landed in Maiorsk, while Novhorodske, to the west, was pounded with heavy machine gun fire and rocket-propelled grenades. In the outskirts of Donetsk city, mortar barrages landed on the Ukrainian strongholds of Krasnohorivka and Maryinka. Heavy machine guns and grenade launchers were fired at Opytne, Pisky, Avdiivka and Butivka mining complex. Mortar rounds also fell into Ukrainian positions at Kominternove, Hnutove and Shyrokyne, in the region of Mariupol. Heavy machine guns and antitank rockets were fired at Ukrainian troops near Hranitne. In the northern front, the militias attacked the Ukrainian garrisons at Trokhizbenka and Sokolniki, Luhansk Oblast.\n* 28 February: The Ukrainian military reported in the morning that their positions were fired at by pro-Russian forces on 71 occasions over the past 24 hours. In the main incidents, Zaitseve became the target of 120&nbsp;mm mortars and self-propelled artillery. A Ukrainian army truck hit a fougasse in the Donetsk region on 25 February. As a result, one serviceman was killed and another taken prisoner.\n* 11 March: According to the information provided by the spokesman of the Ukrainian operational headquarters in the morning pro-Russian troops had opened fire on 75 occasions on Ukrainian troops on 11 March&nbsp;– including on 59 occasions in Donetsk, on 15 occasions in Mariupol, and on 1 occasion in Luhansk Oblast. In the main incidents, fired mortars 12 times on the Ukrainian positions near the towns of Krasnohorivka and Avdiyivka, the villages of Opytne, Pisky, Zaitseve and Nevelske in the Donetsk sector, as well as the town of Maryinka and the village of Chermalyk in the Mariupol sector. A Ukrainian serviceman was killed in Avdiivka. Pro-Russian armoured fighting vehicles engaged Ukrainian redoubts around Luhanske and Novhorodske, where a Ukrainian soldier was killed in action.\n* 12 March: The Ukrainian military recorded 71 attacks on their troops over the past 24 hours – including 62 occasions in Donetsk, eight occasions in Mariupol, and one occasion in Luhansk Oblast. Pro-Russian tanks shelled Avdiivka, which was also the target of mortars and 122&nbsp;mm guns. Nearby Krasnohorivka was also the target of 122&nbsp;mm artillery rounds, while Luhanske, north of Horlivka, was attacked three times by armoured fighting vehicles.\n* 28 March: According to the information provided by the spokesman of the Ukrainian operational headquarters pro-Russian troops had opened fire on 72 occasions on Ukrainian troops on 28 March, including more than 60 attacks around Donetsk city and Horlivka. In the main incidents, heavy shelling from 82&nbsp;mm and 120&nbsp;mm mortars was reported at Avdiivka, while Mayorsk was shelled with 152&nbsp;mm self-propelled artillery. Ukrainian forces returned fire ten times.\n* 29 March: The Ukrainian operational headquarters reported that pro-Russian troops had opened fire on 72 occasions at Ukrainian positions over the past 24 hours, using banned weapons along the entire demarcation line. in the main incidents, Zaitseve came under fire from 152&nbsp;mm self-propelled artillery. Avdiivka and Zaitseve were struck by 82&nbsp;mm and 120&nbsp;mm mortar barrages. Ukrainian troops returned fire on 20 occasions.\nApril–June\n* 9 April: The Ukrainian operational headquarters reported in the morning that pro-Russian troops had opened fire on 91 occasions on 9 March. West of Donetsk, Avdiivka was shelled from three different locations – Yakolivka, Mineralne and Yasinuvata – with 82&nbsp;mm and 120&nbsp;mm mortars. Pro-Russian tanks fired 125&nbsp;mm rounds on Ukrainian redoubts at Luhanske, north of Horlivka.\n* 11 April: The Ukrainian military reported that separatist forces had fired upon Ukrainian positions on 79 occasions during the past 24 hours. Ukrainian troops fired back on 9 instances. Avdiivka was the target of small arms and mortars 19 times. The rebels fired 82&nbsp;mm and 120&nbsp;mm mortars on Ukrainian positions at Luhanske, Maiorsk, and Zaitseve, around Horlivka, and Kamyanka, west of Donetsk. Small arms fire was reported at Nevelske, Maryinka and Opytne, around Donetsk city, Zaitseve, Hranitne, north of Mariupol, and Stanytsia Luhanska, Luhansk Oblast, in the northern part of the front. Pro-Russian armoured fighting vehicles attacked Ukrainian redoubts at Luhanske, north of Horlivka, Novotroitske, in the region of Mariupol, and Butivka mining complex, in the outskirts of Donetsk city.\n* 12 April: The spokesman of the Ukrainian operational headquarters reported that pro-Russian troops had opened fire on 87 occasions on 12 March. In the main incidents, pro-Russian forces fired mortars  on Ukrainian positions 22 times, while armoured fighting vehicles launched 12 attacks on Ukrainian forces. Novgorodsky, Marinka, Talakovka, Shirokine, Pisky, Zaitseve, Opytne, Luhanske, Novhorodske, Mayorsk, Marinka and Novotroitske came under hostile fire.\n* 13 April: The spokesman of the Ukrainian operational headquarters reported in the morning that pro-Russian troops had opened fire on 80 occasions on 13 April; the fire was returned on 12 occasions. Pro-Russian armoured fighting vehicles attacked Ukrainian redoubts at Opytne, west of Donetsk airport, with the support of 152&nbsp;mm self-propelled artillery and mortar barrages. The main target was once again the Ukrainian stronghold of Avdiivka. The rebels fired 82&nbsp;mm and 120&nbsp;mm mortars at Maiorsk and Zaitseve, in the outskirts of Horlivka, Pisky, southwest of Donetsk city, and Trokhizbenka, in the northern section of the demarcation line. Additional attacks took place in Maryinka, Butivka mining complex, Verkhnyotoretske, Luhanske, Svitlodarsk and Zolote.\n* 16 May: The ATO HQ reported in the morning that pro-Russian troops had fired upon Ukrainian positions on 36 occasions over the past 24 hours. A rebel assault, preceded by rocket-propelled grenades, antiaircraft fire and 82&nbsp;mm mortar volleys, was repelled near Opytne. Pro-Russian tanks shelled the Ukrainian stronghold of Avdiivka, supported by 120&nbsp;mm mortar barrages and 122&nbsp;mm artillery.\n* 23 May: The Ukrainian military reported that pro-Russian troops had fired upon Ukrainian positions on 47 occasions on 23 May, and on nine occasions during the first six hours of 24 May. In the main incidents, Krasnohorivka came under the combined fire of 82&nbsp;mm and 120&nbsp;mm mortars. Avdiivka and Marinka were hit by 82&nbsp;mm mortar volleys. At least seven Ukrainian servicemen were killed and at least nine others wounded in action in the Donbas region on 23 May, the heaviest daily toll over the past year. The casualties were the result of either heavy shelling or improvised explosive devices. Two Aidar volunteer battalion fighters were killed during a raid on rebel positions behind the demarcation line.\n* 25 May: The ATO HQ reported in the morning that pro-Russian troops had fired upon Ukrainian positions on 33 occasions on 24 May and on 4 occasions during the first six hours of 25 May.   Ukrainian troops claimed the destruction of a pro-Russian BMP-1 armoured fighting vehicle during a pro-Russian attempt to break through the demarcation line at Novotroitske, in an area between Donetsk city and Mariupol. Two anti-tank guided missiles were launched at Luhanske.\n* 28 May: The Ukrainian military reported that pro-Russian troops had fired upon Ukrainian positions on 40 occasions on 27 May and on 14 occasions during the first six hours of 28 May. The violations of the ceasefire involved the use of \"Grad\" multiple rocket launchers to strike Ukrainian defences around Novotroitske.   The OSCE mission reported 405 ceasefire violations in Eastern Ukraine. The same sources said that separatist officials reported three pro-Russian soldiers killed in action. The monitors witnessed the recovery of three bodies.\n* 14 June: The ATO HQ reported in the morning that pro-Russian troops had fired upon Ukrainian positions on 58 occasions on 14 June. The fighting involved the use of heavy weapons banned by the Minsk agreements. Pro-Russian tanks launched two assaults on Ukrainian redoubts at Krasnohorivka, both of them beaten off by the Ukrainian defenders. Nevelske, Pisky, Avdiivka, Verkhnyotoretske, Butivka and Luhanske (in the region of Horlivka) were the target of 152&nbsp;mm howitzers. North of Mariupol, Pavlopil and Chermalik were shelled by 122&nbsp;mm self-propelled guns.\n* 24 June: The ATO HQ reported that pro-Russian troops had fired upon Ukrainian positions on 61 occasions on 24 June. In the main incidents, pro-Russian armoured fighting vehicles from Yasynuvata and Mineralne engaged Ukrainian positions at Avdiivka and Butivka mining complex. Krasnohorivka, Taramchuk, Talakivka, Vodiane, Chermalyk, Zaitseve and Mayorsk came under 82&nbsp;mm mortar fire. Pisky was shelled with 120&nbsp;mm mortars.\n* 27 June: The ATO HQ reported that pro-Russian troops had fired upon Ukrainian positions on 71 occasions on 27 June. In the main incidents, Novotroitske received fire from 152&nbsp;mm self-propelled artillery, while Troitskey, Zaitsevoe, Mayorsk, Luhanske, Opytne, Peiky and Kirove.\n* 29 June: The ATO HQ reported that pro-Russian troops had fired upon Ukrainian positions on 66 occasions on 27 June. In the main incidents, pro-Russian tanks launched an attack on Ukrainian redoubts at Luhanske. Novoselivka and Berezove were hit by 120&nbsp;mm mortar barrages, while Troitske was shelled with 152&nbsp;mm self-propelled artillery.  The following day, Ukrainian baritone Vasyl Slipak, a volunteer in the Ukrainian army, was killed by a sniper near Luhanske.\n* 30 June: The Ukrainian military reported in February 2020 that 2,576 armoured vehicles had been damaged in different degrees in the battlefields across the Donbas region by June 2016. A total of 2,185 vehicles were lost to \"enemy shelling, armed clashes, and landmine explosions\". Among the armoured units destroyed, 1,201 were infantry fighting vehicles and 440 tanks. Most of the damage was caused by rocket-propelled grenades, artillery systems and mortars.\nJuly–September\n* 10 July: According to the information provided by the spokesman of the ATO HQ, there were 94 attacks on Ukrainian positions. In the main incidents, Novhorodske was hit by 152&nbsp;mm artillery barrages, while Nikolaevka was shelled by 122&nbsp;mm self-propelled artillery. Mayorsk, Pisky, Avdiivka, Novhorodske and Troitske received fire from 120&nbsp;mm mortars.\n* 29 July: The spokesman of the ATO HQ reported that separatist forces had opened fire on 84 occasions upon Ukrainian positions on this day. Pro-Russian tanks attacked Ukrainian redoubts at Leninske, in the area of Horlivka, Starhonativka, in the region of Mariupol, and Trokhizbenka, in the northern sector of the demarcation line. Banned heavy weapons were also used in several locations. The rebels fired 152&nbsp;mm self-propelled artillery on Leninske and Yasnobrodivka. In Leninske, 122&nbsp;mm artillery rounds also landed around Ukrainian entrenchments. Krasnohorivka, Pisky and Maiorsk were the target of 120&nbsp;mm mortars.\n* 30 July: According to the information provided by the spokesman of the ATO HQ in the morning, pro-Russian troops had opened fire on 105 occasions on Ukrainian positions the previous day, including on 46 occasions during the last six hours of 30 July. In the main incidents, Yasnobrodivka and Hostre received fire from 152&nbsp;mm artillery, while Opytne came under attack from an armoured fighting vehicle and 120&nbsp;mm mortars. Pro-Russian tanks engaged Ukrainian redoubts at Marinka. Pro-Russian armoured fighting vehicles from Artemivsk launched an attack on Luhanske supported by 120&nbsp;mm mortars and 122&nbsp;mm artillery. Stanytsa Luhanske became the target of 120&nbsp;mm mortars.\n* 31 July: According to the information provided by the ATO HQ on their Facebook page, pro-Russian troops had opened fire on 85 occasions on Ukrainian positions during the last day of July. In the main incidents, pro-Russian and Ukrainian infantry trade fire in the area of Bohdanivka. Avdiivka came under 122&nbsp;mm and 152&nbsp;mm artillery fire. Pro-Russian armoured fighting vehicles engaged Ukrainian redoubts at Vodiane and Starohnativka.\n* 17 August: According to the information provided by the ATO HQ on their Facebook page, pro-Russian troops had opened fire on 96 occasions on Ukrainian positions on 17 August. In the main incidents, Hranitne received fire from 152&nbsp;mm self-propelled artillery, while Avdiivka, Pisky, Luhanske, Novoselivka, Marinka and Travneve became the target of 122&nbsp;mm artillery fire. An anti-tank guided missile landed in Novoselivka. Pro-Russian armoured personnel carriers attacked Shyrokyne, and armoured fighting vehicles fired upon Ukrainian positions at Krasnohorivka.\n* 24 August: According to the information provided by the ATO HQ, pro-Russian troops had opened fire on 85 occasions on Ukrainian positions on 24 August, including 38 times in the surroundings of Donetsk city, 22 times in the region of Mariupol, and 25 times in Luhansk Oblast. In the main incidents, Popasna, Novozvanivka, Semihorye, Zholobok and Novotoshkivka were hit by 152&nbsp;mm artillery fire. Troitske, Luhanske and Krymske became the target of 122&nbsp;mm self-propelled artillery.  Pro-Russian tanks attacked Ukrainian positions around Avdiivka. BTR armoured personnel carriers launched an attack near Marinka, and BPM armoured vehicles fired upon Ukrainian forces at Luhansk.\n* 26 August: The ATO HQ reported that pro-Russian troops had opened fire on 88 occasions on Ukrainian positions on 26 August, including on 37 times in the outskirts of Donetsk city and on 31 times in the region of Mariupol. In the main incidents, Zaitseve, Krasnohorivka and Pisky received 152&nbsp;mm artillery fire. Ukrainian tanks attacked Avdiivka once again. A \"massive\" shelling was reported at Krymske, which was hit by more than 70 artillery rounds from 122&nbsp;mm guns.\n* 29 August: According to the information provided by the ATO HQ on their Facebook, pro-Russian troops had opened fire on 91 occasions on Ukrainian positions the previous day, including 46 occasions in the surroundings of Donetsk city, 25 occasions in Luhansk region, and 20 occasions in the region of Mariupol. In the main incidents, 11 artillery attacks were reported on Nevelske, Avdiivka, Keramike, Pisky, Zaitseve, Dacha and Kademe. Pro-Russian forces used 122&nbsp;mm and 152&nbsp;mm self-propelled artillery. BMP armoured vehicles engaged Ukrainian positions at Zhovte.\n* 11 September: The ATO HQ reported that pro-Russian troops had opened fire on 37 occasions on Ukrainian troops, including eight occasions in the surroundings of Donetsk city, 20 occasions in the region of Mariupol, and nine occasions in Luhansk Oblast. In the main incidents, 122&nbsp;mm self-propelled artillery pounded Vodiane, while BMP-2 armoured vehicles attacked Ukrainian positions at Shyrokyne and Hranitne.\n* 13 September: The ATO HQ reported that pro-Russian troops had opened fire on 56 occasions on Ukrainian positions, including 37 occasions in the surroundings of Donetsk city, 14 occasions in the region of Mariupol, and five occasions in Luhansk Oblast. In the main incidents, Zaitseve and Avdiivka were shelled with 122&nbsp;mm self-propelled artillery. BMP armoured vehicles fired upon Ukrainian positions near Novozvanivka and Shyrokyne.\n* 19 September: The spokesman of the Ukrainian operational headquarters reported, that pro-Russian troops had opened fire on 50 occasions on Ukrainian positions, including 20 times in the region of Mariupol, 26 times in the outskirts of Donetsk city, and four times in Luhansk region. In the main incidents, Zaitseve, Avdiivka, Kamianka and Verkhnyotoretske became the target of 122&nbsp;mm and 152&nbsp;mm self-propelled artillery. Pro-Russian tanks launched an attack on the industrial area of Avdiivka.  At a press conference in Kyiv German Foreign Minister Frank-Walter Steinmeier stated \"We came with a promise from Moscow that effective [September 15] there will be a truce that will last at least a week.\"\n* 21 September: A framework agreement on disengagement of forces was signed by the warring parties at Minsk, brokered by the Trilateral Contact Group.\n* 26 September:  The spokesman of the Ukrainian operational headquarters reported that pro-Russian troops had opened fire on 40 occasions on Ukrainian positions, including 12 times in the outskirts of Donetsk city, 18 times in the region of Mariupol, and ten times in Luhansk region. In the main incidents, BMP armoured vehicles engaged Ukrainian positions at Zaitseve and Nyzhnie Lozove supported by 82&nbsp;mm and 120&nbsp;mm mortars. Pro-Russian artillery remained silent.\nOctober–December\n* 4 October: According to the information provided by the spokesman of the Ukrainian operational headquarters, pro-Russian troops had opened fire on 68 occasions on Ukrainian troops, including 13 times in the outskirts of Donetsk city, 19 times in the region of Mariupol, and on 36 times in Luhansk region. The incidents involved attacks by pro-Russian armoured fighting vehicles on Ukrainian forces at Talakivka and Lebedynske, in the region of Mariupol, and at Novozvanivka and Novooleksandrivka, in the northern front. Novozvanivka and Novooleksandrivka became also the target of 82&nbsp;mm mortars, 120&nbsp;mm mortars and 122&nbsp;mm self-propelled artillery, while 120&nbsp;mm mortar volleys landed in Avdiivka, in the western outskirts of Donetsk city. BMP armoured vehicles engaged Ukrainian forces at Novozvanivka, Novooleksandrivka, Talakivka and Lebedinske.\n* 16 October:   According to the information provided by the spokesman of the Ukrainian operational headquarters, pro-Russian troops had opened fire on 61 occasions on Ukrainian positions, including nine times in the outskirts of Donetsk city, 23 times in the region of Mariupol, and on 29 times in Luhansk region. Marinka, Popasna, Vodiane and Lebedinske received 122&nbsp;mm and 152&nbsp;mm artillery barrages.    Donetsk People's Republic prime minister, Alexander Zakharchenko, confirmed the death of Sparta Battalion commander, Arseny Pavlov, better known as \"Motorola\", killed by an IED explosion in his apartment's elevator in Donetsk city. Zakharchenko said the assassination was carried out by a \"Ukrainian sabotage and reconnaissance group\" and that the killing was a \"ceasefire violation\" and a \"declaration of war\" by Ukrainian President Petro Poroshenko.\n* 18 October: According to the information provided by the spokesman of the Ukrainian operational headquarters, pro-Russian troops had opened fire on 57 occasions on Ukrainian forces, including 44 occasions in the region of Mariupol, ten occasions in Luhansk region, and  three occasions in the outskirts of Donetsk city. In the main incidents, Vodiane, Shyrokyne and Lebedinske were fired upon with 122&nbsp;mm and 152&nbsp;mm self-propelled artillery. The spokesman of German Chancellor Angela Merkel said that Merkel has invited President Vladimir Putin of Russia, Ukraine's President Petro Poroshenko, and  President Francois Hollande of France to \"assess the implementation\" of the Minsk agreements. Putin agreed to attend the 19 October meeting at Berlin.\n* 20 October: The participants of the talks on the Ukraine crisis in Berlin agreed to draw up a roadmap by the end of next month to carry out the Minsk peace agreement for eastern Ukraine. According to German Chancellor Angela Merkel, the talks with Russian, Ukrainian and French leaders about a stalled Ukraine peace deal \"didn't achieve miracles\". According to Kremlin spokesman Dmitry Peskov, the talks were \"as a whole, positive\".\n* 27 October: The ATO HQ reported that pro-Russian troops had opened fire on 54 occasions on Ukrainian positions, including 34 times in the region of Mariupol, three times in Luhansk region, and 17 times in the surroundings of Donetsk city. In the main incidents, BMP armoured vehicles attacked Marinka, Krasnohorivka and Shyrokyne. Avdiivka was struck by 152&nbsp;mm artillery volleys.\n* 6 November: The ATO HQ reported that pro-Russian troops had opened fire on 52 occasions on Ukrainian positions, including 32 times in the region of Mariupol, eight times in the surroundings of Donetsk city, and 12 times in Luhansk region. In Mariupol, especially in the area of Shyrokyne, the rebels used 82&nbsp;mm mortars, 120&nbsp;mm mortars, armoured fighting vehicles, 122&nbsp;mm and 152&nbsp;mm self-propelled artillery. Around Donetsk city and Horlivka, Pro-Russian tanks and armoured fighting vehicles engaged Ukrainian forces at Avdiivka and Luhanske.\n* 7 November: According to the information provided by the spokesman of the Ukrainian operational headquarters, pro-Russian troops had opened fire on 50 occasions on Ukrainian troops, including 31 times in the region of Mariupol, ten times in the outskirts of Donetsk city, and nine times in Luhansk region. In the main incidents,  BMP armoured vehicles engaged Ukrainian positions at  Shyrokyne, while Talakivka received 120 and 82&nbsp;mm mortar volleys. Anti-air craft artillery was fired at Krasnogorivka, while 122&nbsp;mm self-propelled artillery fired on Vodiane and Hnutove.\n* 8 November: The ATO HQ reported that pro-Russian troops had opened fire on 54 occasions on Ukrainian positions, including on 32 occasions in the region of Mariupol, on 6 occasions in the surroundings of Donetsk city, and on 16 occasions in Luhansk region. In the main incidents, BMP armoured vehicles attacked Taramchuk, Krasnohorivka, Marinka, Talakivka, Novotroitske, Berezove, Lebedinske, Shirokino, Pavlopil, Stepne, Luhanske Avdiivka, Zaitseve and Novhorodske supported by 82&nbsp;mm and 120&nbsp;mm mortars. BTR armoured personnel carriers engaged Ukrainian positions at Stanytsia Luhanska, Yasne, Krymske, Novooleksandrivka, Kosharne and Popasna.\n* 12 November: The ATO HQ reported that pro-Russian troops had opened fire on 64 occasions on Ukrainian positions, including 43 times in the region of Mariupol, six times in the surroundings of Donetsk city, and 15 times in Luhansk region. Novozvanivka, Troitske, Talakivka, Tonenke and Avdiivka were pounded by 122&nbsp;mm self-propelled artillery, while 152&nbsp;mm artillery volleys landed in Marinka and Shyrokyne. BMP armoured vehicles attacked Ukrainian positions at Lebedinske, Vodiane, Pavlopil, Shyrokyne, Taramchuk and Talakivka.\n* 10 December: The ATO HQ reported that pro-Russian troops had opened fire on 70 occasions on Ukrainian troops, including 39 times in the region of Mariupol. In the main incidents, Vodiane, Shyrokyne, Lebedinske, Talakivka and Novotoshkivka received fire from 122&nbsp;mm and 152&nbsp;mm self-propelled artillery. pro-Russian tanks engaged Ukrainian redoubts at Shyrokyne.\n* 11 December: According to the information provided by the spokesman of the Ukrainian operational headquarters, pro-Russian troops had opened fire on 51 occasions on Ukrainian troops, including 35 occasions in the region of Mariupol, seven occasions in the surroundings of Donetsk city, and nine occasions in Luhansk region. In the main incidents, 122&nbsp;mm self-propelled artillery fired upon Talakivka, Marinka, Krasnohorivka, Novoselivka, Chermalyk, Lebedinske and Vodiane. Pro-Russian tanks and BMP armoured vehicles launched a sustained attack on Shyrokyne, supported by 82&nbsp;mm and 120&nbsp;mm mortars.\n* 16 December: The ATO HQ reported that pro-Russian troops had opened fire on 52 occasions on Ukrainian positions on this day. In the main incidents, 152&nbsp;mm self-propelled artillery fired upon Troitske, Novozvanivka and Talakivka; Shyrokyne, Krasnohorivka, Lebedinske, Nevelske and Vodiane were hit by 122&nbsp;mm artillery barrages. BMP armoured vehicles attacked Ukrainian positions at Shyrokyne.\n* 18 December: The ATO HQ published on their Facebook page information according to which five Ukrainian servicemen were killed and six others were wounded during a two-hour engagement – at a stretch between the militant-controlled town of Horlivka and Svitlodarsk dam – that started at around 5:50 am. Later in the evening, it was reported that the death toll had risen to six, the number of wounded Ukrainian servicemen had risen to twenty-six. The following day,  the commander of the Luhansk People's Republic military, Colonel Oleg Anashchenko, dubbed the 18 December Ukrainian offensive \"a complete failure\". He later claimed that the Ukrainian army lost three armoured fighting vehicles and 12 soldiers.\n* 23 December: According to the information provided by the spokesman of the Ukrainian operational headquarters, pro-Russian troops had opened fire on 50 occasions on Ukrainian troops today, including 19 times in the outskirts of Donetsk city, 19 times in the region of Mariupol, and ten times in Luhansk region.   In the main incidents, pro-Russian forces targeted Syze with BM-21 \"Grad\" multiple rocket launchers. Severne, Mirinivka and Krasnyi Pakhar received fire from 152&nbsp;mm self-propelled artillery. BMP armoured vehicles attacked the area of Svitlodarsk and Shyrokyne supported by 122&nbsp;mm artillery fire.   A new ceasefire agreement, agreed at Minsk on 21 December, began at midnight 24 December.\nReferences"
    }
  ]
}