{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the German Empire\n\nThe timeline of the German Empire is a chronological list of the major political events of the German Empire, beginning in 1815 with an overview of the predecessor states that led to the German unification of 1871 and ending on 9 November 1918, the day the German Republic was proclaimed in Berlin.\nPredecessor states: German Confederation (1815–1866) and North German Confederation (1866–1871)\n1815\n, outlined in red. The dotted line in the northeast shows the area that joined the Confederation after the 1848 revolution.]]\n* 9 June: The Final Act of the Congress of Vienna created the German Confederation of 39 states from the territories of the former Holy Roman Empire of the German Nation, which had been abolished in 1806.\n* 10 June: The Constitution of the German Confederation, dated 8 June 1815, was formally signed at the Congress of Vienna.\n1834\n* 1 January: The German Customs Union (), which was independent of the German Confederation, came into effect. It created a free-trade zone that initially included eighteen states and was an early step towards the unification of Germany.\n1848\n* 27 February: Triggered by the overthrow of King Louis Philippe of France, the ultimately unsuccessful German revolutions of 1848–1849 began.\n* 18 May: The Frankfurt National Assembly, elected to create a united Germany and write a constitution for it, opened its first session in St. Paul's Church.\n1850\n* 29 November: In the Punctation of Olmütz, the Kingdom of Prussia abandoned its plans to create a German federation under Prussia's leadership without the inclusion of the Austrian Empire, and agreement was reached to revive the German Confederation, which included Austria.\n1851\n* 30 May: The Federal Convention, the deliberating body of the German Confederation, was re-established following the collapse of the 1848 revolution and the revival of the Confederation.\n1866\nis in red. The states that joined the Confederation to form the German Empire in 1871 are in orange. Alsace-Lorraine, the territory annexed from France following the Franco-Prussian War, is in a paler orange.]]\n* 14 June: The Austro-Prussian War began. Prussia under Otto von Bismarck used the situation in Schleswig-Holstein as a pretext to challenge Austria for the leadership of the Confederation.\n* 3 July: In the Battle of Königgrätz, Prussia resoundingly defeated the Austrian side.\n* 18 August: The North German Confederation Treaty was signed in Berlin. It bound the parties into a military alliance and to an agreement to negotiate the creation of a formal federation.\n* 23 August: The Treaty of Prague formally ended the Austro-Prussian War. Prussia gained new territory, and the \"German question\" of a greater or lesser Germany (i.e. with or without Austria) was settled in favor of the latter.\n1867\n* 1 July: The North German Constitution, which had been approved by the Reichstag on 16 April, came into effect and formally established the 22-state North German Confederation.\n1870\n* 19 July: The Franco-Prussian War began when France declared war on Prussia.\n* 1–2 September: In the Battle of Sedan, Emperor Napoleon III of France and 103,000 of his troops were captured. Even though the French Second Empire fell, the war continued under the Third Republic.\n* 9 December: The Reichstag approved the Constitution of the German Confederation (1871). It was based largely on the Constitution of the North German Confederation with the addition of agreements (the November Treaties) between it and the south German states that later joined the Empire.\n* 10 December: The North German Confederation renamed itself the German Empire.\nGerman Empire\n1871\nas German Kaiser, by Anton von Werner. ]]\n* 1 January: The interim Constitution of the German Confederation (1871), which had been approved by the North German Reichstag on 9 December 1870, came into effect.\n* 18 January: The German Empire was proclaimed at a ceremony in the Hall of Mirrors at Versailles. Wilhelm I, King of Prussia, was proclaimed Kaiser.\n* 28 January: The German siege of Paris, the last battle of the Franco-Prussian War, ended with the capitulation of the city. The Armistice of Versailles signed the same day formally ended the fighting.\n* 26 February: The preliminary Treaty of Versailles (1871) between France and the German Empire was signed.\n* 3 March: The first election for the Reichstag of the German Empire took place under universal manhood suffrage. The National Liberals won the largest number of seats (117 out of 382).\n* 21 March: The new Reichstag, with Otto von Bismarck as chancellor, held its first session in the Prussian House of Lords building in Berlin.\nin 1873]]\n* 16 April: Kaiser Wilhelm I signed the new Constitution of the German Empire which the Reichstag had approved overwhelmingly two days earlier. It came into effect on 4 May.\n* 10 May: France and Germany signed the Treaty of Frankfurt, ending the Franco-Prussian War. Among other requirements, France ceded Alsace–Lorraine and agreed to pay an indemnity of five billion gold francs.\n* 8 July: The  ('cultural struggle') against the Catholic Church began when the Catholic and Evangelical bureaus within the Prussian Ministry of Education and Ecclesiastical Affairs were merged.\n* 10 December: In a continuation of the , the Reichstag passed the Pulpit Law. It made it illegal for a clergyman to make public statements which would \"endanger the public peace\".\n1872\n* 11 March: The Prussian School Inspection Law replaced church oversight of the Prussian school system (both Catholic and Protestant schools) with state supervision (part of the ).\n* 4 July: The Jesuit Law prohibited the activities of the Jesuit Order on German soil.\n1873\n* 15 October: The Panic of 1873 reached Germany with the collapse of the Quistorp Bank. It was followed by a wave of bankruptcies and an unprecedented fall in stock prices. It was not until 1880 that Germany began a slow return to growth.\n* 11–14 May: As part of the , the four Falk Laws (also known as the \"May Laws\") were passed by the Prussian parliament. They enacted state controls over religious training and ecclesiastical appointments.\n* 22 October: The Three Emperors League () between the emperors of Germany, Russia and Austria-Hungary was created. Through it Bismarck sought to isolate France diplomatically, specifically by preventing it from making an alliance with Russia.\n1874\n* 1 January: The Constitution of the German Empire went into effect in the Reichsland Alsace–Lorraine, making its status similar to that of the Prussian provinces in their relation to the Kingdom of Prussia.\n* 10 January: The Empire held its second Reichstag election. The National Liberals again won the most seats (147 of 397), although the Catholic Centre Party with only 91 seats had a higher percentage of the total votes (28% vs. 27%).\n* 9 March: In the , civil marriage became mandatory in Prussia.\n* 13 July: An attempt to assassinate Chancellor Bismarck was made by a young Catholic who wanted to end the . The incident, which left Bismarck with a wound in the hand, stoked anti-Catholic sentiment.\n1875\n, founder of the first German workers' party]]\n, a leading member of the German workers' movement]]\n* 5 February: Pope Pius IX declared the Falk Laws of 1873 void.\n* 6 February: Civil marriage was made mandatory in all of Germany, extending the law of 9 March 1874 which affected Prussia only.\n* 8 April: The war-in-sight crisis, sparked by an editorial of that name in the Berlin newspaper Die Post, temporarily heightened tensions between Germany and France by bringing up the possibility of a German preventative war against France. Bismarck was thought to be behind the article.\n* 22 April: All state subsidies to Prussian Catholic dioceses and clergy were stopped (the so-called  ('breadbasket law').\n* 22–27 May: At the Gotha Congress, the General German Workers' Association (ADAV) founded by Ferdinand Lassalle combined with the Social Democratic Workers' Party (SDAP) founded by August Bebel and Wilhelm Liebknecht to form the  (SAP). In 1890 the SAP became the Social Democratic Party of Germany (SPD).\n* 31 May: The  continued with the closure of all monasteries in Prussia and the expulsion of members of religious orders from the state.\n1876\n* 15 February: The  was founded. In view of the ongoing repercussions of the Panic of 1873, it advocated the introduction of protective tariffs.\n* 30 March: The Socialist Workers' Party of Germany (SAP) was banned in Prussia.\n* 7 June: The German Conservative Party was founded. It represented primarily the wealthy landowning German nobility, including the Prussian Junker class.\n1877\n* 10 January: The third Reichstag election changed little in the party makeup in parliament. The National Liberals and Centre Party were again in first and second place.\n* 15 June: In the Kissingen Dictation, Bismarck recorded his thoughts about possible \"nightmare\" anti-German coalitions among the great powers of Europe, with a particular focus on Russia.\n1878\n. The two assassination attempts against him spurred the passage of the Anti-Socialist Law of 1878.]]\n* 11 May: The young workingman Max Hödel attempted to assassinate Kaiser Wilhelm I but failed to hit him.\n* 24 May: The first attempt to pass an anti-socialist law, introduced in reaction to the assassination attempt, failed in the Reichstag.\n* 2 June: A second attack on the Kaiser left him wounded. Bismarck used the shooting to dissolve the Reichstag on 11 June in hopes of having a better chance to pass his anti-socialist law.\n* 17 July: The Reichstag passed a worker protection law mandating factory inspections.\n* 30 July: In the fourth Reichstag election, the National Liberals lost 30 seats but remained the strongest party. The Centre ran a close second.\n* 21 October: The Anti-Socialist Law passed in the new Reichstag. It banned all social democratic associations, meetings and newspapers.\n1879\n* 4 July: Alsace–Lorraine went a step towards autonomy with a law effective 1 October that replaced the  with an appointed governor (). Edwin Freiherr von Manteuffel was the first governor.\n* 1 October: The Reich Court () was established in Leipzig as the Empire's highest court of law.\n* 7 October: Germany and Austria-Hungary formed the Dual Alliance. Each promised to offer the other military support if attacked by Russia.\n1880\n* 14 July: The repeal of the law of 22 April 1875, which had stopped Prussian state subsidies to Catholic dioceses and clergy (the 'Breadbasket Law'), marked the beginning of the end of the .\n1881\n* 18 June: The emperors of Germany, Russia and Austria-Hungary signed the treaty for the second Three Emperors League (). It dealt with issues in the Balkan states and promised \"friendly neutrality\" in a war between any of the three and another great power.\n* 27 October: In the Empire's fifth Reichstag election, the Catholic Centre Party became the largest party with 100 of the 397 seats, while the National Liberal Party was reduced to 45 seats.\n1882\n* 20 May: The Kingdom of Italy joined the 1879 Dual Alliance between Germany and Austria-Hungary to form the Triple Alliance. Each member promised the others its support in the event of an attack by another great power.\n1883\n* 15 June: The Reichstag approved a health insurance plan for workers. It made Germany the first country with a national social insurance system.\n* 11 July: The third Mitigation Law () repealed almost all of the anti-Catholic laws in Prussia.\n1884\n* 5 March: The German Progress Party and the Liberal Union merged to form the left-liberal German Free-minded Party.\n* 27 March: The treaty for the Three Emperors League of 1881 was extended for three years.\n* 24 April: German South West Africa became the first German colony when the land purchased by the merchant Adolf Lüderitz in 1883 was put under government protection.\n* 27 June: The Reichstag passed a bill establishing accident insurance as part of Bismarck's social legislation.\n* 5 July: Togo became a German colony when the explorer Gustav Nachtigall, at the request of German merchants, raised the German flag there. Cameroon followed in the same way on 14 July.\n* 28 October: In the sixth Reichstag election, the conservative parties backing Bismarck's policies won a majority of seats.\n1885\n* 27 February: Carl Peters received a patent of patronage from Kaiser Wilhelm I to establish what became German East Africa.\n* 26 March: Prussia ordered the deportation of Poles who did not have German citizenship. The measure resulted in about 30,000 expulsions.\n* 17 May: Kaiser Wilhelm I granted a patent of patronage to the German New Guinea Company, leading to the creation of German New Guinea.\n1886\n* 26 April: The Reichstag established the Prussian Settlement Commission to promote German settlements in the Prussian provinces of West Prussia and Posen. The goal was to replace ethnic Poles with Germans.\n1887\nfor just 99 days after the death of his father, Wilhelm I, in 1888]]\n* 14 January: At Bismarck's request, Kaiser Wilhelm I dissolved the Reichstag after it rejected the government's bill for military spending covering a period of seven years.\n* 21 February: In the seventh Reichstag election, the Bismarck-friendly \"cartel parties\" (National Liberals, German Conservatives and Free Conservatives) won an absolute majority.\n* 11 March: The Reichstag passed the government's seven-year bill for military spending.\n* 29 April: The second Prussian \"Peace Law\" ended the .\n* 18 June: Germany and Russia concluded the secret Reinsurance Treaty after the Three Emperors League collapsed. They agreed to reciprocal neutrality if either became involved in a war with a third great power.\n1888\nin 1888, the year he became Kaiser]]\n* 9 February: The conservative cartel parties that won a majority in the 21 February 1887 election pushed through a constitutional change that lengthened the legislative period of the Reichstag from three to five years.\n* 9 March: Kaiser Wilhelm I died at the age of ninety. He was succeeded by his son Frederick III, who was seriously ill with throat cancer.\n* 15 June: Frederick III died after 99 days as Kaiser. His 29-year-old son by Princess Royal Victoria, the eldest daughter of Queen Victoria of Great Britain, succeeded him as Kaiser Wilhelm II.\n1889\n* 24 May: The Reichstag passed a disability and old-age pension bill. The pensions were to be granted at age 70 after 30 years of contributions.\n1890\n* 25 January: Bismarck's attempt to extend the Anti-Socialist Laws indefinitely was defeated in the Reichstag.\n* 20 February: In the eighth Reichstag election, the Social Democrats won the largest share of votes (20%) but only 35 seats. The Centre Party with 19% of the votes won the most seats (107).\n* 20 March: Kaiser Wilhelm II forced Otto von Bismarck to resign as chancellor of Germany. He was succeeded by General Leo von Caprivi.\n* 27 March: In a conscious move away from Bismarck's foreign policy, the Caprivi government decided not to renew the Reinsurance Treaty with Russia.\n* 18 November: The General Commission of German Trade Unions was formed in Berlin with Carl Legien at its head.\n1891\n, German chancellor 20 March 1890 – 26 October 1894]]\n* 9 April: What became the Pan-German League was re-founded. Its goals were to promote German colonialism and a policy of German power worldwide.\n* 1 June: The amended Industrial code came into effect. Its worker protections included a cap on working hours, a ban on Sunday work and on the employment of children under 13 years of age in factories.\n* 14 October: The Social Democrats opened the party congress which developed the Erfurt Program. Even though it encouraged working through existing political institutions, it continued to call for a revolution in Germany.\n1892\n* 17 August: France and Russia agreed to the Franco-Russian Alliance. Each promised the other military support if it were attacked by a member of the Triple Alliance (Germany, Austria-Hungary and Italy).\n1893\n* 18 February: The German Agrarian League was founded in Berlin to protest Chancellor Caprivi's low-tariff policy.\n* 6 May: The Reichstag was dissolved after it rejected Chancellor Caprivi's military bill, which proposed an increase in the size of the army. The new Reichstag passed the bill on 13 July.\n* 15 June: In the ninth Reichstag election, the Social Democratic Party was again the top vote-getter (23%) but won only 11% of the seats. The Centre Party, with 19% of the votes won the most seats (96, or 24%).\n1894\n, German chancellor 29 October 1894 – 17 October 1900]]\n* 7 October: Two Reichstag parties merge to form the antisemitic German Social Reform Party.\n* 26 October: Kaiser Wilhelm II dismissed Chancellor Leo von Caprivi and three days later replaced him with Prince Chlodwig zu Hohenlohe-Schillingsfürst.\n1896\n* 3 January: In the Kruger telegram, Kaiser Wilhelm congratulated Paul Kruger, President of the South African Republic for repelling the British Jameson Raid. It led to a deterioration in German-English relations.\n* 1 July: The Reichstag adopted the Civil Code (). It gave the German Empire a common civil code for the first time when it went into effect on 1 January 1900.\n1898\n* 6 March: China leased the Kiautschou Bay region to Germany for 99 years. The bay had been occupied by German cruisers in November 1897.\n* 28 March: The Anglo-German naval arms race began when the Reichstag approved the First Naval Act, which had been drawn up by Admiral Alfred von Tirpitz. A Second Naval Act was passed on 12 June 1900, with amendments in 1906, 1908 and 1912.\n* 16 June: In the tenth Reichstag election, the Social Democratic Party once again had the most votes of any party (27%) but fewer seats (56) than the second place Centre Party, which had 19% of the votes and 102 seats.\n1899\n* 12 February: Spain sold the Caroline and Mariana Islands to Germany.\n1900\n, German chancellor 17 October 1900 – 14 July 1909]]\n* 20 June: During the Boxer Rebellion, the German plenipotentiary in China, Klemens von Ketteler, was shot and killed. The event spurred foreign military intervention, including by Germany.\n* 27 July: In an address to troops heading out to fight the Boxer Rebellion, Kaiser Wilhelm's reference to 'Huns' caused consternation both in Germany and abroad.\n* 17 October: Chancellor Chlodwig Fürst zu Hohenlohe-Schillingsfürst resigned for age-related reasons and was replaced by Bernhard von Bülow.\n1903\n* 11 June: The eleventh Reichstag election brought relatively little change to Germany's parliament. The Centre Party again had the most seats (100) with 20% of the votes; the Social Democrats with 32% of the votes won 81 seats.\n1904\n* 12 January: An uprising of the Herero people in German South West Africa began the conflict that led to the Herero and Nama genocide, which lasted until 1907. A 1985 United Nations report states that German forces killed some 80 percent of all Herero.\n1905\n* 31 March: The First Moroccan Crisis broke out when Kaiser Wilhelm visited Morocco in an attempt to limit France's growing influence there.\n* 15 April: The Kaiser signed the \"Act Increasing the Peacetime Strength of the German Army\". By 1910 the total force was to be raised to just under 506,000.\n* 24 July: Acting on his own, Kaiser Wilhelm signed the defensive Treaty of Björkö with Tsar Nicholas II of Russia. It was rejected by the cabinet in Berlin and never came into effect.\n1906\n, Chief of the German General Staff as of 1906]]\n* 1 January: General Helmuth von Moltke replaced Alfred von Schlieffen as Chief of the German General Staff.\n* 16 October: Shoemaker Wilhelm Voigt (the \"Captain of Köpenick\"), simply by donning a captain's uniform, was able to arrest the mayor of Köpenick and abscond with the town's funds. The incident was highly publicized and made into a play by Carl Zuckmayer.\n* 13 December: Chancellor Bernhard von Bülow dissolved the Reichstag after it failed to approve additional funds for the Herero War in German South West Africa (see also 12 January 1904).\n1907\n* 25 January: In what came to be known as the \"Hottentot election\" because of the importance to the campaign of the Herero War in German South West Africa, the twelfth Reichstag election of the Empire resulted in the Centre Party again having the most seats (101) with 19% of the votes and the Social Democrats having the most votes (29%) but only 43 seats (fourth place).\n* 17 May: With the Reichstag's approval, the Imperial Colonial Office was founded.\n* 12 October: Karl Liebknecht was sentenced to 18 months in prison for his essay \"Militarism and Antimilitarism\".\n1908\n* 15 May: The Associations Act () allowed women to be members of political parties and associations.\n* 7 October: Prussia opened its universities to women. It was the last German state to do so.\n* 28 October: In the Daily Telegraph Affair, the London newspaper published impolitic statements made by Kaiser Wilhelm which badly damaged his reputation in Germany.\n1909\n, German chancellor 4&nbsp;July 1909 – 13 July 1917]]\n* 14 July: Theobald von Bethmann Hollweg became chancellor of Germany following the resignation of Bernhard von Bülow.\n1911\n* 31 May: The constitution for Alsace–Lorraine came into effect. It gave the  nearly the same status as the states of the Empire.\n1912\n* 12 January: In the thirteenth and last Reichstag election of the German Empire, the Social Democratic Party for the first time won the most mandates. With 110 seats and 35% of the votes, it polled well ahead of the second place Centre Party, which garnered 90 seats with just 16% of the vote.\n* 14 June: The 1912 amendment to the Naval Act (see 28 March 1898) passed the Reichstag. Seventy-five percent of the imperial budget was dedicated to armaments.\n1913\n* 14 September: Following the death of the Social Democratic Party's chairman August Bebel, Hugo Haase and Friedrich Ebert were elected to replace him. Both men were to play major roles in the Weimar Republic.\n* 6 November: In Alsace–Lorraine, derogatory remarks about the locals by a young Prussian officer led to arrests and clashes between civilians and the German military. In what came to be known as the Zabern Affair, there was strong public outcry against the military's actions and a vote of censure in the Reichstag against Chancellor Bethmann Hollweg.\n1914\nbeen put into effect. The colored areas outside the dark blue of Germany would have been puppet states.]]\n* 20 February: Rosa Luxemburg was sentenced to a year in prison for anti-war statements she had made in September 1913.\n* 5 July: Early in the July Crisis that led up to the outbreak of the First World War, Germany promised its full support to Austria-Hungary in its response against Serbia in the wake of the assassination of Archduke Franz Ferdinand on 28 June.\n* 1 August: Germany declared war against Russia and in the following days against France and England. Many Germans, especially in the educated classes, greeted the outbreak of war enthusiastically in the \"Spirit of 1914\".\n* 4 August: In a display of its wartime political truce, the Reichstag, including all members of the Social Democratic Party, voted unanimously in favor of the government's request for 5 billion marks in war funding.\n* 9 September; In the September Program, Chancellor Theobald von Bethmann Hollweg laid out Germany's war goals. They included the creation of a Mitteleuropa under German domination.\n* 4 October: Ninety-three German intellectuals published a manifesto in which they denied that Germany had committed war crimes in Belgium and defended Germany as a nation of culture.\n1915\n* 1 February: As retaliation against Great Britain for its naval blockade of Germany, Chancellor Bethmann Hollweg approved the use of submarines against merchant shipping.\n* 20 March: Karl Liebknecht and Otto Rühle voted against the budget bill containing additional war funding. Thirty other Social Democrats walked out before the vote.\n* 12 May: A memorandum from German heavy industry pushed for annexations in Eastern Europe in order to \"obtain the necessary military strength and ensure the food supply for our population in new wars\".\n1916\n.]]\n* 24 March: Hugo Haase and other anti-war Social Democratic Reichstag members were expelled from the party. They formed the Social Democratic Working Group (, SAG), a forerunner of the Independent Social Democratic Party (USPD).\n* 1 May: Karl Liebknecht was arrested at an anti-war demonstration in Berlin. On 28 June he was sentenced to four years in prison.\n* 22 May: In a sign of Germany's worsening living standards, the War Office for Food was established.\n* 11 October: Under pressure from antisemitic groups who believed that Jews were shirking front-line combat duties, the Prussian Ministry of War ordered a census of Jews.\n* 2 December: The Reichstag passed the Auxiliary Services Act, a major component of the Hindenburg Program, the goal of which was to rapidly increase the output of munitions and weapons. Every able-bodied German male could be called to mandatory service in a war-related field.\n1917\n, German chancellor 14 July 1917 – 1&nbsp;November 1917]]\n, German chancellor 1&nbsp;November 1917 – 30 September 1918]]\n* 24 February: All schools in Berlin were closed due to a lack of coal to heat the buildings.\n* 6 April: The split within the Social Democrats (SPD) became formal when its anti-war left wing, including members of the Spartacus League, formed the Independent Social Democratic Party of Germany (USPD).\n* 7 April: As a result of growing political unrest in Germany, Kaiser Wilhelm in his \"Easter Message\" promised constitutional reforms at the end of the war.\n* 9 April: Vladimir Lenin, with the cooperation of the German government, crossed Germany by train on his way from exile in Switzerland to Saint Petersburg in Russia.\n* 13 July: Chancellor Theobald von Bethmann Hollweg submitted his resignation to Kaiser Wilhelm after Field Marshall Paul von Hindenburg and General Erich Ludendorff threatened to resign if he did not go. Wilhelm chose Georg Michaelis as the next chancellor.\n* 19 July: The Reichstag Peace Resolution, which urged a negotiated peace without annexations, passed by a vote of 212 to 126.\n* 2 September: In response to the Reichstag Peace Resolution, the German Fatherland Party was founded under the leadership of Grand Admiral Alfred von Tirpitz and Wolfgang Kapp (who gave his name to the 1920 Kapp Putsch).\n* 31 October: General Ludendorff forced Georg Michaelis to resign as chancellor. Kaiser Wilhelm chose Georg von Hertling to replace him.\n1918\n, the last chancellor of the German Empire 3 October 1918 – 9 November 1918]]\n* 28 January: The anti-war January strike began in Berlin. Over a million workers took part before the government violently suppressed the action.\n* 3 March: Germany and Soviet Russia signed the Treaty of Brest-Litovsk, ending the war between the two nations.\n* 29 September: At the Spa Conference, Field Marshall Paul von Hindenburg and General Erich Ludendorff told Kaiser Wilhelm that the civilian government should ask for an armistice based on Wilson's 14 Points and that the Reichstag's main political parties should be brought into the government.\n* 30 September: As a result of the demands for a democratized government, Chancellor Georg von Hertling resigned.\n* 3 October: Prince Max von Baden was named chancellor. He brought members of the Social Democratic Party and Centre Party into his cabinet.\n* 23 October: In U.S. President Woodrow Wilson's third note to the German authorities, he wrote that peace negotiations required a more democratic government and that he could accept only surrender if the negotiations were with \"the military masters and monarchical autocrats of Germany\".\n* 23 October: Karl Liebknecht was released under a general amnesty of political prisoners.\n* 28 October: An amendment to the imperial constitution changed the Empire to a parliamentary monarchy, with the chancellor dependent on the will of the Reichstag rather than the emperor.\n* 29 October: German sailors in Wilhelmshaven refused orders to sail out for a last battle with the British Navy. The ensuing Kiel Mutiny on 3 November marked the beginning of the German revolution of 1918–1919 which overthrew the German Empire.\n* 9 November: Chancellor Max von Baden prematurely announced the abdication of Kaiser Wilhelm II and handed his own office to Friedrich Ebert of the SPD. A few hours later and without authorization, Philipp Scheidemann (SPD) proclaimed the \"German Republic\" from a window of the Reichstag building.\nReferences\nNotes"
    }
  ]
}