{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of volcanism on Earth\n\nThis timeline of volcanism on Earth includes a list of major volcanic eruptions of approximately at least magnitude 6 on the Volcanic explosivity index (VEI) or equivalent sulfur dioxide emission during the Quaternary period (from 2.58 Mya to the present). Other volcanic eruptions are also listed.\nSome eruptions cooled the global climate—inducing a volcanic winter—depending on the amount of sulfur dioxide emitted and the magnitude of the eruption. Before the present Holocene epoch, the criteria are less strict because of scarce data availability, partly since later eruptions have destroyed the evidence. Only some eruptions before the Neogene period (from 23 Mya to 2.58 Mya) are listed. Known large eruptions after the Paleogene period (from 66 Mya to 23 Mya) are listed, especially those relating to the Yellowstone hotspot, Santorini caldera, and the Taupō Volcanic Zone.\nActive volcanoes such as Stromboli, Mount Etna and Kīlauea do not appear on this list, but some back-arc basin volcanoes that generated calderas do appear. Some dangerous volcanoes in \"populated areas\" appear many times: Santorini six times, and Yellowstone hotspot 21 times. The Bismarck volcanic arc, New Britain, and the Taupō Volcanic Zone, New Zealand, appear often too.\nIn addition to the events listed below, there are many examples of eruptions in the Holocene on the Kamchatka Peninsula, which are described in a supplemental table by Peter Ward.\nLarge Quaternary eruptions\nThe Holocene epoch begins 11,700 years BP (10,000 14C years ago).\n1000–2000 AD\n*Pinatubo, island of Luzon, Philippines; 1991, June 15; VEI&nbsp;6;  of tephra; an estimated  of  were emitted\n*Novarupta, Alaska Peninsula; 1912, June 6; VEI&nbsp;6;  of lava\n*Santa Maria, Guatemala; 1903, October 24; VEI&nbsp;6;  of tephra\n*Krakatoa, Indonesia; 1883, August 26–27; VEI&nbsp;6;  of tephra\n*Mount Tambora, Lesser Sunda Islands, Indonesia; 1815, Apr 10; VEI&nbsp;7;  of tephra; an estimated  of  were emitted, produced the \"Year Without a Summer\"\n* 1808 mystery eruption, VEI&nbsp;6–7; discovered from ice cores in the 1980s.\n*Grímsvötn, Northeastern Iceland; 1783–1785; Laki; 1783–1784; VEI&nbsp;2;  of lava, an estimated  of  were emitted, produced a Volcanic winter, 1783, on the North Hemisphere.\n*Long Island (Papua New Guinea), Northeast of New Guinea; 1660 ±20; VEI&nbsp;6;  of tephra\n*Huaynaputina, Peru; 1600, February 19; VEI 6;  of tephra\n*Billy Mitchell, Bougainville Island, Papua New Guinea; 1580 ±20; VEI&nbsp;6;  of tephra\n*Bárðarbunga, Northeastern Iceland; 1477; VEI&nbsp;6;  of tephra\n*1465 mystery eruption \"the location of this eruption is uncertain, as it has only been identified from distant ice core records and atmospheric events around the time of King Alfonso II of Naples's wedding; it is believed to have been VEI&nbsp;7 and possibly even larger than Mount Tambora's in 1815.\n*1452/1453 mystery eruption in the New Hebrides arc, Vanuatu; the location of this eruption in the South Pacific is uncertain, as it has been identified from distant ice core records; the only pyroclastic flows are found at Kuwae;  of tephra;  of sulfuric acid\n*1280(?) in Quilotoa, Ecuador; VEI&nbsp;6;  of tephra\n*1257 Samalas eruption, Rinjani volcanic complex, Lombok Island, Indonesia; 40&nbsp;km3 (dense-rock equivalent) of tephra, Arctic and Antarctic Ice cores provide compelling evidence to link the ice core sulfate spike of 1258/1259 A.D. to this volcano.\nOverview of Common Era\nThis is a sortable summary of 27 major eruptions in the last 2000 years with VEI ≥6, implying an average of about 1.3 per century. The count does not include the notable VEI 5 eruptions of Mount St. Helens and Mount Vesuvius.  Date uncertainties, tephra volumes, and references are also not included.\n{|class=\"wikitable sortable\"\n!Caldera/ Eruption name!!Volcanic arc/ beltor Subregion or Hotspot!!VEI!!class=\"unsortable\"|Date!!class=\"unsortable\"|Known/proposed consequences\n|-\n|Mount Pinatubo||Luzon Volcanic Arc||6||15 Jun 1991|| Global temperature fell by 0.4&nbsp;°C\n|-\n|Novarupta||Aleutian Range||6||6 Jun 1912||\n|-\n|Santa María||Central America Volcanic Arc||6||24 Oct 1902||\n|-\n|Krakatoa||Sunda Arc||6||26-28 Aug 1883||At least 30,000 dead\n|-\n|Consiguina||Nicaruagua Volcanic Chain||||1835||\n|-\n|Mount Tambora||Lesser Sunda Islands||7||10 Apr 1815||Year Without a Summer (1816)\n|-\n|1808 mystery eruption||Southwestern Pacific Ocean ||6||Dec 1808||A sulfate spike in ice cores\n|-\n|Long Island (Papua New Guinea)||Bismarck Volcanic Arc||6||1660||\n|-\n|Huaynaputina||Andes, Central Volcanic Zone||6||19 Feb 1600||Russian famine of 1601–1603\n|-\n|Billy Mitchell||Bougainville & Solomon Is.||6||1580||\n|-\n|Bárðarbunga||Iceland||6||1477||\n|-\n|1458 mystery eruption||Unknown||6-7||1458||Possibly larger than Mount Tambora's\n|-\n|1452/1453 mystery eruption||Unknown||6-7||1452–53||2nd pulse of Little Ice Age?\n|-\n|Quilotoa||Andes, Northern Volcanic Zone||6||1280||\n|-\n|Samalas (Mount Rinjani)||Lombok, Lesser Sunda Islands||7||1257||1257 Samalas eruption, 1st pulse of Little Ice Age? (c.1250)\n|-\n|Baekdu Mountain/Tianchi eruption||China/North Korea border||7||946, Nov-947 ||Limited regional climatic effects.\n|-\n|Ceboruco||Trans-Mexican Volcanic Belt||6||930||\n|-\n|Dakataua||Bismarck Volcanic Arc||6||800||\n|-\n|Pago||Bismarck Volcanic Arc||6||710||\n|-\n|Mount Churchill||eastern Alaska, USA||6||700||\n|-\n|Rabaul caldera||Bismarck Volcanic Arc||6||683 (est.)||\n|-\n|Volcanic winter of 536||Unknown||6-7||535||\n|-\n|Ilopango||Central America Volcanic Arc||6||450||\n|-\n|Ksudach||Kamchatka Peninsula||6||240||\n|-\n|Taupō Caldera/Hatepe eruption||Taupō Volcano||7||230||\n|-\n|Mount Churchill||eastern Alaska, USA||6||60||\n|-\n|Ambrym||New Hebrides Arc||6||50||\n|-\n|Apoyeque||Central America Volcanic Arc ||6||50 BC (±100)||\n|-\n|}\nNote:\nCaldera names tend to change over time. For example, Ōkataina Caldera, Haroharo Caldera, Haroharo volcanic complex, and Tarawera volcanic complex all had the same magma source in the Taupō Volcanic Zone. Yellowstone Caldera, Henry's Fork Caldera, Island Park Caldera, Heise Volcanic Field all had Yellowstone hotspot as magma source.\nEarlier Quaternary eruptions\n2.588 ± 0.005 million years BP, the Quaternary period and Pleistocene epoch begin.\n*Eifel hotspot, Laacher See, Vulkan Eifel, Germany; 12.9&nbsp;ka; VEI&nbsp;6;  of tephra.van den Bogaard, P (1995). [http://adsabs.harvard.edu/abs/1995E&PSL.133..163V 40Ar/(39Ar) ages of sanidine phenocrysts from Laacher See Tephra (12,900 yr BP): Chronostratigraphic and petrological significance]\n*Emmons Lake Caldera (size: 11 x 18&nbsp;km), Aleutian Range, 17&nbsp;ka ±5; more than  of tephra.\n*Lake Barrine, Atherton Tableland, North Queensland, Australia; was formed over 17&nbsp;ka.\n*Menengai, East African Rift, Kenya; 29&nbsp;ka\n*Morne Diablotins, Commonwealth of Dominica; VEI&nbsp;6; 30&nbsp;ka (Grand Savanne Ignimbrite).\n*Phlegraean Fields, Italy; VEI 7; 40 ka (Campanian Ignimbrite eruption).\n*Kurile Lake, Kamchatka Peninsula, Russia; Golygin eruption; about 41.5&nbsp;ka; VEI&nbsp;7\n*Maninjau Caldera (size: 20 x 8&nbsp;km), West Sumatra; VEI&nbsp;7; around 52&nbsp;ka;  of tephra.\n*Lake Toba (size: 100 x 30&nbsp;km), Sumatra, Indonesia; VEI&nbsp;8; 73&nbsp;ka ±4;  of tephra; probably six gigatons of sulfur dioxide were emitted (Youngest Toba Tuff).\n*Atitlán Caldera (size: 17 x 20&nbsp;km), Guatemalan Highlands; Los Chocoyos eruption; formed in an eruption 84&nbsp;ka; VEI&nbsp;7;  of tephra.\n*Mount Aso (size: 24&nbsp;km wide), island of Kyūshū, Japan; 90&nbsp;ka; last eruption was more than  of tephra.\n*Sierra la Primavera volcanic complex (size: 11&nbsp;km wide), Guadalajara, Jalisco, Mexico; 95&nbsp;ka;  of Tala Tuff.\n*Mount Aso (size: 24&nbsp;km wide), island of Kyūshū, Japan; 120&nbsp;ka;  of tephra.\n*Mount Aso (size: 24&nbsp;km wide), island of Kyūshū, Japan; 140&nbsp;ka;  of tephra.\n*Puy de Sancy, Massif Central, central France; it is part of an ancient stratovolcano which has been inactive for about 220,000 years.\n*Emmons Lake Caldera (size: 11 x 18&nbsp;km), Aleutian Range, 233&nbsp;ka; more than  of tephra.\n*Mount Aso (size: 24&nbsp;km wide), island of Kyūshū, Japan; caldera formed as a result of four huge caldera eruptions; 270&nbsp;ka;  of tephra.\n*Uzon-Geyzernaya calderas (size: 9 x 18&nbsp;km), Kamchatka Peninsula, Russia; 325–175&nbsp;ka  of ignimbrite deposits.\n*Diamante Caldera–Maipo volcano complex (size: 20 x 16&nbsp;km), Argentina-Chile; 450&nbsp;ka;  of tephra.\n*Yellowstone hotspot; Yellowstone Caldera (size: 45 x 85&nbsp;km); 640&nbsp;ka; VEI&nbsp;8; more than  of tephra (Lava Creek Tuff)\n*Three Sisters (Oregon), USA; Tumalo volcanic center; with eruptions from 600–700 to 170&nbsp;ka years ago\n*Uinkaret volcanic field, Arizona, USA; the Colorado River was dammed by lava flows multiple times from 725 to 100&nbsp;ka.\n*Mono County, California, USA; Long Valley Caldera; 758.9&nbsp;ka ±1.8; VEI&nbsp;7;  of Bishop Tuff.\n*Valles Caldera, New Mexico, USA; 1.25&nbsp;Ma; VEI&nbsp;7; around  of the Tshirege Member (Upper Bandelier Tuff) eruption.\n*Sutter Buttes, Central Valley of California, USA; were formed over 1.5&nbsp;Ma by a now-extinct volcano.\n*Valles Caldera, New Mexico, USA; 1.61&nbsp;Ma; VEI&nbsp;7; over  of the Otowi Member (Lower Bandelier Tuff) eruption.\n*Ebisutoge-Fukuda tephras, Japan; 1.75&nbsp;Ma;  of tephra.\n*Yellowstone hotspot; Island Park Caldera (size: 100 x 50&nbsp;km); 2.1&nbsp;Ma; VEI&nbsp;8;  of Huckleberry Ridge Tuff.\n*Cerro Galán (size: 32&nbsp;km wide), Catamarca Province, northwestern Argentina; 2.2&nbsp;Ma; VEI&nbsp;8;   of Cerro Galán Ignimbrite.\nLarge Neogene eruptions\nPliocene eruptions\nApproximately 5.332&nbsp;million years BP, the Pliocene epoch begins. Most eruptions before the Quaternary period have an unknown VEI.\n*Boring Lava Field, Boring, Oregon, USA; the zone became active at least 2.7&nbsp;Ma, and has been extinct for about 300,000 years.\n*Norfolk Island, Australia; remnant of a basaltic volcano active around 2.3 to 3&nbsp;Ma.\n*Pastos Grandes Caldera (size: 40 x 50&nbsp;km), Altiplano-Puna volcanic complex, Bolivia; 2.9&nbsp;Ma; VEI&nbsp;7; more than   of Pastos Grandes Ignimbrite.\n*Little Barrier Island, northeastern coast of New Zealand's North Island; it erupted from 1&nbsp;million to 3&nbsp;Ma. 3. It is ok, before the Quaternary there is no claim that it is VEI-6 or equivalent -->\n*Mount Kenya; a stratovolcano created approximately 3&nbsp;Ma after the opening of the East African rift.\n*Pacana Caldera (size: 60 x 35&nbsp;km), Altiplano-Puna Volcanic Complex, northern Chile; 4&nbsp;Ma; VEI&nbsp;8;  of Atana Ignimbrite.\n*Frailes Plateau, Bolivia; 4&nbsp;Ma;  of Frailes Ignimbrite E.\n*Cerro Galán (size: 32&nbsp;km wide), Catamarca Province, northwestern Argentina; 4.2&nbsp;Ma;  of Real Grande and Cueva Negra tephra.\n*Yellowstone hotspot, Heise volcanic field, Idaho; Kilgore Caldera (size: 80 x 60&nbsp;km); VEI&nbsp;8;  of Kilgore Tuff; 4.45&nbsp;Ma ±0.05.\n*Khari Khari Caldera, Frailes Plateau, Bolivia; 5&nbsp;Ma;  of tephra.\nMiocene eruptions\nin New Zealand occurred about 9 million years ago.]]\ntook place around 14 million years ago.]]\nApproximately 23.03&nbsp;million years BP, the Neogene period and Miocene epoch begin.\n* Cerro Guacha, Bolivia; 5.6–5.8&nbsp;Ma (Guacha ignimbrite).\n*Lord Howe Island, Australia; Mount Lidgbird and Mount Gower are both made of basalt rock, remnants of lava flows that once filled a large volcanic caldera 6.4&nbsp;Ma.\n*Yellowstone hotspot, Heise volcanic field, Idaho; 5.51&nbsp;Ma ±0.13 (Conant Creek Tuff).\n*Yellowstone hotspot, Heise volcanic field, Idaho; 5.6&nbsp;Ma;  of Blue Creek Tuff.\n*Cerro Panizos (size: 18&nbsp;km wide), Altiplano-Puna Volcanic Complex, Bolivia; 6.1&nbsp;Ma;  of Panizos Ignimbrite.\n*Yellowstone hotspot, Heise volcanic field, Idaho; 6.27&nbsp;Ma ±0.04 (Walcott Tuff).\n*Yellowstone hotspot, Heise volcanic field, Idaho; Blacktail Caldera (size: 100 x 60&nbsp;km), Idaho; 6.62&nbsp;Ma ±0.03;  of Blacktail Tuff.\n*Pastos Grandes Caldera (size: 40 x 50&nbsp;km), Altiplano-Puna Volcanic Complex, Bolivia; 8.3&nbsp;Ma;  of Sifon Ignimbrite.\n*Manus Island, Admiralty Islands, northern Papua New Guinea; 8–10&nbsp;Ma\n*Banks Peninsula, New Zealand; Akaroa erupted 9&nbsp;Ma, Lyttelton erupted 12&nbsp;Ma.\n*Mascarene Islands were formed in a series of undersea volcanic eruptions 8–10&nbsp;Ma, as the African plate drifted over the Réunion hotspot.\n*Yellowstone hotspot, Twin Fall volcanic field, Idaho; 8.6 to 10&nbsp;Ma.\n*Yellowstone hotspot, Grey's Landing Supereruption, Idaho; 8.72 Ma,  of Grey's Landing Ignimbrite.\n*Yellowstone hotspot, McMullen Supereruption, Idaho; 8.99 Ma,  of volcanic material\n*Yellowstone hotspot, Picabo volcanic field, Idaho; 10.21&nbsp;Ma ± 0.03 (Arbon Valley Tuff).\n*Mount Cargill, New Zealand; the last eruptive phase ended some 10&nbsp;Ma. The center of the caldera is about Port Chalmers, the main port of the city of Dunedin. Much of the caldera is filled by Otago Harbour.\n*Yellowstone hotspot, Idaho; Bruneau-Jarbidge volcanic field; 10.0 to 12.5&nbsp;Ma (Ashfall Fossil Beds eruption).\n*Anahim hotspot, British Columbia, Canada; has generated the Anahim Volcanic Belt over the last 13 million years.\n*Yellowstone hotspot, Owyhee-Humboldt volcanic field, Nevada/ Oregon; around 12.8 to 13.9&nbsp;Ma.\n*Tejeda Caldera, Gran Canaria, Spain; 13.9&nbsp;Ma; the 80 km3 eruption produced a composite ignimbrite (P1) of rhyolite, trachyte and basaltic materials, with a thickness of 30 metres at 10&nbsp;km from the caldera center\n*Gran Canaria shield basalt eruption, Spain; 14.5 to 14&nbsp;Ma; 1,000 km3 of tholeiitic to alkali basalts\n*Campi Flegrei, Naples, Italy; 14.9&nbsp;Ma;  of Neapolitan Yellow Tuff.\n*Huaylillas Ignimbrite, Bolivia, southern Peru, northern Chile; 15&nbsp;Ma ±1;  of tephra.\n*Yellowstone hotspot, McDermitt volcanic field (North), Trout Creek Mountains, Whitehorse Caldera (size: 15&nbsp;km wide), Oregon; 15&nbsp;Ma;  of Whitehorse Creek Tuff.\n*Yellowstone hotspot (?), Lake Owyhee volcanic field; 15.0 to 15.5&nbsp;Ma.\n*Yellowstone hotspot, McDermitt volcanic field (South), Jordan Meadow Caldera, (size: 10–15&nbsp;km wide), Nevada/ Oregon; 15.6&nbsp;Ma;  Longridge Tuff member 2–3.\n*Yellowstone hotspot, McDermitt volcanic field (South), Longridge Caldera, (size: 33&nbsp;km wide), Nevada/ Oregon; 15.6&nbsp;Ma;  Longridge Tuff member 5.\n*Yellowstone hotspot, McDermitt volcanic field (South), Calavera Caldera, (size: 17&nbsp;km wide), Nevada/ Oregon; 15.7&nbsp;Ma;  of Double H Tuff.\n*Yellowstone hotspot, McDermitt volcanic field (South), Hoppin Peaks Caldera, 16&nbsp;Ma; Hoppin Peaks Tuff.\n*Yellowstone hotspot, McDermitt volcanic field (North), Trout Creek Mountains, Pueblo Caldera (size: 20 x 10&nbsp;km), Oregon; 15.8&nbsp;Ma;  of Trout Creek Mountains Tuff.\n*Yellowstone hotspot, McDermitt volcanic field (South), Washburn Caldera, (size: 30 x 25&nbsp;km wide), Nevada/ Oregon; 16.548&nbsp;Ma;  of Oregon Canyon Tuff.\n*Yellowstone hotspot (?), Northwest Nevada volcanic field (NWNV), Virgin Valley, High Rock, Hog Ranch, and unnamed calderas; West of Pine Forest Range, Nevada; 15.5 to 16.5&nbsp;Ma.\n*Yellowstone hotspot, Steens and Columbia River flood basalts, Pueblo, Steens, and Malheur Gorge-region, Pueblo Mountains, Steens Mountain, Washington, Oregon, and Idaho, USA; most vigorous eruptions were from 14 to 17&nbsp;Ma;  of lava.\n*Mount Lindesay (New South Wales), Australia; is part of the remnants of the Nandewar extinct volcano that ceased activity about 17&nbsp;Ma after 4 million years of activity.\n*Oxaya Ignimbrites, northern Chile (around 18°S); 19&nbsp;Ma;  of tephra.\n*Pemberton Volcanic Belt was erupting about 21 to 22&nbsp;Ma.\nVolcanism before the Neogene\n.]]\n*Paleogene ends 23 million years ago.\n**The formation of the Chilcotin Group basalts occurs between 10–6 million years ago.\n**The formation of the Columbia River Basalt Group occurs between 17 and 6 million years ago.\n**La Garita Caldera erupts in the Wheeler Geologic Area, Central Colorado volcanic field, Colorado, USA, eruption several VEI 8 events (Possibly as high as a VEI 9),  of Fish Canyon Tuff was blasted out in a single, major eruption about 27.8 million years ago.\n**Unknown source in Ethiopia erupts 29 million years ago with at least  of Green Tuff and SAM.\n**Sam Ignimbrite in Yemen forms 29.5 million years ago, at least  of distal tuffs associated with the ignimbrites.\n**Jabal Kura’a Ignimbrite in Yemen forms 29.6million years ago, at least  of distal tuffs associated with the ignimbrites.\n**The Ethiopian Highlands flood basalt begins 30 million years ago\n*About 33.9 million ago, the Oligocene epoch of the Paleogene period begins\n**The Mid-Tertiary ignimbrite flare-up begins 40 million years ago and lasts until 25 million years ago.\n**Bennett Lake Volcanic Complex erupts 50 million years ago with a VEI 7  of tephra.\n**Canary hotspot is believed to have first appeared about 60 million years ago.\n**Formation of the Brito-Arctic province begins 61 million years ago\n**Réunion hotspot, Deccan Traps, India, formed between 60 and 68 million years ago which are thought to have played a role in the Cretaceous–Paleogene extinction event.\n**The Louisville hotspot has produced the Louisville Ridge, it is active for at least 80 million years. It may have originated the Ontong Java Plateau around 120 million years ago.\n**Hawaii hotspot, Meiji Seamount is the oldest extant seamount in the Hawaiian-Emperor seamount chain, with an estimated age of 82 million years.\n**The Kerguelen Plateau begins forming 110 million years ago.\n**The Rahjamal Traps form from 117 to 116 million years ago.\n**The Ontong Java Plateau forms from 125 to 120 million years ago\n**Paraná and Etendeka traps, Brazil, Namibia and Angola form 128 to 138 million years ago. 132 million years ago, a possible supervolcanic eruption occurred, ejecting .\n**Formation of the Karoo-Ferrar flood basalts begins 183 million years ago.\n*The flood basalts of the Central Atlantic magmatic province are thought to have contributed to the Triassic–Jurassic extinction event about 199 million years ago.\n*The Siberian Traps are thought to have played a significant role in the Permian–Triassic extinction event 252 million years ago.\n**Formation of the Emeishan Traps began 260 million years ago.\n*The Late Devonian extinction occurs about 374 million years ago.\n*The Ordovician–Silurian extinction event occurs between 450 and 440 million years ago.\n**Glen Coe, Scotland; VEI 8; 420 million years ago\n**Scafells, Lake District, England; VEI 8; Ordovician (488.3–443.7 million years ago).\n**Flat Landing Brook; VEI 8, A Supervolcanic eruption occurred 466 million years ago, as it erupted in one of the largest explosive volcanic eruptions known in Earth's history with a volume of ejecta at around .\n*The Phanerozoic eon begins 539 million years ago.\n**Midcontinent Rift System of North America begins forming 1,000 million years ago.\n**Mackenzie Large Igneous Province forms 1,270 million years ago.\n**Mistassini dike swarm and Matachewan dike swarm form 2,500 million years ago.\n**Blake River Megacaldera Complex forms 2,704–2,707 million years ago.\n*Approximately 2,500 million years ago, the Proterozoic eon of the Precambrian period begins\n*About 3,800 million years ago, the Archean eon of the Precambrian period begins\nNotes\n*The Mackenzie Large Igneous Province contains the largest and best-preserved continental flood basalt terrain on Earth. The Mackenzie dike swarm throughout the Mackenzie Large Igneous Province is also the largest dike swarm on Earth, covering an area of .\n*The Bachelor (27.4 Ma), San Luis (27–26.8 Ma), and Creede (26 Ma) calderas partially overlap each other and are nested within the large La Garita (27.6 Ma) caldera, forming the central caldera cluster of the San Juan volcanic field, Wheeler Geologic Area, La Garita Wilderness. Creede, Colorado and San Luis Peak (Continental Divide of the Americas) are nearby. North Pass Caldera is northeastern the San Juan Mountains, North Pass. The Platoro volcanic complex lies southeastern of the central caldera cluster. The center of the western San Juan caldera cluster lies just west of Lake City, Colorado.\n*The Rio Grande rift includes the San Juan volcanic field, the Valles Caldera, the Potrillo volcanic field, and the Socorro-Magdalena magmatic system. The Socorro Magma Body is uplifting the surface at approximately 2&nbsp;mm/year.\n*The southwestern Nevada volcanic field, or Yucca Mountain volcanic field, includes: Stonewall Mountain caldera complex, Black Mountain Caldera, Silent Canyon Caldera, Timber Mountain – Oasis Valley caldera complex, Crater Flat Group, and Yucca Mountain. Towns nearby: Beatty, Mercury, Goldfield. It is aligned as a Crater Flat volcanic field, Réveille Range, Lunar Crater volcanic field, Zone (CFLC). The Marysvale Volcanic Field, southwestern Utah is nearby too.\n*McDermitt volcanic field, or Orevada rift volcanic field, Nevada/ Oregon, nearby are: McDermitt, Trout Creek Mountains, Bilk Creek Mountains, Steens Mountain, Jordan Meadow Mountain (6,816&nbsp;ft), Long Ridge, Trout Creek, and Whitehorse Creek.\n*Emmons Lake stratovolcano (caldera size: 11 x 18&nbsp;km), Aleutian Range, was formed through six eruptions. Mount Emmons, Mount Hague, and Double Crater are post-caldera cones.\n*The topography of the Basin and Range Province is a result of crustal extension within this part of the North American Plate (rifting of the North American craton or Laurentia from Western North America; e.g. Gulf of California, Rio Grande rift, Oregon-Idaho graben). The crust here has been stretched up to 100% of its original width. In fact, the crust underneath the Basin and Range, especially under the Great Basin (includes Nevada), is some of the thinnest in the world.\n*Topographically visible calderas: South part of the McDermitt volcanic field (four overlapping and nested calderas), West of McDermitt; Cochetopa Park Caldera, West of the North Pass; Henry's Fork Caldera; Banks Peninsula, New Zealand (Photo) and Valles Caldera. Newer drawings show McDermitt volcanic field (South), as five overlapping and nested calderas. Hoppin Peaks Caldera is included too.\n*Repose periods: Toba (0.38 Ma), Valles Caldera (0.35 Ma), Yellowstone Caldera (0.7 Ma).\n*Kiloannum (ka), is a unit of time equal to one thousand years. Megaannum (Ma), is a unit of time equal to one million years, one can assume that \"ago\" is implied.\nVolcanic explosivity index (VEI)\n{| class=\"wikitable\"\n! VEI || Tephra Volume(cubic kilometers) || Example\n|-\n| 0 || Effusive || Masaya Volcano, Nicaragua, 1570\n|-\n| 1 || >0.00001 || Poás Volcano, Costa Rica, 1991\n|-\n| 2 || >0.001 || Mount Ruapehu, New Zealand, 1971\n|-\n| 3 || >0.01 || Nevado del Ruiz, Colombia, 1985\n|-\n| 4 || >0.1 || Eyjafjallajökull, Iceland, 2010\n|-\n| 5 || >1 || Mount St. Helens, United States, 1980\n|-\n| 6 || >10 || Mount Pinatubo, Philippines, 1991\n|-\n| 7 || >100 || Mount Tambora, Indonesia, 1815\n|-\n| 8 || >1000 || Yellowstone Caldera, United States, Pleistocene\n|}\n&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;\nVolcanic dimming\nThe global dimming through volcanism (ash aerosol and sulfur dioxide) is quite independent of the eruption VEI. When sulfur dioxide (boiling point at standard state: -10&nbsp;°C) reacts with water vapor, it creates sulfate ions (the precursors to sulfuric acid), which are very reflective; ash aerosol on the other hand absorbs ultraviolet. Global cooling through volcanism is the sum of the influence of the global dimming and the influence of the high albedo of the deposited ash layer. The lower snow line and its higher albedo might prolong this cooling period. Bipolar comparison showed six sulfate events: Tambora (1815), Cosigüina (1835), Krakatoa (1883), Agung (1963), and El Chichón (1982), and the 1808 mystery eruption. And the atmospheric transmission of direct solar radiation data from the Mauna Loa Observatory (MLO), Hawaii (19°32'N) detected only five eruptions:\n*June 11, 2009, Sarychev Peak (?), Kuril Islands, 400 tons of tephra, VEI&nbsp;4\n**\n*June 12–15, 1991 (eruptive climax), Mount Pinatubo, Philippines, 11,000 ±0.5 tons of tephra, VEI&nbsp;6\n**Global cooling: 0.5&nbsp;°C,\n*March 28, 1982, El Chichón, Mexico, 2,300 tons of tephra, VEI&nbsp;5\n**\n*October 10, 1974, Volcán de Fuego, Guatemala, 400 tons of tephra, VEI&nbsp;4\n**\n*February 18, 1963, Mount Agung, Lesser Sunda Islands, 100 tons of lava, more than 1,000 tons of tephra, VEI&nbsp;5\n**Northern Hemisphere cooling: 0.3&nbsp;°C,\n&nbsp;\nBut very large sulfur dioxide emissions overdrive the oxidizing capacity of the atmosphere. Carbon monoxide's and methane's concentration goes up (greenhouse gases), global temperature goes up, ocean's temperature goes up, and ocean's carbon dioxide solubility goes down.\nImage:Tephra fall from 1991 eruption of Mt Pinatubo.gif|Location of Mount Pinatubo, showing area over which ash from the 1991 eruption fell.\nImage:TOMS AI Jun16 91.gif|Satellite measurements of ash and aerosol emissions from Mount Pinatubo.\nImage:Mauna Loa atmospheric transmission.png|MLO transmission ratio - Solar radiation reduction due to volcanic eruptions\nImage:Aerosol dimming.jpg|NASA, Global Dimming - El&nbsp;Chichon, VEI&nbsp;5; Pinatubo, VEI&nbsp;6.\nImage:TOMS SO2 time nov03.png|Sulfur dioxide emissions by volcanoes. Mount Pinatubo: 20 million tons of sulfur dioxide.\nImage:TOMS SO2 Jun17 91.gif|TOMS sulfur dioxide from the June 15, 1991 eruption of Mount Pinatubo.\nImage:Sarychev Eruption Generates Large Cloud of Sulfur Dioxide.png|Sarychev Peak: the sulphur dioxide cloud generated by the eruption on June 12, 2009 (in Dobson units).\nMap gallery\nImage:Yellowstone Major Calderas Map.jpg|Yellowstone sits on top of four overlapping calderas. (US NPS)\nImage:IPCaldera.jpg|Diagram of Island Park and Henry's Fork Caldera.\nImage:Wpdms shdrlfi020l harney basin.jpg|Harney Basin, Steens Mountain, Owyhee and Malheur River.\nImage:Steens Mountain relief map.png|Steens Mountain, McDermitt volcanic field and Oregon/ Nevada stateline.\nImage:HotspotsSRP_update2013.JPG|Location of Yellowstone Hotspot in Millions of Years Ago.\nImage:SnakeRiver.jpg|Snake River Plain, image from NASA's Aqua satellite, 2008\nImage:Wfm area51 map en.png|Location of Yucca Mountain in southern Nevada, to the west of the Nevada Test Site.\nImage:Santa Fe National Forest Jemez District.jpg|Jemez Ranger District and Jemez Mountains, Santa Fe National Forest.\nSee also\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nReferences\nFurther reading\n*\n*\n*\n*\n*\n* ).\n*\n*\n*\n*\n*United States Geological Survey; Cascades Volcano Observatory, Vancouver, Washington; [https://vulcan.wr.usgs.gov/Volcanoes/framework.html Index to CVO online volcanoes]\n**Map: Tom Simkin, Robert I. Tilling, Peter R. Vogt, Stephen H. Kirby, Paul Kimberly, and David B. Stewart, Third Edition (Published 2006) [http://mineralsciences.si.edu/tdpmap/ interactive world map of Volcanoes, Earthquakes, Impact Craters, and Plate Tectonics]\n*\n**Supplementary Table I:\n**Supplementary Table II:\nExternal links\n* [https://volcano.oregonstate.edu/ Volcano World Information]\n* [http://www.volcanolive.com/index.html Volcano Live, John Seach]\n* [http://www.kscnet.ru/ivs/volcanoes/holocene/main/main.htm Holocene Volcanoes in Kamchatka]\n* [https://www.volcano.group.cam.ac.uk/database/caldera-results.xls Reference Database of the International Association of Volcanology (XLS file)]\n* [https://www.volcano.group.cam.ac.uk/database/ignimbrite-results.xls Reference Database of Chemistry of the Earth’s Interior (XLS file)]\n* [https://web.archive.org/web/20170617165248/ftp://ftp.ncdc.noaa.gov/pub/data/paleo/icecore/greenland/summit/gisp2/chem/volcano.txt Volcanic sulfate record in the GISP2 core (ftp protocol)]"
    }
  ]
}