{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of strikes in 2005\n\nIn 2005, a number of labour strikes, labour disputes, and other industrial actions occurred.\nBackground\nA labour strike is a work stoppage caused by the mass refusal of employees to work. This can include wildcat strikes, which are done without union authorisation, and slowdown strikes, where workers reduce their productivity while still carrying out minimal working duties. It is usually a response to employee grievances, such as low pay or poor working conditions. Strikes can also occur to demonstrate solidarity with workers in other workplaces or pressure governments to change policies.\nTimeline\nContinuing strikes from 2004\n* Bolivian gas conflict\nJanuary\n* 2005 Belize unrest\n* 2005–06 Cameroon Airlines strike\n* 2005 Malawi judges strike, strike by judges in Malawi demanding replacement of the government-issued cars.\nFebruary\n* 2005 Quebec student protests\nMarch\n* 2005 Citroën strike, strike by Citroën autoworkers in France.\n* 2005 Cyprus Airways strike, strike by Cyprus Airways stewards and pilots after 22 stewards were fired.\n* 2005 Škoda strike, strike by Škoda Auto workers in Czechia, the first strike in Škoda history.\nApril\n* Ecuadorian Revolution of 2005\nMay\n* 2005 BBC strike\n* 2005 HSBC strike, the first strike in the banking sector in the United Kingdom in eight years.\nJune\n* 2-day general strike in Zimbabwe against Operation Murambatsvina.\n* 2005 Greek bank strikes\n* 2005 Honda India strike, strike by Honda Motorcycle and Scooter India workers.\n* 2005 Hydro One strike, 105-day strike by Hydro One workers in Ontario, Canada.\n* 2005 Vancouver truckers' strike\nJuly\n* 2005 Asiana Airlines strike, strike by Asiana Airlines pilots in South Korea.\n* Guantanamo Bay hunger strikes\n* 2005 India tea strike, by tea industry workers in India.\n* 2005 South African Airways strike\n* Taishi Village Incident, including hunger strikes, for the removal of the head of the villagers' committee in Taishi, Guangzhou, China.\n* 2005 Tongan public service strike\nAugust\n* 2005 Air Vanuatu strike\n* 2005–06 Northwest Airlines strike, strike by Northwest Airlines mechanists in the United States.\n* 2005 Qatari construction workers strike\nSeptember\n* 2005 Boeing machinists strike\n* 2005 SNCM strike, 24-day strike by Société nationale maritime Corse Méditerranée ferry workers in Corsica, represented by the Corsican Workers' Trade Union.\nOctober\n* 2005 Belgian general strike\n* 2005 British Columbian teachers' strike, 2-week strike by teachers in British Columbia, Canada, represented by the British Columbia Teachers' Federation.\n* 2005 Lakeside Packers strike, 3-week strike by Lakeside Packers workers in Alberta, Canada.\nNovember\n* 2005 Bulgarian teachers' strike\n* 2005–06 NYU strike, strike by New York University graduate students, represented by the Graduate Student Organizing Committee.\n* 2005 Société Le Nickel strike, strike by Société Le Nickel miners in New Caledonia.\n* 2005 Spanish miners' strike\nDecember\n* 2005 Beijing News strike, strike by journalists at The Beijing News after editor-in-chief Yang Bin and two other editors were fired.\n* 2005 New York City transit strike\nList of lockouts in 2005\n* 2004–05 NHL lockout\nCommentary\nAccording to Statistics Netherlands, there were 28 strikes in the Netherlands in 2005, the highest number since 1991, but with less working days lost compared to 2004.\nReferences"
    }
  ]
}