{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of snowflake research\n\nThe hexagonal snowflake, a crystalline formation of ice, has intrigued people throughout history. This is a chronology of interest and research into snowflakes. Artists, philosophers, and scientists have wondered at their shape, recorded them by hand or in photographs, and attempted to recreate hexagonal snowflakes.\nWilson Alwyn Bentley (February 9, 1865 – December 23, 1931), also known as Snowflake Bentley, was an American meteorologist and photographer, who was the first known person to take detailed photographs of snowflakes and record their features.[1] He perfected a process of catching flakes on black velvet in such a way that their images could be captured before they either melted or sublimated.\nChronological list\nBC to 1900\n*  or  - Han Ying (韓嬰) compiled the anthology Han shi waizhuan, which includes a passage that contrasts the pentagonal symmetry of flowers with the hexagonal symmetry of snow. This is discussed further in the Imperial Readings of the Taiping Era.\n* 1250 - Albertus Magnus offers what is believed to be the oldest detailed description of snow.\n* 1555 - Olaus Magnus publishes the earliest snowflake diagrams in Historia de gentibus septentrionalibus.\n* 1611 - Johannes Kepler, in Strenaseu De Nive Sexangula, attempts to explain why snow crystals are hexagonal.\n* 1637 - René Descartes' Discourse on the Method includes hexagonal diagrams and a study for the crystallization process and conditions for snowflakes.\n* 1660 - Erasmus Bartholinus, in his De figura nivis dissertatio, includes sketches of snow crystals.\n* 1665 - Robert Hooke observes snow crystals under magnification in Micrographia.\n* 1675 - Friedrich Martens, a German physician, catalogues 24 types of snow crystal.\n* 1681 - Donato Rossetti categorizes snow crystals in La figura della neve.\n* 1778 - Dutch theologian Johannes Florentius Martinet diagrams precise sketches of snow crystals.\n* 1796 - Shiba Kōkan publishes sketches of ice crystals under a microscope.\n* 1820 - William Scoresby's An account of the Arteic Regions includes snow crystals by type.\n* 1832 - Doi Toshitsura describes and diagrams 86 types of snowflake (雪華図説).\n* 1837 -  publishes Hokuetsu Seppu.\n* 1840 - Doi Toshitsura expands his categories to include 97 types.\n* 1855 - James Glaisher publishes detailed sketches of snow crystals under a microscope.\n* 1865 - Frances E. Chickering publishes Cloud Crystals - a Snow-Flake Album.\n* 1870 - Adolf Erik Nordenskiöld identifies \"cryoconite holes.\"\n* 1872 - John Tyndall publishes The Forms of Water in Clouds and Rivers, Ice and Glaciers.\n* 1891 - Friedrich Umlauft publishes Das Luftmeer.\n* 1893 - Richard Neuhauss photographs a snowflake under a microscope, titled Schneekrystalle.\n* 1894 - A. A. Sigson photographs snowflakes under a microscope.\n1901 to 2000\n* 1901 - Wilson Bentley publishes a series of photographs of individual snowflakes in the Monthly Weather Review.\n* 1903 - Svante Arrhenius describes crystallization process in Lehrbuch der Kosmischen Physik.\n* 1904 - Helge von Koch discover the fractal curves to be a mathematical description of snowflakes.\n* 1931 - Wilson Bentley and William Jackson Humphreys publish Snow Crystals\n* 1936 - Ukichiro Nakaya creates snow crystals and charts the relationship between  temperature and water vapor saturation, later called the Nakaya Diagram.\n* 1938 - Ukichiro Nakaya publishes\n* 1949 - Ukichiro Nakaya publishes\n* 1952 - Marcel R. de Quervain et al. define ten major types of snow crystals, including hail and graupel in IUGG for the Swiss Federal Institute for Snow and Avalanche Research.\n* 1954 - Harvard University Press publishes Ukichiro Nakaya's Snow Crystals: Natural and Artificial.\n* 1960 - , verifies and improves the Nakaya Diagram with the Kobayashi Diagram.\n* 1962 -  describes meteorological sorting of snow crystal types in clouds.\n*1979 -  and Rolf Lacmann, of the Braunschweig University of Technology, publish Growth Mechanism of Ice from Vapour Phase and its Growth Forms.\n* 1983 August - Astronauts make snow crystals in orbit on the Space Shuttle Challenger during mission STS-8.\n* 1988 -  et al. make artificial snow crystals in an updraft, confirming the Nakaya Diagram.\n2001 and after\n* 2002 -  devises a simple snow crystal growth observatory apparatus using a PET bottle cooled by dry ice in an expanded polystyrene box.\n* 2004 September -  invented the apparatus named lit. Murai-method Artificial Snow Crystal producer (Murai式人工雪結晶生成装置) which makes various shape of artificial snow crystals per pre-setting conditions meeting to Nakaya diagram by vapor generator and its cooling Peltier effect element.\n* 2008 December -  demonstrates conditional snow crystal growth in space, in Solution Crystallization Observation Facility (SCOF) on the JEM (Kibō), remotely controlled from Tsukuba Space Center of JAXA.\nNotes and references\nSources cited\n*\n*\n*\n*\nSee also\n* Snowflakes\n* Ice crystal\n* Snow science\nExternal links\n*[http://dujs.dartmouth.edu/wp-content/uploads/2008/04/snowflakes1.pdf The history of the science of snowflakes]\n*[http://iss.jaxa.jp/library/video/ice_crystal_081202.html Movie: Snow Crystal growth in space by JAXA on 2 December 2008] (3 times fast replay) (in Japanese)\n*[http://SnowCrystals.com SnowCrystals.com]"
    }
  ]
}