{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of LGBTQ Mormon history in the 1970s\n\nThis is a timeline of LGBT Mormon history in the 1970s, part of a series of timelines consisting of events, publications, and speeches about LGBTQ+ individuals, topics around sexual orientation and gender minorities, and the community of members of the Church of Jesus Christ of Latter-day Saints (LDS Church). Although the historical record is often scarce, evidence points to queer individuals having existed in the Mormon community since its beginnings. However, top LDS leaders only started regularly addressing queer topics in public in the late 1950s. Since 1970, the LDS Church has had at least one official publication or speech from a high-ranking leader referencing LGBT topics every year, and a greater number of LGBT Mormon and former Mormon individuals have received media coverage.\nTimeline\n1970\n* 1970 – Church leaders released the ''Bishop's Training Course and Self-Help Guide for leaders which stated, \"[t]hough many have been told [homosexuality] is incurable, that is not true.\"\n* 1970 – The church produced Hope for Transgressors'' in which apostles Spencer W. Kimball and Mark E. Petersen offer ideas to leaders about how to effect a \"total cure\" and \"bring the lives of [men with homosexual tendencies] into total normalcy\" and \"help these people recover\" (lesbians are only mentioned once). Ideas include prayer, cutting off contact with homosexual friends, dating women and marriage, and scripture reading. He calls homosexuality a \"despicable\", \"degraded\", \"dread practice\", and a \"perversion\" that would \"doom the world\" while labeling the person a \"generally lonely and sensitive\" \"deviate\" and \"afflicted one\". The guide notes that Kimball and Mark E. Petersen were designated as the church specialists on homosexuality, and that homosexuality is not \"totally\" the fault of \"family conditions\" and concludes it \"CAN be cured if the battle is well organized and pursued vigorously and continuously\" (emphasis in the original).\n* March – The First Presidency under Joseph Fielding Smith sent a letter to stake presidents on March 19 which expressed concern over \"the apparent increase in homosexuality and other deviations\" and mentioned the 1959 assignment of apostles Kimball and Mark E. Petersen to help homosexuals. It was indicated that Kimball and Petersen would \"send material and give counsel\" as church specialists over \"a program designed ... to counsel and direct [homosexuals] back to normalcy and happiness\". A follow-up letter to leaders on December 23 asked them to \"ask direct questions\" about homosexuality when conducting pre-mission interviews. Within eight years they had counseled over one thousand individuals.\n* April – Victor L. Brown of the Presiding Bishopric gave a General Conference address in which he stated that a \"normal\" and \"healthy\" 12- or 13-year-old boy or girl could \"develop into a homosexual\" if \"exposed to pornographic literature\" and \"abnormalities\". He explains that exposure to the material would \"crystallize and settle their habits for the rest of their lives\", while calling recent media reporting on a same-sex marriage \"filth on our newsstands\".\n* April – LDS director of the Salt Lake City police department sex crimes division Max Yospe stated that the problem of homosexuality was growing in Salt Lake City and that lots of bisexual men who were pillars of the community and active in civic and church affairs would go out every few months and \"get involved with homosexual activity\" which was a felony. He also noted that homosexual women have an easier time avoiding detection or legal issues.\n* May – Yospe also stated that, \"homosexuality is against the law and we've sworn to uphold the law.\" Though he did not believe they had the staffing \"to really clamp down on the thing as we should,\" occasionally plain-clothes officers would impersonate homosexual men to entrap them.\n* May – An anonymous Salt Lake, Mormon-raised lesbian woman stated in the University of Utah newspaper that she had never seen such terror and hysteria as when her mother had confronted her one time over suspicions that her daughter was gay.\n* August – Church president Harold B. Lee taught that the \"so-called 'transsexuality' doctrine\" was hellish and false since God did not place female spirits in male bodies and vice versa.\n* September – The church's newspaper published an editorial defending the ban on consensual same-sex sexual activity arguing that removing the ban, along with other restrictions would be \"dangerous\" and contribute to far greater problems in the future.\n* October – Apostle Howard W. Hunter asked \"what will be the result of universal free love, abortions at will, homosexuality?\" in reference to his fears about the future of family, the economy, community, and the \"deterioration of morality\" in a General Conference address.\ninfluential 1970s discourse on homosexuality (from the top: 1970, 1971, 1978)]]\n1971\n* 1971 – The church published a 34-page letter from Kimball to homosexual men titled New Horizons for Homosexuals. In it Kimball called homosexuality \"a ruinous practice of perversion\" that the church \"will never condone\" that begins with \"curiosity\" and \"an unholy practice\" like \"an octopus with numerous tentacles to drag [the person] down to [their] tragedy\". He states that saying \"perverts are ... born 'that way is a \"base lie\" since homosexuality is \"curable\" and \"can be overcome\" and \"recover[ed]\" from. The letter asserts \"God made no man a pervert\" or \"evil\" and that \"[t]o blame a weakness ... upon God is cowardly.\" It also calls homosexuality \"ugly\", \"degenerate\", \"unnatural\", \"vicious\", \"base\", a \"waste of power\", a \"deep sin\", and \"an end to the family and ... civilization\". The publication advises for the homosexual to recover they must \"shun\" anyone \"associated with the transgression\" and pray and read the scriptures.\n* February – The church's newspaper reported on a Salt Lake City company that gave polygraph tests to job applicants for over 130 local companies. One administrator stated a standard question was \"designed to catch homosexuals or lesbians, considered unemployable by many employers\".\n* February – LDS Idaho state representative Wayne LaMar Loveless criticized Idaho's proposed decriminalization of consensual adult same-sex sexual activity as an invitation to \"come out into the open\" whereas the previous ban \"at least ke[pt] them hidden from the public.\" Previously there had been no convictions for homosexuality in the state for years. The ban was  removed by January of next year but was restored within three months after controversy, however.\n* April – In general conference presiding bishopric counselor Victor L. Brown stated that God created masculine and feminine traits, and if gendered appearance and behavioral traits are ignored, it can lead to the \"reprehensible, tragic sin of homosexuality\".\n* April – In another conference address apostle Kimball called the decriminalization of consensual same-sex sexual activity a damnable heresy, and the voices speaking in favor of churches accepting homosexuals as ugly and loud.\n* May – The Salt Lake City University of Utah held its first official LGBT campus event and began hosting meetings for students in the Utah Gay Liberation Front drawing criticism from a local conservative newspaper.\n* December – Church News reported on LDS student body president Brent Romney at California State College at Fullerton who vetoed an official recognition of the Gay Student Union, despite it being overwhelmingly approved by the student senate.\n* December – In the Ensign, Assistant to the Twelve Bernard P. Brockbank stated that \"homosexual acts are inspired by the devil and are grievous sins in the sight of God\".\n* December – BYU religion professor and conservative writer Cleon Skousen published an article in Law and Order magazine (of which he was editor) and The Utah Independent stating that \"the corruption and subversion of free world governments by homosexual infiltration\" is a problem of great concern, and their \"object is not only to penetrate the diplomatic corps of government but also the armed services\". He additionally stated that Soviet agents are \"train[ed] in homosexual practices in order to penetrate the free world diplomatic services!\"\n1972\n* April – Idaho laws which barred same-sex sexual activity between consenting adults were reinstated on the 1st under heavy pressure from the LDS church after being repealed since January 1. Mormon state senator Wayne Loveless who spearheaded the effort stated that the previous law would \"encourage immorality and draw sexual deviates to the state.\" The reinstated law restored the old wording that \"every person who is guilty of the infamous crime against nature committed with mankind ... is punishable by imprisonment in the state prison for not less than five years.\"\n1973\n* 1973 – The church published its first leaders guide on homosexuality for bishops and stake presidents titled \"Homosexuality: Welfare Services Packet 1\". It posited that \"homosexual behavior\" begins by being \"molested\" while also stating \"not all who are molested become homosexual\". Additionally, it said homosexuality was a learned behavior and not inborn, and that members should flee from other gays. It also suggested that homosexuality is caused by \"a domineering mother and a passive father\" and that \"misunderstandings of sexuality among LDS people can contribute to homosexuality.\" As far as changing the sexual orientation of the person, the packet says that the lesbian \"needs to learn feminine behavior\", and the gay man \"must be introduced to and learn the heterosexual or 'straight' way of life ... and what a manly priesthood leader and father does\". The guide was written by BYU psychology professor Allen Bergin and LDS Social Services Personal Welfare director Victor L. Brown Jr. (the son of Presiding Bishop Victor L. Brown).\n* January – In an address to all students the president of BYU Dallin H. Oaks stated that the apostle Paul had listed those who participate in homosexual activity among his condemnation of the lawless and disobedient.\n* February – An update to church policies was published as a \"Statement on Homosexuality\" in the Correlation Department's Priesthood Bulletin saying \"homosexuality in men and women run counter ... to divine objectives.\"\n* July – The July Ensign contained an article by BYU psychology professor Allen Bergin on agency. The article portrays some homosexuals as \"psychologically disturbed persons\" who are \"compulsively driven to frequent and sometimes bizarre acts\". He cites two clients with \"compulsive or uncontrollable homosexuality\" caused by intense fear for the opposite sex, a lack of social skills for normal male-female relationships, and seeking security exclusively from the same sex. Bergin discusses the behaviorist sexual orientation change efforts he used to treat these individuals.\n* August – Four months before his death Church President Lee gave an address in which he warned young men to guard against the sin of Sodom and Gomorrah since homosexuality and adultery were both equally grievous sins second only to murder. He also noted the increasing acceptance of homosexuality.\n* October – Presiding bishop Victor L. Brown gave a conference address in which he called homosexuality a weapon in the battle for Satan's legions to enslave mankind and destroy the family.\n* November – An Ensign article stated that the homosexuality in the Canaanite's religions was part of what provoked God to have the Israelites \"utterly destroy\" the peoples of the region of Canaan.\n1974\n* March – BYU president Oaks delivered a speech on campus in which he spoke in favor of keeping criminal punishment for \"deviate sexual behavior\" such as private, consensual, same-sex sexual activity. The speech was later printed by the university's press.\n* June – While acting as the Church Commissioner of Health James O. Mason wrote the document \"Attitudes of The Church of Jesus Christ of Latter-day Saints Toward Certain Medical Problems\" approved of by the First Presidency which stated that homosexual acts were a physical perversion and church leaders were advised to use love and understanding to persuade and assist those who committed this transgression to repent and receive forgiveness.\n* July – The church's July edition of the Ensign magazine published the article \"I Have a Question\", in which a Mormon medical doctor states that homosexuals have \"chosen this way of life\" but \"can be helped\". Dr. Lindsay M. Curtis continues saying that \"homosexuals and lesbians seldom are happy people\" and their relationships are \"unnatural\", full of \"emotional problems\" and \"promiscuity\", and lacking in \"fidelity, trust, or loyalty\". Additionally, they try to recruit \"others into their practice ... in their tender, impressionable years\".\n* July – On July 10 church president Kimball gave a modified version of his \"Love vs. Lust\" address previously given in 1965. In this version he states that \"homosexuality and other forms of perversion are from the lower world\". He also calls the use of the word \"love\" by homosexual persons as a \"prostitution\" of the term citing homosexual behavior as taking and exploiting.\n* September – Kimball addressed the BYU student body stating that sex reassignment surgeries were an appalling travesty.\n* October – Kimball gave his October \"God Will Not be Mocked\" speech at general conference as the church's president in which he again stated that masturbation leads to homosexuality. He also said \"[e]very form of homosexuality is sin. Pornography is one of the approaches to that transgression.\"\n* November – First presidency member Eldon Tanner stated in the November Ensign that homosexuality was permitted and practiced to such an extent that the world was \"truly following the ways of Sodom and Gomorrah\".\n1975\n* 1975 – Advocate owner David B. Goodstein hired several gay Utah Mormons onto his San Francisco newspaper staff referring to them as the \"Mormon Mafia\". This included bisexual trans man Patrick Califia and gay male Robert Isaac McQueen as editor. McQueen had ceased involvement with the LDS church in 1964 shortly after his mission in Austria and was excommunicated in 1979 after publishing several church-critical articles on the LGBT-LDS intersection. He died from complications due to AIDS on 8 October 1989.\n* January – The church-operated university BYU began a purge in January to expel homosexual students under the direction of president Oaks. The purge included interrogations of fine arts and drama students and surveillance of Salt Lake City gay bars by BYU security. These activities were noted in the Salt Lake Tribune and the gay newspaper Advocate.\n* April – Utah's first gay newspaper Gayzette was published without a title for the first issue by the recently opened Gay Community Service Center, Utah's first gay resource center. It was later renamed, Salt Lick in January 1976. After a year without a Salt Lake City queer paper the Open Door was started in December 1977, and was later run by gay former Mormon Bob Waldrop from 1979 until it shut down in 1981.\n* May – The First Presidency sent a letter on May 30 to church leaders about the \"unfortunate problem of homosexuality\" encouraging them to not label people as homosexual because it makes the seem beyond solving to \"conquer the habit\".\n* June – The Ensign published an article by Presiding bishop Victor L. Brown which addressed parents stating that the \"lack of proper affection in the home can result in unnatural behavior in their children such as homosexuality.\"\n* September – LDS member Sergeant Leonard Matlovich was featured on the September 8 cover of Time magazine with the caption \"I Am a Homosexual\" for his challenging of the U.S. military ban against gay men and lesbian women. He was subsequently discharged from the military for openly stating his sexual orientation and excommunicated from the Church two months after the article was released.\n* October – Apostle Gordon B. Hinckley told the story in the October general conference of a \"tragic\" young man involved in \"deviant moral activity\" leading him to a bleak future without hope and preventing him from ever having a son. Hinckley described asking the homosexual young man about the influence of the media he consumed and of his male friends \"in similar circumstances\".\n(renamed in 1995, then again in 2019) were tasked with treating homosexual Mormons in 1972 and produced several important publications on homosexuality in 1973, 1995, and 1999.]]\n* October – Robert Blattner of LDS Social Services (which had been tasked by the church to treat homosexual members since 1972) gave an address at the Association of Mormon Counselors and Psychotherapists (AMCAP) annual conference. Blattner served as a special assistant to the LDS Commissioner of Personal Welfare Victor Brown Jr. In the address Blattner states that the causes of homosexuality in men are a \"disturbed family background\" of an \"absent father\" and \"usually\" a \"controlling mother\" and a \"lack of relationship with peers\", while for women he only says \"we don't have much information\". He also says homosexual behavior and alcoholism are similar. He is asked what \"the church's feelings are about electric shock ... behavior modification\" and answered the church had \"never made a statement on it\" but that \"most people coming to us can be helped by it\" in reference to BYU's aversion therapy research.\n* October – LDS psychologist Robert D. Card presented his research on changing sexual attractions on Mormon men and women using shock aversion and hypnosis techniques at the AMCAP conference. The goal of his treatment was eliminating same-sex sexual behavior and having his clients enter an opposite-sex marriage as was common among the Mormon approach to homosexual individuals before the 80s. Card was a prominent proponent of aversion therapy and held a patent on the penile plethysmograph for measuring male sexual arousal to determine when to administer vomit-inducing drugs or electric shocks while showing his clients gay pornography. He had clients referred to him by Utah judges and bishops.\n1976\n* 1976 – A version of the Church Handbook was released changing the 1968 reading of \"homo-sexual acts\" being grounds for a church court to \"moral transgression\" like \"homosexuality\". This change seemed to make Mormons vulnerable to church punishment for having a homosexual orientation alone even without sexual activity. From 1976 until 1989 under president Kimball the Church Handbook continued to call for church discipline for members attracted to the same sex even if they were celibate, equating merely being homosexual with the seriousness of acts of adultery and child molestation.\n* 1976 – A 20-year study was published showing that 10% of BYU men and 2% of BYU women indicated having had a \"homosexual experience\". In 1950, 1961, and 1972 BYU Sociology professor Wilford Smith conducted a survey of thousands of Mormon students at several universities including many from the BYU sociology department as part of a larger survey. He found that \"the response of Mormons [at BYU] did not differ significantly from the response of Mormons in state universities\".\n* March – BYU music professor Carlyle D. Marsden took his own life two days after being outed by an arrest during a series of police sting operations at an Orem rest stop.\n* September – Top church leaders on the BYU Board of Trustees approved then BYU president Dallin H. Oaks's Institute for Studies in Values and Human Behavior dedicated most heavily on research for evidence supporting church views on homosexuality. The primary assignment was writing a church-funded book on homosexuality to be published by a non-church source (in order to boost the book's scientific credibility). BYU psychologist Allen Bergin acted as the director, and book author. Institute member and church Social Services director Victor Brown Jr. wrote, \"Our basic theme is that truth lies with the scriptures and prophets, not with secular data or debate.\" Several dissertations were produced by the Values Institute before it closed in 1985.\n* October – President Spencer W. Kimball stated in conference that homosexuality can begin by viewing \"sex- and violence-oriented programs\" on network television and that homosexuality (among other sexual behaviors) will \"corrode the mind, snuff out self-esteem\", and cause unhappiness.\n* October – Apostle Packer gave the sermon \"To Young Men Only\" in the priesthood session of general conference. The sermon counseled against the \"perversion\" and \"wicked practices\" of men \"handling one another\" and having physical \"contact ... in unusual ways\". In the sermon, Packer commended a missionary who was upset after he \"floored\" his assigned male companion in response to unwanted sexual advances, saying \"somebody had to do it\". He further asserts that it is a \"malicious and destructive lie\" that \"some are born with an attraction to their own kind\". The sermon was published as a pamphlet by the church from 1980 to 2016.\n1977\n* 1977 – A gay BYU student and a gay BYU instructor coauthored an open letter to refute the anti-gay teachings of BYU professor Reed Payne known as the \"Payne Papers\" pamphlet (later titled \"Prologue\"). This was anonymously mailed to all high-ranking LDS leaders and most BYU and Ricks College faculty causing a controversy and eliciting a response from apostle Boyd K. Packer in the form of his \"To the One\" 1978 BYU address on homosexuality and an article from the recently formed BYU Values Institute.\n* 1977 – Deseret Book published then apostle Ezra Taft Benson's book which stated, \"Every form of homosexuality is wrong.\"\n* 1977 – The largely LDS Utah House of Representatives passed a bill outlawing same-sex marriages in the state by 71 votes to 3 without floor debate.\n* April – In the April general conference presiding bishopric member J. Richard Clarke told a story of a young man who claimed to have \"developed into a homosexual\" as part of attention-seeking rebellion against his distant father. In the address homosexuality was called a \"vitiating disease\" and \"prison\".\n* April – Another mention of homosexuality occurred in the April general conference when church president Spencer W. Kimball asked, \"Is this a time to terminate adultery and homosexual and lesbian activities, and return to faith and worthiness?\"\n* June – The Relief Society general president sent a telegram to Anita Bryant for her \"Save Our Children\" campaign which stated, \"On behalf of the one million members of the Relief Society ... we commend you, for your courageous and effective efforts in combatting [sic] homosexuality and laws which would legitimize this insidious life style [sic].\"\n* June – Under the name Affirmation: Gay Mormons United, the first Affirmation group was organized on 11 June in Salt Lake City by Stephan Zakharias (formerly Stephen James Matthew Prince) and a group of other Mormon and former-Mormon gays and lesbians at the conference for the Salt Lake Coalition for Human Rights. Stephan organized the group in response to the suicides of two BYU friends who had undergone shock aversion therapy on the campus. The original organization struggled to survive until 1978, when Paul Mortensen, inspired by an article on the group in The Advocate formed the Los Angeles chapter, and in 1980 the name was changed to Affirmation: Gay & Lesbian Mormons. Through the influence of the Los Angeles chapter, Affirmation groups began appearing in many cities around the US.\n* July – Apostle Mark Petersen wrote an editorial in the Church News stating that every right-thinking should sustain Anita Bryant and should look at their own neighborhoods to determine how \"infiltrated\" they had become with gay people. He also wrote that \"homosexual offenses\" were next to murder in the hierarchy of sins. Deseret News editorials were sent to top church leaders for approval before publication. Within the span of two years after that first article Petersen penned five more Church News editorials attacking the gay rights movement:\n#January 1978: \"The homosexuals claim that God made them that way and hence are powerless to change, which is a complete fabrication and a deep delusion, for it was the Lord who provided the death penalty for these people in ancient times.\"\n#February 1978.\n#March 1978: \"Every right thinking person should wholeheartedly battle the tendency to make unclean things and habits appear to be clean and respectable ... the homosexual issue is but one example.\"\n#December 1978: \"Since homosexuals ... have come out of hiding ... many of them claim that they are what they are because they were born that way and cannot help it.  How ridiculous is such a claim.  It was not God who made them that way, any more than He made bank robbers the way they are.\"\n#July 1979: \"The persistent drive to make homosexuality an 'accepted' and legal way of life should disgust every thinking person ... Homosexuality is a menace ... it should be classed not only as a threat to the rest of the population but as a crime.\"\n* September – With an invitation from LDS church leaders, Anita Bryant performed at the Utah State Fair on the 18th. Her presence prompted the first public demonstration from Utah's queer community, organized by gay, former-Mormon pastor Bob Waldrop, in what gay, former Mormon, and historian Seth Anderson referred to as \"Utah's Stonewall.\"\n* October – Church president Spencer W. Kimball gave an October conference address in which he spoke out against the \"insidious\" and \"ugly\" sins of homosexuality and lesbianism. He called homosexuality a \"sin of the ages\" that contributed to the downfall of ancient Greece, Rome, and Sodom and Gomorrah.\n* October – A poll of Utah residents found that 75% of LDS respondents opposed equal rights for gay teachers or ministers and 62% favored discrimination against gays in business and government (versus 64% and 38% of non-LDS respondents respectively).\n* November – At a backstage press conference Church president Kimball praised Anita Bryant's anti-gay \"Save Our Children\" crusade which sought to bar the passing of nondiscrimination laws which would protect sexual minorities from being kicked out of their homes, fired from their jobs, and banned from restaurants solely for their sexual orientation. He stated that she was \"doing a great service.\" He continued stating that \"the homosexual program is not a natural, normal way of life\" and that church bishops and college-educated church counselors can aid those with \"homosexual problems.\"\n1978\n* 1978 – The church reissued Spencer W. Kimball's New Horizons for Homosexuals as a 30-page pamphlet titled A Letter to a Friend.\n1978 BYU speech on homosexuality]]\n* March – Packer delivered a sermon at BYU on March 5 which went on to be published by the church as a pamphlet called \"To The One.\" Packer characterized homosexual activity as a perversion and posited that it had its roots in selfishness and stated that gay feelings could be \"cured\" with \"unselfish thoughts, with unselfish acts\". He further stated that the church had not previously talked more about homosexuality because \"some matters are best handled very privately\" and \"we can very foolishly cause things we are trying to prevent by talking too much about them\". He called same-sex sexual activity as \"the ugliest and most debased\" human action.\n* April – Church president Spencer W. Kimball stated in the April conference that without the restraints of family life and real religion there would be an \"avalanche of appetites\" leading to an increase in homosexuality.\n* May – San Francisco PBS station KQED funded and aired a 16-minute documentary by Andrew Welch featuring interviews of gay Mormons in Salt Lake City and Provo and BYU psychologists administering the electroshock aversion therapy program in attempt to make gay students straight. It aired on PBS stations in Boston, New York City, and Los Angeles, and was the subject of controversy in Utah as KUED general manager Robert Reed refused to air it in July 1978. Additionally, BYU's KBYU refused to air the documentary after Reverend Bob Waldrop of the Salt Lake Metropolitan Community Church petitioned to have it aired in response to the recent of showing of Packer's \"To the One\" speech on homosexuality.\n* August – The First Presidency released a statement on August 24 outlining reasons for their opposition to the Equal Rights Amendment including \"unnatural consequences\" like an \"increase in the practice of homosexual and lesbian activities\".\n* December – In a Church News article apostle Mark Petersen stated that \"it was not God who made [homosexuals] that way\" since \"He gave all mankind free agency.\"\n1979\n* 1979 – Stephen Holbrook opened a Salt Lake community radio show featuring lesbian and gay voices while serving in the Utah State House of Representatives after his first election in 1975. The hour-long show called \"Gayjavu\" eventually became \"Concerning Gays and Lesbians,\" which lasted until 2003 as one of the nation's longest continually running queer radio programs. He had served an LDS mission in Hong Kong before disaffiliating from the LDS church, though, he did not come out as gay publicly.\n* 1979 – Gay former Mormon Bob Waldrop who had served an LDS mission in Australia became the publisher and editor of Salt Lake's queer newspaper The Open Door as well as a leader in the gay-inclusive Salt Lake Metropolitan Community Church. In February 1977 his congregation had had its permission rescinded by Utah state Lieutenant Governor David Monson (a Mormon) to hold a queer-inclusive church dance in the Utah Capitol building.\n* February – The LDS Welfare Services Department offered a video-recorded, several-day training seminar to LDS Social Services employees on \"homosexual therapies\".\n* February – LDS psychologist Ed D. Lauritsen presented a paper written under the direction of BYU's Values Institute to LDS Social Services which stated that a nurturing father \"almost always serves as a form of psychological immunization against homosexuality in most cases\" and that by improving his relationship with his children a father will \"reduce the possibility of homosexuality among his children\". He also stated that all LDS clinicians have a duty to \"labor for the prevention of homosexuality.\"\n* February – In a BYU devotional church seventy Vaughn Featherstone stated \"the homosexual cannot be exalted\" and that homosexual members envy \"normal\" members of the church while hiding their perversion and believing God made them different and it is not their fault they are gay.\n* April – BYU's newspaper published a series of articles in April quoting church leaders and gay BYU students on homosexuality. A BYU counselor estimated that 4% of BYU students (or around 1,200 students) were homosexual and commissioner of LDS Social Services Harold Brown stated that homosexuality is not biological or inborn, and that church leaders just want to help them overcome their problem. LDS Social Services Personal Welfare director Victor Brown Jr. compared it to an alcoholic's addiction that can be cured.\n* July – Signs saying \"BYU alumni\" and \"Gay Mormon\" were held aloft by the Affirmation group at the Los Angeles Pride Parade in what was called the first out gay Mormon presence at a pride parade. One of the participants was interviewed on camera wearing a BYU jersey.\n* October – Gay Mormons from Affirmation marched with 75,000 people in the National March on Washington for Lesbian and Gay Rights.\n* December – \"Affirmation: Gay Mormons United\" changes its name to \"Affirmation: Gay & Lesbian Mormons\".\nSee also\n* Homosexuality and The Church of Jesus Christ of Latter-day Saints\n* Law of adoption (Mormonism)\n* LGBT rights in Utah\n* LGBT Mormon suicides\n* List of Christian denominational positions on homosexuality\n* Mormonism in the 20th century\n* Sexuality and Mormonism\nReferences"
    }
  ]
}