{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Troubles in the Republic of Ireland\n\nThe following is a timeline of actions during The Troubles which took place in the Republic of Ireland between 1969 and 1998. It includes Ulster Volunteer Force bombings such as the Dublin and Monaghan bombings in May 1974, and other loyalist bombings carried out in the 1970s, '80s and '90s, the last of which was in 1997. These attacks killed dozens of people and injured hundreds more. Also actions carried out by Irish republicans including bombings, prison escapes, kidnappings, and gun battles between the Gardaí (police) and the Irish Defence Forces against Republican gunmen from the Irish National Liberation Army, the Provisional Irish Republican Army, and a socialist-revolutionary group, Saor Éire. These attacks killed a number of civilians, police, soldiers, and republican paramilitaries.\nOne statistical breakdown of Troubles deaths showed that 105 people lost their lives in the Republic of Ireland, meaning that the death toll was significantly higher per head of population than in Great Britain (the figure of 105 killed would be the equivalent of over 1,600 killed in Great Britain).\nLoyalist actions\n1960s\n*5 August 1969 – The Ulster Volunteer Force (the UVF) plant their first bomb in the Republic of Ireland, damaging the RTÉ Television Centre in Donnybrook with a relatively large bomb for its time. No injuries.\n*19 October 1969 - Thomas McDonnell, a member of the UVF, was injured and died a few days later when a bomb he was planting exploded prematurely at a power station near Ballyshannon in County Donegal. McDonnell was also a member of the Ulster Protestant Volunteers (UPV).\n*29 October 1969 - The UVF exploded a bomb at the gravestone of Wolfe Tone (the founding father of Irish Republicanism) at Bodenstown Graveyard in Sallins, County Kildare. The blast occurred at 5.00 am and destroyed a headstone.\n*26 December 1969 – The UVF plant a bomb at the Daniel O’Connell statue on O’Connell Street, Dublin. Little damage was done to the statue but the blast smashed windows in a half-mile radius.\n*28 December 1969 – The UVF detonate a car bomb outside the Garda central detective bureau in Dublin. The nearby telephone exchange headquarters is suspected to have been the target.\n1970s\n*18 February 1970 - The UVF exploded a bomb at a 240-foot radio mast on Mongorry Hill, near Raphoe in County Donegal. The explosion put the transmitter out of action. The mast had allowed RTÉ programmes to be received over a large part of Northern Ireland than had been the case. (The UVF claimed responsibility for this bomb in a statement issued on 19 February 1970.)\n*26 March 1970 – A bomb damages an electricity substation in Tallaght. An anonymous letter claimed responsibility on behalf of the UVF.\n*2 July 1970 – A bomb damages the main Dublin–Belfast railway line at Baldoyle, Dublin. Gardaí believed it was the work of the UVF.\n*16 September 1970 - A Loyalist bomb exploded in a classroom of Trentaghmucklagh National School just outside St Johnston, County Donegal. The school was empty at the time. It is believed the UVF were responsible.\n*17 January 1971 –  Daniel O’Connell's tomb in Glasnevin Cemetery is damaged by a Loyalist bomb. It's believed the UFV are behind the bombing. No injuries.\n*26 January 1971 - A bomb exploded at a Customs & Excise station in Lifford, East Donegal, at 5:07 am. It's believed the UVF was responsible.\n*8 February 1971 –  The Wolfe Tone statue at St. Stephen's Green is destroyed by a Loyalist bomb. No injuries.\n*21 May 1972 - Several firebombs were discovered in Dublin. One of the incendiary devices detonated in Dunnes Stores on North Earl Street, Dublin causing around £60,000 worth of damage.\n*September 1972 - The Littlejohn brothers carried out firebomb attacks at Castlebellingham and Louth Garda stations. The brothers claimed to be working for MI6.\n*16 October 1972 - A bomb exploded at Donegal Fertilisers Ltd in Carrigans, County Donegal. Nobody was injured but the store was badly damaged. The Ulster Defence Association (UDA) said they carried it out.\n*16 October 1972 - At 11 pm a bomb exploded on Fermanagh Street in Clones, County Monaghan, at the side of The Creighton Hotel. The Gardaí said they believed the UVF linked Red Hand Commandos were behind the bombing.\n*28 – 29 October 1972 – A 12 lbs bomb is planted in Connolly Station, Dublin by Loyalists but defused by the Irish Army before it went off. They are also responsible for leaving firebombs in bedrooms in four Dublin hotels: Wynns, The Gresham, The Skylon and The Crofton.\n*2 November 1972 - The UDA's Londonderry Brigade claimed responsibility for bombing The Hole In The Wall pub in St Johnston, County Donegal. UDA volunteers ordered everyone out of the pub and then destroyed it with a grenade.\n*19 November 1972 - The UDA's Londonderry Brigade claimed responsibility for bombing a car showroom in Bridgend, County Donegal.\n*26 November 1972 – Loyalists plant a bomb outside the rear exit door of the Film Centre Cinema, O'Connell Bridge House injuring 40 people.\n*1 December – See: 1972 and 1973 Dublin bombings - Bus driver George Bradshaw (30) and bus conductor Tommy Duffy (23) are killed and 127 injured in the first Loyalist car bomb that killed people in the Republic close to the CIÉ Depot at Sackville Place off O’Connell Street. A second car bomb exploded 7 minutes earlier causing massive damage to Liberty Hall and causing many injuries. Many people believed the bombs were planted by British Intelligence in order to influence an upcoming vote on the Amended Offences against the State Acts.\n*16 December 1972 - A Loyalist bomb exploded at a lock-up garage in Manorcunningham, County Donegal.\n*28 December 1972 - See: Belturbet bombing - UVF car bomb exploded in Belturbet in County Cavan killing two teenagers and injuring several people. Two other UVF bombs exploded in at around the same time. One at Clones, wounding a further two civilians and one at Pettigo, County Donegal, there was no injuries or deaths in this bomb.\n*1 January 1973 - A young Catholic  couple, Breege Porter aged 21 and Oliver Boyce aged 25, were found shot and stabbed to death by Loyalists at Burnfoot, County Donegal. The UDA claimed they carried out the killings. The UDA would use the name Ulster Freedom Fighters during The troubles when they wanted to claim killings.\n*10 January 1973 - A Loyalist bomb exploded at a builders providers in Stranorlar, County Donegal. Nobody was injured.\n*20 January 1973 – CIE bus conductor Thomas Douglas (25) is killed and 17 people injured in a Loyalist car bombing in Sackville Place off O’Connell Street, Dublin. The car used in the bombing had been hijacked at Agnes Street, Belfast.\n*24 January 1973 - O'Connell St, Dublin is sealed off by the Gardai after the RUC informs them that they received a warning that a car bomb is planted there. No bomb is found.\n*17 March 1973 - A UDA volunteer died when the car bomb he was transporting exploded prematurely as he parked outside Kirk's Bar, Cloughfin, County Donegal. 15 people were injured in the explosion.\n*29 June 1973 - Shortly before 3 a.m. a bomb exploded at the Vocational School at Kiltyclogher, County Leitrim. 15 people were injured in the attack.\n*28 September 1973 - A car bomb exploded outside a grocery shop and house in Pettigo, County Donegal. No warning was given and a number of people were injured, two of them required hospital treatment. It is believed that loyalists associated with the UVF were to blame, and a Garda report suggested that British soldiers may have been involved. The bomb exploded just yards across the border. The British Army had been scheduled to patrol the border in the area that night but did not arrive.\n*16 December 1973 - A Loyalist bomb badly damaged the Point Inn public house in Quigley's Point, County Donegal, near the County Londonderry border. It was believed that Loyalists used a boat to cross Lough Foyle to carry out the attack. No group claimed responsibility for the bombing.\n*17 May 1974 – See: Dublin and Monaghan bombings Three no-warning car bombs explode in Parnell Street, Talbot Street, and South Leinster Street during rush hour in Dublin, 90 minutes later another car bomb explodes in Monaghan. 27 people and an unborn child are killed in Dublin and seven more are killed in Monaghan bringing the death toll up to 34 killed altogether. Over 300 are injured. Italian restaurant owner Antonio Magliocco (37) and a French-born Jewish woman Simone Chetrit (30) are among those killed. The ages of those killed ranges from five months - 80 years. The attack is responsible for the highest number of casualties (civilian or combatant) in any one day of the Troubles.\n*11 September 1974 - There was an attempted car bomb attack in Blacklion, County Cavan. Three masked gunmen in British military uniform had hijacked the car, placed a time bomb inside and forced the owner to drive it into the village. They claimed to be from the UVF and threatened to attack his family if he did not comply. The driver parked the car in the middle of the village and alerted the Irish Army and Garda. The village was evacuated and the Army carried out a controlled explosion on the car. They estimated that the bomb would have destroyed most of the village.\n*8 December 1974 - Loyalists paramilitaries bombed St. Mary's Catholic church in Swanlinbar in County Cavan. There were no injuries but the church was badly damaged. It is believed that one of the main Loyalists paramilitaries either the UVF, UDA or Red Hand Commando was responsible.\n*10 January 1975 - The UVF claimed responsibility for shooting dead Provisional IRA volunteer John Francis Green at a farmhouse in Tullynageer, County Monaghan.\n*9 March 1975 - Loyalists firebombed a fleet of Fishing trawlers at Greencastle, County Donegal. Fourteen boats were damaged. Both the UVF and UDA claimed responsibility, with the UDA making \"the unlikely claim that the fleet had been used to ferry arms ashore for the IRA after a rendezvous with a Russian submarine\".\n*26 March 1975 - Loyalists bombed the Monasterboice Inn in Drogheda, County Louth. The establishment was owned by the Republic of Ireland's Defence Minister, Mr Paddy Donegan. Damage was caused to the premises but there were no injuries.\n*22 June 1975 – Christopher Phelan stabbed to death after he came upon the UVF attempting to place a bomb on the railway line near Sallins on 22 June 1975.\n*28 November 1975 – See: 1975 Dublin Airport bombing - Two Loyalist bombs planted by UDA at the arrival terminal at Dublin Airport killing John Hayes (30), an airport employee, and injuring eight civilians.\n*19 December 1975 - See: Donnelly's Bar and Kay's Tavern attacks - A car bomb exploded outside a public house called Kay's Tavern along Crowe Street, in Dundalk, County Louth. The bombing killed two people and injured dozens. About three hours later a gun and bomb attack on a pub in Silverbridge, County Armagh, killed three more people. It's believed both attacks were carried out by the Glenanne gang and that both attacks were co-ordinated by the same unit.\n*14 February 1976 - A bomb exploded without warning on the main street of Swanlinbar, County Cavan. It is believed the UVF was responsible.\n*20 February 1976 – A 25 lbs. bomb explodes in the Shelbourne Hotel along with eight incendiary bombs in department stores and shops in the Grafton Street and Henry Street areas. There were no injuries. Loyalists were the main culprits.\n*7 March 1976 - See: Castleblayney bombing - A car bomb exploded outside the Three Star Inn pub on Castleblayney in County Monaghan. The bomb killed one man and injured 17 people. The attack has been attributed to the Glenanne gang.\n*2 May 1976 - Seamus Ludlow (49) was killed in the early hours of the morning. His body was found near his home in Thistle Cross, Dundalk, County Louth. It's believed members of Red Hand Commando killed him.\n*3 July 1976 - the UFF claimed responsibility for bombing four hotels. There were explosions in Dublin, Rosslare, Limerick and Killarney but no fatalities.\n*8 July 1976 - the UFF bombed the Salthill Hotel in Galway, also without fatalities.\n1980s\n*25 November 1981 - The UFF claimed responsibility for firing shots into the Dublin offices of An Phoblacht. No injuries were reported.\n*7 November 1986 – Two bombs planted by the UFF exploded in litter bins on Dublin's main street but caused no deaths or injuries, and two others were found and defused. The following day a UFF spokesman said the UFF had \"the potential to cause death and destruction\" and that \"the warning should not go on unheeded\".\n*11 November 1986 - Eleven hoax bomb warnings at various businesses in Dublin's Grafton Street and Dawson Street caused large disruption in Dublin city. The UFF is believed to be behind the hoaxes.\n*7 and 8 February 1987 – The UFF exploded incendiary devices in County Donegal (including attacks on premises in Ballybofey, Letterkenny and Castlefin) and in Dublin. No injuries. It was alleged that these attacks had been approved by UFF leader John McMichael, who was planning a large bombing campaign in the Republic of Ireland, but McMichael was killed a few months later by the Provisional IRA.\n*15 November 1988 - A group calling itself the \"Ulster Core\" planted four hoax package bombs around Dublin city, the group said it planted the hoax packages to protest the 3rd anniversary of the Anglo-Irish Agreement. Police believe the UFF was behind the hoaxes.\n1990s\n*February 1991 – Two crude incendiary bombs in an O’Connell Street department store failed to go off. They were planted by the Loyalists, Gardaí believe it was the work of the UFF.\n*25 May 1991 - Eddie Fullerton, a Sinn Féin councillor in Buncrana, County Donegal, is shot dead in his home by a unit from the UFF in nearby Derry.\n*27 - 28 July 1991 - UFF exploded seven incendiary devices in a number of shops in the Republic of Ireland. No injuries.\n*29 March 1992 - In Dublin, Garda confirm incendiary device started fire in city centre store. It is believed either the UVF or UFF are responsible\n*28 September 1992 - A blast bomb left outside a Dublin-based bank nearby was defused. The \"Red Branch Knights\" (believed to be a cover name for the Red Hand Commando) claimed responsibility.\n*10 December 1992 - The UFF carried out seven firebomb attacks on shops in Moville and Buncrana in County Donegal, and in Dublin.\n*15 July 1993 - The UVF issued a statement in which they claimed sole responsibility for the Dublin and Monaghan bombings which killed 34 people and injured 300 others on 17 May 1974, when three car bombs exploded in the centre of Dublin city and one in Monaghan town.\n*18 September 1993 – On the day of the All-Ireland hurling final, Loyalists claim responsibility for planting a small bomb and cutting communication cables near to Store Street Garda station in Dublin.\n*5 January 1994 – Two members of the Irish Army bomb disposal unit were injured when a parcel bomb sent by the UVF to the Sinn Féin offices in Dublin exploded during examination at Cathal Brugha Barracks.\n*24 January 1994 - Incendiary devices that had been planted by the UFF, were found at a school in Dundalk and at a postal sorting office in Dublin.\n*21 May 1994 - Martin \"Doco\" Doherty (35), a member of the IRA Dublin Brigade, was shot dead by the UVF as he attempted to stop a bomb attack on The Widow Scallans Bar, Pearse Street, Dublin, where a Sinn Féin (SF) function was taking place. Another man was seriously wounded in the attack.\n*8 June 1994 - A small incendiary device was found in a snooker hall in Trim, County Meath, which was planted by the UFF, the device was found after the UDA issued a statement saying firebombs had been planted in the Republic of Ireland.\n*12 September 1994 - The UVF planted a bomb on the Belfast-Dublin train. At Connolly station in Dublin the bomb only partially exploded slightly injuring two women.\n*3 March 1997 - A 2.5kg bomb partially detonated behind the Sinn Féin office in Monaghan Town. The device was later made safe by the Irish Army. It is thought members of the Mount Vernon UVF were to blame.\n*25 May 1997 - a small bomb was found and defused in Dundalk. It is believed it was planted by a dissident Loyalist paramilitary like the Loyalist Volunteer Force (LVF).\n*23 February 1998 - The LVF claimed responsibility for planting a small car bomb outside a Garda station in Dromad, County Louth. It was spotted and defused by the security forces. The LVF threatened further attacks in the Republic.\n*8 May 1998 - A pipe bomb which was hidden in a package was sent to a Dublin tourist office. The device was discovered and defused. It is believed the LVF was behind the failed attack.\n*15 July 1998 - A package addressed to a Dublin hotel, which was believed to have been sent by the LVF, exploded while it was being examined at the Garda Technical Bureau in Dublin. Two were injured in the blast.\nNationalist actions\n1960s\n*8 March 1966 – at 1:32 in the morning, Liam Sullivan, an Irish republican, \"blew up a statue of Nelson on top of a 41m-high pillar\" on O'Connell Street in the center of Dublin, according to the BBC. \"A huge blast sent Nelson and tonnes of rubble on to the quiet street below, damaging a taxi - the only casualty of the night apart from Lord Nelson. The driver escaped injury.\"\n1970s\n*3 April 1970 – at three in the morning, three armed members of Saor Éire were in the process of robbing the Royal Bank of Ireland at Arran Quay, Dublin, when Gardaí Paul Firth and Richard Fallon arrived by car. Confronting the three at the front of the bank, Firth and Fallon were repeatedly fired at. Firth, \"who was behind Garda Fallon, called back to the patrol car driver to summon assistance before he dived to the ground. As he reached out to seize the gunman nearest to him, Garda Fallon was hit by fire from one of the others, and fell mortally wounded. He had been shot twice, in the shoulder and, fatally, in the neck. He died instantly. He was also a father of children\n*13 October 1970 –  Saor Éire member Liam Walsh (35) is killed in a premature explosion when himself and another member Martin Casey were planting a device at a railway line at the rear of McKee army base off Blackhorse Avenue in Dublin. His funeral was attended by over 3,000 people.\n*6 July 1971 - An Official IRA Volunteer Martin O'Leary was killed in a premature bomb explosion in Silvermines, County Tipperary.\n*25 October 1971 – Saor Éire member Peter Graham (26) is shot dead in his flat at 110 St Stephen's Green, Dublin in an internal feud.\n*30 December 1971 –  PIRA member Jack McCabe (55) is killed in a premature bomb explosion in a garage at Swords Road, Santry, Dublin. McCabe had been active in the IRA since the 1930s.\n*2 February 1972 –  The British Embassy on Merrion Square is burned down in response to Bloody Sunday 1972. A British-owned insurance office in Dún Laoghaire and Austin Reed outfitters on Grafton Street are also petrol bombed. The Thomas Cook travel agency along with the offices of British Airlines and the RAF club on Earlsfort Terrace were also attacked.\n*8 June 1972 - Inspector Samuel Donegan, of the Garda Síochána, was killed on the County Cavan side of the cross-border Drumboghangh Road, near the village of Redhills, by a roadside bomb on the border with County Fermanagh. The bomb exploded very near the South Fermanagh hamlet of Wattlebridge.\n*19 November 1972 - A week after giving a controversial interview to RTÉ radio, IRA Chief of Staff Seán Mac Stíofáin was sentenced to six months imprisonment by the Special Criminal Court in Dublin. Mac Stíofáin immediately began a hunger strike.\n*26 November - A Garda, two civilians and two Provisional IRA volunteers were injured during an exchange of shots after a foiled attempt to free IRA Chief of Staff Seán Mac Stíofáin when an 8-man IRA unit embarked on a rescue attempt, two members of the IRA unit were disguised as priests during the unsuccessful attempt.\n*29 December 1972 - Sinn Féin President Ruairí Ó Brádaigh was arrested in Dublin and sentenced to six months in the Curragh Military Prison.\n*31 December 1972 - Provisional IRA Derry Brigade Commander Martin McGuinness was arrested in County Donegal after police found explosives and thousands of rounds of ammunition in his car. At his court hearing McGuinness declared his membership of the Provisional IRA without equivocation: \"We have fought against the killing of our people... I am a member of Óglaigh na hÉireann and very, very proud of it\"\n*3 August 1973 – A cashier James Farrell (54) is killed by the IRA during an armed robbery while delivering wages to British Leyland factory, Cashel Road, Crumlin.\n*28 October 1973 - Detective Constable John Doherty, a serving member of the RUC, was shot dead by the IRA at the entrance to his mother's house in Ardsool, a townland just outside Ballindrait, a village near Lifford in East Donegal. DC Doherty was aged 31, and was a detective based at Omagh RUC Barracks. He was from Ballindrait.\n*31 October 1973 – The IRA use a hijacked helicopter to free three of their members from the exercise yard of Mountjoy Prison, Dublin. One of those who escaped was Séamus Twomey, then Chief of Staff of the IRA, who wasn't recaptured until December 1977.\n*12 March 1974 - Murder of Senator Billy Fox, a Fine Gael member of Oireachtas Éireann (the parliament of the Republic of Ireland). Senator Fox, a Protestant from Ballybay, was shot dead by the IRA at the home of Marjorie Coulson, his girlfriend, in the townland of Tircooney, between Clones and Smithborough in County Monaghan.\n*26 April 1974 - Rose Dugdale and three other IRA volunteers took part in a raid on Russborough House in County Wicklow, the home of Sir Alfred Beit. They forced their way into the house, and pistol-whipped Sir Alfred and his wife before tying and gagging the couple. The volunteers then stole nineteen old masters valued at IR£8&nbsp;million, including paintings by Gainsborough, Rubens, Vermeer and Goya. The IRA volunteers sent a ransom note offering to exchange the stolen paintings for IR£500,000 and the release of Dolours and Marian Price, two sisters convicted of the Old Bailey bombing who were on hunger strike in Brixton Prison attempting to secure repatriation to Ireland.\n*8 December 1974 - The Irish National Liberation Army (INLA), along with its political wing, the Irish Republican Socialist Party (IRSP), was founded at the Spa Hotel in Lucan, Dublin.\n*22 March 1975 – The funeral of IRA member Tom Smith, shot dead during an escape attempt from Portlaoise Prison on St. Patrick's Day, is attacked by Gardaí. Three people, including a press photographer, are injured.\n*16 October 1976 - Garryhinch ambush: a house that was booby-trapped by the Provisional IRA exploded at Garryhinch on the County Laois–County Offaly border. The bomb exploded while Garda Michael Clerkin was inside, the blast killing him instantly as the house collapsed in on top of him and seriously injuring four other Garda officers.\n*5 May 1977 - Captain Robert Nairac (29), a member of the British Army, was abducted by the IRA outside The Three Step Inn in Dromintee, County Armagh. At around 11.45 p.m., he was abducted following a struggle in the pub's car park and taken across the border into County Louth to a field in the Ravensdale Woods, just north of Dundalk. Following a violent interrogation during which Nairac was allegedly punched, kicked, pistol-whipped and hit with a wooden post, he was shot dead in a field.\n*7 September 1977 – John Lawlor (38), a suspected informer, is killed by the IRA in Timmons Bar (later called Leonard's), on the corner of Watling Street and Victoria Quay, Dublin.\n*5 October – Chief of Staff of the INLA and leader of the IRSP Seamus Costello (38) is shot dead in his car on North Strand Road by Official IRA member James Flynn.\n*28 January 1979 – English salesman Arthur Lockett (29) is found dead in Ticknock in the Dublin mountains. He had been beaten with clubs by a number of men and left for dead. Lockett had been boasting in a pub that he had connections in the British Army. It emerged he had worked in West Germany for a time where he had business deals with both American and British army personnel at NATO bases.\n*7 August 1979 - Civil servant Eamon Ryan was shot dead by the IRA during a bank robbery in Strand Street, Tramore, County Waterford. IRA volunteers Eamonn Nolan and Aaron O'Connell were later charged with the murder and robbery.\n*27 August 1979 - An IRA bomb killed Admiral of the Fleet Louis Mountbatten at Mullaghmore, County Sligo, the British Queen's first cousin, as well as The Dowager Baroness Brabourne, Lord Mountbatten's elder daughter's mother-in-law (aged 83), The Hon. Nicholas Knatchbull, Mountbatten's elder daughter's fourth son (aged 14) and Paul Maxwell, a 15‑year-old Protestant youth from County Fermanagh who was working as a crew member.\n*22 December 1979: Stanley Hazelton (48), an off-duty RUC officer traveling in his car, was shot dead by a PIRA sniper in Glaslough, County Monaghan.\n1980s\n*7 July 1980 - See: Murder of Henry Byrne and John Morley - Henry Byrne and John Morley, two officers of the Garda Síochána, were shot dead by alleged members of the INLA during a pursuit in the aftermath of a bank robbery near Loughglynn, County Roscommon.\n*13 October 1980 - Garda Seamus Quaid was shot dead by the IRA during an exchange of gunfire, shortly after stopping a vehicle containing an IRA unit while on Garda mobile patrol at Ballyconnick, near Cleariestown, County Wexford.\n*20 February 1982 - The INLA shot dead Garda Patrick Reynolds, at a house in Avonbeg Gardens, Tallaght, in Dublin.\n*4 June 1982 - the INLA shot dead Official IRA volunteer James Flynn on North Strand Road, Dublin; part of a republican feud.(The INLA later claimed that Flynn was responsible for the killing of Seamus Costello, who had been leader of the IRSP, on 5 October 1977 in Dublin.)\n*20 September 1982 - The INLA claimed responsibility for bombing a radar station on Mount Gabriel, County Cork. Five INLA volunteers hijacked a car carrying an engineer to the station. They forced their way inside, tied-up several workers and planted the bombs. The INLA claimed it attacked the station because it was linked to NATO.\n*25 March 1983 - Shooting of Brian Stack - Brian Stack, an officer at Portlaoise Prison, was shot in the neck on South Circular Road, Dublin after leaving the National Stadium. He was hospitalised with severe brain damage and died on 29 September 1984\n*16 December 1983 - Irish Army soldier (Patrick Kelly) and a Garda officer (Gary Sheehan) were both shot dead during a gun battle with the Provisional IRA in an attempt to secure the release of businessman Don Tidey, taken hostage by the IRA, near Ballinamore, County Leitrim.\n*10 August 1984 - Garda officer Francis Hand was shot dead by the IRA in Drumcree, County Meath during an attempted armed robbery of a post office.\n*23 March 1985 - An alleged Garda informant (John Corcoran) was shot dead by the IRA at Ballincollig, County Cork.\n*20 April 1985 - The INLA planted two bombs in Dunnes Stores along Dublin's Henry Street, one bomb exploded and the other was defused by the Irish Army. The INLA planted the bombs in protest at Dunnes Stores support for apartheid in South Africa. At the time 12 Dunnes employees were on strike, refusing to handle goods.\n*27 June 1985 -  A Garda officer, Sergeant Patrick Joseph Morrissey, a native of Belturbet, County Cavan, was killed during the robbery of a post office in Ardee, County Louth; CAIN lists the INLA as responsible.\n*9 August 1985 - A train travelling from Belfast to Dublin was severely damaged after the INLA planted four bombs in the carriages.\n*20 August 1985 - shot and killed Seamus McAvoy (46) at his home in Dublin. McAvoy had sold portable buildings to the Royal Ulster Constabulary (RUC) and was the first person to be killed for providing goods or services to the security forces in Northern Ireland (this killing marked the beginning of a campaign against what the IRA termed \"legitimate targets\").\n*20 January 1987 - Volunteers from the Irish People's Liberation Organization (IPLO) shot dead two Volunteers of the INLA in the Rosnaree hotel in Drogheda in an IPLO/INLA feud.\n*31 January 1987 - Mary McGlinchey, an INLA activist and wife of INLA leader Dominic McGlinchey, was shot dead at her home in Dundalk. It has never been established who was responsible or why.\n*2 June 1987 - An off-duty RUC officer, Constable Samuel McClean, was shot dead by the IRA just outside Drumkeen, County Donegal. Constable McClean was shot while visiting his parents farm in the townland of Callan by two IRA men using a shotgun and a revolver. He was buried afterwards in the cemetery attached to Stranorlar Church of Ireland Church. Sir Jack Hermon, the Chief Constable of the RUC, attended the funeral, as did Lawrence Wren, the Commissioner of the Garda Síochána. Constable McClean was from Drumkeen and was stationed at Coalisland RUC Barracks in East Tyrone.\n*8 December 1987 - A civilian, Patrick Cunningham, was found shot dead in an outbuilding at an unoccupied farm, Errybane, near Castleblayney, County Monaghan on 8 December 1987. He had been abducted in May 1987; it is believed the killing was related to the INLA/IPLO feud.\n*6 May 1988 - IRA volunteer Hugh Hehir was shot and killed by the Garda Special Branch following a bank raid in County Clare\n1990s\n*19 July 1991 - Thomas Oliver (43) a civilian from Dundalk was shot dead by the IRA who claimed he was a police informer. Oliver's body was found in Bellek, County Armagh.\n*10 February 1994 - Dominic McGlinchey, the INLA's former Chief of Staff, was shot dead in Drogheda. It has never been established who was responsible or why.\n*August 1995 - INLA Hunger Strike 5 August – 1 September - four INLA Volunteers in Portlaoise Prison went on hunger strike to demand for \"parity of treatment\" with IRA inmates regarding compassionate parole, stating that they were regularly denied compassionate parole regardless of circumstances, while IRA prisoners were granted regularly. After 26 days the Department of Justice finally entered into negotiations with the IRSP (through intermediary Father Alex Reid of Clonard Monastery in Belfast), and hours later the three remaining prisoners (one James Gorman had to go off the striker over an ulcer) ended their strike after being promised talks with the government on the issue of \"parity of treatment\". Michael \"Mickey\" McCartney was on hunger strike for 26 days and both Tony McNeill and Paddy Walls for 19 days.\n*5 March 1996 - INLA volunteer John Fennell was beaten to death by other INLA volunteers in Bundoran, County Donegal, in the course of an internal dispute.\n*7 June 1996 - Jerry McCabe, then a Detective in the Garda Síochána, was shot dead during a post office robbery in Adare, County Limerick. The Provisional IRA was believed to be responsible.\n*4 June 1997 - INLA volunteer John Morris was shot dead by the Gardaí during an armed robbery in Inchicore, Dublin.\n*1 May 1998 - Ronan MacLochlainn (28), a dissident Irish Republican Army (IRA) member, was shot dead when the Garda Síochána foiled a raid by six armed men on a security van near Ashford, County Wicklow. The raid was believed to be carried out by the Real IRA.\nSee also\n* Timeline of the Troubles in Great Britain\nReferences\nSources\n* [http://cain.ulst.ac.uk/sutton/crosstabs.html CAIN Web Service - Conflict and Politics in Northern Ireland] (The CAIN Project: Conflict Archive on the Internet), Ulster University.\n* Out of the Ashes: An Oral History of the Provisional Irish Republican Movement – Robert White (2017), Merrion Press. .\n* INLA: Deadly Divisions – Jack Holland and Henry McDonald (1995), Poolbeg Press. .\n* The Dublin and Monaghan Bombings and The Murder Triangle – Joe Tiernan (2004),  Published by the Author. ."
    }
  ]
}