{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the 2022 Russian invasion of Ukraine\n\nThis timeline of the Russo-Ukrainian war covers the period from 24 February 2022, when Russia launched a military invasion of Ukraine, to 7 April 2022 when fighting focused away from the north and towards the south and east of Ukraine.\nThis timeline is a dynamic and fluid list, and as such may never satisfy criteria of completeness. Please note that some events may only be discovered or fully understood in retrospect.\nFebruary 2022\n24 February\nhit by a missile fragment, 24 February]]\noperates a Konkurs ATGM near Hostomel Airport]]\nRussian President Vladimir Putin announced his decision to launch a \"special military operation\" in eastern Ukraine. He stated there were no plans to occupy Ukrainian territory and that he supported the right of the peoples of Ukraine to self-determination. Putin also stated that Russia sought the \"demilitarisation and denazification\" of Ukraine, and that \"all responsibility for possible bloodshed will be entirely on the conscience of the regime ruling on the territory of Ukraine.\" The Russian Ministry of Defence asked air traffic control units of Ukraine to stop flights, and the airspace over Ukraine was restricted to non-civilian air traffic, and the whole area was deemed an active conflict zone by the European Union Aviation Safety Agency.\nWithin minutes of Putin's announcement, explosions were reported in Kyiv, Kharkiv, Odesa, and the Donbas. Ukrainian officials said that Russian troops had landed in Mariupol and Odesa, and launched cruise and ballistic missiles at airfields, military headquarters, and military depots in Kyiv, Kharkiv, and Dnipro. Military vehicles entered Ukraine through Senkivka, where Ukraine meets Belarus and Russia. A video captured Russian troops entering Ukraine from Russian-annexed Crimea.\nThe Kremlin planned initially to target artillery and missiles at command and control centres and then send fighter jets and helicopters to quickly gain air superiority. The Center for Naval Analyses said that Russia would create a pincer movement to encircle Kyiv and envelop Ukraine's forces in the east, with the Center for Strategic and International Studies identifying three axes of advance: from Belarus in the north, from Donetsk in the center, and from Crimea in the south. The US said it believed that Russia intended to \"decapitate\" Ukraine's government and install its own, and US intelligence officials believed that Kyiv would fall within 96 hours.\nRussian forces began invading near Kharkiv, and large-scale amphibious landings were reported in Mariupol. Troops also entered the country from Belarus. The Ukrainian Border Force reported attacks on Luhansk Oblast, Sumy Oblast, Kharkiv Oblast, Chernihiv Oblast, and Zhytomyr Oblast, as well as from Crimea. The Ukrainian interior ministry reported that Russian forces had captured the villages of Horodyshche and Milove in Luhansk. The Ukrainian Centre for Strategic Communication reported that the Ukrainian army had repelled an attack at Shchastia (near Luhansk) and retaken control of the town, claiming nearly 50 Russian lives.\nUkrainian President Volodymyr Zelenskyy proclaimed martial law the night of the invasion. He also broke off Russia–Ukraine relations, effective immediately. Russian missiles targeted Ukrainian infrastructure, including Boryspil International Airport, Ukraine's largest airport,  east of Kyiv.\nA briefing by the Ukrainian presidential administration reported that Russian troops had invaded Ukraine from the north (up to  south of the border), and Russian troops were active in Kharkiv Oblast, Chernihiv Oblast, and near Sumy. The press briefing also reported that Ukraine had repulsed an attack in Volyn Oblast. The Ukrainian Defence Ministry reported that they had stopped Russian troops in Chernihiv Oblast, a major battle near Kharkiv was in progress, and Mariupol and Shchastia had been fully retaken.\ndestroyed in the Battle of Antonov Airport]]\nIn the Battle of Antonov Airport, Russian airborne troops seized Hostomel Airport in Hostomel, a suburb of Kyiv, arriving in helicopters early in the morning; a Ukrainian counteroffensive to recapture the airport launched later in the day. The Rapid Response Brigade of the Ukrainian National Guard stated that it had fought at the airfield, shooting down three of 34 Russian helicopters.\nBelarus allowed Russian troops to invade Ukraine from the north, at 11:00 (UTC+2). Ukrainian border guards reported a border breach in Vilcha (Kyiv Oblast), and border guards in Zhytomyr Oblast were bombarded by Russian rocket launchers. A helicopter without markings reportedly bombed border posts in Slavutych from Belarus. A second wave of Russian missile bombings targeted the cities of Kyiv, Odesa, Kharkiv, and Lviv. Heavy ground fighting was reported in the Donetsk and Luhansk oblasts.\nRussian troops advancing from Crimea moved towards the city of Nova Kakhovka in Kherson Oblast. Later that day, Russian troops entered the city of Kherson and took control of the North Crimean Canal, which allowed them to resume water supply to the peninsula.\nUkrainian border guards and Armed Forces reported two new clashes near Sumy (\"in the direction of Konotop\") and Starobilsk in Luhansk Oblast. Valerii Zaluzhnyi reported four ballistic missiles launched from Belarus in a southwestern direction. Several stations of the Kyiv Metro and Kharkiv Metro were used as bomb shelters for the local population. A local hospital in Vuhledar (Donetsk Oblast) was reportedly bombed, with four civilians dead and 10 wounded, including six physicians.\nZelenskyy said that fighting between Russian and Ukrainian forces had erupted in the ghost cities of Chernobyl and Pripyat. The Chernobyl Nuclear Power Plant came under Russian control, as well as the surrounding areas.\nVitali Klitschko, mayor of Kyiv, proclaimed a curfew from 22:00 to 07:00.\nThe State Border Guard Service of Ukraine announced that Russian forces had captured Snake Island following naval and air bombardment. All thirteen border guards on the island were assumed to have been killed, after refusing to surrender to a Russian warship and a recording of the guards refusing an offer to surrender went viral on social media. Zelenskyy announced that they would be posthumously granted the title of Hero of Ukraine, the country's highest honour. Seventeen civilians were confirmed killed, including thirteen killed in Southern Ukraine, three in Mariupol, and one in Kharkiv. Zelenskyy said that 137 Ukrainian citizens (both soldiers and civilians) died on the first day of the invasion, whilst claiming that over 1,000 Russian soldiers had also been killed in the same period. He ordered a general mobilisation of all Ukrainian males between 18 and 60 years old, who were also banned from leaving Ukraine.\n25 February\n]]\nAt 04:00 local time, Kyiv was rocked by two explosions from cruise and ballistic missiles. The Ukrainian government said that it had shot down an enemy aircraft over Kyiv, which crashed into a residential building, setting it on fire. Ukraine's Deputy Interior Minister Evgeny Yenin later clarified Russia had shot down a Sukhoi Su-27 aircraft, part of Ukraine's military.\nIndependent military analysts noted that Russian forces in the north of the country appeared to be heavily engaged by the Ukrainian military. Russian units attempting to encircle Kyiv and advance into Kharkiv were bogged down in heavy fighting, with social media images suggesting that some Russian armoured columns were ambushed.\nRussian operations in the east and south were more effective. The Russian units outside Donbas appeared to have manoeuvred around the prepared defensive trenches and attacked Ukrainian defensive positions in the rear. Meanwhile, Russian military forces advancing from Crimea divided into two columns, with analysts suggesting that they may have been attempting to encircle and entrap the Ukrainian defenders at Donbas, forcing the Ukrainians to abandon their prepared defences and fight in the open.\nZelenskyy accused Russia of targeting civilian sites; Ukrainian Interior Ministry representative Vadym Denysenko said that 33 civilian sites had been hit in the previous 24 hours.\nUkraine's Defence Ministry stated that Russian forces had entered Obolon, Kyiv, and were approximately  from the Verkhovna Rada building, seat of the parliament of Ukraine. Russia's Spetsnaz troops infiltrated the city with the intention of \"hunting\" government officials. An unmarked armored vehicle was filmed veering across a road and crushing a civilian car in northern Kyiv. Although widely captioned as the act of a Russian tank, experts suggested it was unclear who operated the military vehicle or why the incident occurred. The civilian driving the car, an elderly man, survived and was helped out by locals.\nThe mayor of Horlivka in the Russian-backed Donetsk People's Republic said that the Ukrainian military had hit a local school building, killing two teachers.\nAs Russian troops approached Kyiv, Zelenskyy posted a video of him still being in Kyiv and in another asking residents to prepare any means, like Molotov cocktails, to \"neutralise\" the enemy. Putin meanwhile called on the Ukrainian military to overthrow the government. Ukraine distributed 18,000 guns to Kyiv residents who expressed a willingness to fight and deployed the Territorial Defence Forces, the reserves of the Ukrainian military, to defend Kyiv. The Defence Ministry also announced that all Ukrainian civilians were eligible to volunteer for military service regardless of their age.\nBy the evening, the Pentagon stated that Russia had not established air supremacy over Ukrainian airspace, as US analysts had predicted. Ukrainian air defence capabilities had been degraded by Russian attacks, but remained operational. Military aircraft from both nations continued to fly over Ukraine. The Pentagon also said that Russian troops were not advancing as quickly as either US intelligence or Moscow had believed they would, that Russia had not taken any population centres, and that Ukrainian command and control was still intact. The Pentagon warned that Russia had sent into Ukraine only 30 per cent of the 150,000–190,000 troops it had massed at the border.\nReports circulated of a Ukrainian missile attack against the Millerovo air base in Russia, to prevent the base from being used to provide air support to Russian troops in Ukraine.\nZelenskyy said that the Ukrainian government was not \"afraid to talk about neutral status\". On the same day, President Putin indicated to Xi Jinping, the Chinese paramount leader and general secretary of the Chinese Communist Party, that \"Russia is willing to conduct high-level negotiations with Ukraine\".\nThe Federated States of Micronesia severed diplomatic relations with Russia due to the invasion, becoming the second country, after Ukraine, to do so.\n26 February\nHeavy fighting was reported overnight to the south of Kyiv, near Vasylkiv and its air base. The Ukrainian General Staff reported that a Ukrainian Su-27 fighter had shot down a Russian Il-76 transport plane carrying paratroopers near the city. Vasylkiv mayor Natalia Balasinovich said her city was successfully defended by Ukrainian forces and fighting was ending.\nMore than 48 explosions in 30 minutes were reported around Kyiv, as the Ukrainian military was reported to be fighting near the CHP-6 power station in the northern neighbourhood of Troieshchyna. BBC News reported that the attack might have been an attempt to cut off electricity to the city. Heavy fighting was reported near the Kyiv Zoo and the Shuliavka neighbourhood. The Ukrainian military said it repelled a Russian attack on an army base on Peremohy Avenue, a main road in Kyiv; it also said it repelled a Russian assault on Mykolaiv on the Black Sea. American officials said a Russian Il-76 transport plane was shot down by Ukrainian forces near Bila Tserkva, about  south of Kyiv. US officials stated that American intelligence data, shared with Ukrainian forces in real-time, helped to down the Il-76. Zelenskyy, remaining in Kyiv, refused US offers of evacuation, instead requesting more ammunition for Ukrainian troops.\nHundreds of casualties were reported in overnight fighting in Kyiv, where shelling destroyed an apartment building, bridges, and schools. The Ukrainian General Staff reported that its aircraft had conducted 34 sorties in the past 24 hours, indicating that Russia had unexpectedly continued to fail to gain air superiority.\nBy afternoon, most of the Russian forces that had amassed around Ukraine were fighting in the country. Mayor Klitschko of Kyiv imposed a curfew from 5 p.m. 26 February until 8 a.m. 28 February, warning that anyone found outside during that time would be considered part of enemy sabotage and reconnaissance groups. Internet connections were disrupted in parts of Ukraine, particularly the south and east. In response to a request from Mykhailo Fedorov, the Vice-Prime Minister of Ukraine, Elon Musk announced that he had turned on his Starlink service in Ukraine, with \"more terminals en route\".\n]]\nUkrainian Interior Ministry representative Vadym Denysenko said that Russian forces had advanced further towards Enerhodar and the Zaporizhzhia Nuclear Power Plant, that they were deploying Grad missiles there and might attack the plant. The Zaporizhzhia Regional State Administration stated that the Russian forces advancing on Enerhodar later returned to Bolshaya Belozerka, a village located  from the city, on the same day.\nA Japanese-owned cargo ship, the MV Namura Queen with 20 crew members aboard, was struck by a Russian missile in the Black Sea. A Moldovan ship, MV Millennial Spirit, was also shelled by a Russian warship, causing serious injuries.\nRamzan Kadyrov, the head of the Chechen Republic, confirmed that the Kadyrovtsy, units loyal to the Chechen Republic, had been deployed into Ukraine as well. Oleksiy Danilov, the Secretary of Ukraine's National Security and Defense Council, stated that members of Russia's Federal Security Service had tipped Ukraine off that Kadyrovtsy were attempting to infiltrate Kyiv and assassinate President Zelenskyy. Danilov stated that the Kadyrovtsy had split into two groups, with one destroyed by Ukrainian forces.\nA six-year-old boy was killed and multiple others were wounded when artillery fire hit the Okhmatdyt Children's Hospital in Kyiv. The Ukrainian military stated they had blown up a convoy of 56 tankers in Chernihiv Oblast carrying diesel for Russian forces.\nBy the end of the day, Russian forces had failed to encircle and isolate Kyiv, despite mechanised and airborne attacks. The Ukrainian General Staff reported that Russia had committed its operational northern reserve of 17 battalion tactical groups (BTGs) after Ukrainian forces halted the advance of 14 BTGs north of Kyiv. Russia temporarily abandoned attempts to seize Chernihiv and Kharkiv after attacks were repelled by determined Ukrainian resistance, and bypassed those cities to continue towards Kyiv. In the south, Russia took Berdiansk and threatened to encircle Mariupol.\nThe Institute for the Study of War (ISW) said that poor planning and execution was leading to morale and logistical issues for the Russian military in northern Ukraine. US and UK officials reported that Russian forces faced shortages of gasoline and diesel fuel, leading to tanks and armoured vehicles stalling and slowing their advance. Videos also emerged online of Russian tanks and armoured personnel carriers (APCs) stranded on the roadside. Russia continued to not use its full arsenal; the ISW said this was likely to avoid the diplomatic and public relations consequences of mass civilian casualties, as well as to avoid creating rubble that would impede the advance of its own forces.\nMeanwhile, internationally military aid was agreed on by NATO, parallel to calls for other measures.\n27 February\n]]\nOvernight, a gas pipeline outside Kharkiv was reported blown up by a Russian attack, while an oil depot in the village of  near Vasylkiv ignited after being hit by missiles. Heavy fighting near the Vasylkiv air base prevented firefighters from tackling the blaze. Also, a group of Ukrainian Roma reportedly seized a Russian tank in Liubymivka, close to Kakhovka in Kherson Oblast. The Presidential Office stated that Zhuliany Airport was also bombed. Russian-backed separatists in Luhansk province said that an oil terminal in the town of Rovenky was hit by a Ukrainian missile. The State Emergency Service of Ukraine in Kharkiv rescued 80 people from a nine-story residential building hit by Russian artillery, extensively damaging it and killing a woman.\nNova Kakhovka's mayor, Vladimir Kovalenko, confirmed that the city had been seized by Russian troops, and accused them of destroying the settlements of Kozatske and Vesele. Russian troops also entered Kharkiv, with fighting in the city streets, including in the city centre. At the same time, Russian tanks started pushing into Sumy. The Russian Defense Ministry announced that they had completely surrounded Kherson and Berdiansk, and captured Henichesk and Kherson International Airport in Chornobaivka. Ukrainian forces struck the Russian-occupied airport at Chornobaivka, inflicting losses on the Russian army. By early afternoon, Kharkiv Oblast governor Oleh Synyehubov stated that Ukrainian forces had regained full control of Kharkiv, and Ukrainian authorities said that dozens of Russian troops had surrendered. Hennadiy Matsegora, the mayor of Kupiansk, agreed to hand over control of the city to Russian forces.\nGermany, an until then cautious power, declared the situation a watershed and pledged large defensive investments and readiness to support far reaching sanctions.\nIn a televised address, Putin ordered the Minister of Defence and the Chief of the General Staff \"to put the [[Nuclear risk during the Russian invasion of Ukraine|[nuclear] deterrence forces of]] the Russian army into a special mode of combat service\", in response to what he called \"aggressive statements\" by NATO members. The phrase Putin used, namely \"special mode of combat service\", was unknown on the basis of open sources. The order was interpreted as a threat and met with criticism from NATO, the EU, and the United Nations (UN); NATO Secretary-General Jens Stoltenberg described it as \"dangerous and irresponsible\", while UN official Stéphane Dujarric called the idea of a nuclear war \"inconceivable\".\nAccording to intelligence analyst firm Rochan Consulting, Russia had succeeded in connecting Crimea with areas in eastern Ukraine held by pro-Russian forces by besieging Mariupol and Berdiansk. Oleksiy Arestovych, an advisor to Zelenskyy, said that Berdiansk had been captured by Russian forces. The main Russian force from the Crimea advanced north towards Zaporizhzhia, while a Russian force on the east bank of the Dnipro threatened Mykolaiv.\nRussian column on 27 February in Bucha.]]\nRussian forces were pushed back in Bucha and Irpin to the north-west of Kyiv. According to Lithuanian Defense Minister Arvydas Anušauskas, the Russians suffered 4,300 casualties in the first three days of the invasion. He also claimed they had lost 27 planes, 26 helicopters, 146 tanks, 706 AFVs, 1 Buk missile system, 4 BM-21 Grad anti-aircraft systems, 2 drones, and 2 ships.\nAccording to UK military intelligence, Russian mechanised forces bypassed Chernihiv and moved towards Kyiv. Luhansk Oblast governor Serhiy Haidai accused Russian forces of destroying Stanytsia Luhanska and Shchastia before capturing them, while Donetsk Oblast governor Pavlo Kyrylenko also accused them of destroying Volnovakha.\nThe ISW said that Russian forces in northern Ukraine had likely begun an \"operational pause\" the previous day, to deploy additional forces and supplies; Russian military resources not previously part of the invasion force were being moved toward Ukraine in anticipation of a more difficult conflict than initially expected.\n28 February\nFighting took place around Mariupol throughout the night. On the morning of 28 February, the UK defence ministry said that most Russian ground forces remained over  north of Kyiv, having been slowed by Ukrainian resistance at Hostomel Airport. It also said that despite fighting near Chernihiv and Kharkiv, both cities remained under Ukrainian control. Maxar Technologies released satellite images showing a Russian column, including tanks and self-propelled artillery, travelling toward Kyiv near Ivankiv. The firm initially stated that the convoy was approximately  long, but clarified later that day that the column was actually more than  in length.\nThe Times reported that the Wagner Group had been redeployed from Africa to Kyiv, with orders to assassinate Zelenskyy in the first days of the Russian invasion.\nUkrainian advisor Arestovych stated that more than 200 Russian military vehicles had been destroyed or damaged on the highway between Irpin and Zhytomyr by 14:00 EET. Ihor Terekhov, mayor of Kharkiv, said that nine civilians were killed and 37 wounded by Russian shells. Oksana Markarova, the Ukrainian ambassador to the US, accused Russia of using a vacuum bomb.\nTalks between Ukrainian and Russian representatives in Gomel, Belarus ended without a breakthrough. As a condition for ending the invasion, Putin demanded Ukraine's neutrality, \"denazification\" and \"demilitarisation\", and recognition of Crimea as Russian territory.\nRussia increased strikes on Ukrainian airfields and logistics centres, particularly in the west, apparently trying to ground the Ukrainian Air Force and disrupt resupply from the west. In the north, the ISW called the decision to use heavy artillery in Kharkiv \"a dangerous inflection\". Additional Russian forces and logistics columns in southern Belarus appeared to be manoeuvring to support a Kyiv assault. An analyst with the Royal United Services Institute stated that the Ukrainian regular army was no longer functioning in formations but in largely fixed defences, and was increasingly integrated with Territorial Defense Forces and armed volunteers.\nA diplomatic crisis in Greece–Russia relations was sparked when Russian air forces bombarded Buhas and Sartana near Mariupol, majority-populated by Ukrainian Greeks, killing 12 Greeks. Greece protested strongly, summoning the Russian ambassador. French President Emmanuel Macron and US Secretary of State Antony Blinken, along with Germany and other countries, expressed their condolences to Greece. Russian authorities denied responsibility, but Greek authorities stated that they had evidence of Russian involvement. Greek prime minister Kyriakos Mitsotakis announced that his country would send defensive military equipment and humanitarian aid to support Ukraine.\nA Sky News reporting team attempting to return to Kyiv came under fire from what Ukraine described as a Russian saboteur reconnaissance squad. Stuart Ramsay, a member of the team, was wounded in the lower back.\nA ranking Russian Army commander, Major General Andrei Sukhovetsky, deputy commander of the 41st Combined Arms Army of the Central Military District, was killed in unspecified circumstances in Ukraine.\nMarch 2022\n1 March\nafter Russian bombardment]]\ntown after the bombing]]\nAccording to Dmytro Zhyvytskyi, the governor of Sumy Oblast, more than 70 Ukrainian soldiers were killed by Russian shelling at a military base in Okhtyrka. A Russian missile later hit the regional administration building on Freedom Square, killing at least ten civilians and wounding 35 others. In southern Ukraine, the city of Kherson was reportedly under attack by Russian forces. The Ukrainian government announced that it would sell war bonds to fund the armed forces.\nThe Ukrainian parliament stated that the Armed Forces of Belarus had joined Russia's invasion and were in Chernihiv Oblast, northeast of the capital. UNIAN reported that a column of 33 military vehicles had entered the region. The US disagreed, saying that there was \"no indication\" that Belarus had invaded. Hours prior, Belarus's President Lukashenko said that Belarus would not join the war.\nAfter Russia's Defense Ministry announced that it would hit targets to stop \"information attacks\", missiles struck broadcasting infrastructure for the primary television and radio transmitters in Kyiv, taking TV channels off the air. Ukrainian officials said that the attack killed five people and damaged the nearby Babyn Yar Holocaust Memorial Center, Ukraine's main Holocaust memorial.\nThe US Department of Defense said that Russian forces had captured Berdiansk and Melitopol.\nIn the evening of 1 March and morning of 2 March, Russian aviation bombed 8 multi-storey residential buildings in Borodianka (Kyiv region), killing at least 40 civilians.\n2 March\nafter rocket strike on 2 March]]\nThe Ukrainian military reported a Russian paratrooper assault on northwest Kharkiv, where a military hospital came under attack. Zhyvytskyi said that Russian forces had captured Trostianets.\nUkrainian advisor Arestovych said that Ukrainian forces had gone on the offensive for the first time, advancing on Horlivka, though it mostly proved inconsequential. Russian troops captured the city of Kherson, beginning a military occupation of the city and oblast.\nValerii Zaluzhnyi, the Commander-in-Chief of the Armed Forces of Ukraine, said that Ukrainian forces had recaptured Makariv. Vadym Boichenko, the mayor of Mariupol, reported that residential areas were being \"relentlessly\" shelled by the Russian military, with \"scores of\" casualties among civilians.\nThe Bangladeshi bulk carrier Banglar Samriddhi was struck by a missile at the port of Olvia in Mykolaiv Oblast, setting it on fire and killing a Bangladeshi engineer.\nUkrainska Pravda reported that a source in Ukrainian intelligence said that Viktor Yanukovych, the former president of Ukraine with pro-Russia sympathies ousted following the Revolution of Dignity, was in Minsk, Belarus, and that Russia intended to declare him president when Russian forces gained control of Kyiv. Other analysts said that Putin might put the pro-Russian Viktor Medvedchuk in as president if Ukraine surrendered.\nSergey Lavrov, the Russian Minister of Foreign Affairs, accused NATO and the EU of wanting to start a nuclear war and warned that \"World War III would be nuclear and destructive\".\n3 March\n. The town was captured on 3 March 2022]]\nDuring a second round of talks, Russia and Ukraine agreed to open humanitarian corridors for the evacuation of civilians. The Estonian cargo ship Helt sank after an explosion near Odesa; all six crew members aboard survived.\nThe German Federal Ministry for Economic Affairs authorized the supply of 2,700 surface-to-air missiles (SAMs) to Ukraine. The Verkhovna Rada passed a law allowing the seizure of assets of the Russian government or nationals.\nThe Russian Defense Ministry stated it had captured Balakliia. Zelenskyy meanwhile asked for direct talks with Russian president Putin, \"the only way to stop this war\". The United States said that about 90% of the Russian forces that had amassed around Ukraine before the invasion had entered the country.\nZelenskyy also announced that the first international volunteers had arrived in Ukraine to fight against Russian forces. He added that Ukraine was regularly receiving weapons from Western countries.\n4 March\nafter 4 March airstrike]]\nAt Zaporizhzhia Nuclear Power Plant, a projectile hit the plant site, causing a localised fire in a building that did not contain reactors. The State Nuclear Regulatory Inspectorate of Ukraine reported no changes in radiation levels and officials reported that the fire was extinguished after several hours. The transformer of Unit 6 was also damaged. After a battle that killed three Ukrainian soldiers, Russian troops occupied the power plant. The representative of the Russian Ministry of Defense, Igor Konashenkov, said that the attack on the power plant was an attempted provocation by a Ukrainian sabotage group. Secretary of the National Security and Defense Council of Ukraine Oleksiy Danilov said that the shelling of the power plant was carried out by the Russians.\nNATO Secretary-General Jens Stoltenberg rejected Ukraine's request for a no-fly zone over the country, stating that this would lead to a full-fledged war with Russia. The United States said that Russia had fired more than 500 missiles at Ukraine and the Russian Kyiv convoy north of Kyiv was  away from the capital.\n5 March\nRussian armed forces announced a ceasefire to allow around 200,000 civilians to evacuate Mariupol, which lacked water and electricity. Soon after this, however, the ceasefire ended with Russia and Ukraine blaming each other for the breakdown. Meanwhile, Arestovych stated that Russian troops had captured Bucha and Hostomel.\n6 March\nThe Havryshivka Vinnytsia International Airport was destroyed after being hit with Russian missile attacks during the day. The Zhytomyr Armour Plant was destroyed in a Russian airstrike as well. A second attempt to evacuate civilians from Mariupol was meanwhile scuttled. A US defense official later stated that about 95% of the troops Russia had stationed around Ukraine before the start of the war were inside the country.\n7 March\nThe Hostomel City Council announced that mayor Yuri Prilipko had been killed by Russian forces. Oleksandr Markushin, the mayor of Irpin, was meanwhile reported captured.\nUkrainian armed forces stated that Russian forces had captured Vasylivka, Tokmak and Polohy. Vitaliy Kim, governor of Mykolaiv Oblast, said that Ukrainian forces had retaken Mykolaiv International Airport. The Ukrainian armed forces meanwhile said that they had retaken Chuhuiv in a counter-attack overnight, in addition to killing two Russian commanders. The Ukrainian Air Force also bombed the military airbase at the Russian-occupied Kherson International Airport.\nThe Russian Defense Ministry stated that it would open six humanitarian corridors. The Ukrainian government criticised the announcement, since only two of them led to other Ukrainian territories, while the others led to Russia or Belarus.\nA US defense official stated that Russia had deployed nearly 100% of the forces it had amassed around Ukraine before the invasion and fired more than 625 missiles.\nThe Ukrainian Ministry of Defence claimed that it had killed Russian Major General Vitaly Gerasimov near Kharkiv. He was found to be alive when he received the Order of Alexander Nevsky on 23 May, dismissing claims of his death. Later, BBC News Russian confirmed he was still alive.\nTwo Russian missiles hit oil depots in Zhytomyr and Cherniakhiv, setting them ablaze.\n8 March\nCity Council (Sumy Oblast) destroyed by overnight rocket strikes on 8 March]]\nAnother attempt to evacuate civilians from Mariupol was prevented, with the Ukrainian government accusing Russian forces of targeting the evacuation corridor. However, civilians were able to evacuate from Sumy, the first such evacuation as part of an agreement between Ukraine and Russia on humanitarian corridors.\n9 March\nPoland offered to transfer all its 23 MiG-29 fighter jets to the United States for free and deliver them to Ramstein Air Base in Germany, with the United States then delivering them to Ukraine. The US rejected the proposition, the Pentagon pronouncing Poland's proposal \"not tenable\". Davyd Arakhamia, a Ukrainian negotiator in talks with Russia, stated that more than 40,000 civilians were evacuated from various cities during the day.\n10 March\nstrikes two Ukrainian infantry fighting vehicles, March 2022]]\nTurkey hosted a tri-lateral meeting between foreign ministers in Antalya. Dmytro Kuleba, the Ukrainian Foreign minister, described his meeting with Lavrov as difficult, and said it yielded no result. The Russian Defense Ministry said that Russian forces would open humanitarian corridors everyday to Russia from 10:00.\nA senior US Defense Department official said that west of Kyiv, Russian military had advanced by about  closer to central Kyiv, in the vicinity of Hostomel Airport. The column advancing from the east was meanwhile 40 kilometres away from Kyiv. He also said that Chernihiv was now \"isolated\". Ukrainian forces ambushed a Russian column in Brovary Raion and forced it to retreat after destroying several tanks and killing a tank commander.\nThe Russian convoy approaching Kyiv from the north had largely dispersed and redeployed, according to Maxar Technologies. UK's Ministry of Defence said that Russia was likely regrouping for an attack on Kyiv.\nA Soviet-era drone crashed in Zagreb, the capital city of Croatia.\n11 March\nRussian forces expanded their offensive to Western Ukraine, targeting Ivano-Frankivsk and Lutsk. Four Ukrainian soldiers were killed and another six wounded during rocket attacks on Lutsk Air Base, while two boiler plants were shut down and the air base was destroyed. Missiles also hit Dnipro, killing one civilian, while the Russian Defense Ministry said that it had disabled the military airbase at Ivano-Frankivsk International Airport.\nAccording to Ukrainian officials, the mayor of Melitopol, Ivan Fedorov, was abducted by Russian soldiers. Elsewhere, a top Russian commander, Maj. Gen. Andrei Kolesnikov, was reported by Ukrainian officials to have been killed in action. Western officials believe that around 20 Russian major generals were taking a personal part in the invasion to motivate demoralized Russian troops.\nFighting intensified during the day to the northeast and east of Kyiv. The Ukrainian Air Force later said that Russia had conducted a false flag operation to make the Armed Forces of Belarus enter the war, by using its jets to fire at the village of Kopani near Belarus's border with Ukraine from Ukrainian airspace. It also stated that two other Belarusian settlements were attacked as well. The Belarusian Ministry of Defence, however, stated that no such attack had occurred.\nPutin approved the deployment of up to 16,000 volunteers from the Middle East to Ukraine during the day, with the Wagner Group already reported to have recruited more than 4,000 Syrians. Fighters from the Central African Republic also said that they were preparing to fight for Russia in Ukraine.\nA Russian tank also allegedly shelled a care home in Kreminna, killing 56 residents.\n12 March\nHeavy fighting occurred north of Kyiv and around other besieged cities during the day, while Ukrainian officials said that the clashes and Russian airstrikes were threatening civilian evacuations. Russian forces destroyed Vasylkiv Air Base, and the Russian Defense Ministry also said that they had destroyed the main center of radio and electronic intelligence of Ukrainian forces in Brovary.\nKuleba accused the Russian government of planning a staged referendum in Kherson to create a \"Kherson People's Republic\", run by a government sympathetic to Russia. The forces of the DPR, meanwhile, captured Volnovakha.\nThe General Staff of the Ukrainian Armed Forces stated that Russia's advance had slowed down and had been stopped at many places. Deputy Prime Minister Iryna Vereshchuk, meanwhile, said that around 13,000 civilians were evacuated during the day.\nUkrainian officials accused Russia of using phosphorus bombs in Popasna. The Sviatohirsk Lavra monastery was damaged in Russian bombing.\n13 March\ndestroying a Ukrainian Buk air defense system in the Kyiv region, March 2022]]\nRussian forces bombed the Yavoriv International Center for Peacekeeping and Security, a military base used by the Ukrainian military to hold most of their drills with NATO countries, with more than 30 missiles according to Lviv Oblast's governor Maksym Kozytskyy. He later stated that 35 people had been killed and 134 were wounded, while the Russian Defense Ministry stated that up to 180 non-Ukrainian mercenaries were killed and many weapons supplied by other nations to Ukraine were destroyed. This was the westernmost strike carried out by Russia since the war began. It also said that another Ukrainian military facility in Starichi was hit, while the mayor of Ivano-Frankivsk stated that the city's airport was hit again.\nHeavy fighting was reported on multiple fronts during the day. Ukraine said that it was counter-attacking in Kharkiv Oblast and around Mykolaiv, while the UK's Ministry of Defence stated that Russian forces were trying to isolate Ukrainian forces in Eastern Ukraine and the Russian Navy had effectively established a blockade around Ukraine's Black Sea coastline, stopping its international maritime trade.\nZelenskyy stated that nearly 125,000 civilians had been evacuated under the humanitarian corridor agreement, while Russian and Ukrainian negotiators reported progress in peace talks. An American journalist, Brent Renaud, was shot dead in Irpin as a result of fire opened by Russian forces, according to the Kyiv police department.\nAn unarmed Russian Orlan-10 reconnaissance drone crashed in the Romanian village of Tărpiu.\n14 March\nDenis Pushilin, head of the DPR, said they had downed a Ukrainian Tochka-U missile over Donetsk, but the city centre was struck by the missile's fragments. The Russian Defense Ministry said that 23 civilians were killed. The Ukrainian military however said that Russian forces were behind the attack. In retaliation, the Russian Defence Ministry promised to take steps to destroy Ukraine's defence industry outfits. It also said that Russia knew the locations of all \"foreign mercenaries in Ukraine\" and the Russian forces would continue to strike them with precision.\nA Russian missile strike hit a transmission tower in the village of Antopi in Rivne Oblast, according to oblast governor Vitaliy Koval. Koval later stated that 21 civilians were killed and nine were wounded. Dnipro Oblast governor Valentyn Reznichenko stated that Russian bombardment of the Dnipro International Airport destroyed its runway and damaged the terminal. Civilians were able to evacuate Mariupol for the first time.\nA senior US Department of Defence official stated that Russia's advance had been stalled on almost all fronts, but it did not seem that it would stop its attacks. The Syrian Observatory for Human Rights also reported that over 40,000 Syrians had registered to fight for Russia in Ukraine. It added that recruitment notices had been sent out to Al-Katerji militia, which had acted as an intermediary between the Syrian government and the Islamic State group in the past.\n15 March\nThe Russian Defense Ministry stated on 15 March that Russian forces had taken complete control of Kherson Oblast and had shot down six Bayraktar TB2 drones in the previous 24 hours. Russian landing ships approached the coast of Odesa.\nHerashchenko later said that Russian Maj. Gen. Oleg Mityaev was killed in Mariupol. The Ukrainian Air Force meanwhile struck the military airbase at the Kherson International Airport again, destroying multiple Russian helicopters.\nOn the same day, Prime Minister of the Czech Republic Petr Fiala, Prime Minister of Slovenia Janez Janša, Prime Minister of Poland Mateusz Morawiecki, and Deputy Prime Minister of Poland Jarosław Kaczyński later visited Kyiv via rail and met with Zelenskyy to show support for Ukraine.\n16 March\nThe U.S. Embassy in Kyiv reported that Russian forces had shot and killed 10 people queuing up for bread in Chernihiv, though it provided no evidence. Videos were later posted by others on social media showing the purported aftermath.\nUkraine later announced its forces had begun a counter-offensive to repel Russian forces approaching Kyiv, with fighting in Bucha, Hostomel, and Irpin. Additionally, Ukrainian forces also started an offensive near Mykolaiv towards Kherson.\nAndriy Yermak, Head of the Office of the President of Ukraine, later reported that Russian forces had released Melitopol's mayor, Ivan Fedorov. The regional drama theater in Mariupol, sheltering around 1,000 civilians, was bombed later that day. In two places outside the theatre, the word \"дети\" (Russian for \"children\") was spelled out in an attempt to identify it to invading forces as a civilian air raid shelter containing children, and not a military target.\n17 March\nThe city of Izium, in eastern Ukraine, was reportedly captured, though fighting continued.\nIn response to the invasion, Canada introduced the Canada‑Ukraine authorization for emergency travel visa, reducing the barrier of entry to Canada for Ukrainian residents fleeing the war.\n18 March\nRussian artillery hit a Ukrainian military barracks in Mykolaiv, where around 200 soldiers were stationed. Only one survivor was pulled from the rubble the next day; temperatures fell below −6&nbsp;°C (21&nbsp;°F) during the night.\nIn northern Poltava Oblast, local hunters reported that they had captured more than 10 Russian tanks and turned them over to the Ukrainian Army.\n19 March\nRussian forces bombed an art school in Mariupol where 400 people were taking shelter.\n20 March\nThe deputy commander of the Russian Black Sea Fleet, Andrey Paliy, was confirmed to have been shot dead by Ukrainian forces.\nAround 11 p.m., the Kyiv shopping center Retroville, in Podilskyi district, was hit by a Russian Kalibr missile. Russia claimed that the shopping center was storing equipment for Ukrainian forces. The attack resulted in at least 8 deaths.\n21 March\nAn ammonia leak occurred from the Sumykhimprom chemical plant, located in Sumy.\n22 March\nThe Ukrainian state agency responsible for the Chernobyl exclusion zone reported that Russian forces had destroyed a new laboratory at the Chernobyl nuclear power plant. The laboratory, which opened in 2015, worked to improve the management of radioactive waste, among other things. \"The laboratory contained highly active samples and samples of radionuclides that are now in the hands of the enemy, which we hope will harm itself and not the civilized world\", the agency said in its statement.\n23 March\nA senior US defence official said that Ukrainian forces had pushed Russian forces back on the frontlines east of Kyiv. The official added that Russian forces were becoming more active in the eastern part of Ukraine in the Donbas area, saying they were \"applying a lot more energy\" in the Luhansk and Donetsk regions.\n24 March\nAn explosion occurred on board the Russian Navy's Saratov Alligator-class landing ship while the vessel was berthed in Berdiansk. Ukrainian forces stated that they hit the ship with a Tochka ballistic missile, but the cause of the explosion is yet to be verified. The two other landing ships accompanying the vessel quickly left the port, one of them on fire, and it is currently unknown whether they sustained any damage.\nRepresentative of the Russian Ministry of Defense Igor Konashenkov stated that the city of Izium was completely under the control of the Russian army. This was later denied by Ukrainian officials.\nUkrainian officials said that Russian forces had used phosphorus bombs.\n25 March\nUkrainian forces mounted counterattacks on Kyiv's eastern approaches, recapturing some defensive positions and settlements such as Lukyanivka. Just northwest of the capital, the fighting for Irpin continued, most of the town remaining in Ukrainian hands amid sustained Russian artillery fire. Russian forces took over the city of Slavutych north of Kyiv, close to the Chernobyl nuclear site. A Ukrainian airstrike on a command post of the 49th Russian Army in the Chornobaivka airfield in Kherson Raion killed the Russian general Yakov Rezantsev. Ukrainians began a counterattack east of the city of Kharkiv in Ukraine's northeast.\nThe Russians continued to target military and civilian infrastructure in a bombing campaign, hitting the Ukrainian Air Force command center in Vinnytsia in west-central Ukraine. Colonel General , first deputy chief of Russia's General Staff, stated in a media briefing that the \"first stage\" of Russia's military operation was complete, and that their primary focus was now centered on \"the liberation of Donbas\".\n26 March\nIn the ongoing battle of Kyiv, suburbs to the west and east of the capital, including Маkariv, Bucha, Irpin, and Bilohorodka, continued to be shelled by the Russian military and in some areas, such as Bucha and Nemishaieve, Russian forces were digging in. After tense street protests by locals in the occupied city of Slavutych, north of Kyiv, the Russian military agreed to withdraw provided there were no Ukrainian soldiers in the city, but set up a checkpoint outside Slavutych.\nThe Ukrainian military reported that they recaptured the city of Trostianets – strategically located between the larger settlements of Sumy and Kharkiv – and the villages of  and Malynivka east of Huliaipole in Zaporizhzhia Oblast. A Ukrainian counterattack also continued east of the city of Kharkiv, leading to the recovery of several settlements, such as the heavily contested village of Vilkhivka.\nUkraine's State Nuclear Regulatory Inspectorate said that the neutron source experimental facility in the Kharkiv Institute of Physics and Technology came under shelling by Russian forces, adding that the fighting made it impossible to assess the damage.\nRussian missile strikes also targeted industrial and military facilities, including fuel storage depots and a radio repair plant in Lviv, western Ukraine, hitting the city for the first time in the invasion.\nThe attack coincided with US President Biden delivering a speech in Warsaw, the capital of neighboring Poland, in which he pledged continued support to Ukraine and said President Putin could not \"remain in power\". The White House later clarified that it was not a call for a regime change.\nAnatoly Bibilov, the Russian-backed leader of Georgia's breakaway state of South Ossetia, confirmed that local forces had joined Russian troops transferred from the region to Ukraine.\n27 March\nafter missile strike]]\nRussian military continued missile strikes across Ukraine including the cities of Lutsk, Kharkiv, Zhytomyr and Rivne, while Mariupol was again subjected to sustained shelling. Ukraine's defense officials reported that the Russian forces – their ground offensive largely stalled – were attempting to regroup and establish a \"corridor\" around Kyiv to block supply routes to the capital. The Ukrainian military stated on 28 March that four Russian planes, one helicopter, two drones, and two cruise missiles were downed during the previous 24 hours.\nThe Ukrainian army continued its counteroffensive in the Kharkiv region near the Russian border, claiming full control of Mala Rohan and much of Vilkhivka. According to the Ukrainian military, the Russians largely abandoned their advance in the Sumy region, but regrouped and counterattacked at Izium. The pro-Russian forces of the Luhansk People's Republic reported that the Ukrainian military lost 60 men, six tanks, and three armored personnel carriers in the region on 27 March.\nThe Chief of the Defence Intelligence of Ukraine, Brigadier General Kyrylo Budanov, stated that Russia's efforts to overthrow the Ukrainian government had failed and that Putin was now trying to split Ukraine per the \"Korean scenario\". Zelenskyy said in an interview with Russian independent journalists that his government was ready to accept a neutral, non-nuclear status as part of a peace deal with Russia, but that any agreement would require approval in a nationwide referendum.\n28 March\nThe Ukrainian Defence Ministry said that Russian forces were regrouping to advance towards Donetsk and Luhansk, partially controlled by Russian-backed separatists, while bringing more warships in the Black and Azov seas closer to the coastline, probably to carry out more missile strikes in Ukraine. On the Kyiv front, the western suburbs of Bucha, Irpin, Hostomel, and Makariv, as well as the route from and to the city of Zhytomyr to the west, and areas north of Vyshhorod remained subject to Russian shelling. Later on 28 March, Mayor Oleksandr Markushyn announced that the city of Irpin had been fully retaken by the Ukrainian forces.\nHeavy fighting continued in Mariupol, where the Ukrainian forces resisted the Russian offensive into the city's centre. Ukrainian officials accused the Russian military of forcibly deporting local civilians, including children, to Russia. The Ministry of Foreign Affairs of Ukraine described the besieged city as turned into \"dust\" by the Russian military. The mayor of Mariupol, Vadym Boychenko, called for a complete evacuation of the remaining population of the city.\nRussia's Defence Ministry said on 29 March that it had destroyed a large fuel depot in Ukraine's Rivne region with cruise missiles on the evening of 28 March.\n29 March\nUkrainian and Russian negotiators met in Istanbul for a new round of in-person talks. Ahead of the meeting Turkish President Recep Tayyip Erdoğan stated that Ukraine was ready to agree to 4 out of Russia's 6 demands. He claimed Ukraine was prepared to renounce NATO membership and to make Russian Ukraine's second official language. According to Erdoğan Ukraine was not prepared to recognise the Russian occupation of Crimea or parts of Luhansk and Donetsk Oblasts. Ukraine proposed adopting a neutral status in exchange for security guarantees along the lines of NATO Article 5. The proposals also included a 15-year consultation period on the status of Russian-annexed Crimea and return of all Russian forces to their pre-invasion positions. Russia's Ministry of Defense announced \"drastic reduction of military activity\" on the Kyiv and Chernihiv fronts, which, Russian presidential aide Vladimir Medinsky clarified, was not tantamount to a ceasefire. The United States Department of Defense cautioned that an observed movement of elements of the Russian army away from Kyiv was likely \"a repositioning, not a real withdrawal\". In a televised meeting with military bloggers on 13 June 2023 Russian President Vladimir Putin claimed that Russia and Ukraine had on this day came to \"a good agreement on how to resolve the current situation by peaceful means\" but that the Ukrainians had \"threw it away\" after the withdrawal of Russian troops from Kyiv after the (failed) Russian 2022 offensive on Kyiv. According to Putin Ukraine had agreed to curb Neo-Nazism in Ukraine through the \"introducing appropriate restrictions in the law in Ukraine\", but this had failed to happen intentionally. On 14 June 2023 President of Belarus Alexander Lukashenko claimed, in an interview with Russia-1, that Ukrainian and Russian delegations had discussed the possibility of \"some sort of a lease\" of Crimea during the March 2022 negotiations.\nDespite the negotiations, airstrikes and ground fighting continued unabated. The Ukrainian military reported they were holding back Russian invasion forces in the east, southeast, and northeast, counterattacking in certain areas. Intense fighting occurred around the suburbs of Kyiv, especially in the northwest and northeast of the capital. A Russian airstrike hit a regional government building in Mykolaiv, killing at least 35 and wounding 33 others.\nLocal officials reported a series of explosions outside the Russian city of Belgorod, near the border with Ukraine. According to TASS, a temporary Russian military camp was hit by a shell fired from the Ukrainian side, wounding at least four.\n30 March\nRussian military continued to state that de-escalation around Kyiv and Chernihiv for a \"planned regrouping of troops\" was underway in order to focus on the Donbas region. The Ukrainian Defense Ministry stated they had not noticed any massive withdrawal of the Russian forces, but individual units were being pulled back to replenish the heavy losses they had suffered. In the meantime, heavy fighting and shelling continued in the outskirts of Kyiv, including around Irpin. Local officials also reported heavy shelling of Chernihiv as well as the Ukrainian-controlled areas in the Donbas region, including Mariupol, Marinka, Krasnohorivka, Avdiivka, Lysychansk and other settlements.\n31 March\nThe Russian military increased their number of air sorties, their airstrikes principally focused on the areas of Kyiv, Chernihiv, Izium to the south of Kharkiv, and the Donbas region. According to Ukraine's state nuclear company Energoatom, most of the Russian troops had withdrawn from the Chernobyl nuclear power plant towards the border. A US defense official also reported that Russian forces had been drawing down in the areas north and northwest of Kyiv, including the Hostomel Airport. Ukrainian forces continued to stage counterattacks in some areas, reclaiming the settlements of Zatyshshia, Malynivka, Vesele, Zelenyi Hai and Chervone in the Zaporizhzhia region and Sloboda and Lukashivka in the Chernihiv region. Russian forces said that they had captured Zolota Nyva in the Donetsk region and Zhitlovka in the Luhansk region.\nThe International Committee of the Red Cross (ICRC) reported that a humanitarian convoy was on its way to deliver aid supplies and evacuate civilians from the besieged city of Mariupol. Deputy Prime Minister Vereshchuk later said that twelve Ukrainian trucks were able to deliver humanitarian supplies to Mariupol, but the supplies were seized by Russian troops.\nApril 2022\n1 April\nThe governor of Belgorod Oblast, Vyacheslav Gladkov, stated that two Ukrainian Mi-24 military helicopters had struck a fuel storage depot in the city of Belgorod on 31 March after crossing into Russia at low altitude. Security camera footage of the depot showed a flash of light from what appeared to be a rocket fired from a low altitude in the sky, followed by an explosion on the ground.\nThe Ukrainian military confirmed that Izium was under Russian control.\n2 April\nRussian missiles hit the cities of Poltava and Kremenchuk in central Ukraine, damaging infrastructure and residential buildings, the head of the Poltava region, Dmytro Lunin  said that at least four missiles hit two infrastructure objects in Poltava while, according to preliminary information, three enemy planes attacked the industrial facilities of Kremenchuk. He also added that there was no immediate information about possible casualties. However, neither of these incidents could immediately be verified.\nThe Kyiv offensive fell apart several days after Russia said it would withdraw some troops from the north. The Russians retreated all the way back to Chernobyl. Ukraine's deputy defence minister, Hanna Maliar, later confirmed that Ukrainian forces had retaken control of all of Kyiv Oblast.\n3 April\nCorpses were found in Bucha from the Bucha massacre. At least 20 dead Ukrainian civilians were seen by reporters and, according to Bucha's mayor, 280 bodies were buried in mass graves. Human Rights Watch reported war crimes in the occupied areas of Ukraine — executions, rape, torture, and lootings.\nThe Ukrainian Defense Ministry reported that Lithuanian film director Mantas Kvedaravičius was shot and killed in Mariupol while trying to escape.\n4 April\nZelenskyy accused Russia of genocide and said that sanctions from the west were not \"enough\" to respond to Russia's actions. The United States began pushing to suspend Russia from the United Nations Human Rights Council. Putin signed a decree restricting visas for nationals of countries deemed \"unfriendly\" to Russia.\nRussia accused Ukraine of orchestrating a false flag in Bucha, calling the photos and videos a \"staged performance.\" Biden called for Putin to be tried for war crimes committed by Russian soldiers in Bucha.\nSerhiy Haidai, governor of Luhansk, said that a Russian strike had hit a tank containing nitric acid near Rubizhne, which the Ukrainian military said Russian forces had been trying to take. However, this could not be verified independently.\n5 April\nZelenskyy addressed the United Nations Security Council regarding events in Bucha. Kremlin spokesman Dmitry Peskov said that Russia was not opposed to a meeting between Putin and Zelenskyy, but such a meeting would only be held if a document was agreed upon beforehand.\n6 April\nPope Francis criticized the \"impotence\" of international organizations failing to stop the invasion.\nRussian artillery fire killed at least four people and wounded four others at a humanitarian aid distribution point on Wednesday as Russian forces bombarded towns, cities and rail infrastructure in eastern Ukraine, local officials said. Later, Ukrainian Railways reported there were a number of casualties after three rockets hit an unspecified rail station in the east, without giving further details.\n7 April\nMissiles destroyed fuel storage facilities in Mykolayiv, Kharkiv, Zaporizhzhia and Chuhuiv, according to the Russian defense ministry, which also stated that Ukraine used the facilities to supply its troops near Mykolaiv and Kharkiv and in the Donbas region.\nZelenskyy told the Greek Parliament that Ukraine needed more anti-aircraft systems, artillery systems, ammunition, and armored vehicles. In Brussels, Ukrainian Foreign Minister Dmytro Kuleba asked NATO for \"weapons, weapons, and weapons.\" The United States Congress began passing a bill that would make it easier to send weapons to Ukraine.\nThe United Nations General Assembly expelled Russia from the UN Human Rights Council.\nKremlin spokesman Dmitry Peskov admitted that Russia had suffered significant losses and called the casualties a \"tragedy\".\nBy 7 April, Russian troops deployed to the northern front by the Russian Eastern Military District pulled back from the Kyiv offensive, apparently to resupply then redeploy to the Donbas region to reinforce the renewed invasion of southeastern Ukraine.\nDmytro Zhyvytskyi, governor of Sumy Oblast, said that all Russian troops had left the region, but it was still unsafe due to rigged explosives and other ammunition Russian troops had left behind.\nSee also\n* Outline of the Russo-Ukrainian War\n* Bibliography of Ukrainian history\nReferences"
    }
  ]
}