{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of LGBTQ Mormon history in the 19th century\n\nThis is a timeline of LGBT Mormon history in the 19th century, part of a series of timelines consisting of events, publications, and speeches about LGBTQ+ individuals, topics around sexual orientation and gender minorities, and the community of members of the Church of Jesus Christ of Latter-day Saints (LDS Church). Although the historical record is often scarce, evidence points to queer individuals having existed in the Mormon community since its beginnings. However, top LDS leaders only started regularly addressing queer topics in public in the late 1950s. Since 1970, the LDS Church has had at least one official publication or speech from a high-ranking leader referencing LGBT topics every year, and a greater number of LGBT Mormon and former Mormon individuals have received media coverage.\nTimeline\n1800s\n1805\n* December – Joseph Smith, the founder of Mormonism, was born.\n1810s\n1820s\n1820\n* Spring – Smith later reported that beginning at this time he received a vision of deities and later visitations from an angel.\n1830s\n1830\n* March – The Book of Mormon was first published.\n* April – The early church was officially organized as the Church of Christ.\n1840s\n1842\n* May – The first known instance of church discipline related to same-sex sexual activity was an excommunication for the alleged bisexual behavior of 37-year-old church leader John C. Bennett, who was accused of \"buggery\" by Joseph Smith's brother William in The Wasp newspaper. Historian Samuel Taylor also alleged that Joseph Smith caught Bennett having sex with 21-year-old Francis Higbee.\n* July – The Wasp newspaper also reported that the apostle Orson Pratt implicitly accused Joseph Smith of engaging in same-sex sexual activity.\n1845\n* February – The Church's Newspaper Times and Seasons writes that \"'Even as Sodom and Gomorrah, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example suffering the vengeance of eternal fire.' ... No wonder we have earthquakes, hot springs and convulsions in the earth, if the damned spirits of six thousand years, ante-deluvians, Sodomites, Egyptians, apostates of Israel, and mobbers of Babylon, which have gone down (into the pit) quickly, act like their fellow servants of this generation!\" One source states that 1800's understanding of the term \"sodomy\" and the specific sins of Sodom did not imply homosexuality, and that the Book of Mormon reference to the sins of Sodom was not including homosexual acts.\n1850s\n1851\n* 1851 – The church-controlled legislature of the newly formed Utah Territory passed the first law addressing same-sex sexual behavior banning any \"man or boy\" from \"sexual intercourse with any of the male creation\" with penalties left to the courts' discretion. Brigham Young acted as both Utah governor and church president in the theocratic government and oversaw the selection of the legislators.\n1853\n* April – The apostle Parley P. Pratt taught that God destroyed Sodom due to its \"lawless abominations\" and for predisposing its children \"to be fully given to strange and unnatural lusts, appetites, and passions\". This contrasted with church founder Joseph Smith's teaching a decade earlier that it had been destroyed for rejecting the prophets (rather than citing the traditional sexual interpretation).\n1855\n* April – The church's newspaper printed an article in which mission president Nathanial Vary Jones of the East India Mission in Calcutta, India, falsely states that around the year 1700 the people of Burma (Myanmar) were about to become extinct because the men were practicing \"the crime of Sodomy\" instead of procreating with the women until the king and queen decreed that the women should wear clothing that exposed more skin in hopes of \"reclaiming their men\", which prevented their people's extinction.\n1856\n* The first known reference to female same-sex eroticism in Mormon history occurred in 1856, when a Salt Lake man noted in his diary that a Mormon woman was \"trying to seduce a young girl.\" She was publicly accused but no charges were made against her.\n1858\n* April – Travelling bishop and later church historian A. Milton Musser wrote that Salt Lake City member Almerin Grow had demonstrated odd behavior and was wearing his wife's clothing in one of the first reported instances of gender non-conforming dress in the Mormon community. Church president Young subsequently sent him south to \"never return,\" so Grow appointed Musser as guardian of his daughter. Another instance of gender non-conforming dress occurred in the 1880s when then apostle (and later church president) Wilford Woodruff wore a dress and sunbonnet as a disguise while hiding in southern Utah from law enforcement over his outlawed polygamous marriages.\n1860s\n1862\n* April – Church president Brigham Young stated that \"men will be sealed to men back to Adam\" in reference to same-sex sealings in which men were sealed to other unrelated men in the Law of Adoption practiced in early Mormonism.\n1870s\n1876\n* February – Seventeen-year-old, George Naylor was sent on a mission to Arizona to separate him from his 28-year-old non-Mormon lover Frank Wells by church leaders citing their \"scandal and improper connexion [sic]\". There were no recorded excommunications for homosexual conduct under Brigham Young's time as church president (i.e. 1845–1877).\n1879\n* November – Twenty-six-year-old Arthur Bruce Taylor (1853–1924?), the son of then current church president John Taylor, had a long discussion with second counselor Joseph F. Smith who wrote in his journal that Bruce was \"acane!\". Smith had served a church mission in Hawaii where he became acquaintance with the Aikane custom where young males were socially acceptable sexual companions of older male leaders. Soon after this meeting Bruce left the LDS Church and moved to Oregon where he never married.\n* George Q. Cannon states in a talk \"I consider our false tradition upon this subject one of the greatest evils at the present time that exists upon the earth. It has come down to us from the Greeks and Romans, than whom [sic] a more abominable lot of people never lived upon the earth. To read their books is enough to make a man with the least feeling of modesty blush and be ashamed of his race. Yet they are introduced into our literature. Whoever reads Horace, Sallust, and numbers of those authors, well knows how full of corruption they are, Not only crimes, but crimes against nature were justified by some of the best and most noted of Greek philosophers, and were practised by Sophocles, Socrates, and others; and yet this is the philosophy that has come down to us.\"\n1880s\n1881\n* John Taylor states in a talk that \"[God] cut off the cities of Sodom and Gomorrah in consequence of their corruptions, and by and by he will shake all the inhabitants of the earth ... because of some of these corruptions that Brother Joseph F. Smith has briefly hinted at, namely, the perversion of the laws of nature between the sexes, and the damnable murders that exist among men.\"\n1882\n* John Taylor returns to sexual corruption in a talk, stating \"We cannot hold communion with people who are corrupt, low and degraded. ... We know the infamies which exist there, the licentiousness, the corruption, the social evil, adulteries, fornication, sodomy, child murder, and every kind of infamy. And they come here and want to teach our children these things. ... We don’t want these practices insidiously introduced among us. We want to preserve our purity, our virtue, our honor, and our integrity.\"\n* September – After hearing of a group of teenage males engaging in same-sex sexual activity First Presidency member Joseph F. Smith told the Richfield, Utah stake presidency to \"get the names of all of them & cut them off the church\" and described their behavior as a monstrous, obscene, filthy iniquity for which Sodom and Gomorrah was burned. This was the first known excommunication of teenagers for same-sex sexual activity.\n1883\n* January – Author William Fotheringham wrote in the Latter-day Saint magazine The Contributor that \"According to the laws of Moses, idolatry, violating the Sabbath day, homicide, adultery, incest, rapes, crimes against nature, blasphemy, witchcraft, and the striking and cursing father and mother were punished by death.\"\n1885\n* 1885 – B. Morris Young, a founder of the church Young Men's program and a son of church president Young, began performing in drag as a Vaudeville female impersonator Madam Pattirini. He sang opera in falsetto throughout Utah into the early 1900s, and his gender-non-conforming act was well-received at church social events. While historical evidence does not point to Young being a sexual or gender minority, it has been speculated by historian Michael Quinn that Mormon Tabernacle Choir director Evan Stephens (who also performed in drag during the late 1800s) was physically attracted to other males.\n1886\n* 1886 – The Salt Lake City Bohemian Club was founded, becoming a safe haven by 1905 for homosexual persons, including many current and former Mormons. By 1908 the club's discussions and associations became more overtly homosexual with lesbian club member Mildred Berryman (who was Mormon for a time) beginning her thesis The Psychological Phenomena of the Homosexual in 1928 on 23 lesbian women and 9 gay men, many of whom she met through the club. Berryman reported being acquainted with one hundred homosexual persons in Salt Lake. The Bohemian Club continued until 1942.\n1889\n* 1889 – May Anderson moves in with Louie B. Felt, the first general president of the Primary organization. After the death of Felt's husband in 1907, the two continued to live together, sleeping in the same bedroom, for 40 years until Felt's death. Some historians, including D. Michael Quinn, have postulated that Anderson and Felt could have been in a same-sex relationship, citing the seemingly erotic connotations of their biographies.\n1890s\n1892\n, who was raised in a Utah Mormon home, was a famous actress who had several romantic relationships with women.]]\n* 1892? – In the early 1890s, sometime around the age of 20, famed actress Maude Adams would enter her first long-term, same-sex relationship, staying together with Lillie Florence until Florence died in 1901. She was born in Salt Lake City to a Mormon mother and spent some of her early years from age 9 to 13 being raised in Salt Lake City by her Mormon grandmother and cousins. Although it is unknown whether Adams had ever identified as Mormon like her mother, she was never baptized Presbyterian despite attending one of their schools and never joined Catholicism despite some stays at nunneries. She had additionally referred to her non-Mormon father as a \"gentile\", and invited the Mormon Tabernacle Choir to her 39th birthday performance.\n1897\n* January – The apostle Brigham Young Jr. resigned his position over the Brigham Young Trust Co. in protest of the board's decision to rent church-owned buildings on Commercial Street (now called Regent St.) to brothels. Some raids of prostitution houses there arrested male prostitutes for other men. The red-light district (and Chinatown) of Salt Lake centered around Regent Street and Plum Alley. Church property continued to be rented to brothels (which sometimes had male prostitutes) for fifty years until 1941.\n* February – Four male prostitutes were arrested in Eureka, Utah, at the state's only all-male brothel. Those arrested included a 15-year-old Mormon.\n* October – During the October General Conference, First Presidency member George Q. Cannon used the media attention on the 1895 conviction and two-year imprisonment of famed Irish poet Oscar Wilde as an opportunity to condemn homosexual behavior as an \"abominable\", \"filthy\", \"nameless crime\" that \"caused the utter destruction of Sodom and Gomorrah\". He continued stating that the only way to stop these \"dreadful practices\" was \"by the destruction of those who practice them\" and \"for the Lord to wipe them out\" noting that \"if a little nest of them were left ... they would soon corrupt others\".\nSee also\n* Homosexuality and The Church of Jesus Christ of Latter-day Saints\n* Law of adoption (Mormonism)\n* LGBT rights in Utah\n* LGBT Mormon suicides\n* List of Christian denominational positions on homosexuality\n* Mormonism in the 19th century\n* Sexuality and Mormonism\nReferences"
    }
  ]
}