{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Riga\n\nThe following is a timeline of the history of the city of Riga, Latvia.\n12th century\n* 1158 CE – At the beginning of the Northern Crusades, Bremen merchants began to arrive more frequently in the lower Daugava.\n* 1184 – The expedition of the Augustinian monk Saint Meinhard of the Augustinian monastery in Segeberg (near Lübeck) arrived at the mouth of the Daugava and began preaching Christianity and baptising the local population.\n* Around 1185, under the threat of Lithuanian attack, Meinhard promised the Livs that he would build a castle for their protection if they accepted the Christian faith.\n* 1190 – Augustinian monastery established.\n* 24 July 1198 - During Livonian Crusade, Crusader forces recruited by Bishop Berthold of Hanover in Saxony clash with Liv resistance. Bishop Berthold was killed in battle with the Livonian Imaut. In this context, the place name Riga (Latin: locus Rige) is mentioned for the first time in historical sources (Livonian Chronicle of Henry).\n* 1199\n** 5 October - Pope Innocent III issues a papal bull against Livonian apostates from the Catholic faith, against barbarians who worship \"unintelligent animals, leafy trees, clear waters, green grass and unclean spirits\".\n** Albert of Buxhoeveden becomes Bishop of Riga or Livonia.\n13th century\n* 1200\n** Spring - Bishop Albert arrives at the mouth of the Daugava with a force of 1000 men in 23 ships. After several skirmishes, the Daugava Livs were forced to make peace with the foreigners, give hostages and convert to the Christian faith.\n** Summer - The Battle of Rumbula.\n* 1201\n** Town built by Catholic bishop Albert.\n** In the depiction of summer events in the Chronicle of Henry, Riga is mentioned as a city for the first time.\n** Envoys from Curonia arrived in Riga to negotiate peace.\n* 1202\n** Bishopric of Livonia relocates to Riga from Üxküll.\n** Bishop Albert established a permanent military force, the Livonian Brothers of the Sword, which was granted the Statute of the Order of the Knights Templar, the Crusader Order, by Pope Innocent III.\n* 1203 - King Visvaldis of Jersika and Prince of Polotsk Vladimir march to Riga.\n* 1205 - The Cistercian monastery of St Nicholas was established in Daugavgrīva as a fortification to oversee the Daugava estuary and protect Riga.\n* 1205/1206 Winter - the first reports of a Christian Mystery play being performed in Riga.\n* 1206\n** A Liv uprising against the bishop's rule took place under the leadership of Mārtiņsala (Martinsholm) Elder Ako. The Livs were forced to make peace, in which they recognised the secular authority of the bishop. This was the beginning of the widespread baptism of the Livs.\n** A repeated attack on Riga by Prince Vladimir of Polotsk.\n* 1209 – St. Peter's Church active.\n* 1211 – Church of the Virgin construction begins.\n* 1225\n** Riga Town Council active (approximate date).\n** St. James's Church dedicated.\n* 1234 – St. John's Chapel built (approximate date).\n* 1255 – Archbishopric of Riga established.\n* 1260 – St. Mary Magdalene's Church built.\n* 1282 September 8 – Riga enters into an alliance with the port cities of Lübeck and Visby to jointly protect their interests in the Baltic Sea. With this union Riga joined the Hanseatic League.\n* 1285 – Johannes von Vechten became Archbishop of Riga.\n* 1292:\n** beginning – the last attack of the Semigallians on Riga under the leadership of Nameisis took place.\n** The city of Riga demanded that the Livonian Order should not build castles and fortresses to the detriment of the city.\n* 1293:\n** The second known great fire of Riga took place.\n** The Riga Town Council issued the first known building regulations for the city.\n* 1294: Johannes von Schwerin became Archbishop of Riga.\n* 1297:\n** Summer – An armed conflict with the Livonian Order began in Riga and lasted for more than 30 years.\n** 26 July – Riga is devastated by fire.\n** 30 September – The citizens of Riga destroy the Order's castle, killing the commander and 60 brothers of the Order.\n* 1298:\n** End of March – Riga City enters into a fighting alliance with the Lithuanian ruler Vytenis against the Livonian Order.\n** 12 June – The City of Riga and the Ducal Chapter conclude a treaty with King Eric VI of Denmark for military assistance in the war against the Livonian Order.\n* 1300 December 19 – Isarnus von Takkon became Archbishop of Riga.\n14th century\n* 1301 – Following the order of Pope Boniface VIII, the Livonian Order returned the previously seized castles and properties to the Archbishop of Riga, Isarnus.\n* 1302 – Jens Grand became the Archbishop of Riga, but he renounced this position.\n* 1304\n** 25 February – The Livonian Order resumed the fight for supremacy in the city of Riga.\n** 21 March\n*** The arbitration of the Archbishop of Lund resulted in a short-term truce between the Livonian Order and the city of Riga.\n*** Friedrich von Pernstein became the Archbishop of Riga.\n* 1305 May 26 – The Livonian Order bought the Daugavgrīva monastery fortress from the Cistercian monks, thus gaining control over the Riga sea gates, which were of great importance for shipping on the Daugava River.\n* 1307 July 2 – Near Riga, a battle took place between the allied Lithuanians of the Riga residents and the army of the Livonian Order.\n* 1312 – Pope Clement V excommunicated the Livonian Order due to the Riga conflict.\n* 1313\n** 11 May – The decision to excommunicate the Livonian Order was revoked.\n** 9 June – The Livonian Order concluded a truce with the city of Riga.\n* 1315 Winter – Famine raged in Riga.\n* 1316 April 24 – The Riga residents' army invaded the Livonian Order's Daugavgrīva fortress and burned down the wooden structures around it.\n* 1329\n** 22 June – The residents of Riga attacked the Daugavgrīva fortress but failed to capture it.\n** September – The Livonian Order began a 6-month siege of Riga, after which the city surrendered.\n* 1330\n** 13 June – In Riga, the Livonian Order began building a new castle in the current location.\n** Brotherhood of Blackheads organized.\n* 1332 May 8 – The Holy Roman Emperor Louis IV confirmed the Order's supremacy over the city of Riga.\n* 1335 November – Following the Pope's order, the Livonian Order returned the seized properties of the Archbishopric of Riga.\n* 1338 Autumn – The Master of the Livonian Order and the city of Riga established a weight standard for Riga's trade with Polotsk.\n* 1341 October 18 – Engelbert von Dolen became the Archbishop of Riga.\n* 1348 March 17 – Fromhold von Vifhusen became the Archbishop of Riga.\n* Around 1350 – The Black Death plague pandemic struck Riga.\n* 1352\n** 18 November – The corporate association of craftsmen – the Small Guild – was established in Riga.\n** The first public clock in Riga was installed in St. Peter's Church.\n* 1353 and 1354 – Relations between the Livonian Order and the Archbishopric and city of Riga became strained.\n* 1354\n** The merchants' association – the Large Guild – was established.\n** October – After the Livonian Order refused to return the city and castle of Riga to papal control, the Order was excommunicated.\n* 1357 The Town Hall Pharmacy, the oldest pharmacy in Riga, began its operations.\n* 1360 The Riga goldsmiths' guild was the first to approve its statutes.\n* 1361 November 5 – In the dispute between the Archbishop and the Livonian Order, the city of Riga actively defended its interests.\n* 1366 and 1367 – The internationalization of the conflict between the Livonian Order and the Archbishop of Riga continued. Fearing the Archbishop's influence, the city of Riga began to support the Livonian Order.\n* 1370 February 11 – Siegfried von Blomberg became the Archbishop of Riga.\n* 1373 October 10 – Supporting the request of the Archbishop of Riga, Siegfried, Pope Gregory XI issued the so-called \"clothing bull,\" which stipulated that henceforth the Archbishop of Riga and the members of the cathedral chapter should wear black robes.\n* 1374 October 23 – Johann IV von Sinten became the Archbishop of Riga.\n* 1376 September 29 – The oldest known written rules of order in the Baltic region, regulating life and internal order in the city of Riga, were recorded.\n* 1378 – The plague epidemic raged in Riga.\n* 1386 – The Riga Town Council adopted the statutes of the trade assistant association – the Latvian Beer and Wine Carriers' Brotherhood.\n* 1393\n** Johann von Wallenrode became the Archbishop of Riga.\n** 24 September – Pope Boniface IX removed Johann IV von Sinten from the office of Archbishop of Riga.\n* 1400 – In Trakai, the envoys of the Archbishop of Riga wanted to agree with the Grand Duke of Lithuania, Vytautas, on joint action against the Livonian Order and an attack on its castle in Riga.\n15th century\n* May 1405 – Riga concluded a trade agreement with Polotsk, which was part of the Grand Duchy of Lithuania.\n* 1412 – The Riga Town Council again prohibited craftsmen of non-German origin from producing and selling beer, and forbade peasants from trading within the city walls.\n* 1416 – The unmarried foreign merchants in Riga founded the Brotherhood of the Blackheads, whose patron saint is Saint Maurice.\n* 11 July 1418 – Johannes Ambundii was appointed Archbishop of Riga.\n* 1421 – Due to plague and poor harvests, the economic situation in Riga worsened.\n* 8 February 1423 – Envoys from Riga, Tartu (Dorpat), and Tallinn concluded a trade agreement with Novgorod on behalf of the Hanseatic League.\n* 13 October 1424 – Riga Cathedral Chapter member Henning Scharpenberg was appointed Archbishop of Riga.\n* 1434 – Archbishop Henning Scharpenberg submitted a complaint to the Council of Basel about the Livonian Order's attempts to subordinate the Archbishop of Riga and other Livonian bishops.\n* 1445 – The Riga Town Council approved the statutes of the Latvian Tanners' Brotherhood.\n* 1448 – Archbishop Henning Scharpenberg died; the Livonian Order secured the appointment of Silvester Stodewescher as Archbishop by paying 4000 ducats.\n* 1450 – The Latvian Ship Loaders' Guild was founded.\n* 1452 – Under an agreement concluded at Salaspils between Archbishop Silvester Stodewescher and the Master of the Livonian Order, dual sovereignty was established in Riga.\n* 1469 – The Latvian Weighers' Guild was founded.\n* 1476:\n** The Archbishop of Riga, again attempting to reclaim the city's sovereign rights, sought assistance from Sweden and Lithuania.\n** February – Open war between the Archbishopric of Riga and the Livonian Order began.\n* 1480 March 12 – Stefan Grube became Archbishop of Riga.\n* 1481 December – Riga’s residents failed to capture the Order’s castle.\n* 1482 March 27 – The citizens of Riga signed a two-year truce with the Livonian Order.\n* 1484:\n** 18 May – After two months of battles, the Livonian Order’s castle in Riga fell.\n** 4 June – Michael Hildebrand became Archbishop of Riga.\n* 1485 – Riga unsuccessfully sought support against the Livonian Order from Hanseatic cities and Sweden.\n* 1489 November 30 – The Livonian Order resumed armed attacks against Riga, which the townspeople repelled.\n* 1491:\n** Troops of the Livonian Order's Land Marshal Wolter von Plettenberg defeated the people of Riga. The Livonian Order’s Master once again became the ruler of the city.\n** The first rooster weather vane was installed atop St. Peter’s Church tower.\n* 26 November 1498 – A delegation of Riga merchants concluded a treaty with England in London, granting extensive trade privileges to English merchants in Riga and to Riga’s merchants in England. However, the Riga Town Council did not ratify the treaty, as it caused outrage among other Hanseatic cities.\n16th century\n* 1509\n** 18 February – Jasper Linde becomes Archbishop of Riga.\n** Pope Julius II allows the Riga Town Council to choose the Archbishop of Riga.\n*1510 – December: Christmas tree displayed in marketplace.\n*1515 – Riga Castle rebuilt.\n* 1521 – Andreas Knöpken, chaplain of St Peter's Church, returns to Riga from Pomerania and begins to promote the ideas of the Reformation of the Catholic Church.\n* 1523 spring – Burghers supportive of Lutheranism stormed the Franciscan monastery.\n* 1524\n** March – Reformation-induced iconoclast riots took place in St. Peter's and St. James' Churches.\n** 24 March – The Riga Town Council established the Poor Relief Fund.\n** 29 June – Johann VII Blankenfeld became the Archbishop of Riga.\n** August – Reformation-induced iconoclasm took place in Riga Cathedral.\n** November – The Riga Town Council forbade services in St. Peter's Church and confiscated its property.\n** The first public library established, the predecessor of the present-day Academic Library of Latvia.\n* 1525 September 21 – The city of Riga concluded a treaty with Walter von Plettenberg, Master of the Livonian Order.\n* 1528 February 6 – The Riga Cathedral Chapter elected Thomas Schöning, provost of the Cathedral Church, as the Archbishop of Riga.\n* 1529 July 30 – Archbishop Thomas Schöning and Johann Lomiller, secretary of the Riga Town Council, concluded an agreement in Lübeck on the mutual relations between the Archbishopric of Riga and the city of Riga for the next 6 years.\n* 1530 – The first entries in Latvian appeared in the membership lists of the Riga Latvian Society.\n* 1531 December 29 – A treaty of faith was concluded in Riga with Duke Albrecht of Prussia.\n* 1536 – The first known records of the arrival of Jewish traders in Riga are dated.\n* 1537 – In place of the old Riga defensive walls, the construction of an earthen rampart fortification system began, stretching along the present-day Vaļņu and 13. janvāra streets.\n* 1539 – Wilhelm of Brandenburg became the Archbishop of Riga.\n* 1541 – Riga joins League of Schmalkalden.\n* 1549 – The Riga Town Council closed St. Nicholas Church, which belonged to the Russians.\n* 1547 – Sigismund II of Poland in power.\n* 1558 – Riga area besieged by Russians.\n* 1561 April 5 – Gotthard Kettler became a vassal of the Polish King Sigismund II Augustus. This event marked the beginning of the 20-year period of the Free City of Riga.\n* 1561 – Territory converts to Lutheranism from Catholicism.\n* 1562\n** 7 March – Gotthard Kettler announced that he would secure the privileges of the nobility and abolish all trade restrictions for the cities.\n** 1 April – Riga was hit by a major flood of the Daugava River, in which many inhabitants of Riga and their livestock perished.\n* 1567\n** May and June – The army of Jan Chodkiewicz approached Riga and, by building fortifications on the Daugava, tried to disrupt the city's trade.\n** 7 July – The inhabitants of Riga attacked the forces of Jan Chodkiewicz.\n* 1571 – Famine ravaged the vicinity of the city of Riga.\n* 1578 April 3 – Riga was struck by a major flood of the Daugava River.\n* 1581 – Riga is granted status of Free imperial city.\n* 1581 April 7 – Polish in power. Riga came under the rule of the Polish–Lithuanian Commonwealth ruler Stephen Báthory.\n* 1582\n** 12 March – Stephen Báthory was the first crowned ruler to visit Riga.\n** 7 April – Stephen Báthory issued an order on church matters, commanding the Riga Town Council to return St. James' Church and the Cistercian order with St. Mary Magdalene's Church to the Catholics.\n** The first state customs duty was introduced in Riga.\n* 1584\n** September – Stephen Báthory ordered Riga to introduce the Gregorian calendar.\n** 24 December – The Calendar riots in Riga begin, lasting until 1589.\n* 1586 – Summer – Town councillors Johann Tast and Gotthard Welling were executed in Riga.\n* 1588 – Nikolaus Mollyn sets up printing business. This is the first printing house.\n* 1589\n** 17 June – Polish royal commissioners arrived in Riga and granted privileges to the city.\n** 2 August – Polish opponents Martin Giese and Johann Brink were executed in the Town Hall Square.\n* 1590\n** 7 February – An instruction was issued to the Riga delegates to begin negotiations with King Sigismund III Vasa regarding the establishment of an official printing house in Riga.\n** 16 May – Nikolaus Mollyn received a privilege from King Sigismund III Vasa, granting him the right to print books in Riga (others were forbidden to reprint them).\n** 13 April – Riga was flooded by high waters.\n** The first Reformed congregation was registered in Riga.\n*1591\n** 26 April – The city of Riga was forced to take back the Jesuits, returning to them St. James' Church and the St. Mary Magdalene Monastery.\n** 1 November – The Riga Town Council, which at that time performed not only the functions of judicial institutions but also participated in legislation within the limits of its autonomy, adopted regulations on the regulation of guardianship matters (\"Vormünder Ordnung\").\n** St. Gertrude's Church, which had been destroyed in the \"iconoclasm\", was restored in the Riga suburb.\n* 1594 – Riga burgomaster Francis Nienstedt founded a shelter in the building of the Large Guild's convent on Kalēju Street for old and poor widows in need.\n* 1595 – A new church tower was built in place of the burnt-down Gothic tower of Riga Cathedral.\n* 1598 – The luxury or wedding ordinance (Hochzeit Ordnung) was issued in Riga, the purpose of which was to emphasize the differences between estates according to the hierarchical principle. It stipulated, for example, that only members of the town council and the leadership of the Large Guild could wear cloaks with velvet lapels, sable fur trim, and gold embroidery; only the bride of the Large Guild could wear a gold crown with pearls. The ordinance also regulated the order of baptism. It allowed inviting no more than five godparents to baptisms, also setting the amount of godparents' money and forbidding godparents' after-gifts to children. The ordinance was largely directed against Latvian traditions.\n17th century\n* 1601\n** 21 May – Swedish warships entered the Daugava River near Riga.\n** 31 May – Swedish warships left Riga and returned to Sweden.\n** June – Swedish warships blockaded the port of Riga, landing troops who burned the Riga suburbs.\n** 9 June – Swedish ships arrived at Riga again, but soon returned.\n** 5 July – Swedish warships arrived in the Daugava again and began military operations against Riga, but unsuccessfully.\n** 19 August – Duke Charles with the Swedish army reached Riga. Military clashes took place at the ramparts of Riga, Riga was shelled, but the Swedes were unable to capture Riga. However, the Riga suburbs were burned and the orchards were cut down.\n** 18 September – After unsuccessful Swedish battles with the Poles in Livonia, Charles abandoned the siege of Riga, and the Swedish ships finally left Riga.\n** 20 September – The 14,000-man army of the Polish King Sigismund III Vasa crossed the Daugava River and went to the aid of Riga.\n* 1604\n** 30 April – The Riga Town Council and Commune agreement was concluded.\n** 11 August – Charles IX of Sweden with his fleet arrived in the port of Riga to capture 13 Dutch ships. The Dutch had already left Riga. 3,500 troops disembarked from the Swedish ships and, under the command of Count Mansfeld, approached Riga. The residents of Riga shot the envoys sent to Riga at the Sand Gates. The Swedes began to devastate the Riga suburbs (4 windmills, St. Gertrude's Church and the barn of St. George's Hospital were destroyed).\n** 13 September – Charles IX of Sweden arrived at Riga again with a large army and besieged Riga.\n** 23 September – A repeated invitation to surrender was sent to Riga.\n** 27 September – The siege of Riga was lifted.\n** The leader of the Swedish army, Count Mansfeld, devastated the Riga suburbs, as a result of which the building of St. Gertrude's Church was also burned down.\n** Swedish warships blockaded Riga once more.\n** The Riga Town Council, fearing for the city's safety, built a new cannon and bell foundry outside the city walls on Kalēju Street 9/11.\n** A stone epitaph of the Small Guild was installed in Riga Cathedral.\n* 1605\n** 3 June – The Riga Town Council issued professional regulations (Schragen) to the Latvian cart drivers of Riga.\n** 11 August – The 4,000-man Swedish army besieged the Daugavgrīva fortress.\n** The epitaph of Theodorus Rigeman was installed in Riga Cathedral.\n* 1608\n** 5 August – The Swedes captured Daugavgrīva and established a sconce at the site of the present-day fortress.\n** The Lutheran pastor Herman Samson began working as the inspector of Riga city schools.\n* 1609 – With the Polish-Lithuanian army capturing Daugavgrīva, the siege of Riga was broken., the first book printer of Riga, and engraved by Heinrich Thum]]\n* 1611 October 11 – A strong storm raged in Riga, as a result of which trees were uprooted, and great damage was done to buildings.\n* 1615 – The Latvian Shoemakers' Guild was established in Riga.\n* 1617–1620 – The first water supply system was installed in Riga.\n* 1617 – The Swedes, led by King Gustavus Adolphus of Sweden, managed to capture the Daugavgrīva fortress.\n* 1621\n** 21 May – Residents of Riga observed an annular solar eclipse, which was interpreted as a bad omen.\n** 4 April – Devastating Daugava floods struck Riga.\n** August – The Swedish army began an attack on Riga.\n** 1 August – A strong thunderstorm with rain raged in the vicinity of Riga.\n** Swedish forces with 160 ships entered the mouth of the Daugava River and landed in the Mīlgrāvis area. The residents of Riga burned the newly built suburbs.\n** 12 August – The Swedes called on Riga to surrender, but the residents of Riga rejected the proposal. The first Swedish attacks were repelled.\n** 27 August – The Swedes completely blocked the Daugava River, and traffic with Riga was completely cut off. The blockade of Riga began.\n** 1 September – Almost all city churches were damaged in the shelling. Underground warfare began at the walls of Riga. The Swedes began to dig underground mine galleries under the fortifications.\n** 16 September – The city of Riga surrendered to the Swedish army, and Riga taken by forces of Gustavus Adolphus of Sweden.\n** During the siege of Riga, under the leadership of the Swedish Colonel Samuel Cockburn (Cobron), the construction of Kobronschanz began at the former confluence of the Mārupīte River and the Daugava River. Earth fortifications were created at this location.\n* 1622 October 4 – Johann Ulrich was elected mayor of Riga.\n* 1626\n** 30 May – A strong storm raged in Riga.\n** The outer fortification belt of the city of Riga with 11 small sconces and palisades was created.\n* 1628 – Georg von Schwengel, a fortification officer of the Swedish army, produced the first map of the Riga surroundings.\n* 1629 August 14 – Lightning struck Riga Cathedral, also damaging the organ.\n* 1631\n** The Riga Council issued an order that, like all other copies of books printed in Riga, printed speeches of the Dome School teachers and dissertations of the students should also be handed over to the city library.\n** The minting of Riga thalers was stopped in Riga.\n** Nikolai Barneke became the mayor of Riga.\n** A gymnasium was established at the Riga Dome School.\n* 1632\n** The Riga post office started operating in Riga.\n** A meeting took place in Riga where Jacob Becker proposed publishing a newspaper for Riga with a circulation of 500 copies. The newspaper could be printed by G. Schröder, and Becker himself would supply the paper from his paper mill near Tartu. G. Schröder, J. Becker, the Riga Council syndic, and the \"printing masters\" appointed by the council participated in the meeting. Unfortunately, this proposal did not receive support, and Becker realized his idea in Königsberg.\n* 1633 – The Latvian Tailors' Guild was established in Riga.\n* 1634\n** The first manufactory, Rutger Nidehof's sawmill, started operating in Riga.\n** A church was built and the Katlakalns pastorate was founded in the territory of the Riga patrimonial district between Bieķensala and Akmeņsala. The first pastor of Katlakalns was Mag. Peter Bauer.\n* 1638 – Church of Jesus consecrated.\n* 1640 – Fortification works were carried out in Riga, financed by the Swedish government, but the construction was supervised by Erik Dahlbergh (later Governor-General of Riga).\n* 1642\n** A house of correction was built in Riga.\n** A new wing was added to the Daugava side of Riga Castle, which has survived to this day.\n** To free up territory for the expansion of Kobronschanz, the Red Guard Tower, built in the 15th century in Pārdaugava, was demolished.\n* 1645 – The residence of the Governor of Vidzeme was moved from Tartu to Riga.\n* 1646\n** Extensive repairs began at Riga Castle, as a result of which an oriel was built on the corner of the front castle.\n** A house was built on Mazā Pils Street, the facade of which was made in the Dutch Mannerist style. It is now known as one of the \"Three Brothers\" houses.\n* 1649\n** April – The stream of the Daugava River washed away the Katlakalns mill, as well as many surrounding peasant houses.\n** 1 April\n*** During the Daugava flood, Riga was flooded, and all buildings on the islands perished.\n*** The Daugava water broke through the Inča dam (now Latgale neighborhood) in two places, flooding the entire suburb in Pārdaugava, while all the buildings were washed away on the islands.\n** A residential building with a corner turret – an oriel, richly decorated with early Baroque style reliefs, was built in the northwest corner of Riga Castle. The author of the reliefs is the sculptor Daniel Ankerman.\n* 1650\n** Powder Tower rebuilt.\n** A canal was dug in front of the Riga city fortification wall, which still exists today.\n*1652\n** 26 November – The Riga Town Council issued an order to satisfy the request of the printer Gerhard Schröder and allocate him one bay in the crossing of the Riga Cathedral free of charge for the storage of materials and books.\n** According to the Riga police regulations, \"Latvian\" trades (guilds) were admitted to the Small Guild.\n* 1654–1667 – Riga was threatened by the Second Northern War.\n* 1656\n** 22 August–5 October – Riga was besieged by the army of the Tsardom of Russia, by Russian forces of Alexis Mikhailovich.\n** 12 September – Reinforcements of 1400 soldiers were delivered to the Riga garrison under the command of Swedish General Douglas and Field Marshal Königsmarck. This forced the Russian Tsar to consider ending the siege.\n** 12 October – The Riga garrison, led by Jakob De la Gardie, launched a successful attack against the Russian troops.\n** 16 October – The Riga garrison attacked the retreating Russian army again but suffered a defeat. This made De la Gardie abandon further pursuit of the Russians.\n** Due to Russian bombardment, the building of Riga Gymnasium was destroyed.\n** The Russians also captured the Kobronschanz battery on the left bank of the Daugava River. The main attacks on the fortress took place in three locations – at Riga Castle, at the Bath Bastion, and at the Marstall Gate, where the defenders’ artillery inflicted heavy losses on the attackers. Tsar Alexei Mikhailovich, who led the siege, ordered trenches to be dug closer to the city, and 18 cannon batteries were gradually moved closer to the fortifications. Although the Russians managed to capture two earthworks and positioned cannons on Cube Hill (now the Esplanade Square), Riga’s fortress remained unconquered, and the Russian army was forced to retreat from Riga.\n** According to contemporary reports, the Russian army lost 8000 men at Riga, and an additional 6000 were killed by peasants armed with muskets and scythes further away from the city.\n** The statutes of the Small Guild were confirmed in Riga.\n** Repeated bans on luxury clothing were issued in Riga. This shows that even during the relatively puritanical Swedish rule, it was impossible to suppress the Riga citizens' inclination to dress richly and splendidly.\n* 1663 – The first centralised water supply system is opened in Riga.\n* 1665 – The Latvian Brotherhood of Blacksmiths was established in Riga.\n* 1666 March 11 – The tower of St Peter's Church, more than 130 metres high, collapsed in a lightning storm.\n* 1675 – The Charles Lyceum was founded in Riga, where Latvian children were also educated.\n* 1680:\n** The Latvian Brotherhood of Carpenters was founded in Riga.\n** The newspaper \"Rigische Novellen\" began to be published regularly in Riga.\n* 1684-1688: Reitern House was built at 2/4 Marstaļu Street.\n* 1691: The 7th oldest pharmacy in Riga, the ''Lion's Pharmacy'', was founded.\n* 1695: The Swedish royal surveyor J. A. Ullrich produced road maps of Riga and the Tartu County, one of the first in Europe.\n* 1696: Dannenstern House was built at 21 Marstaļu Street.\n* 1698 – Swedish Gate constructed.\n18th century\n* 1700\n** 11 February – Saxon troops attacked Riga.\n** 12 February – Governor-General of Livonia, Erik Dahlbergh, issued an order to form armed peasant units for the defense of Riga.\n** 16 February – The Saxons captured Pārdaugava, Lucavsala, and other islands on the left bank of the Daugava River.\n** 28 October – The Russian army captured Pārdaugava.\n** Following an order by King Charles XII of Sweden, the first bridge across the Daugava in Riga was opened – the Floating Bridge.\n, 1701]]\n* 1701\n** 9 July – The Swedish army crossed the Daugava River and defeated the Saxon army on the Spilve plain (Battle of Spilve).\n** 29 July – A fierce battle between Swedish and Russian forces took place in Lucavsala.\n* 1709\n** 13 April – The floodwaters of the Daugava River in Riga reached the altar in Riga Cathedral, while in the southern suburb they reached up to the roofs of houses.\n** 28 October – The army of the Russian Empire began the Siege of Riga.\n]]\n* 1710\n** Siege of Riga; Russians in power.\n** 29 June – A plague epidemic and famine force Riga to surrender to Russian commander Boris Sheremetev.\n** 5 July – Russian troops led by Prince Anikita Repnin entered the city in accordance with Riga's surrender. The Russian Tsar Peter I appointed the Prince as Governor-General of Riga.\n** 8 August – Daugavgriva Fortress surrendered to the Russians.\n* 1710 and 1711 – The Great Plague epidemic halved the population of Riga from 10000 to 5000\n* 1711\n** 9 February – Alexander Menshikov becomes Governor-General of Riga.\n** On the orders of Tsar Peter I of Russia, the Forburg Garden, now the Viesturs Garden, was created.\n* 1713\n** 28 July – Tsar Peter I of Russia established a special governorate of Riga with Riga as the administrative centre and the residence in the Riga Palace.\n** Riga City Museum was founded.\n* 1714 – A raft bridge is built across the Daugava River.\n* 1719 September – Anikita Repnin became governor-general of Riga.\n* 1721\n** 1721 – Riga becomes part of Russian Empire.\n** 21 May – Lightning struck the tower of St. Peter's Church in Riga and it burnt down.\n* 1726 13 July – Empress Catherine I of Russia issues a decree on the extradition of peasants who have fled to Riga to the nobility.\n* 1727 – Grigory Chernyshov becomes Governor-General of Riga.\n* 1728 – St. Peter and St. Paul Church built (approximate date).\n* 1730 – Peter Lacy becomes Governor-General of Riga.\n* 15 April 1738 – Riga Town Council issued a decree on the expropriation of real estate from Latvians.\n* 17 September 1742 – Empress Elisabeth of Russia signed the Riga City Law.\n* 1750 – Riga merchants Johann Dietrich von der Heyde and Johann Zuckerbecker founded the first Freemasons' Zum Nordstern lodge in Riga.\n* 1756:\n** 17 July – The Riga Magistrate confirmed the privileges of local merchants in the city market.\n** 27 September – The export of cereals was banned in Riga.\n* 1762 – Georg Braun becomes Governor-General of Riga.\n* 17 April 1763 – By order of Empress Catherine II, a special commission was set up in Riga to study Riga's trade.\n* 1765 – City Hall built.\n* 1773\n** Great Cemetery and Pokrov Cemetery established.\n** Himsel Museum established.\n* 22 May 1775 – The first Russian merchant is granted the rights of a Riga landlord.\n* 1781 – City becomes capital of Riga viceroyalty.\n* 1782 – The Riga City Theater is founded.\n* 3 July 1783 – the administrative reform subordinated Riga to the newly created Riga Vice-Magistrate.\n* 1784 – Rave Sugar Factory was founded.\n* 1784 and 1785 – Kube Hill is built on the site of the present Esplanade.\n* 5 June 1785 – A new police apparatus began to be established in Riga, which met the requirements of the Russian Empire.\n* 1785 – Our Lady of Sorrows Church built.\n* 1786\n** 16 October – Riga Governor-General Georg Braun ordered Riga Town Council to organise elections for the head of the city.\n** 22 October – Heinrich Strauch was elected the first head of Riga.\n** On the orders of Empress Catherine II of Russia, the 3rd or Jelgava suburb of Riga was established as the territorial division of the city.\n* 1787\n** 4 January – Members of the new Riga Magistrate were elected.\n** 8 January – The old town lords were dismissed and the newly elected magistrate took over the administration.\n** 12 January – The new City Police Board begins its work.\n** March – Judges of the Interpretation Courts and their presiding magistrates were elected in all 5 districts of the city.\n*1788\n**28 August – A new Social Welfare Board, the Foundation Directory, was established in Riga.\n** The largest general strike of craftsmen's greengrocers takes place in Riga.\n** 1789: Katrina School opened in Riga, the first school in Riga with Russian as the language of instruction.\n*1794\n** Freemasonic lodges in Riga closed.\n** Riga City Discount Treasury founded.\n* 1796 – City becomes capital of Livonia.\n* 1798 – Grebenstchikov House of Prayer rebuilt.\n19th century\n* 18 July 1801 – By the decision of Emperor Alexander I of the Russian Empire, Riga became the administrative centre of the Baltic Governor-General's Oblast, with Prince Sergei Golitsyn as the first Governor-General of Baltic provinces.\n* 15 May 1803 – The city's first hospital is founded.\n* 1809 – The first pharmacy in Pardaugava is established on Akmeņu Street.\n* 1812\n** Fire.\n** Siege of Riga by French forces.\n* 10 July 1814 – The foundation stone of the Annunciation of Our Most Holy Lady Church, Riga was laid at 9 Emilia Benjamiņa Street.\n* 20 June 1816 – The Stock Exchange Committee was founded, which united Riga merchants and industrialists without distinction of nationalities.\n* 8 June 1817 – Wohrmann Park inaugurated.\n* 1818\n** Annunciation of Our Most Holy Lady Church built.\n** Erection of a granite column in a square facing the citadel to commemorate the defeat of Napoleon in 1812.\n*  by Karl Friedrich Hauswald and GC Scharlow]]1825 – St. Alexander Nevsky Church built.\n* 1833 – Homeopathic pharmacy opened by the Association of Chemists and Pharmaceutists.\n* 1845 – Museum of Natural History founded.\n* 1852 – St. Martin's Church built.\n* 1854 – Riga blockaded by British.\n* 1855\n** 6 October – Construction of the Riga Stock Exchange is completed.\n** The Riga-Petersburg telegraph line is established.\n** Telegraph communication with Germany begins.\n* 1857\n** Large Guild built.\n** Population: 70,463.\n* 1858 – City fortifications dismantled.\n* 1859 – St. Saviour's Anglican Church built.\n* 1861 – Riga Central Station built; Riga – Daugavpils Railway begins operating.\n* 1862 – Riga Polytechnical Institute founded.\n* 1863 – Riga City Theatre built.\n* 1866 – Small Guild built.\n* 1867 – Population: 102,590.\n* 1868\n** Riga – Jelgava Railway begins operating.\n** Riga Latvian Society founded.\n* 1869\n** Polytechnic built.\n** Riga City Art Gallery opens.\n** Latvian Museum of National History founded.\n* 1870 – Kunstverein founded.\n* 1873 – Latvian Song and Dance Festival begins.\n* 1877 – Tornakalns – Tukums II Railway begins operating; Brasa Station opens.\n* 1878 – Imperial city self-government statute in effect.\n* 1881 – Population: 169,329.\n* 1883\n** Riga Russian Theatre established.\n** Nativity Cathedral built.\n* 1887 – St. Paul's Lutheran Church built.\n* 1889 – Riga – Lugazi Railway begins operating. in the 1890s]]\n* 1890 –  becomes mayor.\n* 1891\n** Church of Luther consecrated.\n** Russian language becomes official language of Baltic provinces.\n* 1892\n** Municipal \"counter-reform\" enacted by imperial government.\n** St. Francis Church consecrated.\n* 1895 – Holy Trinity Orthodox Church built; Holy Archangel Mikhail Church dedicated.\n* 1897 – Population: 282,943.\n20th century\n* 1903 – Commercial school established.\n* 1905\n** 13 January: Demonstration suppressed by Russian army.\n** Museum of Art built.\n* 1906\n**  (library) opens.\n** St. Gertrude New Church built.\n**  established.\n* 1907 – Holy Trinity Cathedral built.\n* 1909 – Church of the Cross and Cat House built.\n* 1912 – Riga Zoo opens.\n* 1914\n** Railway Bridge inaugurated.\n** Population: 569,100.\n* 1915\n** Brothers' Cemetery established.\n** Port closed.\n* 1916 – Riflemen Museum founded.\n* 1917 – 3 September: Germans in power.\n* 1918 – 18 November: Riga becomes capital of independent Latvia.\n* 1919\n** 3 January: Soviets in power.\n** May: Soviets ousted.\n** National Library of Latvia, Latvia Higher School, Latvian Conservatory of Music, and Latvian National Theatre founded.\n** Latvju Opera active.\n* 1920\n** Riga Artists Group formed.\n** Latvian Museum of Foreign Art established.\n** Dailes Theatre opens.\n* 1921 – Art Academy established.\n* 1922 –  created.\n* 1927 – Mezaparks Lutheran Church active.\n* 1928 – Spilve Airport in operation.\n* 1930 – Riga Central Market built.\n* 1932 – The Ethnographic Open-Air Museum of Latvia opens.\n* 1935 – Freedom Monument unveiled.\n* 1937\n** Mangali – Rujiena Railway begins operating.\n** City hosts EuroBasket 1937.\n* 1940 – Soviet occupation.\n* 1941\n** 13–14 June: June deportation .\n** 1 July: German occupation begins.\n** October: Jewish ghetto created.\n** Proletariat, Kirov, and Moscow administrative districts established.\n* 1944\n** 13 October: Soviet re-occupation.\n**  founded.\n* 1946 – Dinamo Riga ice hockey team formed.\n* 1949\n**25–28 March: March Deportations\n**Riga Autobus Factory is founded.\n* 1950 – Riga Medical Institute established.\n* 1954 – Latvijas Televīzija (television station) headquartered in city.\n* 1956\n** Academy of Sciences building constructed.\n** Riga Aviation Museum established.\n* 1957\n** Rīgas Balss newspaper begins publication.\n** Stone Bridge opens.\n* 1958\n** TTT Riga and BK VEF Rīga basketball clubs formed.\n** Daugava Stadium opens.\n* 1964 – Coach Terminal built.\n* 1965 – Population: 657,000.\n* 1969 – October, Lenin, and Leningrad administrative districts established.\n* 1972 – Andrejs Upits' Memorial Museum founded.\n* 1973 – Riga International Airport built.\n* 1977 – Island Bridge built.\n* 1979 – Population: 840,000.\n* 1981 – Gorky Bridge opens.\n* 1984\n** Alfreds Rubiks becomes mayor.\n** Zolitūde construction begins.\n* 1985\n** Monument to the Liberators of Soviet Latvia and Riga from the German Fascist Invaders erected.\n** Krisjanis Barons Memorial Museum established.\n** Population: 883,000.\n* 1986 – Riga Radio and TV Tower built.\n* 1987\n** 14 June: Demonstrators commemorate 1941 deportations.\n** Latvian Museum of Pharmacy founded.\n* 1988 – Riga Film Museum established.\n* 1989\n** Arsenals – Fine Arts Museum active\n** Latvian Museum of Decorative Arts and Design opens.\n** Riga Motor Museum founded.\n* 1990\n** 4 May: Restoration of Latvian independence\n** Diena newspaper begins publication.\n** Latvian Academy of Culture established.\n** Andris Teikmanis becomes mayor.\n* 1991\n** January: The Barricades.\n** 6 September: USSR recognizes Latvian independence.\n** St. Peter's Church rebuilt.\n** Riga Marathon begins.\n* 1992\n** Banking College founded.\n** New Riga Theatre opens.\n** Latvian Institute of International Affairs headquartered in city.\n* 1993\n** 8 September: Pope John Paul II visits Riga and celebrates mass at St. James's Cathedral and in Mežaparks.\n** Museum of the Occupation of Latvia and Latvian Museum of Photography inaugurated.\n** School of Business Administration Turiba founded.\n** Rīgas Laiks magazine and Vakara Ziņas newspaper begin publication.\n* 1994\n** Maris Purgailis becomes mayor.\n** Latvian Museum of Architecture and Latvian Railway History Museum established.\n** Stockholm School of Economics in Riga campus established.\n* 1995 – Latvian National Opera house renovated.\n* 1996 – Skonto Arena opens.\n* 1997 – Andris Berzins becomes mayor.\n* 1998 – Riga Graduate School of Law established.\n* 1999\n** Riga Aviation University founded.\n** City hosts 1999 European Athletics Junior Championships.\n** House of the Blackheads rebuilt.\n* 2000\n** Andris Argalis becomes mayor.\n** BK Barons Kvartāls basketball club and Baltic Institute of Social Sciences established.\n** Skonto Stadium opens.\n** International Charter on Authenticity and Historical Reconstruction in Relationship to Cultural Heritage signed in Riga.\n21st century\n* 2001\n** Gundars Bojars becomes mayor.\n** 800th anniversary of founding of Riga.\n** Riga Porcelain Museum and Kino Citadele open.\n** Bikernieki Memorial unveiled.\n* 2002 – Providus Centre for Public Policy established.\n* 2003\n** Rigas Satiksme founded.\n** City hosts Eurovision Song Contest 2003.\n** Population: 739,232.\n* 2004\n** 1 May: Latvia joins the European Union.\n**  (hi-rise) built.\n* 2005\n** 2 February: .\n** 12 March:  held.\n** Aivars Aksenoks becomes mayor.\n** Latvian National Museum of Art and JFK Olimps football club established.\n** Riga Salsa Festival begins.\n* 2006\n** Riga Planning Region and FK Jauniba Riga football club established.\n** City hosts NATO summit.\n** Arena Riga opens.\n** City hosts 2006 IIHF World Championship.\n* 2007 – Janis Birks becomes mayor.\n* 2008 – Southern Bridge opens.\n* 2009\n** 13 January: Riot.\n** Nils Usakovs becomes mayor.\n** Pushkin Statue erected.\n* 2010\n** Body of European Regulators of Electronic Communications headquartered in Riga.\n** Population: 703,260.\n* 2013\n** 20 June: Riga Castle fire.\n** 21 November: Supermarket roof collapse.\n* 2014 – National Library of Latvia new building constructed.\n* 2015 – Zunda Towers built.\n* 2021 – Hostel fire.\n* 2022 – Monument to the Liberators of Soviet Latvia and Riga from the German Fascist Invaders demolished.\nSee also\n* History of Riga\n* Mayors of Riga\nReferences\nThis article incorporates information from the Latvian Wikipedia, Polish Wikipedia, and Russian Wikipedia.\nBibliography\n;Published in 17th-19th centuries\n*  circa 1652/1680\n*\n*  [http://www.worldcat.org/wcidentities/lccn-n88-40182]\n*\n*\n*\n*\n*\n*\n*\n}}\n*\n|hdl = 2027/wu.89097349427 |author-link = George Henry Townsend }}\n*\n*\n;Published in 20th century\n*  |short= 1}}\n*\n}}\n*\n*\n*\n|doi= 10.2307/128811 }}\n*  [https://openlibrary.org/publishers/Galvenā_enciklopēdiju_redakcija]\n* Grava, Sigurd. \"The Urban Heritage of the Soviet Regime The Case of Riga, Latvia.\" Journal of the American Planning Association 59.1 (1993): 9-30.\n*\n;Published in 21st century\n* Šolks, Guntis, Gita Dejus, and Krists Legzdiņš. \"Transformation of Historic Industrial Areas in Riga.\" Book of Proceedings. (2012) [http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.661.4434&rep=rep1&type=pdf#page=214 online].\nExternal links\n*\n* [http://digitalgallery.nypl.org/nypldigital/id?1640729 Map of Ryga region], ca.1700s\n* Europeana. [https://www.europeana.eu/portal/search.html?query=riga+latvia&rows=96 Items related to Riga], various dates."
    }
  ]
}