{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Yorkshire Television\n\nThis is a timeline of the history of the British broadcaster Yorkshire Television (now known as ITV Yorkshire). It has provided the ITV service for Yorkshire since 1968.\n1950s\n* 1956\n** late Autumn – ITV begins broadcasting across Yorkshire although it is part of a wider North of England region with Granada Television providing weekday programmes and ABC Weekend TV broadcasting at the weekends.\n1960s\n* 1967\n** 28 February – National and regional newspapers carried advertisements from the Independent Television Authority, requesting applicants for various new ITV contracts, one of which was Programme Contractor for Yorkshire Area (Contract D) – All Week. Ten formal bids were received by the closing date.\n**13 June – Telefusion Yorkshire Limited, created by the Blackpool-based TV rental chain Telefusion and led by Grampian TV Managing Director G E Ward Thomas, is selected as the winning bid. It was chosen on the condition that it 'merged' with another applicant Yorkshire Independent Television. The latter, backed by a consortium of Yorkshire Post Newspapers Ltd, other local newspaper groups such as the Huddersfield Examiner and the Scarborough Evening News, several Yorkshire-based Co-operative societies, trade unions and local universities, was deemed by the Authority to have the better talent but suffered a lack of funding, whereas Telefusion had the backing of a cash-rich parent. The new venture initially chose the name Yorkshire Television Network but decided to drop the word 'Network' before going on air.\n* 1968\n** 29 July – Yorkshire Television launches.\n** 2 August – A technicians strike forces ITV off the air for several weeks although management manage to launch a temporary ITV Emergency National Service with no regional variations.\n* 1969\n** 19 March – The transmitter mast at Emley Moor collapses, leaving  the major part of the region uncovered by Yorkshire Television. A temporary mast is quickly erected and television broadcasting resumed, albeit with reduced coverage.\n** 7 June – Yorkshire begins talks with Anglia Television about a cost-cutting exercise by sharing equipment and facilities. Neither company planned joint productions or a merger. The reason to form an association was purely down to the costs of the increased levy on the companies' advertising revenue by the government and the cost of colour TV. The ITA stated there was no reason why the companies should not have talks about sensible economies that could be made, but would examine all details before any association were to be implemented.\n** 15 November – Yorkshire Television begins broadcasting in colour.\n1970s\n* 1970\n** 1 January –  A warning is given that regionalism would be abandoned and that Yorkshire's forced merger with Anglia Television would happen unless the chancellor reduced the levy applied on advertising revenues which the government agreed to a few months later.\n**21 August – Yorkshire and Tyne Tees Television announce plans to merge when the two are brought under the control of a new holding company, Trident Television Limited, to deal with the problem of fairly allocating commercial airtime from a television transmitter at Bilsdale in North Yorkshire which straddled the catchment areas of two Independent Television (ITV) companies. The new holding company would sell airtime in both television regions with each company retaining its own separate identity and management control.\n* 1971\n** 21 January – The new mast at Emley Moor begins transmitting, initially in 625-lines. The 405-lines service starts three months later.\n* 1972\n** 16 October – Following a law change which removed all restrictions on broadcasting hours, Yorkshire launches an afternoon service. As part of the new service, the first episode of their new soap opera Emmerdale Farm is broadcast.\n* 1973\n** No events.\n* 1974\n** 30 July – The 1974 franchise round sees the Belmont transmitter in Lincolnshire switched from Anglia Television to Yorkshire Television.\n** A reverse takeover of both Tyne Tees and Yorkshire is performed by Trident but plans to rename the stations 'Trident Yorkshire' and 'Trident Tyne-Tees' were vetoed by the Independent Broadcasting Authority.\n* 1975\n** No events.\n* 1976\n** No events.\n* 1977\n** 28 March – Yorkshire begins a nine-week trial of breakfast television, six years before the launch of TV-am. The experiment ends on 27 May.\n* 1978\n**December – A strike forces Yorkshire Television off the air throughout the entire Christmas period. Many of ITV's Christmas programmes were eventually shown in early 1979, after the dispute had ended.\n* 1979\n** 10 August – The ten week ITV strike forces Yorkshire Television off the air once again. The strike ends on 24 October.\n1980s\n* 1980\n** 28 December – The Independent Broadcasting Authority announces the new contractors to commence on 1 January 1982 and Yorkshire Television is reawarded its licence on the condition that it demerges with Tyne Tees Television.\n* 1981\n** No events.\n* 1982\n**1 January – Yorkshire extends its coverage on the Lancashire/Yorkshire border when transmitters covering Todmorden and Walsden are transferred from the Granada region.\n**2 November – Yorkshire Television produces the first ever programme to air on Channel 4, the gameshow Countdown which remains on the air to this day, although it has been produced in north-west England since 2009.\n* 1983\n** 1 February – ITV's breakfast television service TV-am launches. Consequently, Yorkshire Television's broadcast day now begins at 9:25am.\n* 1984\n** No events.\n* 1985\n** 3 January – Yorkshire's last day of transmission using the 405-lines system.\n* 1986\n** 9 August – Yorkshire becomes the first ITV company to provide 24-hour broadcasting. It fills the overnight hours by simulcasting the satellite station Music Box.\n* 1987\n** 3 January – Closedowns reappear on Yorkshire Television when its experiment with 24-hour television is put on hiatus.\n** 5 January – Yorkshire launches its “Liquid Gold” ident.\n** 13 January – Yorkshire becomes the second ITV region to launch a Jobfinder service, broadcasting for an hour after closedown.\n** 23 April – Yorkshire extends broadcasting into the early hours on Thursday, Friday and Saturday nights by introducing a Through Till Three strand.\n** 7 September – Following the transfer of ITV Schools to Channel 4, ITV provides a full morning programme schedule, with advertising, for the first time. The new service sees the launch of regular five-minute national and regional news bulletins.\n* 1988\n** 30 May – Yorkshire recommences 24-hour broadcasting.\n** June – For the first time, regional news bulletins are broadcast at the weekend.\n* 1989\n** Yorkshire becomes the first region outside of London to begin broadcasting programmes in stereo when stereo transmissions commence form the Emley Moor transmitter.\n** 1 September – ITV introduces its first official logo as part of an attempt to unify the network under one image whilst retaining regional identity. Yorkshire replaces its \"Liquid Gold\" ident with the generic ITV look.\n1990s\n* 1990\n**Yorkshire Television buys a 19&nbsp;percent stake in Tyne Tees.\n**24 September – Yorkshire launches a third sub-regional opt-out for South Yorkshire and north Derbyshire.\n* 1991\n** 16 October – The Independent Television Commission announces the results of the franchise round. Yorkshire Television is reawarded its licence having bid £37.7 million to see off two rival bidders, Viking Television and White Rose Television.\n* 1992\n** June – Yorkshire Television and Tyne Tees Television merge and create a new company Yorkshire-Tyne Tees Television. This is the beginning a process that would see the consolidation of ITV over the next decade.\n** 5 October – Following the merger, Yorkshire simulcasts its overnight service on Tyne Tees and relaunches it as Nightshift.\n* 1993\n** 1 January – Following their merger, Yorkshire and Tyne Tees start to broadcast all regional programmes simultaneously, affecting programming that had been shown at different paces in different regions. Most of the regional programming was produced by Yorkshire and broadcast across the two stations, an area that the ITC considered too broad to be of local interest.\n* 1994\n** 22 October – Yorkshire refreshes its idents and abandons the 1989 generic ITV look.\n* 1995\n** No events.\n* 1996\n** No events.\n* 1997\n** 26 June – Yorkshire-Tyne Tees Television is acquired by Granada Media Group.\n* 1998\n** 15 November – The public launch of digital terrestrial TV in the UK takes place.\n* 1999\n** 8 November – A new, hearts-based on-air look is introduced.\n2000s\n* 2000\n** No events.\n* 2001\n** 11 August – ITV's main channel is rebranded as ITV1.\n* 2002\n** 28 October – On-air regional identities are dropped apart from when introducing regional programmes and Yorkshire is renamed ITV1 Yorkshire.\n* 2003\n** No events.\n* 2004\n** 2 February – The final two remaining English ITV companies, Carlton and Granada, merge to create a single England and Wales ITV company called ITV plc.\n** 31 October – The famous chevron logo is seen by viewers for the final time.\n*2005\n** No events.\n* 2006\n** 13 November – The ITV1 Yorkshire branding, still seen before some regional programming, is dropped.\n* 2007\n** 8 January – The Calendar East and Calendar South regions are merged to form a new Calendar South region covering central and east Lincolnshire, east Yorkshire, east Nottinghamshire and north Norfolk. The Calendar North region, broadcasting from the Emley Moor transmitter, continues as before.\n* 2008\n** December – All non-news local programming ends after Ofcom gives ITV permission to drastically cut back its regional programming. From 2009, the only regional programme is the monthly political discussion show.\n* 2009\n** 16 February – ITV makes major cutbacks to its regional broadcasts in England. Yorkshire's separate sub-regional news programmes are merged into a pan-regional programme although more localised news continues to be broadcast as a brief opt-out during the early evening programme.\n** 4 March – ITV plc announces that The Leeds Studios will be largely closed in an effort to save costs. However, seven months later, ITV changed its mind, choosing instead to close the nearby studios dedicated to the production of Emmerdale and transferring production to Kirkstall Road which would be upgraded for HDTV production.\n2010s\n* 2010\n** No events.\n* 2011\n** 21 September – The Yorkshire region completes its digital switchover.\n* 2012\n** No events.\n* 2013\n** 16 September – Sub-regional news coverage is reintroduced and the weekday daytime, late evening and weekend bulletins as well as 20 minutes of the 6pm programme are once again more localised.\nSee also\n* History of ITV\n* History of ITV television idents\n* Timeline of ITV\n* Timeline of Granada Television – YTV's weekday predecessor\n* Timeline of ABC Weekend TV – YTV's weekend predecessor\nReferences\nBibliography\n*"
    }
  ]
}