{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Gaza war (27 September 2024 – 16 October 2024)\n\nSeptember 2024\n27 September\n* Al Jazeera reported that at least 25 people were killed in Israeli strikes in Lebanon.\n*Al Jazeera reported that an Israeli strike hit a house in Jabalia refugee camp and killed two disabled Palestinian children and their parents.\n*An Israeli air strike in Tyre reportedly killed two Lebanese women. The IDF said that it targeted Hezbollah rocket launchers and infrastructure.\n*Al Jazeera reported that Israeli forces bombed tents housing displaced people in the courtyard of Al-Aqsa Martyrs Hospital, killing one person and injuring seven people.\n*Hezbollah fired rockets targeting Tiberias reportedly in response to Israeli attacks on Lebanon, injuring one person.\n*Al Jazeera reported that Israeli forces struck the Lebanon-Syria border, killing five Syrian soldiers and injuring another.\n*The Houthis launched a drone towards Ashkelon.\n*The Islamic Resistance in Iraq said that it launched three drone strikes targeting a \"vital target in the occupied territories\" and other two strikes on targets in the Golan Heights.\n* An Israeli airstrike in Shebaa reportedly killed nine members of a family, including four children and a pregnant woman.\n* The IDF mobilized the 6th Brigade and the 228th Brigade to the northern border.\n* Hezbollah said that it targeted Ilaniya and Kiryat Ata using Fadi-1 missiles.\n* The IDF said that it struck Hezbollah's central headquarters in Beirut targeting Hezbollah leader Hassan Nasrallah. Al-Manar reported that four buildings collapsed in the attack. Six people including the target reportedly died and at least 100 were injured.\n* Hezbollah fired 65 rockets at Safed caused damage in and lightly injuring a woman.\n* The IDF struck three buildings that it said stored Hezbollah anti-ship missiles in Dahieh. Hezbollah denied that weapons were present in the buildings.\n* The IDF said it have killed Ahmad Muhammad Fahd, the head of Hamas in southern Syria.\n28 September\n* The Gaza Health Ministry reported that at least 52 Palestinians were killed in Israeli attacks in the past 48 hours, increasing its count of the Palestinian death toll in Gaza to 41,586.\n* The IDF said it have killed Muhammad Ali Ismail, the commander of Hezbollah's rocket unit in southern Lebanon, his deputy, and other commanders and militants in an airstrike, Hezbollah has yet to confirm the claims.\n* Ten rockets were launched from Lebanon towards Israel's Upper Galilee.\n* A surface-to-surface missile was launched from Lebanon to central Israel.\n* Hezbollah said that it targeted Ramat David Airbase with Fadi-3 missiles and Kabri with Fadi-1 missiles.\n* The Lebanese National News Agency (NNA) reported that IDF strikes struck civil defense centres and a medical clinic in Taybeh and Deir Siriane, killing 11 medical staff and injuring 10 others.\n* Lebanese Civil Defense said that one of its staff was killed and another staff member was seriously injured in southern Beirut.\n* Hezbollah said that its artillery targeted a group of soldiers at the \"al-Sadah\" IDF site, while its rockets targeted Sa'ar and Rosh Pinna.\n* The IDF said that it struck hundreds of Hezbollah targets. The Lebanese Health Ministry announced that 33 people were killed and 195 others were injured in the attacks.\n* Five strikes were launched by Hezbollah to northern Israel.\n* A missile was fired from Yemen towards central Israel. The Houthis said that it launched a \"Palestine 2 ballistic missile\" targeting Ben Gurion Airport.\n* The Royal Jordanian Army stated that a Grad rocket from Lebanon landed on an uninhabited open area in Al-Muwaqqar.\n* The IDF announced that Hezbollah fired around 90 missiles at northern Israel, Tel Aviv and the West Bank throughout the day.\n* The IDF carried out a targeted strike in Dahieh against Hassan Khalil Yassin, the commander of Hezbollah's intelligence division and a senior member of the group's aerial weapons unit.\n* A Hezbollah missile landed near the Israeli outpost of Mitzpe Hagit, near Jerusalem, causing a fire and power outages in nearby communities.\n* Two drones were launched from southern Lebanon to Israel's western Galilee.\n29 September\n* The Gaza Health Ministry reported that at least nine Palestinians were killed in Israeli attacks in the past 24 hours, increasing its count of the Palestinian death toll in Gaza to 41,595.\n* The IDF said that it struck more than 120 Hezbollah targets. The Lebanese Health Ministry announced that 105 people were killed and 359 others were injured in the attacks.\n* The Islamic Resistance in Iraq said that it launched drones towards Eilat.\n* The NNA reported that Israeli warplanes hit a civil defense center killing four people and injuring several others.\n* Lebanese media reported that an Israeli air strike hit a home in Dahr-al-Ain killed at least 11 people.\n* The Lebanese Scouting Federation said that four of its members were killed in Tayr Debba and another member was killed in Kabrikha.\n* The IDF said that eight rockets were launched by Hezbollah towards Tiberias. Hezbollah said that it launched Fadi 1 missiles targeting Ofek IDF base in northern Israel.\n* The Hezbollah and IDF confirmed the death of the Hezbollah Central Council deputy head Nabil Qaouk.\n* Wafa reported that a Palestinian civilian was killed and many others were injured in an Israeli strike in Beit Lahia.\n* The NNA reported that at least 17 members of a family were killed and several others were trapped under rubble in an Israeli air strike in Zboud.\n* An Israeli strike hit Umm al-Fahm School sheltering displaced people in western Beit Lahia killed at least four Palestinians and injured 15 others. The IDF said that it struck Hamas members operating from the school which it said was used to plan and carry out attacks targeting Israeli soldiers and Israel.\n* Hezbollah said that it targeted soldiers in Manara and its rockets targeted Sa'ar.\n* Airstrikes struck fuel tanks and other targets in Hudaydah Port and Ras Issa Port, killing at least six people and injuring 57 others. The IDF said that its dozens of IAF aircraft struck places including power plants and a seaport used by Houthis to transfer Iranian weapons to territory controlled by it in Yemen. Houthi-linked media outlets claimed that Houthis emptied the facilities used to store fuel prior to the attack.\n* Hezbollah said that its rockets targeted Safed and another \"smaller location\" in northern Israel.\n* An Israeli strike in Ain El Delb killed 45 people and injured at least 75 others.\n* Al Jazeera reported that a second French national was killed in Lebanon.\n* A projectile was launched from Lebanon towards northern Israel.\n* Al Jazeera reported that an Israeli strike in Bekaa killed 12 people and injured 20 others.\n30 September\n* The Gaza Health Ministry reported that at least 20 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,615.\n* The Lebanese Health Ministry announced that at least 95 people were killed and 172 others were injured in Israeli attacks.\n* An Israeli airstrike on an apartment in Beirut's Kola district killed three members of the Popular Front for the Liberation of Palestine (PFLP), including the commanders of its military and security divisions in Lebanon.\n* Al Jazeera Arabic reported that an Israeli drone strike on a civilian car in the vicinity of Hamad City killed two people.\n* An Israeli strike on Abu Jaafar School housing displaced people in al-Sultan neighbourhood of Beit Lahia killed at least two Palestinians and injured others. The IDF claimed that it struck a Hamas command and control room inside the building.\n* An Israeli strike on a house in the Hakr al-Jami area of Deir al-Balah killed at least four Palestinians including a woman and her child.\n* Hamas said that its leader in Lebanon and concurrent member of its overseas leadership Fateh Sherif Abu el-Amin and his wife, daughter and son was killed in an Israeli strike at his house in Al-Bass camp in southern Lebanon.\n* An Israeli strike in Tyre killed a Lebanese Army soldier and five of his relatives and trapped others under the rubble. Other relatives said that those killed were mostly women and children.\n* The IDF launched raids in al-Abbassieh, Harouf and Bedias in Southern Lebanon.\n* Palestinian journalist Wafa Al-Udaini and three members of her family including her two children were killed in an Israeli airstrike on her house in Deir el-Balah.\n* A Lebanese Army soldier was killed by an Israeli airstrike in Wazzani.\n* Six paramedics were killed and four were injured in an Israeli strike on a civil defence centre in Sahmar.\n* Israeli soldiers razed 20 dunams of Palestinian lands in Barta'a, northwest of Jenin.\n* An Israeli strike on a home in the Jabalia refugee camp killed a Palestinian and injured 11 people including eight children. Two people were reported missing.\n* Hezbollah fired 35 rockets into northern Israel and the Golan Heights. Hezbollah said that it targeted Safed and Gesher HaZiv using rockets.\n* One person was killed by an Israeli drone strike in Khiam near the Lebanese border.\n* Israeli forces bombed two houses on the Nuseirat camp, killing at least 13 people including women and children and injuring dozens of people.\n* The IDF declared the areas of Metula, Misgav Am, and Kfar Giladi closed military zones, prohibiting entry to civilians.\n* The IAF conducted at least six airstrikes in Dahieh after issuing evacuation orders for residents of several buildings in the suburb, with planes also dropping thermal flares in the area.\n* The Lebanese Armed Forces abandoned positions close to the border, withdrawing more than 5km away from the border with Israel.\n* Multiple sources described an \"imminent\" ground invasion of Lebanon, with tanks massing on the border, heavy shelling of border villagers and Defence Minister Yoav Gallant telling troops that Israel would use \"all the means that may be required ... from the air, from the sea and on land. Good luck\".\n* Hezbollah said that it targeted IDF positions in the Golan Heights with rockets. Hezbollah also said that it targeted Kfar Giladi with a long-range anti-ship cruise missile, a northern Israel settlement with rockets, areas in northern Haifa with Fadi 1 missiles. The IDF said that 10 rockets were launched from Lebanon towards northern Israel. Hezbollah also claimed to have struck movements of Israeli troops in orchards opposite Odaisseh and Kafr Kila.\n*At least three people including a journalist were killed and nine people were injured in a suspected Israeli strike in the Mezzeh neighbourhood of Damascus. An Iranian Islamic Revolutionary Guards Corps (IRGC) consultant later died from injuries sustained in the strike. Syrian state media reported that Syrian air defenses intercepted \"hostile targets\" following a blast.\n*Israeli jets bombed and destroyed the headquarters of the pro-Hezbollah As-Sirat TV channel in southern Beirut, there were no reported injuries.\nOctober 2024\n1 October\n* The Gaza Health Ministry reported that at least 23 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,638.\n* The Lebanese Health Ministry announced that at least 55 people were killed and 156 others were injured in Israeli attacks.\n* The IDF confirmed that it was conducting a \"limited, localized\" ground operation in southern Lebanon.\n* The IDF said about 10 rockets had been launched from southern Lebanon towards Israel.\n* A drone was launched towards central Israel.\n* An Israeli strike on the Shujayea Boys, which was School sheltering displaced people in the Tuffah neighbourhood, killed at least six Palestinians and injured several others.\n* Hezbollah said it had targeted IDF sites, Israeli soldiers and settlements with 12 separate strikes.\n* An Israeli strike on the house of Munir al-Maqdah, a brigadier general of the Al-Aqsa Martyrs' Brigades in Lebanon, residing in the Ein al-Hilweh refugee camp killed at least five people, injured several others and trapped several people under the rubble. al-Maqdah reportedly survived the assassination attempt but his son was killed in the strike.\n* Three rockets were launched from Lebanon towards the Upper Galilee.\n* An Israeli strike on a house in Al-Dawoudiya killed at least 10 people and injured five others.\n* Hezbollah claimed an artillery strike on Israeli troops in Metula.\n* Israeli forces stormed Palestinian settlements in the West Bank and arrested ten people in al-Khader, south of Bethlehem; four men in Beit Ummar, north of Hebron and a man in Idna, west of Hebron. The Dheisheh refugee camp, Beit Jala, Artas and Baqat al-Hatab were also stormed.\n* Israeli forces shot an injured a man during clashes in Nablus. Israeli forces later arrested a PRCS ambulance crew member and another person when they tried to treat the man. A third person was also arrested during raids in Rafidiya, al-Makhfiyya and al-Ein refugee camp in western Nablus.\n* The Al-Qassam Brigades claimed to have killed or injured members of an Israeli engineering unit after detonating mines in Al-Fukhari, east of Khan Yunis.\n* The Houthis claimed that their \"unmanned air force\" had attacked an IDF target in Jaffa and four of its drones had struck IDF targets in Eilat.\n* The Palestine Red Crescent Society said three of its emergency medical technicians were \"deliberately targeted\" and injured by Israeli soldiers while trying to evacuate casualties from the Balata refugee camp. It added that they were attacked despite prior coordination with the IDF through the International Committee of the Red Cross.\n* \"A number of\" rockets were launched from Lebanon towards Israel, moderately injuring two people. Hezbollah said it had targeted the Unit 8200 headquarters in Tel Aviv with Fadi-4 rockets and the Mossad headquarters in the suburbs of Tel Aviv.\n* The IDF said heavy fighting was taking place in southern Lebanon with Hezbollah. It also warned residents not to move in vehicles from the north of the Litani River to the south of the river. The IDF also said that projectiles were launched towards Avivim and Metula.\n* The IDF issued an urgent warning for residents of 25 villages in southern Lebanon to evacuate to the north of the Awali River.\n* Hezbollah denied that Israeli soldiers had entered into Lebanon.\n* Approximately 30 rockets were launched from Lebanon towards northern Israel.\n* The IDF said it had conducted over 70 ground raids in southern Lebanon since November 2023, destroying thousands of targets and gathering intelligence on Hezbollah positions.\n* Syrian military sources said Israel had struck two Syrian anti-aircraft radar stations to the west of Sweida and a Syrian anti-aircraft radar station in the Daraa Governorate.\n* The IDF conducted at least two airstrikes in Dahieh.\n* The Al-Qassam Brigades said it had targeted a Merkava tank and two D9 military bulldozers using Al-Yassin 105 rockets in Al-Fukhari. It also claimed to have struck Israeli forces in the Netzarim Corridor using Rajum rockets and heavy mortar shells.\n* The IDF claimed that Muhammad Jaafar Qasir, a Hezbollah commander responsible for transferring Iranian weapons to Hezbollah in Lebanon, was killed in an airstrike in Beirut.\n* The IRGC launched approximately 200 ballistic missiles toward Israel, with at least one building being hit in Tel Aviv. The attack was in response to the assassinations of Abbas Nilforoushan, Hassan Nasrallah and Ismail Haniyeh. At least two Israelis were slightly injured in Tel Aviv and a Palestinian was killed by shrapnel in Nu'eima in the West Bank. Iran said 90% of its missiles had hit their targets, but the Israeli military disputed this claim, saying that \"a large number\" of missiles were intercepted. A number of impact sites were identified in the wake of the strikes, but the exact location of those impacts and the extent of the damage they caused is barred from publication by the IDF censor.\n* A gun attack killed seven Israelis in Jaffa. Police said that the attackers were \"neutralised\".\n* The IDF opened fire at dozens of Palestinians approaching the Netzarim Corridor, killing at least three.\n* Hezbollah said it had targeted with missiles the Sde Dov airbase, located in the outskirts of Tel Aviv, that was closed and demolished more than four years before the attack.\n* The IDF said it had killed the commander of Hezbollah's Imam Husayn division in an airstrike in Beirut.\n* The IAF struck 100 Hezbollah targets in Lebanon while soldiers of the Northern Command destroyed several military sites and weapons.\n* Israeli forces destroyed many residential buildings in southern Khan Yunis during their limited ground incursion, killing at least 12 members of a Palestinian family. Palestinian Civil Defence members were not allowed to search for survivors for 5 hours.\n* An Israeli strike on a tent inside an evacuation center in western Khan Yunis killed five members of a Palestinian family including children.\n2 October\n* The Gaza Health Ministry reported that at least 51 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,689.\n* The Lebanese Health Ministry announced that at least 46 people were killed and 85 others were injured in Israeli attacks.\n* An Israeli strike on the al-Amal Institute for Orphans orphanage in western Gaza City, which was housing displaced people, killed at least eight Palestinians. Another Israeli strike on the Muscat school, also being used by displaced people as a shelter, killed at least nine Palestinians and injured 17 others.\n* An Israeli strike on the family house of journalist Ahmed al-Zard in southeastern Khan Yunis killed his brother, uncle and two cousins and trapped others under the rubble. Al-Zard was seriously wounded and his mother and another brother was also injured. Wafa reported that the IDF initially prevented ambulance crews from reaching the injured by firing at them.\n* The IDF also said it had targeted a Hamas command and control complex inside the Brig High School in central Gaza.\n* Israeli forces were ambushed by Hezbollah fighters in Odaisseh and forced to retreat while attempting to dismantle militant infrastructure. Six soldiers from the Egoz Unit were killed and several others were injured, including five seriously. The IDF said that another 20 Hezbollah militants were killed during the clash.\n* Two soldiers of the Golani Brigade were killed and another was injured in combat in southern Lebanon. A medic from the brigade was injured in a separate incident.\n* The bodies of over 30 Palestinians including women and children and several other injured people were found following the withdrawal of Israeli forces after several hours of ground assault in Khan Yunis.\n* The Houthis said they had targeted three IDF posts deep inside Israel using three Quds-5 cruise missiles. The Houthis claimed to have successfully hit their targets.\n* Israeli aircraft struck the southern suburbs of Beirut.\n* Hezbollah fired over 240 rockets at northern Israel, resulting in one person being injured by glass shards in the Western Galilee. Hezbollah said it had targeted areas north of Haifa using missiles. Hezbollah also targeted Shtula and Israeli infantry in Misgav Am.\n* Hezbollah claimed to have inflicted casualties on IsraeIi soldiers entering Maroun al-Ras from its eastern side.\n* The Lebanese army said an Israeli force had crossed the Blue Line and withdrawn after a short time.\n* The IDF announced that the IAF had struck 150 Hezbollah sites since the ground offensive began.\n* A Lebanese army soldier was injured in an Israeli drone strike while one of its units was working to open a road at the entrance of Kawkaba.\n* Israeli foreign minister Israel Katz declared United Nations Secretary-General Antonio Guterres persona non grata in Israel for not condemning the October 2024 Iranian strikes against Israel in a statement on the Middle East conflict.\n* Hezbollah claimed to have killed or injured Israeli soldiers trying to circumvent Yaroun by detonating an explosive device.\n* Hezbollah fired 40 rockets at Safed and several drones at the Upper Galilee.\n* The IDF announced the death of eight soldiers during combat in southern Lebanon.\n* The US imposed sanctions against the Israeli settler group Hilltop Youth and two other Israelis for attacks on Palestinians in the West Bank.\n* Hezbollah said that it destroyed three Merkava tanks using guided rockets in Maroun al-Ras.\n* Syrian state media reported that at least three people were killed and three injured in an Israeli drone strike in Damascus. The strike killed the brother of the commander of Hezbollah's Unit 4400, who was also killed the day prior.\n* Hezbollah claimed to have killed or injured all members of an Israeli infantry unit sheltering in a home outside Kafr Kila by detonating an explosive device in the house and targeting it using bullets and rocket-propelled grenades.\n* Hezbollah said that it targeted Israeli soldiers in Ya'ara with rockets.\n* An Israeli airstrike on a Hezbollah-affiliated health facility in central Beirut killed six people and injured 11 others.\n* An Israeli air strike destroyed three houses in the Bekaa Valley killing 11 people including four children.\n* An Israeli missile strike on Nuseirat Girls School in Nuseirat refugee camp killed 3 Palestinians and injured 15 others. The IDF said that Hamas militant's command center hidden at the \"Nuseirat Girls' School\" in Gaza was hit in an IAF strike.\n* The commander of Hezbollah's Shebaa Farms division was killed by an Israeli airstrike. The IDF said that he was responsible for the Majdal Shams attack.\n3 October\n* The Gaza Health Ministry reported that at least 99 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,788.\n* The Lebanese Health Ministry announced that at least 37 people were killed and 151 others were injured in Israeli attacks.\n* Approximately 200 rockets and several drones were launched from Lebanon towards Israel.\n* Two drones targeted Bat Yam in central Israel, one of which was shot down while the other hit an open area.\n* A US citizen was killed in an Israeli airstrike in Lebanon.\n* Hezbollah said that it launched surface-to-air missiles targeting an IDF helicopter flying above Beit Hillel and claimed that it forced it to retreat.\n* Houthis claimed that it struck a target in Tel Aviv using a drone.\n* Approximately 25 rockets and two drones were launched from Lebanon towards Israel.\n* One person was killed and another one injured during an Israeli raid in the Nuseirat camp.\n* An Israeli strike on the municipality building in Bint Jbeil killed 15 people. The IDF said that Hezbollah fighters were killed and the building was used by Hezbollah to store weapons.\n* An Israeli airstrike on an apartment in the Bashoura district of Beirut killed at least seven Hezbollah-affiliated health and rescue workers. The NNA claimed that the IDF used phosphorus bombs without providing evidence.\n* A Lebanese soldier was killed and another soldier was injured in an Israeli strike in Taybeh while they were working on a rescue and evacuation mission with the Lebanese Red Cross.\n* Two Belgian journalists were wounded in Beirut.\n* Hezbollah launched more than a dozen of strikes on Israeli targets.\n* Hezbollah claimed to have killed or wounded a group of Israeli soldiers in the vicinity of Maroun al-Ras by detonating two explosive devices.\n* The IDF announced that senior Hamas official Rawhi Mushtaha was killed alongside two other Hamas officials in an Israeli airstrike several months ago.\n* The Lebanese Army said that one of its soldiers was killed in an Israeli strike on a military outpost in Bint Jbeil. It also said that its soldiers responded to the sources of fire.\n* Three people were killed after Israeli forces shelled central Khan Yunis.\n* The IAF struck Hezbollah intelligence and communications sites in Beirut.\n* Hezbollah fired ten rockets at the Lower Galilee, causing no casualties.\n* The World Health Organization said that 28 health care workers were killed in Lebanon over the past 24 hours.\n* Lebanese Health Minister Firass Abiad said that 40 paramedics and firefighters including emergency personnel from organisations affiliated with Hezbollah were killed in Lebanon in three days.\n* Hezbollah claimed that it detonated a Sejil bomb at Israeli forces in Yaroun, causing casualties. It also claimed to have launched a missile against a Merkava tank in Netu'a, while a rocket salvo targeted Israeli troops in Al-Thaghra in the outskirts of Odaisseh.\n* An Israeli drone fired a missile at a group of Palestinians collecting firewood in Beit Lahia, killing four people.\n* The Islamic Resistance in Iraq said that it launched a strike towards southern Israel.\n* Hezbollah fired 100 Katyusha rockets, six Falaq rockets and mortars at Metula. Hezbollah said that it targeted Safed and Kafr Giladi using rockets.\n* An Israeli airstrike on a building in southern Lebanon, around an area where soldiers from the Golani Brigade were operating, killed a Hezbollah field commander.\n* The IDF announced that an officer of the Paratroopers Brigade's 202nd Battalion was killed in combat the day prior, raising the IDF's death toll in Lebanon to nine.\n* A Yazidi woman who was kidnapped by the Islamic State in 2014 and held captive in Gaza since was rescued by Israeli forces during an operation coordinated with the US and other countries and repatriated to Iraq.\n* Hezbollah claimed to have killed 17 Israeli soldiers.\n* The IDF said that it struck 15 Hezbollah sites in Beirut, including weapons depots and manufacturing sites.\n* An Israeli airstrike in Tulkarm Camp killed at least 20 people.\n* An unexploded explosive device left behind by IDF reportedly killed three Palestinian children.\n* Senior Hezbollah official Hashem Safieddine who is expected to succeed Nasrallah as the group's secretary-general following his assassination, was reportedly targeted by an Israeli airstrike in Beirut.\n* The IDF announced that an Israeli airstrike in Beirut earlier in the week killed a senior member of Hezbollah's weapons manufacturing division.\n* The IDF said that the head of Hezbollah's communications division was killed in an airstrike in Beirut.\n* A Palestinian with a knife tried to attack an Israeli base, and was taken down by Israeli soldiers.\n4 October\n* The Lebanese Health Ministry announced that at least 25 people were killed and 127 others were injured in Israeli attacks.\n* The Gaza Health Ministry reported that at least 14 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,802.\n* The IDF halted traffic at the Masnaa Border Crossing between Syria and Lebanon by striking \"vital transportation infrastructure\" using two missiles. The IDF alleged that the border crossing is used by Hezbollah for transferring weapons from Syria to Lebanon one day prior to the strike.\n* Hezbollah said that it targeted Haifa using rockets.\n* UNICEF said that 690 children were injured in Lebanon in six weeks.\n* Hezbollah claimed to have struck Ilania IDF base using rockets.\n*The NNA reported that four health workers were killed in an Israeli drone strike in the vicinity of a government hospital in Marjayoun.\n*The body of a Palestinian child killed in an Israeli strike on a house in the al-Manara neighbourhood in Khan Yunis Governorate two days prior was recovered by Gaza Civil Defense.\n*The IDF reported sirens sound in southern Israel in the vicinity of Gaza Strip for the first time in almost two months.\n*A rocket launched from Lebanon fell in Upper Galilee area causing a forest fire. About 50 instances of rockets or shrapnel falling were reported in Metula in the past 24 hours.\n*Islamic Resistance in Iraq said that it launched three drones on Israeli targets in Golan Heights and Tiberias. The IDF announced the deaths of two Israeli soldiers from the Golani Brigade and injuries for 24 others. Islamic Resistance in Iraq denied responsibility for the attack.\n*Hezbollah launched around 180 rockets towards Israel.\n*The IDF said that over 250 Hezbollah fighters were killed in southern Lebanon since it began its ground offensive, including 21 field commanders.\n*An Israeli strike in northern Gaza killed a 10-year old Palestinian girl and her 11-year old brother. Both of them allegedly survived an Israeli airstrike three months prior.\n*Paramedics recovered bodies of two Palestinian women and a Palestinian infant from the rubble of a home in Khan Yunis.\n*Hezbollah claimed to have struck a group of Israeli soldiers in the vicinity of Maroun al-Ras. Hezbollah said that it launched a missile strike on the Nafah IDF base in the Golan Heights and it also said that it targeted Kfar Giladi.\n*Hezbollah claimed to have inflicted casualties and wounds on Israeli forces trying to advance to Odaisseh by carrying out an \"huge explosion\".\n*The IDF said that it struck Hezbollah weapons warehouses and infrastructure, including its intelligence headquarters in Beirut.\n*The IDF said that it struck a Hamas command and control centre embedded inside a school in central Gaza.\n5 October\n* The Gaza Health Ministry reported that at least 23 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,825.\n* The Lebanese Health Ministry announced that at least 23 people were killed and 93 others were injured in Israeli attacks.\n*Hamas confirmed the death of Saeed Atallah Ali, one of its military officials, along with his wife and two young daughters in an Israeli drone strike in Tripoli's Beddawi refugee camp.\n*Hezbollah said that it launched rockets targeting Israeli soldiers in Khallet Ubair village in Yaroun, as well as on Kafrioufel and Kfar Giladi in northern Israel.\n*Al Jazeera English reported that Israeli warplanes struck a house in the vicinity of Nuseirat refugee camp killing five Palestinian civilians and injuring several others.\n*An Israeli strike on a tent near the Kurd School in Deir al-Balah injured children.\n*Al Jazeera English reported that an Israeli strike on a shelter in Deir el-Balah killed a Palestinian civilian and injured several others.\n*Al Jazeera English reported that Israeli helicopter air strikes and armoured vehicles firing struck civilian positions in Nuseirat.\n*An Israeli strike on a mosque in Bint Jbeil also hit nearby Salah Ghandour Hospital injuring nine of its medical staff. The IDF said that it targeted Hezbollah fighters in a command center embedded inside the mosque without providing evidence.\n*Hezbollah claimed to have inflicted casualties by hitting a Merkava tank advancing in the Maroun forest with a guided anti-armour missile. Hezbollah said that it launched at least seven strikes on Israeli forces including launching Fadi 1 missiles targeting Ramat David IDF base and launching rockets targeting Israeli soldiers in the vicinity of the border.\n*A female Red Cross volunteer from Baalbek died of a head injury sustained in an Israeli airstrike.\n*The IDF detained 25 people, including a child in West Bank in the last 24 hours.\n*The Syrian Air Defence Force claimed to have engaged with a \"hostile threat\" over western Homs after a report on an unconfirmed Israeli drone strike on Abu Kamal, near the Iraq–Syria border.\n*A Hezbollah rocket attack lightly injured three people in Deir al-Asad and caused damage in Karmiel.\n*Al Jazeera English reported that a missile hit in the vicinity of a paramedic team to prevent them from reaching the site of a bigger strike in a Beirut suburb.\n*An Israeli attack in Beit Hanoun killed five people.\n*An Israeli airstrike in the Beqaa Valley killed Mohammed Hussein al-Lawis, who the IDF said was the executive authority of Hamas in Lebanon.\n*The IDF estimated that at least 440 Hezbollah fighters were killed in its ground offensive in Lebanon.\n*An alleged Israeli drone strike on a car near Hama, Syria killed one person and injured three others.\n*The IAF conducted overnight strikes against Hezbollah command centers and other sites in Beirut.\n*Hezbollah fired 60 rockets at the Galilee in two barrages.\n*Hezbollah said that its rockets targeted a \"military industries company\" east of Acre.\n*The IDF struck several Hezbollah targets in Dahieh soon after warning residents in parts of the suburb to evacuate.\n*Hezbollah fired 30 rockets at Kiryat Shmona.\n*Israeli Prime Minister Benjamin Netanyahu claimed to have destroyed a large part of Hezbollah's arsenal and its tunnels in the vicinity of the Israel Lebanon border.\n*Hezbollah said that it launched at least 15 strikes on Israel including its rockets targeting a group of Israeli soldiers in the \"Jal al-Deir site\". Hezbollah also said that its drones targeted the base of IDF's Samson unit in the vicinity of Lake Tabarayya.\n*Walla reported that 110 injured people including soldiers arrived at Ziv Hospital in Safed by quoting hospital officials.\n*French president Emmanuel Macron called for halting weapons deliveries to Israel for its war in Gaza and its war in Lebanon.\n*Hezbollah claimed to have killed at least 25 Israeli soldiers.\n*One person was killed after Israeli forces shelled a home in Bir al-Naajah, northern Gaza.\n*The al-Aqsa Martyrs' Brigades clashed with Israeli forces near Tubas.\n6 October\n* The Gaza Health Ministry reported that at least 45 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,870.\n* The Lebanese Health Ministry announced that at least 22 people were killed and 111 others were injured in Israeli attacks.\n* Al Jazeera reported that an Israeli airstrikes hit Shuhada al-Aqsa mosque housing several displaced people in Deir el-Balah and Ibn Rushd school sheltering displaced people in central Gaza killed at least 26 Palestinians and more than 93 others were injured. The IDF said that it targeted Hamas command and control complexes embedded inside the compounds.\n* The IDF said that it intercepted three UAVs \"launched from the east\".\n* Hezbollah claimed that its attacks on Israeli soldiers trying to infiltrate Khallet Shuaib in Blida forced them to retreat.\n* The IDF issued evacuation orders for a large area of northern Gaza.\n* COGAT announced an expansion of the al-Mawasi humanitarian area.\n* The IDF detained 15 people, including a journalist in West Bank in the last 24 hours.\n* Al Jazeera reported that an Israeli airstrike hit a home in northern Gaza killed 10 Palestinians.\n* The al-Qassam Brigades said that Palestinian fighters are waging intense clashes with Israeli forces in northern Gaza.\n* The IDF ordered residents of 25 villages in southern Lebanon including Hula, Meiss Ej Jabal, and Bilda to evacuate to north of the Awali River.\n* The Al-Quds Brigades said that its fighters \"sniped\" an Israeli soldier on \"Girls Street\" in the east of Beit Hanoun \"in conjunction with Qassam Brigades\". It also said that it targeted a command and control room of Israeli forces penetrating Jabalia refugee camp using thermobaric rockets.\n* The IDF said that its airstrike killed Hezbollah commander Hacher Ali Tawil in Kafr Kila who was responsible for an anti-tank missile attack in Yuval which killed two Israeli civilians in January.\n* The Islamic Resistance in Iraq said that it launched drones targeting three IDF positions in the Golan Heights.\n* Al Jazeera reported that three people were injured in a suspected Israeli missile strike hit three trucks carrying humanitarian aid to Lebanon at an Iranian car factory in an industrial area in Homs.\n* The IDF said that it carried out an airstrike on a group of Hamas fighters in Khalifa Ben Zayed School in northern Gaza. The IDF also said that Hamas was using the compound to plan and carry out attacks targeting Israeli forces and Israel.\n* A gun attack at a McDonald’s in the central bus station of Beersheba killed a female Israel Border Police officer and injured 10 others. The attacker was killed by police.\n* Al Jazeera reported that the Palestinian journalist Hassan Hamad was killed when an Israeli airstrike hit his house in northern Jabalia.\n* The IDF said that it struck 150 Hezbollah targets in the past 24 hours, adding that approximately 25 rockets and multiple drones were launched by Hezbollah.\n* Al Jazeera reported that an Israeli forces strike hit Jabalia refugee camp, killing 17 people including nine children.\n* A soldier from the 8th Armored Brigade died from wounds he sustained during combat in northern Gaza in June, raising the IDF death toll to 349.\n* A number of rockets from Gaza targeting Ashkelon were intercepted or struck open areas.\n* Hezbollah said that it launched drones targeting an IDF base south of Haifa.\n* Gaza Civil Defense said that it recovered three bodies including a Palestinian child from Shati refugee camp and four people went missing.\n* The IDF strictly prohibited entry to Manara, Yiftach and Malkia by declaring them as closed military zones. This is the third closed military zone declared by IDF since the beginning of the Israeli invasion of Lebanon.\n* The Syndicate Of Chemists in Lebanon claimed that IDF used bombs containing depleted uranium in Lebanon.\n* Ten people were injured by shrapnel in Haifa after Israeli air defenses failed to intercept a Hezbollah attack of five rockets targeting the city.\n* Hezbollah fired rockets at:\n** Israeli soldiers in Ma'alot-Tarshiha, Braam and Nimra IDF base, west of Tiberias.\n** Carmel IDF base, south of Haifa using Fadi-1 missiles.\n** Tiberas injured one person and caused damage.\n** northern Israel using Two surface-to-surface missiles.\n** Israeli soldiers in Manara using rockets and missiles.\n** Israeli positions and IDF sites in the vicinity of the border in seven strikes.\n7 October\n* The Gaza Health Ministry reported that at least 39 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,909.\n* Israel struck a complex inside Shuhada al-Aqsa Hospital grounds. Reports said it hit tents sheltering displaced people injuring at least 11 people. The IDF said that its fighters jets struck Hamas operatives running a command and control complex in the hospital without providing evidence.\n* Wafa reported clashes between Palestinian militant groups and Israeli forces in the vicinity of Jalazone.\n* Wafa reported that an elderly man died in Dura Hospital due to injuries sustained from severe beating by Israeli soldiers at his house in Dura.\n* At 06:29, a moment of silence commemorated the victims of the 7 October attacks and war casualties in Israel. The Israeli flag was lowered to half-mast.\n* The IDF announced that two reservists from the elite Unit 5515 were killed and another was seriously injured in a mortar attack on the border with Lebanon.\n* The IDF said that it started striking Hamas targets, tunnels and launchers throughout the Gaza Strip. The IDF also said that four rockets were launched from Gaza towards southern Israel and it foiled attempt of Hamas to launch more rockets. The Qassam Brigades claimed responsibility for the rocket strike.\n* The IDF said that two \"suspicious aerial targets\" were launched from the east towards central Israel.\n* Two Israeli airstrikes in towns south of Beirut killed at least 12 people, including several Lebanese children.\n* Hezbollah said that it targeted the city of Karmiel with rockets.\n* Israel announced that Idan Shtivi, who was initially reported to have been abducted during the Re'im music festival massacre, had been killed during the attack, with his body being taken by Hamas.\n* A rocket apparently launched from Lebanon fell in Kfar Vradim, causing property damage.\n* The IDF said that its 91st Division, including reservists, started a ground operation in southern Lebanon.\n* The Al-Qassam Brigades fired a barrage of Maqadmeh M-90 rockets towards Tel Aviv. Two women were slightly wounded by sharpnel from the strike.\n* Hezbollah fired missiles targeting IDF vehicles and personnel at the Jal al-Allam IDF site.\n* A 12-year-old was killed and seven people including three children were injured by live rounds during an IDF raid in East Jerusalem's Qalandia refugee camp.\n* Two people were killed after Israeli forces bombed a house in Qaliya, western Beqaa Valley.\n* Israeli warplanes struck a fire station building affiliated with the Islamic Health Authority in Baraachit, killing ten firefighters.\n* The al-Qassam Brigades claimed that its fighters killed and injured Israeli soldiers penetrating west of the Jabalia refugee camp in close combat with them. The al-Quds Brigades said that it was fighting Israeli soldiers attempting to infiltrate camp's \"Block 2\" area.\n* The IDF detained 45 people including a journalist across West Bank in the past 24 hours.\n* The IDF ordered civilians in the Khan Yunis area to evacuate to al-Mawasi humanitarian zone, saying that rockets were launched by the al-Qassam Brigades from the former and it \"will be met with extreme force\". The IDF later said that its warplanes destroyed weapons and rocket launchers used to fire rockets towards Tel Aviv in Khan Yunis.\n* The IDF carried out a targeted strike in Dahieh.\n* Eight people including the brother of an Al Jazeera cameraman, were killed in an Israeli strike in Jabalia refugee camp.\n* An Israeli airstrike in al-Nasr neighbourhood north of Rafah killed two Palestinian woman and trapped a boy and a man under the rubble.\n* Sharpnel from a downed surface-to-surface missile launched from Yemen towards central Israel caused a fire in Beit Shemesh. Houthis said that it fired two missiles including a Palestine 2 missile towards two IDF targets in Tel Aviv and claimed that its Palestine 2 missile hit its target. Houthis also said that it launched several drones towards Tel Aviv and Eilat and claimed that some of them reached their targets.\n* Hezbollah claimed that its fighters struck a gathering of Israeli soldiers in Maroun al-Ras using rockets as well as a separate gathering in Blida using rockets and artillery shells.\n* Hezbollah fired 190 rockets at northern Israel, injuring at least 12 people.\n* al-Qassam Brigades spokesman Abu Obaida claimed that October 7 attacks was a \"pre-emptive strike\" against a \"major attack\" planned by Israel \"against the resistance in Gaza\".\n* Hezbollah fired \"a large barrage of rockets\" towards an area north of Haifa.\n* At least 130 towns and villages across southern Lebanon were placed under IDF's evacuation orders.\n* The IDF said that it struck over 120 Hezbollah targets including its elite Redwan Force and Southern Front within an hour.\n* Israeli artillery shelling on a home east of Khan Yunis killed a Palestinian child and critically injured a woman.\n* Hezbollah fired five missiles at central Israel. Hezbollah said that its missiles targeted an IDF intelligence unit in the Tel Aviv suburbs.\n* The IDF ordered civilians in the vicinity of the coast of southern Lebanon to evacuate to the south of the Awali River.\n* The IDF said that it struck Hezbollah intelligence headquarters in Beirut.\n* Wafa reported that two young Palestinian men were injured, one critically, by Israeli live rounds during confrontation between Palestinians and Israeli forces in the al-Arroub refugee camp.\n* Palestinian activist Ziad Abu Helaiel, a peaceful protestor was reportedly beaten to death by Israeli soldiers at his house in Hebron.\n8 October\n* The Gaza Health Ministry reported that at least 56 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 41,965.\n* The Lebanese Health Ministry announced that at least 22 people were killed and 80 others were injured in Israeli attacks.\n*Israeli airstrikes on two separate locations in the Bureij refugee camp including tents housing displaced people killed at least 12 Palestinians and injured 25 others.\n*Hezbollah launched volleys of rockets and missiles towards Israeli soldiers in Shlomi, Hanita and Marj.\n*Hezbollah said that it targeted Israeli artillery positions in Dishon and Dalton with rockets and missiles. It also said that it hit Israeli soldiers in Yaroun with missiles. Rockets were also launched from southern Lebanon to sites in Upper Galilee.\n*The IDF claimed that it killed Hezbollah headquarters commander Suhail Hussein Husseini in a strike in Beirut. The IDF said that he was in charge of transferring weapons from Iran and distributing it to various units of Hezbollah and that he was \"involved in the budgeting and logical management of the most sensitive projects of the organisation, including the operational plan for war\".\n*Israeli strikes in central Gaza killed 25 people including six Palestinian children and two women.\n*The IDF said that its 146th Division was deployed one day prior for \"limited, localised and targeted operations\" targeting Hezbollah in southwestern Lebanon.\n*An IDF soldier was killed in northern Gaza.\n*The al-Qassam Brigades said that it detonated an explosive device in the vicinity of an Israeli armored personnel carrier in the west of the Jabalia refugee camp. It also said that it targeted an Israeli Merkava-4 tank using antitank weapons.\n*The IDF announced that its airstrikes in Tuffah on 30 September killed Muhammad Rafai, a participant in the attacks in Kfar Aza and Nahal Oz. The IDF also said that its airstrike in Rafah on 1 October killed Muhammad Zenon and Bassel Ahars, alleged participants in October 7 attack.\n* Hezbollah fired over 100 rockets at Haifa in two barrages, damaging several houses and injuring a woman. Hezbollah also claimed that its drone hit a gathering of Israeli soldiers in the \"al-Baghdadi\" IDF outpost in northern Israel. The IDF later said that its warplanes struck some of the launchers used by Hezbollah to launch rockets to Haifa.\n*Al Jazeera reported that Israeli soldiers fired at a group of displaced people including a young girl in Jabalia.\n*The al-Qassam Brigades claimed that its fighters killed an Israeli soldier in close combat in at-Twam area of the northwestern Gaza Strip. It also said that it targeted Israeli forces who came to rescue the soldier using an antipersonnel bomb and claimed that it killed and injured more Israeli soldiers.\n*The IDF said that it killed about 20 Palestinian militants in air strikes and street battles in Jabalia refugee camp. Casualties also included at least seven Palestinian civilians including women and children.\n*The IAF struck Hezbollah rocket and antitank weapon launchers, military buildings, a Hezbollah weapons depot and other buildings. The IDF also said that a school building in Tayr Harfa was also destroyed in its strike.\n*Israeli artillery shelling on a bakery in Jabalia refugee camp caused a fire. The IDF targeted three schools after ordering displaced people to evacuate from the schools, reportedly causing injuries. Firing were also reported in Nuseirat refugee camp and Bureij refugee camp.\n*Hezbollah claimed its fighters repelled Israeli soldiers who \"infiltrated\" in the vicinity of a UNIFIL post in Labboune, a village along the Israel-Lebanon border.\n*An Israeli strike in Bureij refugee camp injured a Palestinian girl.\n*Casualties were also reported in Israeli strikes in Beit Lahia. The IDF ordered Palestinian civilians to evacuate from their houses in Beit Hanoun and Jabalia refugee camps by dropping leaflets. Al Jazeera reported that the IDF is blocking the exit point at the same time.\n*Hezbollah fired 25 rockets at Kiryat Shmona, causing no casualties or major damage.\n*The Al-Quds Brigades said that it launched rockets towards the city of Sderot.\n*Israeli Prime Minister Benjamin Netanyahu claimed that an Israeli airstrike killed Hashem Safieddine.\n*The IDF said that 50 Hezbollah militants, including six commanders of the group's Southern Front, were killed in airstrikes the day prior.\n*An Israeli airstrike on an apartment in Damascus reportedly targeting a senior member of Hezbollah's Unit 4400 killed ten civilians and three combatants, including two Hezbollah members, and injured over ten others.\n*Israeli airstrikes were reported in Dahieh after the IDF ordered citizens near two buildings in the suburb to evacuate.\n*Hezbollah fired 180 rockets at northern Israel.\n*The Gaza Health Ministry said that Israeli forces fired on the Kamal Edwan Hospital administration office after ordering its evacuation.\n*Al Jazeera cameraman Ali al-Attar was seriously injured in an Israeli strike on Al-Aqsa Martyrs' Hospital.\n*Israeli settlers damaged cars of Palestinians in the vicinity of Khan al-Ahmar.\n9 October\n* The Gaza Health Ministry reported that at least 45 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,010.\n* Nine people of the same family were killed after Israeli forces attacked a house in Shuja'iyya.\n* Hezbollah claimed to have clashed with Israeli forces as they tried to infiltrate Blida.\n* Three Israeli soldiers were injured while fighting in Lebanon.\n* Al Jazeera reported that an Israeli strike on a house in Nuseirat refugee camp killed four people including two children.\n* Al Jazeera reported that an Israeli strike on a house in Bureij refugee camp killed three people including a child.\n* Al Jazeera reported that an Israeli airstrike in Sidon killed a Lebanese man and injured several others including a woman, her daughter and her granddaughter.\n* Hezbollah claimed to have repelled Israeli soldiers in Naqoura and Labbouneh. It also launched a huge barrage of rockets from southern Lebanon to Israel.\n* The Islamic Resistance in Iraq said that it launched four drone strikes on \"vital\" positions in southern Israel, northern Israel and the occupied Golan Heights.\n* Al Jazeera reported that an IDF operation in Anabta turned into clashes with Palestinians.\n* Hezbollah said that it targeted Israeli soldiers in the south of Maroun al-Ras using rockets.\n* The IDF said that the IAF struck about 45 Hamas targets including buildings, rocket launchers and fighters by dropping bombs using fighter jets and drones, while its soldiers engaged in close-quarters ground fighting in Gaza.\n* The Palestine Red Crescent Society said that Israeli soldiers fired at moving persons in Be'er al-Na'ja area, west of Jabalia.\n* The IDF detained at least 25 people including a journalist in the West Bank.\n* An Israeli strike in Quneitra killed a Syrian policeman and injured another policeman according to SANA.\n* Al Jazeera reported that the Kamal Adwan Hospital was evacuated after receiving an IDF order.\n* Stabbing attacks in Hadera injured at least six people. At least two of those victims were seriously injured. The attacker was \"neutralized\" by police.\n* The IDF ordered residents to evacuate from Jabalia, Beit Hanoun and Beit Lahia.\n* Hezbollah fired 40 rockets at Haifa, causing a blackout in Kiryat Bialik and injuring five people.\n* The IDF ordered the evacuation of staff and patients from Awda Hospital and the Indonesia Hospital.\n* Al Jazeera reported that Israeli settles destroyed approximately 70 olive trees in Husan. Wafa reported that Israeli soldiers attacked Palestinian olive pickers and farmers and seized a tractor in Sebastia, forcing them to leave their land.\n* A Hezbollah rocket attack killed a man and a woman in Kiryat Shmona. Kiryat Shmona municipality asked residents to leave the city.\n* Hezbollah said that it launched rockets and artillery shells towards Israeli soldiers trying to advance in Meiss Ej Jabal from several directions, adding that \"clashes are ongoing\".\n* UNRWA stopped lifesaving services in northern Gaza due to the IDF's intensified operations. It said that at least seven schools used as shelter by displaced people were evacuated in northern Gaza and that only two out of eight water wells in the Jabalia refugee camp are still operational.\n* The Turkish Navy arrived at the port of Beirut to evacuate Turkish citizens and give humanitarian aid to Lebanon.\n* 43 people were killed during Israel's 5-day incursion into Jabalia.\n* The Red Crescent said that it provided a \"shipment of essential primary health care consumables and emergency medicines\" to the Syrian Ministry of Health for supporting health activities at medical points along the Syrian-Lebanese border.\n* 130 Israeli soldiers vowed to quit service unless Israeli government sign a ceasefire deal for securing the release of the hostages.\n* Al Jazeera reported that Israeli forces fired at any moving persons at the street corner of Jabalia City and Jabalia refugee camp.\n* An Israeli quadcopter fired at Al Jazeera crew in northern Gaza injuring Al Jazeera cameraman Fadi al-Wahidi on his neck. He later sliped into coma after Israeli authorities refused to allow him and Al Jazeera cameraman Ali al-Attar to leave Gaza for medical treatment despite appeals from three media freedom organisations including The Committee to Protect Journalists which said that there is still no response from Israeli authorities regarding their request.\n* The IDF's Combat Intelligence Collection Corps 636th unit conducted drone strikes in southern Lebanon. One of the fatalities from the strikes was a Hezbollah company commander.\n* Hezbollah fired 90 rockets at the Upper Galilee, striking Safed and nearby communities.\n* The IDF intensified its strikes across northern Gaza including targeting evacuation centers in Beit Hanoon, Jabalia and Beit Lahia. The IDF launched missiles in 10 sites inside Yemen Al-Saeed Hospital in Jabalia which was pushed out of service in the first months of the war and was serving as an evacuation center for hundreds of displaced people killing at least 15 people. The IDF also forced most of the people to leave the hospital.\n* The Palestine Red Crescent said that an Israeli airstrike \"on a group of journalists at Abu Shrekh roundabout in northern Gaza\" killed an Al-Aqsa TV journalist and injured another person.\n* An Israeli strike in Wardaniyeh, Lebanon killed at least five people and injured 12 others.\n* The Islamic Resistance in Iraq said that it launched drones towards the Eilat.\n* The IDF ordered Haret Hreik residents to evacuate from a distance of 500 metres from a building which it claimed as infrastructure of Hezbollah.\n* An Israeli strike in Tyre killed five paramedics.\n* Israeli special forces killed the head of the Al-Aqsa Martyrs' Brigades and three other members in Nablus.\n* SANA reported that Israeli airstrikes on a car assembly plant in Hassia in Homs Governorate and a Syrian army site in the vicinity of Hama caused \"material damage\".\n* The Lebanese Army arrested two Syrian nationals suspected of spying for Israel.\n* An Israeli soldier was killed and another soldier was injured while fighting in Lebanon.\n10 October\n* The Lebanese Health Ministry announced that at least 60 people were killed and 168 others were injured in Israeli attacks.\n* The Gaza Health Ministry reported that at least 55 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,065.\n* The IDF attack near Kamal Edwan Hospital and in an evacuation centre in the western part of Jabalia killed at least 16 people.\n* Al Jazeera reported that an Israeli strike on a Civil Defence Centre in Derdghaiya, east of Tyre killed five rescue workers.\n* The Islamic Resistance in Iraq said that it launched a drone strike on a \"vital\" target in northern Israel.\n* The IDF claimed to have killed Hezbollah commanders Ahmed Mustafa Allhaj Ali and Muhammad Ali Hamdan in airstrikes in southern Lebanon. The IDF said that Ali was responsible for launching hundreds of rockets and antitank missiles towards Kiryat Shmona while Hamdan was responsible for firing missiles towards northern Israel.\n* Israeli fighter jets struck a house in al-Fakhari neighbourhood of Khan Yunis killing five people including a woman and her three children including a seven-month-old girl.\n* IDF bulldozers demolished two houses under construction belonging to local Palestinians in az-Zawiya, west of Salfit. Wafa also reported that Israeli soldiers used tear gas against Palestinian civilians at the Hamra checkpoint in the northern Jordan Valley. Israeli settlers vandalised a mosque and smashed its solar panels in Khirbet Tana et-Tahta.\n* The IDF said that approximately 40 rockets were fired from Lebanon towards Upper Galilee and northern Israel. A building was damaged in Margaliot.\n* The IDF said that its soldiers supported by dozens of air strikes are pushing on with their ground incursion in Gaza Strip. The IDF also said that its fighter jets struck over 30 targets in Gaza. It claimed to have killed Palestinian fighters and found weapons in Jabalia.\n* An Israeli man born in the US was arrested by Lebanese security forces in Dahieh on suspicion of spying. He was later freed and deported to the US after pressure from the US government.\n* Hezbollah said that its fighters launched a \"large rocket salvo\" to Kiryat Shmona, while other rocket barrages and strikes targeted a site along the border and Israeli soldiers in Beit Hillel and Maayan Baruch. Two Israeli civilians were slightly injured by sharpnel.\n* An Israeli strike on Rufaida school which was serving as a shelter for displaced people in Deir el-Balah killed at least 28 people and injured 54 others including Palestinian women and children. The IDF said that it targeted Hamas militants operating inside the compound.\n* The al-Qassam Brigades said that its fighters destroyed a Merkava tank using an explosive device in the az-Zahra neighbourhood, west of Jabalia and targeted another using an explosive device. It also said that its fighters fired mortar rounds targeting Israeli soldiers east of Jabalia refugee camp.\n* A drone was launched from the Gaza Strip towards Israel.\n* Israeli soldiers opened fire at three UNIFIL positions in southern Lebanon including its main base in Naqoura, injuring two peacekeepers.\n* The al-Qassam Brigades said that it targeted a convoy of 12 IDF vehicles and a truck containing Israeli soldiers using multiple explosive devices in Jabalia. It also claimed that its fighters killed and injured several Israeli soldiers who fled from the area to a home using an antipersonnel explosive device.\n* Israeli forces demolished the house of Palestinian journalist Khaled Khanna in Shuyukh al-Arrub after ordering his family to evacuate. It also demolished a house owned by him and his brother in 2019.\n* The UN confirmed that Israeli authorities carried out three demolitions of Palestinian homes in Arroub, Furush Beit Dajan, and al-Jalama.\n* The Israel Land Authority moved to confiscate the property hosting the UNRWA headquarters in the illegal Ma'alot Dafna settlement in East Jerusalem and allocate it to Israeli settlers.\n* A petition signed by 12,000 people was sent to the Nobel Peace Prize committee calling to remove UNRWA from candidacy due to evidence of its alleged ties with Hamas and its workers that participated in the October 7 attacks.\n* Three Israeli soldiers were killed while fighting in northern Gaza.\n* An Israeli air strike in Nur Shams refugee camp camp killed two people. The IDF said that it targeted a militant cell without offering evidence.\n* An Israeli airstrike in central Beirut reportedly targeting Wafic Safa, the chief of Hezbollah's Liaison and Coordination Unit, killed at least 22 people and injured 117 others. Safa reportedly survived.\n*The IDF said that an Israeli airstrike on a Hamas command and control centre in Jabaliya killed at least 12 Hamas and PIJ commanders.\n11 October\n* The Gaza Health Ministry reported that at least 61 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,126.\n*Israeli police detained Jeremy Loffredo, an American journalist and four other journalists under the charges including \"aiding the enemy during wartime and providing information to the enemy\" for reporting landing of Iranian missiles including in Nevatim Airbase and an intelligence base. A Russian journalist among them accused the IDF of beating him.\n* The Iranian Red Crescent Society said that the IDF destroyed a field hospital marked with Red Crescent flags along the Syrian-Lebanese border as well as its equipment, supplies and ambulances.\n*A drone was launched towards Lakhish.\n*An Israeli missile strike on a clinic in Gaza which served as a shelter for displaced people killed four people including a Palestinian infant and injured several others. A Palestinian girl who survived the attack said that all of those killed were children.\n*An unspecified Iraqi armed organization said that it launched a drone to Eilat.\n*One person was killed after Israeli forces bombed a house in as-Saftawi neighbourhood, northern Gaza City.\n*Israeli forces raided the towns of Yatma, Beit Dajan and Beita in Nablus Governorate, Yatta in the Hebron Governorate, Azzun in Qalqilya Governorate, al-Mughayyir, Deir Dibwan and Burqa in Ramallah and al-Bireh Governorate and Hizma in northeast East Jerusalem. Eight Palestinians were arrested during the raids.\n*Another Israeli attack injured two peacekeepers in the UNIFIL headquarters in Naqoura. The IDF said that the victims were \"inadvertently hurt\" while fighting with Hezbollah.\n*Approximately 25 rockets and two UAVs were launched from Lebanon towards Israel.\n*A Thai foreign worker was killed and another was injured by a fallen munition in Yir'on.\n*The IDF announced that it killed the commander of the Redwan Force's anti-tank missile unit.\n*Hezbollah said that its fighters launched a drone strike targeting an IDF base in Kiryat Elizer, a gathering of Israeli soldiers in the Zovolon area, north of Haifa and Kafrsold using rockets and \"al-Abad\" site using missiles. It claimed to have shelled Yaftah barracks and its surroundings.\n*A rocket was launched by Al-Aqsa Martyrs Brigades from northern Gaza towards Sderot. Palestine Islamic Jihad, Al-Aqsa Martyrs Brigades, the National Resistance Brigades, the Popular Front for the Liberation of Palestine and the Popular Resistance Committee fighters conducted mortar strikes in Jabalia. The Palestinian Mujahideen Brigades targeted a tank in the Jabalia refugee camp with improvised explosive device (IED). Hamas fighters attacked Israeli armour in Beit Lahiya using rocket-propelled grenades and IEDs.\n*An Israeli strike in Maghazi refugee camp killed two people including a 13-year-old boy.\n*A soldier of the 401st Brigade was killed fighting Hamas in southern Gaza, bringing the IDF death toll in Gaza to 352.\n*The IDF said that 100 rockets were launched in two waves from Lebanon towards northern Israel within an hour. It also said that it fired at Hezbollah launchers used to fire rockets. Hezbollah said that it targeted a gathering of Israeli soldiers in Kiryat Shmona and Kfar Yuval using rockets, Safed using missiles and soldiers in the vicinity of an IDF barracks in the Golan Heights using rockets.\n*An Israeli strike hit a Lebanese Army post in southern Lebanon, killing two soldiers and injuring three others.\n*Two drones from Lebanon were launched at Herzliya, with one hitting a retirement home and the other being intercepted. Hezbollah claimed responsibility for the attack.\n*Hezbollah warned Israelis to stay away from IDF sites in residential areas in northern Israel.\n*The German government demanded clarification from the Israeli government after an Israeli airstrike on the Dar-es-Salaam meeting centre in Lebanon which is supported by German organisations killed at least six people.\n*A UAV launched from Syria entered the Golan Heights.\n*Israeli fighter jets struck a multistorey apartment block in Jabalia killing 22 people including Palestinian children, women and elderly, injuring 90 others and trapped 14 people under the rubble.\n*The US government expanded sanctions on Iranian oil and petrochemical industry by imposing new sanctions as a response to October 2024 Iranian strikes against Israel.\n*An IDF reservist of the Alexandroni Brigade's 9203rd Battalion was seriously injured during combat in southern Lebanon.\n12 October\n* The Gaza Health Ministry reported that at least 49 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,175.\n*The Lebanese Health Ministry announced that at least 51 people were killed in Israeli attacks.\n* Nicaragua broke diplomatic relations with Israel, accusing it of being \"fascist\" and \"genocidal\".\n* The Islamic Resistance in Iraq said that it launched a drone strike on a \"vital target\" in the Golan Heights.\n* The IDF issued orders for residents within an area near Jabalia to evacuate to a humanitarian area between al-Mawasi and Deir el-Balah.\n*Hezbollah said that it launched seven strikes on Israeli positions. It claimed that its \"qualitative missiles\" hit an IDF base used for making weapons south of Haifa, artillery shells hit Israeli soldiers in the vicinity of the Lebanon border, targeted Ramia site with \"guided missiles\" and targeted other Israeli positions with multiple rocket salvos.\n*The Islamic Resistance in Iraq said that it launched another drone strike on a \"vital target\" in the Golan Heights.\n*Armed Israeli settlers forced Palestinian olive farmers to leave their land in Jalud. Israeli human rights organisation Yesh Din released a video of an armed Israeli settler openly stealing the olive harvest from a farm under private ownership in Awarta one day prior.\n*Al Jazeera reported that the IDF indiscriminately fired at the Palestinians who tried to flee as-Saftawi in northern Gaza.\n*A rocket was launched by Hezbollah from Lebanon towards central Galilee.\n*The al-Qassam Brigades claimed that its fighters hit two Merkava tanks and a D9 bulldozer with Yassin-105 anti-armour explosive shells in the al-Jnaina neighbourhood east of Rafah.\n*The IDF threatened to target ambulances in southern Lebanon, accusing Hezbollah of misusing them for transporting fighters and weapons. An IDF spokesperson alleged that intelligence revealed that \"Hezbollah elements are using ambulances to transport fighters and arms\" and any vehicle carrying armed elements including fighters and vehicles would be at risk.\n*The Gaza Health Ministry confirmed that second round of polio vaccination in central Gaza will begin on 14 October and will continue for three days, with the possibility of extending for one more day.\n*The IDF ordered residents of another 22 towns and villages in southern Lebanon including Aita al-Shaab, Ramyah and Hanine to evacuate to north of the Awali River.\n*World Food Programme said that the IDF's siege in northern Gaza is \"having a disastrous impact on food security\".\n*An Israeli strike on a house in Tuffah district of Gaza City killed three people and injured over 15 others including children, women and elderly and left a young girl missing.\n*Approximately 32 rockets were launched by Hezbollah towards Israel.\n*The al-Qassam Brigades claimed that its fighters killed some Israeli soldiers and injured others by hit a group of 15 soldiers trying to storm a house in the west of Jabalia refugee camp using an explosive device. It also claimed that it attacked a Merkava tank and a personnel carrier in the area using Yassin 105 rockets.\n*UNIFIL stated that a peacekeeper was wounded by unknown gunfire near its headquarters in Naqoura, bringing the numbers of injured peacekeepers to five.\n*Another 35 rockets were launched from Lebanon towards Acre, slightly injuring two people at the Mak'r intersection.\n*The Palestine Red Crescent said that 90 percent of children in Gaza suffered from \"food poverty\" in the past year.\n*The IDF said that it killed 20 Hamas militants in the Jabalia refugee camp in the past 24 hours. It also said that total number of militants killed in the area so far is approximately 200, without specifying the time period and an unspecified number of militants were also killed in Rafah.\n*The IDF said that about 320 projectiles were launched from Lebanon by Hezbollah towards Israel throughout the weekend of Yom Kippur.\n*The Head of the Gaza Health Ministry Mounir al-Bursh said that 200 people were killed in the past seven days during the Israeli siege of the northern Gaza.\n*The IDF said that entering Zerait, Shomara, Shtula, Natua and Even Menachem is \"strictly prohibited\" after announcing them as closed military zones.\n*Israeli forces carried out a raid in Tell, southwest of Nablus. Local media reported that Israeli soldiers fired tear gas at Palestinians and burned Palestinian flags hanging in the village.\n*Forty rockets were launched from Lebanon towards Upper Galilee.\n*The IDF said that a \"suspicious aerial target\" was launched from the Red Sea.\n*The Islamic Resistance in Iraq said that it launched drones towards two targets in Eilat.\n*The UN special rapporteur for the occupied Palestinian territories Francesca Albanese said that Israeli forces are committing \"another massacre\" in Jabalia refugee camp. Palestinian ambassador to UN Majed Bamya called IDF operation in north Gaza \"genocide within genocide\". Osama Hamdan said that \"What is happening in northern Gaza is genocide\".\n*The United States deployed THAAD missile defense systems to Israel in anticipation of an Iranian response to the planned Israeli retaliation for the 1 October strikes.\n*Massive cyberattacks were reported on nuclear facilities and government agencies of Iran.\n13 October\n* The Gaza Health Ministry reported that at least 52 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,227.\n*Israeli forces killed a Palestinian man and arrested his father and brother in Kafr Dan. Palestinian armed groups targeted Israeli forces using an explosive device in the same area.\n*The Al-Aqsa Martyrs' Brigades targeted Israeli forces using an explosive device in Nablus.\n*Al Jazeera Arabic reported that an Israeli quadcopter drone dropped explosives to force Palestinian civilians, including children to flee from the Jabalia refugee camp using a video footage obtained and verified by them.\n*Hezbollah fighters inflicted casualties on Israeli forces who tried to \"infiltrate\" Ramyah by detonating an explosive device and clashing in gun battles. It also said that fighting is continuing around the village. The Quds News Network reported that \"at least seven\" Israeli soldiers were injured.\n*An Israeli strike on a house in Nuseirat killed eight people including a Palestinian woman and her six children.\n*An Israeli strike on a house in Tuffah neighbourhood of Gaza City injured six people, mostly children.\n*Approximately 300 rockets were launched from Lebanon to northern Israel in past 24 hours.\n*Five rockets were launched from Lebanon towards Haifa.\n*Israeli aircraft bombed and destroyed an old mosque in Kfar Tebnit, while another aircraft bombed an empty apartment complex in Sidon.\n*The IDF said that it attacked about 40 targets in Gaza, destroyed weapons and killed dozens of fighters in the past 24 hours.\n*An Israeli airstrike in Sarbin injured four Lebanese Red Crescent paramedics.\n*The Red Crescent Society of Iran announced a fourth aid consignment containing three tonnes of medical supplies that arrived in Lebanon.\n*Hezbollah said that its rockets targeted Zabadin barracks in Shebaa Farms and its artillery targeted a gathering of Israeli soldiers in Maroun al-Ras.\n*Israeli airstrikes on two residential buildings in Basta neighbourhood of Beirut left a girl missing.\n*The IDF confirmed that two soldiers of its Etzioni Brigade were critically injured in separate firefights in southern Lebanon and additional soldiers were slightly to moderately injured.\n*The IDF claimed to have captured a Hezbollah operative with weapons and supplies for interrogation from a tunnel in southern Lebanon after his surrender.\n*Israeli prime minister Benjamin Netanyahu asked UN secretary-general Antonio Guterres to move UNIFIL peacekeepers in Lebanon \"immediately\".\n*The IDF ordered residents of 21 villages in Lebanon to evacuate to areas north of the Awali River.\n*The IDF said that 25 soldiers of the Etzioni Brigade were injured, including two critically, while fighting in southern Lebanon including in Kafr Kila and Odaisseh.\n*Hezbollah said that it targeted Kiryat Shmona with rockets. Hezbollah also claimed that its missiles hit an IDF base in Tzurit.\n*Approximately 115 rockets and other projectiles were launched by Hezbollah from Lebanon towards Israel.\n*Hezbollah alleged that the IDF used cluster bombs for bombing the area between the towns of Hanine and Tayri.\n*UNIFIL said that Israeli forces crossed the Blue Line and destroyed one of its main base gates. It added that 15 peacekeepers suffered effects including skin irritation and gastrointestinal reactions from smoke attributed to the IDF's use of \"what appeared to be an attack with some sort of chemical agent\" approximately 100 metres north of their position. The IDF said that its tank entered the base while evacuating its wounded soldiers.\n*A drone attack launched by Hezbollah hit the military barracks in the vicinity of Binyamina-Giv'at Ada, killing four Israeli soldiers and injuring at least 61 others, seven of them seriously.\n*The Palestine Red Crescent said that two children were injured by bullets during an Israeli raid in Beit Furik.\n*Hezbollah claimed that its missile targeted the IDF's Tsnobar logistics base in the Golan Heights.\n*Another drone was launched from Lebanon to the northern coast of Israel.\n*The Israeli Home Front Command said that sirens sounded in Kiryat Shmona, Margaliot, Metula, Misgav Am and Manara.\n*Israeli tank shelling on a school which serves as shelter for displaced people in Nuseirat killed at least 22 people and injured 80 others.\n*Five projectiles were launched from Lebanon towards the \"Gulf area\".\n*An Israeli drone strike in Al-Shati refugee camp killed at least five Palestinian children who were playing football an injured several others.\n*Israeli strikes in Nabatieh destroyed a market which dates back to 1910.\n14 October\n* The Gaza Health Ministry reported that at least 62 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,289.\n*The Lebanese Health Ministry announced that at least 41 people were killed in Israeli attacks.\n*The IDF said that it launched at least 30 air strikes in Gaza on October 14.\n**An Israeli strike on tents serving as shelter for displaced people on the grounds of Al Aqsa Martyr's Hospital killed four people and injured at least 70 others including women and children. The IDF said that it struck Hamas operatives operating inside a command and control complex in the hospital used to plan and carry out attacks targeting Israeli forces and territory without offering evidence.\n**Palestinian medics reported that Israeli air strikes on a food distribution centre in the Jabalia refugee camp killed 10 people including women and children and injured at least 30 others.\n**Gaza Civil Defense said that two rescue workers were injured in al-Mawasi after being \"exposed to Israeli bullets and shells\" while responding to a call by injured Palestinians in the Israeli-designated safe zone.\n**An Israeli strike on Hafsa School which served as shelter for displaced people in the Jabalia refugee camp killed three people including a child and injured 15 others.\n**An Israeli air strike in Sheikh Radwan neighbourhood of Gaza City killed eight people and injured several others.\n*Hezbollah said that it targeted an Israeli infantry force trying to \"infiltrate\" Lebanese territory through Markaba using artillery shells. Its missiles also targeted Israeli forces in Labbouneh.\n*The Palestinian Information Center reported that a child was arrested by Israeli forces in Beit Fajjar.\n*The IDF claimed that Hezbollah launched 25 rockets from the vicinity of UNIFIL peacekeeping posts.\n*Ten rocket were launched by Hezbollah towards Haifa.\n*Projectiles were launched from Lebanon towards central Israel.\n*Humanitarian pause between the IDF and Hamas started in the designated protected zone for polio vaccination campaign for children. The World Health Organization announced that second phase of the polio vaccination campaign was launched in central Gaza.\n*Two drones were launched from Syria towards Israel.\n*The al-Qassam Brigades claimed that its fighters killed or injured several Israeli soldiers by detonating an anti-personnel device while they were trying to enter a home in al-Jeneina neighbourhood of Rafah. It also said that its fighters attacked two Merkava tanks using Yassin rockets in the same area.\n*The IDF claimed to have killed Muhammad Kamal Naim, the commander of the antitank system of the Radwan Force in an air strike. It also said that he was responsible for planning and carrying out many attacks on Israel including launching an antitank missile.\n*Several rockets fired from Lebanon fell along with shrapnel in Karmiel.\n*Doctors Without Borders said that one of its workers died on 10 October from shrapnel injuries sustained in an Israeli airstrike in Jabalia on 8 October.\n*An Israeli airstrike on an apartment building in Aitou in northern Lebanon killed at least 21 people including twelve women and two children and injured eight others. The strike reportedly targeted Ahmad Fakih who rented an apartment in the town.\n*Hezbollah claimed that its fighters killed or injured Israeli soldiers by targeting an armoured personnel carrier using a guided missile in Aita al-Shaab. It also said that it engaged in fighting with Israeli soldiers in the village.\n*Hezbollah said that it launched a \"big rocket salvo\" towards Safed.\n*An Israeli soldier was killed while fighting in southern Gaza, bringing the IDF death toll in Gaza to 354.\n*Wafa reported that two people including a child were killed, four others were injured and public and private properties were damaged during an eight-hour raid by Israeli forces in Jenin.\n*Fire erupted in a building in Faluja, west of Jabalia refugee camp due to an Israeli strike. Inhabitants of the building included elderly women and children.\n*No relief supplies entered northern Gaza since 1 October.\n*A strike on the house of the family of a US citizen in the Jabalia refugee camp injured 17 people, including seven children. An Israeli strike on a responding ambulance killed a doctor and several children.\n15 October\n* The Gaza Health Ministry reported that at least 55 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,344.\n*Hezbollah said that it targeted Israeli soldiers operating in Khallet Wardeh, Marj, al-Sadana and Birkat al-Naqqar.\n*An Israeli strike on a home in Al-Fukhari killed six people including two children.\n*Two airstrikes on refugee tents west and east of Khan Yunis injured over a dozen people, most of them women and children.\n*An Israeli air strike on a home in the Bani Suheila neighbourhood of Khan Yunis killed at least 10 people.\n*Hezbollah targeted Haifa using two surface-to-surface ballistic missiles.\n*An Israeli air strike on a house in al-Sharaik neighbourhood in Iqlim al-Tuffah area of Jarjouh killed four people including a Lebanese woman and her two children.\n*Residents accused that the IDF planted planting explosive-filled barrels into the ground of al-Faluja neighbourhood of the Jabalia refugee camp for destroying buildings and houses which is also under drones and artillery strikes. Medical teams were unable to evacuate the injured people. Al Jazeera also reported that Israeli soldiers are shooting at any person trying to move in al-Balad, an-Nazla, Beit Lahia and Beit Hanoun areas of northern Gaza.\n*An Israeli air strike in the Birkat Abu Rashid area of the Jabalia refugee camp killed at least three people and wounded several others including a child.\n*An Israeli air strike on a residential building in southern Gaza killed at least 10 people.\n*The IDF said that it killed two armed men in Jenin.\n*Israeli strikes in the vicinity of al-Faluja in Jabalia refugee camp killed at least 11 people.\n*UNICEF said that 400,000 children were displaced and 1.2 million children were unable to get education in Lebanon within three weeks.\n*The IDF detained 25 Palestinians including a girl in the West Bank.\n*The al-Qassam Brigades claimed to have killed or injured some Israeli soldiers by targeting a group of soldiers using a barrel bomb in al-Rayyan area of Rafah.\n*Over 25% of Lebanon was under evacuation orders of Israel.\n* The Shin Bet and Israeli police released information about an attempted suicide bombing in Tel Aviv that was overseen from Turkey by Hamas.\n* A gun attack on highway in the vicinity of Ashdod killed an Israeli policeman and wounded four others.\n*The IDF announced that an airstrike in Nabatieh several days ago killed Khader Al-Abed Bahja, the head of Hezbollah's aerial unit in the northern Litani region.\n*The IDF announced that it captured three Redwan fighters from a tunnel underneath a building in southern Lebanon.\n*Israeli air strikes in Qana killed 15 people and injured 15 others.\n*An Israeli air strike in Riyaq killed five people including three children and injured at least 15 others.\n*Hezbollah claimed to have destroyed two Merkava tanks and three IDF bulldozers and inflicted casualties on Israeli soldiers in the Ramyah area.\n*The IDF said that Hezbollah launched about 95 projectiles from Lebanon towards Israel.\n*Two Hezbollah drones launched from Lebanon fell in Israeli territory.\n16 October\n* The Gaza Health Ministry reported that at least 65 Palestinians were killed in Israeli attacks in the past 24 hours, increasing the Palestinian death toll in Gaza to 42,409.\n*The Lebanese Health Ministry announced that at least 27 people were killed in Israeli attacks in the past 24 hours.\n*The IDF said that approximately 50 projectiles were launched from Lebanon towards Upper Galilee.\n*The IDF warned residents to move at least 500 metres away from a building in Haret Hreik. The IAF later conducted a strike against the building, saying that it was a storage facility that contained Hezbollah weapons.\n*A Palestinian man who was confined to a hospital bed and connected to an IV drip was burned to death after Israeli forces struck a target in a courtyard of a hospital in Deir al-Balah.\n*The IDF said that it struck 140 Hezbollah targets one day prior.\n*Hezbollah claimed that it shot down an Israeli drone.\n*Israeli soldiers chased Palestinian children in Biddu, East Jerusalem before shooting one of them. The victim was beaten and arrested.\n*The IDF said that its navy hit dozens of Hezbollah targets in southern Lebanon in coordination with soldiers on the ground.\n*Five people were killed after Israeli forces bombed a house in the Nasser neighborhood in Gaza City.\n*One person was killed during Israeli assault near the Sofa area, east of Rafah.\n*The IDF said that its 8th Reserve Brigade and the Yahalom combat engineering unit destroyed a Redwan tunnel and bunker network in southern Lebanon.\n*An Israeli airstrike on the municipal building of Nabatieh killed at least 16 people, including the town's mayor Ahmad Kahil and injured 52 others. The IDF said that it targeted Hezbollah infrastructure.\n*Oxfam said that 83 percent of needed food aid is not reaching almost half a million people in Gaza.\n*Hezbollah claimed to have hit a gathering of Israeli soldiers in Maskaf Am using artillery shells and Karmiel using rockets.\n*Approximately 350 people were killed since the start of the Second Battle of Jabalia.\n*A missile was launched from northern Gaza towards Israel.\n*Four people were lightly injured by shrapnel after Hezbollah fired 30 rockets at the Galilee.\n*85 Palestinian children were arbitrarily detained by Israel.\n*Two Lebanese Red Cross ambulance workers were injured by shrapnel after an Israeli strike in Jwaya.\n*Fierce clashes were reported between the IDF and Hezbollah around several towns in the central section of the Israel-Lebanon border.\n*An Israeli Merkava tank fired at a UNIFIL watchtower in Kafr Kila in the morning, causing damage.\n*Hezbollah claimed that its fighters killed or injured the crew of an Israeli tank in Labbouneh Heights by targeting it using an antitank missile.\n*Live ammunition fired by Israeli forces during its raid in Salfit injured a 14-year-old Palestinian boy on his thigh.\n*Hezbollah fired rockets at Kiryat Shmona, impacting several locations including a building.\nNotes\nReferences"
    }
  ]
}