{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Barrow-in-Furness\n\nThe following is a timeline of the history of Barrow-in-Furness, England, United Kingdom.\nPrior to 19th century\n* Neolithic period - Earliest known habitation within present-day Barrow\n* 9th century - Viking settlement of the Furness peninsula\n*1086 - The Doomesday Book records settlements in Hietun, Rosse and Hougenai (now Hawcoat, Roose and Walney)\n* 1123 - Furness Abbey is established\n* 1190 - Barrow Island from which Barrow takes its name is first recorded as being named Barrai\n* 1327 - The current Piel Castle is completed\n* 1537 - Furness Abbey is destroyed in the English Reformation\n19th century\nsuperseded the port and new town of Barrow upon completion in 1804]]\n, a founder of the new town of Barrow]]\nopened in 1870 and employed upwards of 2,000 women]]\nwas completed in 1887]]\n* 1801 - Population of village of Barrow stood at 1,958 during 1801 UK Census\n* 1804 - Walney Lighthouse is completed\n* 1839 - Henry Schneider arrives to exploit local iron ore\n* 1846\n** Furness Railway is opened\n** Roa Island causeway is completed\n* 1847 - Population: 325.\n* 1850 - Expansive haematite deposits are discovered in the area\n* 1852 - Jane Roper is the first ship to be built in Barrow\n* 1858 - St. Mary of Furness Roman Catholic Church is built\n* 1859 - Schneider Hannay & Co is founded.\n* 1860 - Barrow Co-operative Society is established\n* 1861 - St. George's Church is built\n* 1863 - Construction begins on Barrow's dock system\n* 1865\n** A magnitude 3.0 earthquake causes extensive damage to the Rampside area\n** Schneider Hannay & Co becomes the Barrow Hematite Steel Company.\n* 1867\n** Barrow is granted municipal borough status\n** Sir James Ramsden becomes first mayor of Barrow\n** Devonshire Dock opens.\n** Cases' Brewery opens\n* 1869 - St. James' Church is built\n* 1870 - Barrow Jute Works are completed\n* 1871\n** The Barrow Shipbuilding Company is established\n** Barrow Corn Mills are built\n* 1872 - Furness Golf Club is founded\n* 1873 - Duke of Devonshire is the first steamship to be built in Barrow\n* 1875\n** Barrow Football Club, the forerunner of Barrow Raiders is established\n** Devonshire Buildings are built\n* 1876 - Barrow's steelworks become the world's largest\n* 1877 - St. James' Church installs a ring of 8 bells - first rung on St James' day (25th July)\n* 1879 - Ramsden Dock completed.\n* 1881\n** The autonomous Barrow-in-Furness Borough Police force is established\n** SS City of Rome is launched, briefly the world's largest liner\n* 1882 - Barrow Central railway station is opened\n* 1884 - Michaelson Road Bridge is opened\n* 1885\n** The Barrow and Furness parliament constituency is established\n** Barrow-in-Furness Tramways Company commences operation.\n* 1886 - Ottoman submarine Abdül Hamid is launched in Barrow and becomes the first submarine to fire a live torpedo underwater\n* 1887\n** Barrow Town Hall is opened by Spencer Cavendish, 8th Duke of Devonshire\n** North Lonsdale Hospital is opened\n* 1888 - Town becomes a county borough.\n* 1889 - Co-operative Building built.\n* 1891 - Population: 51,712.\n* 1896 - Death of Sir James Ramsden mechanical engineer, industrialist, and first mayor of Barrow.\n* 1897 - The Barrow Shipbuilding Company becomes Vickers Shipbuilding and Engineering after being purchased by Vickers Limited\n* 1898 - The North-Western Daily Mail first begins publishing\n* 1899 - Barrow-in-Furness power station commissioned.\n20th century\nin Cavendish Dock]]\nin 1960; the UK's first nuclear powered submarine]]\nof the Indian Navy was launched as the Royal Navy's HMS Hermes in 1953]]\nwas completed in 1986 and included the world's largest shiplift]]\n* 1900 - Japanese battleship Mikasa is launched\n* 1901\n** Population of Barrow stood at 67,354 during 1901 UK Census\n** Barrow A.F.C. is established\n** The Vickerstown estate is completed\n* 1902 - Abbey Road Synagogue is built\n* 1903 - The Barrow Technical School is established\n* 1904 - Hotel Majestic built.\n* 1908\n** Jubilee Bridge is opened.\n** Barrow Park created.\n* 1909\n** Brazilian battleship São Paulo and HMS Vanguard are launched\n* 1911 - The Mayfly airship disaster\n* 1912\n** Barrow Central Fire Station is opened\n** Japanese battleship Kongō is launched\n* 1914\n** The outbreak of World War I in which 616 Barrovian men die\n** Abbey House is built\n** Explosion occurs on Tanker SS Vedra which runs aground off Walney killing 36\n* 1919 - Barrow Park Cenotaph is built\n* 1922\n** Barrow Main Public Library is opened\n** Sporadic marches and violence occur over shipyard overtime disputes\n* 1929 - Buccleuch Street Electricity Plant opens\n* 1931 - RMS Strathaird is launched\n* 1932 - Barrow-in-Furness Tramways Company ceases operation\n* 1938 - The John Whinnerah Institute is established\n* 1939\n** Outbreak of World War II in which 268 Barrovian men die\n** HMS Illustrious is launched\n* 1940\n** HMS Indomitable is launched by Winston Churchill\n** HMS Upholder the most successful British submarine of the war is launched\n** Luftwaffe aerial bombardment of Barrow during World War II begins\n* 1941\n** Barrow/Walney Island Airport is opened as a Royal Air Force base\n** The majority of the Barrow Blitz takes place killing 83 civilians\n* 1943 - HMS Colossus is launched\n* 1944 - The role of Bishop of Barrow-in-Furness is placed in abeyance\n* 1945\n** HMAS Melbourne is launched\n** RMS Empress of Russia is gutted by fire in Buccleuch Dock\n* 1947 - Barrow Hematite Steel Company Limited becomes Barrow Ironworks Limited\n* 1951 - Barrow's population peaks at 76,619 during the 1951 UK Census\n* 1953 - HMS Hermes the largest naval vessel built in Barrow is launched\n* 1954 - The coal-fired Roosecote Power Station opens\n* 1955 - First and to date only time Barrow have won rugby league's Challenge Cup\n* 1959 - SS Oriana is launched\n* 1960 - Queen Elizabeth II launches HMS Dreadnought the UK's first nuclear powered submarine\n* 1963 - Iron ore deposits run out and ironworks cease operation\n* 1965 - Queen Elizabeth II launches oil tanker British Admiral, the first UK vessel to exceed 100,000 tonnes\n* 1967 - Craven House built.\n* 1971 - HMS Swiftsure is launched\n* 1974\n** The Borough of Barrow-in-Furness is formed\n** Barrow is annexed from Lancashire to become part of the modern county of Cumbria\n* 1977 - HMS Invincible is launched\n* 1980 - Barrow's last remaining steelworks close down\n* 1981 - HMS Trafalgar is launched\n* 1984 - Furness General Hospital is opened\n* 1985 - Rampside Gas Terminal first collects gas from the Irish Sea\n* 1986 - Devonshire Dock Hall is completed\n* 1990 - Barrow A.F.C. win the FA Trophy\n* 1992\n** Commercial operations cease at Barrow/Walney Island Airport\n** HMS Vanguard is launched\n** Dalton bypass opens\n* 1994 - South Lakes Wild Animal Park opens\n* 1995 - GEC buys Barrow's shipyard\n* 1997 - Dock Museum opens\n* 1998\n** Queen Elizabeth II names HMS Ocean after being fitted out in Barrow\n* 1999 - GEC is merged with BAE Systems and the shipyard becomes part of BAE Systems Marine\n21st century\n, the first of many such facilities to be built off the town's coast]]\n* 2000 - RFA Wave Knight is launched\n* 2001\n** Population of Barrow stood at 71,979 during 2001 UK Census\n** HMS Albion and HMS Bulwark are launched\n* 2002 - A major outbreak of legionellosis occurs\n* 2006\n** Local council becomes first public body charged with manslaughter\n** Barrow Offshore Wind Farm is completed\n* 2007 - HMS Astute is launched\n* 2010\n** Construction of 'The Waterfront' begins\n** Barrow A.F.C. win the FA Trophy\n* 2011 - Furness General Hospital scandal comes to light\n* 2014 - The 8 bells at St James' Church are restored after being unsafe to ring and silent for 15 years.\n* 2016 - UK Government approves construction of the Dreadnought-class submarines in Barrow\n* 2021 - AUKUS partnership is established with a 2023 commitment to designing and constructing a new class of submarine in Barrow\n* 2024 - Borough of Barrow-in-Furness is abolished upon merging of the district with Eden and South Lakeland to for Westmorland and Furness unitary authority, whilst Barrow Town Council is established\n* 2025 - King Charles III grants royal patronage to the Port of Barrow and a mark of royal favour to the town itself.\nSee also\n* History of Cumbria\n* Listed buildings in Barrow-in-Furness\n* List of ships and submarines built in Barrow-in-Furness\n* List of people from Barrow-in-Furness\nReferences\nFurther reading\n*  |short= 1}}"
    }
  ]
}