{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of radio in Northern Ireland\n\nThis is a timeline of the development of radio in Northern Ireland.\n1970s\n* 1975\n** 1 January – BBC Radio Ulster is launched, and becomes the first full-time radio station for Northern Ireland. It replaces what had been an opt-out of BBC Radio 4 (previously the BBC Northern Ireland Home Service) and launches as a result of the BBC's widely regarded under-reporting of the UWC Strike in May 1974.\n* 1976\n** 16 March – Independent Local Radio begins in Northern Ireland when Downtown Radio starts broadcasting.\n* 1977\n** No events.\n* 1978\n** No events.\n* 1979\n** 11 September – BBC Radio Foyle launches as an opt-out station from BBC Radio Ulster.\n1980s\n* 1980\n** No events.\n* 1981\n** No events.\n* 1982\n** No events.\n* 1983\n** Plans for a station, Northside Sound, in the Derry region collapse.\n* 1984\n** No events.\n*1985\n** No events.\n* 1986\n** 1 October – Downtown Radio's broadcast area is expanded when it begins broadcasting to the north western area of Northern Ireland.\n* 1987\n** Late in 1987, Downtown Radio begins broadcasting to the Enniskillen and Omagh areas of Northern Ireland and to coincide with its expanded broadcast area, the station rebrands itself as 'DTRFM' to reflect that it now broadcasts to wider areas of Northern Ireland.\n* 1988\n**24 November – BBC Radio 1 starts broadcasting on FM in Belfast.\n* 1989\n** No events.\n1990s\n* 1990\n**7 February – Cool FM begins broadcasting to Belfast on FM. Downtown Radio continues on MW in Belfast and on FM across Northern Ireland.\n**6 April – Belfast Community Radio launches.\n**4 June – CityBeat begins broadcasting to Belfast.\n* 1991\n** No events.\n* 1992\n** Belfast Community Radio adopts a classic hits format and renames itself as Classic Trax BCR.\n* 1993\n** No events.\n* 1994\n** Classic Trax BCR relaunches as 96.7 BCR.\n* 1995\n** Townland Radio begins broadcasting on 828&nbsp;kHz in Cookstown, Northern Ireland.\n* 1996\n**Radio 1521 launches. Broadcasting from Craigavon, the station covers much of mid-Ulster.\n**30 September – Belfast Community Radio closes and is replaced by CityBeat.\n* 1997\n** Townland Radio is relaunched as Goldbeat.\n* 1998\n**Radio 1521 is relaunched as Heartbeat 1521.\n* 1999\n**22 May –  Goldbeat and Heartbeat 1521 close down and both AM licences are handed back to the then UK regulator The Radio Authority\n**19 August – BBC Radio 1 broadcasts its first split programming when it introduces weekly national new music shows for Scotland, Wales and Northern Ireland. The Session in Northern Ireland is presented by Colin Murray and Donna Legge.\n2000s\n* 2000\n**26 January – Q97.2, fully known as Q97.2 Causeway Radio, begins broadcasting to the Coleraine area of Northern Ireland.\n* 2001\n** No events.\n* 2002\n**19 March – Q101.2 begins broadcasting to Omagh and Enniskillen.\n**After years of campaigning by locals for the re-advertising of a radio licence for Mid-Ulster, Ofcom awards an FM licence for the area to Belfast CityBeat and launches the station as Mid FM.\n* 2003\n**1 February – Mid 106 FM begins broadcasting across mid Ulster.\n**\n* 2004\n**No events.\n*2005\n**14 November – U105 launches as a music and speech station covering Belfast-based radio station\n*2006\n** Mid FM is rebranded to 6FM.\n** 15 September – Raidió Fáilte launches as an Irish-language community radio station, broadcasting from Belfast. Previously the station had operated as a pirate radio station.\n* 2007\n** CityBeat becomes available in North Belfast, Newtownabbey and Carrickfergus and later in the year, another FM transmitter opens, covering the Bangor area.\n* 2008\n** No events.\n* 2009\n** Belfast-based community station Blast 106 launches.\n2010s\n* 2010\n**26 July – The BBC announces a trial scheme under which BBC Radio Foyle would be available on DAB as a part-time sidecar station to Radio Ulster, using a similar format as the part-time longwave-programming optouts of BBC Radio 4 on the BBC National DAB multiplex. During this trial, the bitrate of Radio Ulster drops during Foyle's separate broadcast hours, with Foyle carried as a split audio stream in the remaining space; outside of split shows, the full bitrate would revert to Radio Ulster.\n* 2011\n** November – 6FM is rebranded to 6FM in 2006 and changed name again to Q106.7 FM.\n*2012\n** 28 June – Community station Lisburn's 98FM launches.\n** December – Downtown Radio opens a small studio in Derry ahead of the city’s year of being UK City of Culture. It remains open and in use, mainly at the weekend with presenter-led programming on Saturday afternoon and Sunday covering a range of events in the region.\n*2013\n**26 July – Digital radio is switched on in Northern Ireland allowing a further 1.4 million listeners to hear stations such as Smooth 70s, Absolute Radio 90s and Jazz FM.\n*2014\n** No events.\n*2015\n**6 July – Fuse FM Ballymoney launches as a full time community station., becoming the first radio station in the UK to serve the Ulster Scots Community.\n**9 August – The Q Radio Network launches. The network covers seven licence areas including Belfast which sees Citybeat subsumed into the new network.\n*2016\n**No events.\n*2017\n**No events.\n*2018\n** No events.\n*2019\n** No events.\n2020s\n*2020\n** No events.\n*2021\n**6 May – BBC Radio Ulster and BBC Radio Foyle stop broadcasting on MW.\n*2022\n** No events.\n*2023\n**7 December – Downtown Radio stops broadcasting on MW.\nSee also\n*Timeline of radio in London\n*Timeline of radio in Manchester\n*Timeline of radio in Scotland\n*Timeline of radio in Wales\nReferences"
    }
  ]
}