{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Anatolian history\n\nSee History of Turkey. See also the Hittites, Sultanate of Rum, Ottoman Empire and Republic of Turkey.\n17th century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:19%\" | Date || Event\n|-\n| 1600 BCE || || Hittite Empire established in the region of Anatolia with capital in Hattusa near present-day Boğazkale, Turkey.\n|}\n14th century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:19%\" | Date || Event\n|-\n| 1346 BCE || || Hittite empire reaches its height under the rule of Šuppiluliuma I.\n|}\n13th century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:19%\" | Date || Event\n|-\n| 1274 BCE || || Battle of Kadesh between the Hittite Empire and the New Kingdom of Egypt.\n|}\n12th century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:19%\" | Date || Event\n|-\n| 1178 BCE || || Collapse of the Hittite Empire, splinters into several independent Syro-Hittite states.\n|}\n5th century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:19%\" | Date || Event\n|-\n| 499–493 BCE || || Ionian Revolt, military rebellion by the Greek regions of Anatolia against Persian Empire rule. Revolt is crushed.\n|}\n4th century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 334 BC|| || Alexander III of Macedon crosses the Hellespont into Asia, making his landing in present-day Turkey.\n|-\n| 334 BC|| May || Alexander III of Macedon defeats the armies of the Achaemenid Empire in the Battle of the Granicus river (modern-day Biga Çayı).\n|-\n| 333 BC|| 5 November || Alexander III of Macedon defeats the armies of the Achaemenid Empire in the Battle of Issus.\n|-\n| 323 BC|| 10/11 June || Alexander III dies in Babylon, triggering a division of his empire including present-day Turkey, among his generals in a treaty known as the Partition of Triparadisus.\n|}\n2nd century BCE\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 133 BC|| || The Roman invasion of Anatolia begins with the annexation of Attalid Pergamon by the Roman Republic. The entire region is later brought under Roman rule. For the next few centuries, under Roman rule, the region becomes prosperous, roads and infrastructure are built and improved and coastal communities flourish.\n|}\n4th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 324|| ||The Roman emperor Constantine I chooses Byzantium (later known as Constantinople and currently Istanbul) to be the new capital of the Roman Empire, renaming it New Rome.\n|-\n| 324|| ||Constantine I becomes the first Roman emperor to convert to Christianity.\n|-\n| 360||15 February ||The Hagia Sophia Church is first consecrated by the Arian Bishop Eudoxius of Antioch.\n|}\n5th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 476|| ||The region becomes part of the Byzantine Empire with the collapse of the Roman Empire.\n|}\n7th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 674–678|| ||First Arab Siege of Constantinople by the Umayyad Caliphate, ends with Byzantine victory.\n|}\n8th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 717–718|| ||Second Arab Siege of Constantinople by the Umayyad Caliphate, ends with Byzantine victory.\n|}\n9th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 863|| ||Beginning of the Byzantine resurgence with emergence of Macedonian dynasty, most of lost territories are retaken from Arab invasions.\n|}\n11th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1071 || || Alp Arslan of the Great Seljuq Empire defeats Romanos IV Diogenes of the Byzantine Empire at Malazgirt, near Muş, Historical Western Armenia (today called Eastern Anatolia)\n|-\n| 1077 || || Suleyman I of Rum is appointed as a governor in Seljuq. Then he moved on to Turkey. But he acts independently and founds a state. Capital İznik (Nicea), Bursa Province, Northwest Anatolia.\n|-\n| 1081 || || Tzachas, an independent Turkish sea captain, founds a principality in Smyrna, giving the Seljuks access to Aegean Sea.\n|-\n| 1084 || || Conquest of Antakya (Antioch), South Anatolia.\n|-\n| 1086 || || Süleyman I of Rum tries to add Syria to his realm. But he commits suicide after being defeated by his cousin Tutush I in the Battle of Ain Salm, Syria.\n|-\n| 1092 || || Kılıç Arslan I (1092–1107)\n|-\n| 1096 || || Kılıç Arslan I defeats Walter Sans Avoir and Peter the Hermit of People's Crusade at the battles of Xerigordon and Civetot both in Northwest Anatolia.\n|-\n| 1097 || || Bohemond of Taranto, Godfrey of Bouillon and Adhemar of Le Puy of First Crusade defeat Kılıç Arslan I in the battle of Dorylaeum (near modern Eskişehir, Central Anatolia). The capital İznik is lost to Crusades. A few years later Konya, becomes the new capital.\n|-\n| 1100 || || Danishmend Gazi, an independent bey, defeats Bohemond I of Antioch in the battle of Melitene (Malatya)\n|}\n12th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1100s || || 12th century renaissance in the Byzantine Empire, revival of art, architecture and economic activity.\n|-\n| 1101 || || Kılıç Arslan I defeats Stephen of Blois and Hugh of Vermandois of the second wave of First Crusades at the Battle of Mersivan (near modern Merzifon, Amasya Province, Central Anatolia.)\n|-\n| 1107 || || Kılıç Arslan conquers Musul, Iraq, but is defeated in the battle.\n|-\n| 1110 || || Şahinşah (1107–1116) (also called Melikşah, not to be confused with the sultan of Great Seljuk Empire with the same name) Continuous struggle with the Crusades weakens the state.\n|-\n| 1116 || || Mesut I (1116–1156) During the early years of his reign he has to accept the dominance of Danishmends a rival Turkish state in Anatolia.\n|-\n| 1142 || || Mehmed of Danishmends dies and the Sultanate of Rum becomes the leading power in Anatolia for the second time.\n|-\n| rowspan=\"2\" valign=\"top\" | 1147 || || Mesut I defeats Holy Roman Emperor Conrad III of Second Crusade in the Second battle of Dorylaeum (near modern Eskişehir)\n|-\n| || Mesud I defeats French king Louis VII of Second Crusade at Laodicea (near modern Denizli, West Anatolia).\n|-\n| 1156 || || Kılıç Arslan II (1156–1192)\n|-\n| 1176 || || Kılıç Arslan defeats Manuel I Komnenos of Byzantine Empire in the battle of Myriokephalon (probably near Çivril, Denizli Province, West Anatolia).\n|-\n| 1178 || || Kılıç Arslan II annexes Danishmend realm. (Sivas, and the surrounding territory, Central Anatolia.)\n|-\n| 1186 || || Kılıç Arslan II partitions the country into 11 provinces, each governed by one of his sons\n|-\n| 1190 || || Holy Roman Emperor Frederick I Barbarossa of Third Crusade crosses West Anatolia. While main Turkish army avoids conflict, several irregular troops try to fight, but are repelled. Temporary German occupation of capital Konya.\n|-\n| 1190 || || Frederick Barbarossa of Third Crusade dies near Silifke, Mersin Province in South Anatolia.\n|-\n| 1192 || || Keyhüsrev I (1192–1196)\n|-\n| 1194 || || After the collapse of Great Seljuk Empire, the Sultanate of Rum become the sole surviving branch of Seljuks.\n|-\n| 1196 || || Suleyman II of Rum (1196–1204)\n|}\n13th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 1202 || || Süleyman II of Rum annexes Saltukid realm (Erzurum, and the surrounding territory, Eastern Anatolia.)\n|-\n| || Georgian army defeats Süleyman II at the Battle of Micingerd\n|-\n| 1204 || || Kılıç Arslan III (1204–1205)\n|-\n| 1205 || || Keyhüsrev I (1205–1211) (second time)\n|-\n| 1207 || || Conquest of Antalya, access to Mediterranean Sea\n|-\n| 1211 || || Keykavus I (1211–1220)\n|-\n| 1214 || || Conquest of Sinop, Black Sea coast\n|-\n| 1220 || || Alaaddin Kayqubad I (1220–1237)\n|-\n| 1221 || || Conquest of Alanya, Antalya Province, Mediterranean coast\n|-\n| 1223 || || Construction of an arsenal in Alanya, a sign of Alaaddin Keykubat's interest in maritime trade\n|-\n| 1224 || || Alladdin Keykubat annexes a part of Artuqid realm (Harput and surrounding territory, .)\n|-\n|1225  || || Kayi Obasi (Tribe)\n|-\n| 1227 || || Sudak in Crimea is annexed. This is the most notable overseas campaign of Seljuqs.\n|-\n| rowspan=\"2\" valign=\"top\" | 1228 || || Mongol conquests in Iran result in a flux of refugees to Anatolia, one of the refuges is Mevlana\n|-\n| || |Alaaddin Keykubat I annexes Mengucek realm (Erzincan and the surrounding territory), Eastern Anatolia .\n|-\n| 1230 || || Alaaddin Keykubat defeats Celaleddin Harzemşah of Harzemşah Empire in the Battle of Yassıçemen, near Erzincan\n|-\n| 1237 || || Keyhüsrev II (1237–1246)\n|-\n| 1238 || || Sadettin Köpek the vizier of the inexperienced sultan who has executed some members of Seljuk house and becomes the de facto ruler of the sultanate is killed.\n|-\n| 1239 || || Revolt of Baba Ishak. A revolt of Turkmen (Oguz) and Harzem refugees who have recently arrived in Anatolia. The revolt is suppressed. But the sultanate loses power.\n|-\n| 1240 || || Conquest of Diyarbakır in Southeast Anatolia.\n|-\n| 1243 || || Bayju of Mongols defeats Keyhüsrev II in the battle of Kösedağ, Eastern Anatolia. From now on, the sultanate is a vassal of Ilkhanids.\n|-\n| 1246 || || Keykavus II (1246–1262) Governs together with his two brothers. But the real ruler is vizier Pervâne who has married to late sultan's widow Gürcü Hatun.\n|-\n| 1256 || || Mongols defeat Seljuk Turks at the Battle of Sultanhan, Aksaray Province, Central Anatolia.\n|-\n| 1258 || || Mongols partition the country. Double sultanate\n|-\n| 1262 || || Kılıç Arslan IV 1260–1266\n|-\n| 1266 || || Keyhüsrev III 1266–1284\n|-\n| rowspan=\"2\" valign=\"top\" | 1277 || || Karamanoğlu Mehmet Bey, a semi independent bey, allies himself with the Mameluk sultan Baybars who invades a part of Anatolia.\n|-\n| || Karamanoğlu Mehmed Bey conquers Konya and enthrones his puppet Jimri. But Ilkhanids intervene and reestablish Keyhüsrev's reign. (During his short stay in Konya Mehmed Bey declares Turkish as the official language in his realm).\n|-\n| 1284 || || Mesut II 1284–1297\n|-\n| 1289 || || Seljuk-Ilkhanid coalition defeats the tribes of Germiyanids\n|-\n| 1297 || || Alaaddin Kekubat III 1297–1302\n|-\n| 1299 || || Osman I, founder of the Ottoman Empire, begin the Ottoman history. (According to Halil İnalcık, expert on Ottoman history, Ottoman Empire was founded in 1302 not 1299.)\n|}\n14th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1302 || || Mesut II 1302–1307 (last sultan of Rum)\n|-\n| 1371 || 27 September || Battle of Maritsa. Most of Macedonia is conquered.\n|-\n| 1389 || 15 June || Battle of Kosovo. Most of Serbia is conquered.\n|-\n| 1396 || 25 September || Battle of Nicopolis. Bulgaria is conquered.\n|}\n15th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1444 || 10 November || Battle of Varna. Ottoman victory, end of Crusade of Varna.\n|-\n| 1453 || || Mehmed II (the Conqueror) captures Constantinople, Christian emperor Constantine XI dies in the fighting and the Byzantine Empire yields to the Ottoman Empire as Mehmed II.\n|-\n| 1460 || || Mehmed II conquers Morea.\n|-\n| 1461 || || Mehmed II conquers Trabzon thus ends Empire of Trebizond.\n|-\n| 1462 || || Mehmed II begins to build his palace, Topkapi Palace (Topkapı Sarayi).\n|-\n| 1463 || || Bosnia is conquered.\n|-\n| 1473 || || Battle of Otlukbeli; Mehmed II defeats Uzun Hasan of Akkoyunlu Turkmens.\n|-\n| 1475 || || Gedik Ahmet Pasha captures Caffa. Crimea becomes vassal of the Ottoman Empire.\n|-\n| 1478 || || Albania is conquered.\n|-\n| 1480 || ||Gedik Ahmet Pasha captures Otranto, the southeast corner of Italy, as a base for further attacks on Italy (only to evacuate after the death of Mehmet II).\n|-\n| 1481 || 3 May || Mehmed II dies. Bayezid II ascended to the throne.\n|-\n| 1482 || || Herzegovina is conquered.\n|-\n| 1498 || || Montenegro is conquered.\n|}\n16th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1514 || || Battle of Chaldiran; Selim I defeats Ismail I of Safavid Persia; Kurdistan under control of Ottoman Empire.\n|-\n| 1516 || || Battle of Marj Dabiq; Selim I defeats Al-Ashraf Qansuh al-Ghawri of Mamluk Sultanate of Egypt. Syria and Palestine under Ottoman rule.\n|-\n| 1517 || || Battle of Ridaniya; Selim I defeats Tuman bay II of Mamluk Sultanate of Egypt. Egypt under Ottoman rule; Selim I takes the title caliph.\n|-\n| 1519 || || Algeria is conquered.\n|-\n| 1520 || || The reign of Suleiman the Magnificent (Suleiman I) begins.\n|-\n| 1521 || || Suleiman I captures Belgrade.\n|-\n| 1522 || || Suleiman I captures Rhodes.\n|-\n| 1526 || || Battle of Mohács. Suleiman I defeats Louis II of Hungary and Bohemia\n|-\n| 1529 || || Siege of Vienna.\n|-\n| 1533 || || Iraq under Turkish control.\n|-\n| 1538 || || Sea Batte of Preveza. Turkish navy controls most of Mediterranean Sea.\n|-\n| 1550 || || Sultanate of Women\n|-\n| 1551 || || Libya is conquered.\n|-\n| 1541 || || Suleiman I captures Budapest (known as Buda), which eventually leads to conquest of most of Hungary.\n|-\n| 1547 || || Most of Hungary under Turkish control. Hungary is divided, by agreement between the Ottoman sultan Suleiman I and Ferdinand I of Austria.\n|-\n| 1566 || || The reign of Suleiman the Magnificent (Suleiman I) ends.\n|-\n| 1569 || || The great fire of Istanbul broke out.\n|-\n| 1570 || || Conquest of Cyprus by Piyale Pasha\n|-\n| 1571 || || The Spanish and the Venetians defeat the Turks at the Battle of Lepanto.\n|-\n| 1574 || || Tunisia is conquered.\n|-\n| 1578 || || Tbilisi and most of Georgia conquered.\n|-\n| 1590 || || Treaty of İstanbul between Ottoman Empire and Safavid Persia; Georgia, Azerbaijan and Armenia as well as west Iran under Ottoman rule.\n|}\n17th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1610 || || Kuyucu Murat Pasha suppresses Jelali revolts. Turkmens suffer heavily.\n|-\n| 1612 || || Treaty of Nasuh Pasha between Ottoman Empire and Safavid Persia. Ottoman Empire gives up some gains of Treaty of Istanbul of 1590.\n|-\n| 1615 ||  || Treaty of Serav ratifies Treaty of Nasuh Pasha\n|-\n| 1683 || 12 September || Battle of Vienna. Ottoman defeat.\n|-\n| 1686 || || Hungary evacuated.\n|-\n| 1687 || || Mehmed IV is deposed.\n|-\n| 1699 || || Ottomans cede Hungary to Austria in the Treaty of Karlowitz.\n|}\n18th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"2\" valign=\"top\" | 1718 || || Treaty of Passarowitz signed.\n|-\n| || Beginning of Tulip era (up to 1730)\n|-\n| 1729 || || First printing press in Turkish by Ibrahim Muteferrika\n|-\n| 1730 || || Revolt of Patrona Halil. End of Tulip era. Ahmet III is dethroned.\n|-\n| 1739 || || Treaty of Belgrade signed.\n|-\n| 1774 || || Treaty of Küçük Kaynarca signed.\n|-\n| 1795 || || First newspaper in Ottoman Empire (Bulletin de Nouvelles.)\n|}\n19th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 1807 || May || Kabakçı Mustafa rebellion: Reformist sultan Selim III dethroned. New sultan is Mustafa IV\n|-\n| 1808 || 21 July || Alemdar Mustafa Pasha suppresses the rebellion. But Selim III is dead and Mahmut II becomes the new sultan.\n|-\n| 1813 || 23 April || Second Serbian Uprising: The Serbs revolt.\n|-\n| 1821 || || Greek War of Independence: The Greek War of Independence begins.\n|-\n| 1826 || 15 June || Auspicious Incident. Massacre of the Janissary corps by Sultan Mahmud II: Foundation of a modern western style army.\n|-\n| 1830 ||  || Algeria is gradually ceded to French rule.\n|-\n| 1832 || 21 July || Greek War of Independence: Greek sovereignty is formalized.\n|-\n| 1831 || || Egyptian–Ottoman War. (to 1833)\n|-\n| 1853 || 4 October || Crimean War: The Crimean War with Russia began which, though won with British, French and Sardinian aid, would further demonstrate how backward the Ottoman military had become.\n|-\n| 1860 || 21 October || First newspaper in Turkish published by Agah Efendi.(''Tercümen'ı Ahval).\n|-\n| 1862 || 5 February || A united Romanian autonomous state is established.\n|-\n| 1876 || 23 December || Opened the 1876–1877 Constantinople Conference.\n|-\n| 1877 || 24 April || Russo-Turkish War (1877–1878): Another war with Russia begins.\n|-\n| rowspan=\"2\" valign=\"top\" | 1878 || 3 March || Russo-Turkish War (1877–1878): The Treaty of San Stefano recognizes Romanian and Serbian independence, as well as the establishment of an autonomous Bulgarian principality under nominal Ottoman protection. Austria-Hungary occupies Bosnia by default.\n|-\n| 4 June || Cyprus is occupied by Britain.\n|-\n| 1881 || || Mustafa Kemal Atatürk was born. Tunisia becomes a French colony.\n|-\n| 1882 || || Egypt goes under British protection.\n|-\n| 1885 || 6 September || The province of Eastern Rumelia is transferred to Bulgarian jurisdiction.\n|-\n| 1894 || || Hamidian massacres, where the Ottoman Empire under Sultan Abdul Hamid II kills between 200,000 and 400,000 Armenians in order to reassert Pan-Islamism as a state ideology.\n|}\n20th century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| rowspan=\"3\" valign=\"top\" | 1908 || 3 July || Second Constitutional Era (Young Turk revolution)\n|-\n| 5 October || Bulgaria obtains full independence.\n|-\n| 7 October || Austria-Hungary annexes Bosnia by mere declaration.\n|-\n| rowspan=\"2\" valign=\"top\" | 1912 || || The Ottomans are defeated by Italy in a short war, with the Italians gaining Libya and ending the 340-year Ottoman presence in North Africa.\n|-\n| 28 November || First Balkan War: Albania declares independence\n|-\n| 1913 || 17 May || First Balkan War: The Ottoman Empire is nearly wiped out from Europe, save for Istanbul and just enough land around to defend it.\n|-\n| 1913 || || Greek genocide by the Ottoman Empire, lasts till about 1922. Approximately 750,000 Ottoman Greek Christians believed to have been killed.\n|-\n| 1914 || || Assyrian genocide (Seyfo or Sayfo) by the Ottoman Empire, lasts till about 1924. Approximately 250,000 Assyrian Christians believed to have been killed.\n|-\n| 1914 || 2 August || The Ottoman Empire enters into World War I on the side of the Central Powers. Cyprus is annexed outright by Britain.\n|-\n| rowspan=\"2\" valign=\"top\" | 1915 || 18 March || The Gallipoli Campaign was considered one of the greatest victories of the Turks at World War 1 and was reflected on as a major failure by the Allies.\n|-\n| 24 April || The Ottoman Empire initiates Genocide of Christian Armenians, over 1 million Armenians are killed.\n|-\n| 1915 || || Persecution of nearly 4.000.000 Turks from Balkans started. Most of them were suffered and killed.\n|-\n| rowspan=\"3\" |1923\n| rowspan=\"2\" valign=\"top\" | 29 October || valign=\"top\" | The Republic of Turkey was proclaimed.\n|-\n|Mustafa Kemal (Atatürk) was unanimously elected the first President of the Republic of Turkey by secret vote.\n|-\n| 30 October || The first cabinet of the Republic of Turkey was formed by İsmet İnönü.\n|-\n| rowspan=\"11\" valign=\"top\" | 1924 || || A new policy was instituted that imams be appointed by the government.\n|-\n| rowspan=\"3\" valign=\"top\" | 3 March || The Ottoman Caliphate was abolished by the Turkish Grand National Assembly.\n|-\n| The Union of Education (Tevhid-i Tedrisat) Law was passed.\n|-\n| The Ministry of Religious Affairs and all religious schools were abolished.\n|-\n| 6 March || Second cabinet, again by İsmet İnönü\n|-\n| 8 April || Religious courts were abolished and replaced by civil courts.\n|-\n| 20 April || A new Turkish constitution was accepted.\n|-\n| 26 August || Türkiye İş Bankası was established.\n|-\n| 30 October || The generals who were also in parliament were asked to choose either military profession or politics but not both. (This event is known as the crisies of generals''.) Only Prime Minister İsmet İnönü retains his title as general and remains in politics as prime minister.\n|-\n| 17 November || The second political party in Turkey, the Progressive Republican Party, was formed.\n|-\n| 22 November || Third cabinet by Fethi Okyar.\n|-\n| rowspan=\"13\" valign=\"top\" | 1925 || 11 February || The Sheikh Said rebellion started in the eastern provinces.\n|-\n| 25 February || A law separating religion from politics was accepted and passed in the TBMM.\n|-\n| 4 March || Fourth cabinet by İsmet İnönü\n|-\n| 5 May || An Armenian named Manok Manukyan was executed in Ankara for planning an assassination attempt on Mustafa Kemal.\n|-\n| 3 June || The Progressive Republican Party was closed and abolished for supposedly exploiting religion for political purposes. Republican Peoples Party of the governing elites remains as the only political organization in the country. According to \"Takrir-i Sükun\" law, all opposition newspapers are also banned and closed indefinitely and the Turkish Republic becomes one of the first Interwar dictatorships in Europe.\n|-\n| 29 June || Sheikh Said and his 46 followers were sentenced to death in Diyarbakır.\n|-\n| 27 August || Mustafa Kemal (Atatürk) came to Kastamonu to initiate the Hat Revolution.\n|-\n| 1 September || The first Turkish Medical Congress was assembled.\n|-\n| 4 September || Turkish women entered a beauty contest for the first time.\n|-\n| 1 October || Atatürk opened the Bursa textile factory.\n|-\n| 5 November || Ankara Law School (then the Ankara University Faculty of Law) was opened.\n|-\n| 25 November || \"Hat Law\" was issued, abolishing religious dress.\n|-\n| 26 December || A law was passed which abolished the lunar calendar in favor of the international calendar.\n|-\n| rowspan=\"4\" valign=\"top\" | 1926 || 17 February || A Turkish civil code based on the Swiss Civil Code was accepted. The code granted expanded civil rights to women and prohibited polygamy.\n|-\n| 1 March || A Turkish criminal code was established based on the Italian Criminal Code.\n|-\n| 17 March || A law was passed to nationalize the iron industry.\n|-\n| 24 March || A law was passed to nationalize the petroleum industry.\n|-\n| rowspan=\"7\" valign=\"top\" | 1927 || 7 March || The extraordinary Independence Tribunals were abolished.\n|-\n| rowspan=\"2\" valign=\"top\" | 15 October || Mustafa Kemal Atatürk started his \"Nutuk\" speech.\n|-\n| The second nationwide congress of the Republican People's Party took place.\n|-\n| 20 October || The \"Nutuk\" speech ended.\n|-\n| 28 October || The first population census counted the population at approximately thirteen and a half million.\n|-\n| 27 November || Fifth cabinet by İsmet İnönü\n|-\n| 25 December || The first female Turkish lawyer, Süreyya Ağaoğlu, began her duty.\n|-\n| rowspan=\"3\" valign=\"top\" | 1928 || 10 April || The article \"The official religion of Turkey is Islam\" was removed from the constitution.\n|-\n| 19 May || A law establishing an engineering school was accepted.\n|-\n| 1 November || A new Turkish alphabet based on the Latin script was accepted.\n|-\n| rowspan=\"4\" valign=\"top\" | 1929 || 3 April || A new municipal law enabled women to enter municipal elections both as voters and as candidates.\n|-\n| 29 April || The first female Turkish judges were appointed.\n|-\n| 13 May || A trade law was accepted by the TBMM.\n|-\n| 1 September || Arabic and Persian courses were abolished replaced by Turkish-only language courses.\n|-\n| rowspan=\"6\" valign=\"top\" | 1930 || 11 June || A law was accepted which established the Turkish Republic Central Bank.\n|-\n| 12 August || The Free Republican Party, the third party in the republic, was established.\n|-\n| 27 September || Sixth cabinet by İsmet İnönü\n|-\n| 27 October || Greek prime minister Venizelos visited Mustafa Kemal Atatürk in Ankara.\n|-\n| 17 November || After the Free Republican Party's cooption by radical religious groups, its leader Fethi Okyar decided to close.\n|-\n| 30 December || Mustafa Fehmi Kubilay, a second lieutenant in the Turkish army, was killed in a reactionary uprising.\n|-\n| rowspan=\"5\" valign=\"top\" | 1931 || 16 March || The first female Turkish surgeon, Dr. Suat, received her specialty.\n|-\n| 26 March || The Measurements Law was accepted, abolishing the former Arabic length and weight measurement units and replacing them with the metric system (kilogram instead of okka, meter instead of endaze, etc.)\n|-\n| 20 April || Mustafa Kemal Atatürk historically declared the slogan \"Peace at home, peace in the world!\"\n|-\n| 4 May || Seventh cabinet by İsmet İnönü\n|-\n| 25 July || A new press law was accepted.\n|-\n| rowspan=\"4\" valign=\"top\" | 1932 || 18 July || Turkey became a member of the League of Nations.\n|-\n| 31 July || Turkish woman Keriman Halis Ece was declared the World Beauty Queen at a contest in Belgium.\n|-\n| 13 November || Dr. Müfide Kazim became the first female Turkish government physician.\n|-\n| 12 December || Adile Ayda became the first female Turkish civil servant in the Ministry of Foreign Affairs.\n|-\n| rowspan=\"6\" valign=\"top\" | 1933 || 7 February || The first Turkish-language mosque prayers began in Istanbul.\n|-\n| 31 May || The 480-year-old Darülfünun was abolished, to be converted into Istanbul University.\n|-\n| June || Sümerbank and Halkbank were established.\n|-\n| 26 October || Turkish women were granted the right to vote and be elected to Village Councils.\n|-\n| 18 November || Istanbul University was opened.\n|-\n| 1 December || The first five-year development plan was accepted.\n|-\n| rowspan=\"4\" valign=\"top\" | 1934 || 21 June || The Surname Law was accepted, abolishing the former titles of Bey, Effendi, Pasha, Sultan, and Hanım as of 26 November.\n|-\n| rowspan=\"2\" valign=\"top\" | 24 November || Mustafa Kemal Pasha took the surname Atatürk.\n|-\n| The Hagia Sophia mosque was converted to the Ayasofya (Hagia Sophia) Museum.\n|-\n| 5 December || Turkish women were granted the right to vote and be elected in Turkish parliamentary elections.  (Afterwards, in the first elections, 18 women were elected to the Turkish Grand National Assembly).\n|-\n| 1935 || 1 March || Eight cabinet by İsmet İnönü.\n|-\n| rowspan=\"2\" valign=\"top\" | 1936 || 29 May || A law determining the size and ratios of the star and crescent in the Turkish flag was accepted.\n|-\n| 8 June || A labor law was accepted which represented the first step towards the Turkish Social Security System.\n|-\n| rowspan=\"5\" valign=\"top\" | 1937 || 27 January || Hatay's independence was accepted by the League of Nations in its Geneva meeting.\n|-\n| 9 June || A law establishing a medical faculty in Ankara was accepted.\n|-\n| 20 September || Atatürk opened the first art gallery in his residence, the Dolmabahce Palace.\n|-\n| 9 October || Atatürk opened the Nazilli Printed Cloth Fabric Factory.\n|-\n| 25 October || Ninth cabinet by Celâl Bayar, former minister of Economy\n|-\n| || || Dersim Rebellion in 1937–1938 : The revolt had quashed by government.\n|-\n| 1938 || 10 November || The founder Mustafa Kemal Atatürk died.  He was succeeded by İsmet İnönü, former prime minister and general. He declares himself \"National Chief\" (Millî Şef), similar to the titles of some other dictators in Europe at the time.\n|-\n| rowspan=\"2\" valign=\"top\" | 1939 || || World War II: World War II began.  Turkey was to remain neutral for most of the war, until a declaration of war against Germany at its end.\n|-\n| 7 July || The Province of Hatay joined Turkey.\n|-\n| rowspan=\"2\" valign=\"top\" | 1950 || 14 May  || First Democratic Elections in Turkish Republic. General İsmet İnönü and his Republican People's Party, which had ruled the country since 1923, loses election to newly formed Democratic Party of Celâl Bayar and Adnan Menderes.\n|-\n|  25 June || Korean War: The Korean War began.  Turkey was a part of the joint UN operation.\n|-\n| || || Müfide İlhan mayor of Mersin. First ever woman mayor in Turkey.\n|-\n| 1952 || || Turkey became a NATO member country strategically important in countering Soviet influence.\n|-\n| 1953 || 27 July || Korean War: The war ended.\n|-\n| 1954 || || Turkey began to host the United States Air Force at the Incirlik Air Base as a deterrent to the Soviet Union.\n|-\n| rowspan=\"2\" valign=\"top\" | 1955 || 6 September || Istanbul Pogrom: The Istanbul Pogrom started the process of driving many Greeks and Christians from Turkey.\n|-\n| 7 September || Istanbul Pogrom: The pogrom drew to a close.\n|-\n| 1960 || 27 May || 38 officers of Army form a junta and organize the 1960 Turkish coup d'état. They claim the Islamists had gained influence in the government. After this clash over the \"separation of religion and state/government\" between İnönü's Republican People's Party and his opponents, democratically elected President Celâl Bayar and Prime Minister Adnan Menderes of Democratic Party, Prime Minister Adnan Menderes was held responsible by a kangaroo court selected by the junta and was executed with two of his ministers.\n|-\n| 1965 || 14 October || Military rule bowed out to civilian rule, and former  (National Chief) İsmet İnönü again loses a democratic election, this time to the Justice Party of Mr. Süleyman Demirel.\n|-\n| 1971 || 12 March || Military officials forced an advisory committee on the government due to the increasing anarchical situation caused by the Right (fascist/capitalist) – Left (communist) clash and ineffective policies in maintaining order. Although the military were not in charge they had significant influence.\n|-\n| 1974 || || Turkey invaded Cyprus in response to a Greek-backed coup on the island.\n|-\n| 1980 || 12 September || The 1980 ''coup d'état took place. Martial law was almost immediately established and a quarter of the military (about 475,000) were mobilised to settle the resistance to the coup.\n|-\n| 1983 || 6 November || After the establishment of a new 1982 Constitution, the military regime dissolved itself.\n|-\n| 1991 || || After the ending of the 1991 Persian Gulf War, the Incirlik Air Base enforced the northern no-fly zones in Iraq.\n|-\n| rowspan=\"2\" valign=\"top\" | 1999 || 24 March || Kosovo War: NATO interceded in the Balkans to end a civil war in the region.  Turkey was part of the mission.\n|-\n| 10 June || Kosovo War'': The war ended.\n|}\n21st century\n{| class=\"wikitable\" width=\"100%\"\n! style=\"width:6%\" | Year || style=\"width:10%\" | Date || Event\n|-\n| 2002 || June || Turkey assumed command of the International Security Assistance Force (ISAF) in Afghanistan.\n|-\n| 2003 || February || Turkey relinquished command of the ISAF.\n|-\n| 2004 || 17 December || The European Union (EU) agreed to begin negotiations on the eventual accession of Turkey.\n|-\n| rowspan=\"2\" valign=\"top\" | 2005 || 14 February || Turkey assumed command of the ISAF in Afghanistan for a second time.\n|-\n| 3 October || The European Union (EU) started accession talks with Turkey. The talks did not start at the desired time due to disagreements.\n|-\n| 2011 || 24 March || Turkey gave NATO the green light and allowed İzmir to become the command center of the operation to oust Muammar Gaddafi's regime in Libya.\n|-\n|2012 ||\n|\n|-\n|2013 || 17 December || A corruption scandal to topple the ruling AKP failed.\n|-\n| rowspan=\"3\" valign=\"top\" | 2014 ||  || Turkey starts designing and manufacturing its own national tank Altay, helicopter Atak and drone Anka for the first time.\n|-\n| 30 March || Local elections held with the ruling AK Party displaying an overwhelming victory, especially in the motherland of Anatolia.\n|-\n| 28 August || Then Prime Minister Recep Tayyip Erdoğan chosen as the first freely elected president of the nation.\n|-\n| 2016 ||  15 July\n|Alleged attempted coup and subsequent crackdowns and purge. Over 80,000 arrested or detained, 150,000 dismissed (nearing 10% of public employees).\n|-\n|2017\n|1 January\n|Istanbul nightclub shooting - At least 39 people were killed and 69 people were wounded in the Reina nightclub in Beşiktaş Istanbul.\n|-\n|2018\n|19 January\n|The Turkish Armed Forces launched its Olive Branch land and air operation in north-western Syria, capturing large areas which was under Kurdish control.\n|-\n|2018\n|18 April\n|2018 Turkish general election - President Recep Tayyip Erdogan announced that early elections will take place on 24 June.\n|-\n|2018\n|12 June\n|Presidents of Azerbaijan, Turkey, Georgia inaugurated Trans-Anatolian gas pipeline in the central city of Eskisehir, Turkey with the participation of Petro Poroshenko, and Aleksandar Vucic.\n|-\n|2018\n|19 October\n|The STAR refinery has been launched in Aliaga İzmir, Turkey.\n|-\n|2019\n|9 October\n|2019 Turkish offensive into north-eastern Syria\n|-\n|2020\n|11 March\n|Turkey has confirmed its first COVID-19 case, which was caused by the SARS-CoV-2. This was quickly followed by the rapid emergence of the COVID-19 outbreak in the country, which persists to this day.\n|}\nSee also\n* Outline of the Ottoman Empire\n* Timeline of the Ottoman Empire\n* Timeline of the Republic of Turkey\n* List of massacres in Turkey\n;Cities in Turkey\n* Timeline of Ankara\n* Timeline of Bursa\n* Timeline of Istanbul\nReferences\nBibliography\n*\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}