{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the Syrian civil war (September–December 2019)__disambig_1\n\nThe following is a timeline of the Syrian Civil War from September–December 2019. Information about aggregated casualty counts is found at Casualties of the Syrian Civil War.\nSeptember 2019\nMilitary Operations\nOn 10 September, the Syrian government began conducting aerial strikes against HTS controlled territory for the first time since August 31st. By 15 September, they had launched a total of 23 attacks against 18 different communities. recruits partake in an obstacle course during training, 22 September 2019]]\nOctober 2019\nOperation Peace Spring and U.S. withdrawal from northeast Syria\nIn October 2019, Turkey launched Operation Peace Spring amid a U.S. withdrawal. In response to the Turkish offensive, Russia arranged for negotiations between the Syrian government in Damascus and the Kurdish-led forces. Russia also negotiated a renewal of a cease-fire between Kurds and Turkey that was about to expire.\nThe US withdrawal caused major policy debate amongst US officials. Some officials asserted that they had advised the Kurds for some time to reach some understanding with Turkey. \"We did not give a military guarantee to the Kurds against Turkey...\" said James Jeffrey at a hearing on 22 October. \"In fact, much of our conversations with the Kurds [was] that you had to find some kind of political accommodation with Turkey because you couldn't count on us to keep the Turks out militarily.\"\nAmid the Turkish offensive and U.S. withdrawal, Kurdish-led Syrian Democratic Forces (SDF) commander-in-chief Mazloum Abdi announced that they were ready to partner with Russia and Bashar al-Assad's Syrian government, stating that \"... if we have to choose between compromises and the genocide of our people, we will surely choose life for our people.\" According to Syrian Kurdish officials, the deal allowed Syrian government forces to take over security in some border areas, but their own administration would maintain control of local institutions. Syrian troops entered some key towns in northeastern Syria, including Manbij, Tell Tamer, Kobanî, and Ayn Issa, and took up position in some areas to oppose Turkish troops that were threatening various Kurdish forces. The developments led to Kurdish concern that the independence of their declared Autonomous Administration of North and East Syria (NES) in Rojava might be severely curtailed.\nOn 15 October, Russian forces began patrolling along the contact line between Turkish and Syrian government forces in northeast Syria, filling the security vacuum created by the sudden U.S. withdrawal. Video footage showed Russian soldiers and journalists touring a base that the U.S. left behind. Alexander Lavrentiev, Russia's special envoy on Syria, warned that the Turkish offensive into Syria was unacceptable and stated that Russia was seeking to prevent conflict between Turkish and Syrian troops.\nRussia and Turkey made an agreement via the Sochi Agreement of 2019 to set up a Second Northern Syria Buffer Zone. Syrian President Assad expressed full support for the deal, as various terms of the agreement also applied to the Syrian government. Following the creation of the Second Northern Syria Buffer Zone the SDF stated that it was ready to merge with the Syrian Army if when a political settlement between the Syrian government and the SDF is achieved. The Syrian Democratic Council said it was ready to have positive discussions with the Assad government. They said their focus would shift to stopping the Turkish invasion.\nOn 30 October, the recently negotiated Syrian Constitutional Committee held its inaugural meeting.\nin Germany.]]\nNovember 2019\nIn November 2019, refugees in Northeast Syria reported they had received no help from international aid organizations.\nOn 20 November 2019, a new Syrian Constitutional Committee, with about 150 members, began discussing a new settlement and to draft a new constitution for Syria. The committee includes representatives of the Syrian government, opposition groups, and countries serving as guarantors of the process such as Russia. However, this committee has faced strong opposition from the Syrian government. 50 of the committee members represent the Assad government, and 50 members represent the opposition. The committee began working in November 2019 in Geneva, under UN auspices. However, the Syrian government delegation left on the second day of the process. Qah was struck by a ground-to-ground missile from the Syrian government with Russian and Iranian support. It killed at least 16 people. The United States strongly condemned the attack.\nOn 24 November, pro-government forces launched a new Idlib offensive, the largest offensive by the Syrian government in Idlib in more than three months.\n73 are killed and more than 172 are injured in the November 2019 Syria bombings.\nDecember 2019\nMilitary operations\nOn 2 December, air strikes carried out by Syrian government forces and Russia struck a fruit-and-vegetable market in Maarat al-Numan and another market in the area of Saraqib, in Idlib, killing at least 15 civilians.\nOn 7 December, in Idlib province, Russian air strikes killed at least nine people in an attack that hit a market in the village of Balyoun and another four people in a strike on the village of al-Bara. Five more people were killed in a barrel bomb attack by Syrian government helicopters on the village of Abdita. Barrel bombs killed two more people in the villages of Jebghas and Tel Minis. Eight children were among the dead.\nOn 19 December Syrian and its allies launched a military operation on Syrian opposition forces located in Idlib Governorate.\nWith the Syrian army advances on rebel-controlled territory and the encirclement of Turkish outposts, President Erdogan said that Turkish forces would not withdraw from any position.\nOn 23 December, Russian airstrikes hit the district of Maarat al-Numan, as well as a number of villages overnight in Idlib, killed at least nine civilians. Russian planes also targeted the routes Syrians took towards the Turkish border to escape the bombings on the residential area.\nOn 25 December, Syrian troops closed in on the town of Maaret al-Numan.\nOn 30 December 2019, the US launched air strikes in Syria against rebel groups allied with Iran.\nNew arrangements on the ground\nIt appeared that Turkey was withdrawing all of its forces away from the al-Shirkark silos, which hold important supplies of wheat, this seemed to be a result of Russian mediation. However, some reports said they later returned to re-occupy that area.\nRussia said it would pledge to remove Turkish forces from a key highway in northern Syria, and replace them with Russian forces to maintain stability. Russian and Turkish forces are continuing their joint patrols. Questions remained about how much control Turkey has over its proxies, such as the Syrian National Army.\nTurkey has begun to appoint local mayors and governors in several northern Syrian towns. They have also appointed about 4,000 police officers and other local officials, and are providing some basic local services for citizens.\nThere are some reports that Turkey has become more involved with local infrastructure in areas that it controls. Some local schools have been provided with some teachers and curriculum components. Erdogan said that Turkey expects to resettle about 1 million refugees in that a rea, and called for more support from the EU and from world organizations.\nSome protesters in Syria blamed Turkey for the latest Syrian attacks on Idlib. They claim that the rebel groups posted near Idlib are largely akin to mercenary groups answering to Turkey. It is unclear whether there is strong evidence for this allegation. Meanwhile, as Turkey considers sending some elements of these groups to Libya, it heightens such allegations.\nHumanitarian situation\nA major statement from NGO ACT Alliance found that millions of Syrian refugees remain displaced in countries around Syria. this includes around 1.5 million refugees in Lebanon. Also the report found that refugees in camps in north-eastern Syria have tripled this year. The UNHCR has also been tracking data on refugees, and maintains [https://data2.unhcr.org/en/situations/syria an official website] to do so.\nNumerous refugees remain in local refugee camps. Conditions there are reported to be severe, especially with winter approaching.\n4,000 people are housed at the Washokani Camp. No organizations are assisting them other than the Kurdish Red Cross. Numerous camp residents have called for assistance from international groups.\nOver 120,000 refugees were reported fleeing Idlib governorate. In December 2019, Erdogan stated that Syrian bombing of Idlib had caused new waves of refugees to enter Turkey, also stated that Turkey could not handle this new influx, and that this influx would be \"felt by all European countries\".\nThe UN said 235,0000 refugees have fled the area. Turkey is reaching out to Russia to try to mitigate the situation. Erdogan said he would ask for Russia's help in limiting the new wave of refugees. The Syrian Army is continuing to attack, with Russian air support.\nErdogan said that Turkey expects to resettle about 1 million refugees in the \"buffer zone\" that it controls. Erdogan claimed that Turkey had spent billions on approximately five million refugees now being housed in Turkey; and called for more funding from wealthier nations and from the EU. This plan raised concerns among Kurds about displacement of existing communities and groups in that area. SDF Commander Mazlum Abdi called on the US and Russia to help stop Turkey from displacing entire communities and ethnic groups from the areas that it controls.\nErdogan stated that Turkey was ready to resettle the Syrian refugees in the northern area that Turkey had invaded, and that Turkey would pay for it if necessary. On 9 December 2019, various local accounts indicated that Turkey was moving Syrian refugees into its zone of operations in Northern Syria for the first time. Erdogan said that Turkey was working to settle one million people in the cities of Tal Abyad and Ras Al-Ain in northern Syria. This has led to fears of population change Erdogan claimed that Turkey had spent billions on approximately five million refugees now being housed in Turkey; and also asserted that wealthier nations had done little to address the situation.\nThis issue caused discussion in Turkish society.\nIn December 2019, Erdogan stated that Syrian bombing of Idlib had caused new waves of refugees to enter Turkey. Erdogan stated that Turkey could not handle this new influx, and that this influx would be \"felt by all European countries\".\nOn 30 December 2019, over 50 Syrian refugees, including 27 children, were welcomed in Ireland, where they started afresh in their new temporary homes at the Mosney Accommodation Centre in Co Meath. The migrant refugees were pre-interviewed by Irish officials under the Irish Refugee Protection Programme (IRPP).\nUnited Nations dispute\nAs of December 2019, a diplomatic dispute is occurring at the UN over re-authorization of cross-border aid for refugees. China and Russia oppose the draft resolution that seeks to re-authorize crossing points in Turkey, Iraq, and Jordan; China and Russia, as allies of Assad, seek to close the two crossing points in Iraq and Jordan, and to leave only the two crossing points in Turkey active.\nAll of the ten individuals representing the non-permanent members of the Security Council stood in the corridor outside of the chamber speaking to the press to state that all four crossing points are crucial and must be renewed.\nUnited Nations official Mark Lowcock is asking the UN to re-authorize cross-border aid to enable aid to continue to reach refugees in Syria. He says there is no other way to deliver the aid that is needed. He noted that four million refugees out of the over eleven million refugees who need assistance are being reached through four specific international crossing points. Lowcock serves as the United Nations Under-Secretary-General for Humanitarian Affairs and Emergency Relief Coordinator and the Head of the United Nations Office for the Coordination of Humanitarian Affairs.\nRussia, aided by China's support, has vetoed the resolution to retain all four border crossings. An alternate resolution also did not pass. The US strongly criticized the vetoes and opposition by Russia and China.\nThe US Ambassador to the UN, Kelly Craft, said this opposition to these crossings would be \"disastrous.\"\nAn [https://www.state.gov/russian-federations-and-chinas-veto-of-unscr-2449-aid-to-syrian-refugees/ official statement by the US Government on the State Department website] stated this veto was \"shameful.\"\nErdogan said that Turkey expects to resettle about 1 million refugees in the \"buffer zone\" that it controls. Erdogan claimed that Turkey had spent billions on approximately five million refugees now being housed in Turkey; and called for more funding from wealthier nations and from the EU. This plan raised concerns among Kurds about displacement of existing communities and groups in that area.\nReconstruction efforts\nRussia is taking a leading role in assisting with efforts to rebuild infrastructure in Syria. In addition to efforts by the Russian government, several Russian companies have begun to take leading roles in economic rebuilding projects as well.\nPeace efforts\nIn general positive negotiations have increased between Syria and Turkey, and between Syria and Kurdish groups. On the ground, Turkish areas of operations had been delineated by Russian mediators. Russian military officials forged agreements between Syria, Turkey and Kurds for areas to be patrolled by each side. Russia handles security through its own forces deployed in some key towns. On 9 December, Russian troops entered Raqqa and began distributing humanitarian aid.\nAs a result of the Turkish incursion, multiple Kurdish groups that were once rivals have begun to seek greater unity. Additionally, Syrian Kurdish officials have had some positive discussions with the Assad government, and with local countries such as Saudi Arabia, UAE and Jordan. Various Kurdish faction that were historical rivals began to meet in order to work together more. Their stated reason was to stand together against Russia and Turkey more strongly if needed. The Russian government has informed the Kurdish factions that they should reconcile and come up with a unified set of demands to clarify to Russia. Various Kurdish factions blamed each other and their council for lack of progress.\nThe national Syrian government sent representatives to northeast Syria to meet with local groups there in order to address their concerns and to emphasize unity and combined effort to address problems. A meeting occurred in Qamishli city, in northeast Syria, that included Syrian national officials, and delegates from Kurdish, Arab, and Syrian figures and forces. Kurdish delegates emphasized their desire to help to protect Syria as a whole. They expressed willingness to have positive discussions with the Assad government. Some reports indicated that meetings between officials of the Assad government and leaders of local political factions went well, and all parties agreed on common goals to improve Syrian society as a whole. The SDF has shown some reluctance to integrate into the Syrian National Army as requested by the Assad government, though.\nLuqman Ehmê, spokesman for the North East Syria Autonomous Administration, said that his organization was ready for positive discussions with the Syrian government.\nSDF General Commander Mazlum Abdi has met with local leaders of the Wise Committee, which is composed of leaders of local communities and local family groupings. This meeting emphasized the importance on national unity, and the need to stand against Turkish invaders.\nThe M4 road to Aleppo was set to reopen, based on an agreement mediated by Russia with Turkey, Turkey's allies in Syria, and the SDF.\nIt was reported that the Russian and Turkish armies had made a deal whereby electricity would be supplied to Tal Abyad by Russia's allies, the Kurdish-led Syrian Democratic Forces (SDF) who now support Assad; while water would be supplied by the Alouk water station that is controlled by Turkish forces. This deal was mainly facilitated by Russian military officials.\nOn 12 December 2019, U.S. Defense Secretary Mark Esper said that Turkey's northern buffer zone had now \"stabilized\" the situation in northern Syria.\nDiplomatic developments\nAt a panel discussion on the conflict in December 2019, several experts said the conflict was slowly moving towards resolution. One expert said that the \"Astana\" diplomatic process, involving Turkey, Russia, and Iran, was having some positive results. Experts also said that Bashar Assad had made progress in restoring rule by local councils in areas affected by the conflict. In December 2019, the EU held an international conference which condemned any suppression of the Kurds, and called for the self-declared Automnomous Administration in Rojava to be preserved and to be reflected in any new Syrian Constitution. The Kurds are concerned that the independence of their declared Autonomous Administration of North and East Syria (NES) in Rojava might be severely curtailed.\nUS sanctions\nThe United States announced it will pass major new sanctions against Syria and Russia, as well as Iran, reportedly due to alleged war crimes committed during the civil war.\nThe US Congress has enacted punitive sanctions on the Syrian government for its actions during the Civil War. These sanctions would penalize any entities lending support to the Syrian government, and any companies operating in Syria. US President Donald Trump tried to protect the Turkish President Erdogan from the effect of such sanctions.\nSome activists welcomed this legislation. Some critics noted that these punitive sanctions are likely to backfire or have unintended consequences; i.e., instead of impeding or curtailing the Syrian government, it will increase its authority, as ordinary Syrian people will now have less economic resources due to these sanctions, and will need to rely on the Syrian government and its economic allies and projects even more.\nCritics said that such economic sanctions have little realistic chance of promoting real reform and democracy; their impact on the political ruling class will be limited, while they will likely affect ordinary Syrians disproportionately. Mohammed al-Abdallah, Executive Director of Syria Justice and Accountability Center (SJAC), said that the sanctions will likely hurt ordinary Syrian people, saying, \"it is an almost unsolvable unfeasible equation. If they are imposed, they will indirectly harm the Syrian people, and if they are lifted, they will indirectly revive the Syrian regime;\" he attributed the sanctions to \"political considerations, as the United States does not have weapons and tools in the Syrian file, and sanctions are its only means.\"\nAutonomous region of Rojava\nIn the Kurdish-led de facto Autonomous Administration in Northern and Eastern Syrian (NES) of Rojava, Kurdish opposition parties have refused to re-open their offices. They have cited a lack of trust in the regional government of Rojava.\nMeanwhile, officials of the NES held meetings with local Arab leaders, who stated that Kurdish forces are unfairly detaining women and children from their communities.\nDiplomacy with NATO member nations\nAt the NATO summit in London in December 2019, President Emmanuel Macron of France highlighted major differences with Turkey over the definition of terrorism, and said there was little chance this aspect of the conflict could be resolved positively. Macron criticized Turkey strongly for fighting against groups who had been allied with France and the West in fighting terrorism.\nNumerous issues in resolving the conflict emerged at the NATO summit in London. Turkey proposed a safe zone where Syrian refugees could be relocated, but this idea did not receive support from all parties. Prior to the NATO Summit, there was a meeting at 10 Downing Street of the leaders of France, the UK, Germany and Turkey. One key point that emerged that the Western countries insisted that refugees could only be relocated voluntarily. Meanwhile, there were concerns in NATO about Turkey's growing closeness with Russia.\nErdogan claimed that a four-way summit on Syria was scheduled to occur in Turkey in February 2020, to include Turkey, Germany, the UK and France.\nDiplomacy with nations outside NATO\nAt a meeting in Damascus, Russian and Syrian officials clearly stated their support for Syria regaining control over all of its territory. The United Arab Emirates also expressed official support for Assad.\nA new round of meetings for the Astana summit process took place in the Kazakh capital Nur Sultan. The meeting includes Russia, Syria, Turkey and Iran. At this meeting Russia, stated that the \"safe zone\" established by Turkey should not be expanded, as this would not accomplish anything positive for the region.\nThe Astana process was created by Turkey, Iran and Russia in order to find a lasting solution to the conflict. they have examined a process to reform the constitution of Syria via the newly-formed Syrian Constitutional Committee. The parties reported that they reached some important understandings at this meeting, including affirming a commitment to work together to respect Syrian territorial integrity. The United States has boycotted this process.\nSyrian Constitutional Committee\nAt the Astana Process meeting in December 2019, a UN official stated that in order for the third round of talks to proceed, co-chairs from the Syrian government and the opposition need to agree on an agenda.\nThe committee has two co-chairs, Ahmad Kuzbari representing the Syrian government, and Hadi Albahra from the opposition. It is unclear if the third round of talks will proceed on a firm schedule, until the Syrian government provides its assent to participate.\nArab League overtures to Syria\nThe Arab League has offered to allow Syria to rejoin as a member. They have stipulated two pre-conditions for doing so; firstly, that Syria distance itself from Iran, and, secondly that Syria implement UN Security Council resolution 2254, which calls for the a process to reform the Syrian Constitution, and then to hold an election to end the Syrian conflict.\nNotes\nExternal links\n* [https://data2.unhcr.org/en/situations/syria UN website]\nReferences"
    }
  ]
}