{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of ceratosaur research\n\n]]\nThis timeline of ceratosaur research is a chronological listing of events in the history of paleontology focused on the ceratosaurs, a group of relatively primitive, often horned, predatory theropod dinosaurs that became the apex predators of the southern hemisphere during the Late Cretaceous. The nature and taxonomic composition of the Ceratosauria has been controversial since the group was first distinguished in the late 19th century. In 1884 Othniel Charles Marsh described the new genus and species Ceratosaurus nasicornis'' from the Late Jurassic Morrison Formation of the western United States. He felt that it belonged in a new family that he called the Ceratosauridae. He created the new taxon Ceratosauria to include both the Ceratosauridae and the ostrich-like ornithomimids. The idea of the Ceratosauria was soon contested, however. Later that same decade both Lydekker and Marsh's hated rival Edward Drinker Cope argued that the taxon was invalid.\nThe idea of the Ceratosauria would regain some support more than thirty years later when Gilmore argued in its favor in 1920. Nevertheless, the validity of Ceratosauria was disputed throughout much of the 20th century by researchers like Romer, Lapparent, Lavocat, Colbert, and Charig. However, in 1986, more than a century after Marsh first coined the name, Jacques Gauthier revived the idea. Three years later, Rowe published a new definition of Ceratosauria, all taxa more closely related to Ceratosaurus than to birds, based on Gauthier's use of the term. This modern use of the term was thought to include the many theropods discovered since the 1880s known as coelophysoids. Ceratosaurus itself had loose joints between bones in the skull whose interpretation has been controversial. Paleontologist Robert T. Bakker has interpreted this condition as an adaptation to swallow prey larger than it would otherwise be able to fit through its jaws.\nSince the 1980s, major developments in ceratosaur taxonomy have centered on the discovery of the Abelisauridae, a new family of large ceratosaurs that were among the dominant predators of the southern hemisphere during the Cretaceous. One of the most notable of these was Carnotaurus, an unusual horned theropod with a short face. More recent noteworthy non-abelisaur ceratosaur discoveries include the protruding-toothed noasaurid Masiakasaurus knopfleri, named after the lead guitarist from Dire Straits.\n19th century\n1880s\n1884\n* Othniel Charles Marsh described the new genus and species Ceratosaurus nasicornis. He also erected the new family Ceratosauridae and named the Ceratosauria to include both Ceratosaurus and the Ornithomimidae.\n1887\n* Edward Drinker Cope described the new species Tanystrophaeus bauri. He also described the species Coelurus longicollis. He also described the species Tanystrophaeus willistoni. -->\n1888\n* Richard Lydekker rejected the validity of the Ceratosauria and Ceratosauridae.\n1889\n* Cope described the new genus Coelophysis to house the species Coelurus bauri. -->\n1890s\n1892\n* Cope rejected the validity of the Ceratosauria and Ceratosauridae.\n1896\n* Charles Depéret described the new species Megalosaurus crenatissimus, based mostly on vertebrae.\n* Marsh described the new genus and species Labrosaurus sulcatus.\n20th century\n1900s\n1901\n]]\n* Arthur Smith Woodward described the new genus and species Genyodectes serus.\n1903\n* Bradley interpreted the presence of \"noninterdigitating sutures and contacts\" between bones in ceratosaur skulls as evidence for the presence of \"a system of levers driven by jaw muscles to aid predation\" similar to those found in some modern reptile groups. -->\n1907 – 1908\n* Huene described the new genus and species Halticosaurus longitarsus. He also described the species Tanystrophaeus posthumus. -->\n1910s\n1910\n* Versluys interpreted the presence of \"noninterdigitating sutures and contacts\" between bones in ceratosaur skulls as evidence for the presence of \"a system of levers driven by jaw muscles to aid predation\" similar to those found in some modern reptile groups. -->\n1911\n* Talbot described the new genus and species Podokesaurus holyokensis.\n1913\n* Fraas described the new genus and species Procompsognathus triassicus. -->\n1913 – 1914\n* Jaekel described the new genus and species Pterospondylus trielbae. -->\n1919\n* Othenio Abel rejected the validity of the Ceratosauria and Ceratosauridae.\n1920s\n1920\n* Werner Janensch described the new genus and species Elaphrosaurus bambergi.\n* Charles Whitney Gilmore recognized the Ceratosauria and/or Ceratosauridae as valid.\n1921\n]]\n* Charles William Andrews described the new genus and species Sarcosaurus woodi.\n* Charles Alfred Matley described the new genus and species Lametasaurus indicus.\n1925\n* Janensch described the new species Ceratosaurus roechlingi. He also described the new species Labrosaurus stechowi.\n1930s\n1931\n* Hem Chandra Das Gupta described the new genus and species Orthogoniosaurus matleyi.\n1932\n* Von Huene described the new genus and species Laevisuchus indicus. He also described the new genus and species Coeluroides largus. He also described the new species Dryptosauruoides grandis. He also described the new genus and species Velocipes guerichi. He also described the new species Sarcosaurus andrewsi. Huene  recognized the Ceratosauria and/or Ceratosauridae as valid.\n1933\n* Von Huene and Matley described the new genus and species Indosaurus matleyi. They also described the new genus and species Indosuchus raptorius. They also described the new genus and species Jubbulpuria tenuis. They also described the new genus and species Ornithomimoides barasimlensis. They also described the new species O. mobilis.\n* Alfred Sherwood Romer rejected the validity of the Ceratosauria and Ceratosauridae.\n1934\n* Huene described the new species Halticosaurus liliensternus. He noted that at least two individuals of this species were preserved together. -->\n1936\n* Camp described the new genus and species Segisaurus halli. -->\n1948\n* Huene recognized the Ceratosauria and/or Ceratosauridae as valid. -->\n1950s\n1954\n* Welles described the new species Megalosaurus wetherilli. -->\n1955\nspecimen of M. crenatissimus'' (MNHN.MAJ 1), the right dentary of a subadult individual, Muséum national d'histoire naturelle, Paris.]]\n* René Lavocat erected the new genus Majungasaurus to house the species \"Megalosaurus\" crenatissimus, and designated a neotype specimen.\n* Albert-Félix de Lapparent and Lavocat rejected the validity of the Ceratosauria and Ceratosauridae.\n1956\n* Romer rejected the validity of the Ceratosauria and Ceratosauridae.\n* Von Huene  recognized the Ceratosauria and/or Ceratosauridae as valid.\n1960s\n1962\n* Frazzetta interpreted the presence of \"noninterdigitating sutures and contacts\" between bones in ceratosaur skulls as evidence for the presence of \"a system of levers driven by jaw muscles to aid predation\" similar to those found in some modern reptile groups. -->\n1963\n* Kuhn described the new genus Tanystrosuchus to house the species \"Tanystrophaeus\" posthumus. -->\n1964\n* Colbert rejected the validity of the Ceratosauria and Ceratosauridae.\n1966\n* Romer rejected the validity of the Ceratosauria and Ceratosauridae.\n1968\n* Iordansky interpreted the presence of \"noninterdigitating sutures and contacts\" between bones in ceratosaur skulls as evidence for the presence of \"a system of levers driven by jaw muscles to aid predation\" similar to those found in some modern reptile groups. -->\n1969\n* Raath described the new genus and species Syntarsus rhodesiensis. -->\n1970s\n1970  -->\n* Rodney Steel rejected the validity of the Ceratosauria and Ceratosauridae.\n1979\n\", a Majungasaurus snout bump originally mistaken for a pachycephalosaur skull dome]]\n* Hans-Dieter Sues and Philippe Taquet described the new genus and species Majungatholus atopus.\n* Alan Jack Charig rejected the validity of the Ceratosauria and Ceratosauridae.\n1980s\n1980\n* José Bonaparte and Jaime Powell described the new genus and species Noasaurus leali. They classified it in a new family, the Noasauridae.\n1984\n* Welles described the new genus Liliensternus to house the species Halticosaurus liliensternus. Welles rejected the idea that the presence of \"noninterdigitating sutures and contacts\" between bones in ceratosaur skulls was evidence for the presence of \"a system of levers driven by jaw muscles to aid predation\" similar to those found in some modern reptile groups. Instead he thought that the loose joints in the skull of ceratosaurs like Dilophosaurus, such as the weak connection between its premaxilla and the rest of its skull, were a sign of structural weakness that precluded the animal from hunting live prey. He also noted that the type specimen had been preserved with two others of the same species. -->\n1985\n]]\n* Bonaparte and Fernando Emilio Novas described the new genus and species Abelisaurus comahuensis.\n* Bonaparte described the new genus and species Carnotaurus sastrei.\n1986\n* Robert T. Bakker thought the loose joints in the skull of Ceratosaurus was an adaptation allowing it to swallow prey that would otherwise be too large.\n* Ricardo Martínez and others described the new genus and species Xenotarsosaurus bonapartei.\n* Gauthier \"resurrected the name Ceratosauria\" to apply to the sister group of the tetanuran theropods. However, while he listed the members of his Ceratosauria, he did not propose a formal phylogenetic definition.\n1989\n*  He reported that at least three individuals of this species were found preserved together in a single mass burial. --> Rowe formally defined the Ceratosauria as theropods more closely related to Ceratosaurus nasicornis than birds, based on Gauthier's 1986 usage of the term.\n-->\n1990s\n]]\n]]\n1990\n* Rowe and Gauthier published a node-based definition of Ceratosauria.\n1991  -->\n* Jean Le Loeuff and Eric Buffetaut described the new genus and species Tarascosaurus salluvicus.\n* Bonaparte described the new genus and species Velocisaurus unicus.\n* Novas regarded the Ceratosauria as consisting of two sister groups, the Coelophysoidea and their sister group, the Neoceratosauria.\n1993 * Cuny and Galton described the new species Liliensternus airelensis. -->  1994\n* Thomas Holtz named the Coelophysoidea, then thought to be ceratosaurs. He defined them as all theropods more closely related to Coelophysis than to Ceratosaurus. Holtz defined the Neoceratosauria as all theropods closer to Ceratosaurus than to Coelophysis. He also defined the ceratosaur subclade Abelisauroidea as all theropods closer to Carnotaurus sastrei than to Ceratosaurus nasicornis.\n-->\n1995\n* Hugues Accarie and others described the new genus and species Genusaurus sisteronis.\n1996\n* Bonaparte described the new genus and species Ligabueino andesi.\n* Sankar Chatterjee and Dhiraj Kumar Rudra observed that abelisaur teeth had lower crowns than other carnivorous dinosaurs either within or outside of Ceratosauria.\n1998\n-->\n* Coria and Leonardo Salgado described the new genus and species Ilokelesia aguagrandensis.\n* Sereno redefined Ceratosauria as all neotheropods closer to Coelophysis bauri than to birds. However, this definition never received broad acceptance by the scientific community because the Rowe had already defined the group in 1989, and therefore had priority. He also split the Abelisauridae into two subfamilies; the Abelisaurinae (all abelisaurids more closely related to Abelisaurus than to Carnotaurus) and Carnotaurinae (all abelisaurids more closely related to Carnotaurus than to Abelisaurus).\n-->\n* Sampson and others described a more complete specimen of Majungatholus atops. They performed an X-ray CT scan of the skull of Majungatholus atopus. They found that the dome on the animal's skull formed of its frontal bone was actually hollow. This suggests that this structure was purely for display rather than used in fights between Majungatholus.\n1999\n* Sullivan and Lucas described the new genus and species Eucoelophysis baldwini. -->\n21st century\n2000s\n]]\n2000\n* Madsen and Welles described the new species Ceratosaurus dentisulcatus and C. magnicornis.\n2001  -->\n* Sampson, Carrano, and Forster described the new genus and species Masiakasaurus knopfleri. They noted that at least six individuals were preserved together. This makes Masiakasaurus the first neoceratosaur to be preserved in association with others of its species.\n2002\n]]\n* Coria, Chiappe, and Dingus described the new genus and species Aucasaurus garridoi.\n* Kellner and Campos described the new genus and species Pycnonemosaurus nevesi.\n2003\n* Wilson and others described the new genus and species Rajasaurus narmadensis.\n2004\n* Calvo, Rubilar-Rogers and Moreno described the new genus and species Ekrixinatosaurus novasi.\n* P. C. Sereno, J. A. Wilson, and J. L. Conrad described the new genus and species Rugops primus as well as the new genus Spinostropheus.\n2006\n* Malkani described the new genus and species Vitakridrinda sulaimani.\n]]\n2007\n* Allain and others described the new genus and species Berberosaurus liassicus.\n2008\n* Sereno and Brusatte described the new genus and species Kryptops palaios.\n* Canale and others described the new genus and species Skorpiovenator bustingorryi.\n2009\n* Xu and others described the new genus and species Limusaurus inextricabilis.\n2010s\n]]\n2010\n* M. D. Ezcurra, F. L. Agnolin, and Novas described the new genus and species Austrocheirus isasii.\n* Novas and others described the new genus and species Rahiolisaurus gujaratensis.\n2012\n* Pol and Rauhut described the new genus and species Eoabelisaurus mefi.\n2013\n]]\n* Farke and Sertich described the new genus and species Dahalokely tokana.\n* Tortosa and others described the new genus and species Arcovenator escotae.\n2014\n* Sánchez-Hernández and Benton described the new genus and species Camarillasaurus cirugedae.\n* Sebastian G. Dalman described the new genus and species  Fosterovenator.\n2016\n* Filippi and others described the new genus and species  Viavenator exxoni.\n2017\n* Longrich and others described the new genus and species Chenanisaurus barbaricus.\n2018\n* Dal Sasso and others described the new genus and species Saltriovenator zanellai.\n* Delcourt and Iori described the new genus and species Thanos simonattoi.\n2019\n* Partially preserved ilium of an indeterminate abelisaur theropod is reported from the Upper Cretaceous Kem Kem Beds (Morocco) by Zitouni et al. (2019).\n* Langer and others described the new genus and species Vespersaurus paranaensis.\n2020s\n2020\n* Cerronia and others described the new genus and species Tralkasaurus cuyi''.\nSee also\n* History of paleontology\n** Timeline of paleontology\n*** Timeline of coelophysoid research\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}