{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Quebec history (1982–present)\n\n}}\nThis section of the Timeline of Quebec history concerns the events between patriation of the British North America Act and the present day.\n1980s\n*1982 - Led by Prime Minister Pierre Trudeau, the Canadian government moves to patriate the constitution on April 17\n*June 9 – Following a court challenge to parts of Bill 101 (the French language law of the Province of Quebec), the Supreme Court of Canada rules them unconstitutional.\n*1982 - On July 13, Montreal's Olympic Stadium hosts the Major League Baseball All-Star Game, the first time it is held outside the United States.\n*1984 - Deranged federalist former soldier Denis Lortie goes on a shooting spree at the National Assembly on May 8 with the intention to kill René Lévesque.  The assembly is not in session; however, there are 3 deaths and 9 injured.\n*1984 - Pierre Trudeau resigns as Prime Minister of Canada after taking a \"walk in the snow\" to think it over.\n*1984 - John Turner succeeds Trudeau as Prime Minister of Canada, only to be defeated three months later by Brian Mulroney.\n*1984 - Brian Mulroney, born in Baie-Comeau, Quebec, is elected Prime Minister of Canada.\n*1984 - René Lévesque accepts the beau risque of constitutional negotiations with the new Mulroney government.  This leads to a serious split within the Parti Québécois.\n*1985 - Exhausted by infighting within his party, René Lévesque resigns as premier and leader of the Parti Québécois.\n*1985 - Quebec general election: Liberals win.\n*1987 - The Meech Lake Accord is agreed to by federal and provincial governments.  However, it was never ratified.\n*1987 - René Lévesque dies.\n*1987 - July 14, Montreal is completely paralyzed by the heavy downpour of a series of thunderstorms during the Montreal Flood of 1987.\n*1988 - Canada-U.S. Free Trade Agreement is negotiated, with broad support from both sides of the political spectrum in Quebec.\n*1989 - A geomagnetic storm in northern Quebec causes a nine-hour blackout in parts of province on March 13.  Owing to a ripple effect in the transmission lines that feed Quebec-produced energy to New York State, ultimately to New York City; and combined with a number of localised problems there and in neighbouring New Jersey and Long Island, the storm hundreds of miles away in the wilds of northern Quebec also ends up blacking out New York City for several hours.\n*1989 - Quebec general election: Liberals are re-elected.\n*1989 - École Polytechnique massacre on December 6.\n1990s\n*1990 - The Oka Crisis.\n*1990 - Angered by the imminent collapse of the Meech Lake Accord, Lucien Bouchard resigns as member of Parliament and cabinet minister in the Mulroney government and founds the Bloc Québécois.\n*1990 - The Meech Lake Accord collapses as it fails to win unanimous ratification by the deadline.  Support for Quebec sovereignty rises to high levels.\n*1991 - The Canadian government introduces the unpopular Goods and Services Tax (GST).\n*1991 - June 20: Bill 150 is passed, providing for a referendum on sovereignty in 1992; if passed by 50% plus 1 vote, it would lead to a unilateral declaration of independence. (The bill was later canceled and replaced by a referendum on the Charlottetown Accord)\n*1992 - August 13: former Equality Party Member of the National Assembly of Quebec (MNA) Richard Holden joins the Parti Québécois\n*1992 - October 26: Country-wide referendum on the Charlottetown Accord. The accord is rejected by the population of Canada and also specifically by the population of Quebec.\n*1993 - Brian Mulroney resigns as Prime Minister of Canada on February 24.\n*1993 - The Montreal Canadiens win the Stanley Cup for the 24th time, defeating the Los Angeles Kings in five games, clinching the Cup at the Forum June 9. As of 2024, it is the last time a Canadian franchise has won the Stanley Cup.\n*1993 - Jean Chrétien, born in Shawinigan, Quebec, is sworn in as Prime Minister of Canada.\n*1993 - The North American Free Trade Agreement (NAFTA) goes into effect.\n*1994 - After almost 40 years of preparation the new Civil Code of Quebec comes into effect on January 1.\n*1994 - The Montreal Expos hold Major League Baseball's best record of 74-40 when the remainder of the regular season and the entire postseason is wiped out by a players' strike which begins August 12 and will last 232 days.\n*1994 - Quebec general election: The Parti Québécois elected to office, led by Jacques Parizeau.\n*1995 - The Quebec Nordiques move to Denver and are renamed the Colorado Avalanche. The Nordiques played their final game at Colisee de Quebec on May 14, and are eliminated from the playoffs two nights later by the New York Rangers.\n*1995 - October 24, the James Bay Cree hold their own referendum on whether or not their territory should remain a part of Canada. Over 96% of the Cree vote in favour of retaining the relationship with Canada.\n*1995 - On October 30, another referendum on sovereignty is held. For the second time, the measure is rejected, this time by a slim margin of slightly more than one percent. See 1995 Quebec referendum.\n*1995 - Following the defeat of the sovereigntist option, Jacques Parizeau resigns and is replaced by the head of the federal Bloc Québécois, Lucien Bouchard.\n*1996 - The Montreal Canadiens play their final game at the Forum on March 11, defeating the Dallas Stars 4-1. Five days later, their new arena, the Molson Centre (now Bell Centre), opens with a 4-2 victory vs. the New York Rangers.\n*1996 - Severe flooding in the Saguenay region from July 18–21 devastates the region and proves to be one of Canada's costliest natural disasters.\n*1996 - Jean-Louis Roux briefly becomes Lieutenant-governor of Quebec, but resigns after less than two months due to his now-regretted antisemitic political activity during World War II.\n*1996 - Death of Robert Bourassa on October 2.\n*1997 - An amendment to the Constitution provides for linguistic rather than confessional (Catholic and Protestant) school boards in Quebec.\n*1998 - A severe ice storm strikes Montreal and southwestern Quebec in early January, leaving parts of Montreal without power for up to a week; destruction of power lines and pylons leaves a \"triangle of darkness\" south of Montreal without power for three weeks.\n*1998 - Quebec general election: Parti Québécois is re-elected.\n*1999 - The Clarity Act becomes a federal law.\n2000s\n*2000 - September 28 - Pierre Elliott Trudeau dies\n*2000 - December 5 -  Beginning of the Michaud Affair.\n*2001 - Discouraged at the lack of support for sovereignty among the population and a fractious PQ caucus, Lucien Bouchard resigns as Premier of Quebec and retires from public life on January 11.\n*2001 - Rhéal Mathieu, who was a member of the former Front de libération du Québec is convicted of the attempted firebombing of three Second Cup coffee shops in Montreal. Quebec Second Cup cafes took the name of Les cafés Second Cup afterwards.\n*March 8 - Following the resignation of Lucien Bouchard, Bernard Landry becomes premier of Quebec.\n*2001 - In April, Quebec City hosts the Summit of the Americas, attracting huge anti-globalization protests with activists from everywhere in the Americas. Simultaneously held is the Peoples Summit of the Americas.\n*2002 - The merger of numerous cities and their suburbs (municipal fusions) into \"megacities\" goes into effect, creating the new megacities of Montreal, Longueuil, Quebec City, Lévis, Saguenay, Sherbrooke, and Gatineau among others.\n*2002 - The Action démocratique du Québec wins four by-elections and temporarily enjoys high scores in public opinion polls.\n*2003 - March: a court ruling legalizes same-sex marriage in Quebec.\n*2003 - Quebec general election: April 14, Jean Charest, a strong federalist and leader of the Quebec Liberal Party, becomes premier of Quebec.\n*2003 - In December, through an initiative by Quebec Premier, Jean Charest, the Council of the Federation is formed by the Premiers of all Canadian provinces and territories.\n*2003 - Paul Martin becomes Prime Minister of Canada.\n*2003 - The sponsorship scandal erupts, possibly tarnishing the Jean Chrétien legacy.\n*2004 - Demerger referendums: Many of the cities created in 2002 are again divided.  This includes many small municipalities in the western part of the island of Montreal.\n*2004 - The Montreal Expos play their final game in Canada on September 29, and their last representing Montreal on October 3 in New York City. The franchise relocates to Washington, D.C. prior to the next season and is renamed the Washington Nationals.\n*2005 - Bernard Landry, who resigned as leader of the Parti Québécois in June, is replaced by 39-year-old André Boisclair after the leadership election of 2005.\n*2006 - Stephen Harper's Conservative Party of Canada form minority government. Conservatives greatly reduce Liberal domination of the federalist vote in Quebec and take 10 new seats, mostly from the Bloc in Quebec City area.\n*2006 - Dawson College shooting\n*2007 - The small town of Hérouxville publishes a code of conduct for immigrants, stirring up a debate on reasonable accommodation.\n*2007 - Quebec general election, Liberals elected as a minority government. ADQ becomes official opposition. Parti Québécois reduced to third-party status. Pauline Marois becomes leader of the party in June.\n*2007 - The Bouchard-Taylor commission is appointed to inquire into reasonable accommodation in Quebec. Hearings are held throughout the province.\n*2007 - Régis Labeaume is elected mayor of Quebec City in a special election following the sudden death of popular mayor Andrée Boucher in August.\n*2008 - Quebec City celebrates the 400th anniversary of its founding by Samuel de Champlain.\n*2008 - Federal election 2008 brings in another Conservative minority government.\n*2008 - Quebec general election, The Quebec Liberal Party narrowly forms a majority government. The Parti Québécois climbs back to become the official opposition and the ADQ falls far behind the Parti Québécois.\n*2008 - The report of the Bouchard-Taylor commission is presented. Quebec is advised to define its secular nature to improve relations between the white, French-speaking majority and the province's ethnic minorities.\n*2009 - In November's municipal elections, Gérald Tremblay is re-elected as mayor of Montreal, Régis Labeaume as mayor of Quebec City and Gilles Vaillancourt as mayor of Laval.\n2010s\n*2011 - The Conservative Party of Canada achieves a majority government in the May federal election. Quebec is overtaken by the orange wave under a surging New Democratic Party, which wins 59 of the 75 federal seats in a province where it had previously had only one, and reduces the Bloc Québécois from 49 seats to 4.\n*2011 - NDP leader Jack Layton dies in August.\n*2011 - Formation of the Coalition Avenir Québec under François Legault, bringing together some ADQ members and some disillusioned members of the Parti Québécois.\n*2011 - Under pressure, Jean Charest creates the Charbonneau commission to investigate corruption in the management of public construction contracts.\n*2012 - University students protest and stop a proposed tuition increase.\n*2012 - The ADQ formally merges into the CAQ and ceases to exist as a party.\n*2012 - The NDP choose Quebecer Thomas Mulcair as leader at a convention in March.\n*2012 - Major student demonstrations against tuition increases widen as many non-students express general popular dissatisfaction with the Charest government.\n*2012 - The Charbonneau commission hears its first testimony in June.\n*2012 - Quebec general election, the Parti Québécois forms a minority government. During the victory party that night, a gunman tries to gain access to the venue and shoots two stagehands, killing one of them. Jean Charest steps down as Quebec Liberal Party leader the day after the election.\n*2012 - Montreal mayor Gérald Tremblay and Laval mayor Gilles Vaillancourt step down in response to revelations at the Charbonneau commission.\n*2012 - Montreal councillors elect Michael Applebaum to serve as mayor for the year that remains before the November 3, 2013 municipal elections. Laval councillors elect Alexandre Duplessis to serve as their interim mayor.\n*2012 - Ground is broken for a major new hockey arena in Quebec City, although no NHL team has shown interest in relocating there. Quebec City last had an NHL team in 1995.\n*2013 - Quebec City area MNA Philippe Couillard is elected head of the Quebec Liberal Party.\n*2013 - Montreal MP Justin Trudeau is elected head of the federal Liberal Party.\n*2013 - Michael Applebaum is arrested and indicted with 14 charges including fraud and corruption. He steps down. Montreal councillors elect Laurent Blanchard to serve as mayor for the four months remaining before the municipal elections.\n*2013 - Laval ex-mayor Gilles Vaillancourt is charged with gangsterism. Alexandre Duplessis steps down as Laval's interim mayor after allegations he had solicited prostitutes. The new interim mayor is Martine Beaugrand.\n*2013 - The derailment of a runaway train carrying crude oil in the centre of Lac-Mégantic, a town in eastern Quebec, kills 47 and destroys at least 30 buildings, including the town library and archives, a popular bar and live music venue, and other businesses and houses.\n*2014 - The 41st Quebec general election was held on April 7, 2014 to elect members to the National Assembly of Quebec.\n*2017 - Valérie Plante becomes first female mayor of Montreal.\n*2017 - A Quebec City mosque was the subject of a mass shooting. There were six deaths and numerous others injured.\n*2018 – The 42nd Quebec general election was held on October 1, 2018 and elected, for the first time, a CAQ majority.\n*2019 – The Act Respecting the Laicity of the State is passed.\n2020s\n*2020 - The COVID-19 pandemic begins and goes on to cause economic disruptions, lockdowns and curfews. Roughly 12,000 Quebecois are killed by the virus.\n*2021 - Vaccine passports for COVID-19 are instated.\n*2022 - the provincial legislature passed An Act respecting French, the official and common language of Québec. This act expanded the requirement to speak French in many public and private settings and reinforced French as the language of legislation, justice, civil administration, professional orders, employers, commerce and business, and educational instruction.\n*2022 - The CAQ wins a huge majority in the 2022 Quebec general election.\nReferences\nSee also"
    }
  ]
}