{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Belfast history\n\nThis article is intended to show a timeline of the history of Belfast, Northern Ireland, up to the present day.\nPre-Historic\n* Ice Age – peoples from Alba (modern Scotland) cross the frozen Irish Sea and began populating Ireland via Ulster. These inhabitants would later be supplanted or assimilated by the Gaels.\n* Iron Age – c. 1300 BC the first permanent settlements develop in Ireland. The Giant's Ring and McArt's Fort are both constructed on sites near modern Belfast.\n500–1099\n* c. 500 – The village of Béal Feirste is part of the area of Ulster that is in the kingdom of Dál Riata (until c. 700 AD)\n* 665 – A battle is fought between clans at the Ford of Belfast\n1100–1399\n* 1177 – The village of Belfast comes under the ownership of John de Courcy after acquiring land in Ulster with the Norman victory at the Battle of Downpatrick. De Courcy would order castles to be built in Belfast and nearby Carrickfergus.\n* 1306 – First mention of the chapel on the Ford of Belfast in the papal taxation rolls\n* 1315 – Edward Bruce invades Ulster and receives homage from his father-in-law, the Earl of Ulster, as \"King of Ireland\". Edward is later killed at the Battle of Faughart in 1318.\n1400–1599\n* 1503 – The Earl of Kildare declares the fortification on the former site of Belfast Castle illegal and has it pulled down.\n* 1512 – Earl of Kildare has a structure built by the public on the site of Belfast Castle demolished.\n* 1534 – Henry VIII splits England from the Roman Catholic Church with the First Act of Supremacy, opening the door for Protestantism.\n* 1542 – Henry VIII has the Irish Parliament declare him King of Ireland effectively unifying Ireland for the first time as one political entity.\n* 1552 – Belfast Castle is rebuilt and fortified by Sir James Croft, Lord Deputy of Ireland, and put under the command of Hugh Mac Neil Og.\n* 1555 – Hugh Mac Neil Og is killed by Scottish raiders and command of Belfast Castle is granted to Randolphus Lane.\n* 1571 – Belfast Castle and surrounding lands are granted to Sir Thomas Smith by Elizabeth I during the Enterprise of Ulster.\n* 1573 – The 1st Earl of Essex pledges to conquer territory in Ulster at his own expense but is diverted by a storm when his convoy leaves Liverpool and is forced to winter in Belfast.\n* 1574 – Gaelic lord  Sir Brian MacPhelim and his entourage are lured to Belfast Castle by the Earl of Essex under the pretense of negotiations and a feast. They are betrayed and captured and eventually sent to Dublin where they are executed.\n* 1597 – The beginning of the Nine Years War that saw the English garrison in Belfast Castle captured and executed by Ulster Rebels. The uprising would go on to devastate areas of Ireland including the Lagan Valley.\n* 1598 – Sir John Chichester, who's lands include Belfast, is killed in the Battle of Carrickfergus. His brother, Sir Arthur Chichester, acquires his holdings in Carrickfergus, Belfast and the Lagan Valley.\n1600–1699\n* 1603 – Conn O'Neill and his men are arrested after a skirmish with English soldiers en route to Belfast. O'Neill was attempting to acquire wine in Belfast after running out during a feast in Castlereagh. O'Neill would later escape after being imprisoned in Carrickfergus Castle and receive a pardon from James I for his daring.\n* 1605 – Arthur Chichester is appointed Lord Deputy of Ireland by James I, an office he will hold for a decade. Chichester sets out to develop Belfast into a town by hiring craftsman from Britain and having millions of bricks fired for construction. The small population of Belfast at this time consists of Scots, English and Manx.\n* 1606 – Migration begins from lowland Scotland to Ulster with the encouragement of Hugh Montgomery.\n* 1607 – Flight of the Earls sees the self-imposed exile of Gaelic lords of the O'Neill and O'Donnell clans who leave Ulster in a power vacuum. James I decides to re-distribute the land and make the migration from Britain to Ulster royal policy resulting in the Plantation of Ulster. Overwhelming response comes from lowland Scotland to eastern Ulster and the demographic shift sees the advent of Ulster-Scots people.\n* 1611 – The last version of Belfast Castle on its original site is completed on the order of Arthur Chichester.\n* 1613 – Chichester is elevated to the Peerage of Ireland and granted the title Baron Chichester.\n* 1613 – Belfast is constituted as a corporation of a sovereign and given twelve burgesses and a commonalty with two representatives in Parliament.\n* 1636 – Henry Lesley, Bishop of Down, summons Church of Ireland ministers to a meeting in Belfast and rebukes them on 10 August for being influenced by Presbyterianism from Scottish migrants.\n* 1640 – Thomas Wentworth, then Lord Deputy of Ireland, purchases Carrickfergus' trade monopolies and endows them on Belfast. The Customs House is also moved to Belfast, effectively redirecting trade from Carrickfergus to Belfast.\n* 1641 – Catholics revolt in the 1641 Rebellion and the rebels gain control of most of the province of Ulster. Large numbers of protestants are killed and sectarian fighting breaks out nationally. This develops into the Irish Confederate War which continues until the Cromwellian conquest of Ireland.\n* 1644 – Scottish commander Robert Monro, when given command of English and Scottish forces in Ulster, seizes Belfast. He later refuses to cede it to George Monck, the commander chosen by the English Parliament after its victory in the First English Civil War. Monro is eventually taken prisoner in 1648.\n* 1667 – Belfast produces half of Ireland's supply of butter, which is heavily used by the Irish. Butter is also sold at a premium in Europe, with the Dutch paying the highest prices and the French ordering the largest quantities.\n* 1688 – James II is deposed by Parliament in favour of his son-in-law and daughter, William of Orange and Mary, who are crowned co-monarchs as a result of the Glorious Revolution.\n* 1689 – Belfast is seized by Ulster Protestants during an uprising against James II. Belfast is then captured without a fight following the Break of Dromore by Richard Hamilton and his mainly Catholic Irish Army. Later that same year, a large Williamite expeditionary force arrives in Belfast Lough and lays siege to Carrickfergus. Belfast is captured by a Williamite detachment led by Henry Wharton after the Jacobites abandon the town without resistance.\n* 1690 – William of Orange arrives in Belfast, where surprised onlookers stare in silence, until cheering breaks out. A representative from the Belfast Corporation implores William to \"pull the stiff neck of every papist down.\" William responds in broken English that he \"came to see the people of Ireland settled in a lasting peace.\" On 12 July, Williamite forces defeat the Jacobite army at the Battle of the Boyne. James II flees the field and goes into exile in France.\n* 1691 – Final Williamite victory in Ireland at the Battle of Aughrim results in the Treaty of Limerick ending the Williamite War in Ireland.\n* 1691 – More Penal Laws begin to be passed which restrict the religious, political and economic activities of Catholics, 'dissenters' of other Protestant denominations, and members of other religions, in order to formalise the Protestant Ascendency in Ireland.\n1700–1799\n* 1700s – Ulster industrialises and Belfast grows to become a major producer of linen and other goods.\n* 1708 – Belfast Castle is destroyed by fire on 25 April. The land is repurposed for other use.\n* 1737 – The city's first newspaper, the Belfast News Letter is established.\n* 1740 – Belfast is affected by the Great Frost and subsequent drought that hits Ireland.\n* 1759 – Population of Belfast is estimated to be 8,000.\n* 1771 – Aggrieved by high rents and evictions, 1,200 men from the Protestant Hearts of Steel gang surround Belfast Barracks demanding the release of a farmer imprisoned there. They are fired upon by the garrison, resulting in violence, rioting and arson. The Sovereign (mayor) of Belfast releases the prisoner, fearing further destruction. The revolt spreads to mid-Ulster, the group joining forces with Armagh's Hearts of Oak. The Irish Parliament passes a special act and sends troops into Ulster to put down the unrest.\n* 1778 – During the American Revolution, a privateer ship called \"The Ranger\", captained by John Paul Jones, appeared in Belfast Lough on 28 April. The American ship engaged and captured the Royal Navy vessel stationed there, HMS Drake, prompting the Sovereign of Belfast to write to Dublin Castle for military assistance. When none materialized, the men of Belfast formed their own independent militia called it the Volunteer Corps. This force would later put pressure on the Dublin Parliament to reform.\n* 1780 – Political debate in Belfast led by Ulster Presbyterians effected by the Penal Laws and inspired by the Scottish Enlightenment discusses reforms in Ireland including the full enfranchisement of Irish Catholics.\n* 1783 – Belfast sends delegates to the Irish Parliament in Dublin in an attempt to give Catholics voting rights but fail.\n* 1784 – At a convention for the Volunteer Corps, Belfast members defied all the other Irish brigades and declared that they would allow Catholics to join their ranks.\n* 1784 – St. Mary's in Chapel Lane holds its first mass on 30 May The chapel was built with funds raised by Protestant businessmen to accommodate the increasing population of Catholics migrating from west Ulster to Belfast. The mostly Presbyterian 1st Belfast Volunteer Company paraded to the chapel yard and gave the parish priest a guard of honour, with many Belfast Protestants present to celebrate the event. The Roman Catholic population of Belfast was only around 400 at the time.\n* 1784 – Plans are drawn up for the White Linen Hall (now the site of Belfast City Hall) along with new modern streets (now Donegall Square and Donegall Place).\n* 1786 – The River Farset is covered over to create High Street, and the ford across the Lagan is removed.\n* 1788 – Construction of the Linen Hall Library is completed.\n* 1788 – Construction of Donegall Square and Donegall Place is completed.\n* 1789 – Upon learning of the first waves of uprising in France, the Belfast Newsletter publishes an editorial praising the actions and ideals of what would become the French Revolution.\n* 1790 – Inspired by the events the French Revolution, a movement led by Presbyterians lobbies the Irish Parliament for reform; the Northern Whig party is formed.\n* 1792 – The Belfast Harp Festival takes place with the aim of reviving Irish traditional music.\n* 1793 – The United Irishmen split over the Reign of Terror in France with some condemning the violence and others applauding the action to further revolution.\n* 1795 – After being implicated in treasonous activity, Theobald Wolfe Tone and his family stay in Belfast before being sent into exile in America. Tone and his compatriots climb Cave Hill where they vow that they would not rest until Ireland was free from the \"British yoke\". Tone's Belfast Presbyterian supporters raised funds to buy his family a small tobacco farm in New Jersey.\n*1796 – A French armada carrying over 45,000 men attempts to land in Ireland but is prevented by bad weather. The United Irishmen and Catholic Defenders were sensationalised by the attempted French invasion and their recruitment doubled in Ulster the following year.\n*1797 – The British Government attempts to disarm militias in Ulster with General Lake declaring martial law, ordering the citizenry to surrender their arms and suppressing the publication of radical Belfast newspaper The Northern Star. Weapon searches begin in Belfast and Carrickfergus, with more than 5,000 arms seized in the first ten days. Using informers, Lake would go on to devastate the United Irishmen's ranks while, at the same time, doing nothing to disarm loyalist Orange Men.\n*1798 – General Sir Ralph Abercromby is appointed commander-in-chief in Ireland and formally censures the Irish army for brutality. Outraged members of the Irish Government force Abercromby to resign and has Lake return to take his place. As a result of Lake's harsh methods, the population rose up in revolt culminating the Irish Rebellion of 1798 from May to October.\n*1798 – Henry Joy McCracken is then led to Market House at High Street and Corn Market, where he was hanged on 17 July after refusing to name his co-conspirators at his trial. Wolfe Tone would commit suicide in Dublin on 19 November a day before he was scheduled to be executed after being convicted at his court martial.\n1800–1899\n* 1800 – Profoundly influenced by the effects of the Irish Rebellion of 1798, William Pitt crafts the Act of Union establishing the modern United Kingdom of Great Britain and Ireland and has the Irish Parliament in Dublin abolish itself.\n* 1801 – The Act of Union comes into effect.\n* 1801 – The Belfast Literary Society is established. The population of Belfast town is estimated at 19,000.\n* 1808 – Population of Belfast is estimated to be 25,000.\n* 1811 – At its peak, the Belfast cotton industry employs 22,000 people directly in spinning mills and 30,000 more people indirectly in weaving and other roles.\n* 1814 – The Royal Belfast Academical Institution opens as the Belfast Academical Institution.\n* 1815 – The Belfast cotton industry begins to lose momentum due to decreased demand after the Napoleonic Wars.\n* 1821 – The Belfast Natural History and Philosophical Society is established.\n* 1825 – Deep-soaked flax method of making yarn by power-spinning machine is discovered in Preston, England.\n* 1828 – The Botanic Gardens are opened to the public.\n* 1828 – Mulholland's Cotton Mill on York Street burns down and is rebuilt much larger, with five stories, three steam engines, 15,300 spindles and a 186-foot-tall chimney. It is also upgraded to spin deep-soaked flax, and is able to render 700 tonnes of yarn per year.\n* 1829 – A ban on Orange Institution Battle of the Boyne commemoration parades leads to demonstrations and serious rioting in the city. These spread to County Armagh and County Tyrone, lasting several days and resulting in at least 20 deaths.\n* 1830 – Belfast becomes the world's leading producer of linen.\n* 1832 – The 1826–1837 cholera pandemic arrives in Belfast, killing 418 people.\n* 1836 – Belfast has a vibrant chamber of commerce and top-level banking network, which include the Northern Bank, Ulster Bank and Belfast Bank.\n* 1837 – Steam locomotives \"Express\" and \"Fury\" are delivered from Manchester to Belfast Harbour, from where are drawn up by horse to be placed on the new railway line Between Belfast and Lisburn. Nearly 1,600 spectators gather at 4 am to watch their test runs.\n* 1840 – Daniel O'Connell launches his Repeal the Act of Union movement.\n* 1840 – Ireland's cottage industries fail to compete with mechanised production and imports from England. The devastation of these industries contributes to rural families' dependence on the potato crop as a staple of their diet.\n* 1841 – Population of Belfast is estimated to be 70,447 and the city boundary is extended.\n* 1841 – On 19 January, Daniel O'Connell speaks to a crowd from a balcony of Kern's Hotel. People both jeer and cheer so loud that his speech cannot be heard. The same night, Belfast residents throw stones and smash windows, and are eventually repelled by police. O'Connell leaves Belfast the next day under police escort.\n* 1841 – Rev. Henry Cooke, a spokesman for northern Presbyterians, extols the growth of industry and population in Belfast and connects its prosperity directly to its being a part of the United Kingdom.\n* 1845 – The Great Potato Famine begins after a potato blight from America spreads to Irish crops. The Belfast Newsletter predicts the devastating effect the blight would have on the common people of Ireland, particularly in rural areas. The potato crop largely fails all over Ireland, with the exception of the west coast and parts of Ulster.\n* 1847 – The British government is feeding 3,000,000 famine victims a day, though many still die from disease brought on by malnutrition. Many of the poor moved eastward from rural areas into Belfast and Dublin, bringing with them famine-related diseases. Dr. Andrew Malcolm, working in Belfast at the time, wrote of the influx of the starving into the town, their horrific appearance and the \"plague breath\" they carried with them. In July, the Belfast Newsletter reported that the town's hospitals were overflowing and that some of the emaciated were stretched out on the streets, dead or dying.\n* 1848 – Another cholera outbreak hits Belfast, killing 1,163 people.\n* 1849 – The Belfast Harbour commissioners, members of the council, gentry, merchants and the 13th Regiment officially open the Victoria Channel on 10 July aboard the royal steamer Prince of Wales. This new waterway would allow large vessels to navigate the River Lagan regardless of the tide.\n* 1849 – In August, Queen Victoria, Prince Albert and the Prince of Wales sail up the new Victoria Channel on their visit to Belfast. They are received with celebrations, crowds of well-wishers, and decorations adorning the streets, and would be credited with lifting the spirits of the city as it recovered from the cholera outbreak. On High Street, a 32-foot high arch had been adorned with a misspelling of the Irish greeting \"Céad Míle Fáilte\". The royal family visit a goods exhibition at the White Linen Hall, inspect the new Queen's College, and tour Mulholland's Cotton Mill before returning to their vessel.\n* 1852 – Belfast is the first port of Ireland, outpacing Dublin in size, value and tonnage.\n* 1853 – The city boundary is extended.\n* 1854 – The 1846–1860 cholera pandemic arrives in Belfast, killing 677 people.\n* 1855 – Edward Harland launches his first ship in October.\n* 1857 – Confrontations between crowds of Catholics and Protestants on 12 July degrade into stones being thrown on Albert Street, and Catholics beating two Methodist ministers in the Millfield area with sticks. The next night, Protestants from Sandy Row went into Catholic areas, smashed windows and set houses on fire. The unrest turned into ten days of rioting, with many of the police force joining the Protestant side.\n* 1858 – Harland buys out his partner John Hixon with the backing of Gustav Schwab, whose nephew Gustav Wolff had been working as an assistant to Harland.\n* 1861 – The partnership of Harland & Wolff is formed. Business booms with the advent of American Civil War and the Confederacy purchasing steamers from Harland & Wolff.\n* 1862 – Ulster Hall opens. George Hamilton Chichester, 3rd Marquess of Donegall orders a new mansion to be designed by Charles Lanyon and built on the slope of Cave Hill, and names it \"Belfast Castle\".\n* 1864 – Riots get so intense that reinforcements and two field guns are dispatched from Dublin Castle. A funeral for a victim of police gunfire turns into a loyalist parade that unexpectedly passes through Donegall Square in the heart of Belfast. Police can barely maintain a barrier between the parade and the Catholics amassing at Castle Place. Continuous gunfire throughout the city is heard until heavy rain disperses the crowds.\n* 1869 – Gustav Schwab founds the White Star Line and orders all of its ocean vessels from Harland & Wolff, setting the firm on the path to becoming the biggest ship building company in the world.\n* 1870 – Construction of Belfast Castle on Cave Hill is complete.\n* 1871 – Ormeau Park opens.\n* 1872 – In summer, 30,000 nationalists hold a demonstration at Hannahstown calling for the release of Fenian prisoners, leading to riots between Catholics and Protestants.\n* 1874 – Home Rule becomes a mainstream issue in Irish politics. The Newsletter denounces a number of MPs on the eve of the election, writing that \"Home Rule was simply 'Rome Rule'\" and that Protestants would not support a new Dublin parliament.\n* 1886 – The Catholic population of Belfast reaches 45,000.\n* 1886 – The 1886 Belfast riots break out between Catholic and Protestant civilians over tensions arising from the Home Rule Bill. In June, Protestants celebrate the defeat of the First Home Rule Bill in the House of Commons, leading to rioting in Belfast in which seven people die and many more are injured. Following the July Orange Institution parades (The Twelfth), clashes occur between Catholics and Protestants, and also between Loyalists and police. Thirteen people are killed in one weekend, and rioting continues sporadically until mid-September, resulting in an official death toll of 31.\n* 1888 – Queen Victoria grants city status to Belfast. At the time it is Ireland's largest city, the UK's third most important port (behind London and Liverpool), the leader in world trade, and the global centre of linen production.\n* 1888 – Alexandra Park, Woodvale Park and Belfast Central Library open.\n* 1893 – A second Home Rule Bill passes through the House of Commons but is struck down in the House of Lords. Wary Protestants celebrate and, as had happened seven years earlier, Catholics are attacked in Belfast's shipyards.\n* 1895 – The Grand Opera House opens.\n* 1896 – The city boundary is extended.\n* 1899 – Large crowds gather on 14 January to watch the launch of the RMS Oceanic, which had been ordered by the White Star Line for trans-Atlantic passenger travel. The Oceanic is the largest moving object ever built up to that time.\n1900–1959\n* 1900 – Belfast had the world's largest tobacco factory, tea machinery and fan-making works, handkerchief factory, dry dock and color Christmas card printers. Belfast was also the world's leading manufacturer of \"fizzy drinks\" (soft drinks). The city of Belfast is 75% Protestant, however, the whole island of Ireland is 75% Catholic.\n* 1901 – Population of Belfast is estimated to be 349,180.\n* 1906 – Belfast City Hall and Victoria Park open.\n* 1907 – The city saw a bitter strike by dock workers organised by radical trade unionist Jim Larkin. The dispute saw 10,000 workers on strike and a mutiny by the police, who refused to disperse the striker's pickets. Eventually the British Army had to be deployed to restore order. The strike was a rare instance of non-sectarian mobilisation in Ulster at the time.\n* 1910 – Irish Unionists chose Edward Carson, a lawyer and former Conservative Party MP for Trinity College Dublin, as their leader. In September. Unionists led by Carson raise a militia, the Ulster Volunteers (or Ulster Volunteer Force), to resist Home Rule by force if necessary. The Ulster Unionist Council secretly requested a price quotation from a German arms manufacturer for 20,000 rifles and a million rounds of ammunition.\n* 1911 – Carson and the UCC voted for the first disbursement of funds to be used in the acquisition of arms.\n* 1912 – The RMS Titanic leaves Belfast on 2 April and heads for Southampton. Prime Minister H. H. Asquith introduced the Home Rule Bill in the Commons on 11 April. The Third Home Rule Bill was proposed by the Liberal government and would have granted limited autonomy to an all-Ireland Irish Parliament. The Titanic sinks on 15 April on the way to New York after colliding with an iceberg with over 1,500 lives lost. The Ulster Covenant is signed on 28 September by Edward Carson and other Unionists collecting almost 500,000 signatures in opposition to the Third Home Rule Bill.\n* 1914 – A shipment of 24,000 rifles with five million rounds of ammunition, or 216 tonnes, arrived in Ireland in April. Alarmed by the events up north, the almost-defunct Irish Republican Brotherhood was revitalised as a direct response to the actions of the UV. Britain suffered over 54,000 casualties; the Ulster Division alone had 5,700 killed or wounded (over 10% of the total losses). The UUC mandates that their goal in September to have the six northeast counties of Ulster be an exclusion zone from Home Rule.\n* 1918 – World War I ends in an armistice on 11 November. Sinn Féin win a majority of seats in general election on 14 December in Ireland, with 14 Unionist and 14 Sinn Fein/Irish Nationalist seats returned in the Province of Ulster (see List of MPs elected in the 1918 United Kingdom general election). SF goes on to abstain from both the new Dublin Parliament and the House of Commons in London. SF forms the alternative Dáil Éireann, which would eventually become the governing body of the future Republic of Ireland.\n* 1919 – From January, guerrilla fighting between security forces and the Irish Republican Army (IRA) increased, eventually escalating into the Anglo-Irish War.\n* 1920 – Rioting breaks out in Belfast on 21 July, starting in the shipyards and spreading to residential areas. The violence was partly in response to the IRA killing in Cork of northern Royal Irish Constabulary police officer Gerald Smyth, and also because of competition for jobs due to the high unemployment rate. Protestant Loyalists marched on the Harland and Wolff shipyards in Belfast and forced over 11,000 Catholic and left-wing Protestant workers from their jobs. This sectarian action is often referred to as the Belfast Pogrom. The sectarian rioting that followed resulted in about 20 deaths in just three days. Both Catholics and Protestants were expelled from their homes by the other side, sometimes by fire. The further IRA assassination of an RIC Detective Swanzy in nearby Lisburn on 22 August prompted another round of clashes, in which 33 people died in 10 days. Amidst political unrest, the Government of Ireland Act 1920 entered the statute book, officially creating Northern Ireland on 23 December.\n* 1921 – Elections on 24 May give Unionists a landslide victory with 40 seats, while Sinn Féin and other Irish Nationalists won only six seats each. James Craig became the first Prime Minister of Northern Ireland. King George V offered to open Northern Ireland's parliament on 22 June 1921 in hopes that it would bring peace negotiations. Belfast suffers a day of violence known at the time as 'Belfast's Bloody Sunday'. An IRA ambush of an armoured police truck on Raglan Street killed one RIC man, injured two more and destroyed their armoured car. This sparked ferocious fighting in west Belfast on the following day, Sunday 10 July, in which 16 civilians (eleven Catholics and five Protestants) died and 161 houses were destroyed. Gun battles raged all day along the sectarian 'boundary' between the Falls and Shankill Roads; rival gunmen used rifles, machine guns and hand grenades. Four more would die over the following two days. After a truce leading to peace talk between Republicans and the British Government, the Anglo-Irish War ends on 11 July with a treaty. The second spike in violence happened from 29 August to 1 September, in which twenty people were killed. The third eruption was in November, when more than thirty died in response to the IRA bombing city trams taking Protestant workers to the shipyards, killing seven people.\n* 1922 – Belfast becomes the capital of Northern Ireland.   After the Anglo-Irish Treaty confirms the partition of Ireland into Northern Ireland and the Irish Free State, Michael Collins, a leader in the Republican movement and commander of the IRA, covertly sends arms and aid to the northern IRA with the aim both of defending the Catholic population there and sabotaging the government of Northern Ireland in hopes of its collapse. Loyalists recognised the IRA's tactic of subversion and openly attacked Catholic neighbourhoods, which were somewhat defended by IRA gunmen. Roughly thirty people were killed in Belfast in February 1922, sixty in March and another 30 in April. Recurring cycles of violence continued until the summer of 1922. In response to this most recent conflict, the First Dáil imposed a boycott on goods produced in Belfast from 6 August, which proved to be ineffective. The McMahon Murders of 26 March, and the Arnon Street Massacre of a week later, in which uniformed police shot a total of twelve Catholic civilians dead in reprisal for the killings of policemen, were two of the worst incidents. On 29 April, King George V grants the Ulster Special Constabulary the title of Royal Ulster Constabulary. On 22 May, the IRA assassinated unionist politician William Twaddell, in Belfast. Immediately afterwards, the Special Powers Act was passed in an effort to stop the chaos. Internment (arrest and imprisonment without trial) was introduced, and over 350 IRA men were arrested in Belfast, crippling its organisation there. May saw seventy-five people killed in Belfast, and another 30 died there in June. Several thousand Catholics fled the violence and sought refuge in Glasgow and Dublin. However, after this crisis, the violence declined rapidly. Only six people died in July and August and the final conflict-related killing took place in October 1922. The Republican movements splits after the public votes in the Treaty via referendum resulting in the Irish Civil War beginning on 28 June. In July, legislation was rushed through to abolish proportional representation in local government elections. Violence in Northern Ireland subsides with the introduction of internment and the South being distracted by the civil war. Around 90% of the 465 deaths in Belfast were civilian on civilian. The Irish Free State is established on 6 December per the Anglo-Irish Treaty.\n* 1923 – The death toll in Northern Ireland between July 1920 and July 1922 was 557 men, women and children; 303 were Catholics, 172 Protestants and 82 members of the security forces. In Belfast, 236 people had been killed in the first months of 1922 but there was not a single sectarian murder in the city between 1923 and 1933 Northern Ireland was reputed to have one of the lowest crime rates in Europe during this period.\n* 1924 – Musgrave Park opens.\n* 1925 – James Craig calls a snap election in April to demonstrate Unionist solidarity against the Boundary Commission, using the now famous catchphrase \"not an inch\". A leaked report published in the Morning Post newspaper on 7 November details the conclusions of the commission. Parts of Donegal and Monaghan were conceded to Northern Ireland, with only the town of Crossmaglen going to the Free State; the population of NI would ultimately be reduced by only 1.8%. James Cosgrave and Craig (the latter had hitherto refused to participate in the commission) rushed to London to meet with the new Prime Minister, Stanley Baldwin, where they agreed to suppress the Boundary Commission and keep the border as it was. Craig returns to a hero's welcome in Belfast in December.\n* 1928 – Ten nationalists sat in the Northern Ireland Commons receiving no acclaim for their willingness to cooperate and returning to their seats. The only bill the Nationalists got through from 1928 to 1972 was the Wild Birds Protection Act.\n* 1929 – James Craig (who had been awarded a peerage and was now Lord Craigavon) abolishes proportional representation in parliamentary elections. Though the impact was most felt by smaller parties, Nationalists considered this another harsh measure to oppress the minority. The 1929 Stock Market Crash in New York had wide-reaching effects around the world in places like Northern Ireland. Economic interests in the province, particularly large industries like shipbuilding, were hit hard.\n* 1931 – Speaking in the Commons, Joseph Devlin castigates the Unionist party for snubbing the willingness of Nationalists to cooperate, favoring \"old party lines\" and treating one-third of the population as political pariahs. Harland & Wolff did not launch a single ship between December 1931 and May 1934.\n* 1932 – Sectarian tensions increased, to the alarm of the Unionist community, as Éamon de Valera (a staunch Republican leader and Easter Rising veteran) assumed the premiership of Free State Ireland. When the Church of Ireland announced plans to commemorate the coming of Saint Patrick to Ireland, a Catholic cardinal commented publicly that \"the Protestant church in Ireland, and the same is true anywhere else, is not only not the rightful representative of the early Irish church, but it is not even a part of the Church of Christ.\" This brought Protestant outrage, pushing tensions to the breaking point and Loyalists responded in June 1932 by attacking Catholic pilgrims returning to Belfast on public transport from the Eucharistic Congress in Dublin. Denouncements of Catholicism grew louder as the Loyalist summer marching season came closer. The situation was made worse by the fact that many of Northern Ireland's unemployed were in a state of privation and some were starving. On 30 September 1932, MPs in Northern Ireland's House of Commons shouted in protest over the 78,000 unemployed and their lack of food. One MP threw the mace on the floor and accused the House of hypocrisy. On 3 October 1932, 60,000 unemployed Catholics and Protestants marched together in solidarity to a torch-lit rally at the Custom House. The bands who marched alongside the protesters were careful not play any sectarian songs, and instead opted to perform the popular tune \"Yes, We Have No Bananas\". On 11 October, crowds formed up on Templemore Avenue in east Belfast and began to march. The police, drawing their batons, were given the order to charge and stormed into the crowds; some marchers were beaten, many fled. Rioting broke out on the Lower Falls Road and police, armed with rifles, fired and mortally wounded one Catholic and one Protestant. News spread to the nearby Shankill Road, a traditionally loyalist area, where a woman in a shawl was quoted by a reporter from The Irish Press as shouting \"they're kicking the shite out of the Peelers [police] up the Falls! Are you's going to let them down!?\" Shankill Protestants ran the few blocks to aid the mostly Catholic rioters against the police in a rare episode of non-sectarian unity. Shocked, the Government conceded to their demands and increased aid to the unemployed of Northern Ireland, pacifying the population. The new Stormont Parliament buildings are opened on 16 November in a ceremony that included King George V.\n* 1933 – By January, the volume of international trade was only one-third of what it had been before the Crash.\n* 1934 – Belfast Zoo opens to the public.\n* 1935 – The Workman, Clark and Company shipyard closes down permanently. There was another summer of tension as the Church of Ireland Bishop of Down appealed to the public to forget the \"unhappy past\" and endeavor to work together. In response, at the Belmont Field, Orange Order Grand Master Sir Joseph Davidson asked rhetorically \"are we to forget that the flag of Empire is described as foreign flag? And our beloved King insulted by Mr. De Valera? Are we to forget that the aim of these people is to establish an all-Ireland, Roman Catholic state in which Protestantism is to be crushed out of existence?\" That night, as the observers at Belmont Field returned to Belfast, fierce fighting broke out on York Street, which raged for days. When calm returned eight Protestants and five Catholics had been killed and 2,000 Catholics had been driven from their homes.\n* 1937 – Éamon de Valera unveils his constitution in 1937, Articles 2 and 3 stated that the government in Dublin had the right to exercise jurisdiction over the entire island of Ireland. The constitution also recognised the validity of the Protestant Church and others, however, it gave special status to the Roman Catholic Church in Ireland.\n*1938 – Craigavon calls for a general election to show his contempt for the Irish Constitution, with the Unionists winning a crushing majority over Nationalists and others. By February, nearly a third of industrial workers were unemployed. Eyewitnesses recall seeing barefoot children at the Albertbridge pens in Belfast hoping to get unwanted, unsterilised milk before the cattle were shipped to England. Belfast Corporation would only build 2,000 council houses between the World Wars and many were built with inferior materials amidst accusations of corruption. Malnutrition was also a major issue for families both in the Free State and Northern Ireland, with a 9.6% infant mortality rate in Belfast, compared with 5.9% in Sheffield, England. Maternity was more dangerous in Northern Ireland than in England or the Free State, with maternal mortality rising by a fifth between 1922 and 1938. Tuberculosis was also a concern, killing many young people in Belfast and other areas.\n* 1939 – Nazi Germany invades Poland on 1 September triggering World War Two.\n* 1941 – The Belfast Blitz occurred on Easter Tuesday, 15 April. Two hundred German Luftwaffe bombers attacked the city, pounding working class areas of Belfast around the shipyards and north Belfast, in particular, the New Lodge and Antrim Road areas. About a thousand people died and many more were injured. Of Belfast's housing stock, 52% was destroyed. Outside London, this was the greatest loss of life in a single raid during the war. Roughly 100,000 of the population of 415,000 became homeless. Belfast was targeted due to its concentration of heavy shipbuilding and aerospace industries. Ironically, during the same period the local economy made a recovery as the war economy saw great demand for the products of these industries. The British government had thought that Northern Ireland would be safe from German bombing because of its distance from German positions, and so had done very little to prepare Belfast for air raids. Few bomb shelters were built and the few anti-aircraft guns the city possessed had been sent to England.\n* 1951 – The population of Belfast is estimated to be 443,671.\n* 1957 – The Ulster Society of Women Artists is established.\n1960–1999\n* 1962 – The Belfast International Arts Festival is established.\n* 1969 – Riots break out from 12–16 August. In response, the British Army is deployed to Northern Ireland on 14 August as a peace-keeping force beginning Operation Banner. Peace walls are erected by the army throughout the country between Republican and Loyalist communities, the largest is in Belfast between the Falls Road and Shankill Road areas. The Provisional IRA split from the Official IRA in December.\n* 1970 – Fighting breaks out between the IRA and the British Army after the army searches for weapons in the Falls Road area with the armed forces imposing the Falls Curfew. The Ulster Defence Regiment is established and made up of local men. It soon becomes the largest regiment in the British Army.\n* 1971 – Westminster re-introduces internment in August. The British Army launched Operation Demetrius which rounded up 342 suspected Republican terrorists. They did not detain anyone from the Loyalist side. In August a series of incidents caused by the 1st Battalion, Parachute Regiment of the British Army result in the deaths of 9 people. The Ulster Defence Association (UDA) is formed from vigilante loyalist groups in September. Three people are killed in November after the Provisional IRA set off a bomb in the Red Lion Pub. An explosion caused by the Ulster Volunteer Force at McGurk's Bar kills 15 people in December.\n* 1972 – The 1st Battalion British parachute regiment fires into a crowd of protesters after clashing with youths on 30 January in Derry resulting in 14 dead and a surge in volunteers for Republican paramilitaries in an event known as Bloody Sunday. The Vanguard Unionist Progressive Party is founded on 9 February. In March, an explosion in Abercorn Restaurant on Castle Lane kills 2 people and injures more than 140. The Parliament of Northern Ireland is prorogued on 30 March and direct rule is imposed by Westminster. Five people are killed and 2 people are injured in July when the British Army open fire at civilians in the Springhill Massacre. In retaliation for the events of Bloody Sunday, 9 people are killed and 130 people are injured in July when 22 bombs are set off by the Provisional IRA around Belfast in an event that becomes known as Bloody Friday. Ten days later on 31 July, British security forces carried out Operation Motorman which aimed to re-take no-go areas in Belfast and Derry.\n* 1973 – The Sunningdale Agreement is reached on 9 December in an attempt to stabilize Northern Ireland by creating a power-sharing executive as well as an All-Ireland council.\n* 1974 – The Ulster Workers Council stages a general strike from 15 to 28 May in opposition to the Sunningdale Agreement which would eventually collapse the same year.\n* 1975 – In April 5 people are killed and 60 are injured when a bomb is detonated in  the Mountainview Tavern. A series of attacks in October by the Ulster Volunteer Force across several places in Northern Ireland including Belfast kills 12 people. Lenny Murphy and the Shankill Butchers gang kill their first victim, Francis Crossin, on 24 November cutting his throat and mutilating his body.\n* 1976 – Betty Williams and Mairead Corrigan create the create Women for Peace (which later became the Community of Peace People) after Williams witness three children get hit and killed by a car. The driver was member of the IRA who had been shot when exchanging gunfire with British soldiers. Williams and Corrigan would create the Petition for Peace with over 6,000 signatories and would go on to both receive the Nobel Peace Prize in 1977. Terri Hooley opens the Good Vibrations record shop late in the year.\n* 1977 – The first of the Shankill Butchers are arrested on 19 May after one of their victims survives and identifies them while being driven around the Shankill area by the Royal Ulster Constabulary.\n* 1978 – The Belfast-based punk band, Rudi, releasing \"Big Time\" under Terri Hooley's Good Vibrations label in April.\n* 1981 – After 66 days on hunger strike, Bobby Sands dies in the Maze Prison on 5 May.\n* 1982 – Lenny Murphy is killed by two members of the Provisional IRA while leaving his girlfriend's house in Glencairn. The PIRA was given details of Murphy's habits by the UVF who also granted the former safe conduct through Loyalist areas to carry out the hit.\n* 1988 – 3 people are killed and more than 50 people injured in March when a gunman opens fire during the funeral of Provisional IRA members who died in Gibraltar. Three days later, British Army corporals Derek Wood and David Howes are killed by the IRA after they drove onto a street where an IRA funeral procession was passing.\n* 1991 – The Cultúrlann McAdam Ó Fiaich, an Irish language cultural centre, opens.\n* 1992 – Five people are killed in February when two members of the Ulster Defence Association open fire at Sean Graham bookmakers. In November the Ulster Defence Association attacked James Murray's bookmakers which resulted in the death of 3 people.\n* 1993 – A bomb explodes on Shankhill Road which kills 10 people.\n* 1995 – The Belfast Film Festival is established.\n* 1996 – Crumlin Road Gaol closes.\n* 1998 – The Good Friday Agreement is signed in Belfast. Provisions of the agreement include a power-sharing executive, decommissioning of paramilitary weapons and early release of political prisoners.\n2000–present\n* 2000 – The Northern Ireland Assembly is suspended from 11 February to 30 May.\n* 2001 – NI Assembly suspends for 24 hours on 10 August and also 22 September.\n* 2002 – NI Assembly suspends on 14 October.\n* 2004 – Approximately £26 million is stolen from the headquarters of Northern Bank.\n* 2007 – NI Assembly re-convenes at Stormont on 7 May. The Irish Republican History Museum is established.\n* 2008 – Victoria Square Shopping Centre opens near Laganside Courts.\n* 2012 – Titanic Museum Belfast opens.\n* 2013 – An explosion occurs in the Cathedral Quarter resulting in hundreds of people being evacuated from the city centre.\n* 2014 – The Duncairn Centre for Arts & Culture opens.\n* 2017 – NI Assembly suspends again on 9 January. CS Lewis Square opens to the public in East Belfast in honour of the author of The Chronicles of Narnia and other prominent works on Christian intellectualism.\n* 2018 – The Primark store at the Bank Buildings catches fire on 28 August and burns for three days causing extensive damage.\n* 2020 – NI Assembly at Stormont re-convenes on 11 January. Northern Ireland is put under lock down on 16 March during the COVID-19 pandemic.\n* 2021 – Riots break out in the Shankill and Springfield Road areas of Belfast and elsewhere.\n* 2022 – The Europa Hotel is evacuated after a fire breaks out. NI Assembly suspends when Deputy First Minister Paul Givan resigns his post on 3 February in protest of the Northern Ireland Protocol.\n* 2023 – Elections for the seventh assembly are held on 21 May returning a majority for Sinn Féin for the first time in the history of Northern Ireland.\n* 2024 – On 18 January, over 100,000 workers from the National Health Service, Translink NI and teachers' unions stage the Public Sector Strike over pay in many towns and cities including Belfast. After two years of suspension, the NI Assembly meet on 3 February and appoint Michelle O'Neill as the First Minister and Emma Little-Pengelly as Deputy First minister. This is the first time in the history of Northern Ireland that a republican has become First Minister as well as both top two posts being held by women.\nReferences"
    }
  ]
}