{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of Mars Reconnaissance Orbiter\n\nTimeline for the Mars Reconnaissance Orbiter (MRO) lists the significant events of the launch, aerobraking, and transition phases as well as subsequent significant operational mission events; by date and brief description.\nLaunch and cruise timeline\n* April 30, 2005: the MRO spacecraft was delivered to the launch site.\n* August 9, 2005: the August 10 launch opportunity was postponed because of reliability concerns over the Atlas V's gyroscopes.\n* August 10, 2005: concerns over the gyroscopes were resolved. Launch was scheduled for 7:50 am EST, August 11.\n* August 11, 2005: concerns over weather cause a rescheduling of the launch to 9:00 am EST.  Conflicting sensor readings during fueling of the Centaur stage's liquid hydrogen fuel tank could not be corrected in time, causing the launch to be scrubbed and rescheduled for 7:43 am EST August 12.\n* August 12, 2005: at 7:43 am EST, MRO was launched. There were no significant anomalies reported during launch and deployment into interplanetary transfer orbit.\n* August 15, 2005: MARCI was tested and calibrated.\n* August 25, 2005: at 15:19:32 UTC, MRO was 100 million kilometers from Mars.\n* August 27, 2005: the first trajectory correction maneuver was executed. The burn used the same main thrusters that are needed for the orbital insertion maneuver and lasted 15 seconds. A velocity change of 7.8&nbsp;m/s was achieved.\n* September 8, 2005: MRO completed calibration and testing of the HiRISE and CTX cameras by taking pictures of the Moon from 10 million kilometers away.\n* November 18, 2005: MRO underwent its second scheduled course correction by firing its 6 medium thrusters for 20 seconds and changing its velocity by 75&nbsp;cm/s.\n* January 29, 2006: at 06:59:24 UTC, MRO was 10 million kilometers from Mars.\n* February 3, 2006: MRO began the Approach Phase, in preparation for orbital insertion.\nOrbital insertion/ Aerobraking timeline\n* March 10, 2006: MRO successfully completed orbital insertion.\n* March 23, 2006: test images from three of MRO's cameras were taken. HiRISE images were taken over the course of two orbits, the first returned from a height of 2500&nbsp;km (at about ten times poorer resolution than when the camera is in its final orbit). The CTX and MARCI cameras also took test images.\n* March 30, 2006: MRO fired its intermediate thrusters for 58 seconds and dropped its periapsis by 94&nbsp;km, in preparation to begin aerobraking.\n* April 7, 2006: MRO begun a five-month-long Aerobraking Stage to reduce its highly elliptical orbit to a circular, low Mars orbit by mid-November 2006.\n* August 30, 2006: Aerobraking ended with a 6-minute burn of MRO's Trajectory Correction Maneuver (TCM) thrusters.\n* September 5, 2006: The first of two burns to correctly position MRO into its final science orbit was performed.\n* September 11, 2006: The second of two burns to finalize MRO's orbit was performed, officially ending the Aerobraking Stage.\nTransition timeline\n* September 16, 2006: SHARAD was successfully deployed from MRO.\n* September 24, 2006: MCS and MARCI commenced operations, beginning a Martian weather forecast.\n* September 27, 2006: CRISM was powered on for the first time in space, and its lens cap was removed. In addition, SHARAD, HiRISE, and CTX were also powered on for the first time.\n* September 28, 2006: CRISM took its first picture at Mars.\nMission events\n* September 29, 2006: All instruments were tested from the science orbit.\n* October 5, 2006: Instruments were powered down for the Solar Conjunction.\n* November 2006: Primary Science Phase (PSP) started.\n* May 25, 2008: HiRISE photographs Phoenix during its descent through the Martian atmosphere to a landing in Vastitas Borealis, making MRO the first probe to photograph another probe landing on the surface of another planet (not including the Moon).\n* August 6, 2009: The spacecraft entered safe mode and switched to its backup computer. This is the third incident in 2009 and the seventh since launch.\n* August 26, 2009: The spacecraft entered safe mode for the second time in August. The spacecraft is in communication with Earth and is being kept in this safe mode with scientific and rover communications relay activities discontinued while engineers study the data.\n* December 8, 2009: The spacecraft is finally being taken out of safe mode that it has been in since August. The mission uploaded new software last week and plans to resume science operations once a check of all the science instruments is concluded in about a week.\n* August 6, 2012: HiRISE photographs Curiosity during its descent through the Martian atmosphere to a landing in Gale crater.\n* April 11, 2013: NASA announced that HiRISE may have achieved imaging the 1971 Soviet Mars 3 lander (and rover) hardware on the surface of Mars. On 2 December 1971, Mars 3 became the first spacecraft to attain soft landing on Mars and the second one on another planet, right after Venera 7, transmitting the first image data ever from Mars. Prior to that, amateur astronomers found what may be the parachute, retrorockets, heat shield and lander on MRO images from November 2007 and on 10 March 2013.\n* July 29, 2015: MRO successfully completed a maneuver to put the spacecraft in an adjusted orbit for supporting InSight Mars lander in its descent and landing (originally scheduled for September 28, 2016, later shifted to Nov. 26, 2018). It was the biggest orbital maneuver of MRO, since its arrival at Mars in 2006.\n* October 20, 2016: CTX took a picture of two spots, not existing in this area on a previously taken image, what is supposed to show the site of ESA's crash landed Schiaparelli lander (on October 19, 2016).\n* January 9, 2018: HiRISE takes a reference picture of an area for further investigations due to unexpectedly blurred images, since 2017, delimiting its practical resolution.\n* Early February, 2018: MRO evaluated its test of a solely stellar navigation. Goal is to indefinitely swap over to this navigation mode to maintain the spacecraft's orientation without staying dependent on its aging gyroscopes and accelerometers.\n* February 15, 2018: The spacecraft turned into safe mode again as it temporarily entered the martian shadow on its orbit. This response to sensing an unexpectedly low voltage indicates a problem with its aged batteries, which are essential for the solar-powered orbiter in this short period of shade in its orbit.\n* February 23, 2018: MRO was brought out of safe mode for diagnostics and solution finding. Meanwhile, science observations and its service as communications relay for the Mars rovers have been suspended.\n* June 13, 2018: A Perfect Storm of Science Awaits NASA\n* May 15, 2019: NASA's MRO completes 60,000th Mars Orbit Milestone.\n* February 18, 2020: NASA's Mars Reconnaissance Orbiter is being updated to ensure its batteries charge correctly and that it knows where it is in space.\n* August 12, 2020: Mars's aerial perspectives offered by the Mars Reconnaissance Orbiter.\n* July 26, 2021: Clay seems to be probable source of Mars \"lakes\" instead of water.\n* September 28, 2021: NASA halts Mars communication during solar conjunction.\n* January 26, 2022: NASA discovers water flowed on Mars more recently than thought.\n* April 25, 2022: Nasa extends Mars Reconnaissance Orbiter and other 7 planetary science missions.\n* June 23, 2022: NASA is releasing one of the last maps from its Mars orbiter that uses color to represent the different minerals found on the planet.\n* October 26, 2023: A new map from NASA reveals the locations of ice on Mars.\n* April 25, 2023: NASA's Mars Reconnaissance Orbiter has retired its mineral mapping instrument, CRISM, after 17 years of service.\n* April 5, 2023: NASA's new mosaic shows Mars in stunning detail using its imagery.\nFile:Descent of Phoenix with a crater in the background taken by Mars Reconnaissance Orbiter.jpg|The HiRISE camera images the Phoenix lander suspended from its parachute during descent through the Martian atmosphere.\nFile:MRO sees Curiosity landing.jpg|The HiRISE camera images the Curiosity rover suspended from its parachute during descent through the Martian atmosphere.\nFile:PIA16920-MarsSoviet3Lander1971-PossibleDebrisField.jpg|Candidate hardware for 1971 Soviet Mars 3 lander on HiRISE images. The predicted landing site was in Ptolemaeus Crater.\nFile:PIA21130 Signs of Schiaparelli Test Lander Seen From Orbit.gif|These before-and-after images of the MRO Context Camera indicates the supposed crash site of Schiaparelli.\nMission prospects\nOn February 9, 2018, NASA announced that it would keep using the Mars Reconnaissance Orbiter past the mid-2020s, although in the meantime the spacecraft and mission must face signs of age-related functional disturbances: 1. flagging batteries, 2. blurred images from HiRISE since 2017, 3. lowering reliability of gyroscopes or accelerometers for navigation, which will require a challenging examination on a matching mission design. Despite those challenges the reasons for this decision are: the loss of Mars Global Surveyor in 2006, the postponement of the Mars 2022 orbiter as the proposed successor of MRO and MAVEN's shortage of fuel, that makes MRO now the critical element of the NASA's further Mars Exploration Program.\nReferences"
    }
  ]
}