{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of the John A. Macdonald premierships\n\nThe following is a timeline of the Premiership of John A. Macdonald, who served as the first Prime Minister of Canada from July 1, 1867 to November 5, 1873 and again from October 17, 1878 to June 6, 1891.\nFirst premiership\n1867\n* August 7–September 20 – The first election in Canada occurs, with Macdonald winning a majority government for the Conservative Party.\n* November 6 – The Parliament of Canada meets for the first time.\n1868\n* May 26 – The Canadian Red Ensign enters unofficial use, becoming the de facto flag of Canada until it changes in 1965.\n1869\n* February 2 – Lord Lisgar becomes the 2nd Governor General of Canada.\n* October 11 – The Red River Rebellion begins, led by Louis Riel and the Métis.\n1870\n* July 15 – The transfer of Rupert's Land and the North-Western Territory are completed, and Manitoba becomes Canada's 5th province, with the rest being reorganized into the Northwest Territories.\n* August 24 – The Red River Rebellion ends as the Wolseley Expedition enters Manitoba and Louis Riel flees to the United States.\n1871\n* April 2 – The first Canadian Census is published, proclaiming a population of 3,689,257.\n* May 8 – The Treaty of Washington is signed between the United States, United Kingdom, and Canada. It settles numerous disputes, as well as outlining fishing rights and trade on the Great Lakes. It is considered a historically significant document, credited with sparking interest in codifying international law.\n* July 20 – British Columbia joins Canada as its 6th province.\n1872\n* April 14 – The Dominion Lands Act becomes law, encouraging Canadians to move westwards into the Canadian prairies.\n* June 14\n** The Trade Union Act is passed, legalizing Trade unions in Canada.\n** Picketing is outlawed with the passing of the Criminal Law Amendment Act\n* June 25 – Frederick Hamilton-Temple-Blackwood, 1st Marquess of Dufferin and Ava becomes the 3rd Governor General of Canada.\n* July 20–October 12 – The 1872 Canadian federal election is held, with Macdonald leading the Conservative Party to a second majority government.\n1873\n* April 2 – The Pacific Scandal begins, becoming the first major political scandal in Canadian history.\n* March 5 – The 2nd Canadian Parliament enters session.\n* May 23 – The North-West Mounted Police is established. It will later become the Royal Canadian Mounted Police.\n* July 1 – Prince Edward Island joins Canada as its 7th province.\n* November 7 – Macdonald resigns following the Pacific Scandal, and Alexander Mackenzie is appointed the new Prime Minister.\nSecond premiership\n1878\n* September 17 – The 1878 Canadian federal election is held, with Macdonald leading the Conservative Party to a third majority government and returning to the office of Prime Minister.\n* November 25 – John Campbell, 9th Duke of Argyll becomes the 3rd Governor General.\n1879\n* February 13 – The 4th Canadian Parliament enters session.\n* March 12 – Macdonald's National Policy is put into effect, outlining tariffs on manufactured goods, the building of the Canadian Pacific Railway, and the incentivizing of westward migration.\n1880\n* October 9 – The British Arctic Territories are transferred to Canada, becoming part of the Northwest Territories.\n1881\n* April 4 – The 1881 Canadian Census is published, proclaiming a population of 4,278,327.\n* November 18 – Canada adopts Standard Time.\n1882\n* June 20 – The 1882 Canadian federal election is held, with Macdonald leading the Conservative Party to their fourth majority government.\n1883\n* February 8 – The 5th Canadian Parliament enters session.\n* October 23 – Henry Petty-Fitzmaurice, 5th Marquess of Lansdowne becomes the 4th Governor General.\n1884\n1885\n* March 26 – The North-West Rebellion begins as a Métis militia led by Louis Riel clashes with the North-West Mounted Police.\n* April 2 – North-West Rebellion: 9 settler civilians die in the Frog Lake Massacre.\n* April 19 – An amendment to the Indian Act is passed, outlawing the indigenous practice of Potlatch in Canada.\n* May 9–15 – North-West Rebellion: The Battle of Batoche is fought, resulting in collapse of the Provisional Government of Saskatchewan.\n* May 15 – North-West Rebellion: Louis Riel is arrested near Batoche.\n* June 3 – North-West Rebellion: The Battle of Loon Lake ends in a decisive victory for the Canadians, ending the rebellion.\n* July 20 – The Chinese Immigration Act of 1885 becomes law, imposing a head tax on Chinese immigrants.\n* November 16 – Louis Riel is executed for his role in the North-West Rebellion, permanently damaging relations between Anglophone Canadians and French Canadians.\n1886\n* June 13 – The Great Vancouver Fire destroys most of the young city.\n1887\n* February 22 – The 1887 Canadian federal election is held, with Macdonald leading the Conservative Party to their fifth majority government.\n* March 3 – The United States passes the Fisheries Retaliation Act, imposing restrictions on Canadian fishermen and blocking Canadian imports.\n* April 13 – The 6th Canadian Parliament enters session.\n1888\n* June 11 – Frederick Stanley, 16th Earl of Derby becomes the 5th Governor General.\n1889\n1890\n1891\n* March 5 – The 1891 Canadian federal election is held, with Macdonald leading the Conservative Party to their sixth majority government.\n* April 29 – The 7th Canadian Parliament enters session.\n* June 6 – Macdonald dies in office. John Abbott is appointed Prime Minister 10 days later.\nReferences"
    }
  ]
}