{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of women's suffrage in Alabama\n\nThis is a '''timeline of women's suffrage in Alabama'''. Women's suffrage in Alabama starts in the late 1860s and grows over time in the 1890s. Much of the women's suffrage work stopped after 1901, only to pick up again in 1910. Alabama did not ratify the Nineteenth Amendment until 1953 and African-Americans and women were affected by poll taxes and other issues until the mid 1960s.\n19th century\n1860s\n1867\n* Pierce Burton writes an article supporting women's right to vote in Alabama.\n1868\n* Priscilla Holmes Drake is the only representative from Alabama to the National Woman Suffrage Association (NWSA).\n1890s\n1892\n* Women's suffrage groups formed in New Decatur and Verbena.\n1893\n* The Alabama Woman Suffrage Organization is founded.\n1894\n* The Huntsville League for Woman Suffrage is created.\n1895\n* Susan B. Anthony and Carrie Chapman Catt speak in Alabama.\n20th century\n1900s\n1900\n* October 1: State suffrage convention held in Huntsville.\n1901\n* Emera Frances Griffin speaks out in favor of women's suffrage at the state constitutional convention.\n1910s\n1910\n* March 29: Selma Suffrage League is formed.\n1911\n* October 22: The Equal Suffrage League of Birmingham is formed.\n1912\n* October 9: The Alabama Equal Suffrage Association (AESA) is formed in Birmingham.\n*AESA headquarters are set up in Birmingham.\n*The Huntsville Equal Suffrage Association is created.\n1913\n* AESA holds their first state convention in Selma at Hotel Albert and Pattie Ruffner Jacobs is elected president of the group.\n*March 3: Delegates from Alabama march in the Woman Suffrage Procession.\n*June: AESA sends representatives to the International Suffrage Alliance in Budapest.\n*July: Suffrage association formed in Tuscaloosa, Alabama.\n*December: Representatives from AESA attend the forty-fourth annual NAWSA convention. Pattie Ruffner Jacobs speaks at the convention.\n1914\n* February 5: AESA holds their state convention in Huntsville. Representatives from Birmingham, Coal City, Cullman, Greensboro, Hunstville, Mobile, Montgomery, Pell City, Selma, Tuscaloosa, and Vinemont were all in attendance.\n*September: Suffragists host a women's suffrage booth at the Alabama State Fair.\n1915\n* AESA holds their state convention in Tuscaloosa.\n*AESA's headquarters are moved to Selma.\n*August 25: A suffrage bill is brought to the state legislature, but does not receive enough votes to pass.\n*October: AESA starts to publish the Alabama Suffrage Bulletin.\n1916\n* Alabama Association Opposed to Woman Suffrage (AAOWS) was formed.\n*February 9: AESA holds its state convention in Gadsden.\n1917\n* February 12–13: AESA holds the state convention in Birmingham. Around 81 suffrage clubs report to the convention. A suffrage school is held afterwards with around 200 students.\n1918\n* May 7–8: AESA holds its state convention in Selma.\n1919\n* The Alabama Woman's Anti-Ratification League (AWARL) is formed.\n*September 22: Alabama rejects the Nineteenth Amendment.\n1950s\n1953\n* September 8: Alabama ratifies the Nineteenth Amendment.\n1960s\n1964\n* January 23: Poll taxes are abolished through the Twenty-Fourth Amendment.\n1965\n* The Voting Rights Act of 1965 provides African-American women full access to the right to vote.\nSee also\n* List of Alabama suffragists\n* Women's suffrage in Alabama\n* Women's suffrage in states of the United States\n* Women's suffrage in the United States\nReferences\nSources\n*\n*\n*\n*\n*"
    }
  ]
}