{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of motorized bicycle history__disambig_1\n\nThis timeline of motorized bicycle history is a summary of the major events in the development and use of motorized bicycles and tricycles, which are defined as pedal cycles with motor assistance but which can be powered by pedals alone.\n19th century\n*1867–1869 – The first steam driven two wheeled vehicle is the Michaux-Perreaux steam velocipede created in France.\n*1869 – Sylvester H. Roper of Massachusetts, USA creates a steam velocipede which he shows at fairs and circuses.\n*1885 – Gottlieb Daimler and Wilhelm Maybach of Cannstatt, Germany put their newly developed \"grandfather clock\" engine in a two-wheeled frame to demonstrate their automobile engine.  The Daimler Reitwagen is the first internal combustion motorcycle.\n*1896 – Roy C. Marks of San Francisco produces the first motorcycle made in the USA. It becomes the California Motorcycle.\n* 1897 – Most likely the first electric bicycle was built in 1897 by Hosea W. Libbey.[http://www.electric-bicycle-guide.com/ Electric Bicycle Guide]\n*1897 – The Werner Brothers of France developed a motorized bicycle with a De Dion-Bouton engine mounted above the front wheel.\n*1898 – Laurin and Klement produce the Slavia model A moto cycle.  It is a purpose-built motorcycle.\n*1900 – Due to poor handling Werner move the engine to the bottom of the frame and patent the design.  The 1900 Werner is the first motorcycle layout.\n*1900 – The Singer Motor Wheel was a wheel attached to a small internal combustion engine that would be substituted for the front wheel of a bicycle, motorizing it\n20th century\n*1903 –  A California motorized bicycle ridden by George Wyman became the first motor vehicle to cross the North American continent.\n*1903 – 1962 The \"Shaw Manufacturing Co.\" () of Galesburg, Kansas advertises a 241cc chain-drive engine kit (1903–1915) for motorizing a bicycle in \"Popular Mechanics\" magazine for $90.\n*1914 – The Smith Motor Wheel was introduced, similar in concept to the Singer, but was designed to be fixed to the rear of the bicycle, rather than to replace the front wheel.  The design was later picked up by Briggs & Stratton.  [http://www.aosmith.com/about/aoshistweb/]\n*1918 – Evans Power Cycle\n*1919 – Johnson Motor Wheel\n*1938 – Fichtel & Sachs-Werke Germany introduced the (Brennabor) Saxonette, a hub-driven bicycle. 60 ccm, 1.2 HP, max. speed 30&nbsp;km/h. The engine was licensed to: Anker, Bismarck, Elfa, Excelsior, Gold-Rad, Hecker, Meister, Panther, Presto, Urania, Victoria and Wanderer. The inventor was Mr. Goldeband who gave the patents to F & S.\n*1939 – The bolt-on Whizzer bike motor is introduced; production continues until 1962.[http://www.moped2.org/whizzer-bike.htm Whizzer Bike]  In Australia, the Autocycle Malvern Star was introduced, following the pattern of the British Autocycle[http://www.users.globalnet.co.uk/~pattle/nacc/arc0227.htm Autocycle A B C]\n*1946 – In Italy, Vincenti Piatti had designed a 50cc engine unit for driving portable lathes and also foresaw the possibilities of this engine power-assisting a bicycle – the Mini Motore.[http://www.users.globalnet.co.uk/~pattle/nacc/arc0119.htm Trojan Mini-Motor]\n*1946 – The initial iteration of the VéloSoleX motorized bicycle is introduced to the French Public.\n*1948 – The Trojan Minimotor begins production in Britain and becomes immediately popular.\n*1949 – The Mobylette is introduced in France. Its concept was \"a bicycle with a nice permanent back wind\". This pattern gave its name to the French slang term for moped. 30 million copies were produced until 2002, evolving much through different models during half a century.\n*1950 – The British-made Cyclaid 31cc bolt on bicycle motor is introduced.[http://www.users.globalnet.co.uk/~pattle/nacc/arc0412.htm Five go Cyclemotoring] This same year also sees the introduction of the popular Cyclemaster motor wheel, also made in Britain from a design by the German DKW company.\n*1952 – The 18cc German Lohmann is one of the few semi-diesel bike motors ever produced and is claimed to be the world's smallest bike motor.[http://www.users.globalnet.co.uk/~pattle/nacc/arc0282.htm 1952 Lohmann engine][https://web.archive.org/web/20060405015809/http://www.industrimuseet.dk/site_engelsk/subpages/faste%20udstillinger/gaden/museum.htm]\n*1966 – The Vélosolex 3800 is introduced and becomes the most popular version of the Vélosolex motorized bicycle, production continues until 1988.\n*1968 – The Honda P50 the last vehicle to incorporate a motor wheel as a power unit is discontinued.[http://www.users.globalnet.co.uk/~pattle/nacc/arc0080.htm Honda P50]\n*1975 – Sears begins selling the Tanaka Bike Bug motor under its own Free Spirit brand name; U.S. sales of the Bike Bug continue until 1985.\n*1982 – The \"Bumble Bike\" friction drive (now Golden Eagle belt drive) is chosen as \"Official Transportation\" at the Knoxville Worlds Fair.\n*1985 – The Tour de Sol leads to the development of modern electric bicycles in Switzerland.\n*1986 – A group of Swiss students develops the Twike sociable tricycle. The prototype was purely human-powered, but all 850 production vehicles were human-electric hybrids.\n*2000 – Honda Step Compo, first folding electric bicycle.\n21st century\n*2001 – the Hudspith Steam Bicycle makes its public debut at the Great Dorset Steam Fair.\n*2003 – Rif Addams(Sean Patrick Brown b. 1969) re-enacts George Wyman's 1903 San Francisco to New York run, on a custom-built Whizzer.\n*2006 – Motorized bicycling enjoys a resurgence in popularity, both as hobby and serious alternative transportation.\n*2006 – Motorized bicycle racing began in Tucson, Arizona with Death Race\n*2008 – The first \"National\" rally in the US, specifically for Motor-Assisted-Bicycles, took place in Ocean Park WA. There were 29 bikes, of various styles, representing 4 states.\n*2008 – A motorized bicycle ridden by Augie Deabler is accepted as an official entrant at the Bonneville Salt Flats \"World of Speed '08.\" He used a Golden Eagle/Tanaka 32cc, and recorded a top speed in the standing mile of 32.4MPH.\n*2011 – Motorized Bicycle racing began in Southern California at the Willow Springs International Motorsports Park Go Kart track in Rosamond, CA on June 18, 2011. SoCal Motor Bicycle Racing continues to hold races in Southern California at Grange Motor Circuit in Apple Valley, California after the first race on October 20, 2011, and at Willow Springs International Motorsports Park.\n*2020 – Ufeel supercapacitor electric bicycle without battery introduced.\nSee also\n*Timeline of transportation technology\n*List of motorcycles of 1900 to 1909\n*Motorcycle land speed record\nReferences\nExternal links\n*[http://www.buzzing.org/ National Autocycle & Cyclemotor Club from Britain]\n**[http://www.users.globalnet.co.uk/~pattle/nacc/arc0431.htm Detailed historical list of motorized bicycle derivatives available in Britain]"
    }
  ]
}