{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of geopolitical changes (1900–1999)__disambig_1\n\nThis is a timeline of geopolitical changes around the world between 1900 and 1999. It includes dates of declarations of independence, changes in country name, changes of capital city or name, and changes in territory such as the annexation, cession, concession, occupation, or secession of land. Territorial conquests as a result of war are included on the timeline at the conclusion of military campaigns, but changes in the course of specific battles and day-to-day operations are generally not included. Changes in airspace and maritime territory are included only when they are subject to a dispute. Over 50% of the world's borders today were drawn as a result of British and French imperialism. The British and French drew the modern borders of the Middle East, 80% of the borders of Africa, in Asia after the independence of the British Raj and French Indochina and the borders of Europe after World War I as victors, as a result of the Paris treaties.\n1900s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=9 |1900||rowspan=2 |1 January||style=text-align:left |The Northern Nigeria Protectorate is established by the United Kingdom.\n|-\n|style=text-align:left |The Southern Nigeria Protectorate is established by the United Kingdom.\n|-\n|16 February||style=text-align:left |The United States of America takes control of American Samoa under the terms of the Tripartite Convention.\n|-\n|March||style=text-align:left |The First Republic of Acre capitulates and is reabsorbed by the Republic of Bolivia.\n|-\n|21 April||style=text-align:left |The United Kingdom annexes the island of Niue, making it a British protectorate.\n|-\n|28 May||style=text-align:left |The United Kingdom occupies the Orange Free State.\n|-\n|5 September||style=text-align:left |The colony of French Chad is established. Fort-Lamy is the capital.\n|-\n|November||style=text-align:left |Acre declares independence from Bolivia as the Second Republic of Acre. The movement is quickly suppressed and Acre remains part of Bolivia.\n|-\n| ||style=text-align:left |The border between the Republic of the United States of Brazil and the French colony of Guyane (French Guiana) is defined by arbitration. The French troops that advanced to the margins of the Araguari River repair to the Oiapoque River.\n|-\n|rowspan=4 |1901||1 January||style=text-align:left |The Commonwealth of Australia is established by federation of the British colonies of New South Wales, Victoria, Queensland, South Australia, Western Australia and Tasmania. Melbourne was the de facto (but not de jure) seat of government from 1901 to 1927.\n|-\n|23 March||style=text-align:left |The First Philippine Republic dissolves.\n|-\n|11 June||style=text-align:left |The United Kingdom transfers the Cook Islands and Niue to the Colony of New Zealand.\n|-\n|26 September||style=text-align:left |The United Kingdom occupies the Ashanti Empire and makes it a crown colony.\n|-\n|rowspan=8 |1902||20 May||style=text-align:left |The Republic of Cuba gains independence from the United States of America. Havana is the capital.\n|-\n|31 May||style=text-align:left |The United Kingdom creates the Orange River Colony from the Orange Free State and the Transvaal Colony from the South African Republic (Republic of Transvaal). Bloemfontein and Pretoria remains the respective capitals.\n|-\n|1 July||style=text-align:left |The United Kingdom annexes Henderson Island.\n|-\n|10 July||style=text-align:left |The United Kingdom annexes Oeno Island.\n|-\n|20 November||style=text-align:left |King Edward VII of Britain adjusts borders in the Cordillera of the Andes Boundary Case between Chile and Argentina.\n|-\n|19 December||style=text-align:left |The United Kingdom annexes Ducie Island.\n|-\n| ||style=text-align:left |The Zaria Emirate and the Abuja Emirate are annexed into the British Northern Nigeria Protectorate.\n|-\n| ||style=text-align:left |German Kamerun annexes the Mandara Kingdom.\n|-\n|rowspan=10 |1903||27 January||style=text-align:left |The Third Republic of Acre declares its independence from Bolivia. The capital is Cidade do Acre.\n|-\n|23 February||style=text-align:left |Cuba leases Guantanamo Bay to the United States of America in perpetuity.\n|-\n|12 May||style=text-align:left |Mauritania becomes a protectorate of the French Republic. Saint-Louis is the capital.\n|-\n|29 July||style=text-align:left |The Adamawa Emirate is annexed into the British Northern Nigeria Protectorate and German Kamerun.\n|-\n|20 October||style=text-align:left |The Alaska boundary dispute is resolved between the United States of America and Canada.\n|-\n|3 November||style=text-align:left |The Republic of Panama secedes from the Republic of Colombia. Panama City is the capital.\n|-\n|11 November||style=text-align:left |The Republic of Bolivia and the Republic of the United States of Brazil sign the Treaty of Petrópolis. Bolivia receives land in Mato Grosso from Brazil, and Brazil absorbs the Republic of Acre.\n|-\n|18 November||style=text-align:left |The new Republic of Panama grants the United States of America control of the Panama Canal Zone. Balboa is the administrative center.\n|-\n| ||style=text-align:left |The United Kingdom secedes the Seychelles from the colony of Mauritius.\n|-\n| ||style=text-align:left |After the Aceh War, the Sultanate of Aceh is annexed by the Kingdom of the Netherlands and becomes part of the Dutch East Indies.\n|-\n|rowspan=6 |1904||13 February||style=text-align:left |Following the Franco-Siamese Convention, the Kingdom of Siam concedes border territories to French Indochina in exchange for French-occupied Chantaburi.\n|-\n|4 May||style=text-align:left |The United States of America annexed the Panama Canal Zone.\n|-\n|4 October||style=text-align:left |The Franco-Spanish Convention of Paris acknowledges formal control of Saguia el-Hamra (later northern Spanish Sahara) by the Kingdom of Spain.\n|-\n| ||style=text-align:left |The border between the Republic of the United States of Brazil and British Guiana is defined by arbitration. Approximately half of the disputed land goes to each side.\n|-\n| ||style=text-align:left |French Dahomey is established. Porto-Novo is the capital.\n|-\n| ||style=text-align:left |The Kingdom of Champasak is annexed by France and becomes part of the French protectorate of Laos.\n|-\n|rowspan=5 |1905||7 June||style=text-align:left |The Kingdom of Norway declares its independence from the United Kingdoms of Sweden and Norway through dissolution of the personal union with Kingdom of Sweden.\n|-\n|rowspan=2 |5 September||style=text-align:left |The Liaodong Peninsula and the Russian railway in south Manchuria are leased to the Empire of Japan following the Treaty of Portsmouth.\n|-\n|style=text-align:left |The Empire of Japan annexes Sakhalin Island south of 50° N following the Treaty of Portsmouth.\n|-\n|26 October||style=text-align:left |The Kingdom of Sweden recognizes the union dissolution and the independence of Kingdom of Norway.\n|-\n| ||style=text-align:left |The United Kingdom moves the capital of the East Africa Protectorate from Mombasa to Nairobi.\n|-\n|rowspan=3 |1906|| 1 May||style=text-align:left | The British Colony of Lagos and the Southern Nigeria Protectorate merge to form the Colony and Protectorate of Southern Nigeria.\n|-\n| ||style=text-align:left |The French Republic divides its colony of French Congo into the colonies of Gabon and Middle Congo. Libreville remains the capital of Gabon. Brazzaville becomes the capital of Middle Congo.\n|-\n| ||style=text-align:left |The United Kingdom and France jointly administer the New Hebrides. Port Vila is the capital.\n|-\n|rowspan=6 |1907||23 March||style=text-align:left |The Kingdom of Siam concedes territory to French Indochina in exchange for Trat.\n|-\n|24 April||style=text-align:left |The border between the Republic of the United States of Brazil and the Republic of Colombia is defined by the Bogotá Treaty. Brazil gains lands on the margins of the Solimoes River at the area known as Cabeça de Cachorro (\"The Dog's Head\").\n|-\n|6 July||style=text-align:left |The British Central Africa Protectorate is renamed to Nyasaland Protectorate.\n|-\n|26&nbsp;September||style=text-align:left |New Zealand becomes a Dominion within the British Empire under the name Dominion of New Zealand. Wellington is the capital. The Dominion of Newfoundland is also declared the same day. St. John's is the capital.\n|-\n|16 November||style=text-align:left |Oklahoma is admitted to the Union as the 46th State of the United States.\n|-\n|17 December||style=text-align:left |Ugyen Wangchuck establishes the Kingdom of Bhutan. Punakha is the winter capital and Thimphu is the summer capital.\n|-\n|rowspan=3 |1908||5 October|| style=\"text-align:left\" |The Kingdom of Bulgaria gains independence from the Ottoman Empire. Sofia is the capital.\n|-\n|6 October||style=text-align:left |Austria-Hungary formally annexes the Ottoman Vilayet of Bosnia (under de facto Austro-Hungarian rule since the Treaty of Berlin 1878) as the Condominium of Bosnia and Herzegovina (causing the Bosnian crisis).\n|-\n|15 November||style=text-align:left |King Leopold II of Belgium sells his private Congo Free State to the Kingdom of Belgium. The colony is renamed the Belgian Congo.\n|-\n|1909||9 July||style=text-align:left |The Kingdom of Siam transfers its southernmost provinces to British Malaya in the Anglo-Siamese Treaty of 1909.\n|}\n1910s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=7 |1910||15 January||style=text-align:left |The French Republic creates French Equatorial Africa from its colonies of Gabon, Middle Congo, and Oubangui-Chari. Libreville and Bangui yield to Brazzaville as the capital.\n|-\n|29 March||style=text-align:left |23 bancos are annexed by Mexico from the United States and 34 bancos are annexed by the United States of America from Mexico with the first application of the Banco Convention of 1905.\n|-\n|31 May||style=text-align:left |The Cape Colony, the Colony of Natal, the Transvaal, and the Orange River Colony unite as the Union of South Africa, which is established as a Dominion under the terms of the South Africa Act 1909.\n|-\n|20 August||style=text-align:left |Canada rescinds its claim to Pope's Folly Island in a treaty with the United States of America.\n|-\n|22 August||style=text-align:left |The Korean Empire capitulates and is annexed by the Empire of Japan.\n|-\n|5 October||style=text-align:left |The first Portuguese Republic supersedes the Kingdom of Portugal.\n|-\n| ||style=text-align:left |The Kasanje Kingdom is annexed to Portuguese Angola.\n|-\n|rowspan=4 |1911||17 August||style=text-align:left |The United Kingdom unites Barotziland–North-Western Rhodesia and North-Eastern Rhodesia to form Northern Rhodesia.\n|-\n|4 November||style=text-align:left |In the Morocco–Congo Treaty, Germany acquires the Neukamerun region from France in exchange for abandoning German claims in Morocco.\n|-\n|29 December||style=text-align:left |The Bogd Khanate of Mongolia declares independence from the Qing dynasty of China. Niislel Khüree is the capital.\n|-\n| ||style=text-align:left |The capital of British India is moved from Calcutta to New Delhi.\n|-\n|rowspan=8 |1912||1 January||style=text-align:left |The Republic of China overthrows the Qing dynasty of China in the Xinhai Revolution. Nanking is the provisional capital.\n|-\n|6 January||style=text-align:left |New Mexico is admitted to the Union as the 47th State of the United States.\n|-\n|14 February||style=text-align:left |Arizona is admitted to the Union as the 48th State of the United States.\n|-\n|30 March||style=text-align:left |The Treaty of Fez formally re-establishes Morocco as a French Protectorate.\n|-\n|7 November||style=text-align:left |Mexico annexes 20 bancos from the United States and the United States of America annexes 11 bancos from Mexico.\n|-\n|27 November||style=text-align:left |The Treaty Between France and Spain Regarding Morocco assigns the northern and southern strips of Morocco to Spain.\n|-\n|28 November||style=text-align:left |Albania declares its independence from the Ottoman Empire. Tirana is the capital.\n|-\n| ||style=text-align:left |The Wadai Empire is disestablished and annexed into French Chad.\n|-\n|rowspan=4 |1913||13 February||style=text-align:left |Tibet declares independence from the Republic of China.\n|-\n|May||style=text-align:left |The Imamate of Oman rebels against the Sultanate of Muscat and Oman. Nizwa becomes the capital after it is conquered on 5 June.\n|-\n|10 August||style=text-align:left |Following the First Balkan War, the Treaty of Bucharest is signed, by the terms of which:\n*Bulgaria gains Western Thrace and the southern portions of what are now Blagoevgrad Province and Burgas Province.\n*Romania gains Southern Dobruja.\n*Serbia gains Kosovo, most of what is now the Republic of Northern Macedonia, and some new land to the west of its previous borders.\n*Greece gains Epirus, West Macedonia, Central Macedonia, and most of the islands in the Aegean Sea that it did not control before the war.\n*Albania gains southern, eastern, and northern lands that bring it to its current borders.\n*Albania becomes officially independent, though large portions of its lands remain disputed.\n*Montenegro gains most of what is now its Northern Region.\n|-\n|29 September||style=text-align:left |Following the Second Balkan War, the Treaty of Constantinople is signed, by the terms of which:\n*The Ottoman Empire regains the portions of Eastern Thrace it lost in the First Balkan War.\n*The Balkan League gains all Ottoman territory west of the line joining Enez and Kıyıköy; thus the Ottomans lose all their European territory, except for what is roughly the southeastern half of Turkey's present-day European territory.\n|-\n|rowspan=6 |1914||1 January||style=text-align:left |The United Kingdom unites the Colony and Protectorate of Southern Nigeria and the Northern Nigeria Protectorate to form the Colony and Protectorate of Nigeria. Lagos is the capital.\n|-\n|7 March||style=text-align:left |Albania becomes the Principality of Albania.\n|-\n|17 April||style=text-align:left |Tannu Uriankhai is officially made a protectorate of the Russian Empire.\n|-\n|28 July||style=text-align:left |Following the assassination of Archduke Franz Ferdinand, Austria-Hungary declares war on Serbia, precipitating the First World War.\n|-\n|1 September||style=text-align:left |The Russian Empire changes the name of its capital from Saint Petersburg to Petrograd.\n|-\n| ||style=text-align:left |The Kingdom of Kongo is annexed to Portuguese Angola.\n|-\n|rowspan=5 |1915||1 May||style=text-align:left |The Panama Canal Zone border is redefined between Panama and the United States of America resulting in slight territory changes.\n|-\n|27 May||style=text-align:left |The United States of America annexes some more land around the Rio Chagres mouth in the Panama Canal Zone due to the Hay–Bunau-Varilla Treaty.\n|-\n|18 October||style=text-align:left |The German Empire creates the Government General of Warsaw from the parts of Poland conquered by the Russian Empire.\n|-\n|8 December||style=text-align:left |The United States of America annexes a triangle of island between the Rio Chagres, Caribbean Sea and the Panama Canal Zone.\n|-\n|12 December||style=text-align:left |Hongxian proclaims the Empire of China. Beijing is the capital.\n|-\n|rowspan=2 |1916||22 March||style=text-align:left |The Empire of China is abolished.\n|-\n|5 November||style=text-align:left |Germany and Austria-Hungary proclaim the establishment of the Kingdom of Poland. Warsaw is the capital.\n|-\n|rowspan=11 |1917||15 March||style=text-align:left |The Provisional Government of Russia supersedes the Russian Empire in the wake of the February Revolution.\n|-\n|31 March||style=text-align:left |Under the Treaty of the Danish West Indies, the United States of America acquires the Danish West Indies (excluding Water Island) from the Kingdom of Denmark, renaming them the United States Virgin Islands.\n|-\n|12 April||style=text-align:left |The Autonomous Governorate of Estonia is created from the Governorate of Estonia and some of the Governorate of Livonia of the Russian Empire.\n|-\n|1 July||style=text-align:left |Xuantong is reinstalled as Emperor of China in an event now called the Manchu Restoration.\n|-\n|12 July||style=text-align:left |End of the Manchu Restoration in China.\n|-\n|14 September||style=text-align:left |The Russian Republic supersedes the Provisional Government of Russia.\n|-\n|7 November||style=text-align:left |The Russian Soviet Federative Socialist Republic supersedes the Russian Republic.\n|-\n|28 November||style=text-align:left |The Provincial Assembly of the Autonomous Governorate of Estonia declares itself to be the only legally elected and constituted authority in Estonia, de facto declaring sovereignty from the Russian Soviet Federative Socialist Republic. The Provincial Assembly is thereafter forced underground by the Russian SFSR powers which continues to treat Estonia as an autonomous, but not sovereign governorate.\n|-\n|2 December||style=text-align:left |The Emirate of Chechenia declares its independence from the Russian Soviet Federative Socialist Republic. Vedeno is the capital.\n|-\n|6 December||style=text-align:left |The Republic of Finland gains independence from the Russian Soviet Federative Socialist Republic. Helsinki is the capital.\n|-\n|22 December||style=text-align:left |The Independent State of Flanders declares its independence from the Kingdom of Belgium. Brussels is the capital.\n|-\n| rowspan=\"42\" |1918||22 January||style=text-align:left |The '''Ukrainian People's Republic gains independence from the Russian Soviet Federative Socialist Republic'. Kiev is the capital.\n|-\n|3 January||style=text-align:left |After a plebiscite in Narva on 23 December 1917, the town, including its Ivangorod (Jaanilinn) district across the Narva River, is ceded from the Saint Petersburg Governorate to the Autonomous Governorate of Estonia.\n|-\n|16 February||style=text-align:left |The State of Lithuania declares its independence from the Russian Soviet Federative Socialist Republic. Vilnius is named the capital despite occupation by the Kingdom of Poland.\n|-\n|24 February||style=text-align:left |The Republic of Estonia declares independence from the Russian Soviet Federative Socialist Republic. Tallinn is the capital.\n|-\n|3 March||style=text-align:left |The Treaty of Brest-Litovsk creates many new states out of the western Russian Empire.\n|-\n|12 March||style=text-align:left |The Russian Soviet Federative Socialist Republic moves its capital from Petrograd to Moscow.\n|-\n|rowspan=2 |25 March||style=text-align:left |The Abkhazian Republic (Abkhazia) gains independence from the Russian Soviet Federative Socialist Republic. Sukhumi is the capital.\n|-\n|style=text-align:left |The 'Belarusian People's Republic declares its independence from the Russian Soviet Federative Socialist Republic. Minsk and Hrodna are named the joint capitals.\n|-\n|27 March||style=text-align:left |The Union of Bessarabia with Romania is proclaimed by the Treaty of Paris (1920).\n|-\n|19 April||style=text-align:left |The Transcaucasian Democratic Federative Republic declares independence from Russian Soviet Federative Socialist Republic and annexes the Abkhazian Republic (Abkhazia).\n|-\n|22 April||style=text-align:left |The Transcaucasian Democratic Federative Republic gains independence from the Russian Soviet Federative Socialist Republic. Tbilisi is the capital.\n|-\n|11 May||style=text-align:left |The Mountainous Republic of the Northern Caucasus annexes the Emirate of Chechenia.\n|-\n|26 May||style=text-align:left |The Democratic Republic of Georgia secedes from the Transcaucasian Democratic Federative Republic. Tbilisi is the capital.\n|-\n|28 May||style=text-align:left |Armenia and the Azerbaijan Democratic Republic dissolve the Transcaucasian Democratic Federative Republic. Yerevan and Baku are the respective capitals.\n|-\n|30 May||style=text-align:left |Armenia changes its name to the Democratic Republic of Armenia.\n|-\n|9 July||style=text-align:left |The Kingdom of Lithuania supersedes the State of Lithuania.\n|-\n|10 July||style=text-align:left |The Russian Socialist Federative Soviet Republic supersedes the Soviet Russian Republic.\n|-\n|12 July||style=text-align:left |The United States of America annexes  of land at Punta Paitilla for the Panama Canal Zone.\n|-\n|25 July||style=text-align:left |The Kingdom of Belgium reabsorbs the Independent State of Flanders.\n|-\n|21 August||style=text-align:left |The United States of America annexes land between Rio Chagres and [http://mapcarta.com/19874742 Quebrada Majagual] for the Panama Canal Zone.\n|-\n|29 October||style=text-align:left |The State of Slovenes, Croats and Serbs proclaims independence from the Austro-Hungarian Empire. Zagreb is the capital.\n|-\n|31 October||style=text-align:left |The Kingdom of Hungary declares the monarchy abolished. Budapest is the capital.\n|-\n|rowspan=3 |1 November||style=text-align:left |The Mutawakkilite Kingdom of Yemen (North Yemen) gains independence from the Ottoman Empire'''. Sana'a becomes its capital.\n|-\n|style=text-align:left |The Banat Republic is proclaimed.\n|-\n|style=text-align:left |The short-lived '''West Ukrainian People's Republic is proclaimed.\n|-\n|2 November||style=text-align:left |The Republic of Lithuania supersedes the Kingdom of Lithuania.\n|-\n|10 November||style=text-align:left |The Republic of Alsace-Lorraine is proclaimed. Strasbourg is the capital.\n|-\n|12 November||style=text-align:left |The Republic of German-Austria is proclaimed. Vienna is the capital.\n|-\n|14 November||style=text-align:left |The Republic of Poland supersedes the Kingdom of Poland.\n|-\n|15 November||style=text-align:left |The Kingdom of Serbia invades the short-lived Banat Republic and divides it between the Kingdom of Serbs, Croats and Slovenes and Romania.\n|-\n|16 November||style=text-align:left |The Hungarian People's Republic supersedes the Kingdom of Hungary.\n|-\n|18 November||style=text-align:left |The Republic of Latvia gains independence from the Russian Soviet Federative Socialist Republic. Riga is the capital.\n|-\n|22 November||style=text-align:left |France annexes the Republic of Alsace-Lorraine'.\n|-\n|25 November||style=text-align:left |The de facto province of Vojvodina votes to join with the Kingdom of Serbia.\n|-\n|rowspan=2 |28 November||style=text-align:left |The Kingdom of Serbia annexes the Kingdom of Montenegro.\n|-\n|style=text-align:left |The Union of Bukovina with Romania is proclaimed.\n|-\n|29 November||style=text-align:left |The Commune of the Working People of Estonia is established as a puppet state in Soviet Russian-occupied Estonia.\n|-\n|rowspan=3 |1 December||style=text-align:left |Iceland, a dependent territory of the Kingdom of Denmark with home rule, becomes the fully sovereign Kingdom of Iceland in personal union with Denmark. Reykjavík is the capital.\n|-\n|style=text-align:left |The State of Slovenes, Croats and Serbs and the Kingdom of Serbia unite to form the Kingdom of Serbs, Croats and Slovenes. Zagreb yields to Belgrade as the capital.\n|-\n|style=text-align:left |The Union of Transylvania with Romania is proclaimed.\n|-\n|11 December||style=text-align:left|The 'Slovak People's Republic''' is established.\n|-\n|29 December||style=text-align:left|The Slovak People's Republic is disestablished, merged into the First Czechoslovak Republic.\n|-\n| rowspan=\"30\" |1919||1 January|| style=\"text-align:left\" |The Socialist Soviet Republic of Byelorussia supersedes the Belarusian People's Republic. Minsk and Smolensk remain joint capitals.\n|-\n|8 January||style=text-align:left|The Hutsul Republic is established.\n|-\n|27 February||style=text-align:left |The Lithuanian-Belorussian Soviet Socialist Republic supersedes the Socialist Soviet Republic of Byelorussia. Vilnius is the capital.\n|-\n|rowspan=2 |1 March||style=text-align:left |The Oriental State of Uruguay changes its name to the Oriental Republic of Uruguay.\n|-\n|style=text-align:left |French West Africa is reorganized, with Upper Volta as a separate colony.\n|-\n|21 March||style=text-align:left |The Hungarian Soviet Republic supersedes the Hungarian People's Republic.\n|-\n|6 April||style=text-align:left |The Bavarian Soviet Republic supersedes the People's State of Bavaria.\n|-\n|19 April||style=text-align:left |Poland occupies Vilnius, which is disputed by the Lithuanians.\n|-\n|3 May||style=text-align:left |The Free State of Bavaria supersedes the Bavarian Soviet Republic.\n|-\n|rowspan=2 |6 May||style=text-align:left |The Kionga Triangle is assigned to Portugal as a mandate.\n|-\n|style=text-align:left |Kamerun and Togoland are assigned to France and the United Kingdom as mandates, respectively.\n|-\n|rowspan=5 |7 May||style=text-align:left |German New Guinea and the Bismarck Archipelago are assigned to Australia as a mandate.\n|-\n|style=text-align:left |German Southwest Africa is assigned to South Africa as a mandate under the name South West Africa.\n|-\n|style=text-align:left |German Samoa is assigned to New Zealand as a mandate under the name Territory of Western Samoa.\n|-\n|style=text-align:left |The German Northern Pacific Islands are assigned to Japan as the South Seas Mandate.\n|-\n|style=text-align:left |Nauru is assigned to the British Empire (eventually the United Kingdom, Australia, and New Zealand) as a mandate.\n|-\n|30 May||style=text-align:left |Ruanda and Urundi (minus Kisaka district) are assigned to Belgium as a mandate.\n|-\n|11 June||style=text-align:left|The Hutsul Republic is disestablished, incorporated into the First Czechoslovak Republic.\n|-\n|28 June||style=text-align:left |In the aftermath of World War I, the Treaty of Versailles and the Little Treaty of Versailles are signed, by the terms of which:\n*Eupen-Malmedy and Neutral Moresnet are ceded to Belgium.\n*Alsace-Lorraine is officially ceded to FranceFrance.\n*The Second Polish Republic is established in place of the puppet Kingdom of Poland. Most of Posen and West Prussia are ceded to Poland by Germany.\n*Memel and Saarland are put under international administration.\n*Plebiscites are provided for in Schleswig and Upper Silesia.\n*Danzig and the surrounding area are superseded by the Free City of Danzig, which is administered by the League of Nations.\n|-\n|10 July||style=text-align:left |France and the United Kingdom agree on a frontier between their mandates in the Cameroons.\n|-\n|2 August||style=text-align:left |The '''Hungarian People's Republic supersedes the Hungarian Soviet Republic.\n|-\n|rowspan=2 |8 August||style=text-align:left |Afghanistan declares its independence from the United Kingdom.\n|-\n|style=text-align:left |The Hungarian Republic''' supersedes the Hungarian People's Republic.\n|-\n|11 August||style=text-align:left |The German Reich supersedes the German Empire.\n|-\n|10 September||style=text-align:left |Austria signs the Treaty of Saint-Germain-en-Laye, by the terms of which:\n*Eastern Galicia is ceded to PolandPoland.\n*South Tyrol, Trentino, Trieste, and Istria are ceded to ItalyItaly.\n*Romanian sovereignty over Bukovina is recognized (union declared on 28 November 1918).\n*The independence of Poland, CzechoslovakiaCzechoslovakia, and the Kingdom of Serbs, Croats and Slovenes is recognized.\n|-\n|12 September||style=text-align:left |The Bonin–Pichon agreement transfers two desert strips from French control to Italian Libya.\n|-\n|18 September||style=text-align:left |The United States of America annexes the island of Largo Remo for the Panama Canal Zone.\n|-\n|25&nbsp;September||style=text-align:left |Spitsbergen is awarded to Norway.\n|-\n|27 November||style=text-align:left |Bulgaria signs the Treaty of Neuilly-sur-Seine, by the terms of which:\n*Western Thrace is ceded to the Entente.\n*The Kingdom of Serbs, Croats and Slovenes is recognized and a small amount of land along the western border is ceded to it.\n*Dobruja is returned to the Kingdom of Romania.\n|}\n1920s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=16 |1920||rowspan=2 |10 January||style=text-align:left |The United Kingdom officially takes over administration of German East Africa and changes its name to Tanganyika.\n|-\n|style=text-align:left |The League of Nations is founded.\n|-\n|2 February||style=text-align:left |The Estonian War of Independence ends with the Treaty of Tartu, which awards areas around Ivangorod (Jaanilinn) and Pechory (Petseri) from Soviet Russia to Estonia.\n|-\n|29 February||style=text-align:left |The Kingdom of Hungary supersedes the Hungarian Republic.\n|-\n|6 April||style=text-align:left |The Far Eastern Republic is established. Chita becomes the capital.\n|-\n|26 April||style=text-align:left |The '''Khorezm People's Soviet Republic supersedes the Khanate of Khiva.\n|-\n|28 April||style=text-align:left |The Azerbaijani Soviet Socialist Republic supersedes the Azerbaijan Democratic Republic.\n|-\n|Late April||style=text-align:left |Western Thrace is granted to the Kingdom of Greece by the Triple Entente.\n|-\n|4 June||style=text-align:left |Hungary signs the Treaty of Trianon, by the terms of which:\n*Transylvania and parts of Banat, Crișana, and Maramureș became part of the Kingdom of Romania.\n*Czechoslovakia is recognized.\n*The Kingdom of Serbs, Croats and Slovenes is recognized.\n|-\n|5 June||style=text-align:left |The Socialist Soviet Republic of Gilan declares independence from the Qajar Iran. The capital is Rasht.\n|-\n|9 July||style=text-align:left |Denmark officially incorporates Northern Schleswig following a plebiscite held earlier in the year.\n|-\n|23 July||style=text-align:left | The United Kingdom creates the Colony of Kenya from most part of the East Africa Protectorate.\n|-\n|25 September||style=text-align:left |The Sultanate of Muscat and Oman is reunified through an agreement which grants substantial autonomy and self-government to the Imamate of Oman but recognizes the sovereignty of the Sultanate of Muscat.\n|-\n|8 October||style=text-align:left |The Bukharan People's Soviet Republic supersede the Emirate of Bukhara.\n|-\n|rowspan=2 |29 November||style=text-align:left |The Armenian Soviet Socialist Republic supersedes the Democratic Republic of Armenia.\n|-\n|style=text-align:left |The remaining part of the East Africa Protectorate is renamed to the Protectorate of Kenya.\n|-\n|rowspan=12 |1921||25 February||style=text-align:left |The Georgian Soviet Socialist Republic supersedes the Democratic Republic of Georgia.\n|-\n|18 March||style=text-align:left |The Peace of Riga defines new borders between Poland and Soviet Russia, Soviet Ukraine, and Soviet Belarus.\n|-\n|1 June||style=text-align:left |France reorganizes French West Africa and the colony of Mauritania is established.\n|-\n|5 June||style=text-align:left |The Socialist Soviet Republic of Gilan is renamed to the Persian Socialist Soviet Republic.\n|-\n|14 August||style=text-align:left |The Tuvan People's Republic supersedes Tannu Uriankhai and changes the name of its capital from Belotsarsk to Kyzyl.\n|-\n|September||style=text-align:left |The Persian Socialist Soviet Republic officially came to an end.\n|-\n|18 September||style=text-align:left |The Rif Republic is declared in Spanish Morocco with no recognition.\n|-\n|12 October||style=text-align:left |Upper Silesia is divided between Poland and Germany.\n|-\n|rowspan=2 |13 October||style=text-align:left |In the Treaty of Kars, Turkey relinquishes claims to Armenia but gains the area around Kars and southern Achara.\n|-\n|style=text-align:left |Niger is established as a separate French colony. Zinder becomes the capital.\n|-\n|2 November||style=text-align:left |The Emirate of Jabal Shammar is defeated and annexed by the Sultanate of Nejd''' after the Conquest of Ha'il.\n|-\n|22 November||style=text-align:left |The United Kingdom recognizes the independence of Afghanistan.\n|-\n|rowspan=7 |1922||28 February||style=text-align:left |The Kingdom of Egypt gains independence from the United Kingdom. Cairo is the capital.\n|-\n|12 March||style=text-align:left |The Georgian Soviet Socialist Republic, Azerbaijani Soviet Socialist Republic, and the Armenian Soviet Socialist Republic unite to form the Transcaucasian Socialist Federative Soviet Republic. Baku and Yerevan yield to Tbilisi as the capital.\n|-\n|15 November||style=text-align:left |The Far Eastern Republic is disestablished and merged with the Russian Socialist Federative Soviet Republic.\n|-\n|17 November||style=text-align:left |The Ottoman Empire is dissolved. Its territories are mostly made protectorates of the victorious Allies of World War I.\n|-\n|6 December||style=text-align:left |The Irish Free State is constituted as an independent Dominion formed through the secession of the island of Ireland from the United Kingdom of Great Britain and Ireland. Dublin is the capital.\n|-\n|8 December||style=text-align:left |Northern Ireland secedes from the Irish Free State to again form a constituent country of the United Kingdom of Great Britain and Ireland.\n|-\n|30 December||style=text-align:left |The Russian Socialist Federative Soviet Republic, the Transcaucasian Socialist Federative Soviet Republic, the Ukrainian Soviet Socialist Republic, and the Byelorussian Soviet Socialist Republic unite to form the Union of Soviet Socialist Republics (Soviet Union). Tbilisi, Kharkov, and Smolensk yield to Moscow as the capital.\n|-\n|rowspan=4 |1923||1 February||style=text-align:left |The United States of America annexes the future location of Madden Lake for the Panama Canal Zone.\n|-\n|29 October||style=text-align:left |The Republic of Turkey is established following the fall of the Ottoman Empire. Ankara is the capital.\n|-\n|15 November||style=text-align:left |Honduras claims Swan Islands, creating a dispute with the United States of America.\n|-\n| ||style=text-align:left |The Kingdom of Belgium moves the capital of its colony of the Congo from Boma to Leopoldville.\n|-\n|rowspan=3 |1924||17 February||style=text-align:left |The '''Bukharan People's Soviet Republic joins the Soviet Union.\n|-\n|27 October||style=text-align:left |The Khorezm People's Soviet Republic joins the Soviet Union.\n|-\n|26 November||style=text-align:left |The Mongolian People's Republic is established. Ulan Bator is the capital.\n|-\n|rowspan=8 |1925||1 January||style=text-align:left |The Kingdom of Norway changes the name of its capital from Kristiania to Oslo.\n|-\n|22 January||style=text-align:left |The Republic of Albania supersedes the Principality of Albania.\n|-\n|4 March||style=text-align:left |The United States of America annexes Swains Island as part of American Samoa.\n|-\n|29 June||style=text-align:left |Britain transfers control of northern Jubaland to Italy, becoming the Italian colony of Oltre Giuba.\n|-\n|1 July||style=text-align:left |The Republic of China relocates its provisional capital from Nanking to Canton.\n|-\n|17 July||style=text-align:left |A treaty between the United States of America and Canada slightly adjusts the border between the two. Overall the United States gained between 30 and 35 acres.\n|-\n|1 September||style=text-align:left |Tarata is returned to Peru by Chile.\n|-\n|6 December||style=text-align:left |Britain adjusts the Egyptian border in favor of Italian Libya, giving it the Jarabub and Kufra oases.\n|-\n|rowspan=3 |1926||27 May||style=text-align:left |The Rif Republic is dissolved by Spanish and French occupation forces in Morocco.\n|-\n|9 June||style=text-align:left |Afghanistan becomes the Kingdom of Afghanistan.\n|-\n|30 June||style=text-align:left |Oltre Giuba is incorporated into Italian Somaliland.\n|-\n|rowspan=7 |1927||29 January||style=text-align:left |Within the Nejd and Hejaz, the Sultanate of Nejd is renamed the Kingdom of Nejd and its Dependencies.\n|-\n|12 April||style=text-align:left |The United Kingdom of Great Britain and Ireland changes its name to the United Kingdom of Great Britain and Northern Ireland.\n|-\n|9 May||style=text-align:left |The Commonwealth of Australia' moves its seat of parliament from Melbourne to the purpose-built capital of Canberra.\n|-\n|18 July||style=text-align:left |The United States of America annexes  of Taboga and Taboguilla for the Panama Canal Zone.\n|-\n|26 October||style=text-align:left |Two bancos along the Colorado River are ceded from Mexico to the United States of America.\n|-\n|28 October||style=text-align:left |The Republic of Ararat declares independence from Turkey.\n|-\n| ||style=text-align:left |In French Syria, the State of Souaida is renamed the Jabal Druze State, after the mountain called Jabal al-Druze.\n|-\n|rowspan=6 |1928||4 April||style=text-align:left |The United States of America cedes Palmas, American Territory of Philippines to the Netherlands after the Island of Palmas Case.\n|-\n|23 April||style=text-align:left |41 bancos are exchanged between Mexico and the United States of America.\n|-\n|26 May||style=text-align:left |The United States of America annexes the Las Adjuntas banco from Mexico.\n|-\n|1 September||style=text-align:left |The Kingdom of Albania supersedes the Republic of Albania.\n|-\n|24&nbsp;September||style=text-align:left |The United States of America annexes  of land at El Cerro de Doscientos Pies (\"200-Foot Hill\") near Las Minas Bay for the Panama Canal Zone.\n|-\n|29 December||style=text-align:left |The Republic of China establishes Nanking as its official capital, later codified in the Constitution of the Republic of China.\n|-\n|rowspan=8 |1929||January||style=text-align:left |The Emirate of Afghanistan supersedes the Kingdom of Afghanistan.\n|-\n|6 January||style=text-align:left |The Kingdom of Serbs, Croats and Slovenes is renamed the Kingdom of Yugoslavia.\n|-\n|2 February||style=text-align:left |Norway claims Peter I Island.\n|-\n|11 February||style=text-align:left |Vatican City gains independence from the Kingdom of Italy. Vatican City itself is the capital.\n|-\n|3 June||style=text-align:left |The Treaty of Lima in which Chile and Peru draw a new border in which Arica and its surrounding towns remains in Chile and Tacna and surrounding towns is set to be given back to Peru.\n|-\n|28 August||style=text-align:left |Tacna and its surrounding territory is returned to Peru by Chile.\n|-\n|October||style=text-align:left |The Kingdom of Afghanistan supersedes the Emirate of Afghanistan.\n|-\n|3 October||style=text-align:left |The Kingdom of Yugoslavia supersedes the Kingdom of Serbs, Croats and Slovenes.\n|}\n1930s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=12 |1930||4 February||style=text-align:left |The United States of America annexes the La Rana, El Pilon, Ojinaga, and El Mulato bancos from Mexico and Mexico annexes the Galindo, Haciendita, and San Rafael bancos from the United States.\n|-\n|19 February||style=text-align:left |The United States of America annexes the Aguilar, Tabalopa, Quibira, and Los Puliques bancos from Mexico.\n|-\n|3 March||style=text-align:left |The United States of America annexes the Bermudez, Compania Agricola, Charles Davis, Calero, Diablo, and Guayuco bancos from Mexico and Mexico annexes the Azcarate, Arroyo del Alamo, Newman, and Pruitt bancos from the United States.\n|-\n|18 March||style=text-align:left |The United States of America annexes the Weber banco from Mexico.\n|-\n|21 March||style=text-align:left |The United States of America annexes the San Lorenzo banco from Mexico.\n|-\n|9 April||style=text-align:left |The United States of America annexes the Gallego and Nunez bancos from Mexico.\n|-\n|25 April||style=text-align:left |The United States of America annexes the La Cachanilla, Rincon de Marcelino, and Camp Rice bancos from Mexico.\n|-\n|28 April||style=text-align:left |The United States of America annexes the El Carino banco from Mexico.\n|-\n|1 May||style=text-align:left |The United States of America annexes the Las Piedras and Max Muller bancos from Mexico.\n|-\n|22 July||style=text-align:left |The United States of America annexes  on Jicarita Island and  at Punta Morro de Puercos for the Panama Canal Zone.\n|-\n|1 October||style=text-align:left |British Weihaiwei is returned to China.\n|-\n|11 November||style=text-align:left |Norway rescinds its claim to the Sverdrup Islands; in return, the United Kingdom recognizes the Norwegian claim to Jan Mayen.\n|-\n|rowspan=11 |1931||15 January||style=text-align:left |The Belgian concession within the city of Tientsin is returned to China.\n|-\n|28 January||style=text-align:left |France officially annexes Isla de la Pasión as Clipperton Island.\n|-\n|14 April||style=text-align:left |The Second Spanish Republic supersedes the Monarchy of Spain. The Catalan Republic subsequently declares independence from Spain.\n|-\n|15 April||style=text-align:left |The United States of America annexes small areas around the Madden Dam for the Panama Canal Zone.\n|-\n|28 April||style=text-align:left |The Catalan Republic is taken over by Spain.\n|-\n|20 May||style=text-align:left |The United States of America annexes the La Pascualilla and Morales bancos from Mexico.\n|-\n|22 May||style=text-align:left |Mexico annexes the Ochoa and El Jazmin bancos from the United States of America.\n|-\n|12 June||style=text-align:left |The Australian territories of North Australia and Central Australia merge to form the Northern Territory.\n|-\n|10 July||style=text-align:left |Norway claims territory in eastern Greenland as Erik the Red's Land.\n|-\n|7 November||style=text-align:left |The Chinese Soviet Republic is established by the Chinese Communist Party as a group of discontiguous territories within the larger Republic of China.\n|-\n|11 December||style=text-align:left |By the Statute of Westminster 1931, the Irish Free State and the Union of South Africa become fully sovereign states.\n|-\n|rowspan=10 |1932||18 February||style=text-align:left |The Empire of Japan takes over northeastern China and establishes Manchukuo. Hsinking becomes its capital.\n|-\n|25 February||style=text-align:left |The United States of America annexes the El Morillo banco from Mexico.\n|-\n|12 May||style=text-align:left |The United States of America annexes the Diablo Segundo banco from Mexico.\n|-\n|17 May||style=text-align:left |Panama annexes a small area of land at Punta Paitilla from the United States' Panama Canal Zone.\n|-\n|4 June||style=text-align:left |The Republic of Chile changes its name to the Socialist Republic of Chile.\n|-\n|24 June||style=text-align:left |Following the revolution, Kingdom of Siam supersedes the Rattanakosin Kingdom. Bangkok remains the capital.\n|-\n|13 September||style=text-align:left |The Socialist Republic of Chile changes its name back to the Republic of Chile.\n|-\n|23 September||style=text-align:left |The personal union of the Kingdom of Nejd and Hejaz unify to form the Kingdom of Saudi Arabia.\n|-\n|3 October||style=text-align:left |The Iraqi Kingdom (Iraq) gains independence from the United Kingdom. Baghdad is the capital.\n|-\n|13 December||style=text-align:left |The United States of America annexes the Mangsee Island and seven of the Turtle Islands into the Commonwealth of the Philippines from the United Kingdom.\n|-\n|rowspan=5 |1933||23 March||style=text-align:left |Nazi Germany supersedes the Weimar Republic.\n|-\n|5 April||style=text-align:left |Erik the Red's Land in Greenland is ceded by Norway to Denmark.\n|-\n|13 June||style=text-align:left |The United Kingdom cedes Enderby Land and Victoria Land to Australia as the Australian Antarctic Territory.\n|-\n|17 July||style=text-align:left |Mexico annexes the Hollinsworth banco from the United States of America.\n|-\n|12 November||style=text-align:left |A Uyghur independence movement creates the Islamic Republic of East Turkistan. Kashgar is the capital.\n|-\n|rowspan=8 |1934||1 January||style=text-align:left |Italy creates Italian Libya with the merger of the colonies of Tripolitania, Cyrenaica, and Fezzan. The capital is Tripoli.\n|-\n|6 February||style=text-align:left |The Islamic Republic of East Turkistan is taken over by the Republic of China.\n|-\n|27 February||style=text-align:left |The United States of America annexes the Villarreales Segundo banco from Mexico.\n|-\n|1 March||style=text-align:left |Manchukuo is renamed Manchutikuo.\n|-\n|6 April||style=text-align:left |Spain establishes a protectorate in Ifni, in territory it had claimed since 1860.\n|-\n|6 October||style=text-align:left |The Catalan State proclaims itself independent of the Spanish Republic. Barcelona is the capital.\n|-\n|7 October||style=text-align:left |The Catalan State is disestablished and reabsorbed into the Spanish Republic.\n|-\n|15 October||style=text-align:left |The Chinese Soviet Republic is annexed by the Republic of China.\n|-\n|rowspan=8 |1935||7 January ||style=text-align:left |The Franco-Italian Agreement of 1935 de facto transfers the Aouzou Strip from French control to Italian control. The land is never officially ceded however, creating a territorial dispute that would ultimately lead to the 1978–87 Chadian–Libyan conflict. The dispute was solved by a 1994 International Court of Justice case, that stated the land belonged to Chad – the international border was what existed prior to the aforementioned 1935 agreement.\n|-\n|21 March||style=text-align:left |Reza Shah Pahlavi changes the name of the Imperial State of Persia to the Imperial State of Iran.\n|-\n|26 March||style=text-align:left |Jarvis Island is transferred from the United Kingdom to the United States.\n|-\n|1 April||style=text-align:left |The Territory of the Saar Basin is taken over by Nazi Germany.\n|-\n|3 October||style=text-align:left |Italy invades Ethiopia, beginning the Second Italo-Ethiopian War.\n|-\n|3 November||style=text-align:left |The Hellenic Republic is renamed the Kingdom of Greece after a coup d'état and a referendum staged by Georgios Kondylis to restore the monarchy under King George II of Greece.\n|-\n|15 November||style=text-align:left |The United States territory of the Philippines becomes the semi-independent Commonwealth of the Philippines.\n|-\n|25 November||style=text-align:left |The East Hebei Autonomous Government is created in China after the invasion of eastern Hebei by the Empire of Japan. Tongzhou is the capital.\n|-\n|rowspan=12 |1936||7 March||style=text-align:left |Nazi Germany unilaterally remilitarises the Rhineland region, which was made demilitarised after the First World War.\n|-\n|9 May||style=text-align:left |The Ethiopian Empire is taken over by Italy as Italian Ethiopia following the Italian victory in the Second Italo-Abyssinian War.\n|-\n|1 June||style=text-align:left |The Italian colonies of Eritrea, Ethiopia, and Italian Somaliland merge to form Italian East Africa.\n|-\n|17 July||style=text-align:left |Spanish Nationalist forces take over Spanish Morocco, starting the Spanish Civil War.\n|-\n|23 July||style=text-align:left |The Spanish State under Nationalist rebel leader Francisco Franco proclaims itself the sole government of Spain.\n|-\n|6 August||style=text-align:left |The United Kingdom claims Enderbury Island and McKean Island and reasserts its claim to Kanton Island.\n|-\n|September||style=text-align:left |Ifni and Spanish Sahara are taken over by Spanish Nationalist forces.\n|-\n|14 October||style=text-align:left |Spanish Guinea is taken over by Spanish Nationalist forces.\n|-\n|2 December||style=text-align:left |In the French Mandate of Syria, the Jabal ad-Druze is integrated into the Syrian Republic.\n|-\n|5 December||style=text-align:left |In the French Mandate of Syria, the Alawite State is integrated into the Syrian Republic.\n|-\n|22 December||style=text-align:left |The Anglo-Egyptian Treaty of 1936 is ratified and all British troops are withdrawn from Egypt, except for within the Suez Canal Zone.\n|-\n| ||style=text-align:left |The former colony of Curaçao and Dependencies is renamed the Territory of Curaçao following the implementation of several laws resulting from the 1922 abolition of colonies in the Kingdom of the Netherlands. Willemstad on Curaçao remains the capital.\n|-\n|rowspan=6 |1937||rowspan=2 |1 April||style=text-align:left |The Aden Settlement is separated from British India and changed into the Aden Colony and Protectorate. The city of Aden becomes the capital.\n|-\n|style=text-align:left |British Burma is separated from the British Raj and becomes a separate British colony. Rangoon becomes the colony's capital.\n|-\n|22 November||style=text-align:left |The Mongol Military Government is renamed the Mongol United Autonomous Government.\n|-\n|5 December||style=text-align:left |The Japanese invade Shanghai, creating the Dadao Municipal Government of Shanghai.\n|-\n|14 December||style=text-align:left |The Japanese invasion of China continues with the creation of the Provisional Government of the Republic of China.\n|-\n|29 December||style=text-align:left |The Irish Free State changes its name to Ireland.\n|-\n|rowspan=10 |1938||12 January||style=text-align:left |Tristan da Cunha becomes a dependency of Saint Helena, a crown colony of the United Kingdom.\n|-\n|14 January||style=text-align:left |Norway lays claims in Antarctica as Queen Maud Land, which lies between 20° west and 45° east.\n|-\n|8 March||style=text-align:left |The United States claims the Canton and Enderbury Islands.\n|-\n|13 March||style=text-align:left |Nazi Germany annexes the Federal State of Austria in the Anschluss. Vienna yields to Berlin as the capital.\n|-\n|28 March||style=text-align:left |The Reformed Government of the Republic of China is formed after Japan invades northeastern China.\n|-\n|29 July||style=text-align:left |The Australian Federal Capital Territory is renamed the Australian Capital Territory.\n|-\n|7 September||style=text-align:left |The area known as Hatay gains independence from French Syria as the Hatay State.\n|-\n|rowspan=2 |30 September||style=text-align:left |The Munich Agreement transfers the Sudetenland from Czechoslovakia to Germany and gives parts to Hungary and Poland.\n|-\n|style=text-align:left |The Czechoslovak Republic is renamed the Second Czechoslovak Republic.\n|-\n||3 October||style=text-align:left |Transfer by the United Kingdom to Ireland of all Treaty Ports is completed.\n|-\n|rowspan=22 |1939||14 March||style=text-align:left |Czechoslovakia is dissolved as it is occupied by Nazi Germany. Germany establishes Slovak State as a puppet state.\n|-\n|15 March||style=text-align:left |Carpatho-Ukraine is proclaimed but remains unrecognized, and the same day is occupied and annexed by Hungary.\n|-\n|16 March||style=text-align:left |The Protectorate of Bohemia and Moravia is proclaimed as a German protectorate.\n|-\n|23 March||style=text-align:left |Germany annexes the Klaipėda Region/Memel Territory from Lithuania.\n|-\n|1 April||style=text-align:left |The Spanish State supersedes the Second Spanish Republic with the Nationalist victory in the Spanish Civil War.\n|-\n|3 April||style=text-align:left |The United States of America annexes the Lozano banco from Mexico.\n|-\n|6 April||style=text-align:left |The islands of Canton and Enderbury are put under the Canton and Enderbury Islands condominium of the United States and the United Kingdom.\n|-\n|12 April||style=text-align:left |Italy annexes the Albanian Kingdom.\n|-\n|23 June||style=text-align:left |The Kingdom of Siam changes its name to the Kingdom of Thailand.\n|-\n|10 July||style=text-align:left |Nazi Germany changes its name to the Greater German Empire.\n|-\n|23 July||style=text-align:left |Turkey fully annexes the Republic of Hatay.\n|-\n|27 July||style=text-align:left |Panama annexes a corridor of land connecting both separated pieces of the United States' Panama Canal Zone.\n|-\n|16 August||style=text-align:left |The United States of America claims Fakaofo, Funafuti, Hull Island, Niulakita, Nukufetau, and Nukulaelae.\n|-\n|rowspan=2 |1 September||style=text-align:left |World War II begins with the invasion of Poland by Nazi Germany.\n|-\n|style=text-align:left |Japanese-occupied Mengjiang is renamed the Mengjiang United Autonomous Government.\n|-\n|2 September||style=text-align:left |The Free City of Danzig is annexed by Germany. Danzig yields to Berlin as the capital.\n|-\n|14 September||style=text-align:left |The colonies of French Guiana, Guadeloupe, Inini, Martinique, and Saint Pierre and Miquelon merge into the colony of the French Antilles and Guiana.\n|-\n|17 September||style=text-align:left |The Soviet Union invades the Republic of Poland.\n|-\n|28&nbsp;September||style=text-align:left |The government of the Republic of Poland collapses, inviting military occupation by Nazi Germany.\n|-\n|6 October||style=text-align:left |The former territory of the Republic of Poland is partitioned between Nazi Germany and the Soviet Union, per the terms of the Molotov–Ribbentrop Pact.\n|-\n|12 October||style=text-align:left |The General Government for the Occupied Polish Territories is created after the invasion of the Republic of Poland by Nazi Germany.\n|-\n|1 December||style=text-align:left |The Finnish Democratic Republic is created after the invasion of Finland by the Soviet Union. Terijoki is the de facto capital.\n|}\n1940s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=35 |1940||12 March||style=text-align:left |The Winter War ends with the Moscow Peace Treaty redrawing the Soviet-Finnish border. The Karelo-Finnish Soviet Socialist Republic is formed when Soviet forces invade the Finnish Democratic Republic. Petrozavodsk is the capital.\n|-\n|30 March||style=text-align:left |The Provisional Government of the Republic of China and the Reformed Government of the Republic of China merge to form the Reorganized National Government of China.\n|-\n|9 April||style=text-align:left |The Kingdom of Denmark is invaded by Germany, while Greenland is granted autonomy.\n|-\n|12 April||style=text-align:left |The Faroe Islands are put under temporary British occupation on behalf of the Government of Denmark.\n|-\n|rowspan=2 |10 May||style=text-align:left |The Military Administration of Luxembourg and the Civil Administration Area of Luxembourg are created when German forces invade the Grand Duchy of Luxembourg. Luxembourg City is the capital.\n|-\n|style=text-align:left |The United Kingdom invades and occupies Iceland.\n|-\n|14 May||style=text-align:left |The Reich Commissariat for the Occupied Dutch Territories is created when German forces invade the Kingdom of the Netherlands. Amsterdam is the capital.\n|-\n|17 May||style=text-align:left |The Military Administration in Belgium and Northern France and the Realm Commissariat of Belgium and Northern France are created when German forces invade the Kingdom of Belgium. Brussels is the capital.\n|-\n|6 June||style=text-align:left |Mexico annexes the Progreso and Las Flores bancos from the United States.\n|-\n|7 June||style=text-align:left |The Realm Commissariat for the Occupied Norwegian Territories is created when Germany invades the Kingdom of Norway and its possessions. Oslo is the capital.\n|-\n|rowspan=2 |15 June||style=text-align:left |The Soviet Union invades Lithuania.\n|-\n|style=text-align:left |Germany annexes Alsace-Lorraine from France.\n|-\n|17 June||style=text-align:left |The Soviet Union invades Estonia and Latvia.\n|-\n|22 June||style=text-align:left |The French Republic is renamed the French State (Vichy France).\n|-\n|28 June||style=text-align:left |The Soviet Union occupies the Bessarabia and northern Bukovina regions of Romania.\n|-\n|30 June||style=text-align:left |The Bailiwick of Guernsey is occupied by Germany.\n|-\n|1 July||style=text-align:left |The Bailiwick of Jersey is occupied by Germany.\n|-\n|21 July||style=text-align:left |The Estonian, Latvian, and Lithuanian Soviet Socialist Republics are declared in Soviet-occupied Estonia, Latvia, and Lithuania. Most of the international community does not recognize Soviet rule in these occupied countries and some continue to recognize their diplomatic legations abroad.\n|-\n|31 July||style=text-align:left |The General Government for the Occupied Polish Territories is renamed the General Government.\n|-\n|2 August||style=text-align:left |The Moldavian Soviet Socialist Republic is created from a larger part of Bessarabia, a region annexed from Romania, and integrated into the Soviet Union as the 13th union republic.\n|-\n|3 August||style=text-align:left |The Lithuanian SSR is annexed into the Soviet Union as the 14th union republic.\n|-\n|5 August||style=text-align:left |The Latvian SSR is annexed into the Soviet Union as the 15th union republic.\n|-\n|6 August||style=text-align:left |The Estonian SSR is annexed into the Soviet Union as the 16th union republic.\n|-\n|19 August||style=text-align:left |British Somaliland is taken over by Italian forces and becomes a part of Italian East Africa.\n|-\n|26 August||style=text-align:left |Chad is taken over by Free France.\n|-\n|30 August||style=text-align:left |The Second Vienna Award transfers Northern Transylvania from Romania to Hungary.\n|-\n|2 September||style=text-align:left |French Oceania is taken over by forces loyal to the Free French Forces (FFF).\n|-\n|7 September||style=text-align:left |The Treaty of Craiova transfers Southern Dobruja from Romania to Bulgaria.\n|-\n|rowspan=2 |9 September||style=text-align:left |Fascist Italy invades the Kingdom of Egypt.\n|-\n|style=text-align:left |French India is taken over by forces loyal to the Free French Forces (FFF).\n|-\n|22 September||style=text-align:left |New Caledonia and Dependencies are taken over by forces loyal to the Free French Forces (FFF).\n|-\n|28 October||style=text-align:left |Fascist Italy invades Kingdom of Greece, beginning the Greco-Italian War.\n|-\n|4 November||style=text-align:left |The international city of Tangier is taken over by the State of Spain.\n|-\n|6 November||style=text-align:left |Chile officially declares the Chilean Antarctic Territory between longitudes 53°W and 90°W, stating that the historical basis comes from the Spanish Governorate of Terra Australis from 1539.\n|-\n|12 November||style=text-align:left |French Gabon is taken over by forces loyal to the Free French Forces (FFF), who had invaded from the rest of French Equatorial Africa.\n|-\n|rowspan=39 |1941||February||style=text-align:left |Cyrenaica is taken over by the United Kingdom.\n|-\n|18 February||style=text-align:left |The United States annexes the San Antonio and Angostura bancos from Mexico and Mexico annexes the Casner and Ruidosa bancos from the United States.\n|-\n|26 February||style=text-align:left |Allied forces take over Italian Somaliland, which is placed under the protection of the United Kingdom.\n|-\n|1 March||style=text-align:left |The Tsardom of Bulgaria joins the Axis powers.\n|-\n|16 March||style=text-align:left |The British Somaliland protectorate is taken over by Allied forces.\n|-\n|25 March||style=text-align:left|The Kingdom of Yugoslavia joins the Axis powers'.\n|-\n|27 March||style=text-align:left|Yugoslav coup d'état takes Yugoslavia out of the Axis powers.\n|-\n|6 April||style=text-align:left |The Axis powers of Germany, Italy, and Bulgaria invade the Kingdom of Yugoslavia.\n|-\n|9 April||style=text-align:left |Greenland and the Kingdom of Iceland are put under United States protection from the Danish government-in-exile.\n|-\n|10 April||style=text-align:left |The Axis powers establish the Independent State of Croatia in occupied Yugoslavia.\n|-\n|18 April||style=text-align:left |The Kingdom of Yugoslavia is fully occupied by the Axis powers, and is dissolved.\n|-\n|23 April||style=text-align:left |Greece is fully occupied by the Axis powers, ending the Greco-Italian War.\n|-\n|30 April||style=text-align:left |The Military Administration in Serbia is created by Germany in occupied Yugoslavia.\n|-\n|rowspan=2 |2 May||style=text-align:left |The United States annexes the Las Ruelas banco from Mexico and Mexico annexes the Nogales banco from the United States.\n|-\n|style=text-align:left|United Kingdom invades the Kingdom of Iraq following a pro-Axis coup d'état, beginning the Anglo-Iraqi War.\n|-\n|5 May||style=text-align:left |The Ethiopian Empire is revived by Allied forces after being taken from Italian control, and Emperor Haile Selassie is restored to his throne.\n|-\n|19 May||style=text-align:left |Italian Eritrea is taken over by the United Kingdom.\n|-\n|31 May||style=text-align:left |The Anglo-Iraqi War ends with the United Kingdom in control of the Kingdom of Iraq.\n|-\n|22 June||style=text-align:left |Germany invades the Soviet Union, beginning the Eastern Front of the Second World War.\n|-\n|25 June||style=text-align:left |Finland invades the Soviet Union, beginning the Continuation War.\n|-\n|July||style=text-align:left |Vichy France agrees to share French Indochina with the Empire of Japan.\n|-\n|5 July||style=text-align:left |Beginning of the Ecuadorian–Peruvian War over border disputes between the two countries.\n|-\n|12 July||style=text-align:left |Italy creates the protectorate of the Kingdom of Montenegro in occupied Yugoslavia.\n|-\n|14 July||style=text-align:left |Following the Syria–Lebanon campaign, the Vichy French territories of Syria and Lebanon are taken over by Allied forces.\n|-\n|rowspan=2 |17 July||style=text-align:left |Germany creates the Reichskommissariat Ostland in land occupied from the Soviet Union that previously made up the Baltic States.\n|-\n|style=text-align:left |Germany creates the Reichskommissariat Ukraine in occupied Soviet Union.\n|-\n|31 July||style=text-align:left |Fighting in Ecuadorian–Peruvian War ends.\n|-\n|25 August||style=text-align:left |The United Kingdom and Soviet Union jointly invade Iran.\n|-\n|31 August||style=text-align:left |After the Anglo-Soviet invasion of Iran, Iran is occupied by the United Kingdom and the Soviet Union.\n|-\n|28 November||style=text-align:left |Italian East Africa is taken over by Allied forces.\n|-\n|8 December||style=text-align:left |The Japanese begin the invasion of Malaya in the State of Perlis Indera Kavangan, eventually occupying it as Japanese Malaya.\n|-\n|10 December||style=text-align:left |The Territory of Guam is taken over by Japan from the United States as Omiya Jima.\n|-\n|11 December||style=text-align:left |The Japanese take the State of Terengganu Darul Iman from the United Kingdom and incorporate it into Japanese Malaya.\n|-\n|14 December||style=text-align:left |Within British Malaya, the State of Kedah Darul Aman is taken over by Japan.\n|-\n|21 December||style=text-align:left |Mexico annexes the Las Antonias and El Comedor bancos from the United States.\n|-\n|22 December||style=text-align:left |Within British Malaya, the State of Kelantan Darul Naim is taken over by Japan.\n|-\n|23 December||style=text-align:left |Wake Island is taken over by Japan from the United States as Otori Jima.\n|-\n|24 December||style=text-align:left |The Japanese occupy the Kingdom of Sarawak as Sarawak.\n|-\n|25 December||style=text-align:left |The Japanese occupy British Hong Kong as the Hong Kong Occupied Territory.\n|-\n|rowspan=25 |1942||2 January||style=text-align:left |The Japanese occupy the Commonwealth of the Philippines from the United States as the Philippines.\n|-\n|6 January||style=text-align:left |The Japanese occupy the State of Brunei Darussalam from the United Kingdom.\n|-\n|18 January||style=text-align:left |The Japanese occupy Bourneo Kita from the United Kingdom.\n|-\n|31 January||style=text-align:left |The Japanese occupy the State of Johor Darul Ta'zim and the Federated Malay States from the United Kingdom as part of Japanese Malaya.\n|-\n|15 February||style=text-align:left |The Japanese occupy Singapore from the United Kingdom as Syonan-to.\n|-\n|20 February||style=text-align:left |The Japanese occupy Portuguese Timor and Dutch Timor as Timor.\n|-\n|27 February||style=text-align:left |The United States annexes the Las Palomas banco from Mexico.\n|-\n|8 March||style=text-align:left |The Japanese occupy the Netherlands East Indies from the Netherlands as Indonesia.\n|-\n|23 March||style=text-align:left |The Japanese occupy the Andaman and Nicobar Islands from the United Kingdom.\n|-\n|31 March||style=text-align:left |The Japanese occupy Christmas Island and the Straits Settlements from the United Kingdom as part of Japanese Malaya.\n|-\n|7 June||style=text-align:left |The Japanese occupy Atsuta Jima and Narukami Jima from the United States.\n|-\n|1 August||style=text-align:left |The Japanese occupy Burma from the United Kingdom.\n|-\n|26 August||style=text-align:left |The Japanese occupy Banaba Island and Nauru from the United Kingdom.\n|-\n|30 August||style=text-align:left |The Civil Administration Area of Luxembourg ends and Luxembourg is annexed into Germany.\n|-\n|9 October||style=text-align:left |The Commonwealth of Australia ceases to be a Dominion within the British Empire.\n|-\n|23 October||style=text-align:left |Allied forces take Tripolitania from Italy, and it becomes an occupied territory of the United Kingdom.\n|-\n|rowspan=2 |November||style=text-align:left |The British Military Administration of Libya begins when British forces invade Cyrenaica from Egypt.\n|-\n|style=text-align:left |Allied forces take French West Africa from Vichy France.\n|-\n|1 November||style=text-align:left |The Karafuto Prefecture is integrated into Mainland Japan.\n|-\n|8 November||style=text-align:left |Allied forces take the Kingdom of Morocco from Vichy France.\n|-\n|rowspan=2 |11 November||style=text-align:left |Italy occupies Corsica in Operation Anton.\n|-\n|style=text-align:left |Italy invades and occupies Monaco, installing a puppet state.\n|-\n|28 November||style=text-align:left |Allied forces take Réunion from Vichy France.\n|-\n|14 December||style=text-align:left |Allied forces take Madagascar from Vichy France.\n|-\n|28 December||style=text-align:left |Allied forces take French Somaliland from Vichy France.\n|-\n|rowspan=24 |1943||January||style=text-align:left |The French Military Territory of Fezzan-Ghadames is created when Free French Forces from Chad invade southern Italian Libya. Sabha is the capital.\n|-\n|February||style=text-align:left |Kouang-Tchéou-Wan is conquered by Japan.\n|-\n|12 May||style=text-align:left |Axis powers lose their last territory in Africa with the allied occupation of northern Tunisia.\n|-\n|30 May||style=text-align:left |Attu Island is reconquered by the United States.\n|-\n|26 June||style=text-align:left |The German Reich is officially renamed the Nazi Germany|Greater German Reich.\n|-\n|9 July||style=text-align:left |The Allies begin the invasion of Sicily.\n|-\n|30 July||style=text-align:left |The Shanghai French Concession and the Tientsin French Concession are taken over by Japan.\n|-\n|1 August||style=text-align:left |Burma is given independence under Japanese occupation as the State of Burma.\n|-\n|15 August||style=text-align:left |Kiska is reconquered by the United States after an Allied invasion.\n|-\n|September||style=text-align:left |The French Antilles and Guiana is split into French Guiana, Guadeloupe, Inini, Martinique, and Saint Pierre and Miquelon.\n|-\n|3 September||style=text-align:left |The Allies begin the invasion of mainland Italy.\n|-\n|rowspan=2 |8 September||style=text-align:left|Italy surrenders to the Allied powers, and is invaded by Germany, beginning the Italian Civil War.\n|-\n|style=text-align:left |The Albanian Kingdom becomes a protectorate of Germany from Italy.\n|-\n|9 September||style=text-align:left |Corsica becomes an occupied territory under Germany.\n|-\n|10 September||style=text-align:left |The Kingdom of Montenegro becomes a protectorate under Germany.\n|-\n|11 September||style=text-align:left |The Dodecanese Islands become an occupied territory under Germany.\n|-\n|18 September||style=text-align:left |Sardinia is taken over by the Allies.\n|-\n|23 September||style=text-align:left |The part of Italy under German occupation is made into a separate country as the National Republican State of Italy.\n|-\n|4 October||style=text-align:left |Corsica is liberated by the Allies.\n|-\n|14 October||style=text-align:left |The Japanese-occupied Philippines is given independence as the Republic of the Philippines.\n|-\n|23 October||style=text-align:left |The Andaman and Nicobar Islands are taken over by Allied forces.\n|-\n|22 November||style=text-align:left |The State of Greater Lebanon and the Syrian Republic, which together comprise the Mandate of Syria, are given independence as the Lebanese Republic and the Syrian Republic, respectively.\n|-\n|1 December||style=text-align:left |The National Republican State of Italy is renamed the Italian Social Republic.\n|-\n|15 December||style=text-align:left |The United States annexes the Rock Bend, La Parida, and Los Fresnos bancos from Mexico and Mexico annexes the Orrbe banco from the United States.\n|-\n|rowspan=29 |1944||2 February||style=text-align:left |The Reichskommissariat Ukraine (Ukraine) is taken back by the Soviet Union from German occupation.\n|-\n|3 February||style=text-align:left |The Marshall Islands are taken over by the United States from the Empire of Japan.\n|-\n|12 March||style=text-align:left |Germany occupies the Kingdom of Hungary, another Axis country, in Operation Margarethe.\n|-\n|5 June||style=text-align:left |The United States annexes the Cerros Colorados, Farias, EL Bano, Grande, Fierro, Adalberto, Martinez, Bonifacio, Pilares, Pilarito, and Cajoncitos bancos from Mexico and Mexico annexes the Bosque Bonito banco from the United States.\n|-\n|6 June||style=text-align:left |The Allies begin the liberation of France with the Normandy landings into German occupied territory.\n|-\n|17 June||style=text-align:left |The Kingdom of Iceland ends its personal union with the Kingdom of Denmark, becoming the Republic of Iceland.\n|-\n|19 June||style=text-align:left |The United States purchases Water Island in the Caribbean from the East Asiatic Company, a private shipping company based in Denmark (which at the time was under German occupation).\n|-\n|9 August||style=text-align:left |Vichy France is disestablished by ordinance of the newly created Provisional Government of the French Republic during the Liberation of France by Allied forces. The Vichy administration nominally continues to govern from the Sigmaringen enclave in Germany, but no longer controls any territory in Mainland France.\n|-\n|10 August||style=text-align:left |Omiya Jima is taken over by the United States from the Empire of Japan.\n|-\n|20 August||style=text-align:left |Clipperton Island is returned to the Provisional Government of the French Republic.\n|-\n|3 September||style=text-align:left |The Military Administration in Belgium and North France is liberated from Nazi Germany. The Kingdom of Belgium is reformed, and the Belgian Congo is put under the Belgian government's control after having remained loyal to the government-in-exile.\n|-\n|8 September||style=text-align:left |The Independent State of Macedonia is created in Bulgarian-controlled Macedonia.\n|-\n|11 September||style=text-align:left |The Grand Duchy of Luxembourg is liberated from Germany.\n|-\n|17 September||style=text-align:left |Germany invades and takes over San Marino.\n|-\n|19 September||style=text-align:left |Finland and the Soviet Union sign the Moscow Armistice, handing control of Petsamo Province to the Soviet Union.\n|-\n|20 September||style=text-align:left |San Marino is liberated by the Allies.\n|-\n|11 October||style=text-align:left |The Soviet Union annexes the Tuvan People's Republic.\n|-\n|rowspan=2 |13 October||style=text-align:left |The Kingdom of Greece returns to power after Athens is recovered.\n|-\n|style=text-align:left |The Reichskommissariat Ostland is completely taken over by Allied forces and integrated into the Soviet Union.\n|-\n|16 October||style=text-align:left |In the Kingdom of Hungary, the Government of National Unity is established with the support of Germany, though the boundaries of the state itself remain unchanged.\n|-\n|rowspan=2 |20 October||style=text-align:left |The Albanian Kingdom is liberated from the Axis powers as the Democratic Government of Albania.\n|-\n|style=text-align:left |The Military Administration in Serbia is liberated from the Axis forces, and Yugoslavia resumes control of it.\n|-\n|3 November||style=text-align:left |The Hellenic State is completely liberated from Axis forces. The Kingdom of Greece takes over the rest of it.\n|-\n|12 November||style=text-align:left |The East Turkestan Republic declares independence from the Republic of China.\n|-\n|13 November||style=text-align:left |The Independent State of Macedonia is liberated from Axis forces, and Yugoslavia resumes control of it.\n|-\n|rowspan=2 |15 December||style=text-align:left |The Kingdom of Montenegro, a puppet state of the Italian Social Republic (itself a puppet state of Germany), is taken over by Allied forces.\n|-\n|style=text-align:left |The Reichskommissariat of Belgium and Northern France is annexed into Germany, despite now being entirely controlled by the Allies.\n|-\n|21 December||style=text-align:left |The Weil and Las Antonias bancos are annexed by Mexico from the United States.\n|-\n|31 December||style=text-align:left |The Republic of Poland gains independence.\n|-\n|rowspan=67 |1945||17 January||style=text-align:left |The Polish area of the General Government is liberated from Germany by Allied forces.\n|-\n|8 March||style=text-align:left |The Kingdom of Hungary is liberated from Nazi Germany.\n|-\n|11 March||style=text-align:left |The Empire of Vietnam declares independence from Japan under its occupation.\n|-\n|16 March||style=text-align:left |The United States annexes the Candelaria, Candela, Tascate, Chinati, Mimbres, La Quemada, and Buenavista bancos from Mexico and Mexico annexes the El Comedor, Kilpatrick, Palo Blanco, Guadelupe, and Gleim bancos from the United States.\n|-\n|18 March||style=text-align:left |The Kingdom of Cambodia declares independence from Japan under its occupation.\n|-\n|20 March||style=text-align:left |France regains Alsace-Lorraine.\n|-\n|27 March||style=text-align:left |The State of Burma is taken back over by Allied forces and becomes the British crown colony of Burma.\n|-\n|rowspan=2 |3 April||style=text-align:left |The Czechoslovak Republic is liberated from Germany.\n|-\n|style=text-align:left |The United States takes over the Ryukyu Islands and administers it as the United States Civil Administration of the Ryukyu Islands.\n|-\n|4 April||style=text-align:left |The Slovak Republic is liberated and given to the Czechoslovak Republic.\n|-\n|8 April||style=text-align:left |The Kingdom of Laos declares independence under Japanese occupation, while Japanese Indochina ceases to exist as a political entity.\n|-\n|25 April||style=text-align:left |The Italian Social Republic is recovered from Germany and given to the Kingdom of Italy.\n|-\n|27 April||style=text-align:left |The second Republic of Austria is established in occupied Austria. Vienna is the capital. Its independence is recognised by the Allies.\n|-\n|1 May||style=text-align:left |Following the death of Adolf Hitler and the Allied victory in the Battle of Berlin, the government of Germany is moved to Flensburg and the Flensburg Government is created under Admiral Karl Doenitz.\n|-\n|rowspan=2 |5 May||style=text-align:left |The occupation of the Kingdom of Denmark by the Flensburg Government ends. Greenland is returned to Denmark from United States protection.\n|-\n|style=text-align:left |The Reichskommissariat Niederlande (the Netherlands) is liberated and merged with the colonies of Curaçao and Dependencies and the Surinam, which had remained loyal to the government-in-exile, to form the Kingdom of the Netherlands.\n|-\n|7 May||style=text-align:left |The Dodecanese Islands are taken over by Allied forces and given to the Kingdom of Greece.\n|-\n|rowspan=2 |8 May||style=text-align:left |Germany formally surrenders to Allied forces, ending World War II in Europe.\n|-\n|style=text-align:left |The Independent State of Croatia is taken over by Allied forces and given back to Yugoslavia.\n|-\n|rowspan=2 |9 May||style=text-align:left |Reichskommissariat Norwegen (Norway) is liberated by Allied forces and its possessions are returned (Bouvet Island, Peter I Island, and Queen Maud Land).\n|-\n|style=text-align:left |The Channel Islands are liberated from Germany to the United Kingdom as the Bailiwick of Guernsey and the Bailiwick of Jersey.\n|-\n|13 May||style=text-align:left |The Protectorate of Bohemia and Moravia is integrated back into Czechoslovakia.\n|-\n|14 June||style=text-align:left |The State of Brunei is retaken by the United Kingdom and is classified as a protectorate.\n|-\n|rowspan=2 |29 June||style=text-align:left |A treaty is signed between the Soviet Union and Czechoslovakia by which the Soviet Union annexes Subcarpathian Ruthenia.\n|-\n|style=text-align:left |Two bancos are annexed by both the United States and Mexico from one another.\n|-\n|11 August||style=text-align:left |The Japanese-occupied Empire of Vietnam is taken back by France.\n|-\n|rowspan=3 |15 August||style=text-align:left |Korea gains independence from the Empire of Japan. Seoul is the capital.\n|-\n|style=text-align:left |The Great Empire of Manchuria is taken over by the Soviet Union.\n|-\n|style=text-align:left |French Indochina is recovered by France.\n|-\n|16 August||style=text-align:left |Hong Kong is liberated from Japan by Allied forces and put under British rule.\n|-\n|rowspan=2 |17 August||style=text-align:left |The de facto Republic of Indonesia declares independence under Japanese and Allied occupation.\n|-\n|style=text-align:left |The Commonwealth of the Philippines takes over the Japanese-occupied independent Republic of the Philippines.\n|-\n|18 August||style=text-align:left |The Japanese create a separate political entity for the Andaman and Nicobar Islands.\n|-\n|22 August||style=text-align:left |The Kwantung Leased Territory is returned to the Republic of China.\n|-\n|28 August||style=text-align:left |British Hong Kong becomes a crown colony.\n|-\n|30 August||style=text-align:left |Bảo Đại abdicates. End of the Nguyễn dynasty in Vietnam.\n|-\n|31 August||style=text-align:left |The United States captures Minami-Tori-shima from the Empire of Japan.\n|-\n|September||style=text-align:left |The concessions in Shanghai, Tientsin, and Kouang-Tchéou-Wan are re-controlled by France.\n|-\n|rowspan=3 |2 September||style=text-align:left |The Empire of Japan formally surrenders to Allied forces, ending World War II in the Pacific.\n|-\n|style=text-align:left |The Democratic Republic of Vietnam declares its independence from the French Republic. Hanoi is the capital.\n|-\n|style=text-align:left |The capital of the Republic of China is moved from Chungking back to Nanking.\n|-\n|3 September||style=text-align:left |The United States occupies the Bonin Islands and Volcano Islands from Japan.\n|-\n|4 September||style=text-align:left |The United States occupies Wake Island from Japan.\n|-\n|rowspan=2 |8 September||style=text-align:left |The Kingdom of Thailand changes its name back to the Kingdom of Siam.\n|-\n|style=text-align:left |The following states are freed from the Empire of Japan (which becomes occupied by Allied forces) and become their own states within British Malaya:\n*State of Kedah Darul Aman\n*State of Kelantan Darul Naim\n*State of Perlis Indera Kayangan\n*State of Terengganu Darul Iman\n|-\n|9 September||style=text-align:left |The Reorganized National Government of the Republic of China is taken over by the Republic of China.\n|-\n|10 September||style=text-align:left |Bourneo Kita and the occupation of the British protectorate of the Kingdom of Sarawak are taken back over by the United Kingdom.\n|-\n|11 September||style=text-align:left |In occupied Japan, Timor is split between the Portuguese East Timor and the Dutch West Timor.\n|-\n|rowspan=2 |12 September||style=text-align:left |Malaya is given back to the United Kingdom from occupied Japan and is split into the Federated Malay States and the '''State of Johor Darul Ta'zim.\n|-\n|style=text-align:left |Syonan-to is taken back over by the United Kingdom from Japan as the Straits Settlements. Singapore is the capital.\n|-\n|13 September||style=text-align:left |Nauru is taken over by Allied forces and placed under a United Nations trusteeship administered by Australia, New Zealand, and the United Kingdom.\n|-\n|15 September||style=text-align:left |The Soviet Union occupation of the People's Republic of Korea ends.\n|-\n|16 September||style=text-align:left |The British occupation of the Faroe Islands ends and is handed back to Denmark.\n|-\n|23 September||style=text-align:left |The Kingdom of Laos, which was under Japanese occupation, is taken back by France as part of French Indochina.\n|-\n|October||style=text-align:left |In occupied Japan, Christmas Island is given back to the United Kingdom.\n|-\n|7 October||style=text-align:left |In occupied Japan, the Andaman and Nicobar Islands are given back to the British Raj.\n|-\n|10 October||style=text-align:left |In occupied Japan, Banaba Island is given back over by the Gilbert and Ellice Islands under the United Kingdom.\n|-\n|16 October||style=text-align:left |The Japanese puppet state of the Kingdom of Cambodia is taken over by France and put back under French Indochina.\n|-\n|17 October||style=text-align:left |The Soviet Union annexes northern East Prussia.\n|-\n|24 October||style=text-align:left |The French Mandate for Syria and Lebanon ends.\n|-\n|25 October||style=text-align:left |Republic of China takes over Taiwan.\n|-\n|November||style=text-align:left |The Soviet Union invades northwest Iran and creates the Azerbaijan People's Government as a puppet state.\n|-\n|rowspan=2 |29 November||style=text-align:left |France withdraws from Guangzhouwan after agreeing on 18 August to return the leased territory to the Republic of China.\n|-\n|style=text-align:left |The Democratic Federal Yugoslavia is renamed the Federal People's Republic of Yugoslavia.\n|-\n|2 December||style=text-align:left |The Federal People's Republic of Yugoslavia supersedes the Kingdom of Yugoslavia.\n|-\n|26 December||style=text-align:left |The Republic of Poland becomes independent.\n|-\n|29 December||style=text-align:left |The Netherlands New Guinea is separated from the Dutch East Indies.\n|-\n|rowspan=38 |1946||4 January||style=text-align:left |The Republic of Indonesia moves its capital from Jakarta to Yogyakarta.\n|-\n|11 January||style=text-align:left |The People's Republic of Albania supersedes the Democratic Government of Albania.\n|-\n|22 January||style=text-align:left |The Soviet Union occupies part of northwestern Iran and forms the Republic of Mahabad as a puppet state.\n|-\n|1 February||style=text-align:left |The Hungarian Republic supersedes the Kingdom of Hungary.\n|-\n|28 February||style=text-align:left |The French concessions of Shanghai and Tientsin are ceded to the Republic of China.\n|-\n|2 March||style=text-align:left |Britain begins to withdraw from Iran. Part of the Iran crisis of 1946.\n|-\n|rowspan=3 |19 March||style=text-align:left |The Provisional Government of the French Republic elevates its colonies of Algeria and Réunion to overseas departments.\n|-\n|style=text-align:left |The French Republic elevates its colonies of Guadeloupe and Martinique to overseas departments.\n|-\n|style=text-align:left |The French Republic elevates its colony of Guyane (French Guiana) to an overseas department.\n|-\n|1 April||style=text-align:left |\n*The Straits Settlements is dissolved.\n*The Malayan Union''' is formed from the following protectorates and colonies:\n**Federated Malay States\n**State of Johor Darul Ta'zim\n**State of Kedah Darul Aman\n**State of Kelantan Darul\n**State of Perlis Indera Kayangan\n**State of Terengganu Darul Iman\n**Settlement of Malacca\n**Settlement of Penang\n*The Settlement of Singapore becomes the Colony of Singapore, Labuan becomes a part of a colony.\n|-\n|17 April||style=text-align:left |France withdraws all troops from Syria and Lebanon.\n|-\n|25 May||style=text-align:left |The Hashemite Kingdom of Transjordan gains independence from a British League of Nations Mandate. Amman is the capital.\n|-\n|2 June||style=text-align:left |The Kingdom of Italy is renamed the Italian Republic.\n|-\n|1 July||style=text-align:left |The Kingdom of Sarawak is ceded to the United Kingdom as the Colony of Sarawak.\n|-\n|rowspan=2 |4 July||style=text-align:left |The Republic of the Philippines gains independence from the United States. Manila is the capital.\n|-\n|style=text-align:left |In the Soviet Union, the city of Königsberg is renamed Kaliningrad.\n|-\n|13 July||style=text-align:left |In Montenegro (then part of Yugoslavia), the city of Podgorica is renamed Titograd.\n|-\n|15 July||style=text-align:left |The State of North Borneo is ceded to the United Kingdom as the Colony of North Borneo. Labuan is transferred from Colony of Singapore to the Colony of North Borneo.\n|-\n|26 July||style=text-align:left |The Spanish colonies of Ifni and Spanish Sahara merge to form Spanish West Africa.\n|-\n|15 September||style=text-align:left |The '''People's Republic of Bulgaria supersedes the Tsardom of Bulgaria. Sofia is the capital.\n|-\n|rowspan=2 |14 October||style=text-align:left |The Provisional Government of the French Republic is renamed the French Republic.\n|-\n|style=text-align:left |The United States annexes the Culebron banco from Mexico.\n|-\n|22 October||style=text-align:left |In the Dutch East Indies, the autonomous Federation of West Kalimantan is established.\n|-\n|rowspan=6 |27 October||style=text-align:left |The French Republic elevates its uninhabited possession of Adélie Land to an overseas territory.\n|-\n|style=text-align:left |The French Republic elevates its colonies of French Equatorial Africa, French West Africa, and Madagascar to overseas territories; the French colony of Comoros is separated from Madagascar; and French Somaliland is renamed the Territory of French Somaliland.\n|-\n|style=text-align:left |The French Republic elevates its French Establishments in India to an overseas territory.\n|-\n|style=text-align:left |The French Establishments in Oceania are renamed the French Settlements in Oceania.\n|-\n|style=text-align:left |New Caledonia and Dependencies is renamed the Territory of New Caledonia and Dependencies.\n|-\n|style=text-align:left |Saint Pierre and Miquelon is renamed the Territory of Saint Pierre and Miquelon.\n|-\n|November||style=text-align:left |The Soviet'''-occupied area of the Azerbaijan People's Government is returned to Iran.\n|-\n|December||style=text-align:left |Several League of Nations Mandates in Africa are transferred as United Nations Trust Territories:\n*16 December — British Cameroons and Cameroun (French-administered).\n*13 December — British Togoland, French Togoland, and the Belgian-administered Ruanda-Urundi.\n*11 December — Tanganyika Territory is renamed Tanganyika (British-administered).\n|-\n|7 December||style=text-align:left |In the Dutch East Indies, the autonomous state of Dayak Besar is established.\n|-\n|8 December||style=text-align:left |The League of Nations Mandate of the Territory of New Guinea is transferred as a United Nations Trust Territory, administered by Australia.\n|-\n|10 December||style=text-align:left |In the Dutch East Indies, the autonomous Belitung Council is established.\n|-\n|12 December||style=text-align:left |Republic of China gain possession on Taiping Island.\n|-\n|15 December||style=text-align:left |The Soviet-occupied area of the Republic of Mahabad is returned to Iran.\n|-\n|24 December||style=text-align:left |In the Dutch East Indies, the State of Great East is established.\n|-\n|27 December||style=text-align:left |In the Dutch East Indies, the autonomous State of Great East is renamed the State of East Indonesia.\n|-\n|rowspan=22 |1947||8 January||style=text-align:left |In the Dutch East Indies, the autonomous state of the Federation of South Kalimantan is established.\n|-\n|25 January||style=text-align:left |The New Zealand-administered League of Nations Mandate of Western Samoa is transferred as a United Nations Trust Territory.\n|-\n|10 February||style=text-align:left |The Paris Peace Treaties are signed. These treaties allow the defeated Axis powers to resume their responsibilities as sovereign states in international affairs and to qualify for membership in the United Nations. Italy loses the colonies of Italian East Africa and Italian Libya, their concession in Tianjin, China, and recognises the independence of Albania. The Dodecanese Islands are granted to Greece, whilst Istria is granted to Yugoslavia. The Free Territory of Trieste is established. France gains small border territory from Italy. Finland is restored to its post-Winter War borders, and additionally cedes Petsamo Province to the Soviet Union. Hungary is returned to its 1938 borders, losing all territorial gains since before the First Vienna Award. In addition, it cedes the Bratislava bridgehead to Czechoslovakia. Romania is returned to its borders of 1 January 1941, compared to pre-war borders Bessarabia and northern Bukovina are ceded to the Soviet Union and Southern Dobruja is ceded to Bulgaria. The Second Vienna Award however is reversed, with northern Transylvania being returned to Romania. Bulgaria is returned to its borders just after the Treaty of Craiova in which it gained the aforementioned Southern Dobruja. They return their territories occupied from Greece and Yugoslavia.\n|-\n|3 May||style=text-align:left |The new Constitution of Japan is adopted, dissolving the Greater Japanese Empire.\n|-\n|12 May||style=text-align:left |In the Dutch East Indies, the Federation of West Kalimantan is renamed the Special Territory of West Kalimantan.\n|-\n|12 July||style=text-align:left |In the Dutch East Indies, the autonomous states of Bangka Council and Riau Council are created.\n|-\n|18 July||style=text-align:left |The South Pacific (League of Nations) Mandate, governed by Japan, is transferred to the United Nations Trust Territory of the Pacific Islands, administered by the United States.\n|-\n|12 August||style=text-align:left |Balochistan (Kalat State) gains independence from the United Kingdom as an independent monarchy.\n|-\n|14 August||style=text-align:left |The Dominion of Pakistan gains independence from the United Kingdom. Karachi is the capital.\n|-\n|15 August||style=text-align:left |The Dominion of India gains independence from the United Kingdom. New Delhi is the capital.\n|-\n|27 August||style=text-align:left |In the Dutch East Indies, the Siak Besar Territory is created.\n|-\n|15 September||style=text-align:left |The Free Territory of Trieste is created in Central Europe.\n|-\n|8 October||style=text-align:left |In the Dutch East Indies, the autonomous state of the Special Territory of East Sumatra is created.\n|-\n|16 October||style=text-align:left |Philippine administration of seven of the Turtle Islands begins and United Kingdom administration ends.\n|-\n|27 October||style=text-align:left |The princely state of Jammu and Kashmir is divided between the Dominion of India and the Dominion of Pakistan.\n|-\n|1 November||style=text-align:left |The League of Nations Mandate of Nauru is transferred as a United Nations Trust Territory.\n|-\n|25 November||style=text-align:left |The title Dominion of New Zealand ceases to be officially used for New Zealand.\n|-\n|14 December||style=text-align:left |The Soviet Union completely withdraws its forces from Bulgaria, ending a three-year-long occupation.\n|-\n|15 December||style=text-align:left |France claims the Saar as a protectorate from occupied Germany.\n|-\n|25 December||style=text-align:left |In the Dutch East Indies, the Special Territory of East Sumatra is renamed the State of East Sumatra.\n|-\n|26 December||style=text-align:left |Sovereignty over the Territory of Heard Island and McDonald Islands is transferred from the United Kingdom to Australia.\n|-\n|30 December||style=text-align:left |The '''Romanian People's Republic supersedes the Kingdom of Romania.\n|-\n|rowspan=22 |1948||4 January||style=text-align:left |The Union of Burma gains independence from the United Kingdom. Burma becomes a republic outside the British Commonwealth. Yangon (British Rangoon) is the capital.\n|-\n|14 January||style=text-align:left |In the Dutch East Indies, the autonomous state of the Territory of Banjar is created.\n|-\n|rowspan=2 |23 January||style=text-align:left |In the Dutch East Indies, the states of Bangka Council, the Belitung Council, and the Riau Council are merged as the Bangka Belitung and Riau Federation.\n|-\n|style=text-align:left |In the Dutch East Indies, the autonomous State of Madura is created.\n|-\n|30 January||style=text-align:left |In the United Kingdom, the Malayan Union is renamed the Federation of Malaya.\n|-\n|rowspan=2 |4 February||style=text-align:left |The Crown Colony of Ceylon (Sri Lanka) gains independence from the United Kingdom as the Dominion of Ceylon. Colombo remains the capital.\n|-\n|style=text-align:left |In the Dutch East Indies, the Siak Besar Territory is renamed the Federation of East Kalimantan.\n|-\n|26 February||style=text-align:left |In the Dutch East Indies, the State of West Java is created.\n|-\n|27 March||style=text-align:left |Kalat State is integrated into the Pakistan. Kalat yields to Karachi as capital.\n|-\n|1 April||style=text-align:left |The Faroe Islands becomes a self-governing dependency.\n|-\n|18 April||style=text-align:left |Ireland is declared a republic with effect as from 18 April 1949.\n|-\n|25 April||style=text-align:left |In the Dutch East Indies, the State of West Java is renamed the Sundanese State.\n|-\n|14 May||style=text-align:left |The State of Israel is established upon the termination of the British Mandate for Palestine. Tel Aviv is the capital.\n|-\n|17 July||style=text-align:left |The Republic of the Philippines moves its capital from Manila to Quezon City.\n|-\n|15 August||style=text-align:left |The Republic of Korea is established from British/American/United Nations-occupied South Korea.\n|-\n|30 August||style=text-align:left |In the Dutch East Indies, the State of South Sumatra is established.\n|-\n|9 September||style=text-align:left |Korea is divided between the Democratic People's Republic of Korea (North Korea) and the Republic of Korea (South Korea). Pyongyang and Seoul are the respective capitals.\n|-\n|12 September||style=text-align:left |The State of Hyderabad is annexed by the Dominion of India. Hyderabad yields to New Delhi as capital.\n|-\n|20 September||style=text-align:left |The Dutch colony of Curaçao and Dependencies is renamed the Netherlands Antilles, as the dependencies gain equality in level of sovereignty.\n|-\n|26 November||style=text-align:left |In the Dutch East Indies, the autonomous state of East Java is established.\n|-\n|25 December||style=text-align:left |The Soviet Union completely withdraws its forces from North Korea, ending a three-year-long occupation.\n|-\n| ||style=text-align:left |The Mutawakkilite Kingdom of Yemen''' (North Yemen) moves its capital from Sana'a to Taiz.\n|-\n| rowspan=\"32\" |1949||1 January||style=text-align:left |New Zealand annexes the Tokelau Islands, which creates a dispute with the United States over its claims of Atafu, Fakaofo, and Nukunono.\n|-\n|1 March||style=text-align:left |The Emirate of Cyrenaica is created from part of the British Military Administration of Libya. The capital is Benghazi.\n|-\n|2 March||style=text-align:left |In the Dutch East Indies, the autonomous state of Central Java is established.\n|-\n|10 March||style=text-align:left |As a result of the 1948 Arab–Israeli War, Israel captures half of the land allotted to an Arab state under the Partition Plan, Jordan occupies the West Bank, and the Kingdom of Egypt occupies the Gaza Strip.\n|-\n|31 March||style=text-align:left |The Dominion of Newfoundland joins Canada as the Province of Newfoundland following the Newfoundland referendums. St. John's yields to Ottawa as the capital.\n|-\n|3 April||style=text-align:left |The Hashemite Kingdom of Transjordan is renamed the Hashemite Kingdom of Jordan.\n|-\n|4 April||style=text-align:left |The North Atlantic Treaty is signed, forming the legal basis for the NATO military alliance to come into effect later that year. Belgium, Canada, Denmark, France, Iceland, Italy, Luxembourg, the Netherlands, Norway, Portugal, the United Kingdom and the United States are founding members.\n|-\n|18 April||style=text-align:left |The Republic of Ireland is declared, and leaves the British Commonwealth. King George VI ceases to be King of Ireland. Seán T. O'Kelly, the President of Ireland becomes a fully recognised head of state.\n|-\n|22 April||style=text-align:left |The Republic of China government evacuates Nanjing the day before the capital city falls to the Communists. Canton becomes the de facto capital.\n|-\n|11 May||style=text-align:left |The Kingdom of Siam changes its name back to the Kingdom of Thailand.\n|-\n|23 May||style=text-align:left |The Federal Republic of Germany (West Germany) and West Berlin are established in the American, British, and French occupation zones of Germany. Bonn is declared the capital.\n|-\n|14 June||style=text-align:left |The area of Vietnam in French Indochina becomes a separate entity under France as the State of Vietnam, though North Vietnam still claims independence.\n|-\n|20 June||style=text-align:left |The 1948 Arab–Israeli War ends, resulting in the former territory of Mandatory Palestine being split among Israel, Jordan, and the Kingdom of Egypt.\n|-\n|19 July||style=text-align:left |The area of Laos in French Indochina becomes a separate entity under France as the Kingdom of Laos.\n|-\n|8 August||style=text-align:left |The Indian protectorate of the Kingdom of Bhutan declares independence.\n|-\n|20 August||style=text-align:left |The '''Hungarian People's Republic supersedes the Hungarian Republic.\n|-\n|24 August||style=text-align:left |The North Atlantic Treaty comes into effect, creating the North Atlantic Treaty Organization. Belgium, Canada, Denmark, France, Iceland, Italy, Luxembourg, the Netherlands, Norway, Portugal, the United Kingdom and the United States are founding members.\n|-\n|9 September||style=text-align:left |The Kingdom of Tripura merges with India.\n|-\n|26&nbsp;September||style=text-align:left |The United States annexes the Don Juan Cross banco from Mexico and Mexico annexes Ringgold banco from the United States.\n|-\n|1 October||style=text-align:left |Mao Zedong proclaims the People's Republic of China. Beijing is the capital.\n|-\n|7 October||style=text-align:left |The German Democratic Republic (East Germany) is established in Soviet-occupied eastern Germany. East Berlin is the capital.\n|-\n|13 October||style=text-align:left |The Republic of China' government evacuates Canton. Chongqing becomes the de facto capital.\n|-\n|6 November||style=text-align:left |The Australian-administered Territory of New Guinea and the Territory of Papua merge to form the Territory of Papua and New Guinea.\n|-\n|8 November||style=text-align:left |The remains of French Indochina form the French-administered Kingdom of Cambodia.\n|-\n|21 November||style=text-align:left |The British-administered protectorates of the Emirate of Cyrenaica, the occupied territory of Tripolitania, and the French-occupied territory of Fezzan merge to form a jointly administered Libya.\n|-\n|29 November||style=text-align:left |The Republic of China government evacuates Chongqing. Chengdu becomes the de facto capital.\n|-\n|5 December||style=text-align:left |The State of Israel declares Jerusalem its official capital. Tel Aviv continues to serve as the de facto capital, although Israeli government institutions would be gradually moved to a newly constructed government quarter in West Jerusalem over the 1950s.\n|-\n|10 December||style=text-align:left |The Republic of China government in Chengdu evacuates Mainland China for Taiwan. Taipei becomes the de facto capital.\n|-\n|22 December||style=text-align:left |The 'People's Republic of China completes the conquest of the East Turkestan Republic in Xinjiang, after Republic of China forces in the region ally with the Communists in September.\n|-\n|rowspan=2 |27 December||style=text-align:left |The forces of the People's Republic of China enter Chengdu, ending the Southwest Campaign against the Republic of China and completing the conquest of major continental Han-inhabited territories.\n|-\n|style=text-align:left |The Republic of Indonesia becomes a federation as the Republic of the United States of Indonesia and its independence is formally recognised by the Netherlands, comprising most of the former Dutch East Indies. The capital returns to Jakarta from Yogyakarta. The Dutch remaining possession in Western New Guinea becomes Netherlands New Guinea.\n|-\n|29 December||style=\"text-align:left\"|The State of Israel moves its Parliament, the Knesset, from Tel Aviv to the National Institutions House in West Jerusalem. The Knesset would be moved within Jerusalem, first temporarily to the Froumine House in 1950, and then to its current, permanent building in 1966.\n|}\n1950s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=11 |1950||26 January||style=text-align:left |India adopts a republican constitution and changes its name to the Republic of India. India becomes the first republic in the Commonwealth of Nations.\n|-\n|19 February||style=text-align:left |The People's Republic of China completes the conquest of southern Yunnan, expelling the Republic of China from all of continental China Proper.\n|-\n|1 April||style=text-align:left |The British-occupied territory of Italian Somaliland is transferred to Italy as the Trust Territory of Somalia.\n|-\n|7 April||style=text-align:left |The People's Republic of China completes the conquest of Xikang, defeating the last regular forces of the Republic of China in continental Mainland China.\n|-\n|25 April||style=text-align:left |The unrecognized Republic of South Maluku declares independence from Indonesia.\n|-\n|1 May||style=text-align:left |The People's Republic of China completes the conquest of Hainan Island from the Republic of China.\n|-\n|7 August||style=text-align:left |The People's Republic of China completes the conquest of the Wanshan Archipelago from the Republic of China, concluding the main period of hostilities in the Chinese Civil War.\n|-\n|17 August||style=text-align:left |The Republic of the United States of Indonesia becomes a unitary state and changes its name back to the Republic of Indonesia.\n|-\n|5 November||style=text-align:left |Indonesia reconquers Ambon, the last stronghold of the Republic of South Maluku, reducing the separatist movement to a minor insurgency.\n|-\n|5 December||style=text-align:left |The Kingdom of Sikkim signs a treaty to become a protectorate of India.\n|-\n|15 December||style=text-align:left |The United States reorganizes the United States Military Government of the Ryukyu Islands as the United States Civil Administration of the Ryukyu Islands.\n|-\n|rowspan=5 |1951||27 April||style=text-align:left |Denmark leases Thule Air Base in Greenland to the United States in perpetuity and cedes exclusive jurisdiction over the base area.\n|-\n|23 May||style=text-align:left |The People's Republic of China' annexes the de facto'' independent state of Tibet after the military conquest of its Chamdo Region in October 1950.\n|-\n|5 June||style=text-align:left |The Republic of Poland and the Soviet Union exchange territory along their common border.\n|-\n|11 June||style=text-align:left |Due to Portuguese colonies being reorganized as overseas provinces, Portuguese East Africa is renamed Mozambique and Portuguese West Africa is renamed Angola.\n|-\n|24 December||style=text-align:left |The United Kingdom of Libya gains independence from a United Nations trusteeship, previously having been divided into the independent Emirate of Cyrenaica, British-administered Tripolitania, and the French Military Territory of Fezzan-Ghadames. Tripoli is the capital.\n|-\n|rowspan=7 |1952||18 February||style=text-align:left |Greece and Turkey join the North Atlantic Treaty Organization in the alliance's first enlargement.\n|-\n|28 April||style=text-align:left |The Allied occupation of Japan ends.\n|-\n|22 July||style=text-align:left |The Republic of Poland changes its name to the '''Polish People's Republic.\n|-\n|23 July||style=text-align:left |The European Coal and Steel Community, the earliest predecessor to the European Union, is created. Italy, France, Luxembourg, Belgium, Netherlands and West Germany are the founding members.\n|-\n|26 July||style=text-align:left | The Argentine National Gendarmerie took control of the disputed areas between Argentina and Chile''' in Hondo Valley, Horquetas Valley and Lagunas del Engaño, notifying the Chilean families that within one month they had to regularize their situation to the Argentine state. This prompted a diplomatic protest from Chile as they were considered to be in the country's territory.\n|-\n|15 September||style=text-align:left |Italian Eritrea is federated within the Ethiopian Empire.\n|-\n| ||style=text-align:left |Spain incorporates the protectorate of Ifni as a region of Spanish West Africa.\n|-\n| rowspan=\"10\" |1953||1 January||style=text-align:left |The First Republic of Maldives supersedes the Sultanate of Maldives.\n|-\n|12 January||style=text-align:left |The Estonian Government in Exile is established, in parallel to Estonian diplomatic legations abroad. Both are later declared keepers of the legal continuity of the restored Republic of Estonia.\n|-\n|15 April||style=text-align:left |The United States of Venezuela is renamed the Republic of Venezuela.\n|-\n|13 June||style=text-align:left |The Egyptian Republic supersedes the Kingdom of Egypt.\n|-\n|26 July||style=text-align:left |The Cuban Revolution is led by Fidel Castro to overthrow Fulgencio Batista's regime.\n|-\n|27 July||style=text-align:left |The Korean Armistice Agreement is signed, establishing the Korean Demilitarized Zone along the border between the '''Democratic People's Republic of Korea (North Korea) and the Republic of Korea (South Korea).\n|-\n|1 August||style=text-align:left |The British colony of Southern Rhodesia and the protectorates of Northern Rhodesia and Nyasaland merge to form Rhodesia and Nyasaland.\n|-\n|22 October||style=text-align:left |The Kingdom of Laos gains independence from France. Vientiane is the capital.\n|-\n|9 November||style=text-align:left |The Kingdom of Cambodia declares its independence from France. Phnom Penh is the capital.\n|-\n| 25 December||style=\"text-align:left\" |The United States returns the Amami Islands to Japan.\n|-\n|rowspan=11 |1954||7 March||style=text-align:left |The Sultanate of Maldives supersedes the First Republic of Maldives.\n|-\n|15 April||style=text-align:left |The Geneva Accords grant independence to Vietnam, which is provisionally divided into North Vietnam and South Vietnam.\n|-\n|20 July||style=text-align:left |France recognizes the independence of Vietnam divided between the Democratic Republic of Vietnam (North Vietnam) and the Republic of Vietnam (South Vietnam). Hanoi and Saigon are the respective capitals.\n|-\n|27 July||style=text-align:left |The Free Dadra declares independence from Portugal, but is officially recognized only by India.\n|-\n|2 August||style=text-align:left |The capital of Free Dadra is moved from Dadra to Silvassa.\n|-\n|11 August||style=text-align:left |The Republic of India annexes Dadra and Nagar Haveli from Portuguese India.\n|-\n|26 October||style=text-align:left |The Free Territory of Trieste is divided between Italy and Yugoslavia.\n|-\n|25 November||style=text-align:left |Amidst a civil war, the Imamate of Oman declares the dissolution of the union of Muscat and Oman and applies for membership in the Arab League as the independent Kingdom of Oman. Nizwa remains the capital.\n|-\n|rowspan=2 |15 December||style=text-align:left |The Kingdom of the Netherlands makes the Territory of Curaçao one of its three constituent countries as the Netherlands Antilles. Willemstad on Curaçao remains the capital.\n|-\n|style=text-align:left |The Kingdom of the Netherlands makes the Territory of Surinam one of its three constituent countries as Suriname. Paramaribo remains the capital.\n|-\n|20 December||style=text-align:left |France recognizes the independence of the Kingdom of Cambodia. Phnom Penh remains the capital.\n|-\n| rowspan=\"15\" |1955||20 January||style=text-align:left |The People's Republic of China conquers the Yijiangshan Islands from the Republic of China after the Battle of Yijiangshan Islands.\n|-\n|8–26 February||style=text-align:left |The People's Republic of China takes control of the Dachen Islands, Yushan Islands, Pishan Islands, and Nanji Islands after the Republic of China withdraws from these territories judged indefensible.\n|-\n|11 April||style=text-align:left |The corridor of Panama inside the Panama Canal Zone, part of the United States of America, is slightly shifted by territorial exchanges due to bridges and highways.\n|-\n|9 May||style=text-align:left |West Germany joins the North Atlantic Treaty Organization''' in the alliance's second enlargement.\n|-\n|14 May||style=text-align:left |The Warsaw Pact is founded, led by the Soviet Union as their equivalent to the North Atlantic Treaty Organization for the Eastern Bloc. Albania, Bulgaria, Czechoslovakia, East Germany, Hungary, Poland, Romania and the Soviet Union are the founding members. China, North Vietnam and North Korea have observer status.\n|-\n|15 May||style=text-align:left |The Republic of Austria regains its independence with the end of Allied occupation. Vienna is the capital.\n|-\n|28 July||style=text-align:left |Following the withdrawal of French forces in August 1954, the '''People's Republic of China conquers Bạch Long Vĩ Island from the Republic of China.\n|-\n|6 August||style=text-align:left |The French overseas territory of Adélie Land and the Malagasy dependencies of the Crozet Islands, the Kerguelen Islands, and Saint-Paul and Amsterdam merge to form the French Southern and Antarctic Lands.\n|-\n|23 August||style=text-align:left |The border between Panama and the United States' Panama Canal Zone is redefined, resulting in several border changes. Punta Paitilla, the land held on Taboga Island, and the remaining American holdings in Colón and Panama City are ceded to Panama.\n|-\n|18&nbsp;September||style=text-align:left |Rockall is officially claimed by the United Kingdom.\n|-\n|14 October||style=text-align:left |The one-unit scheme in Pakistan is passed merging all the provinces and princely states of the then western Pakistan, to a single province called West Pakistan.\n|-\n|26 October||style=text-align:left |The State of Vietnam is renamed the Republic of Vietnam (South Vietnam).\n|-\n|23 November||style=text-align:left |The United Kingdom transfers the Cocos or Keeling Island of the Colony of Singapore to Australia as the Territory of Cocos (Keeling) Islands.\n|-\n|20 December||style=text-align:left |Cardiff is recognised as the capital of Wales'''. It is the country's first official capital since 1689.\n|-\n| ||style=text-align:left |The Kingdom of Bhutan moves its capital from Punakha to Thimphu.\n|-\n|rowspan=16 |1956||1 January||style=text-align:left |The Republic of Sudan gains independence from the United Kingdom. Khartoum is the capital. Egypt relinquishes its claim to Sudan.\n|-\n|14 January||style=text-align:left |The United States of America annexes the San Felipe banco from Mexico.\n|-\n|2 March||style=text-align:left |The Sherifian Empire gains independence from France. Rabat is the capital.\n|-\n|20 March||style=text-align:left |The Kingdom of Tunisia gains independence from France. Tunis is the capital.\n|-\n|23 March||style=text-align:left |Pakistan adopts a new constitution and changes its name to the Islamic Republic of Pakistan, and remains part of the Commonwealth of Nations.\n|-\n|7 April||style=text-align:left |Spanish Morocco becomes part of the Sherifian Empire.\n|-\n|18 June||style=text-align:left |The Egyptian Republic declares its complete independence from the United Kingdom.\n|-\n|23 June||style=text-align:left |Beginning of the Hungarian Revolution of 1956.\n|-\n|16 July||style=text-align:left |The Karelo-Finnish Soviet Socialist Republic is made part of the Russian SFSR.\n|-\n|23 October||style=text-align:left |Beginning of the main phase of the Hungarian Revolution of 1956.\n|-\n|rowspan=2|29 October||style=text-align:left |The Tangier International Zone, under the joint administration of France, Spain, the United Kingdom, Italy, Portugal, and Belgium, is reintegrated into the Sherifian Empire.\n|-\n|style=text-align:left |France, Britain and Israel invade Egypt in the Suez Crisis.\n|-\n|1 November||style=text-align:left |Hungary withdraws from the Warsaw Pact as part of the ongoing revolution.\n|-\n|4 November||style=text-align:left |The Soviet Union invades and occupies Hungary to end the revolution. A new government is established.\n|-\n|7 November||style=text-align:left |Fighting in the Suez Crisis ends. Israel occupies the Sinai Peninsula of Egypt.\n|-\n|13 December||style=text-align:left |British Togoland is merged into the Gold Coast.\n|-\n|rowspan=9 |1957||1 January||style=text-align:left |Saar is given to West Germany as the state of Saarland.\n|-\n|16 January||style=text-align:left |The '''People's Republic of China transfers Bạch Long Vĩ Island to North Vietnam.\n|-\n|28 February||style=text-align:left |Argentina declares the Argentine Antarctic Sector between the meridians 25° W and 74° W\n|-\n|March||style=text-align:left |Israel withdraws from Sinai, returning it to Egyptian control.\n|-\n|6 March||style=text-align:left |Ghana gains independence from the United Kingdom. Accra is the capital.\n|-\n|25 July||style=text-align:left |The Kingdom of Tunisia is renamed the Republic of Tunisia.\n|-\n|14 August||style=text-align:left |The Sherifian Empire is renamed the Kingdom of Morocco.\n|-\n|31 August||style=text-align:left |The Federation of Malaya gains independence from the United Kingdom. Kuala Lumpur is the capital. Malaya becomes the first native monarchy in the Commonwealth of Nations.\n|-\n|23 October||style=text-align:left |Morocco invades Ifni, conquering most of the region beyond the vicinity of Sidi Ifni from Spain by December, and occupying it until Spain cedes the entire region in 1969.\n|-\n|rowspan=25 |1958||1 January||style=text-align:left |The United Kingdom separates Christmas Island from the Colony of Singapore to form the Colony of Christmas Island.\n|-\n|3 January||style=text-align:left |The United Kingdom establishes the West Indies Federation as a federation of most of the British West Indies, excluding the British Virgin Islands and the Bahamas'. The de jure capital is Chaguaramas on Trinidad and the de facto capital is Port of Spain on Trinidad.\n|-\n|10 January||style=text-align:left |Ifni is separated from Spanish West Africa as Ifni Province.\n|-\n|12 January||style=text-align:left |The Snipe incident starts between Argentina and Chile in the Beagle Channel in which the two countries disagreed about the sovereign rights over the zone and Snipe, an uninhabitable islet between Picton Island and Navarino Island and started to build lighthouses (destroying the one built by the other country).\n|-\n|14 February||style=text-align:left |The Hashemite Kingdom of Iraq and the Hashemite Kingdom of Jordan unite to form the Arab Federation of Iraq and Jordan. Amman yields to Baghdad as the capital.\n|-\n|rowspan=2 |22 February||style=text-align:left |The Egyptian Republic and the Syrian Arab Republic unite to form the United Arab Republic. Damascus yields to Cairo as the capital.\n|-\n|style=text-align:left |The French-administered United Nations Trust Territory of French Togoland is renamed Togo.\n|-\n|8 March||style=text-align:left |The United Arab States is formed as a confederation between the United Arab Republic (Egypt and Syria) and the Kingdom of Yemen.\n|-\n|10 April||style=text-align:left |Spanish West Africa is disestablished:\n*The province of Cape Juby is ceded to the Kingdom of Morocco.\n*The provinces of Río de Oro and Saguia el-Hamra become Spanish Sahara.\n|-\n|14 May||style=text-align:left |The French Territory of the Comoros votes to move its capital from Dzaoudzi to Moroni. The actual move occurs gradually by 1966.\n|-\n|14 July||style=text-align:left |The Republic of Iraq and the Hashemite Kingdom of Jordan are created from the dissolution of the Arab Federation of Iraq and Jordan. The Republic of Iraq is created by the 14 July Revolution in which King Faisal II was murdered. Baghdad remains the capital of Iraq. Amman is again the capital of Jordan.\n|-\n|1 October||style=text-align:left |Sovereignty over the Colony of Christmas Island is transferred from the United Kingdom to Australia as the Territory of Christmas Island.\n|-\n|2 October||style=text-align:left |The Republic of Guinea gains independence from France. Conakry is the capital.\n|-\n|4 October||style=text-align:left |The French Fifth Republic succeeds the French Fourth Republic.\n|-\n|15 October||style=text-align:left |The Malagasy Republic (Madagascar) gains autonomy within the French Community. Antananarivo is the capital.\n|-\n|26 October||style=text-align:left |The 'People's Republic of China completely withdraws its forces from North Korea, ending its eight-year-long military presence in the Korean Peninsula.\n|-\n|3 November||style=text-align:left | The Argentine Gendarmerie re-enter the Horquetas and Hondo Valley inside the disputed area between Argentina and Chile denominated as \"río Encuentro-Alto Palena\".\n|-\n|15 November||style=text-align:left |The Soviet Union completely withdraws its forces from Romania, ending a 14-year-long occupation.\n|-\n|28 November||style=text-align:left |The following French colonies join the newly created French Community:\n*Chad\n*Congo\n*Gabon\n*Mauritania\n*Senegal\n*French Sudan (as Soudan)\n|-\n|1 December||style=text-align:left |The French colony of Ubangi-Shari joins the French Community as the Central African Republic.\n|-\n|rowspan=2 |4 December||style=text-align:left |The French colony of Dahomey joins the French Community.\n|-\n|style=text-align:left |The French colony of Ivory Coast joins the French Community.\n|-\n|8 December||style=text-align:left |Sovereignty over Gwadar is transferred from the Sultanate of Muscat and Oman to Pakistan.\n|-\n|11 December||style=text-align:left |The French colony of Upper Volta joins the French Community.\n|-\n|19 December||style=text-align:left |The French colony of Niger joins the French Community.\n|-\n|rowspan=10 |1959||1 January||style=text-align:left |The Cuban revolution ends with 26th of July Movement victory and new regime led by the Communist Party of Cuba.\n|-\n|rowspan=2 |3 January||style=text-align:left |The United Suvadive Republic secedes from the Sultanate of Maldives. Hithadhoo is the capital.\n|-\n|style=text-align:left |Alaska is admitted to the Union as the 49th State of the United States.\n|-\n|30 January||style=text-align:left |The forces of the United Kingdom and the Sultanate of Muscat conquer the last strongholds of the Kingdom of Oman, reincorporating the Imamate into Muscat and Oman. Muscat effectively becomes the joint capital.\n|-\n|4 April||style=text-align:left |In French Africa, the colonies of Senegal and Soudan merge to form the Mali Federation.\n|-\n|3 June||style=text-align:left |The United Kingdom changes the name of the Colony of Singapore to the State of Singapore.\n|-\n|30 June||style=text-align:left |Fernando Pó and Río Muni are merged to form Spanish Guinea.\n|-\n|16 November||style=text-align:left |Hawaii is admitted to the Union as the 50th State of the United States.\n|-\n| ||style=text-align:left |The Bhutanese enclaves within Tibet are taken over by the People's Republic of China.\n|}\n1960s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n|rowspan=29 |1960||rowspan=2 |1 January||style=text-align:left |The Republic of Cameroun gains independence from the French Republic. Yaoundé remains the capital.\n|-\n|style=text-align:left |\n*The British Leeward Islands are dissolved into the British colonies of Antigua, Montserrat, Saint Christopher, Nevis and Anguilla, and the British Virgin Islands.\n*The British Windward Islands are dissolved into the British colonies of Dominica, Grenada, Saint Lucia, and Saint Vincent.\n*The British Virgin Islands becomes a separate crown colony while other remains within the West Indies Federation.\n|-\n|1 April||style=text-align:left |France detaches the Scattered Islands in the Indian Ocean from the Malagasy Republic shortly before its independence. In September the administration of the Scattered Islands is delegated to the Prefect of Réunion.\n|-\n|21 April||style=text-align:left |The Republic of the United States of Brazil moves its capital from Rio de Janeiro to Brasília.\n|-\n|27 April||style=text-align:left |The Togolese Republic (Togo) gains independence from the French Republic. Lomé remains the capital.\n|-\n|14 June||style=text-align:left |South Kasai declares independence from the Republic of the Congo (Léopoldville).\n|-\n|20 June||style=text-align:left |The Mali Federation gains independence from the French Republic. Dakar remains the capital.\n|-\n|rowspan=2 |26 June||style=text-align:left |The Malagasy Republic (Madagascar) gains independence from the French Republic. Antananarivo remains the capital.\n|-\n|style=text-align:left |British Somaliland gains independence from the United Kingdom temporarily as the State of Somaliland, in preparation for union with the Trust Territory of Somaliland. Hargeisa remains the capital.\n|-\n|30 June||style=text-align:left |The Belgian Congo gains independence from the Kingdom of Belgium as the Republic of the Congo (Congo-Léopoldville). Léopoldville remains the capital.\n|-\n|rowspan=2 |1 July||style=text-align:left |The Somali Republic is created through the merger of the intra-46th meridian east territories, the Trust Territory of Somaliland and the State of Somaliland. Mogadishu becomes the capital.\n|-\n|style=text-align:left |Ghana changes its name to the Republic of Ghana and severs all ties to the British monarchy as a Commonwealth realm and remains part of the Commonwealth of Nations.\n|-\n|rowspan=2 |11 July||style=text-align:left |The Czechoslovak Republic changes its name to the Czechoslovak Socialist Republic.\n|-\n|style=text-align:left |The State of Katanga declares independence from the Republic of the Congo (Léopoldville) with no recognition.\n|-\n|rowspan=2 |1 August||style=text-align:left |The Republic of Dahomey gains independence from the French Republic. Porto-Novo remains the capital.\n|-\n|style=text-align:left |The capital of Pakistan is moved from Karachi to Rawalpindi.\n|-\n|3 August||style=text-align:left |The Republic of Niger gains independence from the French Republic. Niamey remains the capital.\n|-\n|5 August||style=text-align:left |The Republic of Upper Volta gains independence from the French Republic. Ouagadougou remains the capital.\n|-\n|7 August||style=text-align:left |The Côte d'Ivoire gains independence from the French Republic. Abidjan remains the capital.\n|-\n|11 August||style=text-align:left |The Republic of Chad gains independence from the French Republic'''. N'Djamena remains the capital.\n|-\n|13 August||style=text-align:left |The Central African Republic gains independence from the French Republic. Bangui remains the capital.\n|-\n|15 August||style=text-align:left |The Republic of the Congo (Congo-Brazzaville) gains independence from the French Republic. Brazzaville remains the capital.\n|-\n|16 August||style=text-align:left |The Republic of Cyprus gains independence from the United Kingdom. Lefkosia (Nicosia) remains the capital. The United Kingdom retains control of Akrotiri and Dhekelia.\n|-\n|17 August||style=text-align:left |The Gabonese Republic (Gabon) gains independence from the French Republic. Libreville remains the capital.\n|-\n|20 August||style=text-align:left |The Republic of Senegal gains independence from the French Republic. Dakar remains the capital.\n|-\n|22 September||style=text-align:left |The Republic of Mali gains independence from the French Republic. Bamako remains the capital.\n|-\n|rowspan=2 |1 October||style=text-align:left |The '''People's Republic of China is ceded 340&nbsp;km2 of territory and Burma is ceded 220&nbsp;km2 of territory in a boundary treaty delimiting the borders between the two countries.\n|-\n|style=text-align:left |The Federation of Nigeria achieves independence from the United Kingdom as a Commonwealth realm. Lagos continues to serve as the capital, and Nigeria begins administering the Bakassi Peninsula, which was formerly part of British Cameroons.\n|-\n|28 November||style=text-align:left |The Islamic Republic of Mauritania gains independence from the French Republic. Nouakchott remains the capital.\n|-\n|rowspan=16 |1961||14 January||style=text-align:left |India annexes Portuguese India, and Portugal maintains its claims to it.\n|-\n|27 April||style=text-align:left | Sierra Leone gains independence from the United Kingdom. Freetown remains the capital.\n|-\n|31 May||style=text-align:left |The Union of South Africa ceases to be a Commonwealth realm and changes its name to the Republic of South Africa. Pretoria, Cape Town and Bloemfontein remain the capitals. South Africa temporarily withdraws from the Commonwealth of Nations as a result.\n|-\n|1 June||style=text-align:left |Northern Cameroons joins Nigeria.\n|-\n|19 June||style=text-align:left |The State of Kuwait gains independence from the United Kingdom. Kuwait City remains the capital.\n|-\n|23 June||style=text-align:left |The Antarctic Treaty System enters force to administer the continent of Antarctica and all lands and waters south of the 60th parallel south.\n|-\n|rowspan=4 |28 September||style=text-align:left |In the United Arab States, Syria leaves the United Arab Republic and returns to the name of the Syrian Arab Republic.\n|-\n|style=text-align:left |The Free Dadra and Nagar Haveli joins India, as Portugal ceases to claim it.\n|-\n|style=text-align:left |Portugal cedes São João Baptista de Ajudá to Dahomey.\n|-\n|style=text-align:left |Portuguese fort São João Baptista de Ajudá (now Ouidah) is annexed by Dahomey.\n|-\n|1 October||style=text-align:left |The southern portion of the British Cameroons gains independence from the United Kingdom and unites with the Republic of Cameroun to form the Federal Republic of Cameroon. Yaoundé remains the capital.\n|-\n|1 December||style=text-align:left |The Netherlands New Guinea is renamed West Papua.\n|-\n|9 December||style=text-align:left |Tanganyika gains independence from the United Kingdom. Dar-es-Salaam remains the capital.\n|-\n|19 December||style=text-align:left |The Republic of India annexes Goa, Daman and Diu from Portuguese India.\n|-\n|28 December||style=text-align:left |The Syrian Arab Republic secedes from the United Arab Republic, leaving Egypt as the sole member of the federation. Cairo remains the capital of the UAR. Damascus is again the capital of Syria.\n|-\n|30 December||style=text-align:left |South Kasai is taken back by Congo (Léopoldville).\n|-\n|rowspan=16 |1962||1 January||style=text-align:left |The Independent State of Western Samoa gains independence from New Zealand. Apia remains the capital.\n|-\n|3 March||style=text-align:left |The United Kingdom officially gives the territory claimed in Antarctica an entity, the British Antarctic Territory, although this is suspended under the Antarctic Treaty.\n|-\n|31 May||style=text-align:left |The West Indies Federation is dissolved and member states return to their status as parts of the British West Indies. Chaguaramas yields to London as the capital.\n|-\n|1 July||style=text-align:left |The Kingdom of Burundi and the Republic of Rwanda gain independence from the Kingdom of Belgium. Bujumbura and Kigali are the respective capitals.\n|-\n|3 July||style=text-align:left |The French overseas department of Algeria gains independence from the French Republic. Algiers remains the capital.\n|-\n|rowspan=2 |6 August||style=text-align:left |The United Kingdom creates the Crown Colonies of the Cayman Islands and the Turks and Caicos Islands from Jamaica. George Town and Cockburn Town are the respective capitals.\n|-\n|style=text-align:left |The Crown Colony of Jamaica gains independence from the United Kingdom. Kingston remains the capital.\n|-\n|31 August||style=text-align:left |Trinidad and Tobago gains independence from the United Kingdom as a Commonwealth realm. Port of Spain remains the capital.\n|-\n|25 September||style=text-align:left |Algeria becomes the People's Democratic Algerian Republic.\n|-\n|26 September||style=text-align:left |The capital of the Mutawakkilite Kingdom of Yemen''' is moved from Ta'izz to Sana'a.\n|-\n|27 September||style=text-align:left |Mutawakkilite Kingdom of Yemen (North Yemen) is overthrown by the Yemen Arab Republic. Sana'a becomes the capital.\n|-\n|1 October||style=text-align:left |West Papua is transferred from the Netherlands to UN authority as West New Guinea.\n|-\n|9 October||style=text-align:left |Uganda gains independence from the United Kingdom as a Commonwealth realm. Kampala remains the capital.\n|-\n|14 November||style=text-align:left |Eritrea becomes a province of the Ethiopian Empire, losing the autonomy it had under federation.\n|-\n|21 November||style=text-align:left |The '''People's Republic of China imposes a ceasefire after conquering all of Aksai Chin. India continues to claim the territory.\n|-\n|9 December||style=text-align:left |Tanganyika is renamed the Republic of Tanganyika and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|rowspan=14 |1963||15 January||style=text-align:left |Katanga is taken back by Congo (Léopoldville).\n|-\n|3 March||style=text-align:left |The People's Republic of China is ceded the Trans-Karakoram Tract by Pakistan. India''' continues to claim the territory.\n|-\n|7 April||style=text-align:left |The Federal People's Republic of Yugoslavia changes its name to the Socialist Federal Republic of Yugoslavia.\n|-\n|25 April||style=text-align:left |The Kingdom of Libya supersedes the United Kingdom of Libya.\n|-\n|1 May||style=text-align:left |West New Guinea is provisionally transferred from United Nations Temporary Executive Authority to Indonesian administration as the province of Irian Barat, pending the fulfillment of the New York Agreement.\n|-\n|30 June||style=text-align:left |The Kingdom of Rwenzururu declares independence from Uganda with no recognition.\n|-\n|31 August||style=text-align:left |The State of Singapore declares de facto independence from the United Kingdom.\n|-\n|16 September||style=text-align:left |The Federation of Malaya unites with the British colonies of Singapore, Sarawak, and British North Borneo (Sabah) to form Malaysia. Kuala Lumpur remains the capital.\n|-\n|23 September||style=text-align:left |The United Suvadive Republic is reunited with the Sultanate of Maldives. Hithadhoo yields to Male as the capital.\n|-\n|1 October||style=text-align:left |The Federation of Nigeria is renamed the Federal Republic of Nigeria and severs all ties to the British monarchy as a Commonwealth realm.\n|-\n|10 December||style=text-align:left |The Sultanate of Zanzibar gains independence from the United Kingdom. Zanzibar City remains the capital.\n|-\n|12 December||style=text-align:left |Kenya gains independence from the United Kingdom. Nairobi remains the capital.\n|-\n|15 December||style=text-align:left |The Spanish colonies of Fernando Pó and Río Muni merge to form Spanish Guinea.\n|-\n|31 December||style=text-align:left |The Federation of Rhodesia and Nyasaland is divided into Northern Rhodesia, Southern Rhodesia, and Nyasaland.\n|-\n|rowspan=11 |1964||12 January||style=text-align:left |The '''People's Republic of Zanzibar and Pemba is established after a revolution overthrows the Sultanate of Zanzibar.\n|-\n|14 January||style=text-align:left |The Chamizal is split between Mexico and the United States of America.\n|-\n|4 March||style=text-align:left |The United Nations Buffer Zone in Cyprus is established in the Republic of Cyprus between Greek Cypriot and Turkish Cypriot communities.\n|-\n|22 April||style=text-align:left |The Romanian People's Republic gains full economic and political independence from the Soviet Union'''. Bucharest remains the capital.\n|-\n|26 April||style=text-align:left |The Republic of Tanganyika and the People's Republic of Zanzibar and Pemba unite to form the United Republic of Tanganyika and Zanzibar. Zanzibar City yields to Dar-es-Salaam as the capital.\n|-\n|6 July||style=text-align:left |Malawi gains independence from the United Kingdom. Zomba remains the capital.\n|-\n|1 August||style=text-align:left |The Republic of the Congo (Congo-Léopoldville) changes its name to the Democratic Republic of the Congo.\n|-\n|21 September||style=text-align:left |The Crown Colony of Malta gains independence from the United Kingdom as the State of Malta. Valletta remains the capital.\n|-\n|24 October||style=text-align:left |Northern Rhodesia gains independence from the United Kingdom as the Republic of Zambia. Lusaka remains the capital.\n|-\n|1 November||style=text-align:left |The United Republic of Tanganyika and Zanzibar changes its name to the United Republic of Tanzania, which becomes a member state of the Commonwealth of Nations.\n|-\n|12 December||style=text-align:left |Kenya is renamed the Republic of Kenya and severs all ties to the British monarchy as a Commonwealth realm, but remains part of the Commonwealth of Nations.\n|-\n|rowspan=11 |1965||18 February||style=text-align:left |The Gambia gains independence from the United Kingdom as a Commonwealth realm. Bathurst remains the capital.\n|-\n|8 March||style=text-align:left |The first 3,500 U.S. combat troops land in Da Nang, beginning an eight-year United States occupation of South Vietnam.\n|-\n|8 April||style=text-align:left |The Merger Treaty is signed, establishing the European Communities between Luxembourg, Belgium, Netherlands, West Germany, France and Italy.\n|-\n|26 July||style=text-align:left |The British Protectorate over the Sultanate of Maldives ends. The Maldives becomes independent outside the Commonwealth of Nations. Male remains the capital.\n|-\n|4 August||style=text-align:left |The Cook Islands become a state in free association with New Zealand, sharing citizenship.\n|-\n|rowspan=2 |9 August||style=text-align:left |The Republic of Singapore is expelled from Malaysia and becomes fully independent within the Commonwealth of Nations. Singapore remains the capital.\n|-\n|style=text-align:left |Jordan and Saudi Arabia sign a treaty significantly revising their mutual borders and resolving the territorial dispute over Ma'an.\n|-\n|21 August||style=text-align:left |The Romanian People's Republic changes its name to Socialist Republic of Romania.\n|-\n|6 November||style=text-align:left |The Laguna del Desierto incident happened between four Chilean Carabineros and between 40 and 90 members of the Argentine National Gendarmerie and took place in the disputed area south of O'Higgins/San Martín Lake between Argentina and Chile, inhabited by Chilean families, occupied by the Argentine Gendarmerie after the incident.\n|-\n|8 November||style=text-align:left |The United Kingdom creates the British Indian Ocean Territory from the Chagos Archipelago in Mauritius and the islands of Aldabra, Farquhar and Desroches from Seychelles, as Mauritius claims the Chagos Archipelago.\n|-\n|11 November||style=text-align:left |The Cabinet of Southern Rhodesia issues its Unilateral Declaration of Independence from the United Kingdom as Rhodesia, which goes unrecognized. Rhodesia attempts to become a Commonwealth realm with Queen Elizabeth II as Queen of Rhodesia, which remained unrecognised. Salisbury remains the capital.\n|-\n|rowspan=11 |1966||24 May||style=text-align:left |The Federal Republic of Nigeria changes its name to the Republic of Nigeria.\n|-\n|26 May||style=text-align:left |The Crown Colony of British Guiana gains independence from the United Kingdom as Guyana. Georgetown remains the capital.\n|-\n|30 June||style=text-align:left |The Democratic Republic of the Congo changes the name of its capital from Léopoldville to Kinshasa.\n|-\n|6 July||style=text-align:left |Malawi changes its name to the Republic of Malawi and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|31 August||style=text-align:left |The Republic of Nigeria changes its name back to the Federal Republic of Nigeria.\n|-\n|30 September||style=text-align:left |Bechuanaland gains independence from the United Kingdom as the Republic of Botswana. Gaborone remains the capital.\n|-\n|4 October||style=text-align:left |The Crown Colony of the Territory of Basutoland gains independence from the United Kingdom as the Kingdom of Lesotho. Maseru remains the capital.\n|-\n|12 October||style=text-align:left |Guyana discovers that Venezuela had sometime before occupied and effectively annexed Ankoko Island in the disputed Essequibo region.\n|-\n|24 November||style=text-align:left |The Río Encuentro-Alto Palena Dispute between the Republic of Chile and the Argentine Republic is defined by arbitration by Elizabeth II.\n|-\n|28 November||style=text-align:left |The Republic of Burundi supersedes the Kingdom of Burundi.\n|-\n|30 November||style=text-align:left |Barbados gains independence from the United Kingdom as a Commonwealth realm. Bridgetown remains the capital.\n|-\n|rowspan=15 |1967||24 January||style=text-align:left |The Republic of the United States of Brazil changes its name to the Federative Republic of Brazil.\n|-\n|30 May||style=text-align:left |The Republic of Biafra secedes from the Federal Republic of Nigeria. Enugu is the capital. Recognized by Gabon, Ivory Coast, Tanzania, and Zambia.\n|-\n|10 June||style=text-align:left |Israel captures the Gaza Strip and the Sinai Peninsula from the United Arab Republic (Egypt), the West Bank (including East Jerusalem) from Jordan, and the Golan Heights from Syria as a result of the Six-Day War.\n|-\n|rowspan=2 |1 July||style=text-align:left |The Merger Treaty comes into force, establishing the European Communities between Luxembourg, Belgium, Netherlands, West Germany, France and Italy.\n|-\n|style=text-align:left |Taipei becomes a Special municipality separate from Taiwan Province, thus becoming the de jure capital of the Republic of China.\n|-\n|5 July||style=text-align:left |French Somaliland is renamed the French Territory of the Afars and Issas.\n|-\n|12 July||style=text-align:left |Following a referendum the day before, the Republic of Anguilla declares independence from the associated state of Saint Christopher, Nevis and Anguilla while seeking to remain a territory of the United Kingdom. The Valley becomes the capital.\n|-\n|8 August||style=text-align:left |With the signing of the ASEAN Declaration, the Association of Southeast Asian Nations is founded as a regional grouping of five states: Indonesia, Malaysia, Philippines, Singapore, and Thailand.\n|-\n|14 August||style=text-align:left |The capital of Pakistan is moved from Rawalpindi to Islamabad.\n|-\n|17 August||style=text-align:left |Biafra takes over the Benin region.\n|-\n|8 September||style=text-align:left |Uganda is renamed the Republic of Uganda, but remains in the Commonwealth of Nations.\n|-\n|19 September||style=text-align:left |The Republic of Benin becomes a puppet state that has no recognition from the parent state (Biafra).\n|-\n|20&nbsp;September||style=text-align:left |The Republic of Benin is taken over by Nigeria.\n|-\n|7 November||style=text-align:left |South Yemen declares its independence from the United Kingdom as the '''People's Republic of South Yemen. Aden is the capital.\n|-\n|30 November||style=text-align:left |The United Kingdom transfers the Khuriya Muriya Islands to Muscat and Oman.\n|-\n|rowspan=9 |1968||31 January||style=text-align:left |Nauru gains independence from a United Nations trusteeship jointly administered by the Commonwealth of Australia, New Zealand, and the United Kingdom as the Republic of Nauru. Nauru becomes a special member of the Commonwealth of Nations'. Yaren remains the de facto capital.\n|-\n|12 March||style=text-align:left |Mauritius gains independence from the United Kingdom. Port Louis remains the capital.\n|-\n|18 May||style=text-align:left |Mexico annexes the Los Indios banco from the United States of America.\n|-\n|26 June||style=text-align:left |The Allied-occupied Bonin-Volcano Islands are given back to Japan.\n|-\n|6 September||style=text-align:left |The Kingdom of Swaziland gains full independence from the United Kingdom. Mbabane is the capital.\n|-\n|20-21 August||style=text-align:left |Four Warsaw Pact members - the Soviet Union, Poland, Bulgaria, and Hungary jointly invade and occupy Czechoslovakia to stop reforms by the Soviet satellite government. Romania and Albania refuse to participate; Albania leaves the pact less than a month later.\n|-\n|13 September||style=text-align:left |Albania formally withdraws from the Warsaw Pact, having withheld support since 1961 over the Soviet-Albanian split.\n|-\n|12 October||style=text-align:left |Spanish Guinea gains independence from Spain as the Republic of Equatorial Guinea. Malabo remains the capital.\n|-\n|11 November||style=text-align:left |The Republic of Maldives supersedes the Sultanate of Maldives as a republic outside the Commonwealth of Nations.\n|-\n|rowspan=9 |1969||7 February||style=text-align:left |Following a referendum the day before, the Republic of Anguilla declares independence from the United Kingdom. The Valley remains the capital.\n|-\n|19 March||style=text-align:left |The Republic of Anguilla is overthrown by British forces and reincorporated into the associated state of Saint Christopher, Nevis and Anguilla.\n|-\n|10 May||style=text-align:left |The United Kingdom changes the name of the Colony of the Bahama Islands to the Commonwealth of the Bahama Islands.\n|-\n|25 May||style=text-align:left |Following a coup, the Democratic Republic of the Sudan supersedes the Republic of the Sudan. Khartoum remains the capital.\n|-\n|30 June||style=text-align:left |Spain transfers Ifni to Morocco.\n|-\n|1 September||style=text-align:left |Following a coup, the Libyan Arab Republic supersedes the Kingdom of Libya. Tripoli becomes the sole capital.\n|-\n|21 October||style=text-align:left |Following a coup, the Somali Democratic Republic supersedes the Somali Republic. Mogadishu remains the capital.\n|-\n|19 November||style=text-align:left |The UN General Assembly formally recognizes 'Indonesia's annexation of West New Guinea''' 'in accordance' with the New York Agreement.\n|-\n|31 December||style=text-align:left |The Republic of the Congo changes its name to the '''People's Republic of the Congo.\n|}\n1970s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n| rowspan=14|1970 ||15 January||style=text-align:left |The Republic of Biafra capitulates and is reabsorbed by Nigeria.\n|-\n|18 January||style=text-align:left |Kuwait and Saudi Arabia ratify an agreement to partition the Neutral Zone between the two.\n|-\n|23 February||style=text-align:left |Guyana changes its name to the Co-operative Republic of Guyana and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|2 March||style=text-align:left |Rhodesia is declared the Republic of Rhodesia, but this is declared illegal by the international community as well as by the United Kingdom. Rhodesia remains de jure a British colony.\n|-\n|18 March||style=text-align:left |Following the deposition of Prince Norodom Sihanouk, the Kingdom of Cambodia changes its name to the State of Cambodia.\n|-\n|24 April||style=text-align:left |Following a referendum, The Gambia changes its name to the Republic of The Gambia and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|1 May||style=text-align:left |British Honduras begins to move its capital from Belize City to Belmopan.\n|-\n|4 June||style=text-align:left |The Kingdom of Tonga gains full independence from the United Kingdom, withdrawing from its protectorate agreement. Tonga becomes a fully independent native monarchy in the Commonwealth of Nations.Nukualofa remains the capital.\n|-\n|27 July||style=text-align:left |Mexico annexes 15 bancos from the United States, and the United States annexes 4 bancos from Mexico, under the terms of the Banco Convention of 1905; Mexico acquires a net 507.6 hectares (1254.1 acres).\n|-\n|9 August||style=text-align:left |The Sultanate of Muscat and Oman changes its name to the Sultanate of Oman.\n|-\n|9 October||style=text-align:left |The State of Cambodia changes its name to the Khmer Republic.\n|-\n|10 October||style=text-align:left |The Colony of Fiji gains independence from the United Kingdom as the Dominion of Fiji.\n|-\n|29 October||style=text-align:left |Mexico annexes the Panales and Loma del Pinto Segundo bancos from the United States''' under the terms of the Banco Convention of 1905, acquiring 72 hectares (177.8 acres).\n|-\n|30 November||style=text-align:left |The People's Republic of South Yemen changes its name to the '''People's Democratic Republic of Yemen.\n|-\n| rowspan=\"14\" |1971 ||26 March||style=text-align:left |Amidst a military crackdown by Pakistani forces, East Pakistan declares independence from Pakistan as the People's Republic of Bangladesh, sparking the Liberation War. Bangladesh becomes part of the Commonwealth of Nations. Dhaka becomes the capital.\n|-\n|19 April||style=text-align:left |Sierra Leone changes its name to the Republic of Sierra Leone and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|14 August||style=text-align:left |The protectorate of Bahrain and Its Dependencies declares independence from the United Kingdom as the State of Bahrain; its special treaties with the UK are abrogated the next day. Manama remains the capital.\n|-\n|1 September||style=text-align:left |The protectorate of Qatar declares independence from the United Kingdom as the State of Qatar; its special treaties with the UK are abrogated two days later. Doha remains the capital.\n|-\n|11 September||style=text-align:left |Following a referendum, the United Arab Republic changes its name to the Arab Republic of Egypt.\n|-\n|25 October||style=text-align:left |The People's Republic of China replaces the Republic of China''' in China's seat in the United Nations.\n|-\n|27 October||style=text-align:left |The Democratic Republic of the Congo changes its name to the Republic of Zaire.\n|-\n|29 November||style=text-align:left |Following the withdrawal of British forces, Iran conquers Greater and Lesser Tunbs from the Trucial State of Ras Al Khaimah.\n|-\n|30 November||style=text-align:left |Following the withdrawal of British forces, Iran conquers Abu Musa from the Trucial State of Sharjah.\n|-\n|1 December||style=text-align:left |The United Kingdom ends its protectorate over the Trucial States.\n|-\n| rowspan=2|2 December||style=text-align:left |The United Arab Emirates is established between six of the seven emirates of the former Trucial States: Abu Dhabi, Ajman, Dubai, Fujairah, Sharjah, and Umm Al Quwain. Abu Dhabi city becomes the capital.\n|-\n|style=text-align:left |The Emirate of Ras Al Khaimah temporarily becomes independent, as it rejects the terms of the agreement between the other former Trucial States. Ras Al Khaimah City remains the capital.\n|-\n|13 December||style=text-align:left |Australia changes the name of the Territory of Papua and New Guinea to Papua New Guinea.\n|-\n|16 December\n|\n* Secession of Pakistan's eastern wing\n* Independence of Bangladesh is secured as Pakistani forces surrender, soon global powers would immediately recognize it the new nation. Bangladesh becomes a republic in the Commonwealth of Nations.\n|-\n| rowspan=9|1972 ||1 January||style=text-align:left |Following simultaneous referendums on 1 September 1971 in Egypt, in Libya, and in Syria, the Federation of Arab Republics is formed as a confederation working toward state unification.\n|-\n| rowspan=2|10 February||style=text-align:left |The Emirate of Ras Al Khaimah joins the United Arab Emirates. Ras Al Khaimah City yields to Abu Dhabi as the capital.\n|-\n|style=text-align:left |The United Kingdom formally incorporates Rockall as part of Scotland.\n|-\n|28 February||style=text-align:left |The Southern Sudan Autonomous Region is established in Sudan.\n|-\n|15 May||style=text-align:left |The United States transfers the Ryukyu Islands, including the Daitō Islands, back to Japan as Okinawa Prefecture.\n|-\n|20 May||style=text-align:left |Following a referendum, the Federal Republic of Cameroon changes its name to the United Republic of Cameroon.\n|-\n|22 May||style=text-align:left |Ceylon changes its name to the Free, Sovereign and Independent Republic of Sri Lanka and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|17 August||style=text-align:left |Indonesia changes the name of its capital from Djakarta to Jakarta.\n|-\n|1 September||style=text-align:left |The United States removes its claims over the Swan Islands, ending part of its territorial dispute with Honduras.\n|-\n| rowspan=14|1973 ||First Half||style=text-align:left |Libya invades the Aouzou Strip in northern Chad, formally annexing the region in 1975 and occupying it until 1994.\n|-\n| rowspan=3|1 January||style=text-align:left |Portugal reorganizes the Overseas Province of Angola as the State of Angola.\n|-\n|style=text-align:left |Portugal reorganizes the Overseas Province of Mozambique as the State of Mozambique.\n|-\n|style=text-align:left |Denmark, Ireland, and the United Kingdom join the European Communities.\n|-\n|29 March||style=text-align:left |The last U.S. combat troops are flown out of Tan Son Nhut Air Base, ending the eight-year United States occupation of South Vietnam.\n|-\n|24 April||style=text-align:left |The Gambia changes the name of its capital from Bathurst to Banjul.\n|-\n| rowspan=2|1 June||style=text-align:left |The Kingdom of Greece changes its name to the Hellenic Republic.\n|-\n|style=text-align:left |The United Kingdom changes the name of the Crown Colony of British Honduras to the Crown Colony of Belize.\n|-\n|10 July||style=text-align:left |The Commonwealth of the Bahama Islands gains independence from the United Kingdom as the Commonwealth of The Bahamas. Nassau remains the capital.\n|-\n|17 July||style=text-align:left |Following a coup, the Republic of Afghanistan supersedes the Kingdom of Afghanistan. Kabul remains the capital.\n|-\n|24 September||style=text-align:left |PAIGC rebels declare the independence of Portuguese Guinea from Portugal as the Republic of Guinea-Bissau. Madina do Boe is the de facto capital.\n|-\n|25 October||style=text-align:left |A ceasefire is imposed in the Yom Kippur War, with Israel occupying 1600&nbsp;km2 of Egyptian and 500&nbsp;km2 of Syrian territory conquered since 6 October.\n|-\n|2 November||style=text-align:left |The UN General Assembly recognizes the independence of the Republic of Guinea-Bissau, the first sub-Saharan African state to unilaterally declare independence without the consent of its colonial power (Portugal).\n|-\n|19 November||style=text-align:left |Uruguay relinquishes its claim to Martín García Island to Argentina.\n|-\n| rowspan=17|1974 ||3 January||style=text-align:left |The Union of Burma changes its name to the Socialist Republic of the Union of Burma.\n|-\n|20 January||style=text-align:left |China conquers the contested Paracel Islands after a naval battle against South Vietnam.\n|-\n|7 February||style=text-align:left |The associated state of Grenada gains independence from the United Kingdom. St. George's remains the capital.\n|-\n|21 February||style=text-align:left |Israel completely withdraws from Egyptian territory west of the Suez Canal occupied in the Yom Kippur War, as part of the January Separation of Forces Agreement between the two states and the UN Security Council.\n|-\n|22 February||style=text-align:left |Pakistan recognizes the independence of Bangladesh, relinquishing its claims to the former East Pakistan.\n|-\n| 24 March||style=text-align:left |The Nation of Tanna declares independence from the Anglo–French New Hebrides Condominium.\n|-\n|26 June||style=text-align:left |Israel completely withdraws from Syrian territory occupied in the Yom Kippur War and 25&nbsp;km2 occupied in the Six-Day War, implementing the May 1974 agreement creating a 235&nbsp;km2 UNDOF buffer zone.\n|-\n|29 June||style=text-align:left |The Nation of Tanna is overthrown and reincorporated into the Anglo–French New Hebrides Condominium.\n|-\n|16 August||style=text-align:left |Turkey imposes a ceasefire after conquering 37% of Cyprus since 20 July. UN peacekeepers on the island since 1963 are deployed along the ceasefire line to create an expanded United Nations Buffer Zone in Cyprus.\n|-\n|21 August||style=text-align:left |Saudi Arabia and the United Arab Emirates agree on a new mutual border, though the UAE subsequently disputes the Saudi interpretation of the new boundary line.\n|-\n|5 September||style=text-align:left |The Parliament of India passes a constitutional amendment incorporating the Kingdom of Sikkim as an \"associate state\".\n|-\n|10 September||style=text-align:left |Following an agreement to end the war on 26 August, Portugal dissolves Portuguese Guinea and recognizes the independence of the Republic of Guinea-Bissau. Bissau becomes the capital.\n|-\n|12 September||style=text-align:left |Following a Derg coup amidst popular unrest, the Provisional Military Government supersedes the Ethiopian Empire, though the monarchy is formally abolished only on 21 March 1975. Addis Ababa remains the capital.\n|-\n|1 October||style=text-align:left |The Autonomous Turkish Cypriot Administration is established as a nominally autonomous state in the Turkish–occupied territories of Cyprus. North Nicosia becomes the de facto capital.\n|-\n|19 October||style=text-align:left |Following a referendum, the status of Niue is upgraded to self-government in free association with New Zealand. Alofi remains the capital.\n|-\n|13 December||style=text-align:left |The State of Malta changes its name to the Republic of Malta and severs all ties to the British monarchy as a Commonwealth realm.\n|-\n|20 December||style=text-align:left |Following the proclamation of \"Ethiopian socialism\", the Derg Provisional Military Government begins using the name Provisional Military Government of Socialist Ethiopia.\n|-\n| rowspan=28|1975 ||1 January||style=text-align:left |Malawi moves its capital from Zomba to Lilongwe.\n|-\n|13 February||style=text-align:left |The Autonomous Turkish Cypriot Administration is reorganized as the Turkish Federated State of Cyprus, with the intention of forcing federation upon Cyprus. North Nicosia remains the capital.\n|-\n|9 April||style=text-align:left |India invades the Kingdom of Sikkim, organizing a referendum on abolishing the monarchy five days later.\n|-\n|17 April||style=text-align:left |Following the victory of the Khmer Rouge in the Cambodian Civil War, Kampuchea supersedes the Khmer Republic. Phnom Penh remains the capital.\n|-\n|30 April||style=text-align:left |Following the Fall of Saigon, the Provisional Revolutionary Government of the Republic of South Vietnam supersedes the Republic of Vietnam. Saigon remains the capital.\n|-\n|16 May||style=text-align:left |India officially annexes the Kingdom of Sikkim as the State of Sikkim. Gangtok yields to New Delhi as the capital.\n|-\n|22 June||style=text-align:left |The United Kingdom changes the name of British Solomon Islands Protectorate to Solomon Islands.\n|-\n|25 June||style=text-align:left |In accordance with the Lusaka Accord, the State of Mozambique gains independence from Portugal as the '''People's Republic of Mozambique. Lourenço Marques remains the capital.\n|-\n|5 July||style=text-align:left |The Overseas Province of Cape Verde gains independence from Portugal as the Republic of Cape Verde. Praia remains the capital.\n|-\n| rowspan=2|6 July||style=text-align:left |Following a referendum in December 1974, the Territory of the Comoros unilaterally declares independence from France as the State of Comoros. Moroni remains the capital.\n|-\n|style=text-align:left |Due to its \"no\" vote in the December 1974 referendum, Mayotte separates from the Comoros''' upon the latter's independence and remains part of France, though its exact status is undefined. Dzaoudzi becomes the capital.\n|-\n|12 July||style=text-align:left |The Overseas Province of São Tomé and Príncipe gains independence from Portugal as the Democratic Republic of São Tomé and Príncipe. São Tomé remains the capital.\n|-\n|1 September||style=text-align:left |Two weeks before Papua New Guinea's independence, Bougainville Island declares independence from the territory and from Australia as the Republic of North Solomons. Arawa becomes the capital.\n|-\n|4 September||style=text-align:left |In a treaty with Egypt, Israel agrees to withdraw from western Sinai and create a United Nations Emergency Force buffer zone in the region.\n|-\n|16 September||style=text-align:left |Papua New Guinea gains independence from Australia as the Independent State of Papua New Guinea. Port Moresby remains the capital.\n|-\n|1 October||style=text-align:left |Following a referendum, the British Colony of Gilbert and Ellice Islands is de jure divided into the Colony of Gilbert Islands and the Colony of Tuvalu. Tarawa remains and Funafuti becomes their respective capitals.\n|-\n|11 November||style=text-align:left |In accordance with the Alvor Agreement, the State of Angola gains independence from Portugal as the '''People's Republic of Angola. Luanda remains the capital.\n|-\n|14 November||style=text-align:left |A week after Morocco organized the Green March into Spanish Sahara, Spain agrees to decolonize Western Sahara through a temporary tripartite administration with Mauritania and Morocco.\n|-\n|25 November||style=text-align:left |Suriname gains full independence from the Kingdom of the Netherlands as the Republic of Suriname. Paramaribo remains the capital.\n|-\n|28 November||style=text-align:left |The Fretilin party unilaterally declares the independence of Portuguese Timor as East Timor. Dili remains the capital. The UN continues to recognize Portugal as the legitimate administrative power until May 2002.\n|-\n|30 November||style=text-align:left |The Republic of Dahomey changes its name to the People's Republic of Benin.\n|-\n|2 December||style=text-align:left |Following the victory of the Pathet Lao in the Laotian Civil War, the Lao People's Democratic Republic supersedes the Kingdom of Laos. Vientiane remains the capital.\n|-\n|7 December||style=text-align:left |Indonesia invades East Timor, beginning a twenty-four-year occupation.\n|-\n|8 December||style=text-align:left |Portugal completely withdraws its forces from East Timor.\n|-\n|11 December||style=text-align:left |Morocco occupies Laayoune, the capital of Western Sahara, beginning an occupation which continues to the present; fighting immediately breaks out with Polisario Front''' rebels demanding the territory's independence.\n|-\n|22 December||style=text-align:left |Mauritania conquers La Güera and Tichla after a two-week battle against the Polisario Front, beginning a four-year occupation of the southern part of Western Sahara.\n|-\n|26 December||style=text-align:left |Iran and Iraq complete the demarcation of their border in the Shatt al-Arab on the basis of the March treaty which resolved their dispute over the waterway.\n|-\n|30 December||style=text-align:left |Following a referendum, the Malagasy Republic changes its name to the Democratic Republic of Madagascar.\n|-\n| rowspan=20|1976\n|1 January||style=text-align:left |The de facto division of the British Colony of Gilbert and Ellice Islands into the Colony of Gilbert Islands and the Colony of Tuvalu occurs, with the separation of the old administration and introduction of new state symbols.\n|-\n|5 January||style=text-align:left |Kampuchea changes its name to Democratic Kampuchea.\n|-\n|8 January||style=text-align:left |The United States annexes the Carranza, Macum, La Oficina, Vado de Pierda, Las Viboras, and Rancho Texas bancos from Mexico under the terms of the Banco Convention of 1905, acquiring 19.9 hectares (49.2 acres).\n|-\n|26 February||style=text-align:left |Spain completely withdraws its forces and relinquishes its status as the administrative power in Western Sahara.\n|-\n|27 February||style=text-align:left |The Polisario Front proclaims the Sahrawi Arab Democratic Republic as an independent state Western Sahara with its capital in Laayoune. 84 UN member states recognize its independence at different times.\n|-\n|13 March||style=text-align:left |The '''People's Republic of Mozambique changes the name of its capital from Lourenço Marques to Maputo.\n|-\n|14 April||style=text-align:left |Amidst a war against the Polisario Front, Mauritania and Morocco partition Western Sahara, with Mauritania annexing the southern third as Tiris al-Gharbiyya and Morocco annexing the rest as its Southern Provinces.\n|-\n|23 June||style=text-align:left |The United Kingdom detaches Aldabra, Desroches and the Farquhar Group from the British Indian Ocean Territory and returns the islands to the Seychelles''' days before the latter's independence.\n|-\n|24 June||style=text-align:left |The Philippines moves its capital from Quezon City back to Manila; the new Metro Manila becomes the official seat of government. Baguio is no longer recognized as the summer capital.\n|-\n|29 June||style=text-align:left |The Crown Colony of the Seychelles gains independence from the United Kingdom within the Commonwealth of Nations as the Republic of the Seychelles. Victoria remains the capital.\n|-\n|2 July||style=text-align:left |The Democratic Republic of Vietnam and the Provisional Revolutionary Government of the Republic of South Vietnam unite to form the Socialist Republic of Vietnam. Saigon yields to Hanoi as the capital.\n|-\n|17 July||style=text-align:left |Indonesia annexes East Timor as the province of East Timor, although much of the mountainous interior remains under the control of the Fretilin resistance movement.\n|-\n|19 July||style=text-align:left |France incorporates the Overseas Territory of Saint Pierre and Miquelon as the Overseas Department of Saint Pierre and Miquelon.\n|-\n|1 August||style=text-align:left |Trinidad and Tobago changes its name to the Republic of Trinidad and Tobago and severs all ties to the British monarchy as a Commonwealth realm, but remains in the Commonwealth of Nations.\n|-\n|9 August||style=text-align:left |The Republic of the North Solomons surrenders to Papua New Guinea in an agreement promising Bougainville Island autonomy as North Solomons Province.\n|-\n|26 October||style=text-align:left |The Bantustan Republic of Transkei is declared independent by South Africa. Mthatha becomes the capital. No other country recognizes its independence, widely seen as part of the institution of apartheid.\n|-\n|7 November||style=text-align:left |Argentina occupies Southern Thule in the South Sandwich Islands, territory internationally recognized as part of the United Kingdom.\n|-\n|4 December||style=text-align:left |The Central African Republic changes its name to the Central African Empire.\n|-\n|24 December||style=text-align:left |After confirming its decision to break with the Comoros and remain part of France in two referendums held in February and April, Mayotte is reorganized as the Territorial Collectivity of Mayotte.\n|-\n|28 December||style=text-align:left |The People's Republic of Albania changes its name to the '''People's Socialist Republic of Albania.\n|-\n| rowspan=10|1977 ||11 February||style=text-align:left |Mayotte moves its capital from Dzaoudzi to Mamoudzou.\n|-\n|1 March||style=text-align:left |The United States claims maritime borders west of the Strait of Juan de Fuca, within the Dixon Entrance, and in the Beaufort Sea that conflict with the claims of Canada.\n|-\n|2 March||style=text-align:left |The Libyan Arab Republic changes its name to the Socialist People's Libyan Arab Jamahiriya.\n|-\n|31 March||style=text-align:left |The United Kingdom officially turns over its military bases in Masirah Island and Salalah to Oman, fulfilling a demand of the United Nations for the UK to end its \"colonial policies\" in Oman.\n|-\n|22 May||style=text-align:left |Argentina and Chile turn to the United Kingdom to arbitrate a border dispute over the territorial and maritime borders between them. The United Kingdom recognizes the islands Picton, Nueva and Lennox as Chilean territory as well as the southern half of the Beagle Channel and its islands. The northern half is awarded to Argentina, along with several small islands. The maritime projection of the border defined by the arbitration projects Chile to Antarctica. Due to this, Argentina to declares the result \"not valid.\"\n|-\n|26 May||style=text-align:left |Mexico and the United States complete the implementation of the Boundary Treaty of 1970, resulting in several parcels of land being swapped.\n|-\n|27 June||style=text-align:left |Following a referendum, the French Territory of the Afars and the Issas gains independence from France as the Republic of Djibouti. Djibouti City remains the capital.\n|-\n|13 July||style=text-align:left |Somalia invades Ethiopia, conquering most of the ethnic-Somali region of Ogaden by mid-September\n|-\n|5 December||style=text-align:left |The Federation of Arab Republics effectively ceases to exist as Libya and Syria dissolve the Federation Presidential Council, though Egypt does not formally withdraw from the confederation until 1 October 1984.\n|-\n|6 December||style=text-align:left |The Bantustan Republic of Bophuthatswana is declared independent by South Africa. Mmabatho becomes the capital. No other country recognizes its independence, widely seen as part of the institution of apartheid.\n|-\n| rowspan=9|1978 ||23 March||style=text-align:left |Ethiopia reconquers more than two-thirds of Ogaden, though for several more years Somalia continues to intervene in the region directly and in support of the Western Somali Liberation Front.\n|-\n|30 April||style=text-align:left |Following the Saur Revolution, the Democratic Republic of Afghanistan supersedes the Republic of Afghanistan. Kabul remains the capital.\n|-\n|7 July||style=text-align:left |Solomon Islands gains independence from the United Kingdom as a Commonwealth realm. Honiara remains the capital.\n|-\n|7 September||style=text-align:left |The Free, Sovereign and Independent Republic of Sri Lanka changes its name to the Democratic Socialist Republic of Sri Lanka.\n|-\n| rowspan=2|1 October||style=text-align:left |Tuvalu gains independence from the United Kingdom. Funafuti remains the capital.\n|-\n|style=text-align:left |Following the ratification of a new constitution by referendum, the State of Comoros changes its name to the Federal Islamic Republic of the Comoros.\n|-\n|3 November||style=text-align:left |The associated state of Dominica gains independence from the United Kingdom as the Commonwealth of Dominica. Roseau remains the capital.\n|-\n|25 December||style=text-align:left |Vietnam invades Democratic Kampuchea, beginning an occupation of Cambodia lasting more than ten years.\n|-\n|29 December||style=text-align:left |Following the transition to democracy and the ratification of a new constitution by referendum, the Spanish State changes its name to the Kingdom of Spain.\n|-\n| rowspan=16|1979 ||7 January||style=text-align:left |Vietnam conquers Phnom Penh effectively overthrowing Democratic Kampuchea, though it remains the UN-recognized government of Cambodia and the Khmer Rouge continues as an insurgency until June 1998.\n|-\n|8 January||style=text-align:left |The People's Republic of Kampuchea is established by the pro-Vietnamese Salvation Front. Phnom Penh remains the capital of Cambodia.\n|-\n|11 February||style=text-align:left |Following the overthrow of the Pahlavi dynasty, Iran supersedes the Imperial State of Iran. Tehran remains the capital.\n|-\n|22 February||style=text-align:left |The associated state of Saint Lucia gains independence from the United Kingdom. Castries remains the capital.\n|-\n|1 April||style=text-align:left |Following a referendum, Iran changes its name to the Islamic Republic of Iran.\n|-\n|1 June||style=text-align:left |Rhodesia changes its name to Zimbabwe Rhodesia, implementing an unsuccessful bid for international recognition through a settlement between the white government and moderate African nationalists.\n|-\n| rowspan=2|12 July||style=text-align:left |The Colony of Gilbert Islands gains independence from the United Kingdom as the Republic of Kiribati; it includes most of the Phoenix and Line Islands claimed by the United States until 1983. South Tarawa remains the capital.\n|-\n|style=text-align:left |The United Kingdom–United States condominium of Canton and Enderbury Islands is effectively dissolved into Kiribati, as the UK cedes its claims and US forces evacuate the territory ahead of the Treaty of Tarawa.\n|-\n|5 August||style=text-align:left |Failing to defeat the Sahrawi insurgency despite French support, Mauritania relinquishes all territorial claims in Western Sahara in a peace treaty with the Polisario Front.\n|-\n|11 August||style=text-align:left |Morocco annexes the southern third of Western Sahara''' following Mauritania's withdrawal. No UN member state has formally recognized Morocco's annexation of any part of Western Sahara.\n|-\n|13 September||style=text-align:left |The Bantustan Republic of Venda is declared independent by South Africa. Thohoyandou becomes the capital. No other country recognizes its independence, widely seen as part of the institution of apartheid.\n|-\n|21&nbsp;September||style=text-align:left |The Central African Empire is overthrown by rebel forces supported by France, and a proclamation is made restoring the Central African Republic.\n|-\n|1 October||style=text-align:left |The United States dissolves the Panama Canal Zone, transferring its territory to Panama except for 44 US enclaves which will be returned later in stages, and joint control of the canal which continues until 31 December 1999.\n|-\n|27 October||style=text-align:left |The associated state of Saint Vincent gains independence from the United Kingdom as Saint Vincent and the Grenadines. Kingstown remains the capital.\n|-\n|11 December||style=text-align:left |Zimbabwe Rhodesia temporarily returns under the rule of the United Kingdom as Southern Rhodesia, implementing the Lancaster House Agreement.\n|-\n|25 December||style=text-align:left |The Soviet Union invades Afghanistan, overthrowing its government two days later and beginning an occupation lasting more than nine years.\n|}\n1980s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n| rowspan=10|1980 ||1 January||style=text-align:left |Tafea declares independence from the Anglo–French New Hebrides Condominium.\n|-\n|18 April||style=text-align:left | Southern Rhodesia gains independence within the Commonwealth of Nations from the United Kingdom as the Republic of Zimbabwe. Salisbury remains the capital.\n|-\n|26 May||style=text-align:left |Tafea is overthrown by British forces and reincorporated into the Anglo–French New Hebrides Condominium.\n|-\n|28 May||style=text-align:left |The Republic of Vemerana declares independence from the Anglo–French New Hebrides Condominium.\n|-\n|28 July||style=text-align:left |Peruvian Republic changes its name to the Republic of Peru.\n|-\n| rowspan=2|30 July||style=text-align:left |Israel passes the Jerusalem Law, annexing East Jerusalem and expanding its capital of Jerusalem to encompass the annexed area. The United Nations Security Council declares the law null and void.\n|-\n|style=text-align:left |The New Hebrides Condominium gains independence from France and the United Kingdom as the Republic of Vanuatu. Vanuatu becomes a part of the Commonwealth of Nations. Port Vila remains the capital.\n|-\n|28 August||style=text-align:left |The Republic of Vemerana is overthrown by the forces of Vanuatu supported by those of Papua New Guinea and the Solomon Islands.\n|-\n|22 September||style=text-align:left |Iraq invades Iran capturing more than 15,000&nbsp;km2 by December, much of which it occupies for almost two years.\n|-\n|19 December||style=text-align:left |The United Kingdom divides the associated state of Saint Christopher, Nevis and Anguilla into Saint Christopher and Nevis and the Crown Colony of Anguilla. Basseterre remains and The Valley becomes their respective capitals.\n|-\n| rowspan=6|1981 ||1 January||style=text-align:left |Greece joins the European Communities.\n|-\n||17 September||style=text-align:left |The United States removes its claims over Roncador Bank, Serrana Bank, and Quita Sueño Bank, ending part of its territorial dispute with Colombia.\n|-\n|21 September||style=text-align:left |The Crown Colony of Belize gains independence from the United Kingdom as a Commonwealth realm. Belmopan remains the capital.\n|-\n|1 November||style=text-align:left |The associated state of Antigua gains independence from the United Kingdom as Antigua and Barbuda. St. John's remains the capital.\n|-\n|4 December||style=text-align:left |The Bantustan Republic of Ciskei is declared independent by South Africa. Bisho becomes the capital. No other country recognizes its independence, widely seen as part of the institution of apartheid.\n|-\n|14 December||style=text-align:left |Israel annexes the Golan Heights.\n|-\n| rowspan=14|1982 ||28 January||style=text-align:left |Iraq approves a treaty of 26 December with Saudi Arabia to partition the Neutral Zone between the two. The actual division of the territory occurs thereafter, though the new border is made public only in June 1991.\n|-\n|1 February||style=text-align:left |Senegal and The Gambia attempt to unite to form the Senegambia Confederation. Dakar becomes the confederation capital, though most government powers remain with the separate states.\n|-\n|29 March||style=text-align:left |Canada becomes a fully sovereign state with the promulgation of the Canada Act, eliminating all remaining powers in the country of the Parliament of the United Kingdom.\n|-\n|2 April||style=text-align:left |Argentina conquers the Falkland Islands from the United Kingdom, renaming the territory Islas Malvinas and the capital from Stanley to Puerto Argentino during a two-month-long occupation.\n|-\n|3 April||style=text-align:left |Argentina conquers South Georgia from the United Kingdom.\n|-\n|18 April||style=text-align:left |Zimbabwe changes the name of its capital from Salisbury to Harare.\n|-\n|25 April||style=text-align:left |The United Kingdom reconquers South Georgia from Argentina.\n|-\n|26 April||style=text-align:left |Israel completes the sixth and final step of withdrawal, begun on 25 May 1979, from the remaining territory it occupied in the Sinai Peninsula, fulfilling the terms of its March 1979 peace treaty with Egypt.\n|-\n|29 April||style=text-align:left |Sri Lanka moves its capital from Colombo to Sri Jayawardenepura Kotte.\n|-\n|30 May||style=text-align:left |Spain joins the North Atlantic Treaty Organization in the alliance's third enlargement.\n|-\n|14 June||style=text-align:left |The United Kingdom reconquers the Falkland Islands from Argentina, ending the Falklands War.\n|-\n|20 June||style=text-align:left |The United Kingdom reconquers Southern Thule in the South Sandwich Islands from Argentina.\n|-\n|30 June||style=text-align:left |Iraqi forces are completely expelled from Iran amidst the ongoing Iran–Iraq War.\n|-\n|15 August||style=text-align:left |The unrecognized Kingdom of Rwenzururu disbands and surrenders to Uganda as part of an agreement promising the region a degree of local autonomy, eventually leading to its revival as a subnational kingdom.\n|-\n| rowspan=9|1983 ||1 January||style=text-align:left |The United Kingdom changes the title of its Crown colonies and self-governing colonies to that of British Dependent Territories.\n|-\n|21 March||style=text-align:left |Ivory Coast moves its capital from Abidjan to Yamoussoukro.\n|-\n|5 June||style=text-align:left |The Southern Sudan Autonomous Region is abolished in Sudan.\n|-\n|3 September||style=text-align:left |The United States removes its claims over Atafu, Fakaofo, and Nukunono, ending part of its territorial dispute with Tokelau.\n|-\n|8 September||style=text-align:left |The United States removes its claims over Pukapuka, Manihiki, Penrhyn, and Rakahanga, ending its territorial dispute with the Cook Islands.\n|-\n|19 September||style=text-align:left |The associated state of Saint Christopher and Nevis gains independence from the United Kingdom as the Federation of Saint Christopher and Nevis (Saint Kitts and Nevis). Basseterre remains the capital.\n|-\n| rowspan=2|23 September||style=text-align:left |The United States removes its claims over Birnie, Canton, Caroline, Christmas, Enderbury, Flint, Gardner, Hull, Malden, McKean, Phoenix, Starbuck, Sydney, and Vostok Islands, ending its territorial dispute with Kiribati.\n|-\n|style=text-align:left |The United States removes its claims over Funafuti, Niulakita, Nukufetau, and Nukulaelae, ending its territorial dispute with Tuvalu.\n|-\n|15 November||style=text-align:left |The Turkish Federated State of Cyprus declares independence from Cyprus as the Turkish Republic of Northern Cyprus. North Nicosia remains the capital. Only Turkey, which occupies Northern Cyprus, recognizes it.\n|-\n| rowspan=5|1984 ||1 January||style=text-align:left |The Brunei Darussalam (Nation of Brunei, the Abode of Peace) gains independence within the Commonwealth of Nations from the United Kingdom.\n|-\n|7 January||style=text-align:left |Brunei joins ASEAN as the association's sixth member state.\n|-\n|4 February||style=text-align:left |The United Republic of Cameroon changes its name to the Republic of Cameroon.\n|-\n|4 August||style=text-align:left |The Republic of Upper Volta changes its name to Burkina Faso.\n|-\n|29 November||style=text-align:left |A treaty, approved in Argentina by referendum, resolves the Beagle conflict by awarding the disputed Picton, Lennox and Nueva Islands to Chile and most of the adjacent maritime territory to Argentina. It also resolves the Question of the East mouth of the Strait of Magellan, defining its border in Punta Dungeness and Cabo del Espíritu Santo, being a Chilean water body, as well as the eastern waters as Argentine maritime territory.\n|-\n| rowspan=5|1985 ||6 June||style=text-align:left |Israel withdraws from other territory it had captured in Lebanon since 1982 to a self-declared \"security zone\" of formal occupation covering 850&nbsp;km2 of southern Lebanon.\n|-\n|11 June||style=text-align:left |France restores autonomous government to the Overseas Department of Saint Pierre and Miquelon, reorganizing it as the Territorial Collectivity of Saint Pierre and Miquelon.\n|-\n|3 October||style=text-align:left |The United Kingdom detaches the Falkland Islands Dependencies from the Falkland Islands as the separate territory of South Georgia and the South Sandwich Islands. King Edward Point becomes the capital.\n|-\n|10 October||style=text-align:left |The Democratic Republic of the Sudan changes its name to the Republic of the Sudan.\n|-\n|14 October||style=text-align:left |The Republic of Ivory Coast changes its official English name to the '''Republic of Côte d'Ivoire.\n|-\n| rowspan=8|1986 || rowspan=2|1 January||style=text-align:left |Aruba withdraws from the Netherlands Antilles and becomes a constituent country of the Kingdom of the Netherlands. Oranjestad becomes the capital.\n|-\n|style=text-align:left |Portugal and Spain join the European Communities.\n|-\n|3 March||style=text-align:left |Australia becomes a fully sovereign state with the promulgation of the Australia Act, eliminating all remaining powers in the country of the Parliament of the United Kingdom'''.\n|-\n|15 April||style=text-align:left |The Socialist People's Libyan Arab Jamahiriya changes its name to the '''Great Socialist People's Libyan Arab Jamahiriya.\n|-\n|30 September||style=text-align:left |The United States returns almost half of its concession at Thule Air Base to the jurisdiction of Greenland and Denmark.\n|-\n|21 October||style=text-align:left |The Republic of the Marshall Islands withdraws from the US–administered United Nations Trust Territory of the Pacific Islands and becomes independent in free association with the United States. Majuro remains the capital.\n|-\n|3 November||style=text-align:left |The Federated States of Micronesia withdraws from the US–administered United Nations Trust Territory of the Pacific Islands and becomes independent in free association with the United States. Kolonia remains the capital.\n|-\n|4 November||style=text-align:left |The Commonwealth of the Northern Mariana Islands withdraws from the US–administered United Nations Trust Territory of the Pacific Islands and becomes an insular area of the United States. Saipan remains the capital.\n|-\n| rowspan=4|1987 ||1 January||style=text-align:left |New Zealand becomes a fully sovereign state with the promulgation of the Constitution Act, eliminating all remaining powers in the country of the Parliament of the United Kingdom.\n|-\n|22 February||style=text-align:left |The Provisional Military Government of Socialist Ethiopia (Derg) changes its name to the People's Democratic Republic of Ethiopia.\n|-\n|7 October||style=text-align:left |Following a coup, the Dominion of Fiji changes its name to the Republic of Fiji and severs all ties to the British monarchy as a Commonwealth realm. Fiji is deemed to have temporarily left the Commonwealth as a result.\n|-\n|30 November||style=text-align:left |The Democratic Republic of Afghanistan changes its name to the Republic of Afghanistan.\n|-\n| rowspan=4|1988 ||14 March||style=text-align:left |China conquers Johnson South Reef in the Spratly Islands from Vietnam.\n|-\n|16 July||style=text-align:left |Iran withdraws from Iraqi Kurdistan after having been evicted from territory it occupied further south, as Iraq returns to the offensive and once more invades Iran; precipitating a ceasefire in the Iran–Iraq War on 20 August.\n|-\n|18 September||style=text-align:left |The Socialist Republic of the Union of Burma changes its name to the Union of Burma''', with the SLORC junta's suspension of the 1974 Constitution.\n|-\n|15 November||style=text-align:left |The State of Palestine declares independence from Israel, with East Jerusalem as its capital. While its actual control over territory is limited, the declaration is made amidst a popular uprising in the Israeli-occupied territories.\n|-\n| rowspan=9|1989 ||15 February||style=text-align:left |The Soviet Union completely withdraws its forces from Afghanistan, ending a nine-year-long occupation.\n|-\n|1 May||style=text-align:left |The People's Republic of Kampuchea changes its name to the State of Cambodia.\n|-\n|19 June||style=text-align:left |The Union of Burma changes its name to the Union of Myanmar. The official English name of its capital is changed from Rangoon to Yangon.\n|-\n|26&nbsp;September||style=text-align:left |Vietnam completely withdraws its forces from Cambodia, ending a more than ten-year-long occupation.\n|-\n|30 September||style=text-align:left |The Senegambia Confederation between Senegal and The Gambia is dissolved.\n|-\n|23 October||style=text-align:left |The Hungarian People's Republic changes its name to the Hungarian Republic.\n|-\n|3–4 November||style=text-align:left |The Federated States of Micronesia moves its capital from Kolonia to Palikir.\n|-\n|28 December||style=text-align:left |Following the Romanian Revolution, the Socialist Republic of Romania changes its name to Romania.\n|-\n|31 December||style=text-align:left |The Polish People's Republic changes its name to the Republic of Poland.\n|}\n1990s\n{|class=wikitable style=\"width:100%; text-align:center\"\n|-\n!style=\"width:2em\"|Year||style=\"width:4em\"|Date||Event\n|-\n| rowspan=32|1990 ||19 January||style=text-align:left |Armenian forces conquer Karki, an exclave of the Azerbaijan SSR. It remains Azerbaijani territory only de jure.\n|-\n|1 March||style=text-align:left |The People's Republic of Benin changes its name to the Republic of Benin.\n|-\n|8 March||style=text-align:left |The Socialist Republic of Slovenia changes its name to the Republic of Slovenia.\n|-\n| rowspan=2|11 March||style=text-align:left |Following democratic elections, the Lithuanian Soviet Socialist Republic declares independence from the Soviet Union as the restored Republic of Lithuania. Vilnius remains the capital.\n|-\n|style=text-align:left |Chile moves its legislative capital from Santiago to Valparaíso. Santiago remains the administrative capital.\n|-\n|21 March||style=text-align:left |South West Africa gains independence from South Africa as the Republic of Namibia, fulfilling the terms of the Tripartite Accord. Namibia becomes part of the Commonwealth of Nations. Windhoek remains the capital.\n|-\n|30 March||style=text-align:left |Following grassroots elections, the Estonian SSR declares the Soviet rule in Estonia illegal from the moment of establishment and announces a transitional period to restore the independence of the Republic of Estonia from the Soviet Union.\n|-\n|23 April||style=text-align:left |The Czechoslovak Socialist Republic changes its name to the Czech and Slovak Federative Republic.\n|-\n|4 May||style=text-align:left |Following democratic elections, the Latvian Soviet Socialist Republic declares independence from the Soviet Union as the restored Republic of Latvia, while also announcing a transitional period to achieve independence.\n|-\n|8 May||style=text-align:left |The Estonian Soviet Socialist Republic changes its name to the Republic of Estonia.\n|-\n|17 May||style=text-align:left |The Republic of Bougainville declares independence from Papua New Guinea. Arawa becomes the capital.\n|-\n|22 May||style=text-align:left |The Republic of Yemen is formed through the unification of the People's Democratic Republic of Yemen and the Yemen Arab Republic. Aden yields to Sanaa as the capital.\n|-\n|23 June||style=text-align:left |The Moldavian Soviet Socialist Republic changes its name to the Soviet Socialist Republic of Moldova.\n|-\n|25 July||style=text-align:left |The Republic of Fiji changes its name to the Sovereign Democratic Republic of Fiji.\n|-\n|2 August||style=text-align:left |Iraq invades Kuwait, beginning a seven-month-long occupation.\n|-\n|4 August||style=text-align:left |The State of Kuwait changes its name to the Republic of Kuwait as a Provisional Government is installed by Iraq.\n|-\n|19 August||style=text-align:left |The Gagauz Republic is declared as a republic within the Soviet Union separate from the Soviet Socialist Republic of Moldova. Comrat becomes the capital. It remains a de facto independent state following the dissolution of the Soviet Union.\n|-\n|20 August||style=text-align:left |Iraq completely withdraws its forces from the territory of Iran occupied during the last weeks of the Iran–Iraq War, returning to the internationally recognized borders established by the 1975 Algiers Agreement.\n|-\n|23 August||style=text-align:left |The Armenian Soviet Socialist Republic secedes from the Soviet Union as the Republic of Armenia. Yerevan remains the capital.\n|-\n|28 August||style=text-align:left |Iraq annexes the Republic of Kuwait as the Kuwait Governorate and Saddamiyat al-Mitla' District.\n|-\n|2 September||style=text-align:left |The Pridnestrovian Moldavian Soviet Socialist Republic declares independence from the Soviet Socialist Republic of Moldova as a separate republic within the Soviet Union. Tiraspol becomes the capital.\n|-\n|20 September||style=text-align:left |The South Ossetian Autonomous Oblast changes its name to the South Ossetian Soviet Democratic Republic and declares its independence from the Georgian SSR inside the Soviet Union. Tskhinvali becomes the capital.\n|-\n|24 September||style=text-align:left |East Germany leaves the Warsaw Pact in preparation for German reunification, with Soviet consent.\n|-\n|28 September||style=text-align:left |The Socialist Republic of Serbia changes its name to the Republic of Serbia.\n|-\n|3 October||style=text-align:left |Germany is reunified through the merger of the German Democratic Republic into the Federal Republic of Germany. Bonn yields to Berlin as the capital.\n|-\n|30 October||style=text-align:left |The Kirghiz Soviet Socialist Republic changes its name to the Socialist Republic of Kyrgyzstan.\n|-\n|15 November||style=text-align:left |The People's Republic of Bulgaria changes its name to the Republic of Bulgaria.\n|-\n|18 November||style=text-align:left |The Georgian Soviet Socialist Republic changes its name to the Republic of Georgia.\n|-\n|28 November||style=text-align:left |The South Ossetian Soviet Democratic Republic changes its name to the South Ossetian Soviet Republic.\n|-\n|30 November||style=text-align:left |The People's Republic of Mozambique changes its name to the Republic of Mozambique.\n|-\n|15 December||style=text-align:left |The Socialist Republic of Kyrgyzstan changes its name to the Republic of Kyrgyzstan.\n|-\n|22 December||style=text-align:left |The Socialist Republic of Croatia changes its name to the Republic of Croatia.\n|-\n| rowspan=52|1991 ||13 January||style=text-align:left |The forces of the Soviet Union withdraw from Lithuania's cities following a failed attempt to overthrow the unrecognized Republic of Lithuania.\n|-\n| rowspan=2|5 February||style=text-align:left |The Azerbaijan Soviet Socialist Republic changes its name to the Republic of Azerbaijan.\n|-\n|style=text-align:left |The Republic of Kyrgyzstan changes the name of its capital from Frunze to Bishkek.\n|-\n|11 February||style=text-align:left |Iceland becomes the first UN member state to recognize the independence of a Republic of the Soviet Union, Lithuania, when its parliament votes that the 1940 Soviet annexation is legally void. Other states soon follow.\n|-\n|28 February||style=text-align:left |Kuwait regains its independence, with the complete withdrawal of Iraqi forces.\n|-\n|15 March||style=text-align:left |Germany becomes fully sovereign, as the Four Powers (France, the Soviet Union, United Kingdom, and United States) renounce their rights in the country dating from the post-war occupation in the Two Plus Four Agreement.\n|-\n|9 April||style=text-align:left |The Republic of Georgia secedes from the Soviet Union following a referendum. Tbilisi remains the capital.\n|-\n|29 April||style=text-align:left |The People's Socialist Republic of Albania changes its name to the Republic of Albania.\n|-\n|1 May||style=text-align:left | The Republic of China terminates the state of rebellion and war with the '''People's Republic of China; the constitution is restored, with amendments, demarcates the territory between the \"Free Area\" and the \"Mainland Area\", in which the ROC government recognized the Communist control of the latter without official diplomatic relations.\n|-\n|4 May||style=text-align:left |The Assembly of the South Ossetian Soviet Republic votes to return to the status of a South Ossetian Autonomous Oblast; the Supreme Council of Georgia had dissolved the autonomous region on 10 December.\n|-\n|18 May||style=text-align:left |The Republic of Somaliland declares independence from Somalia. Hargeisa becomes the capital. All other countries continue to officially recognize Somaliland as part of Somalia.\n|-\n|23 May||style=text-align:left |The Soviet Socialist Republic of Moldova changes its name to the Republic of Moldova.\n|-\n|24 May||style=text-align:left |The State of Eritrea' gains de facto'' independence from the People's Democratic Republic of Ethiopia following a decades-long War of Independence.\n|-\n|7 June||style=text-align:left |The Socialist Republic of Macedonia changes its name to the Republic of Macedonia.\n|-\n|19 June||style=text-align:left |The Soviet Union completely withdraws its forces from Hungary, ending an occupation begun in 1944.\n|-\n| rowspan=2|25 June||style=text-align:left |The Republic of Slovenia secedes from Yugoslavia. Ljubljana remains the capital.\n|-\n|style=text-align:left |The Republic of Croatia secedes from Yugoslavia. Zagreb remains the capital.\n|-\n|27 June||style=text-align:left |The Soviet Union completely withdraws its forces from Czechoslovakia, ending an occupation begun in 1968\n|-\n|4 July||style=text-align:left |Colombia changes the name of its capital from Bogotá, Distrito Capital to Santa Fe de Bogotá with the promulgation of a new constitution.\n|-\n|21 July||style=text-align:left |The Somali Republic supersedes the Somali Democratic Republic, as rebel factions agree to restore the Constitution of 1960. Mogadishu remains the capital, though its authority is limited amidst ongoing civil war.\n|-\n|22 July||style=text-align:left |Following the victory of the EPRDF in the civil war, Ethiopia supersedes the People's Democratic Republic of Ethiopia. Addis Ababa remains the capital.\n|-\n|2 August||style=text-align:left |The Socialist Republic of Montenegro changes its name to the Republic of Montenegro.\n|-\n|20 August||style=text-align:left |In response to the Soviet coup d'état attempt, the Republic of Estonia announces the end of the transitional period and declares complete independence restored from the Soviet Union. Tallinn remains the capital.\n|-\n|21 August||style=text-align:left |In response to the Soviet coup d'état attempt, the Republic of Latvia announces the end of the transitional period and declares complete independence restored from the Soviet Union. Riga remains the capital.\n|-\n|24 August||style=text-align:left |The Ukrainian Soviet Socialist Republic secedes from the Soviet Union as Ukraine. Kiev (renamed Kyiv in 1995) remains the capital.\n|-\n|25 August||style=text-align:left |The Byelorussian Soviet Socialist Republic secedes from the Soviet Union. Minsk remains the capital.\n|-\n|27 August||style=text-align:left |The Republic of Moldova secedes from the Soviet Union. Chişinău remains the capital.\n|-\n|30 August||style=text-align:left |The Republic of Azerbaijan secedes from the Soviet Union. Baku remains the capital.\n|-\n| rowspan=3|31 August||style=text-align:left |The Republic of Kyrgyzstan secedes from the Soviet Union. Bishkek remains the capital.\n|-\n|style=text-align:left |The Uzbek Soviet Socialist Republic secedes from the Soviet Union as the Republic of Uzbekistan. Tashkent remains the capital.\n|-\n|style=text-align:left |The Tajik Soviet Socialist Republic changes its name to the Republic of Tajikistan.\n|-\n|1 September||style=text-align:left |The South Ossetian Autonomous Oblast changes its name to the Republic of South Ossetia and annuls the law of 4 May, reverting to the status of independence from Georgia within the Soviet Union.\n|-\n|2 September||style=text-align:left |The Nagorno-Karabakh Autonomous Oblast and Shahumyan district councils jointly declare independence from Azerbaijan as the Nagorno-Karabakh Republic within the Soviet Union. Stepanakert becomes the capital.\n|-\n| rowspan=2|6 September||style=text-align:left |The first meeting of the State Council of the Soviet Union recognizes the independence of Estonia, Latvia and Lithuania.\n|-\n|style=text-align:left |A ceasefire is imposed in the war in Western Sahara, with Morocco controlling 80% of the territory within a defensive wall and the Sahrawi Arab Democratic Republic governing the remaining Free Zone from Tifariti.\n|-\n|8 September||style=text-align:left |The Republic of Macedonia secedes from Yugoslavia. Skopje remains the capital.\n|-\n|9 September||style=text-align:left |The Republic of Tajikistan secedes from the Soviet Union. Dushanbe remains the capital.\n|-\n|19 September||style=text-align:left |The Byelorussian Soviet Socialist Republic changes its name to the Republic of Belarus.\n|-\n|23 September||style=text-align:left |Following a referendum, the Republic of Armenia reaffirms its August 1990 declaration of independence from the Soviet Union.\n|-\n|27 October||style=text-align:left |The Turkmen Soviet Socialist Republic secedes from the Soviet Union as Turkmenistan. Ashgabat remains the capital.\n|-\n|1 November||style=text-align:left |The Chechen Republic declares independence from the Soviet Union after elections. Grozny becomes the capital. The Russian SFSR declares the election illegal the next day.\n|-\n|5 November||style=text-align:left |The Pridnestrovian Moldavian Soviet Socialist Republic changes its name to the Pridnestrovian Moldavian Republic (Transnistria).\n|-\n|2 December||style=text-align:left |The Russian SFSR recognizes the independence of Ukraine the day after it is affirmed by a referendum.\n|-\n|8 December||style=text-align:left |The Russian SFSR, the Republic of Belarus, and Ukraine form the Commonwealth of Independent States as a successor organization to the Soviet Union.\n|-\n|10 December||style=text-align:left |The Kazakh Soviet Socialist Republic changes its name to the Republic of Kazakhstan.\n|-\n| rowspan=2|12 December||style=text-align:left |Nigeria moves its capital from Lagos to Abuja.\n|-\n|style=text-align:left |The Russian SFSR declares independence from the Soviet Union as part of the Belovezha Accords. Moscow remains the capital.\n|-\n|16 December||style=text-align:left |The Republic of Kazakhstan secedes from the Soviet Union. Alma-Ata remains the capital until 1997.\n|-\n|19 December||style=text-align:left |The Serbian Autonomous Oblast of Krajina declares its independence from Croatia and loyalty to Yugoslavia as the Republic of Serbian Krajina. Knin becomes the capital.\n|-\n|21 December||style=text-align:left |The Republic of South Ossetia declares independence from the Soviet Union. Tskhinvali remains the capital. Georgia continues to claim South Ossetia as part of its own territory.\n|-\n|25 December||style=text-align:left |The Russian Federation supersedes both the Soviet Union and the Russian Soviet Federative Socialist Republic. Moscow remains the capital.\n|-\n|26 December||style=text-align:left |The Soviet Union is formally dissolved at the final meeting of the Soviet of the Republics of the Supreme Soviet.\n|-\n| rowspan=26|1992 || rowspan=2|6 January||style=text-align:left |The Nagorno-Karabakh Republic declares its complete independence following a referendum. Azerbaijan, which abolished the Nagorno-Karabakh Autonomous Oblast on 26 November, continues to claim its territory in full.\n|-\n|style=text-align:left |The Iraqi Republic changes its name to the Republic of Iraq.\n|-\n|12 February||style=text-align:left |The Mongolian People's Republic changes its name to Mongolia upon the promulgation of a new constitution.\n|-\n|26 February||style=text-align:left |The Serbian Autonomous Oblast of Eastern Slavonia, Baranja and Western Syrmia and the Serbian Autonomous Oblast of Western Slavonia join the Republic of Serbian Krajina.\n|-\n|3 March||style=text-align:left |Following an independence referendum, the Socialist Republic of Bosnia and Herzegovina secedes from the Socialist Federal Republic of Yugoslavia. Sarajevo remains the capital.\n|-\n| rowspan=2|12 March||style=text-align:left |Mauritius changes its name to the Republic of Mauritius and severs all ties to the British monarchy as a Commonwealth realm, but remains part of the Commonwealth of Nations.\n|-\n|style=text-align:left |The Chechen Republic changes its name to the Chechen Republic of Ichkeria upon the promulgation of a new constitution.\n|-\n| rowspan=2|15 March||style=text-align:left |The State of Cambodia cedes all government powers to the United Nations Transitional Authority in Cambodia tasked with organizing constituent assembly elections, in fulfillment of the 1991 Paris Peace Agreements.\n|-\n|style=text-align:left |The People's Republic of the Congo changes its name to the Republic of the Congo following the promulgation of a new constitution by referendum.\n|-\n|7 April||style=text-align:left |The Serbian Republic of Bosnia and Herzegovina declares independence from the Socialist Republic of Bosnia and Herzegovina. Pale becomes the capital.\n|-\n|8 April||style=text-align:left |The Socialist Republic of Bosnia and Herzegovina changes its name to the Republic of Bosnia and Herzegovina.\n|-\n|24 April||style=text-align:left |An accord between the Mujahideen and Afghan Army factions ends the civil war and creates the Islamic State of Afghanistan, superseding the Republic of Afghanistan. The new state immediately plunges into a new civil war.\n|-\n| rowspan=2|27 April||style=text-align:left |The Federal Republic of Yugoslavia supersedes the Socialist Federal Republic of Yugoslavia. Belgrade remains the capital.\n|-\n|style=text-align:left |Armenia conquers Barxudarlı and Sofulu, two exclaves of Azerbaijan. They remain Azerbaijani territory only de jure.\n|-\n|15 May||style=text-align:left |The Collective Security Treaty is signed by six Post-Soviet states - Russia, Armenia, Kazakhstan, Kyrgyzstan, Tajikistan, and Uzbekistan.\n|-\n|8 June||style=text-align:left |Armenia conquers Yukhari Askipara, an exclave of Azerbaijan. It remains Azerbaijani territory only de jure.\n|-\n|24 June||style=text-align:left |A ceasefire is imposed in the war between the unrecognized Republic of South Ossetia and Georgia, with Georgia losing control of over 60% of the former South Ossetian Autonomous Oblast which it continues to claim in full.\n|-\n|21 July||style=text-align:left |A ceasefire is imposed in the war between the unrecognized Transnistria and Moldova, with Moldova losing control of Bender and most of the left bank of the Dniester both of which it continues to claim in full.\n|-\n|23 July||style=text-align:left |The Abkhaz faction of the Abkhazia Supreme Soviet effectively declares independence from Georgia by reinstating the 1925 constitution, precipitating a Georgian military response and the outbreak of war.\n|-\n|8 August||style=text-align:left |Azerbaijan conquers Artsvashen, an exclave of Armenia. It remains Armenian territory only de jure.\n|-\n|12 August||style=text-align:left |The Serbian Republic of Bosnia and Herzegovina changes its name to Republika Srpska.\n|-\n|27 August||style=text-align:left |The People's Republic of Angola changes its name to the Republic of Angola with the enactment of constitutional revisions.\n|-\n|15 September||style=text-align:left |Russia completely withdraws its forces from Mongolia, ending its military presence in the country since 1967.\n|-\n|18 September||style=text-align:left |The Democratic Republic of Madagascar changes its name to the Republic of Madagascar upon the promulgation of a new constitution.\n|-\n|22 September||style=text-align:left |The Republic of Kosova declares independence from Yugoslavia, though it only ever exercises partial control over most of the territory it claims and receives no international recognition. Pristina is the declared capital.\n|-\n|1 October||style=text-align:left |Oman and Yemen resolve their border dispute, in particular over the Khuriya Muriya Islands which are confirmed as part of the territory of Oman.\n|-\n| rowspan=14|1993 || ||style=text-align:left |Azerbaijan, Belarus, and Georgia join the Collective Security Treaty.\n|-\n|1 January||style=text-align:left |The Czech Republic and the Slovak Republic gain full independence with the dissolution of the Czech and Slovak Federative Republic. Prague and Bratislava remain the respective capitals.\n|-\n|28 January||style=text-align:left |Kazakhstan changes the name of its capital from Alma-Ata to Almaty.\n|-\n|13 February||style=text-align:left |Papua New Guinea reconquers Arawa, the capital of the Republic of Bougainville. The Bougainville Revolutionary Army wages an insurgency until the 1997–98 agreements leading to a 2019 independence referendum.\n|-\n|8 April||style=text-align:left |The Republic of Macedonia becomes a member state of the United Nations as \"the former Yugoslav Republic of Macedonia (FYROM)\" due to Greece's objection to its official name.\n|-\n|5 May||style=text-align:left |The Republic of Kyrgyzstan changes its name to the Kyrgyz Republic.\n|-\n|24 May||style=text-align:left |The independence of Eritrea is internationally recognized following a referendum. Asmara remains the capital.\n|-\n|23 June||style=text-align:left |The Republic of the Seychelles changes its name to the Republic of Seychelles.\n|-\n|28 August||style=text-align:left |The Croatian Community of Herzeg-Bosnia declares itself the Croatian Republic of Herzeg-Bosnia with the intention of forcing the Owen–Stoltenberg plan upon Bosnia and Herzegovina. Mostar becomes the capital.\n|-\n|18 September||style=text-align:left |Russia completely withdraws its forces from Poland, ending its military presence in the country since World War II.\n|-\n|24 September||style=text-align:left |With the promulgation of a new constitution by the Constituent Assembly elected in May, the United Nations Transitional Authority in Cambodia cedes its authority to the restored Kingdom of Cambodia.\n|-\n|rowspan=2 |27 September||style=text-align:left |The forces of Russia and the unrecognized Republic of Abkhazia conquer the Abkhazian capital of Sukhumi from Georgia, which continues to claim the entire territory of the Autonomous Republic of Abkhazia.\n|-\n|style=text-align:left |The secessionist Autonomous Province of Western Bosnia is established with the support of Serbian and Croatian forces believed to be intent on the partition of Bosnia and Herzegovina. Velika Kladuša is the capital.\n|-\n|1 November||style=text-align:left |The European Union is established between the twelve members of the European Communities: Belgium, Denmark, France, Germany, Greece, Ireland, Italy, Luxembourg, Netherlands, Portugal, Spain, and the United Kingdom.\n|-\n| rowspan=15|1994 ||1 March||style=text-align:left |South Africa transfers Walvis Bay and the Penguin Islands to Namibia.\n|-\n|28 March||style=text-align:left |Kazakhstan leases Baikonur Cosmodrome to Russia for twenty years, with automatic extension absent objections by either party.\n|-\n|30 March||style=text-align:left |In a ceasefire agreement, the government-controlled territories of the Republic of Bosnia and Herzegovina and the Croatian Republic of Herzeg-Bosnia combine to form the Federation of Bosnia and Herzegovina.\n|-\n|2 April||style=text-align:left |The Collective Security Treaty takes effect, creating the Collective Security Treaty Organization military alliance.\n|-\n|27 April||style=text-align:left |The nominally independent republics of Bophuthatswana, Ciskei, Transkei and Venda are reincorporated back into South Africa.\n|-\n|4 May||style=text-align:left |An agreement between Israel and the Palestine Liberation Organization, implementing the Oslo I Accord, creates the Palestinian National Authority.\n|-\n|10 May||style=text-align:left |Libya completely withdraws its forces from the Aouzou Strip in northern Chad after a 21-year occupation, implementing a 3 February ICJ verdict which upheld Chad's sovereignty over the territory.\n|-\n|12 May||style=text-align:left |A ceasefire is imposed in the First Nagorno-Karabakh War with the forces of the unrecognized Nagorno-Karabakh Republic, supported by Armenia, occupying more than 13% of the internationally recognized territory of Azerbaijan.\n|-\n|21 May||style=text-align:left |The Democratic Republic of Yemen secedes from Yemen. Aden is the capital.\n|-\n|7 July||style=text-align:left |Yemeni government forces reconquer the Democratic Republic of Yemen.\n|-\n|31 August||style=text-align:left |Russia completely withdraws its forces from eastern Germany, ending an occupation begun in 1945.\n|-\n|1 October||style=text-align:left |The Republic of Palau gains full independence but enters into free association with the United States. Koror remains the capital. The US-administered United Nations Trust Territory of the Pacific Islands is terminated.\n|-\n|21 October||style=text-align:left |Argentina is awarded almost all of Laguna del Desierto surrounding territory, also claimed by Chile, following international arbitration.\n|-\n|3 November||style=text-align:left |The Taliban conquers Kandahar, the first city to fall under the control of the militant group in Afghanistan.\n|-\n|10 November||style=text-align:left |Iraq recognizes the independence and territorial integrity of Kuwait following a new war scare on their borders.\n|-\n| rowspan=15|1995 || rowspan=2|1 January||style=text-align:left |Three more states join the European Union: Austria, Finland, and Sweden.\n|-\n|style=text-align:left |The International Date Line is moved around Kiribati.\n|-\n|14 January||style=text-align:left |The self-proclaimed Gagauz Republic is reintegrated into Moldova as the Autonomous Territorial Unit of Gagauzia.\n|-\n|3 May||style=text-align:left |Croatian forces reconquer the Western Slavonia region of Serbian Krajina.\n|-\n|1 July||style=text-align:left |Oman and Saudi Arabia finalize the demarcation of their previously undefined border.\n|-\n|26 July||style=text-align:left |The Autonomous Province of Western Bosnia changes its name to the Republic of Western Bosnia.\n|-\n|28 July||style=text-align:left |Vietnam joins ASEAN as the association's seventh member state.\n|-\n| rowspan=2|7 August||style=text-align:left |Croatian and Bosnian forces reconquer most of Serbian Krajina.\n|-\n|style=text-align:left |The Republic of Western Bosnia is conquered by the forces of Bosnia and Herzegovina supported by Croatia.\n|-\n|21 August||style=text-align:left |Ethiopia changes its name to the Federal Democratic Republic of Ethiopia with the promulgation of a new constitution.\n|-\n|24 August||style=text-align:left |The Republic of Georgia changes its name to Georgia.\n|-\n|28 September|| style=\"text-align:left\" |The Oslo II Accord begins the transfer of land to the Palestinian Authority. All of the Gaza Strip and 18% of the West Bank is eventually transferred to full Palestinian control, and 22% to joint Israeli-Palestinian control.\n|-\n|14 October||style=text-align:left |Ukraine officially changes the English name of its capital from Kiev to Kyiv.\n|-\n|12 November||style=text-align:left |Croatia and the remaining portion of Serbian Krajina in Eastern Slavonia, Baranja and Western Syrmia reach an agreement to reincorporate the region into Croatia through a transitional United Nations protectorate.\n|-\n|14 December||style=text-align:left |The Federation of Bosnia and Herzegovina and Republika Srpska unite to form Bosnia and Herzegovina, superseding the Republic of Bosnia and Herzegovina. Sarajevo remains the capital.\n|-\n| rowspan=4|1996 ||15 January||style=text-align:left |The United Nations Transitional Administration for Eastern Slavonia, Baranja and Western Sirmium is established in the remaining territory of the former Serbian Krajina in order to reintegrate the region into Croatia.\n|-\n|February||style=text-align:left |Tanzania moves its capital from Dar es Salaam to Dodoma.\n|-\n|rowspan=2 |27 September||style=text-align:left |The Islamic Emirate of Afghanistan is established following the Taliban's conquest of Kabul, which becomes the state capital.\n|-\n|style=text-align:left |The Islamic State of Afghanistan moves its de facto capital to Mazar-i-Sharif following the evacuation of Kabul.\n|-\n| rowspan=11|1997 ||23 January||style=text-align:left |The Chechen Republic of Ichkeria changes the name of its capital from Grozny to Dzokhar-Ghala.\n|-\n|17 May||style=text-align:left |The Republic of Zaire changes its name back to the Democratic Republic of the Congo.\n|-\n|25 May||style=text-align:left |The Islamic State of Afghanistan moves its capital from Mazar-i-Sharif to Taloqan, as Mazar-i-Sharif becomes a battlefield in the war against the Taliban.\n|-\n|28 May||style=text-align:left |Ukraine formally agrees to lease naval facilities in Sevastopol to Russia for twenty years, until 2017.\n|-\n|1 July||style=text-align:left |Sovereignty over Hong Kong is transferred to China from the United Kingdom. Hong Kong becomes a special administrative region.\n|-\n|4 July||style=text-align:left |The Independent State of Western Samoa changes its name to the Independent State of Samoa.\n|-\n|23 July||style=text-align:left |Laos and Myanmar join ASEAN as the association's eighth and ninth member states.\n|-\n|27 July||style=text-align:left |The Sovereign Democratic Republic of Fiji changes its name to the Republic of the Fiji Islands upon the promulgation of a new constitution. Fiji returns to its membership of the Commonwealth of Nations as a result.\n|-\n|3 August||style=text-align:left |The State of Anjouan declares independence from the Comoros. Mutsamudu becomes the capital.\n|-\n|11 August||style=text-align:left |The Democratic Republic of Mohéli declares independence from the Comoros. Fomboni becomes the capital.\n|-\n|10 December||style=text-align:left |Kazakhstan moves its capital from Almaty to Aqmola.\n|-\n| rowspan=6|1998 ||15 January||style=text-align:left |The United Nations Transitional Administration for Eastern Slavonia, Baranja and Western Sirmium concludes its operations and transfers full administrative authority over the region to Croatia.\n|-\n|6 May||style=text-align:left |Kazakhstan changes the name of its capital from Aqmola to Astana.\n|-\n|(Unknown)||style=text-align:left |Comoros reabsorbs the de facto independent Democratic Republic of Mohéli. Fomboni yields to Moroni as the capital.\n|-\n|4 July||style=text-align:left |China is allocated 407&nbsp;km2 and Kazakhstan is allocated 537&nbsp;km2 of disputed territory in a treaty delimiting the border between the two countries.\n|-\n|1 August||style=text-align:left |The Puntland State of Somalia declares \"temporary\" independence from Somalia. Garowe becomes the capital.\n|-\n|16 December||style=text-align:left |Argentina and Chile redraw part of the border in the Southern Patagonian Ice Field, and establish a pending of definition area between Mount Fitz Roy and Cerro Murallón.\n|-\n| rowspan=\"13\" |1999\n|5 March||style=text-align:left |Self-governing Brčko District in Bosnia and Herzegovina is established.\n|-\n|12 March||style=text-align:left |The Czech Republic, Hungary, and Poland join the North Atlantic Treaty Organization in the alliance's fourth enlargement.\n|-\n|19 March|| style=\"text-align:left\" |France elevates the Overseas Territory of New Caledonia to the 'sui generis collectivity of New Caledonia.\n|-\n|2 April||style=text-align:left |Azerbaijan, Georgia, and Uzbekistan leave the Collective Security Treaty Organization. The remaining six members renew the treaty for another 5 years.\n|-\n|30 April||style=text-align:left |Cambodia joins ASEAN' as the association's tenth member state.\n|-\n|10 June||style=text-align:left |The United Nations Interim Administration Mission in Kosovo is formed in the Autonomous Province of Kosovo and Metohija of Yugoslavia.\n|-\n|20 June||style=text-align:left |The last forces of Yugoslavia withdraw from Kosovo.\n|-\n|23 June||style=text-align:left |Belgium and The Netherlands make a small change to the border at the Ghent–Terneuzen Canal.\n|-\n|25 October||style=text-align:left |Indonesia relinquishes control over the disputed region of East Timor to the United Nations Transitional Administration in East Timor.\n|-\n|rowspan=2 |20 December||style=text-align:left |The Republic of Venezuela changes its name to the Bolivarian Republic of Venezuela.\n|-\n|style=text-align:left |Sovereignty over Macau is transferred to China from Portugal. Macau becomes a special administrative region.\n|-\n|30 December||style=text-align:left |China and Vietnam sign a treaty resolving their border dispute, with China acquiring 114&nbsp;km2 and Vietnam acquiring 113&nbsp;km2 of disputed territory.\n|-\n|31 December||style=text-align:left |The United States transfers the operation of the Panama Canal and full sovereignty in the former Panama Canal Zone to Panama.\n|}\nSee also\n*\n*\n*\n*\n*\n*\n*\n**\n**\n**\n**\n*\n*\nNotes\nReferences\nBibliography\n*"
    }
  ]
}