{
  "content": [
    {
      "type": "text",
      "text": "# Timeline of second-wave feminism\n\nThis is a Timeline of second-wave feminism, from its beginning in the mid-twentieth century, to the start of Third-wave feminism in the early 1990s.\nTimeline\n1960s\n1960\n* Enovid was approved for sale in the United States 9 May 1960 as a contraceptive pill by the Food and Drug Administration. (It had been approved three years earlier for menstrual symptoms.) Within three years, 2.3 million women are using \"The Pill\", as it became known, in the United States.  The arrival of the pill ushered in and coincided with the second wave of feminism.\n1961\n* The [American] Presidential Commission on the Status of Women was created; its report found discrimination against women in every aspect of American life and outlined plans to achieve equality. Specific recommendations for women in the workplace included fair hiring practices, paid maternity leave, and affordable childcare.\n1962\n* The non-fiction book Sex and the Single Girl was released in the U.S. and sold two million copies in three weeks. Author Helen Gurley Brown encouraged women to become financially independent, and to become sexually active before marriage.\n1963\n, author of The Feminine Mystique]]\n*Twenty years after it was first proposed, the Equal Pay Act became law in the U.S., and it established equality of pay for men and women performing equal work. However, it did not originally cover executives, administrators, outside salespeople, or professionals. In 1972, Congress enacted the Education Amendments of 1972, which (among other things) amended the Fair Labor Standards Act to expand the coverage of the Equal Pay Act to these employees, by excluding the Equal Pay Act from the professional workers exemption of the Fair Labor Standards Act.\n* Betty Friedan's The Feminine Mystique was published, became a best-seller, and laid the groundwork for the second-wave feminist movement in the U.S.\n* Alice S. Rossi presented \"Equality Between the Sexes: An Immodest Proposal\" at the American Academy of Arts and Sciences conference.\n* Gloria Steinem went undercover as a Playboy bunny in a New York Playboy Club, and published the exposé \"A Bunny's Tale\" in Show magazine in two installments in May and June, 1963.\n1964\n* Title VII of the Civil Rights Act of 1964 became law in the U.S., and it barred employment discrimination on account of sex, race, etc. by private employers, employment agencies, and unions. However, the Bennett Amendment, a US labor law provision in Title VII of the Civil Rights Act of 1964, §703(h) was passed to limit sex discrimination claims regarding pay to the rules in the Equal Pay Act of 1963. It says an employer can \"differentiate upon the basis of sex\" when it compensates employees \"if such differentiation is authorized by\" the Equal Pay Act.\n* The U.S. Equal Employment Opportunity Commission was established via the Civil Rights Act of 1964; in its first five years, 50,000 complaints of gender discrimination were received.\n1965\n]]\n* Casey Hayden and Mary King published \"Sex and Caste: A Kind of Memo\", detailing women's inequality within the civil rights organization SNCC.\n* The U.S. Supreme Court case Griswold v. Connecticut struck down the only remaining state law banning the use of contraceptives by married couples.\n* The \"Woman Question\" was raised for the first time at a Students for a Democratic Society (SDS) conference.\n* EEOC commissioners were appointed to enforce the Civil Rights Act. Among them there was only one woman, Aileen Hernandez, a future president of the National Organization for Women.\n* The term \"sexism\" was most likely coined November 18, 1965, in a report by Pauline M. Leet during the \"Student-Faculty Forum\" at Franklin and Marshall College.\n1966\n* Twenty-eight women, among them Betty Friedan, founded the National Organization for Women (NOW) to function as a civil rights organization for women. Betty Friedan became its first president. The group is now one of the largest women's groups in the U.S. and pursues its goals through extensive legislative lobbying, litigation, and public demonstrations.\n* Barbara Jordan was elected to the Texas Senate. She was the first African-American woman in the Texas legislature.\n* Flight attendants filed Title VII complaints about being forced to quit when they married, got pregnant or reached age 35.\n1967\n* Due to the Abortion Act 1967, abortion in Britain was made legal under certain criteria and with medical supervision.\n* In 1967, \"The Discontent of Women\", by Joke Kool-Smits, was published; the publication of this essay is often regarded as the start of second-wave feminism in the Netherlands.\n* American feminist Valerie Solanas wrote and published SCUM Manifesto.\n* Executive Order 11375 expanded President Johnson's 1965 affirmative action policy to cover discrimination based on sex, resulting in federal agencies and contractors taking active measures to ensure that all women as well as minorities have access to educational and employment opportunities equal to white males.\n* Women's liberation groups sprang up all over America.\n* The pill made the cover of TIME magazine.\n* NOW began petitioning the EEOC to end sex-segregated want ads and adopted a Bill of Rights for Women.\n* Senator Eugene McCarthy introduced the Equal Rights Amendment in the U.S. Senate.\n* Seattle Radical Women, a socialist feminist organization, formed in November by a combination of New Left and Old Left women.\n* New York Radical Women was formed by Shulamith Firestone and Pam Allen.\n* Anne Koedt organized American \"consciousness raising\" groups.\n* The [American] National Welfare Rights Organization was formed.\n1968\n* Robin Morgan led members of New York Radical Women to protest the Miss America Pageant of 1968, which they decried as sexist and racist.\n* The first American national gathering of women's liberation activists was held in Lake Villa, a suburb of Chicago, Illinois.\n* The EEOC issued revised guidelines on sex discrimination, making it clear that the widespread practice of publishing \"help wanted\" advertisements that use \"male\" and \"female\" column headings violates Title VII.\n* New York feminists buried a dummy of \"Traditional Womanhood\" at the all-women's Jeannette Rankin Brigade demonstration against the Vietnam War in Washington, D.C.\n* For the first time, feminists used the slogan \"Sisterhood is Powerful\".\n* The first public speakout against abortion laws was held in New York City.\n* Notes from the First Year, a women's liberation theoretical journal, was published by New York Radical Women.\n* NOW celebrated Mother's Day with the slogan \"Rights, Not Roses\".\n* Mary Daly, professor of theology at Boston College, published a scathing criticism of the Catholic Church's view and treatment of women entitled \"The Church and the Second Sex\".\n* 850 sewing machinists at Ford in Dagenham, which is in Britain, went on strike for equal pay and against sex discrimination. This ultimately led to the passing of the Equal Pay Act 1970, the first legislation in the United Kingdom aimed at ending pay discrimination between men and women.\n* The term \"second-wave feminism\" itself was brought into common parlance by journalist Martha Lear in a New York Times Magazine article in March 1968 titled \"The Second Feminist Wave: What do These Women Want?\" She wrote, \"Proponents call it the Second Feminist Wave, the first having ebbed after the glorious victory of suffrage and disappeared, finally, into the great sandbar of Togetherness.\"\n1969\n* The case Weeks v. Southern Bell marked a major triumph in the fight against restrictive labor laws and company regulations on the hours and conditions of women's work in the U.S., opening many previously male-only jobs to women.\n* The American radical organization Redstockings organized.\n* Members of Redstockings disrupted a hearing on abortion laws of the New York Legislature when the panel of witnesses turned out to be 14 men and a nun. The group demanded repeal, not reform, of laws restricting abortion.\n* NARAL Pro-Choice America, then called The National Association for the Repeal of Abortion Laws (NARAL), was founded.\n* California adopted a \"no fault\" divorce law, allowing couples to divorce by mutual consent. It was the first state to do so; by 2010 every state had adopted a similar law. Legislation was also passed regarding equal division of common property.\n1970s\n's 1970 book Sexual Politics]]\n&nbsp;\n, author of Sisterhood is Powerful]]\n&nbsp;\nof New York in the 1970s]]\n&nbsp;\nfrom The Carol Burnett Show]]\n1970\n* American feminist Kate Millett published her book, Sexual Politics.\n* Australian feminist Germaine Greer published her book, The Female Eunuch.\n* In Schultz v. Wheaton Glass Co., a U.S. Court of Appeals ruled jobs held by men and women must be \"substantially equal\" but not \"identical\" to fall under the protection of the Equal Pay Act, and that it is therefore illegal for employers to change the job titles of women workers in order to pay them less than men.\n* ''Sisterhood Is Powerful, An Anthology of Writings from the Women's Liberation Movement'' edited by the American feminist Robin Morgan, is published.\n* The American women's health book Our Bodies was first published as a newsprint booklet for 35 cents.\n* The Canadian parliament's Royal Commission on the Status of Women (established 1967) produced its report, leading to the establishment of the National Action Committee on the Status of Women.\n* A ''Ladies' Home Journal'' sit-in protested \"women's magazines\" as sexist.\n* The North American Indian Women's Association was founded.\n* Chicana feminists founded Comisión Femenil Mexicana Nacional.\n* In Italy, Rivolta Femminile (\"Women's Revolt\") formed and published a manifesto.\n* American feminist Toni Cade Bambara published The Black Woman.\n* On August 26, 1970, the 50th anniversary of woman suffrage in the U.S., tens of thousands of women across the nation participated in the Women's Strike for Equality, organized by Betty Friedan and thought up by Betty Jameson Armistead to demand equal rights.\n* Feminist leader Bella Abzug was elected to the U.S. Congress, famously declaring \"A woman's place is in the House\".\n* President Richard Nixon vetoed the Comprehensive Child Development Act, which would have established federally funded childcare centers throughout the U.S.\n* The AFL–CIO met to discuss the status of women in unions. It endorsed the Equal Rights Amendment and opposed state protective legislation.\n* The Lutheran Church in America and the American Lutheran Church allowed women to be ordained.\n* The U.S. Congress enacted Title X of the Public Health Service Act, the only American federal program—then and now—devoted solely to the provision of family planning services nationwide.\n* The first national meeting of the women's liberation movement in Britain took place at Ruskin College.\n* Coretta Scott King expanded the Civil Rights Movement platform to include women's rights following the death of her husband, Martin Luther King Jr. She previously served as a Women Strike for Peace delegate to the World Disarmament Conference in 1962.\n* The Equal Pay Act 1970 became law in the United Kingdom, although it did not take effect until 1975.\n* The Miss World contest in London was disrupted by feminist protesters armed with flour bombs, stink bombs, and water pistols.\n* The Red Stocking Movement () in Denmark was established in 1970 and was active until the mid-1980s. Inspired by the Redstockings founded in 1969 in New York City, it brought together left-wing feminists who fought for the same rights as men in terms of equal pay but it also addressed treatment of women in the workplace as well as in the family.\n1971\n* Refuge was founded in 1971 in Chiswick, West London, as the modern world's first safe house for women and children escaping domestic violence.\n* Switzerland allowed women to vote in national elections. However, some cantons did not allow women to vote in local elections until 1994.\n* Jane O'Reilly's article \"The Housewife's Moment of Truth\" was published in the first edition of Ms. Magazine, which appeared as an insert to New York Magazine. The O'Reilly article introduced the idea of \"Click!\", which O'Reilly described as the following: \"The women in the group looked at her, looked at each other, and ... click! A moment of truth. The shock of recognition. Instant sisterhood... Those clicks are coming faster and faster. They were nearly audible last summer, which was a very angry summer for American women. Not redneck-angry from screaming because we are so frustrated and unfulfilled-angry, but clicking-things-into-place-angry, because we have suddenly and shockingly perceived the basic disorder in what has been believed to be the natural order of things.\"\n* Linda Nochlin's essay \"Why Have There Been No Great Women Artists?\" was published in ARTnews. This essay is largely considered a pioneering text of the feminist art history movement.\n* The first women's liberation march in London occurred.\n* In the U.S. Supreme Court Case Reed v Reed, for the first time since the Fourteenth Amendment went into effect in 1868, the Court struck down a state law on the ground that it discriminated against women in violation of the Equal Protection Clause of that amendment. The law in question—enacted in Idaho in 1864—required that when the father and mother of a deceased person both sought appointment as administrator of the estate, the man had to be preferred over the woman.\n* The Westbeth Playwrights Feminist Collective was founded in New York. It was one of the first feminist theater groups formed to write and produce plays about women's issues and to provide work experience in theatrical professions which had been dominated by men.\n* The song \"I Am Woman\" was published. It was a popular song performed by Australian singer Helen Reddy, which became an enduring anthem for the women's liberation movement.\n* A Women's Equality Day resolution was passed in 1971 designating August 26 of each year as Women's Equality Day.\n1972\n'' with a goddess Durga depiction]]\n* Britain's first second-wave feminist magazine, Spare Rib, was launched by Marsha Rowe and Rosie Boycott.\n* The Equal Pay Act of 1963 did not originally cover executives, administrators, outside salespeople, or professionals. In 1972, Congress enacted the Education Amendments of 1972, which (among other things) amended the Fair Labor Standards Act to expand the coverage of the Equal Pay Act to these employees, by excluding the Equal Pay Act from the professional workers exemption of the Fair Labor Standards Act.\n* Egyptian feminist Nawal El-Saadawi published her book Women and Sex.\n* Ms. magazine  began. It was the first national American feminist magazine.\n* In February 1972, the US Government Printing Office approved using Ms. in official government documents.\n* The National Action Committee (NAC) was established to spur action by the Canadian government to implement recommendations made by the Royal Commission on the Status of Women (1970). Funded in part by the federal government and founded as a wide coalition of women's groups, NAC was seen as the voice of Canadian women.\n* The Equal Rights Amendment was sent to the U.S. states for ratification. The amendment reads: \"Equality of rights under the law shall not be denied or abridged by the United States or by any State on account of sex\".\n]]\n* In Eisenstadt v. Baird the U.S. Supreme Court ruled that unmarried couples have a right to use contraception.\n* The International Feminist Collective was founded in 1972 in Italy by Selma James, Brigitte Galtier, Mariarosa Dalla Costa, and Silvia Federici, to promote political debate and action around the issue of housework; the International Wages for Housework Campaign, which grew out of the Collective, was a feminist global social movement founded in 1972 in Padua, Italy. The Campaign was formed to raise awareness of how housework and childcare are the base of all industrial work and to stake the claim that these unavoidable tasks should be compensated as paid wage labor. The demands for the Wages for Housework formally called for economic compensation for domestic work but also used these demands to call attention to the affective labors of women, the reliance of capitalist economies on exploitative labor practices against women, and leisure inequality.\n* Title IX of the Education Amendments of 1972, became law. It is a comprehensive federal law that prohibits discrimination on the basis of sex in any federally funded education program or activity. The Educational Amendments of 1972 also amended the Fair Labor Standards Act to expand the coverage of the Equal Pay Act to executives, administrators, outside salespeople and professionals, by excluding the Equal Pay Act from the professional workers exemption of the Fair Labor Standards Act.\n* The [American] National Women's Political Caucus was founded.\n* Gloria Steinem delivered her Address to the Women of America.\n* New York Radical Feminists held a series of speakouts and a conference on rape and women's treatment by the criminal justice system.\n* The Feminist Women's Health Center was founded in Los Angeles by Carol Downer and Lorraine Rothman.\n* In San Francisco, California, Margo St. James organized Call Off Your Old Tired Ethics (COYOTE) to improve the working conditions of prostitutes.\n1973\n* Women were allowed on the floor of the London Stock Exchange for the first time.\n* American tennis player Billie Jean King defeated Bobby Riggs in the \"Battle of the Sexes\" tennis match in 1973.  This match is remembered for its effect on society and its contribution to the women's movement.\n* The Supreme Court of the United States ruled in Roe v. Wade that laws prohibiting abortion are unconstitutional. States are constitutionally allowed to place regulations on abortion which fall short of prohibition after the first trimester.\n* The U.S. Supreme Court held that sex-segregated help wanted ads are illegal in Pittsburgh Press Co. v. Pittsburgh Commission on Human Relations, 413 U.S. 376.\n* AT&T agreed to end discrimination in women's salaries and to pay retroactive compensation to women employees.\n* The [American] National Black Feminist Organization was formed.\n* The term \"sexual harassment\" was used in 1973 in \"Saturn's Rings\", a report authored by Mary Rowe to the then President and Chancellor of MIT about various forms of gender issues. Rowe has stated that she believes she was not the first to use the term, since sexual harassment was being discussed in women's groups in Massachusetts in the early 1970s, but that MIT may have been the first or one of the first large organizations to discuss the topic (in the MIT Academic Council), and to develop relevant policies and procedures. MIT at the time also recognized the injuries caused by racial harassment and the harassment of women of color which may be both racial and sexual.\n1974\n* Five all-male colleges at University of Oxford opened admissions to women.\n* Contraception became free for women in the United Kingdom.\n* Virago Press, a British feminist press, was set up by the publisher Carmen Callil. Its first title, Life As We Have Known It, was published in 1975.\n* The Women's Aid Federation was set up to unite battered women's shelters in Britain.\n, former First Lady of the United States]]\n* The Equal Credit Opportunity Act became law in the U.S. It prohibits discrimination in consumer credit practices on the basis of sex, race, marital status, religion, national origin, age, or receipt of public assistance.\n*In Corning Glass Works v. Brennan, the U.S. Supreme Court ruled that employers cannot justify paying women lower wages because that is what they traditionally received under the \"going market rate\". A wage differential occurring \"simply because men would not work at the low rates paid women\" is unacceptable.\n* The U.S. First Lady Betty Ford was pro-choice. A moderate Republican, Ford lobbied to ratify the ERA, earning the ire of conservatives, who dub her \"No Lady\".\n* The Mexican-American Women's National Association was founded.\n* The American Coalition of Labor Union Women was founded.\n* The Women's Educational Equity Act (WEEA) of 1974 was enacted in 1974 to promote educational equity for American girls and women, including those who suffer multiple discrimination based on gender and on race, ethnicity, national origin, disability, or age, and to provide funds to help education agencies and institutions meet the requirements of Title IX of the Education Amendments of 1972.\n* Dell Williams founded the first feminist sex toy business in the United States, Eve's Garden, in New York City in 1974. Eve's Garden was also the first woman-owned and woman-operated sex toy business in America.\n1975\n* The Equal Pay Act 1970 took effect in the UK.\n* The Sex Discrimination Act 1975 became law in the UK, making it illegal to discriminate against women in education, recruitment, and advertising.\n* The Employment Protection Act 1975 became law in the UK, introducing statutory maternity provision and making it illegal to fire a woman because she is pregnant.\n* In Taylor v. Louisiana, the U.S. Supreme Court held that women could not be excluded from a venire, or jury pool, on the basis of having to register for jury duty, thus overturning Hoyt v. Florida, the 1961 case that had allowed such a practice.\n* The U.N. sponsored the First International Conference on Women in Mexico City.\n* U.S. federal employees' salaries could be garnished for child support and alimony.\n* Tish Sommers, chairwoman of NOW's Older Women Task Force, coined the phrase \"displaced homemaker\".\n* American feminist Susan Brownmiller published the landmark book Against Our Will, about rape. She later became one of TIME's \"Women of the Year\" (see below).\n* NOW sponsored \"Alice Doesn't\" Day, asking women across the country to go on strike for one day.\n* Joan Little, who was raped by a guard while in jail, was acquitted of murdering her offender. The case established a precedent in America for killing as self-defense against rape.\n* In New York City, the first women's bank opened.\n* The United States armed forces opened its military academies to women.\n* Time declared: \"[F]eminism has transcended the feminist movement. In 1975 the women's drive penetrated every layer of society, matured beyond ideology to a new status of general—and sometimes unconscious—acceptance.\" The Time Person of the Year award goes to American Women, celebrating the successes of the feminist movement.\n* The Equal Opportunities Commission came into effect in the UK (besides Northern Ireland, where it came into effect in 1976) to oversee the Sex Discrimination and Equal Pay Acts.\n* The first \"Take Back the Night\" march was held. It was held in Philadelphia, Pennsylvania, in October 1975, after the murder of a microbiologist, Susan Alexander Speeth, who was stabbed to death while walking home alone.\n1976\n* The Equal Opportunities Commission came into effect in Northern Ireland to oversee the Sex Discrimination and Equal Pay Acts.\ngiving keynote address before the 1976 Democratic National Convention in New York City]]\n* The Domestic Violence Act became law in Britain, enabling women to obtain a court order against their violent husband or partner.\n* The first marital rape law was enacted in Nebraska, making it illegal for a husband to rape his wife.\n* Congresswoman Barbara Charline Jordan of Texas, the first African-American congresswoman to come from the Deep South and the first woman ever elected to the Texas Senate, who had received widespread recognition as a key member of the House Judiciary Committee during President Nixon's impeachment, delivered the keynote address to the Democratic National Convention. She was the first black person and first woman to address the convention as a keynote speaker, declaring that \"My presence here ... is one additional bit of evidence that the American dream need not forever be deferred\".\n* The Organization of Pan Asian American Women was formed for women of Asian and Pacific American Islander descent.\n* A \"Take Back the Night\" march was held in Belgium in March 1976 by the women attending the International Tribunal on Crimes against Women.\n* In the state of Wisconsin, Susan B. Anthony Day is an established state holiday, which was enacted into law April 15, 1976, from the 1975 Laws of Wisconsin, Chapter 307, section 20. It is also a state holiday in West Virginia and Florida.\n1977\n* The Canadian Human Rights Act was passed, prohibiting discrimination based on characteristics including sex and sexual orientation, and requiring \"equal pay for work of equal value\".\n* In the U.S., the first National Women's Conference in a century was held in Houston, Texas. Women from all over the country, 20,000 in all, gathered to pass a National Plan of Action.\n* The first women pilots of the United States Air Force graduated.\n* International Women's Day was formalized as an annual event by the U.N. General Assembly.\n* The first Rape Crisis Centre opened in London.\n* A landmark ruling on January 7, 1977, by Washington Supreme Court in State of Washington v. Wanrow set a precedent about jury instructions in a criminal trial of a woman that a jury should ask \"what a reasonably prudent woman... would have done,\" overturning the prudent man rule which had been used previously for both men and women.\n1978\n* Marilyn Loden is credited with inventing the phrase \"glass ceiling\", during a 1978 speech.\n* The Oregon v. Rideout jury decision, in which Rideout was acquitted of raping his wife, led many American states to allow prosecution for marital and cohabitation rape.\n* The Pregnancy Discrimination Act banned employment discrimination against pregnant women in the U.S., stating a woman cannot be fired or denied a job or a promotion because she is or may become pregnant, nor can she be forced to take a pregnancy leave if she is willing and able to work.\n* In 1978 a discrimination complaint was filed by the Coal Employment Project, a women's advocacy organization, against 153 coal companies. This action was based upon Executive Order 11246 signed in 1965 by U.S. President Lyndon Johnson, which bars sex discrimination by companies with federal contracts. The complaint called for the hiring of one woman for every three inexperienced men until women constituted 20 percent of the workforce. This legal strategy was successful. Almost 3,000 women were hired by the close of 1979 as underground miners.\n* The Equal Rights Amendment’s deadline arrived with the ERA still three states short of ratification; there was a successful bill to extend the ERA's deadline to 1982, but it was still not ratified by then.\n1979\n* The feminist art piece The Dinner Party, by American feminist artist Judy Chicago, was first put on display at the San Francisco Museum of Modern Art.\n* Duren v. Missouri, 439 U.S. 357 (1979), was a United States Supreme Court case in which the court ruled that the exemption on request of women from jury service under Missouri law, resulting in an average of less than 15% women on jury venires in the forum county, violated the \"fair-cross-section\" requirement of the Sixth Amendment as made applicable to the States by the Fourteenth.\n1980s\n* In the U.S., the early 1980s were marked by the end of the second wave and the beginning of the feminist sex wars. Many historians view the second-wave feminist era in America as ending in the early 1980s with the intra-feminism disputes of the feminist sex wars over issues such as sexuality and pornography, which ushered in the era of third-wave feminism in the early 1990s.\n* The Guerrilla Girls formed in the early 1980s as a response to sexism and racism in the art world. Known for their protest art and their usage of gorilla masks to remain anonymous, the group actively calls out issues within the contemporary art world.\n* In the 1980s the second wave spread to Turkey and to Israel.\n, former French Minister of Women's Rights]]\n1982\n* The Canadian Charter of Rights and Freedoms was enacted by the Canada Act of 1982, and it declares (among other things), \"15. (1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. (2) Subsection (1) does not preclude any law, program or activity that has as its object the amelioration of conditions of disadvantaged individuals or groups including those that are disadvantaged because of race, national or ethnic origin, colour, religion, sex, age or mental or physical disability.... 28. Notwithstanding anything in this Charter, the rights and freedoms referred to in it are guaranteed equally to male and female persons.\"\n1983\n* In 1983, the women's minister of France, Yvette Roudy, passed a law obliging all companies with more than 50 employees to carry out a comparative salary survey between men and women.\n1985\n* The Japanese Equal Employment Opportunity Law of 1985, effective in April 1986, prohibits gender discrimination with respect to recruitment, hiring, promotion, training, and job assignment.\nSee also\n* First-wave feminism\n* List of American women's firsts\n* Third-wave feminism\n* Timeline of women in the United States\n* Timeline of women in warfare in the United States from 1900 to 1949\n* Timeline of women's education\n* Timeline of women's legal rights (other than voting)\n* Timeline of women's suffrage\n* Timeline of women's suffrage in the United States\nReferences\nExternal links\n*  National Women's History Project |author=National Women's History Project |url=http://www.nwhp.org/resources/womens-rights-movement/detailed-timeline/ |website=National Women's History Project }}\n*\n*"
    }
  ]
}