{
  "content": [
    {
      "type": "text",
      "text": "# Timiryazev monument\n\n| completion_date    =\n| catalogue          =\n| medium             = Granite\n| movement           =\n| subject            = Kliment Timiryazev\n| height_metric      =\n| width_metric       =\n| length_metric      =\n| diameter_metric    =\n| height_imperial    =\n| width_imperial     =\n| length_imperial    =\n| diameter_imperial  =\n| dimensions         =\n| dimensions_ref     =\n| metric_unit        = m\n| imperial_unit      = ft\n| weight             =\n| designation        = Cultural heritage monument of federal significance\n| condition          = Chipped from bomb damage\n| museum             = Tverskoy Boulevard\n| city               = Moscow, Russia\n| coordinates        =\n| owner              =\n| accession          =\n| preceded_by        =\n| followed_by        =\n| module             =\n| website            =\n}}\nTimiryazev monument (Russian: Памятник Клименту Тимирязеву; Transliteration: Pamyatnik Klimentu Timiryazevu) is a monumental sculpture in Moscow of the scientist Kliment Timiryazev. The statue was made by renowned Soviet sculptor Sergey Merkurov. It  was installed in 1923 at the end of Tverskoy Boulevard.\nHistory\nOn 12 April 1922 Presidium of Mossovet issued a resolution to erect a monument to Timiryazev as a part of Lenin's plan of monumental propaganda. This statue was installed at the end of Tverskoy Boulevard. There were ruins of the building which was almost destroyed during the Revolution, but for the construction of this monument it was completely demolished and replaced by a park. The architectural design was assigned to architect Dmitry Osipov. During World War II a bomb fell near the statue and dislodged it from its pedestal. It was re-installed, but you can see that it is chipped in two places.\nTimiryazev's statue belongs to the period of Sergey Merkurov's creative peak. The statue is particularly interesting in context of the Merkurov's art because it was state order but at that time there were no clear and strict idea what an artist should represent compared to the latter period, which gave him more freedom. K.Min, who visited the workshop of Merkurov, wrote that the sculptor worked on this statue with the help of three apprentices, which shows us the scale and complexity of this project. The whole process of creating this statue took Merkurov almost a year. It was especially  complicated  because of the material — Swedish granite.\nDescription\nMerkurov's creative method is close to the method of ancient sculptors because material dictates the form. He had to work with two blocks of granite of imperfect and difficult forms, which forced him to elongate proportions of the statue.\nThe square, where the monument is situated, is marked by sculptures of microscopes which resemble avant-garde architectones. The pedestal of the statue presents an arrangement of cubical forms: a large parallelepiped is placed on four smaller cubes, which lock into two displaced plates. On a pedestal there is a relief of the curve of assimilation dependence on sunlight, defined by Timiryazev in his work on plant physiology, and the inscription: «K. A. Timiryazev — warrior and thinker».\nThis monumental composition is very geometrical and solid. This characteristics create a strong sense of tectonics and firmness. The figure of Timiryazev rises above the square as a column. He is presented in the mantle of a doctor at the University of Cambridge, which elongates his silhouette and makes him look like a Scandinavian warrior. He stands in a very steady posture with his hands locked together. The body is simplified whereas the face is realistic. All the details reduced to their minimum in order to guide our attention to the Timiryazev's face and hands, at the same time, preserving the overall impression of the monument as a whole. Solidity and monumentalism are emphasised by the dark grey colour of granite.\nThis sculptural composition shows us a great example of the synthesis of architecture and sculpture. It was perfectly included into the city's context and it still looks as if it was meant to be there. The forms of the statue beautify blend with the forms of modernist TASS building, which was built there in the 1970s. It is not surprising that the quality of this monument was appreciated and praised by other sculptors.\nReception\nSoviet sculptor Nikolay Nikogosyan wrote that this is one of the best monuments in Moscow and Merkurov's greatest work.\nHowever, not everybody was amazed by this artwork, some people critiqued the choice of Timiryazev, because they thought he was chosen not because of his talents as scientist but because of his political beliefs. Others found it to be excessively \"formalistic\" and too much influenced by western art. Indeed this piece bears traces of the influence of French and German sculptors. Simplified and solid forms recall associations with the work of Georg Kolbe and Ernst Barlach.\nReferences\nSources\n* Vinogradov N. D., \"Memories of monumental propaganda in Moscow\", Art, № 1. (1939): 46.\n* History of Russian Art, edited by I. E. Grabar, V. N. Lazarev, V. S. Kemenov. Moscow: Academy of Science USSR, 1957\n* Sergey Dmitrievich Merkurov. Memories. Letters. Articles. Notes. Judgments of contemporaries. edited by Merkurov G. S. Moscow: Kremlin Multimedia, 2012."
    }
  ]
}