{
  "content": [
    {
      "type": "text",
      "text": "# Tinker (software)\n\n| latest release version = 8.10.2\n| latest release date =\n| latest preview version =\n| latest preview date =\n| programming language = Fortran 95, CUDA, OpenMP and MPI Parallel\n| operating system = Windows, macOS, Linux, Unix\n| platform =\n| size =\n| language = English\n| genre = Molecular dynamics\n| license = Proprietary freeware\n| website =\n| frequently updated =\n}}\nTinker, previously stylized as TINKER, is a suite of computer software applications for molecular dynamics simulation. The codes provide a complete and general set of tools for molecular mechanics and molecular dynamics, with some special features for biomolecules. The core of the software is a modular set of callable routines which allow manipulating coordinates and evaluating potential energy and derivatives via straightforward means.\nTinker works on Windows, macOS, Linux and Unix. The source code is available free of charge to non-commercial users under a proprietary license. The code is written in portable FORTRAN 77, Fortran 95 or CUDA with common extensions, and some C.\nCore developers are: (a) [https://dasher.wustl.edu/ the Jay Ponder lab], at the Department of Chemistry, Washington University in St. Louis, St. Louis, Missouri. Laboratory head Ponder is Full Professor of Chemistry, and of Biochemistry & Molecular Biophysics;  (b) [https://faculty.engr.utexas.edu/ren/home the Pengyu Ren lab ], at the Department of Biomedical Engineering University of Texas in Austin, Austin, Texas. Laboratory head Ren is Full Professor of Biomedical Engineering;  (c) [http://piquemalresearch.com/ Jean-Philip Piquemal's research team] at Laboratoire de Chimie Théorique, Department of Chemistry, Sorbonne University, Paris, France. Research team head Piquemal is Full Professor of Theoretical Chemistry.\nFeatures\nThe Tinker package is based on several related codes: (a) [https://dasher.wustl.edu/tinker the canonical Tinker], version 8, (b) the Tinker9 package as a direct extension of canonical Tinker to GPU systems, (c) [http://www.ip2ct.upmc.fr/tinkerHP the Tinker-HP package] for massively parallel MPI applications on hybrid CPU and GPU-based systems, (d) Tinker-FFE for visualization of Tinker calculations via a Java-based graphical interface, and (e) [http://biomol.bme.utexas.edu/tinker-openmm/index.php/Main_Page the Tinker-OpenMM package] for Tinker's use with GPUs via an interface for the OpenMM software. All of the Tinker codes are available from the TinkerTools organization site on GitHub. Additional information is available from the TinkerTools community web site.\nPrograms are provided to perform many functions including:\n# energy minimizing over Cartesian coordinates, torsional angles, or rigid bodies via conjugate gradient, variable metric or a truncated Newton method\n# molecular, stochastic, and rigid body dynamics with periodic boundaries and control of temperature and pressure\n# normal mode vibrational analysis\n# distance geometry including an efficient random pairwise metrization\n# building protein and nucleic acid structures from sequence\n# simulated annealing with various cooling protocols\n# analysis and breakdown of single point potential energies\n# verification of analytical derivatives of standard and user defined potentials\n# location of a transition state between two minima\n# full energy surface search via a Conformation Scanning method\n# free energy calculations via free energy perturbation or weighted histogram analysis\n# fitting of intermolecular potential parameters to structural and thermodynamic data\n# global optimizing via energy surface smoothing, including a Potential Smoothing and Search (PSS) method\nAwards\n* Tinker-HP received the 2018 [https://globenewswire.com/news-release/2018/07/06/1534057/0/en/Atos-and-GENCI-announce-Winners-of-Atos-Joseph-Fourier-Award-2018.html Atos-Joseph Fourier Prize] in High Performance Computing.\nSee also\n* List of software for Monte Carlo molecular modeling\n* Comparison of software for molecular mechanics modeling\n* Molecular dynamics\n* Molecular geometry\n* Molecular design software\n* Comparison of force field implementations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nLicense\nExternal links\n*\n*\n*\n*"
    }
  ]
}