{
  "content": [
    {
      "type": "text",
      "text": "# Tire Kingdom\n\nin West Palm Beach, Florida, U.S.\n| founder = Chuck Curico\n| defunct =\n| location_city = Palm Beach Gardens, Florida\n| location_country = U.S.\n| locations = 730+ (2020)\n| area_served = Southern United States\n| key_people = Christopher Cavalier (CEO)\n| products = Automobile tires\n| production =\n| services = Oil changes, tire service, battery replacement, wiper blades, inspections\n| revenue = US$500 million (2021)\n| operating_income =\n| net_income =\n| aum =\n| assets =\n| equity =\n| num_employees = 6,200 (2021)\n| parent = Michelin(1989–2000)\nTBC Corporation(2000–2023)\nMavis Tire(2023–present)\n| divisions =\n| subsid =\n| homepage = https://www.tirekingdom.com/\n| footnotes =\n| intl =\n| bodystyle =\n}}\nTire Kingdom is a large American tire store chain located primarily in the southern part of the United States.  In 2000, it became a subsidiary of TBC Corporation.\nBackground\nTire Kingdom was founded by Chuck Curcio in Florida in 1972, starting with a location in a farmer's market in West Palm Beach, Florida.  Business grew rapidly and the organization started opening stores throughout Florida and by the late 1980s had expanded through most major markets in the State, with 34 locations by 1984,  and 67 locations by late 1988.  Curcio became well known for his irreverent late night parties, usually featuring him in outlandish costumes such as Crocket from Miami Vice.  In subsequent years the company expanded to Georgia, Louisiana, Vermont, Ohio, New Hampshire,  the Carolinas, and the United States Virgin Islands.\nAcquisition by Michelin Group\nCurcio sold Tire Kingdom to the Michelin group in a deal that closed in early 1989.  In 1993, an investment group headed by Goldman Sachs took control, with Curcio returning as part of the team.   Curcio stepped down in 1996,  and TBC Corporation purchased the company in the middle of 2000 for a reported $45 million.  TBC Corporation also owns the Big O Tires, National Tire & Battery, and Merchant Tire chains, each of which have separate branding and generally separate territories.\nOn April 3, 2015, TBC Corporation announced that all Tire Kingdom locations outside of Florida would be rebranded under the National Tire & Battery brand.\nOn May 22, 2023 TBC announced the sale of all remaining Tire Kingdom and NTB company owned locations to Mavis Discount Tire\nReferences\nExternal links\n*"
    }
  ]
}