{
  "content": [
    {
      "type": "text",
      "text": "# Tītokowaru's War__disambig_1\n\n: Colony of New ZealandMāori allies\n| combatant2        = Ngāti RuanuiNgāruahine\n| commander1        =  George Whitmore Thomas McDonnell Te Keepa\n| commander2        =  Riwha Tītokowaru\n| strength1         = 1,250\n| strength2         = 150–400\n}}\n'''Tītokowaru's War''' was a military conflict that took place in the South Taranaki region of New Zealand's North Island from June 1868 to March 1869 between the Ngāti Ruanui and Ngāruahine Māori tribes and the New Zealand Government. The conflict, near the conclusion of the New Zealand wars, was a revival of hostilities of the Second Taranaki War as Riwha Tītokowaru, chief of Ngāruahine, responded to the continued surveying and settlement of confiscated land with well-planned and effective attacks on settlers and government troops in an effort to block the occupation of Māori land.\nThe war, coinciding with a violent raid on a European settlement on the East Coast by fugitive guerrilla fighter Te Kooti, shattered what European colonists regarded as a new era of peace and prosperity, creating fears of a \"general uprising of hostile Māoris\", but once Tītokowaru was defeated and the East Coast threat minimised, the alienation of Māori land, as well as the political subjugation of Māori, continued at an even more rapid pace.\nTītokowaru, who had fought in the Second Taranaki War, was a skilful West Coast Māori warrior. Formerly a follower of Te Ua Haumēne, he was also a priest and prophet of his Pai Mārire political and religious movement, reviving ancient rites of cannibalism and propitiation of Māori gods with a heart torn from the first enemy slain in a battle. Although Tītokowaru's forces were numerically small and initially outnumbered in battle 12 to one by government troops, the ferocity of their attacks provoked fear among settlers and prompted the resignation and desertion of many militia volunteers, ultimately leading to the withdrawal of most government military forces from South Taranaki and giving Tītokowaru control of almost all the territory between New Plymouth and Wanganui.\nTītokowaru provided the strategy and leadership that had been missing among tribes that had fought in the Second Taranaki War. His forces never lost a battle during their intensive campaign, but abandoned their resistance after being pursued into their headquarters in the swamps of Ngaere by Colonel George Stoddart Whitmore, commander of the colonial forces, on 24 March 1869, although Tītokowaru himself managed to escape.\nTītokowaru's apparent invincibility created a security crisis in 1868, with the government fearing attacks on Wanganui and Manawatū. Yet according to historian James Belich, his achievements were gradually watered down to the point where his name was erased from the most widely read New Zealand histories. Belich concluded: \"As a result, the military crisis of which he was the principal architect—perhaps the greatest threat to European dominance in the history of New Zealand—has all but disappeared from the received version.\"\n}}\nCause and background of the war\nThe immediate cause of the war was the confiscation of vast areas of Māori land in Taranaki by the Government under the powers of the punitive New Zealand Settlements Act 1863. Surveying and settling of the confiscated land had begun in 1865 and Māori, weakened and intimidated by the bush-scouring campaigns of Major Thomas McDonnell and Major-General Trevor Chute in 1865–66, had accepted the loss of their land. Tītokowaru declared 1867 to be a year of peace and reconciliation and travelled among local tribes urging them to accept that the war was over. By mid-1868 colonists assumed the New Zealand wars were over and they were about to enter a long-awaited period of rapid progress.\nBut as settlers continued to move into the confiscated areas in early 1868, taking possession of greater areas of farmland, tribes faced the option of fighting to retain their cultivable land or starving. Tītokowaru, in response, began to mount campaigns of non-violent resistance to halt further incursions by white settlers. Members of his hapū removed survey equipment and destroyed fences and huts, then began harassing South Taranaki settlers with minor thefts of stock and property to persuade them to leave. On 9 June 1868, Ngāti Ruanui warriors escalated their campaign, shooting and tomahawking three settlers felling and sawing timber on the east side of the Waingongoro River, between Hāwera and Manaia. Soon after, a member of the Armed Constabulary, the colonial regular army, was shot and mutilated by tomahawk near the Waihi Redoubt (at present-day Normanby). The upper part of his body was taken by Hauhau warriors to Te Ngutu o Te Manu, a village 16&nbsp;km north of Hāwera, where it was cooked and eaten. Tītokowaru issued a letter threatening that other pākehā intruders on the land would also be killed and eaten, warning: \"I have begun to eat the flesh of the white man... My throat is continually open for the eating of human flesh by day and night.\"\nThe 9 June killings signalled a resumption of war and McDonnell was recalled from Wanganui. He gained approval from the Defence Minister, Colonel Theodore Haultain, to enlist 400 men, including 100 Wanganui Māori, for three months' service. The companies were hastily drilled for the campaign and the garrison at Waihi reinforced by Rifle Volunteers from Wellington.\nEngagements\nTuruturu-Mōkai Redoubt\nTītokowaru's first major clash with the colonial forces occurred on 12 July 1868 and, in a portent of things to come, it proved disastrous for his enemy. In a move Belich claims was designed to provoke McDonnell and lure him to a battle at a place of Tītokowaru's choosing, 60 warriors from the Ngāruahine hapū, along with Imperial Army deserter Charles Kane, launched a pre-dawn raid on the dilapidated Turuturu-Mōkai Redoubt, 2.5&nbsp;km north of Hāwera and 5&nbsp;km from the main army camp at Waihi Redoubt, killing 10 and wounding six of the 25 Armed Constabulary garrisoned there. Tītokowaru remained at Te Ngutu o Te Manu during the battle. The redoubt was small, about 20 metres square, built on low ground and was protected by crumbling parapets only 1.5 metres high and a trench 1.8m deep. The hearts of two of the Constabulary soldiers were cut from their bodies by Māori warriors, prompting McDonnell to make the dramatic gesture of kissing the blade of his sword and vowing, \"I shall have revenge for this.\"\nTito Kowaura (Titokowaru) - Illustrated Australian News (1869).jpg|Riwha Tītokowaru, 1869\nCol. George Stoddart Whitmore.jpg|Colonel George Stoddart Whitmore\nMajor Thomas McDonnell.jpg|Major Thomas McDonnell\nPlan of turuturumokai.jpg|Plan of Turuturu-Mokai Redoubt\nTuruturumokai redoubt taranaki.jpg|Turuturu-Mokai Redoubt, Taranaki, 1868\nTe Ngutu o Te Manu\nThe Battle of Te Ngutu o Te Manu, Taranaki, 1868. Artist: J. McDonald\nOn 21 August McDonnell crossed the flooded Waingongoro River with a column of 350 men to retaliate against Tītokowaru. His force comprised three divisions of Armed Constabulary, Wellington Rangers, Wellington Rifles, Taranaki Volunteer Militia, Patea Yeomanry Cavalry and a number of unenlisted volunteers. McDonnell marched through dense rātā forest to reach Te Ngutu o Te Manu, which he had last visited in May and was surprised to find a new palisade in front of the village. He split his force into two sections to storm the palisade from the front and circle it from the left to enter near the rear. The raid was a modest success, with his troops capturing weapons and ammunition and burning part of the village, most of whose inhabitants were out hunting for food. McDonnell's troops were forced to retreat under heavy fire as Māori returned, regrouped in the bush and pursued them to the Waingongoro River. McDonnell's casualties were four men killed and eight wounded.\nLess than three weeks later, on 7 September 1868, McDonnell returned to the Ngāti Ruanui heartland, this time determined to skirt Te Ngutu o Te Manu and first strike at another village to the east, Ruaruru, before returning to Te Ngutu. The plan went awry when his column of 360 men became disoriented in the forest, missing Ruaruru and approaching Te Ngutu from the north. Shots fired at the occupants of outlying huts warned Tītokowaru of the direction of McDonnell's approach, giving the chief time to organise his defence. He remained in the pā with 20 men and sent the remaining 40, in small groups, to hidden rifle pits in bush surrounding a clearing that led to the palisade, and possibly other positions within the clearing itself. McDonnell's force, attempting to storm the palisade, came under immediate and very heavy fire from front, right and rear, with troops \"being knocked over like ninepins\" by unseen marksmen. Again the heart of the first soldier killed was cut from his body as a Hauhau war rite. McDonnell hesitated, torn between advancing with further losses or retreating, watching as the inexperienced volunteer recruits from the Wellington Rangers and Rifles either bunched together and froze or panicked and fled. McDonnell then gave the order to retreat, with casualties carried out first and McDonnell following with 80 men. Major Gustavus von Tempsky, near the palisade, was shot dead while awaiting orders, and four other officers—two captains and two lieutenants—were also killed. Tītokowaru's small attacking force was quickly reinforced by warriors from neighboring villages and McDonnell's retreat to Waihi came under relentless fire from Māori who followed them almost to the Waingongoro, inflicting further casualties. The expedition left 24 Europeans killed and 26 wounded.\nTe Ngutu o Te Manu was a shattering defeat for the Europeans, on a similar magnitude to the Battle of Puketakuere during the First Taranaki War. Contemporary writers described the loss as \"the most serious and complete defeat ever experienced by the colonial forces\"  and \"the most disastrous affair that ever took place in New Zealand\". Von Tempsky's death came as a shock to his military followers and to his wider audience of admirers throughout New Zealand. In the minds of the Pākehā public, von Tempsky was a dashing hero of the New Zealand wars, whose fearlessness and ability to survive near-misses gave him an aura of invincibility. One newspaper correspondent wrote: \"Unless something is done and done quickly we had all better clear out.\"\nThe aftermath of the defeat was even more disastrous as it led to a disintegration of the Government forces. Hundreds deserted or refused to re-enlist for further service. Many kūpapa (so-called \"friendly\" Māori) returned home and Von Tempsky's Forest Rangers mutinied. The Government was forced to abandon its Waihi and Manawapou camps, as well as the Kakaramea redoubt and withdraw to Patea, which prompted colonists to leave their farms and redoubts and retreat to the safety of Wanganui. The abandoned colonist sites were quickly occupied by Ngāruahine warriors.\nMoturoa\nIn September 1868 Tītokowaru, who had until then been fighting only with his own hapū, gained the support of the Pakakohe, Tangahoe and Ngārauru hapū, more than doubling his strength to between 150 and 200. In early October his force marched south and built a pā at Otoia, just northeast of Patea and busied themselves with repairing weapons, gathering food and ammunition and planting crops. Further raids were carried out on settlers between Patea and the Waitōtara River in a bid to bait the Government to fight them at their pā, without success.\nMcDonnell resigned as commander and was replaced in September by Colonel George S. Whitmore, who had carried out the first operations against Te Kooti on the East Coast. In early November Whitmore moved his field headquarters to Wairoa (modern-day Waverley) after learning Tītokowaru had moved south of him and established a camp at Moturoa, about 5&nbsp;km inland of Wairoa, from where it was feared he would attack the rich farming area of Waitōtara.\nOn 6 November Whitmore's force was boosted by the arrival of 100 men of a newly raised company of the Armed Constabulary, No.6 Division, commanded by Captain J. M. Roberts, who had fought at Te Ngutu. At midnight that night an attacking column of 550, including 300 Wanganui kūpapa, picked their way from Wairoa toward Moturoa. Two hundred of the kūpapa refused to enter the bush and the remaining force arrived at the pā before daylight.\nMap of the Battle of Moturoa, 1868.The Māori camp had been established just four days earlier, in hilly, bush-covered country below the high wooded tableland of Okutuku, a village that had been raided in January 1866 as part of a \"bush-scouring\" campaign by Major-General Trevor Chute during the earlier hostilities. About 100 metres of 3.6m-high loose palisading had been hastily erected in a concave shape, blocking the path to the pā, while other defensive works included a long trench 2m wide and 2m deep behind the palisade, as well as hidden rifle pits and three taumaihi, 6m-high towers built of packed soil and ferns. While men in the trenches could fire through a gap beneath the palings of the palisade, others on an earth bank behind the trenches could fire through gaps in the palings, while a third line of fire could be effected from the taumaihi. Tītokowaru had placed his men on high alert and in the misty dawn, sentries caught sight of Whitmore's advance guard moving through the bush. The Moturoa defenders were silently roused and took their firing positions without being seen by the attacking force.\nWhitmore ordered No.1 Division of the Armed Constabulary and a contingent of Wanganui kūpapa under Major Keepa Te Rangihiwinui to move around to the right of the pā to attack the flank while the main body assaulted the front, supported by the newly arrived No.6 Division. Entry from the left was prevented by a steep and thickly forested gully at the western end of the palisade.\nThe signal for the assault was given and Hunter rushed for the palisades with a storming party of 50 Armed Constabulary. Tītokowaru's men waited until Hunter's men were within 10 or 12 metres before opening fire. One survivor said: \"I never saw the like of that sheet of fire. Men went down all round me.\" Within minutes a dozen men were lying dead or wounded on the open ground. Keepa could not reach his assault point on the right flank and returned to help Hunter, who moments later suffered a fatal wound. Whitmore then sounded the bugle to retire, prompting many Moturoa defenders to run from the shelter of the stockade and trenches in pursuit. On the west, or left, flank a small detachment of No.2 Division was left to engage with Māori outside the pā and was the last group to retreat, coming under heavy fire not only from the pursuers but also from kūpapa who believed they were the enemy, so far were they behind the main force. The Moturoa force followed Whitmore's troops all the way to Wairoa, firing on the redoubt before retreating.\nWhitmore's casualties were recorded as 19 killed or missing and 20 wounded, with the heart of one soldier cut from his body and another later cooked and eaten. Only one of Tītokowaru's force was killed in the encounter.\nThe battle was regarded as the worst reverse suffered by government troops on the West Coast, surpassing even the Te Ngutu disaster. Colonel W.E. Gudgeon, who described it as \"the most desperate engagement fought in the Māori War\", claimed: \"Whitmore's return did not give nearly our casualties. I made it at the time 52 out of fewer than 200 actually engaged.\" Whitmore offered his resignation to the Defence Minister, but was given government support and retained. Historian James Cowan described the Moturoa expedition as \"Whitmore's one great blunder\", but strong criticisms of Whitmore's strategy were rejected by Belich, who said the commander's one mistake was to underestimate the Moturoa deceptively strong defences. Although he claimed Whitmore had greatly exaggerated the strength of his enemy—reporting Tītokowaru had as many as 600 warriors at Moturoa—he concluded: \"Whitmore was simply unfortunate enough to be a good general matched against an excellent one.\"\nTauranga-Ika\nTauranga-ika Pā, 1869.In the wake of the Moturoa defeat, Whitmore moved his base further south to Nukumaru, forming an entrenched camp ready to defend Wanganui's outlying settlements with a force of 350. Tītokowaru responded by following him, establishing an elaborate fortification for his 400 warriors at the Māori village of Tauranga-ika close to the Europeans' military base and just 29&nbsp;km, or a day's march, from Wanganui. The new pā was sited alongside a road running from Kai-Iwi to the Waitōtora River and provided a commanding view to the coast, with impenetrable bush behind it. From his new base he launched a night-long assault on the Weraroa Redoubt, overlooking the Waitotara River. Whitmore promptly abandoned Weraroa, moving its 50 Wanganui militia to join him at Nukumaru. As tensions continued to rise on the West Coast, the country learned of the massacre by fugitive East Coast guerrilla fighter Te Kooti of 50 men, women and children at Poverty Bay on 9/10 November. Defence Minister Haultain immediately ordered Whitmore to withdraw his entire force another 11&nbsp;km to build a defensive line on the south side of the Kai-Iwi River and transfer some of his force to the East Coast to eradicate Te Kooti's threat. Whitmore convinced Haultain that it would be easier to concentrate first on defeating Te Kooti before returning with a stronger, more disciplined force to successfully act against Tītokowaru. He sailed from Wanganui for Poverty Bay on 2 December with 212 Armed Constabulary, leaving Wanganui's defence in the hands of about 620 Imperial troops, Armed Constabulary and militia and volunteers. Whitmore remained away from the West Coast for five weeks, during which time the colonial forces at Wanganui swelled to almost 2000 men.\nCross-section of firing positions at Tauranga-ika Pā, 1869.Tītokowaru used those five weeks to demonstrate his hold on the Wanganui hinterland, burning farms and abandoned military posts and driving off stock, but also laboring over the fortifications at Tauranga-ika until it became one of the most formidable modern pā ever built. The pā had been built in a diamond shape, 135 metres long on each side, complete with trenches, rifle pits, parapets and a double line of stockade. The palisade, attached to 30&nbsp;cm-thick posts, reached 5m above the ground, with a gap at its base to allow defenders in the trenches to fire beneath it. Inside the pā were trenches, covered walkways and shellproof underground shelters roofed with strong timbers, packed earth and galvanised roofing iron. At one corner was a 10m-high taumaihi, providing a third level of fire. Inspecting it later, Whitmore wrote in his report of 3 February 1869, \"No troops in the world could have hewn their way through a double row of strong palisades, backed by rifle pits, and flanked by two-storeyed erections, such as was constructed in this fortification, defended by excellent shots and desperate men.\"\nWhitmore returned to Wanganui on 18 January 1869 and immediately began preparing for a major offensive against Tītokowaru. A week later he set off with 800 Armed Constabulary and Wanganui and Kai-Iwi Mounted Corps, as well as 200 kūpapa under Major Keepa, clinging to the coast to avoid the danger of bush ambushes. On 1 February he was at Nukumaru and the force dug itself in 100m away from the stockade. Two Armstrong guns were brought up on 2 February and used to shell the pā, causing little damage and no casualties. Two Coehorn mortars were used to fire on the pā the next day in preparation for a possible assault, when a reconnaissance mission by some Armed Constabulary discovered the pā was empty, its inhabitants—men, women and children—having slipped out through the rear during the night.\nTītokowaru's army immediately began to disperse, with entire hapū splitting from his force. No clear evidence exists why his forces would abandon a fortress so apparently unassailable, or why the chief's support from Taranaki Māori quickly evaporated, though Kimble Bent, who was sheltering with Tītokowaru's hapū after deserting from the 57th Regiment, told Cowan 50 years later the chief had lost his mana tapu, or sacred power, after committing adultery with the wife of another chief.\nWhitmore professed no regret that Tauranga-ika had been taken without resistance: \"My object was to gain possession of the district and if I could do this without loss and without putting too heavy a strain on my raw troops they would be encouraged.\"\nWhitmore began pursuing Tītokowaru, with soldiers offered rewards of £10 for the head of a chief and £5 for the head of any others of his half-starved forces. Straggling warriors were shot and prisoners were decapitated as European troops and kūpapa competed in the race for blood money, collecting sacks of human heads. Whitmore suffered several casualties from a rearguard defence near the Waitōtara River, but caught up with them on 13 March at Otautu, north of Patea, when six colonial soldiers were killed and 12 wounded in an attempted assault on the Māori camp. Eleven days later a group of Tītokowaru's followers, by now starving and subsisting on foraged food including fungus and grubs, surrendered in a swamp hideout at Ngaere, near modern-day Eltham, while their chief evaded soldiers and settled at Kawau Pā in the Upper Waitara Valley. The Government abandoned attempts to pursue him further and apart from mopping-up actions to capture his former allies in South Taranaki, the war had come to an end.\nAlthough Tītokowaru had fought the entire war without direct assistance from the Māori King Movement, it is possible the Kingites had attempted to intervene in February 1869 with an attack on the Pukearuhe Redoubt in Taranaki's far north—in which the settlers Lieutenant Gascoigne, his wife, and their four children were killed alongside Rev. John Whiteley after being deceived with an opportunity for trade —and again in March when a force of Kingite warriors massed at Mōkau, reportedly preparing to invade Taranaki. The raid, if planned, did not eventuate and the intervention plans, if they existed, came too late to assist Tītokowaru.\nIn popular culture\n* River Queen, film (2005) based on Tītokowaru's War in Whanganui.\n* Monday's Warriors, novel (1990) by New Zealand author Maurice Shadbolt. Semi-fictionalized account of the war told from the perspective of Kimball Bent.\nSee also\n*New Zealand land confiscations\nNotes\nReferences\nFurther reading\n*\n*\n*\n*  Original publication, 1923\n*\n*\n*\n*\n*\n*  Original Italian publication, 1896.\n*"
    }
  ]
}