{
  "content": [
    {
      "type": "text",
      "text": "# Tivoli Gardens, Kingston\n\ninstead -->\n| settlement_type         =\n| image_skyline           =\n| image_alt               =\n| image_caption           =\n| image_flag              =\n| flag_alt                =\n| image_seal              =\n| seal_alt                =\n| image_shield            =\n| shield_alt              =\n| nickname                =\n| motto                   =\n| image_map               =\n| map_alt                 =\n| map_caption             =\n| pushpin_map             = Jamaica\n| pushpin_label_position  =\n| pushpin_map_alt         =\n| pushpin_map_caption     =\n| coordinates             =\n| coor_pinpoint           =\n| coordinates_footnotes   =\n| subdivision_type        = Country\n| subdivision_name        = Jamaica\n| subdivision_type1       = City\n| subdivision_name1       = Kingston\n| subdivision_type2       =\n| subdivision_name2       =\n| subdivision_type3       =\n| subdivision_name3       =\n| established_title       = Developed\n| established_date        = 1963–1965\n| founder                 =\n| seat_type               =\n| seat                    =\n| government_footnotes    =\n| leader_party            =\n| leader_title            =\n| leader_name             =\n| unit_pref               = Metric\ntags -->\n| area_footnotes          =\n| area_urban_footnotes    =\n| area_rural_footnotes    =  -->\n| area_metro_footnotes    =  -->\n| area_magnitude          =  -->\n| area_note               =\n| area_water_percent      =\n| area_rank               =\n| area_blank1_title       =\n| area_blank2_title       =\n| area_total_km2          =\n| area_land_km2           =\n| area_water_km2          =\n| area_urban_km2          =\n| area_rural_km2          =\n| area_metro_km2          =\n| area_blank1_km2         =\n| area_blank2_km2         =\n| area_total_ha           =\n| area_land_ha            =\n| area_water_ha           =\n| area_urban_ha           =\n| area_rural_ha           =\n| area_metro_ha           =\n| area_blank1_ha          =\n| area_blank2_ha          =\n| dunam_link              =\n| area_total_dunam        =\n| area_land_dunam         =\n| area_water_dunam        =\n| area_urban_dunam        =\n| area_rural_dunam        =\n| area_metro_dunam        =\n| area_blank1_dunam       =\n| area_blank2_dunam       =\n| length_km               =\n| width_km                =\n| dimensions_footnotes    =\n| elevation_footnotes     =\n| elevation_m             =\n| population_footnotes    =\n| population_total        =\n| population_as_of        =\n| population_density_km2  = auto\n| population_demonym      =\n| population_note         =\n| timezone1               =\n| utc_offset1             =\n| timezone1_DST           =\n| utc_offset1_DST         =\n| postal_code_type        =\n| postal_code             =\n| area_code_type          =\n| area_code               =\n| iso_code                =\n| website                 =\n| footnotes               =\n}}\nTivoli Gardens is a neighbourhood in Kingston, Jamaica. Developed as a renewal project between 1963 and 1965, the neighbourhood continued to suffer from poverty. By the late twentieth century it had become a center of drug trafficking activity and social unrest. Repeated confrontations took place between law enforcement and gunmen in the neighbourhood in 1997, 2001, 2005, 2008, and 2010.\nHistory\nTivoli Gardens was developed in West Kingston, Jamaica, between 1963 and 1965 by demolishing and redeveloping the area of the Rastafarian settlement Back-O-Wall. The area was notorious in the 1950s as the worst slum in the Caribbean, where \"three communal standpipes and two public bathrooms served a population of well over 5,000 people.\"\nBecause its people were poor and lacked political power, West Kingston had been the site for many institutional and undesirable projects, some of which were hazardous to the environment. According to Desmond McKenzie, a senator from West Kingston, the area contained:\n\"the largest dump at Bumper Hall, on lands where St Andrew Technical High School is now situated; the abattoir which is still there; the largest sewage treatment plant; the largest public cemetery in the English-speaking Caribbean - the May Pen Cemetery; the morgue at that time; the two largest maternity and public hospitals in the English-speaking Caribbean - the Victoria Jubilee and Kingston Public hospitals; the Blood Bank; the largest market in the English-speaking Caribbean - the Coronation Market, and also 99 per cent of all the markets within the Corporate Area.\" He continued, \"It is also the site of 1/3 of all the funeral parlours in the Corporate Area; the oil refinery is situated in West Kingston; the Jamaica Railway Corporation is situated in West Kingston; the JOS bus depot at that time; it is today the site of the largest power plant - Hunts Bay.\"\nEdward Seaga entered the community in 1961. From the beginning, he encouraged youth to get training and education. In 1963 he was elected to office representing the Jamaica Labour Party (JLP), and was appointed as minister of development; he did not lose an election before his retirement in 2005. He facilitated redevelopment of the area as Tivoli Gardens.\nPhase I of Tivoli Gardens followed the 1963 removal of \"932 families, comprising 3,658 people\" who lived in the Foreshore Road area. From February to July 1966, two thousand people in Back-O-Wall were removed to build Phases II and III of Tivoli Gardens. In the process, some observers said that many supporters of the People's National Party (PNP) were displaced by those supporting the JLP.\nMcKenzie noted that people had to be able to buy some of the new houses. The new development was named after a theatre, which was later renamed as the Queen's Theatre. It was considered a model of community development, especially after the construction of a large community centre in the 1980s, which held such activities as a training centre for a range of skills, a sports field, a library, a base for the Tivoli Steel Band, and other facilities. Seaga also ensured that more schools were constructed in the area.\nOwing to problems with persistent poverty and the development of widescale, international drug trafficking, particularly between Jamaica and the U.S., Tivoli Gardens at the turn of the twenty-first century became the scene of repeated confrontations between gunmen and security forces in 1997, 2001, 2005, 2008 and during the 2010 Kingston unrest. The latter was associated with a manhunt for Christopher Coke, a drug crime boss, and head of the Shower Posse, who lived in Tivoli Gardens. After his capture, he was extradited to the U.S. in 2010 on drug charges.\nAnthropologist Deborah Thomas describes Tivoli Gardens as an example of a \"garrison community,\" defined as \"territorially rooted homogeneous voting communities in which political support is exchanged for contracts and other social welfare benefits … with the vote-benefits nexus mediated through the relationship between a politician and a local 'don.'\"\nMemorial\nA memorial called Lest We Forget, a black cross at the corner of Darling Street and Spanish Town Road, has been engraved with the names of four people who died in the 1997 incident and 27 people who died in the 2001 incident.\nNotable natives and residents\n*Christopher Coke, a drug crime boss of the Shower Posse gang, lived in Tivoli Gardens until his extradition to the U.S. in 2010 on drug charges. He pleaded guilty in 2011, and is serving a 23-year sentence in federal prison.\n*Desmond McKenzie, born here into poverty in 1952; his father abandoned the family, and he was raised by his mother and stepfather, both important influences. He rose to become elected as a senator in the Parliament of Jamaica and Mayor of Kingston, representing the Jamaica Labour Party (JLP).\n*Claude Massop, leader of the Shower Posse gang in the 1970s.\n*Ricardo Fuller, footballer\nIn popular culture\nThe 2014 novel A Brief History of Seven Killings by Marlon James, is partly set in Tivoli Gardens (renamed \"Copenhagen City\" for the purposes of the book.\nReferences"
    }
  ]
}