{
  "content": [
    {
      "type": "text",
      "text": "# Tiwari\n\nTiwari (), from Sanskrit 'tripāṭhin' (learned in three vedas), is a Hindu surname found in India and Nepal. Alternative spellings include Tiwary and Tewari.\nNotable people\nIndependence activists\n*Chandra Shekhar Azad (born Chandrashekhar Tiwari)\n*Adrian Cola Rienzi (born Krishna Deonarine Tiwari), Indian freedom fighter in Trinidad and Tobago\nSpiritual leaders\n*Dayananda Saraswati (born Mool Shankar Tiwari), founder of Arya Samaj\n*Maya Tiwari, Indo-Guyanese spiritual leader, international speaker and author\n*Sahadeo Tiwari, religious scholar\nInformation technology and business\nAcademics\n*Arun Tiwari, missile scientist, author and professor\n*Deepak Tiwari, Hindi editor of Global Investigative Journalism Network and former Vice Chancellor of Makhanalal Chaturvedi National University of Journalism, Bhopal\n*S Prakash Tiwari, biotechnologist, geneticist, agriculturalist\n*Siddhartha Paul Tiwari, UNESCO Chair on technology and sustainability\nCivil service\n*A. N. Tiwari, former Chief Information Commissioner of India\n*Sivakant Tiwari, former legal head officer of the Singapore Legal Service\nPoliticians\n*Captain B P Tiwari, Indian politician and former army officer\n*Brij Bhushan Tiwari, Indian politician from the Samajwadi Party\n*Ghanshyam Tiwari, Indian politician, education minister in the Government of Rajasthan\n*Ghanshyam Tiwari, Indian politician from the Samajwadi party, Bihar\n*Hari Shankar Tiwari, politician\n*Kamlesh Tiwari, politician\n*Kapil Narayan Tiwari, politician\n*Kaushal Tiwari, Indian politician\n*Manish Tewari, politician, former Minister of State in UPA Government\n*Manoj Tiwari, Indian politician, MP from Delhi, BJP State President.\n*Narayan Datt Tiwari, Indian politician, former chief minister of Uttar Pradesh and Uttarakhand\n*Ram Chandra Tiwari, Nepalese politician\n*Ravindranath Tewari, Indian politician, former cabinet minister of Uttar Pradesh\n*Sita Tiwaree, Thai politician\n*Shivanand Tiwari, Janata Dal (United) politician\n*Sriniwas Tiwari, Indian politician, former Madhya Pradesh speaker and minister\n*Sushil Kumar 'Indu' Tiwari, MLA from Madhya Pradesh\n*Suresh Tiwari, MLA from Uttar Pradesh, Bharatiya Janata Party\n*Rajani Tiwari, politician from Uttar Pradesh\n*Upendra Tiwari, Indian politician, minister in Uttar Pradesh government\nMilitary Officers\n*Amit Tiwari (air marshal), former Indian Air Force Commanding-in-Chief, Central Air Command.\nEntertainment\n*Anand Tiwari, actor and director in Hindi films\n*Ankit Tiwari, playback singer and music director\n*Bhushan Tiwari, Hindi actor\n*Dharmesh Tiwari, Indian film director\n*Gaurav Tiwari, paranormal investigator, pilot, UFOlogist, TV presenter, and actor\n*Girish Tiwari, scriptwriter, director, lyricist, singer, poet, organic culturist, writer, and social activist in Uttarakhand, India\n*Indira Tiwari, Indian actress\n*Kartik Aaryan Tiwari, Indian actor\n*Lalit Mohan Tiwari, Indian film and television actor\n*Laxmi Ganesh Tewari, Indian vocalist\n*Manish Tiwary, Indian film-maker\n*Mukesh Tiwari, actor in Hindi, Tamil and Telugu films\n*Nitesh Tiwari, director, script writer, lyricist\n*Ridhima Tiwari, television actress\n*Shweta Tiwari, Indian film and television actress and producer\n*Surbhi Tiwari, Indian television actress\n*Vindhya Tiwari, Indian show and film actress\nLiterature\n*Aditya Tiwari, Indian poet and LGBT rights activist\n*Bhim Nidhi Tiwari, Nepalese Bahun poet\n*Kapil Muni Tiwary, linguist and scholar\n*Siyaram Tiwari (writer), writer and scholar\nSports\n*Manoj Tiwary, Indian cricketer\n*Saurabh Tiwary, Indian cricketer\nOther\n*Dudhnath Tiwari, Indian sepoy who lived with the Andamanese tribes.\n*Ram Puneet Tiwary, Singaporean Indian and acquitted suspect of the Sydney double murders.\nReferences"
    }
  ]
}