{
  "content": [
    {
      "type": "text",
      "text": "# Tobinitai culture\n\nThe  is an archaeological culture of eastern Hokkaidō. This culture represented a hybridization, blending the influences of both the Okhotsk and Satsumon cultures. Over time, the Satsumon culture, having absorbed elements from the Tobinitai culture, evolved into what is now recognized as the Ainu culture, which spread throughout Hokkaido. The conventional name for this culture is derived from the Tobinitai site in Rausu, Nemuro Subprefecture, whose name in Ainu (tope-ni-tay) means \"forest where silver maples gather\".\nPottery\nTobinitai ceramics of the 10th to 13th centuries are represented by high pots with a gently curved profile and short beakers. Pots are of two varieties: (a) vessels with a distinct neck and straight inverted rim, typical of the Okhotsk culture; (b) vessels without distinct neck and pronounced rim, similar to Satsumon pottery. Vessels demonstrate a combination of ornamental traditions: bossed décor composed of horizontal rows of appliquéd thin wavy rolls of the so-called \"noodle\" design characteristic of late Okhotsk vessels is combined with typical Satsumon ornamentation consisting of incised slanting and crossing lines.\nHousing\nHouse building also displays a mixture of Satsumon and Okhotsk features. While some dwellings are pentagonal and have central hearths encircled by stones (following the Okhotsk tradition), others are square and have either hearths of the above type or kamado-type ovens.\nSubsistence\nThe Tobinitai people largely practiced the same type of economy as the Okhotsk people, fishing and sea mammal hunting being the principal occupations. However, neither pig bones nor artifacts of the continental type have been found at sites of that type in Hokkaido. Apparently, this represented a period of temporary stabilization. The main trade routes passed along the western coast, resulting in the Tobinitai people being relatively isolated.\nSee also\n* List of Historic Sites of Japan (Hokkaidō)\n* Rausu Municipal Museum\n* Okhotsk culture\n* Nivkh people\n* Ainu people\n* Satsumon culture\nReferences"
    }
  ]
}