{
  "content": [
    {
      "type": "text",
      "text": "# Tolkien and the Great War\n\nTolkien and the Great War: The Threshold of Middle-earth is a 2003 biography by John Garth of the philologist and fantasy author J. R. R. Tolkien's early life, focusing on his formative military experiences during the First World War.\nThe book was warmly welcomed by Tolkien scholars as filling in an important gap in biographical coverage. Christian scholars too admired the book, though Ralph C. Wood thought that it underplayed the importance of Tolkien's Christianity. A reviewer for the Western Front Association thought the account of Tolkien's military service especially good. The book was called \"plodding\"--> by Tolkien's biographer, Humphrey Carpenter, but praised by other commentators.\nThe book won the 2004 Mythopoeic Award for Inklings Studies. It has prompted scholars to examine the influence of the war on Tolkien's writings.\nContext\nJ. R. R. Tolkien was an English Roman Catholic writer, poet, philologist, and academic, best known as the author of the high fantasy works The Hobbit and The Lord of the Rings.\nJohn Garth read English at St Anne's College, Oxford. He trained as a journalist and worked for 18 years on newspapers including the Evening Standard in London. He then became a freelance author while continuing to contribute newspaper articles. He combined his longstanding interests in Tolkien and in the First World War to research and write this biography; he states that he is especially \"interested in how personal lives intersect with the big shocks and surges in history\", one of the elements of the book.\nBook\nPublication history\nTolkien and the Great War was published in 2003 by HarperCollins in the United Kingdom and Houghton Mifflin in the United States. It has been translated into Chinese, French, German, Italian, Polish, and Spanish.\nContents\nPart 1\nTolkien and the Great War is written in three parts. The first, in six chapters, examines J. R. R. Tolkien's early life. The account passes swiftly from his birth in South Africa in 1892 to his childhood in Birmingham, avoiding the Boer War through childhood illness. There, Tolkien began to study languages, learning French and Latin from his mother, finding Welsh and Greek attractive before the age of 10; soon he was reading Chaucer in Middle English. At Oxford, the sub-rector of Exeter College considered Tolkien \"very lazy\"; he hardly worked on his Classics degree, instead becoming fascinated with the Finnish Kalevala, retelling part of it in his William Morris-style verse-and-prose The Story of Kullervo. Garth describes Tolkien's childhood friendships and society including the TCBS, the Tea Club and Barrovian Society, consisting of Tolkien and his three closest friends – Christopher Wiseman, Robert Gilson, and Geoffrey Smith – and the early development of his mythology. Tolkien and Wiseman argue passionately about philology, and invent languages. Tolkien starts to write about \"Earendel the Evening Star\" in 1914. In an Oxford largely emptied of young men, Tolkien joins the University OTC rather than the army. The separated friends manage to meet, just once, in \"The Council of London\"; the meeting makes Tolkien conscious of the ambitions that drove him for the rest of his life. He starts to write fairy poetry, both joyful and lost in the past. This shifts into the grander tones of poems about the gigantic, ramparted city of Kôr, the start of his mythology.\nPart 2\nnear Thiepval where Tolkien fought on the Somme in September 1916]]\nThe second part describes in four chapters the military experiences of the TCBS in the trenches of the Western Front in 1916; Tolkien was attached to the Lancashire Fusiliers. Gilson was killed on the first day of the \"Big Push\" on the Somme. Tolkien's battalion, the 11th Lancashire Fusiliers, stayed in reserve for the first week. It went into action at Ovillers, Tolkien's company again staying in reserve to carry supplies, and Tolkien met Smith who had survived when the 3rd Salford Pals, part of the Lancashire Fusiliers, had been driven back to Authuille wood. Tolkien became battalion signals officer and often worked close to the front line. The battalion helped to win the Battle of Thiepval Ridge in late September, and took part in the capture of Regina Trench in late October. On 25 October, he went down with trench fever, and was sent home a fortnight later. Smith was wounded at the end of November and died of gas gangrene. Wiseman had joined the Royal Navy; he fought aboard HMS Superb in the Battle of Jutland in May 1916.\nPart 3\nThe third part, in two chapters, looks at Tolkien's wartime fantasy writings including \"The Lonely Isle\" of Tol Eressëa. Back in Birmingham, he invents Gnomish, the precursor of the elf-language Sindarin. Garth glosses this as the language of adventure, finding it fitting that it appeared after the Somme, whereas Qenya, the language of ancient knowledge, began when Tolkien was a student. He began to write fluently, creating The Fall of Gondolin. Garth likens Tolkien's army of \"beasts like snakes and dragons of irresistible might that should over-creep the Encircling Hills and lap that plain and its fair city in flame and death\", the monstrous bronze assault dragons in that tale, to the tanks of the Somme. By early 1917, Tolkien had written The Book of Lost Tales, with its elaborate frame story for the time-travelling Eriol to hear in Kortirion (corresponding to Warwick), to portray the tales as part of a mythology for England.\nPostscript\nby Tom Loback ]]\nThe book ends with a postscript, a full chapter in length, in which Garth analyses the effect of the war on Tolkien and his Middle-earth writings, arguing that far from being escapism, his fantasy \"reflects the impact of the war\". Garth begins by noting that \"Tolkien produced a mythology, not a trench memoir. Middle-earth contradicts the prevalent view of literary history, that the Great War finished off the epic and heroic traditions in any serious form\". He describes how Tolkien went against the tide of modernism followed by the war poets, preferring romances and epic adventures from writers like William Morris and Rider Haggard, and medieval poetry. Garth writes that Tolkien chose to use a \"high diction\", something that he knew could be abused, and created an \"even-handed depiction of war as both terrible and stirring\". He notes that the fact that Tolkien saw battle \"may explain the central or climactic role of battles in his stories\".}}\nMaterials\nThe text is accompanied by monochrome photographs, showing Tolkien at school and two of his early artworks, with portraits of all four of the TCBS friends in uniform. There are four landscape photographs of the battle area from 1916, showing exhausted soldiers in trenches at Ovillers, British soldiers in the flooded Ancre valley, and German prisoners at Thiepval. The last image is of Tolkien from the 1930s. The book is supported with full academic notes and bibliography, maps of the area around the Somme and of the places where Tolkien and his TCBS friends fought in the battle, and a chronology from Tolkien's arrival at the Somme in June 1916 to his return to England on 8 November that same year.\nReception\nScholarly\n(pictured) on the Western Front in 1916.]]\nTolkien and the Great War was warmly welcomed by scholars. The Tolkien scholar Janet Brennan Croft, reviewing the book for World Literature Today, wrote that Garth had ably portrayed Tolkien's early life with his close friends, using their own papers and their British Army company records. She found the first part of the book \"somewhat leisurely\", but the account of Tolkien's training and battlefield experience was \"gripping\". Luke Shelton, editor of Mallorn, the journal of the Tolkien Society, called Tolkien and the Great War an excellent book on how the First World War might have shaped Tolkien's thought. Will Sherwood, writing in the Journal of Tolkien Research, calls the book, along with Croft's 2004 War and the Works of J.R.R. Tolkien, \"essential, landmark publications on the topic [that] have sparked further [re]searches into Tolkien's wartime experiences.\" Chad Engbers, in The Lion and the Unicorn, writes that Garth, \"like most excellent literary biographers\", combines internal and external histories throughout, and comments that it is \"strange\" that nobody had thought of writing a biography of Tolkien's war years before, all the earlier biographies such as Humphrey Carpenter's, Joseph Pearce's, or Michael White's focusing on the \"older Tolkien, a kindly, wrinkled Oxford don in a tweed coat\". The scholar of English literature Robert Tally, discussing whether Tolkien demonized the enemy, notes that in the book Garth suggests that Tolkien may have linked his early ideas of goblins and trolls to Germans, but that Garth makes clear that Tolkien later expressed clear anti-racist views.\nThe scholar of humanities Brian Rosebury, reviewing the work for Tolkien Studies, states that Garth meets the dismissive critics of Tolkien \"head-on, denying, or at least minimizing, the alleged distance between Tolkien's creativity and the 'genuine' myths and legends of pre-modern peoples\", making use of the \"remote and dispersed\" materials available, such as the Earendel line of evidence, to \"create a redemptive vision for the present\", just as, he notes, the Beowulf poet did. In Rosebury's view, Garth's close examination of Tolkien's formative years supports the arguments defending his approach against the attacks made upon him.\ns like Siegfried Sassoon.]]\nThe historian Bradley J. Birzer, reviewing the \"excellen[t]\" book for VII, writes that Garth wisely begins by noting how strange it was that Tolkien should have begun his \"monumental mythology\" in the war, the \"crisis of disenchantment that shaped the modern world\". Birzer identifies three major themes in the book: that male friendship gave a \"true and proper order\" to the world; that the interlinked war and modernity \"destroy almost all tradition and, possibly, all friendship\"; and that myth revitalizes society. In his view, the book's account of the importance of friendship demonstrates \"Garth's originality and genius\", while the other two themes had been well covered in earlier works. He comments that the TCBS anticipated the Inklings, and argues that Tolkien, as much as his friend C. S. Lewis, was vital to the Inklings, as was Owen Barfield's Poetic Diction. Birzer criticises the style of invisible footnoting, combined with the abbreviations of the sources, which in his view made the book exceptionally \"unfriendly\". Further, he writes, Garth overlooks Clyde Kilby's memoir Tolkien and the Silmarillion. All the same, he calls the book essential for any scholar of Tolkien or the Inklings.\nShaun Hughes, reviewing the work for Modern Fiction Studies, calls the detail of Tolkien's military training in England and his movements in France \"one of the particular strengths\" of the book, which he describes as one of the most important studies on Tolkien. He notes that where Carpenter's biography made it seem that Tolkien only took part \"in one attack, and that a failure\", Garth demonstrates that Tolkien saw far more action than that, and that luck was with him time after time. Hughes observes that Tolkien must have felt the resonance of Beowulf's words to Unferth, , that \"fate often saves / an undoomed man when his courage prevails\" [Beowulf lines 572–573], despite his feeling that he lacked courage. He comments that the ironic \"disenchanted viewpoint\" of other war poets such as Wilfred Owen and Siegfried Sassoon \"robs the narrator of agency\", or in Garth's words \"stripped meaning from what many soldiers saw as the defining experience of their lives\". Hughes contrasts this with Tolkien's portrayal of characters like Túrin Turambar who are heroes not because they always succeed, or have no flaws, but because they never give up. In this way, he argues, \"Tolkien restores balance to the narratives of World War I\", enabling the discussion of contested subjects like courage, glory, honour, and majesty, in Garth's words again \"under such stress that they often fracture, but are not utterly destroyed\". In Hughes's opinion, where Tolkien had not even been rated as a war poet, it would be ironic if he eventually came to be seen as the greatest of those writers.\nChristian\nTolkien's Roman Catholic faith, reflected in his Middle-earth writings, has attracted the interest of scholars of Christianity to his writings. Terrence Neal Brown, in a review for Religion and Literature, writes that readers may recognise in the book \"the sheer complexity of Tolkien's creative origins\", noting the mutual affection concealed behind \"the impersonal initials 'TCBS'\". He praises Garth for guiding the reader through \"the sharp distinctiveness of Tolkien's literary originality through shoals of styles\", noting in Garth's words Tolkien's \"real taste for fairy-stories\" and his \"maverick taste\", and describing him as the \"most dissident of twentieth-century writers\". In Brown's view, Garth locates Tolkien in the tradition of Great War literature, noting that far from being escapist or fantastical, his \"disgust, anger, and condemnation\" underpin his Middle-earth writings. He cites Garth's conclusion that \"Middle-earth, I suspect, looks so engagingly familiar to us, and speaks to us so eloquently, because it was born with the modern world and marked by the same terrible birth pangs\". He describes the book as \"illuminati[ng] a great artist's life\".\nwith its  shell at Thiepval, September 1916]]\nThe Christian scholar Ralph C. Wood, reviewing 6 books about Tolkien for Christianity and Literature, calls Garth's work \"so well done that, along with Humphrey Carpenter's biography of Tolkien and Tom Shippey's The Road to Middle-earth, it constitutes a third essential work for Tolkienian studies\". In Wood's view, Garth argues that the 20th century began with the \"triumph of the murderous machine\" in the First World War, with its \"tanks and airplanes and howitzers\", entering a nihilistic \"classical age of war\", in Nietzsche's phrase. Wood writes that Garth brilliantly links these moral terrors to the moral and historical concerns behind Tolkien's philology, with his view of ancient Northern courage on a dangerous hostile Earth that was full of \"faery—elven creatures ... ambassadors from the natural world\".  Wood notes, too, that Garth incidentally shows Tolkien's implicit postmodernism, believing for instance that languages and cultures are rooted in time and place, and that geography determines much of how people think and act. Tolkien loved the Germanic in Northern mythology, but hated Nazism; to him, the spirit of that mythology was \"not preening victory so much as somber defeat\", remaining cheerful in the face of loss.\nWood finds Garth \"sometimes overly minute\" in describing Tolkien's war experience, but thinks the book \"so carefully and convincingly wrought\" that he does not wish to find fault with it.  All the same, he feels that Garth \"downplays the Christian character of Tolkien's mythic vision\", not remarking how central Christianity was in his life and work. He thinks Garth mistaken in denying that the elves have freedom, as a Christian must believe (since elves have souls). And he finds especially problematic Garth's separation of Tolkien from the war poets like Robert Graves and Siegfried Sassoon who hated and condemned the horrors they had seen: \"Garth reads Tolkien as giving, instead, a more 'balanced' view of the war, as 'both terrible and stirring'\". In Wood's view Garth is here missing \"the overwhelming mood of sadness that permeates the whole of ... The Lord of the Rings\". Wood finds Shippey \"far more incisive\" in grouping Tolkien with critics of modern warfare like William Golding, Ursula LeGuin, and George Orwell.\nMilitary\nDavid Filsell, reviewing the book for the Western Front Association, writes that Garth \"convincingly\" claims that Tolkien \"kept enchantment alive\" through his experiences in the 1914-1918 war. Filsell notes that the work grew from five years of research by Garth, who combined \"his twin great interests\" – in Tolkien and the war. He suspects that many readers will find that parts 1 and 3 \"inform them too well\" about the development of Tolkien's poetry and mythology; but in his view Garth's account of Tolkien's \"service as a regimental signals officer during the battles of the Somme, is especially well realised\". He notes Garth's acknowledged debt to the histories of Michael Stedman, Alf Peacock and Paul Reed. He praises Garth's accounts, too, of Tolkien's three close friends.\nPopular\nElizabeth Hand, in The Washington Post, called the book \"a seminal work that underscored how Tolkien’s fiction, far from being a bit of donnish fancy, was in many ways rooted in his experiences at the Battle of the Somme and his observations of an irrevocably damaged world in the aftermath of World War I.\"\nTolkien's earlier biographer, Humphrey Carpenter, reviewing the book for The Sunday Times, states that Garth is \"absolutely right that this was a crucial period for Tolkien, and it is also a moving story\". In his view, Garth quotes far too much of Tolkien's \"abundant\" early poetry for the TBCS, making the book \"quite literally plodding, since he follows relentlessly in the steps of Tolkien and the TCBS as they converge on the Western Front\". He finds \"a few fresh ideas\" largely \"swamped\" by details of correspondence between the TCBS friends. Replying to Carpenter, the Tolkien scholar and linguist Carl F. Hostetter described it as \"a remarkably obtuse review ... of what is in fact an thoughtful, engaging, and above-all engaged study of what lies at the roots of Tolkien's power as an author, which power Mr. Carpenter himself rightly recognizes and defends.\"\nPrizes and impact\nFor the book, Garth won the 2004 Mythopoeic Award for Inklings Studies.\nTolkien and the Great War'' influenced much Tolkien scholarship in the subsequent decades. By 2021, a review of Janet Brennan Croft and Annika Röttinger's 2019 edited book \"Something Has Gone Crack\": New Perspectives on J.R.R. Tolkien in the Great War was able to state that each of the 16 essays in the collection was responding to \"Garth's seminal [work]\". The essays variously examined the course of the Great War as seen in the fictional wars of Middle-earth; how Tolkien transmuted his experience into art; the wartime origins of Tolkien's legendarium; and the issues of race, class, gender, and sexuality in wartime. Garth contributed one essay, \"Revenants and Angels: Tolkien, Machen, and  Mons\", to the collection.\nNotes\nReferences\nPrimary\nSecondary\nBibliography\n*"
    }
  ]
}