{
  "content": [
    {
      "type": "text",
      "text": "# Tom Stewart (rugby union)\n\n|    birth_place = Belfast, Northern Ireland\n|         height =\n|         weight =\n|         school = Belfast Royal Academy\n|     university =\n|      relatives =\n|       position = Hooker\n|    currentclub = Ulster\n|         years1 = 2021–\n|         clubs1 = Ulster\n|          apps1 = 59\n|        points1 = 145\n|      repyears1 = 2020\n|       repteam1 = Ireland U20\n|       repcaps1 = 2\n|     reppoints1 = 0\n|      repyears2 = 2022\n|       repteam2 = Emerging Ireland\n|       repcaps2 = 2\n|     reppoints2 = 0\n|      repyears3 = 2023–\n|       repteam3 = Ireland\n|       repcaps3 = 5\n|     reppoints3 = 0\n|     clubupdate = 25 October 2025\n|      repupdate = 12 July 2025\n| ru_sevensnationalyears1 =\n|  ru_sevensnationalteam1 =\n|  ru_sevensnationalcomp1 =\n|         ru_sevensupdate =\n}}\nTom Stewart (born 11 January 2001) is a professional rugby union player who plays as a hooker for United Rugby Championship club Ulster and for the Ireland national rugby union team.\nYouth\nBorn in Belfast, Northern Ireland, Stewart attended Belfast Royal Academy and was named Ulster Schools Player of the Year in 2019, and captained Ulster at under 18 level. He joined the Ulster Rugby academy in June 2019. He was named in the Ireland squad for the 2020 Six Nations Under 20s Championship, starting in the wins against Scotland and Wales before the tournament was cancelled due to the COVID-19 pandemic. In January 2021 he signed a one-year development contract with Ulster, intended to be upgraded to a senior professional contract for the 2022–23 season.\nCareer\nStewart was named in the Ulster Rugby senior squad for the 2021–22 season, and made his senior debut off the bench in an away defeat to Ospreys on 4 December 2021. He scored his first try in a 48-12 home victory against Cardiff on 4 March 2022. He was selected for the Emerging Ireland squad for the Toyota Challenge in South Africa in September 2022.\nAfter scoring 7 tries in 11 appearances for Ulster in the 2022–23 season, he was called up to the Ireland squad for the 2023 Six Nations Championship, as cover for the injured Rónan Kelleher. That year Stewart would go on to break the United Rugby Championship single season try-scoring record, with his second hat trick of the year in a victory over Dragons, bringing his season tally to 16 tries. This beat the 14 scored by Edinburgh's Tim Visser in 2010-11 and the Cheetahs' Rabz Maxwane in 2018-19, and earned him the URC's Top Try Scorer award. He also won the URC's Next-Gen Player of the Season award for players under 23 who have fewer than five international caps. He was called up to Ireland's preliminary 42-man squad ahead of the 2023 Rugby World Cup, made his international debut off the bench in the warm-up game against Italy on 5 August 2023, and his first international start on 26 August against Samoa.\nReferences\nExternal links\n*\n*[https://ulster.rugby/player/tom-stewart Player Profile, Ulster Rugby]\n*[https://www.unitedrugby.com/clubs/ulster/tom-stewart Player Profile, United Rugby Championship]\n*"
    }
  ]
}