{
  "content": [
    {
      "type": "text",
      "text": "# Tom Stewart Lee\n\n| birth_place               = Jackson, Mississippi, U.S.\n| death_date                =\n| death_place               =\n| death_cause               =\n| resting_place             =\n| resting_place_coordinates =\n| citizenship               =\n| nationality               =\n| party                     =\n| otherparty                =\n| height                    =\n| spouse                    =\n| partner                   =\n| relations                 =\n| children                  =\n| parents                   =\n| mother                    =\n| father                    =\n| relatives                 =\n| residence                 =\n| education                 = Mississippi College (BA)University of Mississippi (JD)\n| footnotes                 =\n}}\nTom Stewart Lee (born April 8, 1941) is a senior United States district judge of the United States District Court for the Southern District of Mississippi.\nEducation and career\nLee was born in Jackson, Michigan. He received a Bachelor of Arts degree from Mississippi College in 1963 and a Juris Doctor from the University of Mississippi Law School in 1965. He was in the United States Army Reserve Captain, JAG Corps from 1965 to 1973. He was in private practice in Forest, Mississippi from 1965 to 1984. He was a prosecuting attorney of Scott County, Mississippi from 1968 to 1971. He was a judge of the Scott County Youth Court in Forest, Mississippi from 1979 to 1982. He was a municipal judge for the city of Forest, Mississippi in 1982.\nFederal judicial service\nLee was nominated by President Ronald Reagan on May 15, 1984, to a seat on the United States District Court for the Southern District of Mississippi vacated by Judge Dan Monroe Russell Jr. He was confirmed by the United States Senate on June 11, 1984, and received his commission the same day. He served as chief judge from 1996 to 2003. He assumed senior status on April 8, 2006.\nReferences\nSources\n*\n|years=1984–2006}}\n|years=1996–2003}}"
    }
  ]
}