{
  "content": [
    {
      "type": "text",
      "text": "# Tom Stewart (Australian footballer)\n\n| birth_place =\n| death_date =\n| death_place =\n| originalteam =  (VFL)\n| draftpick = No. 40, 2016 national draft\n| debutdate = Round 1, 2017\n| debutteam =\n| debutopponent =\n| debutstadium = Domain Stadium\n| height = 190 cm\n| weight = 88 kg\n| position = Defender\n| currentclub =\n| guernsey = 44\n| years1 = 2017&ndash;\n| club1 =\n| games_goals1 = 191 (6)\n| statsend = 2025\n| careerhighlights =\n* AFL premiership player: 2022\n*5× All-Australian team: 2018, 2019, 2021, 2022, 2023\n* 2× Carji Greeves Medal: 2021, 2023\n* AFLCA Young Player Award: 2018\n*St Joseph's College Team of Champions\n}}\nThomas Stewart (born 15 March 1993) is a professional Australian rules footballer playing for the Geelong Football Club in the Australian Football League (AFL). At  tall and , he plays as a running half-back who can play on both oversized and undersized opponents. Stewart played for the Geelong Falcons and South Barwon Football Club as junior, winning consecutive premierships in 2012 and 2013 with South Barwon.\nStewart was drafted by the Geelong Football Club with their second selection and fortieth overall in the 2016 national draft. He made his debut in the forty-two point win against  in the opening round of the 2017 season at Domain Stadium. Since then Stewart he has been a 5-time All-Australian and was awarded the AFLCA Young Player Award in 2018.\nEarly football\nAs a teenager, Stewart played for the Geelong Falcons in the TAC Cup. After going undrafted in numerous drafts went and played for his local club in the Geelong Football Netball League.\nStewart played football for South Barwon Football Club which currently competes in the Geelong Football Netball League, the major regional league in the region. In 2013, Stewart was a part of South Barwon's premiership which was led by playing coach and Australian Football Hall of Famer, Matthew Scarlett. In 2016, Stewart's performances for the Geelong Football Club's VFL team landed him on the radar of AFL club recruiters. He was drafted at pick 40 in the 2016 national draft by the Geelong Football Club.\nAFL career\n2017–2019: Early career\nStewart made his debut for  in the opening round of the 2017 AFL season, in the team's forty-two point win against . On debut, Stewart collected 10 disposals, a rebound-50, a contested mark and 2 tackles. In his debut season, Stewart would become a regular in Geelong's side, holding down his position as a half-back flanker. Stewart underwent surgery to repair a fractured eye socket he suffered in Geelong's dramatic round 14 win over Fremantle. He was set to miss up to 6 weeks but was able to return for Geelong's loss to  in Round 18. He would go onto to play his first final in Geelong's qualifying final loss to  on Friday 8 September 2017. Stewart had an average performance on the night, collecting 11 disposals, 4 rebound-50s and 5 tackles. Stewart would finish his debut year with 21 matches, averaging 14.7 disposals, 2.8 rebound-50s and 4.1 marks a game.\n| width = 25%\n| align = right\n}}\nThe 2018 AFL season shaped to be Stewart's breakout season which saw him become one of the league's best defenders. After maintaining a consistent position in Geelong's defensive six during the 2017 season, only missing games to injury, Stewart continued this effort for the 2018 season. In Geelong's round 3 loss to  he received a vote in the AFL Coaches Association Player of the Year award after recording 20 disposals, 13 effective kicks and 3 rebound-50s. The next week, Stewart would record, 20 disposals, 6 rebounds-50s and 8 marks, one of which was contested in Geelong's round 4 victory over . This would be a breakout game for the young defender as it saw him earn his first brownlow vote and 7 AFL Coaches Association Player of the Year votes. On 12 April, Stewart would re-sign a contract extension with Geelong to remain at the club until the end of 2019. Stewart had another outstanding game in the cats win over  in round 8. Stewart collected 28 disposals, 7 rebound-50s and 9 marks, 2 of which were contested. For this performance, earned Stewart 9 AFL Coaches Association Player of the Year votes and one brownlow vote, raising his career total to 3 votes. For his remarkable season, Stewart was awarded with numerous accolades. He won the AFLCA Young Player Award, which takes the total number of coaches votes of all players in their first two seasons with the highest vote-getter winning. Steward won the award with 40 votes, 17 higher than second place. He would also earn his first All-Australian selection as a back pocket and finished sixth in the Carji Greeves Medal.\nBefore the start of the 2019 AFL season, Stewart was elevated to Geelong's seven men leadership team. Geelong captain Joel Selwood praised Stewart's growth from a mature-age draftee to All-Australian and leader at the club within a span of three years. \"Mid last year he asked to be a part of meetings and come in and stuff like that,\" Selwood said. \"He was at a stage where his footy was taking care of itself so we didn't want a burden on him but he was relishing the job, so this was just the next step for him.\" Stewart started the 2019 AFL season as well as he had ended the 2018 season. In his first 4 matches of the season, Stewart averaged 25.5 disposals, 10.5 rebound-50s and 7.3 marks at game. This spectacular form continued all throughout the season with Stewart finishing the season averaging 23.2 disposals, a league high 8.0 rebound-50s and 7.4 marks a game. For his best season thus far, Stewart was rewards with his second All-Australian blazer and a third-place finish in Geelong's best and fairest count.\n2020–: Continued success\nAfter establishing himself as one of the premier defenders in the league, Stewart continued with his great form into the COVID-19 pandemic-interrupted 2020 AFL season. Stewart would play in all 4 of Geelong's 2020 finals including the 2020 AFL Grand Final, where Geelong would go down by 31 points to . This would be Stewart's first grand final appearance and was among the best for his side, collecting 20 disposals, 10 rebound-50s and 6 marks. Stewart finished 14th in Carji Greeves Medal. Already contracted until 2021, Stewart signed a new contract which added three years to his existing deal, keeping him at Geelong until the end of 2024. In 2020 he was named in the St Joseph's College Team of Champions, recognising the best VFL/AFL players to have attended the school.\nStewart entered the 2021 AFL season ranked in the 'elite' category among the league's defenders by the AFL's official statistical partner Champion Data. Stewart's 2021 season shaped to be his best season yet. His numbers in disposals and marks were at a career high. He was named in the AFL media's mid-season All-Australian team on a back pocket. In round 14, Stewart had a career best game in Geelong's after the siren win to the . in the match, Stewart tied the record for the most intercept marks in the last 20 years, with 10, and had 15 intercept possessions in total. It wasn't just about his defensive efforts however; finishing with 27 disposals and six score involvements, he was able to launch several Cats attacks, including one last-quarter goal. Stewart was praised by many after the game including his coach, \"It's one of the best games I've seen a half-back flanker play,\" Chris Scott said post-game. For his effort he received 9 AFL Coaches Association Player of the Year votes. On 14 August Stewart injured his foot at training in a marking contest. The 28 year old underwent surgery after suffering Lisfranc damage. This meant that Stewart would miss the rest of the season, including Geelong's finals series. After a career best season, with Stewart averaging 24.0 disposals, 6.1 rebound-50s and a league high 8.9 marks a game, he was awarded his third All-Australian in just five years.\nDespite Stewart missing the final few games of the season to injury, he still claimed his maiden Carji Greeves medal.\nIn the 2022 AFL season during a round 15 match against Richmond Stewart bumped Dion Prestia high, which saw Stewart suspended for four matches. Stewart won his first AFL premiership with Geelong in 2022 and earnt his fourth All-Australian selection.\nDespite a disappointing year for Geelong in 2023, Stewart remained a standout for the team throughout the whole year. He was rewarded with his fifth All-Australian selection in the 2023 All-Australian team, and winning his second Carji Greeves Medal. Stewart's fifth All-Australian selection in 2023 gave him the record for the fewest games played (148) by an AFL player to reach five All-Australian selections.\nStewart played 20 matches in the 2025 season. He missed the club's loss in the 2025 AFL Grand Final after suffering a concussion in the preliminary final the previous week.\nPlayer profile\nStewart plays as a rebounding half-back and back pocket. He is known for his ability to break through oppositions forward defensive structures with his elite kicking skill. His marking ability allows him to be one of the best intercept players in the competition being ranked elite by Champion Data for intercept marks and Contested Defence One on Ones. Stewart is also known for both his on-field and off-leadership, with pundits tipping Stewart to be Geelong's next captain.\nStewart was named the seventh best defender and 42nd best player overall in the Herald Sun's list of the best players pre-2020 season.\nStatistics\nUpdated to the end of the 2023 season.\n|-\n| 2017 ||  || 44\n| 21 || 2 || 2 || 189 || 120 || 309 || 86 || 55 || 0.1 || 0.1 || 9.0 || 5.7 || 14.7 || 4.1 || 2.6 || 0\n|-\n| 2018 ||  || 44\n| 22 || 1 || 1 || 296 || 146 || 442 || 132 || 46 || 0.0 || 0.0 || 13.5 || 6.6 || 20.1 || 6.0 || 2.1 || 4\n|-\n| 2019 ||  || 44\n| 25 || 0 || 2 || style=\"background:#CAE1FF; width:1em\" | 473† || 107 || 580 || 185 || 42 || 0.0 || 0.1 || 18.9 || 4.3 || 23.2 || 7.4 || 1.7 || 3\n|-\n| 2020||  || 44\n| 18 || 0 || 1 || 263 || 81 || 344 || style=\"background:#CAE1FF; width:1em\" | 125† || 23 || 0.0 || 0.1 || 14.6 || 4.5 || 19.1 || 6.9 || 1.3 || 1\n|-\n| 2021 ||  || 44\n| 20 || 0 || 3 || 378 || 102 || 480 || 178|| 21 || 0.0 || 0.1 || 18.9 || 5.1 || 24.0 || bgcolor=CAE1FF | 8.9† || 1.1 || 8\n|-\n| scope=row bgcolor=F0E68C | 2022# ||  || 44\n| 20 || 0 || 1 || 354 || 111 || 465 || 146 || 40 || 0.0 || 0.1 || 17.7 || 5.6 || 23.3 || 7.3 || 2.0 || 9\n|-\n| 2023 ||  || 44\n| 22 || 1 || 0 || 408 || 99 || 507 || 182 || 43 || 0.0 || 0.0 || 18.5 || 4.5 || 23.0 || 8.2 || 1.9 || 6\n|-\n| 2024 ||  || 44\n| 23 || 1 || 3 || 358 || 137 || 495 || 140 || 68 || 0.0 || 0.1 || 15.6 || 6.0 || 21.5 || 6.1 || 3.0 || 12\n|-\n| 2025 ||  || 44\n| 20 || 1 || 0 || 296 || 75 || 371 || 147 || 29 || 0.1 || 0.0 || 14.8 || 3.8 || 18.6 || 7.4 || 1.5 || 0\n|- class=sortbottom\n! colspan=3 | Career\n! 191 !! 6 !! 13 !! 3015 !! 978 !! 3993 !! 1321 !! 367 !! 0.0 !! 0.1 !! 15.8 !! 5.1 !! 20.9 !! 6.9 !! 1.9 !! 43\n|}\nNotes\nHonours and achievements\nTeam\n* AFL premiership player (): 2022\n* McClelland Trophy (): 2019, 2022\nIndividual\n* 5× All-Australian team: 2018, 2019, 2021, 2022, 2023\n*Carji Greeves Medal: 2021, 2023\n* AFLCA Young Player Award: 2018\n* Geelong F.C. Best Young Player Award: 2017\nReferences\nExternal links\n*\n*\n| titlestyle = background:#003; color:gold\n| list1 =\n}}"
    }
  ]
}