{
  "content": [
    {
      "type": "text",
      "text": "# Tomb Inscription of the Ming Dynasty Prince Lu\n\nThe \"Tomb Inscription of the Ming Dynasty Prince Lu\" (皇明監國魯王壙志) is the funerary epitaph of Zhu Yihai (朱以海, 1618–1662), the Prince of Lu, during the waning years of the Ming Dynasty. Unearthed in Kinmen in 1959, this tomb inscription provides detailed information about the life of Prince Lu. In 2011, it was designated a national treasure by the Bureau of Cultural Heritage, Ministry of Culture.\nDiscovery Process\nIn 1959, during military operations for stone quarrying and construction of military facilities near Gugang Lake (古崗湖) on the outskirts of Kinmen, the Nationalist Chinese army accidentally discovered an ancient tomb. Subsequent verification confirmed that it was the tomb of Zhu Yihai, also known as Prince Lu, the ninth-generation grandson of Zhu Tan (朱檀), the tenth son of the founding emperor of the Ming Dynasty. The tomb belonged to Zhu Shouyong (朱壽鏞), the son of Lu Wang Zhu Tan, and was later recognized as the burial site of Zhu Yihai, the Prince of Lu, during the Southern Ming period.\nAccording to the account in the \"Record of the Discovery of the Tomb of the Ming Dynasty Prince Lu\" (發現皇明監國魯王墓記), on August 19, 1959, during a military project for detonating and quarrying stones outside the old city of Kinmen, a stone tablet originally buried underground was exposed after an explosion. The military officers at the scene continued digging downward and discovered the tomb cover and an intact uncarved stone tablet (initially presumed to be a tombstone) about one meter below the surface, confirming the presence of a sturdy ancient tomb constructed from San-Ho-Tu (三合土).\nOn August 22, military officers chiseled a hole behind the stone tablet to inspect it and found another stone tablet inside. This second tablet, made of basalt, measured 63.5&nbsp;cm in height, 47&nbsp;cm in width, and 5&nbsp;cm in thickness. After a simple cleaning, the inscription \"皇明監國魯王壙誌\" (Tomb Inscription of the Ming Dynasty Prince Lu) was revealed. Subsequently, a task force comprising Kinmen County government officials, scholars, local gentry, and military personnel was established to conduct further excavation and conservation of the Prince Lu's tomb. The unearthed artifacts were handed over to the Kinmen County government for safekeeping, while the \"Tomb Inscription of the Ming Dynasty Prince Lu\" was transferred to the National Museum of History in Taiwan for preservation.\nHistorical significance\nThe discovery of the Tomb Inscription of the Ming Dynasty Prince Lu holds significant historical importance. Prior to the unearthing of this inscription, various historical records and legends circulated, suggesting that Zheng Chenggong (鄭成功, Koxinga) \"submerged the Prince of Lu in Nan'ao\" or \"relocated the Prince of Lu to Penghu,\" while some even claimed that Zheng Chenggong and the Prince of Lu had conflicts, with allegations of the prince being killed. The discovery of the \"Tomb Inscription of the Ming Dynasty Prince Lu\" in 1959 corrected historical inaccuracies related to the life of the Prince of Lu.\nThe inscription, with its clear record of the cause and timing of the Prince of Lu's passing, stated, \"The Prince of Lu had a long-standing ailment and, in the eleventh month of the Renyin (壬寅) year, he choked on phlegm and passed away.\" This overturned the Ming Dynasty historical account that falsely claimed the prince was submerged in the sea by Zheng Chenggong, clarifying the misconceptions surrounding disrespect towards the Ming royal family and the alleged plot to murder the Prince of Lu.\nThe inscription's contribution to the study of Southern Ming history and the 17th-century Taiwan during the Ming Zheng period makes it a valuable primary source with cultural and academic significance. As a result, in 2011, it was designated as a national treasure for its role in providing essential historical material for research into the history of Southern Ming and the Ming Zheng era in Taiwan during the 17th century.\nReferences"
    }
  ]
}