{
  "content": [
    {
      "type": "text",
      "text": "# Tommy Williams (Queensland politician)\n\n|image              = T.L. Williams one of the soldiers photographed in The Queenslander Pictorial supplement to The Queenslander 1917.jpg\n|caption            = T.L. Williams one of the soldiers photographed in The Queenslander Pictorial supplement to The Queenslander 1917\n| constituency_AM1    = Port Curtis\n| assembly1           = Queensland Legislative\n| term_start1         = 11 June 1932\n| term_end1           = 3 May 1947\n| predecessor1        = Frank Butler\n| successor1          = Jim Burrows\n| alongside1          =\n|birth_date         =\n|birth_place        = Bundamba, Queensland, Australia\n|death_date         =\n|death_place        = Toowoomba, Queensland, Australia\n|restingplace       =\n|birthname          = Thomas Lewis Williams\n|nationality        = Australian\n|party              = Labor\n|otherparty         =\n|spouse             = Lilian Maud Garrard (m.1915 d.1966)\n|known_for          =\n| occupation        = School teacher\n| relations         =\n| alma_mater        =\n}}\nThomas Lewis Williams''' (21 December 1886 – 17 August 1970) was a member of the Queensland Legislative Assembly.\nBiography\nWilliams was born at Bundamba, Queensland, the son of Thomas Williams and his wife Diane (née Philip). He was educated at Bundamba State School Newtown State School and St Mary's College, Ipswich. On leaving he was a school teacher and taught at various state schools around southern Queensland before working for the Queensland Times and Daily Mail newspapers.\nIn April 1908 he married Lilian Maud Garrard (died 1966) and together had two sons and three daughters. Williams died at Toowoomba in August 1970.\nPublic life\nWilliams, representing the Labor, won the seat of Port Curtis at the 1932 Queensland state election. He held it for the next fifteen years only to lose Labor pre-selection before the 1947 Queensland state election.\nHe held various roles in the parliament including:\n* Government Whip   1932–1947\n* Secretary for Agriculture and Stock   1942–1946\n* Secretary for Public Instruction      1946–1947\nHe was also a councilor on the Gayndah Town Council. He was also a member of the Royal Historical Society and Royal Geographical Society, and honorary inspector for the Queensland Society for Prevention of Cruelty.\nReferences"
    }
  ]
}