{
  "content": [
    {
      "type": "text",
      "text": "# Tommy Battle\n\n| birth_place         = Birmingham, Alabama, U.S.\n| death_date          =\n| death_place         =\n| party               = Republican\n| spouse              =\n| children            = 1\n| education           = University of Alabama,Tuscaloosa (BS)\n}}\nThomas Massengale Battle Jr. (born December 3, 1955) is an American businessman serving as the 67th mayor of Huntsville, Alabama. His first term began November 3, 2008, and he has since been reelected four times.\nEarly life and education\nBattle was born in Birmingham, Alabama, on December 3, 1955. As a young man he worked for his father's restaurant and attended Berry High School (now Hoover High).\nBattle attended the University of Alabama, in Tuscaloosa, to study business, where he participated in the Student Government Association and the debate team and joined the Alabama Republican Party.\nAfter graduating college with a Bachelor of Science in business, Battle became a manager for Britling on the Highland in Birmingham. Battle moved to Huntsville in 1980, where he became a real estate developer and was elected to one term on the city council from 1984 to 1988. During this time, Battle met Eula Sammons, and his son Andrew was born. Battle left the city council to run for mayor, losing in a run-off against Democratic candidate Steve Hettinger in 1988.\nAfter this election loss, Battle started Battle Real Estate and owned or partnered in several retail and real estate firms.\nPolitical career\nMayoral elections\n2008 election\nBattle announced his mayoral candidacy against incumbent Loretta Spencer on March 26, 2008. Battle's policies were fiscal responsibility, free enterprise, education, and creating jobs. Prior to the first round of voting, Spencer was endorsed by The Huntsville Times. The Committee of 100, a group of businesspeople, issued a joint endorsement of Battle and Spencer.\nIn the municipal election on August 26, 2008, Spencer led Battle by 14,871 votes to 14,486. However, two minor candidates received 673 votes, preventing Spencer from attaining a majority, forcing a runoff with Battle. In the runoff, on October 7, 2008, Battle  defeated Spencer, by a vote of 21,123 votes (56%) to 16,821 (44%) for Spencer.\n2012 election\nOn August 28, 2012, Battle won with 81 percent of the vote, beating Loretta Spencer and Jackie Reed. The 2012 election had the largest margin of victory in a Huntsville mayoral election. The voting results were as follows:\n* Battle: 22,838 (80.7%)\n* Spencer: 4,312 (15.2%)\n* Reed: 1,159 (4.1%)\nHe won in all 44 precincts citywide.\n2016 election\nOn September 23, 2015, Battle posted a statement confirming his running for a third term as mayor in 2016. Battle later won against his opponents with 80% of the votes cast for him.\n* Battle: 13,896 (80.7%)\n* Spencer: 1,516 (8.8%)\n* Reed: 1,799 (10.5%)\n2020 election\nOn August 25, 2020, Battle won reelection with 77.61% of the vote.\n*Battle: 21,589 (77.61%)\n* Woloszyn: 2,894 (10.40%)\n* Reed: 1,729 (6.22%)\n* Shingleton: 1,607 (5.78%)\nMayor of Huntsville\nDuring his second term, Battle began the Restore Our Roads campaign and received a $250 million state roads package. To help fund the development, Battle proposed a one-cent sales tax. The city council approved the increase and Huntsville completed a $453 million construction project.\nIn 2015, Battle asked the city to buy body cameras for the Huntsville Police Department, at a cost of $1.2 million.\nIn 2016, Battle supported the arrival of Google Fiber to Huntsville.\nBattle favored the city-wide of expansion of ridesharing companies like Uber and Lyft in the city, and rewrote the vehicle for hire ordinance to allow their operation.\nIn the December 2017 special election for the Senate, Battle endorsed former State Supreme Court Judge Roy Moore, saying \"As a Republican, we were going to support whoever the Republican party nominated during our primary. The Republicans nominated Roy Moore.\"\nIn April 2018, a rookie Huntsville Police officer, William Darby, shot and killed a suicidal man within 11 seconds of arriving at a call. In August 2018, Mayor Battle urged the Huntsville city council to pay or assist with paying for Darby's defense. The city paid $89,000 for his defense. In May 2020, Darby was found guilty of murder. After the verdict, Battle released a statement that he \"disagree[d] with the verdict\" and that \"Officer Darby followed the appropriate safety protocols in his response on the scene.\" Darby was cleared of wrong-doing by the city police review board. As a result, Darby was still paid by the city of Huntsville until late July. On August 20, 2021, Darby was sentenced to 25 years in jail for the murder. Battle pushed to prevent the bodycam footage from being released. However, the footage of the murder was released on August 27, 2021.\nFifteen Huntsville-area organizations, including the Alabama chapters of Southern Christian Leadership Conference and NAACP Youth Council, have denounced Mayor Battle's handling of the George Floyd protest that occurred in and around Big Spring Park on June 3, 2020. Huntsville Police along with SWAT and Incident Response Team used tear gas, pepper spray, and rubber bullets to end the protest.\nControversy\nFollowing the murder conviction of William Darby, political groups and politicians called for mayor Battle to resign. Locals also made an online petition calling for the resignations of Battle and the Huntsville Police Chief Mark McMurray.\nIn May 2021, a Huntsville civil rights group, Rosa Parks Day Committee, also called for the resignations of Battle and McMurray. This came after both men publicly supported Huntsville Police Officer William Darby after his conviction for murder. Mark McMurray announced his retirement in Feb 2022.\n2018 gubernatorial election\nBattle unsuccessfully ran for the Republican nomination for governor of Alabama in 2018 as an \"outsider\" candidate; he lost in the Republican primary to incumbent Kay Ivey.\nBattle touted strong job growth under his tenure, as well as the city's top credit rating from credit rating agencies.\nPersonal life\nBattle married Eula Sammons, a kindergarten teacher at Monrovia Elementary, in 1988 they had one son, Andrew Battle. Sammons died on October 20, 2020, from breast cancer.\nBattle is a member of the Trinity United Methodist Church.\n}}\nExternal links\n* [http://tommybattle.com/ Tommy Battle for Mayor official website]\n* [http://www.huntsvilleal.gov/mayor/ City of Huntsville website: Official Biography]"
    }
  ]
}