{
  "content": [
    {
      "type": "text",
      "text": "# Toni Warner\n\nAnthony Warner}}\nAntoinette \"Toni\" Warner (née Thompson, formerly McAllister) is a fictional character on the New Zealand soap opera Shortland Street who was portrayed by Laura Hill from 2001 until 2008.\nIn 2008, Toni became the first character on the show to give birth, get married and die on screen.\nCreation and casting\nFollowing the departures of Rachel McKenna (Angela Bloomfield), Ellen Crozier (Robyn Malcolm), Kirsty Knight (Angela Dotchin), Jenny Harrison (Maggie Harper) and the axing of David Kearney (Peter Elliott), in 1998 and 1999, ratings for the show dropped dramatically in 2000 and producers decided to reinvent the show to boost audience interest. Jason Daniel was hired as a consultant to drastically alter the show, making it more representative of the social climate of the time. This included eliminating several characters, redesigning the hospital, toning down make up and clothing choices, and introducing a new cast. One of the characters created by Daniel was 'Melanie Thompson', who would be renamed 'Toni' by her debut in early 2001. Laura Hill was cast in the role. Toni was the first of the new cast to appear.\nIn 2007, Hill took 6 months leave to appear in a play in Christchurch. However Toni's exit on screen was left ambiguous so as to appear she may have left permanently. Hill published an open letter assuring her fans that this was not the case and pressed her imminent return. Hill returned to the show in late 2007 but acknowledged that, \"they weren't going to have too many options with the character\". Instead of using the show as a \"net\" and under the desire to expand her acting resume, Hill quit the show. She cited health reasons under her resignation and stated, \"Shortland Street’s been a big part of my professional life and a time of enormous change and growth for me. That has been great and, although I was ready to leave, it still was a passing of an era.\" Hill felt lucky to have had the ability to choose to quit, having seen colleagues written off without an option. The character was killed off in June 2008 after coming down with norovirus. She became the first character to get married, give birth, and die on-screen. Hill reprised her role for a cameo as a hallucination on 17 December 2020.\nStorylines\nFollowing the conversion of Shortland Street clinic into a public hospital in early 2001 at the hands of Chris Warner (Michael Galvin), several new nurses were hired including Toni Thompson. Toni quickly made her mark on the social scene at the hospital, forming a tight bond with Donna Heka (Stephanie Tauevihi). After a series of one-night stands, she started a relationship with Matt McCallister (Roy Snow) but quickly moved on with Adam Heywood (Leighton Cardno). When Adam left her, Toni rebounded to a purely sexual partnership with senior surgeon Chris Warner. She fell pregnant and was unsure whether the baby was Chris' or Adam's but following the birth in May 2002 of Harry (Joshua Thompson), Chris proved to be the father. Toni continued an on-off relationship with Adam which looked to be long-term when she nursed him following a stabbing. However the following year Toni realised she still loved Matt and the two eloped.\nChris' mother Margot Warner (Dinah Priestley) returned to Ferndale and believed that Toni was the result of an affair Chris' father had, meaning Toni and Chris' previous relationship was deemed possibly incestuous. This was dispelled but Toni's brother Dominic (Shane Cortese) developed a deep jealousy of Chris as a result that bordered on obsession. Toni divorced a cheating Matt and got back with Adam, only for him to leave her later that year. She briefly dated Logan (Peter Muller) but he proved psychotic and kidnapped Harry. Visiting Fiji on a work placement, Toni and Chris decided to do what was best for their son and start a relationship. Shortly after, Dom died while trying to murder Chris, resulting in the two getting engaged and Toni falling pregnant. Toni and Chris married in 2005 but Toni fell down some stairs and miscarried. The stress lead the two to separate and Chris moved on to Greta Saunders (Meryl Maine). When Toni and Chris reunited, a vindictive Greta attempted to poison Toni and nearly succeeded in murdering her.\nIn 2007 Toni discovered Chris had cheated on her multiple times and rediscovered the party lifestyle with Chris' brother  Guy (Craig Parker). The two decided to leave Ferndale and they fled with Harry (Henry Williams) and Guy's daughter Tuesday (Olivia Tennet). Chris tracked them down 6 months later, but in the resulting escape Toni and Guy got into a serious car crash. Toni survived but lost a kidney and returned to work at Shortland Street. Nursing Guy through his drug addiction, the relationship ended when Toni and Chris decided to try again for the sake of Harry. Shortly after reconciling with Chris, Toni fell sick and suddenly died. The post mortem revealed that Toni had succumbed to norovirus. Toni's best friend Sarah Potts (Amanda Billing) later discovered the pills she had been taking for her kidney were faulty and had contributed to her death.\nIn December 2020 Chris hallucinated Toni whilst grieving for his son Phoenix (Geordie Holibar). Chris later dreamt of his and Toni's trip to Fiji when undergoing surgery.\nCharacter development\nUpon arrival, Toni was labelled a \"good time girl\", and it was said she, \"throws herself into the hurly-burly of a wild social life.\" The character was written so as to establish relationships with the other characters quickly and thus was shown to make friends and enemies equally. Her romance storylines were numerous and short-lived, with Hill describing her character as a \"commitment-phobe\". She noticed throughout Toni's 7 year stint on the show that she underwent a sharp character change, going from a \"party girl\" to a hard working mother quite dramatically.\nReception\nThe character of Toni was popular with audiences however actress Laura Hill noticed a decline during her later storylines in what she attributed to a change in character development. Toni's death was remembered as one of the show's most shocking, though Hill's on-screen husband Michael Galvin confessed to confusing the scene with her falling down the stairs and miscarrying.\nReferences"
    }
  ]
}