{
  "content": [
    {
      "type": "text",
      "text": "# Tony Cowards\n\n| birth_place = Ipswich, Suffolk\n| nationality = British\n| medium      = Stand up,\n| website = [http://www.tonycowards.co.uk/]\n}}\nTony Cowards (born 27 May 1973) is a British stand-up comedian and writer, currently living in the North East.\nBackground\nBorn in Ipswich in 1973, Cowards lived in Suffolk, until he moved to Ilford, Essex in 1985. After attending Ilford County High School, Tony went on to read chemistry at the University of Salford, Greater Manchester and graduated in 1994.  After a career in sound and lighting he became involved in the Comedians Graveyard, a London comedy night hosting the likes of Jimmy Carr and Tim Vine, he finally decided to try his hand at stand up and did his first comedy performance at the Manchester Dancehouse Theatre at the age of 30.  He has since has gone on to perform in comedy clubs, theatres and festivals throughout the UK and internationally.\nCareer\nCowards is a regular on the comedy stages across the UK and regularly performs to a variety of service personnel, at sports clubs and awards dinners.\nHe has performed 6 Edinburgh Festival Shows, Festival of Football (2007), Festival of Football 2 (2008), Everyman (2009), Daft Pun (2016), Punderdog (2017) and Step Dad Jokes (2019). He also took Daft Pun to the Adelaide Fringe in 2017.\nIn 2011 \"performed\" one of the first online stand-up comedy shows, No Ticket Required, on Twitter as part of the Edinburgh Festival.\nCowards is known for his one liners, wordplay and puns and is a prolific Twitter user. He is also renowned for his ability to take random subjects from audience suggestions and improvise jokes off the cuff.\nHe performed an entire show based on this premise (audience suggestions), The Bespoke Joke Show, as part of the Camden Fringe in 2013.\nHe has written for a variety of radio shows on BBC Radio 2, Radio 4 and Radio 4Extra including Ian D. Montfort Is: Unbelievable, The News Quiz, The Now Show,  Newsjack, the BBC Comedy Unit Watson's Wind Up and for commercial stations, Jack FM and Talksport.\nHe was part of the Silver Sony Award winning writing team for Jack FM (South Coast) in 2013.\nHe came 3rd in the \"English Comedian of the Year\" competition held at the Underbelly on London's South Bank in 2014 and has twice been a finalist at the UK Pun Championships as part of the Leicester Comedy Festival.\nA big football fan he has had articles published in When Saturday Comes magazine and the Guardian Sports Network.\nReferences\nExternal links\n*http://www.tonycowards.co.uk Official Website\n*[http://www.comedycv.co.uk/tonycowards/index.htm Comedy CV]"
    }
  ]
}