{
  "content": [
    {
      "type": "text",
      "text": "# Tony Award for Best Revival of a Musical\n\n| location = New York City\n| holder = Sunset Boulevard\n| website =\n}}\nThe Tony Award for Best Revival of a Musical has been awarded since 1994. Before that time, both plays and musicals were considered together for the Tony Award for Best Revival. The award is given to the producers of the best musical play which has already appeared on Broadway in a previous production, or is regarded as being in the common theatrical repertoire. Like Best Musical, excerpts from the musicals that are nominated for this award are usually performed during the ceremony and before this award is presented.\nAs of 2019, composers are also eligible for this award, when a show is considered a revival but has not previously appeared on Broadway.\nWinners and nominees\n1970s\n{| class=\"wikitable\" style=\"width:100%;\n|- style=\"background:#bebebe;\"\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Production\n! style=\"width:75%;\"| Nominees\n|-\n! colspan=\"5\"|Best Revival\n|-\n| rowspan=\"5\" align=\"center\"| 1977\n|- style=\"background:#B0C4DE\"\n| Porgy and Bess\n| Sherwin M. Goldman and Houston Grand Opera\n|-\n| The Cherry Orchard\n| Joseph Papp\n|-\n| Guys and Dolls\n| Moe Septee in association with Victor H. Potamkin, Carmen F. Zollo and Ashton Springer\n|-\n| The Threepenny Opera\n| Joseph Papp\n|-\n| rowspan=\"5\" align=\"center\"| 1978\n|- style=\"background:#B0C4DE\"\n| Dracula\n| Jujamcyn Theaters, Elizabeth Ireland McCann, John Wulp, Victor Lurie, Nelle Nugent and Max Weitzenhoffer\n|-\n| Tartuffe\n| Circle in the Square\n|-\n| Timbuktu!\n| Luther Davis\n|-\n| A Touch of the Poet\n| Elliot Martin\n|-\n|}\n1980s\n{| class=\"wikitable\" style=\"width:100%;\n|- style=\"background:#bebebe;\"\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Production\n! style=\"width:75%;\"| Nominees\n|-\n| rowspan=\"5\" align=\"center\"| 1980\n|- style=\"background:#B0C4DE\"\n| ''Morning's at Seven\n| Elizabeth Ireland McCann, Nelle Nugent and Ray Larson\n|-\n| Major Barbara\n| Circle in the Square\n|-\n| Peter Pan\n| Zev Buffman\n|-\n| West Side Story\n| Gladys Rackmil, John F. Kennedy Center for the Performing Arts, James M. Nederlander and Ruth Mitchell\n|-\n| rowspan=\"5\" align=\"center\"| 1981\n|- style=\"background:#B0C4DE\"\n| The Pirates of Penzance\n| Joseph Papp and New York Shakespeare Festival\n|-\n| Brigadoon\n| Zev Buffman and The Shubert Organization\n|-\n| Camelot\n| Mike Merrick and Don Gregory\n|-\n| The Little Foxes\n| Zev Buffman, Donald C. Carter and Jon Cultler\n|-\n| rowspan=\"5\" align=\"center\"| 1982\n|- style=\"background:#B0C4DE\"\n| Othello\n| Barry and Fran Weissler and CBS Video Enterprises\n|-\n| Medea\n| Barry and Fran Weissler, John F. Kennedy Center for the Performing Arts and Bunny and Warren Austin\n|-\n| My Fair Lady\n| Mike Merrick and Don Gregory\n|-\n| A Taste of Honey\n| Roundabout Theatre Company, Gene Feist and Michael Fried\n|-\n| rowspan=\"5\" align=\"center\"| 1983\n|- style=\"background:#B0C4DE\"\n| On Your Toes\n| Alfred de Liagre Jr., Roger L. Stevens, John Mauceri, Donald R. Seawell and Andre Pastoria\n|-\n| All's Well That Ends Well\n| Royal Shakespeare Company\n|-\n| The Caine Mutiny Court-Martial\n| Circle in the Square Theatre and John F. Kennedy Center for the Performing Arts\n|-\n| A View from the Bridge\n| Zev Buffman and Sidney Schlenker\n|-\n| rowspan=\"5\" align=\"center\"| 1984\n|- style=\"background:#B0C4DE\"\n| Death of a Salesman\n| Robert Whitehead and Roger L. Stevens\n|-\n| American Buffalo\n| Elliot Martin and Arnold Bernhard\n|-\n| Heartbreak House\n| Circle in the Square\n|-\n| A Moon for the Misbegotten\n| The Shubert Organization and Emanuel Azenberg\n|-\n| rowspan=\"5\" align=\"center\"| 1985\n|- style=\"background:#B0C4DE\"\n| Joe Egg\n| The Shubert Organization, Emanuel Azenberg, Roger Berlind, Ivan Bloch and MTM Enterprises Inc.\n|-\n| Cyrano de Bergerac\n| rowspan=2| James M. Nederlander, Elizabeth Ireland McCann, Nelle Nugent, Cynthia Wood, Dale Duffy and Allan Carr\n|-\n| Much Ado About Nothing\n|-\n| Strange Interlude\n| Robert Michael Geisler, John Roberdeau, Douglas Urbanski, James M. Nederlander, Duncan Weldon, Paul Gregg, Lionel Becker and Jerome Minskoff\n|-\n| rowspan=\"5\" align=\"center\"| 1986\n|- style=\"background:#B0C4DE\"\n| Sweet Charity\n| Jerome Minskoff, James M. Nederlander, Arthur Rubin and Joseph Harris\n|-\n| Hay Fever\n| Roger Peters and MBS Co.\n|-\n| The Iceman Cometh\n| Lewis Allen, James M. Nederlander, Stephen Graham and Ben Edwards\n|-\n| Loot\n| David Merrick Arts Foundation, Charles P. Kopelman and Mark Simon\n|-\n| rowspan=\"5\" align=\"center\"| 1987\n|- style=\"background:#B0C4DE\"\n| All My Sons\n| Jay H. Fuchs, Steven Warnick and Charles Patsos\n|-\n| The Front Page\n| Lincoln Center Theater, Gregory Mosher and Bernard Gersten\n|-\n| The Life and Adventures of Nicholas Nickleby\n| The Shubert Organization, Three Knights Ltd. and Robert Fox Ltd.\n|-\n| Pygmalion\n| The Shubert Organization, Jerome Minskoff and Duncan Weldon\n|-\n| rowspan=\"5\" style=\"text-align:center\"| 1988\n|- style=\"background:#B0C4DE\"\n| Anything Goes\n| Lincoln Center Theater, Gregory Mosher and Bernard Gersten\n|-\n| Cabaret\n| Barry and Fran Weissler\n|-\n| Dreamgirls\n| Marvin A. Krauss and Irving Siders\n|-\n| A Streetcar Named Desire\n| Circle in the Square, Theodore Mann and Paul Libin\n|-\n| rowspan=\"5\" align=\"center\"| 1989\n|- style=\"background:#B0C4DE\"\n| Our Town\n| Lincoln Center Theater, Gregory Mosher and Bernard Gersten\n|-\n| Ah, Wilderness!\n| Ken Marsolis, Alexander H. Cohen, John F. Kennedy Center for the Performing Arts, Yale Repertory Theatre, Richard Norton, Irma Oestreicher and Elizabeth D. White\n|-\n| Ain't Misbehavin'\n| The Shubert Organization, Emanuel Azenberg, Dasha Epstein and Roger Berlind\n|-\n| Cafe Crown\n| LeFrak Entertainment, James M. Nederlander, Francine LeFrak, James L. Nederlander and Arthur Rubin\n|-\n|}\n1990s\n{| class=\"wikitable\" style=\"width:100%;\n|- style=\"background:#bebebe;\"\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Production\n! style=\"width:75%;\"| Nominees\n|-\n| rowspan=\"5\" align=\"center\"| 1990\n|- style=\"background:#B0C4DE\"\n| Gypsy\n| Barry and Fran Weissler, Kathy Levin and Barry Brown\n|-\n| The Circle\n| Elliot Martin, The Shubert Organization and Suntory International Corp.\n|-\n| The Merchant of Venice\n| Duncan Weldon, Jerome Minskoff, Punch Productions and Peter Hall\n|-\n| Sweeney Todd\n| Circle in the Square Theatre, Theodore Mann and Paul Libin\n|-\n| rowspan=\"4\" align=\"center\"| 1991\n|- style=\"background:#B0C4DE\"\n| Fiddler on the Roof\n| Barry and Fran Weissler and Pace Theatrical Group\n|-\n| The Miser\n| Circle in the Square Theatre, Theodore Mann and Paul Libin\n|-\n| Peter Pan\n| James M. Nederlander, Arthur Rubin, Thomas P. McCoy, Keith Stava, PP Investments Inc. and John. B. Platt\n|-\n| rowspan=\"5\" align=\"center\"| 1992\n|- style=\"background:#B0C4DE\"\n| Guys and Dolls\n| Dodger Productions, Roger Berlind, Jujamcyn Theaters / TV Asahi, Kardana Productions and John F. Kennedy Center for the Performing Arts\n|-\n| The Most Happy Fella\n| Goodspeed Opera House, Center Theatre Group / Ahmanson Theatre, Lincoln Center Theater, The Shubert Organization and Japan Satellite Broadcasting / Stagevision\n|-\n| On Borrowed Time\n| Circle in the Square Theatre, Theodore Mann, Robert Buckley and Paul Libin\n|-\n| The Visit\n| Roundabout Theatre Company, Todd Haimes and Gene Feist\n|-\n| rowspan=\"5\" align=\"center\"| 1993\n|- style=\"background:#B0C4DE\"\n| Anna Christie\n| Roundabout Theatre Company and Todd Haimes\n|-\n| Saint Joan\n| National Actors Theatre, Tony Randall and Duncan Weldon\n|-\n| The Price\n| Roundabout Theatre Company and Todd Haimes\n|-\n| Wilder, Wilder, Wilder\n| Circle in the Square Theatre, Theodore Mann, George Elmer, Paul Libin, Willow Cabin Theatre Company, Edward Berkeley, Adam Oliensis and Maria Radman\n|-\n! colspan=\"5\"|Best Revival of a Musical\n|-\n| rowspan=\"5\" align=\"center\"| 1994\n|- style=\"background:#B0C4DE\"\n| Carousel\n| Lincoln Center Theater, André Bishop, Bernard Gersten, Royal National Theatre, Cameron Mackintosh and the Rodgers and Hammerstein Organization\n|-\n| Damn Yankees\n| Mitchell Maxwell, PolyGram Diversified Entertainment, Dan Markley, Kevin McCollum, Victoria Maxwell, Fred H. Krones, Andrea Nasher, The Frankel-Viertel-Baruch Group, Paula Heil Fisher, Julie Ross, Jon B. Platt, Alan Schuster and Peter Breger\n|-\n| Grease\n| Barry and Fran Weissler and Jujamcyn Theaters\n|-\n| She Loves Me\n| Roundabout Theatre Company, Todd Haimes, James M. Nederlander, Elliott Martin, Herbert Wasserman, Freddy Beinstock and Roger L. Stevens\n|-\n| rowspan=\"3\" align=\"center\"| 1995\n|- style=\"background:#B0C4DE\"\n| Show Boat\n| Livent U.S. Inc.\n|-\n| How to Succeed in Business Without Really Trying\n| Dodger Productions and Kardana Productions Inc., John F. Kennedy Center for the Performing Arts and The Nederlander Organization\n|-\n| rowspan=\"5\" align=\"center\"| 1996\n|- style=\"background:#B0C4DE\"\n| The King and I\n| Dodger Productions, John F. Kennedy Center for the Performing Arts, James M. Nederlander, Perseus Productions, John Frost, Adelaide Festival Centre and The Rodgers and Hammerstein Organization\n|-\n| Company\n| Roundabout Theatre Company, Todd Haimes and Ellen Richard\n|-\n| A Funny Thing Happened on the Way to the Forum\n| Jujamcyn Theaters, Scott Rudin / Paramount Pictures, The Viertel-Baruch-Frankel Group, Roger Berlind and Dodger Productions\n|-\n| Hello, Dolly!\n| Manny Kladitis, Magic Promotions and Theatricals, Pace Theatrical Group Inc. and Jon B. Platt\n|-\n| rowspan=\"5\" align=\"center\"| 1997\n|- style=\"background:#B0C4DE\"\n| Chicago\n| Barry and Fran Weissler and Kardana Productions Inc.\n|-\n| Annie\n| Timothy Childs, Rodger Hess, Jujamcyn Theaters, Terri B. Childs and Al Nocciolino\n|-\n| Candide\n| Livent U.S. Inc.\n|-\n| Once Upon a Mattress\n| Dodger Productions and Joop van den Ende\n|-\n| rowspan=\"4\" align=\"center\"| 1998\n|- style=\"background:#B0C4DE\"\n| Cabaret\n| Roundabout Theatre Company, Todd Haimes and Ellen Richard\n|-\n| 1776\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard, James M. Nederlander, Stewart F. Lane, Rodger Hess, Bill Haber, Robert Halmi Jr., Dodger Endemol Theatricals and Hallmark Entertainment\n|-\n| The Sound of Music\n| Hallmark, Thomas Viertel, Steven Baruch, Richard Frankel, Jujamcyn Theaters, The Rodgers and Hammerstein Organization, Charles Kelman Productions, Simone Genatt Haft, Marc Routh, Jay Binder and Robert Halmi Jr.\n|-\n| rowspan=\"5\" align=\"center\"| 1999\n|- style=\"background:#B0C4DE\"\n| Annie Get Your Gun\n| Barry and Fran Weissler, Kardana, Michael Watt, Irving Welzer and Hal Luftig\n|-\n| Little Me\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard and Julia C. Levy\n|-\n| Peter Pan\n| McCoy Rigby Entertainment, The Nederlander Organization, La Mirada Theatre for the Performing Arts, Albert Nocciolino, Larry Payton and J. Lynn Singleton\n|-\n| You're a Good Man, Charlie Brown\n| Michael Leavitt, Fox Theatricals, Jerry Frankel, Arthur Whitelaw and Gene Persson\n|}\n2000s\n{| class=\"wikitable\" style=\"width:100%;\n|- style=\"background:#bebebe;\"\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Musical\n! style=\"width:75%;\"| Nominees\n|-\n| rowspan=\"5\" align=\"center\"| 2000\n|- style=\"background:#B0C4DE\"\n| Kiss Me, Kate\n| Roger Berlind and Roger Horchow\n|-\n| Jesus Christ Superstar\n| The Really Useful Superstar Company Inc., The Nederlander Producing Company of America Inc. and Terry Allen Kramer\n|-\n| The Music Man\n| Dodger Theatricals, John F. Kennedy Center for the Performing Arts, Elizabeth Williams/ Anita Waxman, Kardana-Swinsky Productions and Lorie Cowen Levy / Dede Harris\n|-\n| Tango Argentino\n| DG Producciones\n|-\n| rowspan=\"5\" align=\"center\"| 2001\n|- style=\"background:#B0C4DE\"\n| 42nd Street\n| Dodger Theatricals, Joop van den Ende and Stage Holding\n|-\n| Bells Are Ringing\n| Mitchell Maxwell, Mark Balsam, Victoria Maxwell, Robert Barandes, Mark Goldberg, Anthony R. Russo, James L. Simon, Fred H. Krones, Allen M. Shore and Momentum Productions Inc.\n|-\n| Follies\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard and Julia C. Levy\n|-\n| The Rocky Horror Show''\n| Jordan Roth, Christopher Malcolm, Howard Panter, Richard O'Brien and The Rocky Horror Company Ltd.\n|-\n| rowspan=\"3\" align=\"center\"| 2002\n|- style=\"background:#B0C4DE\"\n| Into the Woods\n| Dodger Theatricals, Stage Holding / Joop van den Ende and TheatreDreams\n|-\n| Oklahoma!\n| Cameron Mackintosh and Royal National Theatre\n|-\n| rowspan=\"5\" align=\"center\"| 2003\n|- style=\"background:#B0C4DE\"\n| Nine\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard and Julia C. Levy\n|-\n| Gypsy\n| Robert Fox, Ron Kastner, Roger Marino, Michael Watt, Harvey Weinstein and WWLC\n|-\n| La bohème\n| Jeffrey Seller, Kevin McCollum, Emanuel Azenberg, Bazmark Live, Bob and Harvey Weinstein, Korea Pictures / Doyun Seol, J. Sine / I. Pittelman / S. Nederlander and Fox Searchlight Pictures\n|-\n| Man of La Mancha\n| David Stone, Jon B. Platt, Susan Quint Gallin, Sandy Gallin, Seth M. Siegel, USA Ostar Theatricals and Mary Lu Roffe\n|-\n| rowspan=\"5\" align=\"center\"| 2004\n|- style=\"background:#B0C4DE\"\n| Assassins\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard and Julia C. Levy\n|-\n| Big River\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard, Julia C. Levy, Deaf West Theatre, Ed Waterstreet, Bill O'Brien and Center Theatre Group / Mark Taper Forum\n|-\n| Fiddler on the Roof\n| James L. Nederlander, Stewart F. Lane / Bonnie Comley, Harbor Entertainment, Terry Allen Kramer, Bob Boyett / Lawrence Horowitz and Clear Channel Entertainment\n|-\n| Wonderful Town\n| Roger Berlind, Barry and Fran Weissler, Edwin W. Schloss, Allen Spivak, Clear Channel Entertainment and Harvey Weinstein\n|-\n| rowspan=\"4\" align=\"center\"| 2005\n|- style=\"background:#B0C4DE\"\n| La Cage aux Folles\n| James L. Nederlander, Clear Channel Entertainment, Kenneth Greenblatt, Terry Allen Kramer and Martin Richards\n|-\n| Pacific Overtures\n| Roundabout Theatre Company, Todd Haimes, Ellen Richard, Julia C. Levy and Gorgeous Entertainment\n|-\n| Sweet Charity\n| Barry and Fran Weissler, Clear Channel Entertainment and Edwin W. Schloss\n|-\n| rowspan=\"4\" align=\"center\"| 2006\n|- style=\"background:#B0C4DE\"\n| The Pajama Game\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert, Julia C. Levy, Jeffrey Richards, James Fuld Jr. and Scott Landis\n|-\n| Sweeney Todd: The Demon Barber of Fleet Street\n| Tom Viertel, Steven Baruch, Marc Routh, Richard Frankel, Ambassador Theatre Group, Adam Kenwright and Tulchin/Bartner/Bagert\n|-\n| The Threepenny Opera\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert and Julia C. Levy\n|-\n| rowspan=\"5\" align=\"center\"| 2007\n|- style=\"background:#B0C4DE\"\n| Company\n| Marc Routh, Richard Frankel, Tom Viertel, Steven Baruch, Ambassador Theatre Group, Tulchin/Bartner Productions, Darren Bagert and Cincinnati Playhouse in the Park\n|-\n| The Apple Tree\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert and Julia C. Levy\n|-\n| A Chorus Line\n| Producer: Vienna Waits Productions\n|-\n| 110 in the Shade\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert and Julia C. Levy\n|-\n| rowspan=\"5\" align=\"center\"| 2008\n|- style=\"background:#B0C4DE\"\n| South Pacific\n| Lincoln Center Theater, André Bishop, Bernard Gersten and Bob Boyett\n|-\n| Grease\n| Paul Nicholas and David Ian, Nederlander Presentations Inc., Terry Allen Kramer and Robert Stigwood\n|-\n| Gypsy\n| Roger Berlind, The Routh-Frankel-Baruch-Viertel Group, Roy Furman, Debra Black, Ted Hartley, Roger Horchow, David Ian, Scott Rudin and Jack Viertel\n|-\n| Sunday in the Park with George\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert, Julia C. Levy, Bob Boyett, Debra Black, Jam Theatricals, Stephanie P. McClelland, Stewart F. Lane / Bonnie Comley, Barbara Manocherian / Jennifer Manocherian, Ostar Productions and The Menier Chocolate Factory / David Babani\n|-\n| rowspan=\"5\" align=\"center\"| 2009\n|- style=\"background:#B0C4DE\"\n| Hair\n| The Public Theater, Oskar Eustis, Andrew D. Hamingson, Jeffrey Richards, Jerry Frankel, Gary Goddard Entertainment, Kathleen K. Johnson, Nederlander Productions Inc., Fran Kirmser Productions / Jed Bernstein, Marc Frankel, Broadway Across America, Barbara Manocherian/Wencarlar Productions, JK Productions / Terry Schnuck, Andy Sandberg, Jam Theatricals, The Weinstein Company / Norton Herrick, Jujamcyn Theaters, Joey Parnes and Elizabeth Ireland McCann\n|-\n| Guys and Dolls\n| Howard Panter and Ambassador Theatre Group, Tulchin/Bartner, Bill Kenwright, Northwater Entertainment, Darren Bagert, Tom Gregory, Nederlander Presentations Inc., David Mirvish, Michael Jenkins / Dallas Summer Musicals, Independent Presenters Network, Olympus Theatricals and Sonia Friedman Productions\n|-\n| Pal Joey\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert, Julia C. Levy and Marc Platt\n|-\n| West Side Story\n| Kevin McCollum, James L. Nederlander, Jeffrey Seller, Terry Allen Kramer, Sander Jacobs, Roy Furman / Jill Furman Willis, Freddy DeMann, Robyn Goodman / Walt Grossman, Hal Luftig, Roy Miller, The Weinstein Company and Broadway Across America\n|}\n2010s\n{| class=\"wikitable\" style=\"width:100%;\n|- style=\"background:#bebebe;\"\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Musical\n! style=\"width:75%;\"| Nominees\n|-\n| rowspan=\"5\" align=\"center\"| 2010\n|- style=\"background:#B0C4DE\"\n| La Cage aux Folles\n| Sonia Friedman Productions, David Babani, Barry and Fran Weissler and Edwin W. Schloss, Bob Bartner/Norman Tulchin, Broadway Across America, Matthew Mitchell, Raise the Roof 4, Richard Winkler / Bensinger Taylor / Laudenslager Bergrre, Arelene Scanlan/John O'Boyle, Independent Presenters Network, Olympus Theatricals, Allen Spivak, Jerry Frankel / Bat-Barry Productions, Nederlander Presentations Inc. / Harvey Weinstein and Menier Chocolate Factory\n|-\n| ''Finian's Rainbow\n| David Richenthal, Jack Viertel, Alan D. Marks, Michael Speyer, Bernard Abrams, David M. Milch, Stephen Moore, Debbie Bisno/Myla Lerner, Jujamcyn Theaters, Melly Garcia, Jamie deRoy, Jon Bierman, Richard Driehaus, Kevin Spirtas, Jay Binder and StageVentures 2009 Limited Partnership\n|-\n| A Little Night Music\n| Tom Viertel, Steven Baruch, Marc Routh, Richard Frankel, The Menier Chocolate Factory, Roger Berlind, David Babani, Sonia Friedman Productions, Andrew Fell, Daryl Roth / Jane Bergere, Harvey Weinstein / Raise the Roof 3, Beverly Bartner/Dancap Productions, Inc., Nica Burns/Max Weitzenhoffer, Eric Falkenstein / Anna Czekaj, Jerry Frankel / Ronald Frankel and James D. Stern / Douglas L. Meyer\n|-\n| Ragtime\n| Kevin McCollum, Roy Furman, Scott Delman, Roger Berlind, Max Cooper, Tom Kirdahy / Devlin Elliott, Jeffrey A. Sine, Stephanie P. McClelland, Roy Miller, Lams Productions, Jana Robbins, Sharon Karmazin, Eric Falkenstein / Morris Berchard, RialtoGals Productions, Independent Presenters Network, Held-Haffner Productions, HRH Foundation, Emanuel Azenberg, John F. Kennedy Center for the Performing Arts, Michael Kaiser and Max Woodward\n|-\n| rowspan=\"3\" align=\"center\"| 2011\n|- style=\"background:#B0C4DE\"\n| Anything Goes\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert and Julia C. Levy\n|-\n| How to Succeed in Business Without Really Trying\n| Broadway Across America, Craig Zadan, Neil Meron, Joseph Smith, Michael McCabe, Candy Spelling, Takonkiet Viravan/Scenario Thailand, Hilary A. Williams, Jen Namoff/Fakston Productions, Two Left Feet Productions/Power Arts, Hop Theatricals, LLC / Paul Chau / Daniel Frishwasser / Michael Jackowitz, Michael Speyer and Bernie Abrams / Jacki Barlia Florin and Adam Blanshay / Arlene Scanlan / TBS Service\n|-\n| rowspan=\"5\" align=\"center\"| 2012\n|- style=\"background:#B0C4DE\"\n| Porgy and Bess\n| Jeffrey Richards, Jerry Frankel, Rebecca Gold, Howard Kagan, Cheryl Wiesenfeld/Brunish Trinchero/Lucio Simons TBC, Joseph & Matthew Deitch, Mark S. Golub and David S. Golub, Terry Schnuck, Freitag Productions/Koenigsberg Filerman, The Leonore S. Gershwin 1987 Trust, Universal Pictures Stage Productions, Ken Mahoney, Judith Resnick, Tulchin/Bartner/ATG, Paper Boy Productions, Christopher Hart, Alden Badway, Broadway Across America, Irene Gandy, Will Trice and American Repertory Theater\n|-\n| Evita\n| Hal Luftig, Scott Sanders Productions, Roy Furman, Yasuhiro Kawana, Allan S. Gordon/Adam S. Gordon, James L. Nederlander, Terry Allen Kramer, Gutterman Fuld Chernoff/Pittsburgh CLO, Thousand Stars Productions, Adam Blanshay, Adam Zotovich, Robert Ahrens, Stephanie P. McClelland, Carole L. Haber, Richardo Hornos, Carol Fineman, Brian Smith, Warren and Jâlé Trepp\n|-\n| Follies\n| John F. Kennedy Center for the Performing Arts, David M. Rubenstein, Michael M. Kaiser, Max A. Woodward, Nederlander Presentations, Inc., Adrienne Arsht, HRH Foundation and Allan Williams\n|-\n| Jesus Christ Superstar\n| The Dodgers and The Really Useful Group, Latitude Link, Tamara and Kevin Kinsella, Pelican Group, Waxman-Dokton, Joe Corcoran, Detsky/Sokolowski/Kassie, Florin-Blanshay-Fan/Broadway Across America, Rich/Caudwell, Shin/Coleman, TheatreDreams North America, LLC, Stratford Shakespeare Festival\n|-\n| rowspan=\"5\" align=\"center\"| 2013\n|- style=\"background:#B0C4DE\"\n| Pippin\n| Barry and Fran Weissler, Howard and Janet Kagan, Lisa Matlin, Kyodo Tokyo, A&A Gordon/Brunish Trinchero, Tom Smedes/Peter Stern, Broadway Across America, Independent Presenters Network, Norton Herrick, Allen Spivak, Rebecca Gold, Joshua Goodman, Stephen E. McManus, David Robbins/Bryan S. Weingarten, Philip Hagemann/Murray Rosenthal, Jim Kierstead / Carlos Arana / Myla Lerner, Hugh Hayes/Jamie Cesa/Jonathan Reinis, Sharon A. Carr/Patricia R. Klausner, Ben Feldman, Square 1 Theatrics, Wendy Federman/Carl Moellenberg, Bruce Robert Harris/Jack W. Batman, Infinity Theatre Company/Michael Rubenstein, Michael A. Alden/Dale Badway/Ken Mahoney, American Repertory Theater\n|-\n| Annie\n| Arielle Tepper Madover, Roger Horchow, Sally Horchow, Roger Berlind, Roy Furman, Debbie Bisno, Stacey Mindich, James M. Nederlander, Jane Bergère / Daryl Roth and Eva Price/Christina Papagjika\n|-\n| The Mystery of Edwin Drood\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert and Julia C. Levy\n|-\n|  Rodgers + Hammerstein's Cinderella\n| Robyn Goodman, Jill Furman, Stephen Kocis, Edward Walson, Venetian Glass Productions, The Araca Group, Luigi Caiola & Rose Caiola, Roy Furman, Walt Grossman, Peter May/Sanford Robertson, Glass Slipper Productions LLC/Eric Schmidt, Ted Liebowitz/James Spry, Blanket Fort Productions and Center Theatre Group\n|-\n| rowspan=\"4\" align=\"center\"| 2014\n|- style=\"background:#B0C4DE\"\n| Hedwig and the Angry Inch\n| David Binder, Jayne Baron Sherman, Barbara Whitman, Latitude Link, Patrick Catullo, Raise the Roof, Paula Marie Black, Colin Callender, Ruth Hendel, Sharon Karmazin, Martian Entertainment, Stacey Mindich, Eric Schnall and The Shubert Organization\n|-\n| Les Misérables\n| Cameron Mackintosh\n|-\n| Violet\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert, Julia C. Levy, Sydney Beers, Amy Sherman-Palladino and Daniel Palladino, David Mirvish, Barry and Fran Weissler, Elizabeth Armstrong and Mary Jo and Ted Shen\n|-\n| rowspan=\"4\" align=\"center\"| 2015\n|- style=\"background:#B0C4DE\"\n| The King and I\n| Lincoln Center Theater, André Bishop, Adam Siegel, Hattie K. Jutagir and Ambassador Theatre Group\n|-\n| On the Town\n| Howard and Janet Kagan, Severn Partners Entertainment, Bruce Robert Harris and Jack W. Batman, Paula Marie Black, Nigel Lythgoe, Michael J. Moritz Jr., Mahoney/Alden/Badway, Ambassador Theatre Group, Margie and Bryan Weingarten, Kim Schall, Michael Rubenstein, Terry/Louise/Chris Lingner, Brunish & Trinchero, Stephanie Rosenberg, Laruffa & Hinderliter, Rubinstein/Handleman, Lizbeth Bintz, Riki Kane Larimer, 24 Hour Adventure Production, A&A Gordon, Matt Ross / Ben Feldman / Pamela Cooper and Barrington Stage Company\n|-\n| On the Twentieth Century\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert, Julia C. Levy and Sydney Beers\n|-\n| rowspan=\"5\" align=\"center\"| 2016\n|- style=\"background:#B0C4DE\"\n| The Color Purple\n| Scott Sanders Productions, Roy Furman, Oprah Winfrey, David Babani, Tom Siracusa, Caiola Productions, James Fantaci, Ted Liebowitz, Stephanie P. McClelland, James L. Nederlander, Darren Bagert, Candy Spelling, Adam Zotovich, Eric Falkenstein / Morris Berchard, Just for Laughs Theatricals / Tanya Link Productions, Adam S. Gordon, Jam Theatricals, Kelsey Grammer, Independent Presenters Network, Carol Fineman, Sandy Block, Quincy Jones and Menier Chocolate Factory Productions\n|-\n| Fiddler on the Roof\n| Jeffrey Richards, Jam Theatricals, Louise Gund, Jerry Frankel, Broadway Across America, Rebecca Gold, Stephanie P. McClelland, Barbara Freitag & Company / Catherine Schreiber & Company, Greenleaf Productions, Orin Wolf, Patty Baker, Caiola Productions, The Nederlander Organization, Gabrielle Palitz, Kit Seidel, TenTex Partners, Edward M. Kaufmann, Soffer/Namoff Entertainment, Healy Theatricals, Clear Channel Spectacolor, Jessica Genick and Will Trice\n|-\n| She Loves Me\n| Roundabout Theatre Company, Todd Haimes, Harold Wolpert, Julia C. Levy and Sydney Beers\n|-\n| Spring Awakening\n| Ken Davenport, Cody Lassen, Hunter Arnold, David J. Kurs, Deaf West Theatre, Carl Daikeler, Sandi Moran, Chockstone Pictures, Caiola Productions, Marguerite Hoffman, H. Richard Hopper, LearyTodd Productions, Markoltop Productions, R&D Theatricals, Brian Cromwell Smith, Invisible Wall Productions and Monica Horan Rosenthal\n|-\n| rowspan=\"4\" align=center |2017\n|- style=\"background:#B0C4DE\"\n| Hello, Dolly!\n| Scott Rudin, Roy Furman, James L. Nederlander, Eli Bush, Universal Stage Productions, Roger Berlind, William Berlind, Heni Koenigsberg, Terry Allen Kramer, Seth A. Goldstein, John Gore Organization, Daryl Roth, The Araca Group, Len Blavatnik, Eric Falkenstein, Ruth Hendel, Independent Presenters Network, Peter May, Jay Alix & Una Jackman, Jane Bergère, Scott M. Delman, Wendy Federman, Stephanie P. McClelland, Anita Waxman, Al Nocciolino, Spring Sirkin, Barbara Freitag, John Mara, Jr. & Benjamin Simpson, Joey Parnes, Sue Wagner and John Johnson\n|-\n| Falsettos\n| Walter Kerr Theater, André Bishop, Adam Siegel, Hattie K. Jutagir and Jujamcyn Theaters\n|-\n| Miss Saigon\n| Cameron Mackintosh\n|-\n| rowspan=\"4\" align=center |2018\n|- style=\"background:#B0C4DE\"\n|Once on This Island\n| Ken Davenport, Hunter Arnold, Carl Daikeler, Roy Putrino, Broadway Strategic Return Fund, Sandi Moran, Caiola Productions, H. Richard Hopper, Diego Kolankowsky, Brian Cromwell Smith, Ron Kastner, Rob Kolson, Judith Manocherian/Kevin Lyle, Jay Alix/Una Jackman/Jeff Wise, WitzEnd Productions/Jeff Grove/Wishnie-Strasberg, Mark Ferris/Michelle Riley/Marie Stevenson, Silva Theatrical Group/Jesse McKendry/Dr. Mojgan Fajiram, Conor Bagley/Brendan C. Tetro/Invisible Wall Productions, Silverwalport Productions/Tyler Mount/Ushkowitzlatimer Productions, The Harbert Family/Reilly Hickey, Keith Cromwell/Red Mountain Theatre Company and 42nd.Club/The Yonnone Family/Island Productions\n|-\n|Carousel\n| Roy Furman, Scott Rudin, Barry Diller, Edward Walson, Universal Theatrical Group, Benjamin Lowy, Eli Bush, James L. Nederlander, Candy Spelling, John Gore Organization, Peter May, Ronnie Lee, Sid & Ruth Lapidus, Stephanie P. McClelland, Sandy Robertson, Caiola Productions, Len Blavatnik, Dominion Ventures, SHN Theatres, The Araca Group, Patty Baker, Al Nocciolino, Darlene Marcos Shiley, Julie Boardman & Marc David Levine, Jennifer Fischer & Olympus Theatricals, Candia Fisher & Allen L. Stevens, Jon Jashni & Matthew Baer, Thomas S. Perakos & Jim Fantaci, Wendy Federman & Heni Koenigsberg, Bruce Robert Harris & Jack W. Batman, John Thomas, Joey Parnes, Sue Wagner and John Johnson\n|-\n|My Fair Lady\n| Lincoln Center Theater, André Bishop, Adam Siegel, Hattie K. Jutagir and Nederlander Presentations Inc.\n|-\n| rowspan=\"3\" align=center |2019\n|- style=\"background:#B0C4DE\"\n|Oklahoma!''\n| Eva Price, Level Forward, Abigail Disney, Barbara Manocherian & Carl Moellenberg, James L. Nederlander, David Mirvish, Mickey Liddell & Robert Ahrens, BSL Enterprises & MagicSpace Entertainment, Berlind Productions, John Gore Organization, Cornice Productions, Bard Fisher/R. Gold, LAMF/J. Geller, T. Narang/ZKM Media, R/F/B/V Group, Araca / IPN, St. Ann's Warehouse, Tamar Climan and Bard Summerscape\n|-\n|Kiss Me, Kate\n| Roundabout Theatre Company, Todd Haimes, Julia C. Levy, Sydney Beers and Steve Dow\n|}\n2020s\n{| class=\"wikitable\" style=\"width:100%;\n|- style=\"background:#bebebe;\"\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Musical\n! style=\"width:75%;\"| Nominees\n|-\n| align=\"center\"|  2020\n| colspan=\"4\"\n|-\n| rowspan=\"4\" align=center |2022\n|- style=\"background:#B0C4DE\"\n|Company\n| Elliott & Harper Productions, The Shubert Organization, Catherine Schreiber, Nederlander Presentations Inc., Crossroads Live, Annapurna Theatre, Hunter Arnold, No Guarantees, Jon B. Platt, Michael Watt, John Gore Organization, Tim Levy, Grove / REG, Hornos / Mollenberg, Levine / Federman - Adler, Beard / Merrie / Robbins, LD Entertainment / Madison Wells Live, Benjamin Lowy / Roben Alive, Daryl Roth / Tom Tuft, Salmira Productions / Caiola Productions, Aged in Wood / Lee / Sachs, Berinstein -/Lane / 42nd.club, Boyett /  Miller / Hodges / Kukieiski, Finn / DeVito / Independent Presenters Network, Armstrong / Ross / Gilad / Rogowsky, Boardman / Koenigsberg / Zell / Seriff, Concord Theatricals / Scott Sanders Productions / Abrams / May, deRoy / Brunish / Jenen / Rubin, Fakston Productions / Sabi / Lerner / Ketner, Maggio / Abrams/Hopkins / Tackel, Levy & Chauviere and Jujamcyn Theaters\n|-\n|Caroline, or Change\n| Roundabout Theatre Company, Todd Haimes, Julia C. Levy, Sydney Beers, Steve Dow, Lot's Wife, Hunter Arnold, Caiola Productions/Willette & Manny Klausner, Chambers-D'Angora / Joseph and Alyson Graci\n|-\n|The Music Man\n| Barry Diller, David Geffen, Kate Horton and Fictionhouse\n|-\n| rowspan=\"5\" align=center |2023\n|- style=\"background:#B0C4DE\"\n|Parade\n| Seaview, Ambassador Theatre Group Productions, Alex Levy, Kevin Ryan, Eric & Marsi Gardiner, Interscope & Immersive Records, Erica Lynn Schwartz, Creative Partners Productions, Marcia Goldberg, John Gore Organization, Cynthia Stroum, Tom Tuft, Benjamin Simpson, Nathan Vernon, Brian and Nick Ginsberg, Ruth and Stephen Hendel, Roth-Manella Productions, Chutzpah Productions, 42nd.club, Ahava 72 Productions, The Andryc Brothers, The Array, At Rise Creative, Caiola Jenen Productions, Coles Achilles, deRoy Brunish Productions, Fakston Productions, Federman Batchelder, Level Forward, Pencil Factory Productions, Renard Lynch, Robin Merrie, Rubin Stuckelman, Runyonland Sussman, Kristin Caskey, Mike Isaacson, Bee Carrozzini and New York City Center\n|-\n|Camelot\n| Lincoln Center Theater, André Bishop, Adam Siegel and Naomi Grabel\n|-\n|Into the Woods\n| Jujamcyn Theaters, Jordan Roth, New York City Center, Daryl Roth, Hunter Arnold, Concord Theatricals, Nicole Eisenberg, Jessica R. Jenen, Michael Cassel Group, Kevin Ryan, ShowTown Productions, Armstrong, Gold & Ross and Nicole Kastrinos\n|-\n|Sweeney Todd: The Demon Barber of Fleet Street\n| Jeffrey Seller, Bob Boyett, Diana DiMenna and Plate Spinner Productions / Aaron Glick, Eastern Standard Time, Roy Furman, Thomas Kail, Jim Kierstead / Benjamin Leon IV, TourDForce Theatrical, Maggie Brohn and Andy Jones\n|-\n| rowspan=\"5\" align=\"center\"| 2024\n|- style=\"background:#B0C4DE\"\n|Merrily We Roll Along\n| Sonia Friedman Productions, David Babani, Patrick Catullo, Jeff Romley, Debbie Bisno, Lang Entertainment Group, OHenry Productions, Winkler & Smalberg, Stephanie P. McClelland, Timothy Bloom, Creative Partners Productions, Eastern Standard Time, Fakston Productions, Marc David Levine, No Guarantees, Ted & Mary Jo Shen, Gilad Rogowsky, Playing Field, Key to the City Productions, Richard Batchelder / Trunfio Ryan, FineWomen Productions / Henry R. Muñoz III, Thomas Swayne / Lamar Richardson, Abrams Corr / Mary Maggio, Osh Ashruf / Brenner-Ivey, Craig Balsam / PBL Productions, deRoy DiMauro Productions / Medley Houlihan, Andrew Diamond / Katler-Solomon Productions, Dodge Hall Productions / Carl Moellenberg, Friedman Simpson / Vernon Stuckelman, William Frisbie / J.J. Powell, Robert Greenblatt / Jonathan Littman, Cleveland O'Neal III / Tom Tuft, Roth-Manella Productions / Seaview and New York Theatre Workshop\n|-\n|Cabaret at the Kit Kat Club\n| ATG Productions, Underbelly, Gavin Kalin Productions, Hunter Arnold, Smith & Brant Theatricals, Wessex Grove, Julie Boardman, Tom Smedes, Peter Stern, Heather Shields, Caiola Productions, Kate Cannova, Adam Blanshay Productions & Nicolas Talar, Aleri Entertainment, Alex Levy Productions, Bunny Rabbit Productions, D'Angora Padgett Productions, Cyrene Esposito, David Treatman, Eddie Redmayne, The Array IV, Bad Robot Live, BlueJay Productions, Grace Street Creative Group, Iocane Productions, Jim Kierstead, Marco Santarelli, Tokyo Broadcasting System Television, George Waud, Yonge Street Theatricals, Federman Koenigsberg Productions / Sara Beth Zivitz, Tina Marie Casamento / Jennifer Johns, M. Kilburg Reedy / Tilman Kemmler, Greenspan Proffer / Kat Kit 4, Patty Baker / Matthew Christopher Pietras, Broadway Strategic Return Fund / Red Mountain Theatre Company, Evan Coles / The Cohn Sisters, Nolan Doran / Fakston Productions, Epic Theatricals / Jeffrey Grove, Jessica Goldman Foung / Andrew Paradis, William Frisbie Tilted Marguerite Steed Hoffman / Willette & Manny Klausner, Vasi Laurence / Stephen C. Byrd, Brian & Dayna Lee / City Cowboy Productions, Maybe This Time / 3D Productions, Nothing Ventured Productions / Theatre Producers of Color, Perfectly Marvelous / Catherine Schreiber & Co., Second Act / Freedom Theatricals, SSP Holdings / Todd & Bronwyn Bradley, Two Ladies / Nicole Eisenberg, Ilana Waldenberg / W Stage Productions, The Wolf Pack / Burnt Umber Productions and The Shubert Organization\n|-\n|Gutenberg! The Musical!\n| Ambassador Theatre Group, Patrick Catullo, Bad Robot Live, Seth A. Goldstein, Isaac Robert Hurwitz, Runyonland Productions, Elizabeth Armstrong, Timothy Bloom, Larry Lelli, Alchemation, The Council, Crescent Road, Wendy Federman, Marcia Goldberg, Hariton deRoy, LD Entertainment, James L. Nederlander, Al Nocciolino, Spencer Ross, Independent Presenters Network, Medley Houlihan / Score 3 Partners, Tryptyk Studios / Iris Smith, Jonathan Demar / Griffin Dohr, Andrew Diamond / Alexander Donnelly, Futurehome Productions / Koenigsberg Subhedar, Roy Gabay / Nicole Eisenberg, Jessica R. Jenen / Linda B. Rubin, Daniel Powell / Amplify Pictures, Jeremy Wein / Walport Productions, Kristin Caskey, Mike Isaacson and Bee Carrozzini\n|-\n|''The Who's Tommy''\n| Stephen Gabriel, Ira Pittelman, Sue Gilad & Larry Rogowsky, Mary Maggio & Scott Abrams, Tom Tuft and Glenn Fuhrman, Batman Harris / Elliott Cornelious, Laura Matalon / Spencer Waller, Richard Winkler, Sheldon Stone, Firemused Productions / Stone Arch Theatricals, LeonoffFedermanWolosky Productions / Koenigsberg Batchelder, Roy Putrino / Narang Moran, Rich Martino, Aged in Wood / Lee Sachs, Paul and Margaret Liljenquist, R & R Productions, Marla McNally Phillips, Merrie Robin, O'Neill Snow, Work Light Productions, Nederlander Presentations, Independent Presenters Network, John Gore Organization, Palomino Performing Arts, Wavelength Productions, Robert Nederlander Jr., Botwin Ignal Dawson, Jamie deRoy, Betsy Dollinger, Stacey Woolf Feinberg, Gold Weinstein, Tyce Green, Jenen Rubin, Jim Kierstead, Marco Santarelli, Nancy Timmers, Thomas B. McGrath, Olympus Theatricals and Goodman Theatre\n|-\n| rowspan=\"5\" align=\"center\"| 2025\n|- style=\"background:#B0C4DE\"\n|Sunset Boulevard\n| The Jamie Lloyd Company, ATG Productions, Michael Harrison for Lloyd Webber Harrison Musicals, Gavin Kalin Productions, Wessex Grove, Christopher Ketner, Aleri Entertainment, Sonia Friedman, Roth-Manella Productions, Winkler Smalberg, Caitlin Clements, 42nd.club, Abrams Johnson, Aron on Broadway, The Array V, At Rise Creative, Bad Robot Live, Craig Balsam, Greg Berlanti, Boardman Cannova Productions, Bob Boyett, Burnt Umber Productions, Patrick Catullo, Crane McGill Trunfio, Core Four Productions, Nicole Eisenberg, The Factor Gavin Partnership, Federman Jenen Koenigsberg, Forshaw Turchin, John Gore, Jake Hine, LAMF Secret Hideout, Jack Lane, Lang Entertainment Group, Lelli Armstrong, Alex Levy, Luftig Reade St. Kawana, Mary Maggio, Jay Marcus, Stephanie P. McClelland, James L. Nederlander, No Guarantees Productions, P3 Productions, Thomas Steven Perakos, Pam Hurst-Della Pietra, Shari Redstone, Regian Davison Buckman, Sand & Snow Entertainment, SBK Productions, The Shubert Organization, Smedes Stern Productions, Tilted, Willowrow Entertainment and WMKlausner\n|-\n|Floyd Collins\n| Tina Landau (book & additional lyrics) and Adam Guettel (music & lyrics); Lincoln Center Theater, André Bishop, Adam Siegel, Naomi Grabel, Ira Weitzman, Creative Partners Productions, Mark Cortale and Charles D. Urstadt\n|-\n|Gypsy\n| Tom Kirdahy, Mara Isaacs, Kevin Ryan, Diane Scott Carter, Wendy Federman & Heni Koenigsberg, Roy Furman, Viajes Miranda, Kerry Washington, Peter May, Thomas M. Neff, Cynthia J. Tong, Adam Hyndman, A Perfect Team Productions, Cue to Cue Productions, Da Silva Stone, DMQR Productions, Grant Spark Productions, Marguerite Steed Hoffman, KarmaHendelMcCabe, James L. Nederlander, Janet and Marvin Rosen, Archer Entertainment, Dale Franzen, 42nd.club, Rob Acton, All That JJAS, Mike Audet, Patty Baker, Cohen Soto, Concord Theatricals, Creative Partners Productions, Crumhale Taylor Productions, Ken Davenport, DJD Productions, Flipswitch Entertainment, Frankly Spoken Productions, Roy Gabay, Happy Recap Productions, Sandra and Howard Hoffen, John Gore Organization, Johnson Maggio Productions, Willette and Manny Klausner, Kors Le Pere Theatricals, LaCroix Eisenberg, David Lai, Little Lamb Productions, Bill and Sally Martin, Mohari Media, No Guarantees Productions, Pam Hurst-Della Pietra and Stephen Della Pietra, Regian Davison, Lamar Richardson, Patti and Michael Roberts, RTK Rose, Score 3 Partners, Silva Theatrical Group, Some People, Stone Arch Theatricals, Storyboard Entertainment LE, Mary and Jay Sullivan, The Adams Hendel Group, The Array VI, The Broadway Investor's Club, Theatre Producers of Color, Tom Tuft, TreAmici Gooding, Waiting in the Wings Productions, Whitney Williams, Sara Beth Zivitz, Jamila Ponton Bragg and The Industry Standard Group\n|-\n|Pirates! The Penzance Musical\n| Roundabout Theatre Company, Todd Haimes, Scott Ellis, Sydney Beers, Christopher Nave, Steven Showalter, James L. Nederlander, Fran and Paul Turner and ATG Productions / Gavin Kalin Productions\n|-\n|}\nNotes\nMultiple wins\n; 2 Wins\n* Anything Goes\n* Company\n* The King and I\n* La Cage aux Folles\n* Porgy and Bess\nMultiple nominations\n;4 nominations\n* Gypsy\n; 3 Nominations\n* Cabaret\n* Company\n* Fiddler on the Roof\n* Guys and Dolls\n* Peter Pan\n* Sweeney Todd: The Demon Barber of Fleet Street\n; 2 Nominations\n* Annie\n* Anything Goes\n* Camelot\n* Carousel\n* Follies\n* Grease\n* Hello, Dolly!\n* How to Succeed in Business Without Really Trying\n* Into the Woods\n* Jesus Christ Superstar\n* The King and I\n* Kiss Me, Kate\n* La Cage aux Folles\n* The Music Man\n* My Fair Lady\n* Oklahoma!\n* The Pirates of Penzance\n* She Loves Me\n* Sweet Charity\n* The Threepenny Opera\n* West Side Story\nSee also\n* Tony Award for Best Musical\n* Tony Award for Best Revival\n* Tony Award for Best Revival of a Play\n* Drama Desk Award for Outstanding Revival of a Musical\n* Laurence Olivier Award for Best New Musical\n* List of Tony Award-nominated productions\nReferences\nExternal links\n* [http://www.tonyawards.com/en_US/index.html Tony Awards Official site]\n* [https://web.archive.org/web/20131219011248/http://www.ibdb.com/advancesearchaward.asp Tony Awards at Internet Broadway database Listing]\n* [http://www.broadwayworld.com/tonyawardsdb.cfm Tony Awards at broadwayworld.com]"
    }
  ]
}