{
  "content": [
    {
      "type": "text",
      "text": "# Tony Stewart (American football)\n\n| birth_place = Lohne, West Germany\n| height_ft   = 6\n| height_in   = 5\n| weight_lbs  = 260\n| high_school = Allentown Central Catholic\n| college     = Penn State\n| draftyear   = 2001\n| draftround  = 5\n| draftpick   = 147\n| pastteams   =\n* Philadelphia Eagles (–)\n* Cincinnati Bengals (–)\n* Oakland Raiders (–)\n| highlights  =\n* Second-team All-Big Ten (2000)\n| statlabel1  = Receptions\n| statvalue1  = 76\n| statlabel2  = Receiving yards\n| statvalue2  = 623\n| statlabel3  = Receiving touchdowns\n| statvalue3  = 3\n| pfr         = StewTo00\n}}\nin November 2008]]\nTony Alexander Stewart (born August 9, 1979) is a former American football tight end. He is the founder and executive director of the non-profit Beyond the Locker, which helps youth and athletes. He also works as a lead consultant to the National Football League (NFL) in the player engagement department.\nStewart was the inaugural recipient of the Maxwell Award.\nEarly life and education\nStewart was born in Lohne, West Germany, on August 9, 1979. He attended Allentown Central Catholic High School in Allentown, Pennsylvania, where he played high school football in the East Penn Conference, one of the premier high school football leagues in the nation, and earned first team All-American honors. Stewart also played high school baseball and basketball at Allentown Central Catholic.\nHe received 30 scholarship offers after his junior season. His top choices were the University of Miami, University of Michigan, and Penn State University. In addition to football scholarship offers, Boston University offered him a scholarship to play college basketball.\nCollegiate career\nStewart accepted a football scholarship from Penn State, where he was a two-year starter. He finished his college career with 59 receptions for 861 yards and three touchdowns. As a senior, he became the first tight end since 1979 to lead Penn State in receiving (38-451, 2 touchdowns). His 38 catches as a senior set a Penn State season record for a tight end. He earned honorable mention All-America honors from Football News as a senior, and earned a bid to the 2001 Hula Bowl. He was also named second team All Big-Ten.\nHe graduated with a Bachelor of Science in recreation and parks management from Penn State in 2003.\nProfessional career\nPhiladelphia Eagles\nStewart was selected in 2001 by the Philadelphia Eagles in the fifth round (147th overall). He made his NFL debut in the Eagles' game against the Kansas City Chiefs on November 29, 2001, making 2 catches, including a 1-yard touchdown reception from Eagles' quarterback Donovan McNabb. With this touchdown, Stewart became the first Eagle since Charlie Garner in 1994 to score a touchdown in his first game. He finished his rookie season with 5 catches for 52 yards.\nCincinnati Bengals\n2002 season\nIn 2002, he began the preseason with the Philadelphia Eagles, but was placed on the inactive list for the Eagles' season opener against the Tennessee Titans. He was subsequently assigned to the practice squad and signed with the Cincinnati Bengals on November 23, 2002. He made his 2002 playing debut with the Bengals on December 15, 2002, versus the Jacksonville Jaguars.\n2003 to 2005 seasons\nStewart went on to have career highs in receptions (21) and yards (212) during the 2003 season. He played 16 games for the Bengals in 2004, making 10 catches and a touchdown. He also made his mark as a mainstay on special teams, racking up seven tackles and a forced fumble that year. Stewart saw significant playing time on offense and special teams in 2005. A back injury later that season broke his streak of 40 consecutive games played for the Bengals.\n2006 season\nStewart signed a one-year contract extension with the Bengals during the 2006 offseason.\nOakland Raiders\n2007 to 2010 seasons\nOn March 9, 2007, Stewart signed a two-year contract with the Oakland Raiders. He played in 32 games and made 11 receptions for 81 yards in 2 seasons with the Raiders. He became a free agent at the conclusion of the 2008 season, but re-signed with the team on March 4, 2009. On August 30, 2010, Stewart was released by the Raiders.\nNFL career statistics\n{| class=\"wikitable mw-collapsible mw-collapsed\"\n! colspan=\"2\"| Legend\n|-\n| Bold\n| Career high\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=\"2\"| Year\n!rowspan=\"2\"| Team\n!colspan=\"2\"| Games\n!colspan=\"6\"| Receiving\n|-\n! GP !! GS !! Tgt!! Rec !! Yds !! Avg !! Lng !! TD\n|-\n! 2001 !! PHI\n| 3 || 1 || 8 || 5 || 52 || 10.4 || 15 || 1\n|-\n! 2002 !! CIN\n| 3 || 0 || 1 || 1 || 6 || 6.0 || 6 || 0\n|-\n! 2003 !! CIN\n| 16 || 7 || 33 || 21 || 212 || 10.1 || 21 || 0\n|-\n! 2004 !! CIN\n| 16 || 9 || 25 || 10 || 48 || 4.8 || 9 || 1\n|-\n! 2005 !! CIN\n| 14 || 3 || 6 || 4 || 26 || 6.5 || 10 || 0\n|-\n! 2006 !! CIN\n| 16 || 3 || 18 || 14 || 120 || 8.6 || 26 || 1\n|-\n! 2007 !! OAK\n| 16 || 0 || 0 || 0 || 0 || 0.0 || 0 || 0\n|-\n! 2008 !! OAK\n| 16 || 4 || 15 || 11 || 81 || 7.4 || 17 || 0\n|-\n! 2009 !! OAK\n| 15 || 4 || 15 || 10 || 78 || 7.8 || 19 || 0\n|-\n! colspan=\"2\"| [https://www.pro-football-reference.com/players/S/StewTo00.htm Career] !! 115 !! 31 !! 121 !! 76 !! 623 !! 8.2 !! 26 !! 3\n|}\nPersonal life\nStewart lived in Germany until age 3 while his father, Malcolm, served in the U.S. Army. His mother, Gisela, is a native German and raised Stewart to be bilingual in English and German. He lives in San Ramon, California in the off-season with his wife and children.\nA nomination by Stewart led to his third-grade teacher winning the [http://www.jointheteam.com/programs/program.asp?p=33&c=1 National Football League's 2004 Teacher of the Year award]. Wanda Benkovic of Holy Spirit School in Allentown, Pennsylvania won the award and received $5,000 plus a trip to the Pro Bowl in Hawaii. The school received $10,000 from the NFL. Stewart credited Benkovic with helping him weather a difficult transition in 1987, as he switched from public to parochial school. \"She made me feel like number one in a class of 21,\" Stewart said.\nWhen Bay Area charity Hope 4 the Heart's warehouse was damaged in a 2008 fire, Stewart hosted a raffle fundraiser in Hayward, California to collect toys to replace those lost. The organization distributes toys to underprivileged children during the holidays.\nIn 2003, Stewart met Tony Stewart, the NASCAR driver of the same name. They were featured in pre-race ceremonies. Stewart was also grand marshal and gave the command to start the race. Stewart was a member of the Bengals at the time.\nIn June 2009, Stewart took part in the 2009 NFL/NFLPA \"Broadcast Boot Camp,\" a program designed by the NFL Broadcasting Department and their broadcast partners to prepare players for possible post-playing careers in broadcasting.\nIn 2012, Stewart collaborated with Hopkins Junior High in Fremont, California to be in an assembly called \"Beyond the Locker\" and \"I Got Skills\" training drills.\nReferences\nExternal links\n*[https://web.archive.org/web/20070821063437/http://www.the-ozone.net/football/2000/00allbigten.htm \"The 2000 All-Big Ten Team\"] featuring Tony Stewart."
    }
  ]
}