{
  "content": [
    {
      "type": "text",
      "text": "# Tony Ballantyne (historian)\n\nAnthony John Ballantyne (born Dunedin, 1972) is a New Zealand historian at the University of Otago, Dunedin, New Zealand.  His research has focused on the cultural impact of British imperialism in New Zealand, Ireland, India and Britain. Ballantyne also played a role in shaping  the \"new imperial history\" movement and pioneered the \"webs of empire\" methodology for writing colonial histories. He also served as Pro-Vice-Chancellor of Humanities at Otago University between 2015 and 2020 and subsequently led the university's Division of External Engagement. In 2024 Ballantyne was awarded a Distinguished Professorship at the university.\nAcademic career\nAfter completing his schooling at King's High School, Dunedin, Ballantyne graduated BA at the University of Otago, Dunedin and obtained a PhD at the University of Cambridge. After brief stints abroad at the National University of Ireland and the University of Illinois, he returned to the University of Otago in 2002 where his career advanced.\nBallantyne has established a scholarly reputation within New Zealand academic circles primarily, including being elected as a Fellow of the Royal Society of New Zealand in 2012. In 2016 he was awarded the Humanities Aronui Medal from the Royal Society of New Zealand.\nBallantyne's work examines the development of imperial intellectual and cultural life in New Zealand, Ireland, India, and Britain. The work is derived from the tradition of scholarship that sees colonialism as a cultural undertaking as well as a political and economic project.\nHe has analysed the British Empire as a 'web,' with 'vertical' connections developing between Britain and its colonies and 'horizontal' connections linking various colonies directly. He has helped shed light on how these 'webs of empire' incorporated new lands and peoples. More specifically, Orientalism and Race (2001) analysed the 'orientalizing' texts of British officials in colonial India and their attempts to decode both Hinduism and Sikhism more broadly in terms of their understandings of Aryanism and race; at the same time it examined similar discourses directed toward understandings of Māori as, first, 'Semitic', then Indo-Aryan, and ultimately, Māori reconfigurations of Christianity on their own terms. Ballantyne's work has received its share of criticism. For example, some scholars have criticised Ballantyne's analyses as informed by an ‘egregious understanding of race’.\nWith regard to Sikh studies, Ballantyne has been among those who have critiqued scholarship that focuses too much on Sikh textual traditions, arguing that the experiences of colonialism and migration have been crucial in making Sikh identities.\nDuring the 2010s, Ballantyne has returned to focus on New Zealand's colonial history. This work has sought to connect New Zealand's colonial culture by noting the links with China and India. Along the lines of Benedict Anderson's formulation of 'print capitalism', Ballantyne has, in turn, addressed the place of print culture and literacy in the encounters between Māori and the Pākehā colonists. He has also addressed the place of race and religion in cross-cultural history  His most recent work, Entanglements of Empire (2014), focuses on early New Zealand history and the foundations of relationship between Māori and Pākehā. It was awarded the W.H. Oliver prize for the best book on New Zealand history between 2013 and 2015 by the New Zealand Historical Association.\nWith Antoinette Burton he has also written about world history, highlighting the importance of race and gender in cross-cultural encounters.\nAdministrative positions\nBallantyne was Pro-Vice-Chancellor of Humanities at Otago's Dunedin campus from 2015 to 2020, a time characterised by controversy. He initiated processes that resulted in sixteen full-time equivalent academic staff being made redundant, with other academics impelled to take early retirement. He also advocated eliminating the Art History program and it was subsequently disestablished. These and related actions were reported extensively in the press. Articles and editorials exposed a 'negative, top-down, management culture that undermined trust, productivity and mental health' and that created a 'climate of suppression...and fear of repercussions'. This produced 'demoralised teachers and researchers' who were 'locked in pain and anger at what their institution had become'. '[E]ven the brightest and best academics secure in their status and position' felt 'acute discontent'. Concerns about Otago's top-down management style and its deleterious effect on morale were widely expressed, including by Sir David Skegg, in a highly unusual intervention by a previous Vice-Chancellor of the university itself. Disputing Ballantyne's claim that redundancies were necessary because of declining enrolments, Skegg emphasised that '[a]ny financial crisis at Otago cannot be attributed to falling student numbers'.\nIn October 2020 the University of Otago stated that, as of 2021, Ballantyne would no longer serve as PVC and would instead lead the University's Division of External Engagement to attend to alumni relations and liaising with secondary schools, among other matters. In this capacity Ballantyne also led the creation of a new university logo, with the effort criticised for costing about $700,000 whilst large numbers of academic staff were made redundant on the grounds of budgetary shortfalls.\nHowever, this new logo and name for the University strengthed ties with Mana Whenua, and reflect the Universities commitment to being a Te Tiriti led institution.\nIn early 2024 it was announced Ballantyne would be stepping down from External Engagement,and would be returning to teach in the History programme. Recruitment to replace Ballantyne was under way as of March 2024.\nWorks\n*Entanglements of Empire: Missionaries, Māori, and the Question of the Body (Duke University Press, 2014).\n*''Webs of Empire: Locating New Zealand's Colonial Past (Bridget Williams Books, 2012).\n*Between Colonialism and Diaspora: Sikh Cultural Formations in an Imperial World (Duke University Press, 2006).\n*Orientalism and Race: Aryanism in the British Empire (Cambridge Imperial and Post-Colonial Studies Series, Palgrave, 2001).\n*Co-editor, Moving Subjects: Gender, Mobility and Intimacy in an Age of Global Empire (University of Illinois Press, 2007).\n*Editor, Textures of the Sikh Past: New Historical Interpretations (Oxford University Press, 2007).\n*Co-editor, Disputed Histories: Reimagining New Zealand's Pasts (Otago University Press, 2006).\n*Co-editor, Bodies in Contact: Rethinking Colonial Encounters in World History'' (Duke University Press, 2005).\nReferences\nExternal links\n* [https://web.archive.org/web/20100603071833/http://www.otago.ac.nz/historyarthistory/staff/tony_b.html Research summary, Otago University]\n* [http://www.otago.ac.nz/humanities/about/otago166401.html Staff Profile, Otago University]"
    }
  ]
}