{
  "content": [
    {
      "type": "text",
      "text": "# Topography of ancient Rome\n\nThe topography of ancient Rome is the description of the built environment of the city of ancient Rome. It is a multidisciplinary field of study that draws on archaeology, epigraphy, cartography and philology. The word 'topography' here has its older sense of a description of a place, now often considered to be local history, rather than its usual modern meaning, the study of landforms.\nThe classic English-language work of scholarship is A Topographical Dictionary of Ancient Rome (1929), written by Samuel Ball Platner, completed and published after his death by Thomas Ashby. New finds and interpretations have rendered many of Platner and Ashby's conclusions unreliable, but when used with other sources the work still offers insights and complementary information.\nIn 1992, Lawrence Richardson published A New Topographical Dictionary of Ancient Rome, which builds on Platner and Ashby. The six-volume, multilingual Lexicon Topographicum Urbis Romae (1993‑2000) is the major modern work in the field.\nHistory of the discipline\nRenaissance beginnings\nAncient Roman topography as a systematic field of study began with the Italian Renaissance. The humanists express both a sense of rupture from the classical past brought about by the \"Dark Ages\" and a desire to rediscover antiquity. The renewed interest in classical texts, facilitated by the new technology of the printing press, was paralleled by inquiry into the physical monuments of ancient Rome, coinciding with a contemporary building boom in the city.\nAmong the early topographers of ancient Rome were the 15th-century humanists Poggio Bracciolini and Flavio Biondo. Poggio's De varietate fortunae (\"On the Vagaries of Fortune\") was a nostalgic and moralizing evocation of a lost Rome of triumphs, spectacles, and grand monuments, but it also contained detailed descriptions of temples, baths, arches, amphitheaters and other landmarks as artifacts subject to intellectual inquiry, in contrast to medieval mirabilia literature. Poggio researched ancient texts such as Frontinus's work On the Water Supply of the City of Rome and examined inscriptions, compiling a volume of epigraphy from ancient monuments: \"Through such diligence, Poggio pioneered the way to reconstruct in historically accurate terms the topographical reality of the ancient city.\"\nBiondo, like Poggio an Apostolic Secretary, produced a series of volumes surveying the topography of the ancient city as well as Roman Italy: Roma instaurata (1440–46), Italia illustrata (1448–53), and Roma triumphans (1456–60). In these works, Biondo took an antiquarian or archaeological approach, as distinguished from his historical writing in the Decades which influenced Gibbon.\nHe organized his material by topic, and not only described and identified gates, obelisks, baths, circuses, and other monuments, but explained their function and purpose. Among his literary and documentary sources were Livy's history of Rome, the letters of Pliny, Varro's De lingua latina, Festus, the regionary catalogues, and the newly discovered manuscripts of Tacitus and Frontinus.\nAlthough Renaissance researchers did not engage in archaeological digs, the archaeological and topographical perspective was fundamental to humanism, and they were alert to finds of antiquities. Biondo, for instance, was able to locate the atrium of the Theater of Pompey after a Roman lawyer who was having his wine cellar enlarged found a massive block of dressed stone inscribed with cubit-high letters reading Genius theatri Pompeiani.\nBiondo's methodology and use of textual sources influenced the archaeological, antiquarian, and topographical study of ancient Rome among his fellow humanists for the next 80 years. Among these were Pomponius Leto, who edited the Notitia regionum Urbis based in part on his experience as a tour guide; Bernardo Rucellai, with his compilation De Urbe Roma; and Andrea Fulvio, who published his massive Antiquitates Urbis in the spring of 1527, just before the sack. The successor to Biondo's work was the seven-volume Antiquae Romae topographia of Bartolomeo Marliani, first published in May 1534, but riddled with typographical errors. Bartolomeo credited the collaboration of various scholars, singling out Annibale Caro.  The work was republished in a corrected, augmented second edition in 1544, as Urbis Romae topographia'' and rededicated, this time to Francis I of France. It was this second edition that was often reprinted, complete and in epitomes, and translated into the modern languages of Europe. But the first edition was the basis for an edition published the same year at Lyon, that was thoroughly revised and augmented by François Rabelais and dedicated to Jean du Bellay, with whom Rabelais had been staying in Rome in March through April 1534, just before Marliani's Topographia appeared; it would appear that Rabelais had contact with Marliani.\nSee also\nA category of articles that deal with this subject may be found at :Category:Topography of the ancient city of Rome.\n* 14 regions of Augustan Rome\n* Vicus (Rome)\n* Forum (Roman)\n* Imperial fora\n* Architecture of ancient Rome\n* Forma Urbis Romae\n* Roman temple\n* Seven hills of Rome\nLists:\n* List of ancient monuments in Rome\n* List of aqueducts in the city of Rome\n* List of obelisks in Rome\n* List of parks and gardens in Rome\nNotes\nFurther reading\n* d'Ambra, Eve, 2009. \"Topography of Rome\", Oxford Bibliographies [https://www.oxfordbibliographies.com/view/document/obo-9780195389661/obo-9780195389661-0067.xml online]\n* Aicher, Peter J. 2004. Rome Alive: A Source-Guide to the Ancient City. 2 vols. Wauconda, IL: Bolchazy-Carducci.\n* Ammerman, Albert. 1990. \"On the Origins of the Roman Forum.\" American Journal of Archaeology 94:627–645.\n* Ball, Larry F. 2003. The Domus Aurea and the Roman Architectural Revolution. Cambridge, UK and New York: Cambridge Univ. Press.\n* Boatwright, Mary T. 1987. Hadrian and the City of Rome. Princeton: Princeton Univ. Press.\n* Claridge, Amanda. 1998. Rome: An Oxford Archaeological Guide to Rome. Oxford: Oxford Univ. Press.\n* Haselberger, Lothar and John Humphrey, eds. 2006. Imaging Ancient Rome: Documentation, Visualization, Imagination. Proceedings of the Third Williams Symposium on Classical Architecture, May 20–23, 2004, supp. 61. Portsmouth, RI: Journal of Roman Archaeology.\n* Kantor-Kazovsky, Lola. 2006. Piranesi as Interpreter of Roman Architecture and the Origins of his Intellectual World. Florence: L. S. Olschki.\n* Purcell, Nicholas. 1987. \"Tomb and Suburb.\" In Römische gräberstrassen: Selbstdarstellungen, status, standard. Edited by Henner von Hesberg and Paul Zanker, 25–41. Munich: Verlag der Bayerischen Akademie der Wissenschaften\n* Richardson, Lawrence, Jr. 1992. A New Topographical Dictionary of Ancient Rome. Baltimore: Johns Hopkins Univ. Press.\n* Taylor, Rabun M. 2000. Public Needs and Private Pleasures: Water Distribution, the Tiber River, and the Urban Development of Ancient Rome. Rome: L’Erma di Bretschneider.\nExternal links\n*[https://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/Europe/Italy/Lazio/Roma/Rome/_Texts/home.html Topographia Urbis Romae] at LacusCurtius\n*[http://romereborn.frischerconsulting.com/ 3D model of the city of Rome in 320 AD] via the academic project \"Rome Reborn\""
    }
  ]
}