{
  "content": [
    {
      "type": "text",
      "text": "# Total War Saga: Thrones of Britannia\n\n| programmer   = Mihai Simionescu\n| writer       =\n| artist       = Nick Tresadern\n| composer     = Jack Melham\n| engine       =\n| series       = Total War\n| released     =\n| genre        = Turn-based strategy, real-time tactics\n| modes        = Single-player, multiplayer\n| platforms    = Windows, macOS, Linux\n}}\nTotal War Saga: Thrones of Britannia is a turn-based strategy and real-time tactics video game developed by Creative Assembly and published by Sega, released on 3May 2018 for Windows. The game was brought to macOS and Linux by Feral Interactive on 24 May 2018 and 7 June 2018 respectively. It is the twelfth game in the Total War series of video games.\nThe game is set in the British Isles, 878 AD. There are ten playable factions, including Wessex, Mercia, Circenn, Mide, Gwined, and the Danelaw.\nGameplay\nLike its predecessors, the game is both a turn-based strategy and real-time tactics game. The game takes place in the British Isles in 878 AD, after Alfred the Great defeated the Danes at the Battle of Edington and the signing of the Treaty of Wedmore. Players assume control of various factions including Vikings, British clans and Anglo-Saxons, and compete against each other to be the new king. In the game, players command different military units and move them around the map. They can also fund research for new projects, recruit and manage new characters for their cause, and engage in diplomacy with other factions.\nDevelopment\nThrones of Britannia is the first game in the Total War Saga series, which was developed by Creative Assembly to be a shorter but more focused Total War game by focusing on a particular time period in history instead of being era-spanning. According to Mike Simpson, the series director, the Saga series aims at \"putting defined geographical areas under the microscope\" with a \"strong cultural focus and flavour\". Initially the game was set to be released on 19 April 2018, but Creative Assembly delayed the game's launch to 3 May 2018 in order to have extra time for polishing the game.\nReception\n| PCGUS = 73/100\n| IGN = 7.7/10\n| USG = 3.5/5\n| PCGN = 8/10\n| GSpot = 8/10\n| rev1 = CGMagazine\n| rev1Score = 9/10\n}}\nThe game has received positive reviews. It has an aggregated score of 75 on Metacritic, indicating \"Generally favorable reviews\". The game garnered some criticism for what some perceived as stripped campaign and issues with combat compared to previous games, and a lack of variation between factions.\nThe game won the award for \"Best Strategy Game\" at The Independent Game Developers' Association Awards 2018; its other nominations were for \"Best Educational Game\", \"Best Audio Design\", and \"Heritage\".\nReferences\nExternal links\n*"
    }
  ]
}