{
  "content": [
    {
      "type": "text",
      "text": "# Total Annihilation: Kingdoms\n\n| producer = Ron Gilbert\n| designer = Clayton Kauzlaric\n| programmer = Brian W. Brown\n| artist =\n| writer =\n| composer = Jeremy Soule\n| released = June 25, 1999\n| genre = Real-time strategy (RTS)\n| series = Total Annihilation\n| modes = Single-player, multiplayer\n| platforms = Microsoft Windows\n}}\nTotal Annihilation: Kingdoms, or shortened to Kingdoms, is a fantasy real-time strategy video game released on June 25, 1999, as a spin-off of Total Annihilation, and was the last title developed by Cavedog Entertainment. A tie-in book titled The Chronicles of Darien contained the storyline, rules, units, and other details. An expansion pack, The Iron Plague, was released in 2000.\nGameplay\nThe game is played from a bird's eye perspective.  Players choose between four factions - Aramon, Veruna, Taros and Zhon (As well as Creon, in the Iron Plague expansion), all of which start with a monarch, who is initially used to build structures and form an army.  The monarch itself also possesses an array of spells which it can use to defend itself or turn the tide of the battle.  While in single-player mode, victory is accomplished by following each scenario's objectives, multiplayer mode offers victory by the destruction of all the faction's units and structures or simply the monarch alone.  Unlike Total Annihilation, players utilize a single resource (Mana), which can be generated and increased by building resource-gathering Lodestones in special locations.  However, like in Total Annihilation, players can recycle debris/carcasses of fallen units and structures as well as natural objects of the map, like trees and stones, to acquire instant amounts of mana.\nComparison to Total Annihilation\nTotal Annihilation: Kingdoms is the second installment of the Total Annihilation franchise. Although the game is neither a prequel nor a sequel to the original Total Annihilation, comparisons between the two games are inevitable. There are numerous thematic and design differences between Total Annihilation and Kingdoms.\n*A more in-depth storyline, told with cutscenes between missions, just as Total Annihilation had, but with more detail\n*A change from a futuristic to a fantasy setting\n*Simplified resource management, with just one resource (mana) instead of two (metal, energy)\n*Four sides at the start, as opposed to the original's two, with an expansion pack that added a fifth\n*While the original Total Annihilation has players playing through the Core or Arm campaigns separately, Kingdoms switches between the four groups, players playing each side as the levels progress.\n*Unlike the original Total Annihilation, which has most of the units on its two factions virtually the same, other than in appearance, Kingdoms has very distinct characteristics between factions.\nDetails\nPlayers must seek out lodestones to build mana tapping structures on, getting the renewing energy to build structures and units with.\nPlayers can choose between the original game balancing or the \"Crusades\" balancing, which was added in after feedback from online play, it allowing defensive structures to do more damage against most tier 1 units to prevent rushes.  They can also choose whether to end the game after their opponent's monarchs is killed, or to keep playing until all of their enemy's units and unit producing structures are destroyed.  Up to eight players can be in a game, either human players or game AIs.\nAdditional units were created and freely released by Cavedog after the game was released, as well as additional maps and scenarios.\nMultiplayer mode\nTAK can be played online through Game Ranger. Up to 8 players can play together at a time either on teams or against one another. This mode of the game also enables scripting (mission-type games in multiplayer) to be played.\nStory\nSetting\nTotal Annihilation: Kingdoms is set on the medieval world of Darien, a mystic world previously ruled by the Kandrans, a civilization with incredible mastery of magic, but that quickly came to its downfall due to internal power struggles. Decades would come by before the inhabitants of Darien became reunited again, this time under the rule of Garacaius, a simple fisherman turned warlord and then a master of magic himself.  At the apex of his power, and following the death of his wife, Lasha, he divided the empire's administration between his four sons and daughters:  Elsin gained the rich continent of Aramon, Kirenna was awarded the islands of Veruna, Thirsha was delivered the jungles of Zhon and to Lokken was remained the wastelands of Taros.\nThe story for TAK begins shortly after the mysterious disappearance of Garacaius, which automatically led to the disintegration of his empire, but not before he instituted a law prohibiting the use of magic, except in the case of extreme necessity, which brought a grudging division between the brothers and sisters: while Elsin and Kirenna obeyed their father's wishes, expanding the military and economic power of their lands through pure commerce and science, Thirsha and Lokken refused to obey the law, continuing the practice of magic for their own interest and leisure.\nPlot\nFollowing a series of undead attacks in the smallest provinces of Aramon, the citizens become alarmed when it's discovered that Lokken has achieved the power to form undead armies, and marching them towards the capital of Kaluen, with the clear intent of killing Elsin and conquering the continent. Meanwhile, in Veruna, tensions escalate to open warfare when Zhon drakes sent by Thirsha attack one of the many shipyards, forcing Kirenna to send an expedition to contain the advance, but the expedition never returns. In Aramon, while Elsin and his armies have yet not revealed themselves, allowing the undead to roam freely around the land, the lord commander of Eastern Aramon sends a noble knight named Joreth of Heldain to Zhon in the hopes of reclaiming the Heart of Thesh, an ancient Kandran artifact believed to be the solution to Lokken's advances, who also arrives personally to oversee the campaign.\nThe situation in Aramon is believed to be countered when Elsin finally appears, utilizing Gunpowder-based weaponry to drive off the undead hordes, but betrayal is committed by Lord Buriash (a powerlust driven noble who ruled Aramon prior to Elsin's ascension), who joins forces with Taros in exchange that he'll rule Aramon under Lokken's as a vassal state when Elsin falls.  With the combined power of Lokken's necromancy and Buriash's gunpowder mastery, Taros advances undeterred once more across Aramon.  In Veruna, Zhon and Taros attempt staging sieges against Lendra, the capital city, but the threat is countered thanks to two interventions:  The first coming from Joreth, who shipwrecks at Veruna and seeks a new transport ship, helping counter an assault at the city of Lothol in the process, and Aramon, who arrives with the power of gunpowder, quickly adapted to the navy by the efforts of Kirenna's second-in-command, Commodore Solan Rixx.  Having driven Zhon and Taros from Veruna, Kirenna presses her advantage by directly assaulting Zhon, but underestimates both the zeal of Zhon's inhabitants, the dense jungles and the appearance of Thirsha, who rallies the tribes around her and summons Stone Giants and Kraken to deal severe damage to Veruna's forces. Veruna intensifies military presence in Zhon, bringing the conflict to a stalemate.\nThe turning point in Aramon comes at the moment of Taros' siege of Kaluen, when Elsin dispatches a messenger with a poison dagger to assassinate Lord Buriash. The messenger succeeds, forcing the surrender of the Aramon troops loyal to Buriash, the counter-attack by Elsin's forces and even an open peasant rebellion in Buriash's lands.  Still, with the enemy driven back and Lokken forced to return to Taros, the undead presence remains strong across Aramon.  Elsin tries to deliver Lokken a lesson in demonstration by dispatching Lordling Dernhest and an expedition to conquer the Taros' merchant town of Shekelesh, but Lokken turns the city into a deathtrap, as the full force of Taros' armies descends upon the town and massacres all of the expedition. Veruna also attempts to contribute, sending a task force to the Taros controlled islands of Zakum to establish a beachhead, provoking a prison break and executing the island's ruler, Baron Leimar, but most of the released prisoners succumb to prolonged disease from the island's precarious conditions.\nJoreth arrives at Zhon, namely the temple where the Heart of Thesh is kept, but discovers the artifact has already been taken by Lokken, who was aware of the artifact's magical properties. Joreth travels to Taros, in a suicide mission to recover the Heart from the Temple of Belial in Elam, succeeding and return the artifact to Aramon.  In a ritual sacrifice, the Aramon priests use the Heart of Thesh to resurrect an ancient Gold Dragon, whose fearsome firepower starts cleansing the land of Aramon, finally bringing an end to the undead presence. The dragon is then sent to Veruna, where it cleanses the islands of both Taros and Zhon presence. In Zhon, the prolonged conflict takes its toll in the land's ferocious defenders, forcing Thirsha to rely on traps and guerrilla tactics to try and gain an edge, but the appearance of the Gold Dragon crushes the last hope for Zhon, wounding Thirsha and forcing her and all Zhon warriors to retreat on foot to the mountains of Ulassem, the unofficial capital of the continent.\nBelieving that Zhon's threat is finally contained, Elsin and Kirenna turn their attention to Taros, staging a full-scale campaign towards Elam, Lokken's capital city. Taros' undead armies and mages hold off the enemy fiercely, but still fall to the combined power of gunpowder and the dragons awakened by the Heart of Thesh.  However, Taros manages to keep the enemy at bay long enough to transport a mysterious cargo (Revealed in 'The Iron Plague' to be Lokken's essence) to a merchant ship that breaches the Veruna naval blockade. Backed to a corner with no means of escape, Lokken fights to the death in his citadel in Elam, his head being impaled in a stake, as demonstration for Taros' survivors of the fate of their struggle.  Veruna and Aramon's armies return to their respective lands, preparing to rebuild, as Zhon remains secluded in their fortress planning their next move.\nThe Iron Plague\nSet weeks following the events of the original story, it's revealed that the discovery of gunpowder was not originally of Aramon, but instead was a knowledge bought from the distant, science-driven nation of Creon, expected to be paid in large gold amounts.  However, the Verunan ships transporting the payment are pillaged and sunk by fanatical Taros' servants known as the 'Cult of Lokken', led by High Priest Heligrin.  When Veruna dispatches a fleet to investigate, they unexpectedly meet Creon's ironclad armada that also was sent to investigate the payment's disappearance, and the hot-headed Verunan fleet captain Rattenbrass readily engages the Creon navy, provoking an incident that forces Kirenna to forfeit the isle of Caora in an attempt to maintain peace.  The effort is in vain, however, as the inhabitants of Caora rise in revolt against Creon's occupation forces and the act draws Elsin's ire, as the isle was once an Aramon protectorate.  Kirenna later recants and reconciles with Elsin, temporarily reclaiming Caora from Creon in a joint assault, but are nonetheless driven away by Creon's superior firepower and numbers, allowing Creon to invade Aramon, where Elsin provides fierce resistance.\nIn Taros, Heligrin's forces discover Creon had already landed and were attempting to salvage the merchant ship which carried Lokken's mysterious cargo - a strange bottle - but had shipwrecked.  Despite the vicious assault, Heligrin is unable to recover the bottle in time, forcing him depart to Zhon to plead the ever-reclusive Queen Thirsha for aerial transports towards Creon, where the bottle was taken.  Thirsha reveals the bottle contains Lokken's essence and that, days prior to his death, Lokken himself confided an artifact to Thirsha that would allow his resurrection.  Meanwhile, bounty hunters storm the Cult of Lokken and discover the original treasure chests meant for Creon.  When Elsin learns of this, realizing all attempts of reconciling with Creon are now hopeless, he leads an expeditionary force towards Creon through an ancient mountain cave network, leaving the defense of Aramon to his generals.  Elsin's departure, however, causes the lords of Northern Aramon to defect to Creon, plunging the continent into civil war amidst an invasion.  When Veruna's navy is almost decimated attempting to defeat Creon's armada and break its supply chain, Kirenna beholds a vision of Elsin's expedition and equally departs Veruna with a force towards Creon, in hopes that striking down their Sage, Menelos, will halt Creon's invasion of Darien.\nThe combined Zhon-Taros forces track the bottle to a research facility deep within Creon, and accomplish in resurrecting Lokken, who wastes no time in establishing a force of undead in the heart of Creon's mainland.  While Aramon manages to traverse the caverns and into the mainland of Creon, they fail in their first sieges of the capital of Atys until relief comes in the form of Kirenna's expedition.  They are also shortly joined by Thirsha and Lokken's forces, who join ranks for the siege in spite of disagreements and accusations of each other's deeds that led to the new war.  Despite the fierce resistance and technological superiority, Atys' defenses collapse fighting four forces at once, and Menelos falls in battle, ending the war.  Surveying the capital, the four monarchs become shocked when they discover the crypt of Garacaius, their father.  It's revealed that Garacaius departed Darien in disgust of his former land and headed to Creon to forge a nation purely based in science, that he hoped would conquer Darien in the future - his final law, forbidding the use of magic, was an attempt to catch Darien powerless.\nIn the epilogue, the four monarchs depart Creon, collapsing the cave network entrance they came from in a gigantic explosion. Knowing that their founder was a practitioner of magic himself, the nation of Creon isolates itself from the rest of the world.  Back in Darien, the monarchs go their separate ways - Kirenna starts rebuilding Veruna and attempts to reforge relationships with Creon, Lokken returns to Taros, but under heavy watch of both his siblings and even his loyal subjects, as resurrection without the presence of the original body, as in Lokken's case, is considered a heretical practice even by Taros. Thirsha returns to Zhon and isolates herself, and Elsin returns to Aramon, quelling the civil war, but visibly shaken by the revelations.\nThe Iron Plague\nOn March 6, 2000, shortly before Cavedog's collapse, an expansion pack was released, titled The Iron Plague.  The premise of the sequel continued the storyline of the lost father of magic, Garacaius.  Believing that magic was a source of conflict, Garacaius fled his kingdom and founded a new empire based on science and engineering, as opposed to magic.  This new empire, Creon, quickly dominated the neighboring provinces and absorbed the knowledge of their conquests.  Garacaius himself died, but the elected ruler of Creon (in a steam-powered robotic suit) eventually led the kingdom on a crusade against magic and the magical sibling rulers of Darien. The expansion pack added an entirely new faction to the game (the science and engineering kingdom of Creon), as well as hundreds of new maps and entirely new graphics for map tile sets.  It included the newest patch for the game, although anyone could freely download this from the official site.\nReception\nRick Sanchez reviewed the PC version of the game for Next Generation, rating it three stars out of five, and stated that \"Kingdoms is a well crafted, if a little dumbed-down, RTS title that offers good gameplay but not genre-advancing game design.\"\nMark Asher of CNET Gamecenter wrote that \"Kingdoms didn't do too badly [commercially], but with a much larger development and marketing budget than ''TA's [Total Annihilation''], it certainly underperformed when compared to that title.\"\n*IGN gave it a rating of 6.9 stating that \"Cavedog's me-too fantasy game is beautiful, but the gameplay leaves a lot to be desired.\"\n*Cnet originally gave it a bad review partly for the heavy lag in-game, then stated this problem was fixed with the free 2.0 patch and gave a more positive review. Cnet gave it  stars out of 5.\nReferences\nNotes"
    }
  ]
}