{
  "content": [
    {
      "type": "text",
      "text": "# Totonac culture__disambig_1\n\nThe Totonac culture or Totonec culture was a culture that existed among the indigenous Mesoamerican Totonac people who lived mainly in Veracruz and northern Puebla. Originally, they formed a confederation of cities, but, in later times, it seems that they were organized in three dominions: North, South and Serran.\nIts economy was agricultural and commercial. They had large urban centers such as: El Tajín (300–1200), which represents the height of the Totonac culture, Papantla (900–1519) and Cempoala (900–1519).\nThe three centers or three hearts of their culture stand out for the very varied ceramics, the stone sculpture, the monumental architecture and advanced urban conception of the cities. Advances and perfection of forms achieved in the production of yokes, palms, axes, snakes, smiley faces and monumental mud sculptures are admirable.\nToponymy\nAccording to the Dictionary of the Nahuatl or Mexican Language, the term totonaca is the plural of totonacatl and refers to the inhabitants of the province of Totonacapan. Some authors have pointed out that the term \"totonaco\" means \"man of hot earth\". In the Totonac language this word is composed by the terms tu'tu or a'ktu'tu referring to the number \"three\" and nacu meaning \"heart \". The Totonacs use this term in the sense that Cempoala, Tajín and the Castillo de Teayo are the three representative centers of the group.\nHistory\nThe ancient Totonacs developed in the central part of Veracruz and towards the Late Classic period, their occupational area reached south to the Papaloapan River basin, west to the municipalities of Acatlán state of Oaxaca, Chalchicomula state of Puebla, the Perote Valley, the mountains of Puebla and Papantla and the lowlands of the Cazones River. The most relevant of the Totonac culture was reached during the Late Classic when they built ceremonial centers such as El Tajín, Yohualichán, Nepatecuhtlán, Las Higueras, Nopiloa and Zapotal. This area is known as the Totonacapan, the suffix Nahuatl -pan (over) refers to \"place\" or \"land\".\nIn 1519 a meeting took place among 30 Totonac towns in the City of Cempoala. This would seal forever his future and that of all the Mesoamerican nations. It is about the alliance that they established with the Spanish conquistador Hernán Cortés to march together to conquer Tenochtitlan. The Totonacs voluntarily contributed 1300 warriors to the power of Cortés, that, on the other hand, was accompanied by some 500 Spaniards.\nThe reasons for the alliance were to free themselves from the Mexica yoke. Once the defeat of the Mexica Empire was achieved, the Totonacs, including those of Cempoala, were in command of the Spanish Empire, and then evangelized and partly acculturized by the first and later Mexican viceroyal authorities.\nThey were converted into serfs of the Spaniards under the encomienda system, becoming serfs of the indigenous settlers and caciques, particularly in the nascent sugarcane crop, during the rule of Nuño de Guzmán. A short time later, Cempoala was uninhabited and its culture extinguished and forgotten. The ancient Totonac culture was discovered again at the end of the 19th century by the Mexican archaeologist and historian Francisco del Paso y Troncoso.\nApparently, the Totonacs were part of the Tula Empire and from 1450 they were conquered by the Nahuas of the Aztec Triple Alliance and joined the troops.\nCurrently, they inhabit 26 municipalities in the north of the State of Puebla and 14 municipalities in the north of the State of Veracruz, in Mexico, and preserve their ancestral language and customs.\nReligion\nThe Totonacs, like all the civilizations of Mesoamerica, were polytheists. The main cult surrendered to the Sun, with human sacrifices; In addition, they worshiped the Goddess of Corn, who was the wife of the Sun, their sacrifices were not human, since \"She detested them\", instead, they offered animal sacrifices and offerings of herbs and flowers. Another important divinity was \"Old Thunder\", the \"Owner of all the waters, but not the rain\", he wanted to flood the world, because people who drowned became his servants.\nDaily life\nThey made their clothes with natural fiber textiles. The traditional garment of Totonaca women was the \"huipil\", an embroidered dress, wide and long, that is still worn among the current Totonac women. The men wore only a loincloth.\nTheir houses consisted of only one rectangular room, in which, without divisions, were simple and scarce wooden furniture. The room had a thatched roof or palm leaves and the structures on the walls were thick sticks.\nReferences\nBibliography\n* I. Bernall and E. Dávalos, Huastetecos y totonacos, 1953.\n* H.R. Harvey and Isabel Kelly, \"The Totonacas,\" in Handbook of Middle American Indians, 1969.\n* Estrella Leona Adame, The Tajín Totonac, 1952.\n* Ichon, A. : La religión de los totonacos de la sierra. Machupichu : Instituto Nacionaltaru, 1973.\n* Lozada Vázquez, Luz María: El papel de Progresa en la reproducción de las unidades domésticas campesinas : Estudio en una comunidad totonaca de Huehuetla, Puebla, México, Universidad Nacional Autónoma de México, 2002.\n* Lozada Vázquez, Luz María:  « Chaleur et odeurs pour nos morts. La cuisine cérémonielle de la Fête des Morts dans une communauté Totonaque de Puebla, Mexique », in Food and History 6 (2) 2008 : 133–154.\n* Ellison, Nicolás: S''emé sans compter. Appréhension de l'environnement et statut de l'économie en pays totonaque'' (Sierra de Puebla, Mexique). Editions de la Maison des Sciences de l'Homme, 2013.\n* Ellison N. : « Les enjeux locaux de la  ‘reconstitution des peuples indiens’ au Mexique. Reconfiguration des rapports entre minorités et pouvoirs publics,  le cas totonaque », in  Cahiers des Amériques Latines, N°52, (noviembre-diciembre), 2006 ; pp.5.\n* Ellison N. : « Une écologie symbolique totonaque, le municipe de Huehuetla (Mexique) »,   Journal de la Société des Américanistes, pp. 35-62,  Tome 90-2, 2004.\n* Ellison N. : « Cambio ecológico y percepción ambiental en la región totonaca de Huehuetla ». Actes du colloque international «Territoires et Migrations » (Zacatecas, Mexique), Sociedad Mexicana de Antropología, México. Versión publicada en la revista electrónica Nuevo Mundo, Mundos Nuevos(CNRS/EHESS), 2003, n°3.\n* Lozada Vázquez, L.M.:[http://brepols.metapress.com/content/?Author=Luz+Maria+Lozada Chaleur et odeurs pour nos morts. La cuisine cérémonielle de la Fête des Morts totonaque]\n* Ellison N. : [http://nuevomundo.revues.org/302 Cambio ecológico y percepción ambiental en la región totonaca]\n* Ellison, N. : [http://nuevomundo.revues.org/3287 Les Totonaques aujourd’hui, entre crise du développement et nouvelles revendications]\n* Ellison, N. : [http://www.editions-msh.fr/livre/?GCOI=27351100793320 Semé sans compter. ''Appréhension de l'environnement et statut de l'économie en pays totonaque'']\nExternal links\n* [http://www.samholleykline.com/bibliografiacutea-totonaca.html Bilingual bibliography of Totonac-related scholarly publications]"
    }
  ]
}