{
  "content": [
    {
      "type": "text",
      "text": "# Towards Thee Infinite Beat\n\n| rev2 = Trouser Press\n| rev2score = generally favourable\n}}\nTowards Thee Infinite Beat is an album by Psychic TV. It was followed by the remix album Beyond Thee Infinite Beat.\nAlbum liner notes\n*Towards the Infinite Beat was recorded at The Beat Farm, London, from thee 1st ov January 1990 to thee 23rd ov January 1990. It was pre-recorded at Time Square, London in December 1989.\nIn actuality, most of the basic tracks were recorded at Time Square Studio in Chiswich, London sporadically throughout late 1988–1989 with engineer Richard Schiessl.  Final overdubs and mixing was done at the Beat Farm, London in January 1990 with engineer Andy Falconer.\n*Cut at The Exchange, London.\n*Photos by Andrew Rawling.\n*\"Bliss\" features thee music ov Hadj Abdesalam Attar, Master Musician Ov Jajouka, father ov Bachir Attar present Master Musician Ov Jajouba ov thee Kingdom ov Morocco with kind.\nPersonnel\n*Drums, Keyboards - Matthew Best\n*Guitars, Drum Programming By Sampler, Keyboards - Fred Giannelli\n*Engineer [The Beat Farm] - Andy Falconer\n*Engineer [Time Square] - Richard Schiessl\n*Keyboards - Daniel Black\n*Keyboards [Additional], Sampler [Additional] - Dave Ball (tracks: 1, 4, 5, 6, 9)\n*Mixed by - Andy Falconer, Fred Giannelli, Nemesis P-Orridge, Matthew Best\n*Photography – Andrew Rawling (Fred Giannelli does not appear in the photograph of the UK version of this release but does appear in the photograph on the US licensed released by Wax Trax Records, Chicago, USA.  Genesis P-Orridge claimed he had done this to protect Fred Giannelli's identity because, as a US citizen, he was sneaking into the UK to work on recordings and live dates with Psychic TV without work papers.)\n*Producer – Fred Giannelli, Genesis P-Orridge\n*Vocals, Sampler, Violin [Electric], Keyboards - Genesis P-Orridge\n*Vocals, Tape, Sampler - Paula P-Orridge\nTrack listing\nCD version\n#\"Infinite Beat\"\n#\"Bliss\"\n#*Featuring: Hadj Abdesalam Attar, the Master Musicians of Joujouka\n#\"Drone Zone\"\n#\"S.M.I.L.E.\" voice sound is tape recording of Paula P-Orridge giving birth to second daughter Genesse.\n#*Violin: Gini Ball\n#\"I.C. Water\" voice at intro is Ian Curtis himself and was recorded in Nov. 1979 at the Castle Pub in Manchester. The following sample is General Jack D. Ripper (Sterling Hayden) from the Stanley Kubrick film, \"Dr. Strangelove\".\n#\"Black Rainbow\"  vocal: Paula P-Orridge  voice: George C. Scott from the Stanley Kubrick film, \"Dr. Strangelove\".\n#\"A Short Sharp Taste Ov Mistress Mix\"\n#\"Horror House\"\n#*Violin: Gini Ball\n#\"Jigsaw\"\n#\"Alien Be-In\"\n#\"Stick Insect\"\n#\"Money For E...\"\n#*Vocals: Peter Getty, Jordi Valls, Andy Warhol, Salvador Dalí, Timothy Leary\n12\" vinyl version\nSide A\n#\"Infinite Beat\"\n#\"Bliss\"\n#\"Drone Zone\"\n#\"S.M.I.L.E.\"\n#\"I.C. Water\"\nSide B\n#\"Black Rainbow\"\n#\"A Short Sharp Taste Ov Mistress Mix\"\n#\"Horror House\n#\"Jigsaw\"\n#\"Alien Be-In\"\nAll songs written by Fred Giannelli & Genesis P-Orridge except \"Black Rainbow\" written by Fred Giannelli & Paula P-Orridge and \"Money for E...\" written solely by Fred Giannelli.\nReferences"
    }
  ]
}