{
  "content": [
    {
      "type": "text",
      "text": "# Town Hall with President Clinton\n\nOn November 8, 1999, U.S. President Bill Clinton participated in the first ever presidential webcast produced by Excite@Home Network in partnership with the Democratic Leadership Council. The forum was held at George Washington University in Washington DC, moderated by DLC chairman, Al From and directed by Marc Scarpa. The webcast made use of the most cutting edge, IP-enabled technology of the time including streaming video remote feeds that connected the President to New Democrat leaders, including Kathleen Kennedy Townsend, then Lt. Governor of Maryland; Donald T. Cunningham, Jr., then mayor of Bethlehem, Pennsylvania; Wisconsin State Rep. Antonio Riley; Ron Gonzales, then mayor of San Jose, and Jeanne Shaheen, then governor of New Hampshire along with Netscape co-founder Marc Andreessen.\nThe webcast was entitled \"Third Way Politics in the Information Age\", a nod to Clinton's centrist political platform and the burgeoning age of the internet. The President and participants engaged in an online discussion on a range of issues from Medicare to gun control via questions submitted by the online users. 50,000 participants logged on to chat live with the President for 90 minutes (he stayed on for an additional 20 minutes). The webcast was likened to a 21st-century version of Franklin Delano Roosevelt's fireside chats with a similar impact to John F. Kennedy's use of the television broadcast. Clinton, who acted as a proponent of access to the internet and technology for lower income areas, said that the chat utilized, \"the most modern technology for . . . old-fashioned communication between the American people and their president.\" The President recognized the high rate of growth in internet connectivity (1.3 million computers were connected to the internet when he took office as opposed to 56 million connected at the time of the chat) and that the webcast was a new way to connect with people from all across the country and allow them to participate in the democratic process. The broadcast received worldwide media attention and was simultaneously broadcast live throughout the United States on several television news networks including CNN, MSNBC and NBC.\nLegacy\nIn 2005, the historical participatory media event was inducted into the permanent collection of the Clinton Presidential Library, in Little Rock, Arkansas and is the first Internet-age broadcast in a Presidential library.\nThe event has stood the test of time, as a model for real-time political communication between the President and voters.\nReferences"
    }
  ]
}