{
  "content": [
    {
      "type": "text",
      "text": "# Townsend, Delaware\n\n| subdivision_type1  = State\n| subdivision_name1  =\n| subdivision_type2  = County\n| subdivision_name2  = New Castle\n| government_footnotes =\n| government_type    =\n| leader_title       = Mayor\n| leader_name        = Scott Lobdell, P.E.\n| leader_title1      =\n| leader_name1       =\n| established_title  = Incorporated\n| established_date   = 1885\n| area_footnotes     =\n| unit_pref          = Imperial\n| area_magnitude     =\n| area_total_sq_mi   = 1.04\n| area_land_sq_mi    = 1.04\n| area_water_sq_mi   = 0.00\n| population_as_of   = 2020\n| population_footnotes =\n| population_total   = 2717\n| population_density_sq_mi = 2622.59\n| timezone           = Eastern (EST)\n| utc_offset         = &minus;5\n| timezone_DST       = EDT\n| utc_offset_DST     = &minus;4\n| elevation_footnotes =\n| elevation_ft       = 69\n| coordinates        =\n| postal_code_type   = ZIP code\n| postal_code        = 19734\n| area_code          = 302\n| blank_name         = FIPS code\n| blank_info         = 10-72510\n| blank1_name        = GNIS feature ID\n| blank1_info        = 214755\n| website            =\n| footnotes          =\n| pop_est_as_of      =\n| pop_est_footnotes  =\n| population_est     =\n| area_total_km2     = 2.69\n| area_land_km2      = 2.68\n| area_water_km2     = 0.00\n| population_density_km2 = 1012.36\n| name               =\n}}\nTownsend is a town in New Castle County, Delaware, United States. The population was 2,049 at the 2010 census, an increase of 492.2% from 2000. The center of population of Delaware is located in Townsend.\nGeography\nTownsend is located at  (39.3951115, –75.6915973).\nAccording to the United States Census Bureau, the town has a total area of , all  land.\nHistory\nTownsend was incorporated as a town on April 3, 1885.\nThe name comes from a businessman and Delaware Democrat, Samuel John Townsend. Prior to 1885, the town was known as Charley Town. Between 1845 and 1855 brothers Samuel and John Townsend purchased several large tracts of farmland in the vicinity. The Delaware Railroad arrived here in 1856, bisecting Samuel Townsend's property. This led to a period of sustained growth for the town, as the railroad station became the principal shipping point for the area's agricultural products. In September 1856 the Post Office was established, and the first hotel opened in 1857. The station was named Townsend after the area's major land owners. The peach industry was a vital contributor to the area's growth and prosperity until disease destroyed many Delmarva orchards in the late 19th century. A free African American community was located there by the mid-19th century.\nThe town has since created a \"Comprehensive Development Plan\", as required by state law February 2003, for land preservation.\nThe Townsend Historic District, which includes 216 buildings, was listed on the National Register of Historic Places in 1986.\nMayors of the town\nNote: List of Mayors is incomplete. Please add cited sources to complete this list.\n0000? - 2007 Charles Murry (Town Records)\n* 2007(?)-2009 - Dave Raughley\n* 2010–2011: John Hanlin\n* 2011-2012: Steve High\n* 2012-2014: Joel Esler\n* 2014-2015: Jermaine Hatton\n* 2016-2019: Rudy Sutton\n* 2019–2021: Tom McDonald\n* 2021-2022:  Patrick Miller\n* Current: Scott Lobdell, P.E.\nInfrastructure\nTransportation\nDelaware Route 71 runs northwest–southeast through the eastern part of Townsend. Main Street is the main east–west road through Townsend. Townsend is at the junction of the Delmarva Central Railroad's Delmarva Subdivision and the Maryland and Delaware Railroad's Northern Line.\nUtilities\nDelmarva Power, a subsidiary of Exelon, provides electricity to Townsend. Chesapeake Utilities provides natural gas to the town. Artesian Water Company, a subsidiary of Artesian Resources, provides water to Townsend. Trash and recycling collection in Townsend is provided by Waste Industries.\nEducation\nTownsend is within the Appoquinimink School District. Odessa High School has a Townsend postal address.\nMOT Charter School is an area charter school.\nDemographics\n}}\nAt the 2000 census there were 346 people, 132 households, and 95 families living in the town. The population density was . There were 151 housing units at an average density of .  The racial makeup of the town was 84.10% White, 11.56% African American, 0.87% Native American, 0.87% Asian, 2.60% from other races. Hispanic or Latino of any race were 2.60%.\nOf the 132 households 36.4% had children under the age of 18 living with them, 59.1% were married couples living together, 9.8% had a female householder with no husband present, and 28.0% were non-families. 20.5% of households were one person and 7.6% were one person aged 65 or older. The average household size was 2.62 and the average family size was 3.06.\nThe age distribution was 26.9% under the age of 18, 7.8% from 18 to 24, 32.1% from 25 to 44, 20.5% from 45 to 64, and 12.7% 65 or older. The median age was 36 years. For every 100 females, there were 92.2 males. For every 100 females age 18 and over, there were 88.8 males.\nThe median household income was $47,500 and the median family income  was $48,875. Males had a median income of $27,250 versus $28,409 for females. The per capita income for the town was $17,671. About 2.1% of families and 1.7% of the population were below the poverty line, including none of those under age 18 and 8.7% of those age 65 or over.\nNotable people\n*Samuel John Townsend (1812–1881), for whom the town was named\n*Happy Townsend (1879–1963), baseball player\n*David P. Buckson (1920–2017), Governor of Delaware, was born in Townsend\nReferences\nExternal links\n* [https://townsend.delaware.gov/ Official website]"
    }
  ]
}