{
  "content": [
    {
      "type": "text",
      "text": "# Tracy King\n\n| birth_place         =\n| profession          = Hearing aid specialist, politician\n| residence           = Uvalde, Texas, U.S.\n| spouse              = Cheryl Baker\n| children            = 2\n| alma_mater          = Southwest Texas Junior College\nTexas A&M University\n| term_end            = January 14, 2025\n}}\nTracy Ogden King (born November 9, 1960) is an American politician and hearing aid specialist from Uvalde, who was a Democratic member of the Texas House of Representatives for nearly thirty years. He represented the 80th district from 2005 to 2025 and the 43rd district from 1995 to 2003. King was first elected to Texas House of Representatives as a representative of the 43rd district on November 8, 1994, when he unseated the one-term Democrat-turned-Republican incumbent, Pedro G. Nieto. King was elected to a total of fifteen two-year terms in the Texas House of Representatives. He is a senior advisor to Dustin Burrows, the Speaker of the Texas House of Representatives.\nBiography\nKing graduated from Carrizo Springs High School in Carrizo Springs, the county seat of Dimmit County, Texas. He then attended Southwest Texas Junior College, and Texas A&M University at College Station, from which he received his Bachelor of Science degree in agricultural engineering. In 1983, King was employed by the Beltone Hearing Aid Center in San Antonio, which served sixteen counties in southwestern Texas. King purchased the Beltone center in 1987 and sold it in 2008. King and his wife, the former Cheryl Baker, originally from Hondo, the county seat of Medina County, have two children, Katelyn Marie King and Clayton Baker King. King is a former trustee of the First United Methodist Church. He is a past president of the Uvalde Kiwanis Club. He is a former president of the Texas Hearing Aid Association. King is a former chairman of the House Committee on Natural Resources, former member of the Energy Resources Committee, and a former chairman of the House Water Caucus while in the Texas House of Representatives.\nPolitical career\nKing began his career in the Texas House of Representatives as a representative of the 43rd district in 1995 after he defeated the one-term Democrat-turned-Republican incumbent, Pedro G. Nieto. King received 15,072 votes (61.8 percent) to Nieto's 9,321 (38.2 percent).\n2012 election\nKing won renomination in the Democratic primary election held on May 29, 2012. King said that he opposes state tax increases and will pursue ways to improve the business climate in south Texas. In the primary, King faced Jerry Garza (born 1976), a former two-term member from District 3 of the Webb County Commissioner's Court, also a former television reporter for KGNS-TV, the NBC affiliate in Laredo, and a former faculty member at Laredo Community College. Garza had sought to become the second Democrat from Laredo in the state House. Through April 18, 2012, King amassed $74,350 in campaign contributions, compared to $4,800 for Garza. Only 15 percent of King's contributions came from within District 80, but he did receive a contribution from wealthy Laredo businessman Steve LaMantia. Garza said that most of King's contributions came from lobbyists and political action committees beyond the district. After King defeated Garza in the primary, King was unopposed in the November 6, 2012, general election.\nElectoral history\n{| class=\"wikitable\"\n|-\n! Year !! Type of Election !! % of Votes Won\n|-\n| 2022 || General Election|| 100.00 (unopposed)\n|-\n| 2022|| Democratic Party Primary Election|| 100.00 (unopposed)\n|-\n| 2020|| General Election||\n|-\n| 2020|| Democratic Party Primary Election||\n|-\n| 2018|| General Election||\n|-\n| 2018|| Democratic Party Primary Election||\n|-\n| 2016|| General Election||\n|-\n| 2016|| Democratic Party Primary Election||\n|-\n| 2014|| General Election|| 89.59\n|-\n| 2014|| Democratic Party Primary Election|| 100.00 (unopposed)\n|-\n| 2012|| General Election|| 100.00 (unopposed)\n|-\n| 2012|| Democratic Party Primary Election|| 59.66\n|-\n| 2010|| General Election|| 100.00 (unopposed)\n|-\n| 2010|| Democratic Party Primary Election||\n|-\n| 2008|| General Election|| 100.00 (unopposed)\n|-\n| 2008|| Democratic Party Primary Election|| 100.00 (unopposed)\n|-\n| 2006|| General Election|| 100.00 (unopposed)\n|-\n| 2006|| Democratic Party Primary Election|| 100.00 (unopposed)\n|-\n| 2004|| General Election|| 100.00 (unopposed)\n|-\n| 2004|| Democratic Primary Election||\n|-\n| 2000|| General Election|| 100.00 (unopposed)\n|-\n| 2000|| Democratic Party Primary Election|| 63.82\n|-\n| 1998|| General Election|| 100.00 (unopposed)\n|-\n| 1998|| Democratic Primary|| 100.00 (unopposed)\n|-\n| 1996|| General Election|| 100.00 (unopposed)\n|-\n| 1996|| Democratic Party Primary Election|| 100.00 (unopposed)\n|-\n| 1994|| General Election|| 61.79\n|-\n| 1994|| Democratic Primary Election|| 51.97\n|-\n| 1992|| Democratic Primary Runoff Election|| Lost 48.61\n|-\n| 1992|| Democratic Primary Election|| Runoff 34.55\n|}\nReferences"
    }
  ]
}