{
  "content": [
    {
      "type": "text",
      "text": "# Tracking (dog)\n\nfollowing a scent trail in the snow]]\nTracking refers to a dog's ability to detect, recognize and follow a specific scent. Possessing heightened olfactory abilities, dogs, especially scent hounds, are able to detect, track and locate the source of certain odours. A deeper understanding of the physiological mechanisms and the phases involved in canine scent tracking has allowed humans to utilize this animal behaviour in a variety of professions. Through domestication and the human application of dog behaviour, different methods and influential factors on tracking ability have been discovered. While tracking was once considered a predatory technique of dogs in the wild, it has now become widely used by humans.\nPhysiological mechanisms\nAccording to zoosemiotics animal communication involves an exchange of information between a sender and a receiver through a transfer of chemical signs. Described as representation and signification, a chemical sign can be produced without the presence of a dog and detected without the presence of the individual who produced it. This means dogs have the ability to leave their own signs and detect previously laid signs without the presence of another dog or individual. It is this theory of zoosemitoics that explains how dogs are able to determine the direction of a seemingly invisible scent track.\nAlthough dogs are capable of following both visual and olfactory cues, it appears that scent is their most effective source of information. Equipped with enhanced physical and neurological olfactory structures, a dogs sense of smell is much more advanced compared to that of humans. Specialized turbinate bones in the canine nasal cavity allows for increased exposure of chemical receptor cells to the air. This, paired with a proportionally large segment of brain devoted to olfaction processing,  results in the enhanced smelling ability of canines.\nBoth physical and neurological attributes of dogs contribute to their ability to detect extremely small concentrations of specific scents and their ability to differentiate between odours. The accuracy of these detections is determined by the concept of scent groups. A scent group refers to a specific mixture of scents that comprise the overall odour of an individual. A dogs acuity to a scent group is so refined they are able to discriminate humans by odour and can even match certain scents to specific body parts of an individual. Scent discrimination is most proficient while a human odour is fresh and becomes more difficult once an odour starts to fade.\nPhases\nTracking behaviour in dogs is exhibited through three separate phases.\nSearching Phase\n* Initial period in which dogs attempt to find a track. Dogs sniff very quickly ten to twenty times between inhalations of breath. Sniff frequency is usually 6&nbsp;Hz and occurs while the dog is in motion looking for a trail.\nDeciding Phase\n* Track identification is apparent when the dog halts and then proceeds to take smaller step and the sniffing frequency of the dog becomes much longer.\n* Period usually lasts 3–5s\nTracking Phase\n* Similar to the searching phase. Sniffing behaviour and walking behaviour become quicker.\nMethods\nAlthough dogs use physiological methods to detect scent trails, they apply these methods differently depending on the environments in which they are tracking. A scent results from the individual odour of a person being tracked or through an environmental disturbance odour that results from the physical movements of the person being tracked. The ways in which dogs track an individual, vegetative and track scent can vary depending on circumstances. Specifically, scent tracking ability of a dog depends on whether or not an individual deposits their scent in the air or on the ground.\nAn air scent is when human odours of sweat, cells, gland secretions, or toiletries circulate freely in the open air. The bacteria attached to fallen skin cells provide dogs with odorous by-products that enhance the individuality of a trail. While an initial air scent is much stronger than a ground scent, a ground scent remains detectable for a longer period of time.\nA ground scent is the combined permeations of trampled vegetation, bugs, mud, and soil disturbed by an individual's footprints. The disturbed soil releases moisture and kills plant life which results in a different odorous by-product. Each footprint releases a new odour more potent than the ones of the undisturbed vegetation surrounding it.\nA track scent is often a mixture of both the air scent and the ground scent being left behind by an individual. Dogs are able to determine a track scent by identifying a combination of both human odours and environmental odours released by an individual. They then use the strength of this overall scent to determine the directionality of a trail and track along that route. Since an initial footstep is much less potent than the last footstep taken by an individual, dogs move in the direction where the scent seems to become stronger. Additionally, dogs have been observed to alternate between visual tracking and scent tracking depending on the circumstances of their environment. For the most part dogs prefer to use olfactory cues even when the target or visual cues are within their line of sight. However, there has been research conducted where dogs have been shown to rely on visual, social or cognitive cues to identify the tracks of an individual.\nFactors that influence tracking ability\nand his dog looking for survivors in the aftermath of 9/11. |279x279px]]There are many different factors which influence a dogs ability to successfully determine the directionality of a track. The age, sex, and even personality of a dog can greatly influence tracking behaviour. Male dogs have been described to more accurately determine the direction of a trail than female dogs. It is hypothesized that this is due to the evolutionary history of male dogs. Male olfactory ability of canines is superior to that of females because historically it was their duty to find mates and mark territory. Canine olfactory sensitivity is also found to diminish, therefore younger dogs tend to have superior tracking than older dogs. Personality traits of dogs affect both their ability to be successfully trained and their ability to successfully track. Dogs that are more active and confident tend to perform better during training activities and tracking activities.\nThe mannerisms of the handler working with the dog can also affect tracking ability. It has been discovered that humans and animals share very specific social skills that enable them to bond and work together effectively. Adaptations of social tolerance and attentiveness has enabled dogs to participate in cooperative problem solving with their human counterparts. Social attentiveness refers to an animals ability to pay attention to their partners actions and behave accordingly. It is this factor that explains how dogs are capable of interpreting and reacting to cues from their handler. Pointing, gaze shifting, and facial expressions demonstrated by the handler can be used by the canine to locate objects and follow a certain direction. Although usually purposeful, unconscious signals are also capable of being interpreted by canines while working with humans. Therefore, handlers are trained to be cautious of their actions when working with their canine in order to ensure their demands are being properly perceived by the dog.\nHuman uses of tracking dogs\nHuman uses for tracking dogs are dependent on many different factors. Specifically, the demands of a job often influence which kind of dog humans choose to train and employ. There are three different types of scenting dogs based on their affinity for air scents, ground scents and tracking scents. Described as a tracking dog, trailing dog, and point source dogs each one specializes in a different method of tracking.\nTracking dogs\nTracking dogs are known for their ability to detect and follow the vegetative vapours released from disturbances of plant life  They stay very close to foot paths and are able to follow considerably aged tracks.\nTrailing dogs\nTrailing dogs have a stronger affiliation for proponents of human scent near the trail they are tracking. They can be observed deviating slightly from or crossing over the trail they are tracking. Trailing dogs heavily rely on scent because the trails in which they follow often don't have any visual cues for tracking. Tracking and trailing dogs are often used interchangeably for police aid in human, suspect and victim searches.\nPoint source dogs\nPoint source dogs are specialized in air scent tracking and tend to ignore ground scents. They utilize increasing intensity of specific odours to identify and track a trail to a certain target object. There are two separate classifications of point source dogs: detector dogs and discrimination dogs. Detection dogs are most often used to identify both non-biological and biological scents of a target object while ignoring other non-target environmental scents Discrimination dogs are most often employed by police forces to identify the scent of a specific individual being tracked. This differs from detection dogs because they are required to react to a scent that matches or differentiates between other ones instead of identifying that a certain scent is present.\nSpecific uses of detection dogs\n* Explosive and mine identification\n* Bacteria detection in buildings and homes\n* Detection of human waste materials in storm drains\n* Search and rescue missions, recovering evidence from a crime scene, and locating drugs and explosives\nSpecific uses of discrimination dogs\n* Finding dead or alive police suspects\n* Distinguishing between different forms of narcotics and reacting to the presence of a specific narcotic\nTracking trials\nA Tracking trial is an event to encourage dogs to make use of their strongest facility, the ability to follow a scent trail. The competition emulates the finding of a lost person or article in a situation where the performance of the dog can be fairly assessed. Because of this, the tracks laid are straightforward, not the wanderings that may characterize a lost person, nor do they include deliberate attempts by the tracklayer to deceive the dog.\nAlthough different organizations specify somewhat different rules, the basics of a tracking trial remain the same. The objective is for the dog to find the deliberately \"lost\" tracklayer and any articles they may have dropped along the track.\nGenerally, tracks are laid, marked, and mapped on the day previous to the tracking trial by the trial judge or steward. Tracks are chosen so that the judge or steward can easily determine where the track is located, and where articles are to be placed, even after the marks, ribbons, or flags have been removed. The length of the track, the number of corners, the number of articles left on the track depends on the level of difficulty of the track and the rules of the organization under which the trial is being run.\nOn the day of the trial, a tracklayer follows the marked track and removes any marks that have been placed on the track, then leaves articles of clothing on the track as specified by the steward or judge, including one at the end of the track. After a specified time, depending on the difficulty of the track and the requirements of the rules of the organization, the dog and handler is directed to the track and find the tracklayer and articles as required. The dog is usually worked on a 10-meter or (30-foot) lead, but the length of lead actually used depends on the terrain.\nIn general, a dog must work continually as if genuinely looking for a lost person without assistance from the handler, and find the required number of lost articles and the tracklayer at the end of the track, for the dog to be awarded a pass. This pass can also be graded on the quality of the work. After the required passes have been awarded, the dog may apply for a tracking title according to the rules of the organization the trials have been run under.\nSee also\n* Scent hound\nReferences"
    }
  ]
}