{
  "content": [
    {
      "type": "text",
      "text": "# Traditions of Italy\n\n]]\nTraditions of Italy are sets of traditions, beliefs, values, and customs that belongs within the culture of Italian people. These traditions have influenced life in Italy for centuries, and are still practiced in modern times. Italian traditions are directly connected to Italy's ancestors, which says even more about Italian history.\nOverview\nChristmas\n]]\nin Milazzo]]\nin Merano]]\nduring the Christmas period]]\nChristmas in Italy () is one of the country's major holidays and begins on 8 December, with the Feast of the Immaculate Conception, the day on which traditionally the Christmas tree is mounted and ends on 6 January, of the following year with the Epiphany (), and in some areas female puppets are burned on a pyre (called falò), to symbolize, along with the end of the Christmas period, the death of the old year and the beginning of a new one. 26 December (Saint Stephen's Day, in Italian ), is also a public holiday in Italy. The Italian term  derives from the Latin , which literally means 'birth', and the greetings in Italian are  (Merry Christmas) and  (Happy Christmas).\nThe tradition of the nativity scene comes from Italy. The first seasonal nativity scene, which seems to have been a dramatic rather than sculptural rendition, is attributed to Saint Francis of Assisi. Francis' 1223 living nativity scene in Greccio is commemorated on the calendars of the Catholic, Lutheran and Anglican liturgical calendars,  and its creation is described by Saint Bonaventure in his Life of Saint Francis of Assisi c. 1260. Nativity scenes were popularised by Saint Francis of Assisi from 1223, quickly spreading across Europe. In Italy, regional crib traditions then spread, such as that of the Bolognese crib, the Genoese crib and the Neapolitan crib.\nIn southern Italy, living nativity scenes (presepe vivente) are extremely popular. They may be elaborate affairs, featuring not only the classic nativity scene but also a mock rural 19th-century village, complete with artisans in traditional costumes working at their trades. These attract many visitors and have been televised on RAI, the national public broadcasting company of Italy. In 2010, the old city of Matera in Basilicata hosted the world's largest living nativity scene of the time, which was performed in the historic center, Sassi.\nThe tradition of the Christmas tree, of Germanic origin, was also widely adopted in Italy during the 20th century. It seems that the first Christmas tree in Italy was erected at the Quirinal Palace at the behest of Queen Margherita, towards the end of the 19th century. In 1991, the Gubbio Christmas Tree, 650 meters high and decorated with over 700 lights, entered the Guinness Book of Records as the tallest Christmas tree in the world.\nIn Italy, the oldest Christmas market is considered to be that of Bologna, held for the first time in the 18th century and linked to the feast of Saint Lucy. The tradition of the markets has however spread in Italy predominantly especially since the 1990s of the 20th century, with the birth of the first modern markets: among these, the first ever was that of Bolzano, born in 1991, which was followed by others in the area of Alto Adige, in particular in Merano, Bressanone, Vipiteno and Brunico. The Trento Christmas market, established in 1993, is renowned in Trentino. In Naples, where the tradition of the Neapolitan nativity scene has been famous for centuries, the exhibition of the nativity scenes made in the city's artisan shops is held every year in via San Gregorio Armeno. Noteworthy are the Christmas markets at Piazza Navona in Rome, in Verona, in Gubbio, in Alberobello, in Aosta, in Torino, in Asti, in Arezzo, in Florence, in Trieste, in Livigno, in Santa Maria Maggiore, Arco and in Cison di Valmarino.\nStrenna or Strenna di Natale is a gift that is usually made or received in Italy at Christmas time. This custom comes from the tradition of ancient Rome which involved the exchange of gifts of good wishes during the Saturnalia, a series of festivities that took place each year between 17 and 23 December, in honor of the mythical god Saturn and preceding the day of the Natalis Solis Invicti. The term derives from the Latin Strena, word probably of Sabine origin, with the meaning \"gift of good luck.\"\nTypically Italian tradition is instead that of the  (: Zampognaro), or men dressed as shepherds and equipped with zampogna, a double chantered bagpipes, who come down from the mountains, playing Christmas music. This tradition, dating back to the 19th century, is particularly widespread in the South of the country. A description of the Abruzzese  is provided by Héctor Berlioz in 1832.\nTypical bearers of gifts from the Christmas period in Italy are Saint Lucy (13 December), Christ Child,  (the name given to Santa Claus), and, on Epiphany, the Befana.\nAccording to tradition, the Christmas Eve dinner must not contain meat. A popular Christmas Day dish in Naples and in Southern Italy is female eel or , which is a female eel. A traditional Christmas Day dish from Northern Italy is capon (gelded chicken). Abbacchio is more common in Central Italy. The Christmas Day dinner traditionally consists by typical Italian Christmas dishes, such as agnolini, cappelletti, Pavese agnolotti, panettone, pandoro, torrone, panforte, struffoli, mustacciuoli, bisciola, cavallucci, veneziana, pizzelle, zelten, or others, depending on the regional cuisine. Christmas on 25 December is celebrated with a family lunch, also consisting of different types of pasta and meat dishes, cheese and local sweets.\nEaster\n, an Italian preparation of lamb]]\noriginating from Milan, the Colomba di Pasqua. It is the Easter counterpart of the two well-known Italian Christmas desserts, panettone and pandoro]]\n, Apulia]]\n'' at Florence Cathedral, Tuscany, on Easter Sunday]]\nEaster in Italy () is one of the country's major holidays. In Italy, there are many traditions related to Easter. The Holy Weeks worthy of note in Italy are the Processione dei Misteri di Trapani, the Holy Week in Barcellona Pozzo di Gotto and the Holy Week in Ruvo di Puglia. Traditional Italian dishes for the Easter period are abbacchio, cappello del prete, casatiello, Colomba di Pasqua, pastiera, penia, pizza di Pasqua and pizzelle. Abbacchio is an Italian preparation of lamb typical of the Roman cuisine. It is a product protected by the European Union with the PGI mark. Eating lamb at Easter has a religious meaning. The Paschal Lamb of the New Testament is in fact, for Christianity, the son of God Jesus Christ. The Paschal Lamb, in particular, represents the sacrifice of Jesus Christ for the sins of humanity. Eating lamb at Easter therefore commemorates the Death and Resurrection of Jesus. Colomba di Pasqua (English: \"Easter Dove\") is an Italian traditional Easter bread, the Easter counterpart of the two well-known Italian Christmas desserts, panettone and pandoro.\nAbbacchio is an Italian preparation of lamb typical of the Roman cuisine. It is a product protected by the European Union with the PGI mark. In Romanesco dialect, the offspring of the sheep who is still suckling or recently weaned is called abbacchio, while the offspring of the sheep almost a year old who has already been shorn twice is called agnello (\"lamb\"). This distinction exists only in the Romanesco dialect. In Italy at Easter, abbacchio is cooked in different ways, with recipes that vary from region to region. In Rome it is roasted, in Apulia in the oven, in Naples it is cooked with peas and eggs, in Sardinia it is cooked in the oven with potatoes, artichokes and myrtle and in Tuscany it is cooked in cacciatore style. Other local preparations include frying and stewing. Eating lamb at Easter has a symbolic meaning. The Paschal Lamb of the New Testament is in fact, for Christianity, the son of God Jesus Christ. The Paschal Lamb, in particular, represents the sacrifice of Jesus Christ for the sins of humanity. Eating lamb at Easter therefore commemorates the Death and Resurrection of Jesus.\nIn Versilia, as a sign of forgiveness, but this time towards Jesus, the women of the sailors kiss the earth, saying: \"Terra bacio e terra sono - Gesù mio, chiedo perdono\" (\"I kiss the earth and earth I am - my Jesus, I ask for forgiveness\"). In Abruzzo, however, it is the custom of farmers during Easter to add holy water to food. Holy water is also used in Julian March, where half a glass is drunk on an empty stomach, before eating two hard-boiled eggs and a focaccia washed down with white wine.\nAnother symbol used during the Easter period is fire. In particular, in Coriano, in the province of Rimini, bonfires are lit on Easter Eve. At the same time, the blessed fire is brought to the countryside in the autonomous province of Bolzano. Bonfires are also lit in San Marco in Lamis, this time lit on a wheeled cart.\nIn Florence, the use of sacred fire has changed over time: before the year one thousand candles were in fact brought into the houses which were lit by a candle which was, in turn, lit through a lens or a flint; at the beginning of the 14th century, instead, three pieces of flint were used that according to tradition came from the Holy Sepulcher of Jerusalem. These pieces of flint were donated to the Pazzi family by Godfrey of Bouillon. Later, the use of the sacred fire in Florence materialized in a chariot full of fireworks (Scoppio del carro).\nThe Cavallo di fuoco is an historical reconstruction which takes place in the city of Ripatransone in the Province of Ascoli Piceno. It is a fireworks show, which traditionally occurs eight days after Easter.  The show goes back to 1682 when, on the occasion of celebrations in honor of the Virgin Mary, the local dwellers hire a pyrotechnician who, once the spectacle was over, took all his remaining fireworks and shot riding his horse. This extemporized action struck the citizens who began to recall it yearly. In the 18th century a mock steed replaced the animal and the fireworks were assembled upon it. Originally it was made of wood, and until 1932 it was carried on the shoulders of the most robust of citizens. Later it was considered more convenient to equip it with wheels and a rudder and have it towed by volunteers equipped with protective clothing and accessories. In 1994 a new sheet iron horse, built on the model of the previous one, took the place of the wooden one.\nIn Italy, during Palm Sunday, palm leaves are used along with small olive branches, readily available in the Mediterranean climate. These are placed at house entrances (for instance, hanging above the door) to last until the following year's Palm Sunday. For this reason, usually palm leaves are not used whole, due to their size; instead, leaf strips are braided into smaller shapes. Small olive branches are also often used to decorate traditional Easter cakes, along with other symbols of birth, like eggs. In Italy, Easter Monday is an official public holiday and is called \"''Lunedì dell'Angelo” (\"Monday of the Angel\"), \"Lunedì in Albis\" or more commonly \"Pasquetta''\".  It is customary to hold a family picnic in the countryside or barbecues with friends.\nNew Year's Eve\n, polenta and lentils]]\nIn Italy, New Year's Eve ( or ) is celebrated by the observation of traditional rituals, such as wearing red underwear. An ancient tradition in southern regions which is rarely followed today was disposing of old or unused items by dropping them from the window. Usually the evening is spent with family or friends in a square (where concerts or various parties are organised) but also at home. Generally, starting from 10 seconds before midnight, it is customary to count down until reaching zero, thus wishing a happy new year, toasting with spumante and watching or lighting fireworks, shooting firecrackers or guns loaded with blanks. Dinner is traditionally eaten with relatives and friends. It often includes zampone or cotechino (a meal made with pig's trotters or entrails), lentils and (in Northern Italy) polenta. At 20:30, the President of Italy's address to the nation, produced by RAI, the state broadcaster, is broadcast countrywide on radio and TV networks. At midnight, fireworks are displayed all across the country. Rarely followed today is the tradition that consist in eating lentil stew when the bell tolls midnight, one spoonful per bell. This is supposed to bring good fortune; the round lentils represent coins.\nPatron saint festivals\nin Little Italy, New York]]\nThe Italian national patronal day, on 4 October, celebrates Saints Francis and Catherine. Each city or town also celebrates a public holiday on the occasion of the festival of the local patron saint, for example: Rome on 29 June (Saints Peter and Paul), Milan on 7 December (Saint Ambrose), Naples on 19 September (Saint Januarius), Venice on 25 April (Saint Mark the Evangelist) and Florence on 24 June (Saint John the Baptist). Notable traditional patronal festivals in Italy are the Feast of Saints Francis and Catherine, the Festival of Saint Agatha, the Feast of Saints Peter and Paul, the Feast of San Gennaro and the Feast of Our Lady of the Hens.\nCarnival\n]]\n]]\nCarnival in Italy plays a very important role in Italian folklore, traditionally linked to regional masks, and is celebrated in many cities, some of which are known throughout the world for the special celebrations they organize for this occasion.\nThe Carnival in Venice was first documented in 1296, with a proclamation by the Venetian Senate announcing a public festival the day before the start of Lent. Today, about 3 million people travel to Venice to take part in the famous Carnival. The Carnival of Viareggio is the second-most popular in Italy. The first Carnival of Viareggio parade was held in 1873. Every year, the Carnival of Viareggio attracts more than 500,000 spectators. The Carnival of Ivrea is famous for its \"Battle of the Oranges\" fought with fruit between the people on foot and the troops of the tyrant on carts, to remember the wars of the Middle Ages, allegory of struggle for freedom. It is the largest food fight in Italy and surrounding countries. Regarding the origins, a popular account has it that the battle commemorates the city's defiance against the city's tyrant, who is either a member of the Ranieri family or a conflation of the 12th-century  and the 13th-century Marquis William VII of Montferrat. The Ambrosian carnival is widespread in the most part of the Archdiocese of Milan, where the Ambrosian Rite is observed, and in this area the Carnival ends on the first Sunday of Lent; the last day of Carnival is Saturday, 4 days after the Tuesday on which it ends where the Roman Rite is observed.\nIn Sardinia, the Carnival (in Sardinian language Carrasecare or Carrasegare) varies greatly from the one in the mainland of Italy. the majority of the Sardinian celebrations features not only feasts and parades but also crude fertility rites such as bloodsheds to fertilize the land, the death and the resurrection of the Carnival characters and representations of violence and torture. The typical characters of the Sardinian Carnival are zoomorphic and/or androgynous, such as the Mamuthones and Issohadores from Mamoiada, the Boes and Merdules from Ottana and many more. The Carnival is celebrated with street performances that are typically accompanied by Sardinian dirges called , meaning literally \"cry of a baby when the mother doesn't want nursed him/her anymore\" (from the word titta meaning breasts). Other particular and important Carnival instances in Sardinia are the Sartiglia in Oristano and the Tempio Pausania Carnival.\nSagre\nin Marino, celebrating grapes]]\nIn Italy, a sagra (plural: sagre) is a popular festival of a local nature and annual frequency, which traditionally arises from a religious festival, celebrated on the occasion of a consecration or to commemorate a saint (usually the patron saint), but also used to celebrate the harvest or promote a food and wine product local. During a festival the local fair, the market and various celebrations usually take place.\nA sagra is often dedicated to some specific local food, and the name of the sagra includes that food; for example: Festival delle Sagre astigiane, a Sagra dell'uva (grapes) at Marino, a Sagra della Rana (frog) at Casteldilago near Arrone, a Sagra della Cipolla (onion) at Cannara, a Sagra della Melanzana ripiena (stuffed eggplant) at Savona, a Sagra della Polenta at Perticara di Novafeltria, a Sagra del Lattarino at Bracciano, a Sagra del Frico at Carpacco-Dignano and so on. Among the most common sagre are those celebrating olive oil, wine, pasta and pastry of various kinds, chestnuts, and cheese.\nFerragosto\nfireworks display in Padua]]\nFerragosto is a public holiday celebrated on 15 August in all of Italy. It originates from Feriae Augusti (\"Festivals [Holidays] of the Emperor Augustus\"), the festival of Augustus, who made 1 August a day of rest after weeks of hard work on the agricultural sector. As the festivity was created for political reasons, the Catholic Church decided to move the festivity to 15 August which is the Assumption of Mary allowing them to include this in the festivity. Food and board was not included, which is why even today Italians associate packed lunches and barbecues with this day. By metonymy, it is also the summer vacation period around mid-August, which may be a long weekend (ponte di ferragosto) or most of August.\nHistorical competitions\nHistorical competitions are widespread throughout the Italian national territory, such as the Palio, the name given in the country to an annual athletic contest, very often of a historical character, pitting the neighbourhoods of a town or the hamlets of a comune against each other. Typically, they are fought in costume and commemorate some event or tradition of the Middle Ages and thus often involve horse racing, archery, jousting, crossbow shooting, and similar medieval sports. The Palio di Siena is the only one that has been run without interruption since it started in the 1630s and is definitely the most famous all over the world.\nTraditional events\n|caption=Regions of Italy\n|innerstyle=border:none;\n}}\n]]\non the occasion of the pilgrimage of the ]]\n. From the top to the left, clockwise, Venice, Genoa, Pisa and Amalfi]]\nof the Royal Palace of Caserta]]\nin Assisi]]\n* The boat of Saint Peter () is a popular rural tradition prevalent in northern Italy, particularly in the geographical area of Friuli-Venezia Giulia, Veneto, Trentino, Lombardy, Liguria and Piedmont. This tradition is also widespread in certain valleys and territories of north-west Tuscany: Garfagnana and Val di Lima (province of Lucca), Valleriana (province of Pistoia) and Galciana (province of Prato). The tradition dates back to the cult of Saint Peter, widespread in northern Italy from the 18th century, thanks to the Benedictines monks. In certain regions and in other variants, the same tradition also spread for 24 June, the feast of Saint John the Baptist. The origin of the belief is linked to Atmospheric Phenomena since they are important for agricultural crops or for fishing.\n* The  (English: feast of Our Lady of Health) is a religious feast established by the Republic of Venice in 1630 and solemnly observed throughout the territory of the republic until its fall. It takes place on 21 November, the day of the Presentation of the Blessed Virgin Mary, and is still celebrated spontaneously today in the city of Venice, Trieste and in many cities and towns of the ancient Republic, in Italy, Istria (Venetian Istria) and Dalmatia (Venetian Dalmatia). Istria today is part of Slovenia and Croatia, while Dalmatia belongs to Croatia. The number of local ethnic Italians in Istria and Dalmatia (Istrian Italians and Dalmatian Italians) dropped dramatically afterwards the Istrian–Dalmatian exodus. In Venice, the pilgrimage of the festival has as its destination the basilica of Santa Maria della Salute. Throughout the day, in the basilica, which is kept open without interruption, masses and rosaries are celebrated continuously, with a continuous influx of faithful. To facilitate the pilgrimage, a temporary wooden bridge was erected on the Grand Canal connecting from Santa Maria del Giglio to the vicinity of the basilica. In Veneto, Our Lady of Health is celebrated in many municipalities, including those not belonging to the province of Venice, and almost always falls on 21 November. Some municipalities that celebrate the event are Dolo, Este, Cavaso del Tomba and Camposampiero. In the province of Trieste and in the capital itself it is also celebrated on 21 November. In Emilia-Romagna, in the municipality of Solarolo, where there is also a sanctuary dedicated to Our Lady of Health, a participatory religious function is celebrated in her honor in September. In Sardinia the festival is particularly felt by the community of Gonnosfanadiga, where it has been considered one of the main festivals of the town since its inauguration in 1849. It is celebrated on the last Sunday of May, and the events last for several days. It is celebrated in other Sardinian towns on different dates, such as in Pozzomaggiore, Masainas and Villanovafranca, during the last weekend of September. In Ittiri, where Our Lady of Health is celebrated as the patron saint of traders, the festival is held at the beginning of September. In Calabria, in Amendolara and more particularly in the hamlet of Amendolara Marina, there is the parish dedicated to Our Lady of Health, whose feast is celebrated in August.\n* The  () is a Marian procession that takes place every five years and during which the faithful of the Valle d'Aosta town of Fontainemore make a pilgrimage to the Sanctuary of Oropa crossing at night the Biellese Alps. It is one of the oldest documented processions in the Alps.  The first documentary records of the procession date back to 1547, although according to some scholars the pilgrimage would have started to take place in even more ancient times. In the procession, in which once only the faithful of the small Aosta Valley town (which today has a few hundred residents) took part, today there are also many other people from the rest of the Aosta Valley, from the Biella area (Piedmont) or even further away, so that there can be thousands of pilgrims.\n* The Regatta of the Historical Marine Republics (or Palio of the Historical Maritime Republics, ) is a sporting event of historical re-enactment, established in 1955 with the aim of recalling the rivalry of the most famous Italian maritime republics: those of Republic of Amalfi, Republic of Pisa, Republic of Genoa and Republic of Venice, during which four rowing crews representing each of the republics compete against each other. This event, held under the patronage of the President of Italy, takes place every year on a day between the end of May and the beginning of July, and is hosted in rotation between these cities: Amalfi (Campania), Pisa (Tuscany), Genoa (Liguria) and Venice (Veneto). The regatta is preceded by a historical procession, during which parade through the streets of the city organizing some figures that play the role of ancient characters that characterized each republic. On 10 December 1955 it was instead signed in Amalfi, in the Salone Morelli (the current Historical Museum of Palazzo San Benedetto, seat of the Town Hall), the constitutive act that sanctioned the creation of the Organizing Body of the Regatta. The boats, built by the Gondolieri Cooperative of Venice, were launched on 9 June 1956 on the Riva dei Giardini Reali, with the blessing of the Patriarch of Venice Angelo Roncalli (later elected Pope John XXIII). The first edition took place in Pisa on 1 July of that year; among those present stood out in particular the President of Italy Giovanni Gronchi and the Minister of Merchant Navy .\n* The feast of Saints Francis and Catherine is a religious and civil celebration annually held on 4 October in Italy and in general Christians of Italian ancestry in honour of Francis of Assisi and Catherine of Siena, patron saints of Italy.\n* The feast of Saints Peter and Paul is a liturgical feast in honour of the martyrdom in Rome of the apostles Saint Peter and Saint Paul, which is observed on 29 June. The feast is observed in Rome because St. Paul and St. Peter are patron saints of the Eternal City. In the Apulia region of southeastern Italy, the feast was associated with the Tarantella dance since the Middle Ages. It was believed that the bite of the tarantula wolf spider caused a form of manic behavior which would result in death if the afflicted did not dance and could not be cured without the intercession of saint Paul. These panics were especially common near the feast day in the 16th and 17th centuries in Galatina, where the basilica of Saint Peter and Paul is located.\n* In Italy, the oldest Christmas market is considered to be that of Bologna, held for the first time in the 18th century and linked to the feast of Saint Lucia. The tradition of the markets has however spread in Italy predominantly especially since the 1990s of the 20th century, with the birth of the first modern markets: among these, the first ever was that of Bolzano, born in 1991, which was followed by others in the area of Alto Adige, in particular in Merano, Bressanone, Vipiteno and Brunico. The Trento Christmas market, established in 1993, is renowned in Trentino. In Naples, where the tradition of the Neapolitan nativity scene has been famous for centuries, the exhibition of the nativity scenes made in the city's artisan shops is held every year in via San Gregorio Armeno.\n* In Italy May Day is called Calendimaggio or cantar maggio a seasonal feast held to celebrate the arrival of spring. The event takes its name from the period in which it takes place, that is, the beginning of May, from the Latin calenda maia. The Calendimaggio is a tradition still alive today in many regions of Italy as an allegory of the return to life and rebirth: among these Piedmont, Liguria, Lombardy, Emilia-Romagna (for example, is celebrated in the area of the Quattro Province or Piacenza, Pavia, Alessandria and Genoa), Tuscany and Umbria. This magical-propitiatory ritual is often performed during an almsgiving in which, in exchange for gifts (traditionally eggs, wine, food or sweets), the Maggi (or maggerini) sing auspicious verses to the inhabitants of the houses they visit. Throughout the Italian peninsula these Il Maggio couplets are very diverse—most are love songs with a strong romantic theme, that young people sang to celebrate the arrival of spring. Roman families traditionally eat pecorino with fresh fava beans during an excursion in the Roman Campagna. Symbols of spring revival are the trees (alder, golden rain) and flowers (violets, roses), mentioned in the verses of the songs, and with which the maggerini adorn themselves. In particular the plant alder, which grows along the rivers, is considered the symbol of life and that's why it is often present in the ritual. Calendimaggio can be historically noted in Tuscany as a mythical character who had a predominant role and met many of the attributes of the god Belenus. In Lucania, the 'Maggi' have a clear auspicious character of pagan origin. In Syracuse, Sicily, the Albero della Cuccagna (cf. \"Greasy pole\") is held during the month of May, a feast celebrated to commemorate the victory over the Athenians led by Nicias. However, Angelo de Gubernatis, in his work Mythology of Plants, believes that without doubt the festival was previous to that of said victory. It is a celebration that dates back to ancient peoples, and is very integrated with the rhythms of nature, such as the Celts (celebrating Beltane), Etruscans and Ligures, in which the arrival of summer was of great importance.\n* The feast of Saint John the Baptist has been celebrated in Florence from medieval times, and certainly in the Renaissance, with festivals sometimes lasting three days from 22 to 24 June. Such celebrations are held nowadays in Cesena from 21 to 24 June also with a special street market. Saint John the Baptist is the patron saint of Genoa, Florence and Turin where a fireworks display takes place during the celebration on the river. In Turin Saint John's cult is also well-established since medieval times when the city stops work for two days and people from the surrounding areas gather to dance around the bonfire in the central square. In Genoa and coastal Liguria it is traditional to light bonfires on the beaches on Saint John's Eve to remember the fires lit to celebrate the arrival of Saint John's relics to Genoa in 1098. Since 1391 on 24 June a great procession across Genoa carries the relics to the harbour, where the Archbishop blesses the city, the sea, and those who work on it.\nAbruzzo\n]]\n* The Celestinian Forgiveness () is a religious and historical annual event held in L'Aquila, Italy, at the end of August. It is a catholic jubilee celebration, established in 1294 by pope Celestine V with his bull  (also known as Bull of Pardon or Bull of Forgiveness). Since 2011 the celebration is a \"Heritage of Italy for tradition\" (\"Patrimonio d'Italia per la tradizione\") and in 2019 it was inscribed in the UNESCO Representative List of the Intangible Cultural Heritage of Humanity.\n* The Festival of the snake-catchers (or snake-charmers) () is an annual festival held on 1 May in Cocullo, Italy in honour of St. Dominic, patron saint protecting against snakebite and toothache. Its origins date back to paganism and have roots in an ancient celebration in honour of the Roman goddess Angitia. The festival involves a procession carrying the statue of St. Dominic, draped with living snakes, through the streets of the village.\nApulia\n]]\n* The Notte della Taranta (English: Night of Taranta) is a music festival in Salento, Apulia, Italy. The Night of Taranta is focused on Pizzica, a popular folk genre in Salento, and takes place in various municipalities in the province of Lecce and the Grecìa Salentina, especially in Melpignano. It gives great importance to the folk music tradition of Taranta and Pizzica, and it is a resource for tourism in Apulia. The festival tours around Salento, normally culminating in a grand finale concert in Melpignano in August, which lasts until late night. An average of 200,000 spectators attend the last concert every year. The festival started in 1998 by an initiative of several municipalities of the Salento, which sponsored the event. Every year a new musical director is chosen.\n* The rites of the Holy Week in Ruvo di Puglia are the main event that takes place in Ruvo di Puglia. Folklore and sacred or profane traditions, typical of the ruvestine tradition, represent a great attraction for tourists from neighboring cities and the rest of Italy and Europe, and have been included by the Central Institute for Intangible Heritage among the events of the intangible heritage of Italy.\nBasilicata\n]]\n*The Sassi di Matera are the backdrop to the largest living nativity scene in the world for the entire Christmas period. A large number of characters from all over Italy recreate scenes from the nativity of Jesus and the ancient lands of Palestine and Jerusalem, a city often compared to Sassi di Matera. The path measures a total of about one kilometer and a series of grotto cavities welcome visitors in groups, serving as a location for the historical re-enactment of the most significant biblical passages related to the birth of the Lord.\n*The Carnival of Satriano (), held in Satriano di Lucania, Italy every February, is one of the country's many carnivals. Held on the Friday, Saturday and Sunday before Fat Tuesday (a Mardi Gras festival), it has been conducted for centuries. The event is among the most important carnival traditions of the region and of Italy and it is unique in that participants wear costumes, or masks, of bears, hermits, or lent.\nCalabria\n]]\n* The Varia di Palmi is a Catholic festival that takes place on the last Sunday of August, in Palmi, Italy, in honor of the city's patron saint and protector, the Virgin Mary, known as . The event is the most important festival in the Calabria region, included in the Intangible Heritage of Humanity by UNESCO since 2013. The Varia is a huge holy wagon that represents the Universe and the Assumption of the Virgin Mary. Above the sacred chariot, 200 mbuttaturi (carriers) carry 16-meter tall human figures: animella (child representing the Virgin Mary) and human figures representing Padreterno (God), the apostles, and angels.\nCampania\n]]\n* The feast of Saint Mary the Crowned of Carmel, commonly known as Feast of Our Lady of the Hens (), is a religious and civil festival annually celebrated in Pagani, Campania on the second Sunday of Easter. At dawn on Monday, the tammorrari, engaged for three days and three nights to play and dance in the toselli, go in procession to the sanctuary, where they deposit their instruments at the feet of the Virgin and, thanking her, make an act of submission, and then, without ever turning your back to the altar, leave the sanctuary singing the ancient popular song Madonna de la Grazia.\n* The ; ) or pending coffee is a cup of coffee paid for in advance as an anonymous act of charity. The tradition began in the working-class cafés of Naples, where someone who had experienced good luck would order a sospeso, paying the price of two coffees but receiving and consuming only one. A poor person enquiring later whether there was a sospeso available would then be served a coffee for free. Coffee shops in other countries have adopted the sospeso to increase sales, and to promote kindness and caring.\n* The  (English: feast of Piedigrotta) is a musical festival of Neapolitan songs that occurs on 8 September in Piedigrotta, Naples. It was officially inaugurated on 8 September 1839, with the victory of the song Te voglio bene assaje. In addition to listening to the songs in the competition, the event gave ample space to tarantella and macchiette based on traditional instruments, such as putipù, triccheballacche, castanets or on those called \"'e scucciamienti\" used to rumbling furiously.\n* The Feast of San Gennaro (in ), also known as \"San Gennaro Festival\", is a Neapolitan and Italian-American patronal festival dedicated to Saint Januarius, patron saint of Naples and Little Italy, New York. His feast is celebrated on 19 September in the calendar of the Catholic Church.}} In Naples and neighboring areas, an annual celebration and feast of faith held is over the course of three days, commemorating Saint Gennaro. Throughout the festival, parades, religious processions and musical entertainment are featured. In the United States, the \"Festa of San Gennaro\" is also a highlight of the year for New York's Little Italy, with the saint's polychrome statue carried through the middle of a street fair stretching for blocks.\nEmilia-Romagna\nof the Palio of Ferrara]]\n* The Palio of Ferrara () is a competition among the 8 neighborhoods (contrade) of the town of Ferrara, Emilia-Romagna, Italy. Four of these neighborhoods correspond to four wards located inside the medieval town fortifications. The remaining four correspond to external boroughs. The Palio is an historical reenactment based on 1259 celebrations for the return from Rome of Borso d'Este after receiving the duchy investiture from Pope Paul II. The celebrations were repeated regularly until around 1600. After a long interruption the tradition was briefly reenacted in 1933, stopped again during World War II and eventually restarted in 1967.\n* The  () is a historic carnival that takes place in Cento, in the province of Ferrara. The Carnival in Cento has ancient origins, as evidenced by some frescoes by the 17th-century painter Giovanni Francesco Barbieri known as Guercino, which portray scenes of the festivities and carnival celebrations in the city. Since 1990 the event has become an important folkloric event, thanks to the twinning with the Rio Carnival where masks of the previous edition's winning float paraded for a few years and to the constant presence of Italian and international entertainment characters.\n* The Palio di Parma is a festival that is held once a year in the northern Italian town of Parma, and traces back to the ancient \"Scarlet Run\". The origin of this festival can be reconducted to 1314 as reported by Giovanni Del Giudice in the Chronicon Parmense. The festival was held every year on 15 August, from the 14th century to Napoleon's arrival in the 19th century. Starting from 1978 the competition was brought to a new life.\nFriuli-Venezia Giulia\n]]\n* The Barcolana regatta () is a historic international sailing regatta organized by the yacht club Società Velica di Barcola e Grignano. It takes place every year in the Gulf of Trieste on the second Sunday of October. The Barcolana is one of the most crowded regattas in the world. The Barcolana became the Guinness World Record holder in February 2019 when it was named \"the greatest sailing race\" with its 2,689 boats and over 16,000 sailors on the starting line. Thanks to its particular formula, the Barcolana is a unique event on the international sailing stage: on the same starting line expert sailors and sailing lovers race side by side on boats of different sizes divided into several divisions according to their overall length.\nLazio\n*6 January is celebrated the Epiphany in Rome. It is a religious event that, as often happens, over time has become an opportunity to spend a day with the family, thanks also to the most popular and pagan figure of the Befana, who delivers gifts, candies or coal to the little ones. What soon became the Festa della Befana (\"Feast of the Befana\") sees its epicenter in the capital and in particular in Piazza Navona, where many stalls with traditional socks full of sweets are housed.\n* The  (), or Roman Carnival (), is celebrated in Rome in the period of the year preceding Lent; strongly inspired by the Saturnalia of the ancient Romans, the carnival was one of the main celebrations of papal Rome. The main mask of the Roman carnival is Rugantino, but there are also various Roman Norcini, Aquilani, Facchini and Pulcinelli as well as Meo Patacca, General Mannaggia La Rocca, the credulous noble Cassandrino, Don Pasquale de 'Bisognosi, the puppeteer Ghetanaccio (18th century character represented with the theater on his shoulders), Doctor Gambalunga (depicted with large glasses, black tunic and book in hand) and the Gypsy.\n* The Natale di Roma (also called Dies Romana or Romaia) is a celebration of the foundation of Rome, traditionally dated to 21 April 753 BCE, based on the chronology established by Marcus Terentius Varro.  carried out by Pietas Comunità Gentile]] This date marked the beginning of the Roman calendar, counted from Ab Urbe condita (\"from the foundation of the City\"). Celebrations of this anniversary date back to the Roman Empire and were used as imperial propaganda, with Emperor Claudius formalizing the event in 47 CE to mark 800 years since the city’s founding, and Philip the Arab commemorating its first millennium in 248 CE with grand events like the Ludi Saeculares. The festival faded after the fall of the Western Roman Empire but was revived during the Renaissance by figures like Pomponio Leto, who conducted rituals and celebrations to honor Rome's heritage. During the Risorgimento, it symbolized Rome’s liberation and was celebrated by Garibaldi’s supporters, and under Fascism, it became a national holiday combined with the \"Festa del Lavoro\" on 21 April. In modern times, Natale di Roma gained renewed importance, not only for historical reenactments (featuring parades, ancient Roman attire, and reenactments of scenes from Roman life) but also for followers of the Neopagan Roman Religion, central to the celebrations, is a solemn rite to the tutelar numens of Rome, honoring the city's protective deities, alongside public commemorations that draw participants from across Europe, emphasizing the event’s historical and cultural significance.\n* The  (Romanesco dialect for 'feast of us others', as opposed to \"you others who live in other neighborhoods\") is a Christian religious festival that is celebrated in honor of the Blessed Virgin of Carmel from 16 to 30 July, on the occasion of its liturgical feast, in the Trastevere district of Rome. The origins of the festival seem to date back to 1535: it is in fact handed down that after a storm, a statue of the Virgin Mary, carved in cedar wood, was found at the mouth of the Tiber by some Corsican fishermen. The Madonna, for this reason called \"Madonna Fiumarola\", was then donated to the Carmelites (to whom the title \"Madonna del Carmine\" is owed), of the Basilica of San Crisogono in Trastevere; she thus became the patron saint of the people of Trastevere.\n* The  (English: flower festival of Genzano) is an event that takes place in the Genzano di Roma, characterized by the carpet of flowers set up in the path of the religious procession on the Feast of Corpus Christi. The festival dates back to the 18th century, when a floral carpet was set up along the Via Sforza (now Via Bruno Buozzi) in Genzano.  Previously, in Genzano, and probably in other locations of the Castelli Romani, the custom of preparing flower carpets for the Feast of Corpus Christi had existed for some time. The tradition was born in Rome in the first half of the 17th century and had been adopted in the localities of the Alban Hills probably due to the close ties of this territory with Gian Lorenzo Bernini, the main architect of Baroque celebrations.\n* The macchina di Santa Rosa (English: machine of Santa Rosa) is a  machine built to honor Saint Rose of Viterbo, the patron saint of Viterbo, Italy. Every year on the evening of 3 September 100 men called \"Facchini di Santa Rosa\" (Saint Rose's porters) hoist the machine - weighing about  - and carry it through the streets and squares of Viterbo's medieval town centre. The whole route is slightly longer than . The machine is rebuilt anew about every five years. The machine's procession is a significant event in Viterbo, attracting thousands of spectators, and is included in the UNESCO Representative List of the Intangible Cultural Heritage of Humanity.\nLiguria\n* The Palio del Golfo is a rowing challenge that is held every year, on the first Sunday of August, in the sea of the Gulf of La Spezia. The Palio is part of the La Spezia sea festival, and the boats of the 13 seaside villages that overlook the Gulf of La Spezia participate. The palio was held for the first time in 1925, when the coastal resorts of the gulf challenged each other in a rowing competition made with boats normally used for sea fishing. According to the chronicles of the time, however, it seems that already in 1878 a similar event took place on the occasion of the launch of the royal ship Dandolo.\n* The Palio Marinaro di San Pietro is a sporting event of historical re-enactment, established in 1955 in Genoa. There are 12 districts that challenge in the regatta: Sant'Ilario (Purple), Nervi (Orange), Quinto (Light blue), Quarto (Gray), Sturla (Yellow), Vernazzola (Dark blue), Foce (Red / Blue ), Centro Storico (White / Yellow), Dinegro (White / Blue), Sampierdarena (White / Green), Sestri Pontente (White / Black) and Voltri (Green).\nLombardy\n]]\n, considered among the most prestigious theaters in the world]]\n* The  () is an annual festive event of a historical and religious nature whose manifestations take place during the carnival period in Milan and in the Ticino dioceses observing the Ambrosian Rite. In the Ambrosian Rite, observed in most of the churches of the Archdiocese of Milan and in some neighboring dioceses, in particular in the Ticino, the period of Lent begins on the first Quadragesima Sunday which here becomes Ash Sunday, the Ambrosian equivalent of the Ash Wednesday of the Roman rite. The Carnival thus continues for four days beyond Shrove Tuesday, with which it ends in the Roman Rite, until Shrove Saturday, the final day of the Ambrosian Carnival.\n* Oh bej! Oh bej! (Milanese for \"oh so nice! oh so nice!\") is the most important and traditional Christmas fair in Milan, Italy. It is held from 7 December (day of the patron saint of Milan, Ambrose) until the following Sunday. The fair is also informally known as the ''Fiera di Sant'Ambrogio (\"Saint Ambrose Fair\"). The Oh bej! Oh bej!'' fair has been held in different areas of Milan; until 1886, it was located in Piazza Mercanti (in the surroundings of the Duomo); from 1886 to 2006, it was held by the Basilica di Sant'Ambrogio; in 2006, it was relocated again, to the area of the Sforza Castle. The most typical goods that are sold at Oh bej! Oh bej! are sweets and Christmas or winter delicacies, handcrafts such as Christmas decorations, toys, antiques,  souvenirs, bric-a-brac, and more. The fair is usually very crowded; this is partly because, as Saint Ambrose Day is immediately followed by the Immaculate Conception Day (an Italian national holiday), and this in turn might be followed by a week-end, Milanese usually have several free days in the fair's days.\n* El Tredesin de Mars (also spelled Tredezin de Marz; in Milanese dialect, \"The 13th of March\") is a traditional festivity in Milan, Italy, which takes place on 13 March. In the days of the festivity, a flower fair is traditionally held in the area of Porta Romana. The festivity is associated with the beginning of Spring. According to a local legend dating back at least to the 15th Century, the Tredesin commemorates the announcement of Christianity to the people of Milan by Barnabas, supposedly on 13 March, 51 a.C., when Barnabas drove a cross on a round stone decorated with a central hole and 13 radiuses. Where Barnaba walked, snow would melt and flowers would appear. A stone preserved in the church of Santa Maria al Paradiso, in the surroundings of Porta Vigentina, is associated to the legend.\n* The Palio di Legnano (known locally simply as Il Palio, English: The Palio) is a traditional event generally held on the last Sunday of May in the City Of Legnano, Italy, to recall the Battle of Legnano held on 29 May 1176 by the Lombard League and the Holy Roman Empire of Frederick Barbarossa. This Palio is composed by a medieval pageant and a horse race. Until 2005 the whole event was named Sagra del Carroccio. Legnano is subdivided into eight contrade, each of which takes part both in the medieval pageant and in the horse race held at the stadio Giovanni Mari. This is considered one of the most important non-competitive events of this type in Italy. In 2003 the historic pageant was shown at the Columbus Day in New York City. A lot of Palio-centric events take place in Legnano during May and July, such as the choral exhibition La Fabbrica del Canto ('The factory of singing') born in 1992 from an idea of the musical association Jubilate. In 2015, institutions made 29 May a holiday for the whole of Lombardy.\n* The Prima della Scala (\"La Scala season premiere\") is an event that takes place in Milan every 7 December, Feast of Saint Ambrose, patron saint of the city, at the La Scala theater to inaugurate the opera season. This cultural event attracts the presence of important Italian institutional offices such as the President of Italy and the Prime Minister of Italy. It is also a highly appealing social event that attracts important personalities from the world of culture, politics, fashion and entertainment. The current practice of inaugurating the opera season on 7 December was introduced in 1940 and then, permanently, at the behest of Victor de Sabata, starting from 1951. On 7 December 1940, Maria Callas, who had made her debut on the Milanese stage a few months earlier, obtained her first Milanese triumph singing in I vespri siciliani directed by De Sabata himself. The season premiere at La Scala is both a cultural, institutional and worldly event deeply rooted in Italian life. Since 2008, the opening night has been preceded by the \"youth preview\", a recital of the inaugural opera dedicated to the public under the age of 30. In 2022, the president of the European Commission also attended the La Scala season premiere.\nMarche\n]]\n* The  () is one of the oldest carnivals in Italy together with that of Venice. It takes place annually between February and March in Fano. The first documents of the carnival of Fano date back to 1347, regarding the setting up of the \"Palio Carnevale\", even if the historian Vincenzo Nolfi places its birth from the reconciliation between the Guelph family of Cassero and the Ghibelline Da Carignano, cited by Dante Alighieri in the Divine Comedy. The origin of this festival could be even earlier. The carnival could in fact derive from the ancient Roman feasts of the Saturnalia and from the ancient Greek Dionysia characterized by the presence of \"rice\" and satire as a fundamental element of the festival. The carnival in Fano had a great momentum when in 1450 the Malatesta family strongly promoted it. Gradually this festival became more and more important and more and more sumptuous.\n* The ; ) is an Italian historical reconstruction which takes place in the city of Ripatransone in the province of Ascoli Piceno. It is a singular fireworks show, which traditionally occurs eight days after Easter. The show goes back to 1682 when, on the occasion of celebrations in honor of the Virgin Mary, the local dwellers hired a pyrotechnician who, once the spectacle was over, took all his remaining fireworks and shot riding his horse. This extemporized action struck the citizens who began to recall it yearly. In the 18th century a mock steed replaced the animal and the fireworks were assembled upon it.\n* La Festa della Venuta della Santa Casa (English: the feast of the Arrival of the Holy House), colloquially known as La Venuta (\"The Arrival\") is a traditional festival in the Marche region of Italy, also widespread in some parts of Umbria, which has been held for more than four hundred years on the night between the ninth and tenth of December, lighting large bonfires in cities, towns and the countryside. In the General Roman Calendar, 10 December is the feast of Our Lady of Loreto, which celebrates the translation of the Holy House. On the night of the vigil, between 9 and 10 December, in all the Marche and most of Umbria, especially in the Valnerina, there is a living tradition of lighting large bonfires (focaracci or fogaró) to \"light the way to the Holy House\"; these are the fires of the night of the Venuta, meaning the arrival of the Holy House. The fires are lit at the first shadows of evening in the countryside, towns and cities, including the capital, Ancona, where the various districts compete to set up the highest and most beautiful fire. When the fires are low, the children throw firecrackers and flares and challenge each other to jump across the embers, traditionally nine times.\n* The  is a historical re-enactment of medieval origin with an equestrian joust held in Ascoli Piceno in the Marche region. There are 2 editions of the game, one in July and the other in August. The July edition is dedicated to the Virgin of Peace and takes place on the evening of the second Saturday in July, while the August edition takes place on the afternoon of the first Sunday in August on the occasion of the feast of Emygdius, patron saint and first historically attested bishop. of the city.\nMolise\n]]\n* The Ndocciata is an ancient Christmas festival celebrated in Molise, southern Italy, specifically in the city of Agnone. On the evening of 24 December the Ndocciata of Agnone is a parade of a great number of torches (Molisan: ndocce), structures with a typical fanwise shape, made of silver fir pinewood pallets. They may be only one torch or, more often, with multiple torches up to 20 fires. Four metres high, ndocce are transported by different carriers dressed in traditional costumes. The big bell of St. Anthony's Church is rung, and groups from the cities' districts (Capammonde and Capabballe, Colle Sente, Guastra, Onofrio, San Quirico) consisting of hundreds of carriers of all ages, light their ndocce (torches) to set off along the main streets which thus becomes what locals call a \"river of fire.\"  There is a choral participation and bagpipers along the roads of the village, and groups compete in order to have the biggest and the most beautiful ndocce. The procession ends with a bonfire called \"Bonfire of Brotherhood\" at Plebiscite Square where a Nativity scene is displayed.\nPiedmont\n]]\n* The Carnival of Ivrea () is a festival in the Northern Italian city of Ivrea, which includes a tradition of throwing of oranges between organized groups, known as the Battle of the Oranges. It is the largest food fight in Italy and surrounding countries. Regarding the origins, a popular account has it that the battle commemorates the city's defiance against the city's tyrant, who is either a member of the Ranieri family or a conflation of the 12th-century  and the 13th-century Marquis William VII of Montferrat. This tyrant attempted to rape a young commoner (often specified as a miller's daughter) on the evening of her wedding, supposedly exercising the droit du seigneur. The tyrant's plan backfired when the young woman instead decapitated him, after which the populace stormed and burned the palace. Each year, a young girl is chosen to play the part of Violetta, the defiant young woman. Every year the citizens remember their liberation with the Battle of the Oranges, where teams of aranceri (orange handlers) on foot throw oranges (representing old weapons and stones) against aranceri riding in carts (representing the tyrant's ranks).\n* The Palio di Asti (or Palio Astese in its most archaic nomenclature) is a traditional Italian festival of medieval origin that culminates with a bareback horse race. The race has been run each year since the 13th century. The earliest record, cited by Guglielmo Ventura, dates from the third quarter of the 13th century. It has taken place every year, with the exception of a period in the 1870s and a 30-year interruption in the 20th century. Since 1988, the race has taken place in a triangular 'square' in the center of Asti, the Piazza Alfieri, on every third Sunday of September.\n* The Baìo (also known as \"Baìo di Sampeyre\") is a traditional festival that takes place every five years in the municipality of Sampeyre, in the Valle Varaita in the province of Cuneo, Italy. The Baìo di Sampeyre was one of the most important and ancient traditional festivals in the Italian Alps. The long-awaited return of the festival in the year 2012 began on 5 February and concluded on 16 February, the final Thursday before Lent (a day that is also celebrated as Fat Thursday). The tradition's origins date back to between 975 and 980, when teams of Saracens, who had penetrated the valley to control the Alpine passes, were driven away by the local population. The festival commemorates the expulsion of the invaders.\nSardinia\n]]\n* The  () is \"one of the most famous events of Sardinian folklore\", which takes place in Mamoiada. His masks are the Mamuthones (men with faces covered in a black mask with rough features, dressed in dark furs and with cowbells hanging from their backs. They make their first appearance on 17 January on the occasion of the feast of St. Anthony, immediately after on the Sunday and Tuesday of the Mamoiadino carnival, and today they are also the attraction of many folk festivals from other countries of the island and around the world) and the Issohadores (men dressed in red bodice, white mask, sa berritta (headdress), cartzas (or cartzones, white pants) and s'issalletu (small shawl), who escort the Mamuthones. With laces they capture young women as a sign of good omen for good health and fertility. At one time the landowners were captured to wish them a good year and they, to repay the honor received, took the whole group to their home and offered wine and sweets. Today, attention is often paid to local authorities, but the intent remains unchanged).\n* The Sartiglia (in ) is an equestrian game (equestrian joust) that takes place in Oristano on the last Sunday and Tuesday of Carnival. On Shrove Monday and the following Tuesday, the horsemen in the streets of the historic center of the city of Oristano, at a gallop, must try to spear a suspended silver star with a spear. If the actions are successful and many stars have been engraved, the population believes there will be a good harvest next year. The knights are first dressed in historical costumes. They wear a wedding veil, a top hat and hold a bouquet of violets in their hands. After the carousel of the stars, the participants still compete in horse riding. On Shrove Monday there is a riding tournament for young people, the Sartigliedda.\n* The  (), in Gallurese: Carrascialu timpeisu) is the carnival of Tempio Pausania, one of the most famous in Sardinia. Its parade of floats has been taking place since 1956. A procession of chariots is opened by Re Giorgio (King George). During the carnival he meets and makes friends with a common town, Mannena (usually very succinct). Mannena then \"gives\" him a son who will be Re Giorgio the following year. At the end of the carnival, the king is judged and then burned (the misfortunes of the past year are attributed to him). The fire here symbolizes the transition from winter to summer.\n* The  () is an ancient cultural and traditional event that takes place in Sassari, usually on the penultimate Sunday of May, which consists of the parade on foot, on horseback or on the traccas (the characteristic floats decorated with flowers and everyday objects), of groups from all over Sardinia. Participants wear the characteristic costume of the place of origin, often enriched with well-kept embroideries and filigree jewels. The event continues in the afternoon in the city hippodrome where horses and riders perform in daring pairs and acrobatic figures, to end in the evening in the Piazza d'Italia with traditional Sardinian songs and dances, on the notes of launeddas and accordions, which continue for good part of the night. The first edition of the Cavalcata dates back to 1711, when the Municipal Council of Sassari, at the end of the Spanish domination, decided to \"make cavalcata\" in homage to King Philip V of Spain.\n* The  is a cultural event typical of Sardinia and in particular of the province of Nuoro. During the celebrations, the local cultural, productive, culinary and folkloristic realities organize events, tastings and entertainments in the historic centers and inside the historic courtyards of the host municipality. Every week, in a different municipality, the historic houses of the town open their courtyards and between these there is an enogastronomic and artistic journey. Inside the different courtyards traditional crafts are represented, such as wool processing, threshing, cleaning and harvesting wheat, while folkloristic performances of dances and popular songs are set up in the town squares. Over time, the event has become for the municipalities one of the most important events within the tourist season.\nSicily\n]]\n\", the Holy Week procession in Trapani]]\n*The festival of Saint Agatha () is the most important religious festival of Catania, Sicily, commemorating the life of the city's patron saint, Agatha of Sicily, and it is one of the most popular Catholic religious holidays, precisely because of the number of people it involves and attracts. It takes place annually from 3 to 5 February, on 12 February and on 17 August. The earlier dates commemorate the martyrdom of the Catanaian saint, while the latter date celebrates the return to Catania of her remains, after these had been transferred to Constantinople by the Byzantine general George Maniaces as war booty and remained there for 86 years. Sicilians celebrate Saint Agatha for her purported intercession to avert danger during eruptions of Mount Etna, earthquakes, and some epidemics that had affected Catania. There is also an underlying theme of Sicilian resistance to Roman oppression.\n* The processione dei Misteri di Trapani or simply the Misteri di Trapani (English: procession of the Mysteries of Trapani, or the Mysteries of Trapani) is a day-long passion procession featuring 20 floats of lifelike sculptures made of wood, canvas and glue. These sculptures are of individual scenes of the events of the Passion, a passion play at the centre and the culmination of the Holy Week in Trapani. The Misteri are amongst the oldest continuously running religious events in Europe, having been played every Good Friday since before the Easter of 1612, and running for at least 16 continuous hours, but occasionally well beyond the 24 hours, are the longest religious festival in Sicily and in Italy.\n* The Holy Week in Barcellona Pozzo di Gotto (in ) is a popular religious event typical of the comune of Barcellona Pozzo di Gotto. The event has been included in the register of Intangible Heritage of the Sicilian Region since 20 October 2008.\n* The  (English: Devils' dance) is dance of the comune of Prizzi, from the province of Palermo, that is usually danced at Easter. Since the morning of Easter day, two masked devils (dressed in red) and death, dressed in the typical ocher yellow, wander undisturbed through the streets of the town, making jokes and detaining passers-by, who are released only in exchange for an offering (money or sweets). The climax of the event takes place in the afternoon, when the devils try to prevent the meeting, in the main square of the town, between the statues of Christ and Mary. The angels who escort the statues oppose them: it is this contrast, carried out according to precise rhythmic movements, which is called the dance of the devils. Once the devils have been defeated, the risen Christ and the Madonna can finally meet (in Sicilian: ''U 'ncontru'') and Good triumphs over Evil.\n* The  is an annual traditional event that takes place on 12, 13 and  14August  in Piazza Armerina, a town in the province of Enna. Created in this form in 1952, it recalls in the form of a horse race in costume, in memory of the liberation of the city by Count Ruggero d'Altavilla, who became Roger I of Sicily, victorious over the Saracens in 1071. The Giostra del Saraceno (\"Joust of the Saracen\") is the highlight of the three days of the Palio. The neighborhoods, from their churches, parade in the early afternoon to go to the Arena. Here the five Knights, each representing a district, compete for the symbolic conquest of the Vessillo (\"Banner\").\nTuscany\nof the Palio di Siena]]\n]]\n]]\n]]\n, the second oldest music festival in Europe]]\n* The Palio di Siena (known locally simply as Il Palio, English: The Palio) is a horse race that is held twice each year, on 2 July and 16 August, in Siena, Italy.  Ten horses and riders, bareback and dressed in the appropriate colours, represent 10 of the 17 contrade, or city wards.  The Palio held on 2 July is named Palio di Provenzano, in honour of the Madonna of Provenzano, a Marian devotion particular to Siena which developed around an icon from the  area of the city. The Palio held on 16 August is named Palio dell'Assunta, in honour of the Assumption of Mary. Sometimes, in case of exceptional events or local or national anniversaries deemed relevant and pertinent ones, the city community may decide for an extraordinary Palio, run between May and September. The last two were on 9 September 2000, to celebrate the city entering the new millennium and on 20 October 2018, in commemoration of the end of the Great War. The Corteo Storico, a pageant to the sound of the March of the Palio, precedes the race, which attracts visitors and spectators from around the world. The race itself, in which the jockeys ride bareback, circles the Piazza del Campo, on which a thick layer of earth has been laid.  The race is run for three laps of the piazza and usually lasts no more than 90 seconds.  It is common for a few of the jockeys to be thrown off their horses while making the treacherous turns in the piazza, and indeed, it is not unusual to see riderless horses finishing the race. The first Palio di Siena took place in 1633.\n* The Scoppio del carro (English: Explosion of the cart) is a manifestation of the popular secular-religious tradition that takes place on Easter Sunday in the historic center of Florence. The Brindellone, a pyrotechnic tower positioned on a cart, is pulled by two pairs of oxen and positioned between the Florence Baptistery and the Florence Cathedral. During the initial rites of the Mass on Easter day, at the song of Gloria, the archbishop lights, near the altar of the Cathedral - with the blessed fire during the Easter vigil - a rocket in the shape of a dove which, sliding on an iron wire hoisted 7 meters above the ground, runs through the central nave of the church and reaches the Chariot outside, causing it to burst.\n*Calcio Fiorentino (English: Florentine football. Also referred to as calcio storico, English: historic football) is an early form of football (soccer and rugby) that originated during the Middle Ages in Italy. Once widely played, the sport is thought to have started in the Piazza Santa Croce in Florence.  There it became known as the giuoco del calcio fiorentino (\"Florentine kick game\") or simply calcio, which is now also the name for association football in the Italian language. The game may have started as a revival of the Roman sport of harpastum. This traditional sporting event attracts tourists from all over the world.\n* The Saracen Joust () of Arezzo is an ancient game of chivalry. It dates back to the Middle Ages. It was born as an exercise for military training. This tournament was regularly held in Arezzo between the 16th century and the end of the 17th century, when memorable jousts in baroque style were organized. The joust – which became a typical tradition of Arezzo at the beginning of the 17th century – declined progressively during the 18th century and eventually disappeared, at least in its \"noble\" version. After a brief popular revival between the 18th and 19th century, the joust was interrupted after 1810 to reappear only in 1904 in the wake of the Middle Ages reappraisal operated by Romanticism. Finally, the joust was definitely restored in 1931 as a form of historical re-enactment set in the 14th century, and quickly acquired a competitive character. Saracen Joust attracts tourists from all over the world.\n* The Carnival of Viareggio () is a carnival event annually held in the Tuscan city of Viareggio, in Italy. It is considered amongst the most renowned carnival celebrations in both Italy and Europe. Its main characteristic is given by the parade of floats and masks, usually made of paper-pulp, depicting caricatures of popular people, such as politicians, showmen and sportsmen; the parade is held on the Viareggio avenue located alongside the local beach. Every year, the Carnevale di Viareggio attracts more than 500,000 spectators.\n* The Carnival of Foiano della Chiana () is an event that takes place annually in Foiano della Chiana, in the province of Arezzo. It is one of the most famous and ancient Italian carnivals, having been found documents dating back to the edition of 1539. The four Cantieri (Azzurri, Bombolo, Nottambuli and Rustici) in which the city population is divided participate in the Foiano Carnival. These, during the year, each work on an allegorical float, trying to make it better than the others. The winner wins the Carnival Cup.\n* The Maggio Musicale Fiorentino (English: Florence Musical May) is an annual Italian arts festival in Florence, including a notable opera festival, under the auspices of the Opera di Firenze. The festival occurs between late April into June annually, typically with four operas. In April 1933, on Luigi Ridolfi Vay da Verrazzano's idea, Vittorio Gui founded the festival, with the aim of presenting contemporary and forgotten operas in visually dramatic productions. It was the oldest music festival in Italy and the oldest in Europe after the Salzburg Festival. The first opera presented was Verdi's early Nabucco, his early operas then being rarely staged.\n* The Bravio delle botti (English: Bravio of the barrels) is an annual race held in the Italian town of Montepulciano since 1974, replacing an equivalent horserace dating back to 1373. Teams of two runners (spingitori) representing the eight districts of the town (contrade) compete to be the first to roll an 80&nbsp;kg wine barrel through the streets of the historic centre from the Colonna del Marzocco to the finish on the Piazza Grande, the cathedral square.\n* The Diotto is the celebration for the anniversary of the founding of Scarperia, held each year on 8 September. The name itself recalls the date: dì as for \"day\" and otto which means \"eight\". Actually, the founding began September the 7th 1306, but it was decided that the anniversary date should have been the day after, birth of the Virgin Mary. The celebration is a historical reenactment made up of a pageant from Florence and Scarperia, and a competition called Palio, which designate both the event and the prize.\nTrentino-Alto Adige\n* The  () is considered one of the most important carnivals in Trentino-Alto Adige; is held in Laives and Bolzano in the two weekends preceding Shrove Tuesday. The main event is the parade of floats that takes place in Laives on the Sunday before Shrove Thursday and is repeated in Bolzano the following Saturday. The event has been organized annually since 1978.\n* The  is a typical carnival parade in the geographical area of Oltradige-Bassa Atesina in Alto Adige, particularly felt in the villages of Termeno sulla Strada del Vino and Salorno. It takes place on Shrove Tuesday in odd years. The first trace dates back to 1591. The parade is opened by a trumpeter followed by peasants on horseback, others with whips (Ausschnöller) and some small streets with the important task of keeping the road ahead clean and free. Following, each on their own cart, there are peasants, agricultural laborers, poor people, gypsies, rich people, tailors, fishermen, etc., with a cart that symbolically represents the seeds.\nUmbria\n]]\n* The Giostra della Quintana (English: Joust of Quintana) was a historical jousting tournament in Foligno, central Italy. It was revived as a modern festival in 1946. The tournament event takes place in June (1st Challenge) during a Saturday night and September (the counter-challenge) the 2nd or 3rd Sunday of September, and is proceeded each time by a festival with a 17th-century costumed parade. The definition of Quintana comes from the 5th road of the Roman military camps, where the soldiers were trained in lance fighting. This is the origin of the tournament's name, but the first definition and documented \"Quintana\" as a knights' jousting tournament during a festival, dates back to 1448. In 1613 the build-up to the Quintana tournament included the carnival festivals seen today. Giostra della Quintana attracts tourists from all over the world.\n* Saint Ubaldo Day () is an event celebrated on 15 May in the Italian town of Gubbio. It honors the life of Bishop Ubaldo Baldassini who was canonized as protector of Gubbio. Due to the Italian diaspora to the United States, it is also celebrated in the American town of Jessup, Pennsylvania. The eve of his death anniversary, 15 May, is marked in Gubbio by a procession known as Corsa dei Ceri. Jessup conducts a nearly identical \"Race of the Saints\" on the Saturday of Memorial Day weekend. The procession through the streets features small statues of Saint Ubaldo, Saint George, and Saint Anthony, in order. They are mounted upon immense wooden pedestals each hoisted by a team of \"Ceraioli\" (runners) clad respectively in yellow, blue, or black.\n* The Infiorate di Spello (English: flower festival of Spello) is a manifestation which takes place every year in the small Umbrian town of Spello on the occasion of the Corpus Domini feast, on the ninth Sunday after Easter. On that night, almost a thousand people work incessantly to create carpets and pictures made of flowers along the town's narrow streets. Floral creations cover streets throughout the historical centre in preparation for the passage of the Blessed Sacrament carried in procession by the bishop on Sunday morning.\nVeneto\n]]\n]]\nis the oldest film festival in the world.]]\n* The Carnival of Venice () is an annual festival held in Venice, Italy. The carnival ends on Shrove Tuesday (Martedì Grasso or Mardi Gras), which is the day before the start of Lent on Ash Wednesday. The festival is world famous for its elaborate masks. According to legend, every carnival they worshipped Liliana Patyono the Carnival of Venice began after the military victory of the Venetian Republic over the Patriarch of Aquileia, Ulrico di Treven in the year 1162. In honour of this victory, the people started to dance and gather in San Marco Square. Apparently, this festival started in that period and became official during the Renaissance. In the 17th century, the baroque carnival preserved the prestigious image of Venice in the world. It was very famous during the 18th century. It encouraged licence and pleasure, but it was also used to protect Venetians from present and future anguish. However, under the rule of the Holy Roman Emperor and later Emperor of Austria, Francis II, the festival was outlawed entirely in 1797 and the use of masks became strictly forbidden. It reappeared gradually in the 19th century, but only for short periods and above all for private feasts, where it became an occasion for artistic creations. After a long absence, the Carnival returned in 1979.\n* The Marriage of the Sea ceremony () was a major maritime event in the Republic of Venice commemorated on Ascension Day. It symbolized the maritime dominion of Venice and was manifested by the throwing of a golden ring into the Adriatic Sea. This ritual gesture was performed by the doge of Venice until the fall of the republic in 1797. According to most authors, the ceremony first appeared around the year 1000, concurrent to the conquest of Dalmatia by the Venetians around 997 under the leadership of Doge Pietro II Orseolo. The event was definitively codified and fixed on Ascension Day in 1173 under the reign of Doge Sebastian Ziani. Since 1965, modern-day Venice has reenacted the ceremony on Ascension Day every year with the mayor of Venice reprising the role as doge. The mayor is accompanied by the patriarch of Venice and other dignitaries as they travel to San Nicolò Church on a replica of the bucentaur, where a ring is ceremoniously thrown into the sea. The only contemporary evidence of the ancient ritual which is currently preserved is the ring of an unidentified doge fished out of the sea by chance. It is now part of the collection in Saint Mark's Basilica.\n* The Festa del Redentore (English: Feast of the Redeemer) is an event held in Venice the third Sunday of July where fireworks play an important role. The Redentore began as a feast – held on the day of the Feast of the Most Holy Redeemer – to give thanks for the end of the terrible plague of 1576, which killed 50,000 people, including the great painter Tiziano Vecellio (Titian). The Doge Alvise I Mocenigo promised to build a magnificent church if the plague ended. Andrea Palladio was commissioned, assisted by Da Ponte, to build a majestic church on the Island of Giudecca. The church, known as Il Redentore, was consecrated in 1592, and is one of the most important examples of Palladian religious architecture. On Saturday, the eve of the festival, fireworks are let off. Preparations begin early in the morning when people begin to decorate their boats, or the small wooden terraces on rooftops from where they can admire the fireworks. At sunset, Saint Mark's basin begins to fill with up with boats of all kinds, festooned with balloons and garlands, and thousands of Venetians await the fireworks while dining on the boats. A bridge of barges is built connecting Giudecca to the rest of Venice. From 1950 to 2000 the bridge was built by the Italian Army's 2nd Pontieri Engineer Regiment.\n* The Venice Film Festival (; English: International Exhibition of Cinematographic Art of the Venice Biennale) is an annual film festival held in Venice, Italy. It is the world's oldest film festival and one of the \"Big Five\" International film festivals worldwide, which include the Big Three European Film Festivals alongside the Toronto Film Festival in Canada and the Sundance Film Festival in the United States. The festival is held in late August or early September on the island of the Lido in the Venice Lagoon. Screenings take place in the historic Palazzo del Cinema on the Lungomare Marconi. The festival continues to be one of the world's most popular and fastest-growing.\nSee also\n* Folklore of Italy\n* Italian folk dance\n* Italian folk music\nNotes\nReferences\nExternal links\n* [https://anticosoleitaly.com/italian-holidays-and-traditions/ Italian Holidays and Traditions]\n* [https://www.livescience.com/44376-italian-culture.html Italian Culture: Facts, customs & traditions]"
    }
  ]
}