{
  "content": [
    {
      "type": "text",
      "text": "# Traditional Albanian clothing\n\nThe traditional Albanian clothing () includes more than 500 different varieties of clothing in all Albania and the Albanian-speaking territories and communities (including the Arbëreshë in Italy, Arvanites in Greece and Arbanasi in Croatia). Albania's recorded history of clothing goes back to classical times. It is one of the factors that has differentiated this nation from other European countries, dating back to the Illyrian period.\nAlmost every cultural and geographical region in the country has its own specific variety of costume that varies in detail, material, color, shape, and form. Albanian folk dress is often decorated with symbolic elements of Illyrian antique pagan origin, like suns, eagles, moons, stars, and snakes. Fabrics are traditionally made by weaving clothes using looms. To this day, some conservative old men and women mainly from the North wear traditional clothing in their daily lives. Instead, older women from the South usually wear all-black outfits. Men and boys are usually seen wearing long, white skirts and long socks that are similar to tights.\nParts\nAlbanian dress consists of the following\nHeadgear\nMen\nThe following headdresses are in use for men:\n*Qeleshe  or plis: a type of hat worn by men in Albania, Kosovo, and the Albanian-speaking parts of Greece and North Macedonia. In central Albania (Tirana, Durrës, Kavaja) it is cone-shaped, and in North Albania and Kosovo round.\n* Albanian hat () worn typically during the 15th to 18th centuries and immortalized in Onufri's paintings.\n*Qylafë : a woolen high hat worn in southern Albania.\nWomen\nThe following headdresses are in use for women:\n*Kapica : a headdress for women.\n*Langi, other names include: peshqira, riza, marhamë, pashnik.\n*Lëvere : right shaped headdress.\n*Kryqe : square shaped headdress.\nPants and upper body covers\n*Fustanella : traditional skirt-like garment worn by men.\n*Tirqe : long pants worn by men.\n*Brekushe: for men and women.\n*Xhubleta : Only worn by women.\n*Mbështjellëse- Only worn by women.\nXhamadan\nA xhamadan is a traditional vest, which is worn by Albanian men throughout Albania, in Kosovo, Albanians in North Macedonia, Albanians in Serbia, Albanians in Montenegro, and in the Arbëresh villages in Italy.\nBrez\nBrez are traditional belts, which are worn by Albanian men throughout Albania, in Kosovo, North Macedonia, Serbia, Montenegro, and in the Arbëresh villages in Italy.\nÇorape\nÇorape  are traditional socks which are worn by Albanian men throughout Albania, in Kosovo, North Macedonia, Serbia, Montenegro, and in the Arbëresh villages in Italy.Çorape are other known as socks. But they were part of traditions.\nOpinga\nOpinga : (Art sandals), are traditional shoes which are worn by Albanian men throughout Albania, in Kosovo, North Macedonia, Serbia, Montenegro, and in the Arbëresh villages in Italy.\nGallery\nFile:Gjirokastër folk singers 1988.jpg|Albanian folk singers\nFile:Kostume popullore - Flickr - Shkumbin (1).jpg|Central Albanian women's dresses\nFile:Woman's sleeveless jacket, Albania, view 1, mid 19th century, silk, gold, silver, embroidery - Royal Ontario Museum - DSC04436.JPG|Woman's sleeveless jacket\nFile:Civita (Çifti) (CS), Le Vallje 2009. (5).jpg|Arbëreshë women's clothing\nFile:Typical Arbëreshë female costumes.jpg|Arbëreshë women's clothing\nFile:VeshjeKombetare.JPG|Costumes from Dibra\nFile:Albanian fustanella - 1850 - 1900.jpg|Fustanella\nFile:AlbaniansinGreece1833-1875-fustanella-Med.jpg|Albanians in Greece\nFile:Arnaut-in-Cairo.jpg|Albanian in Egypt\nFile:Traditional clothings.jpg|Traditional clothing\nFile:Veshje Tradicionale (7).JPG|Albanian clothing from the Great Highlands\nFile:Veshje Tradicionale (8).JPG|From Kosovo\nFile:Veshje Tradicionale (4).JPG|From Kosovo\nFile:Logu i Bjeshkëve 2017 – first dance 2.jpg|Kelmend region clothing\nFile:Mintan.jpg|Mintan, an embroidered Albanian jacket.\nSee also\n* Culture of Albania\n* Albanian dances\n* Traditional clothing of Kosovo\n* Gjirokastër National Folklore Festival\nReferences\nFurther reading\n*\n*"
    }
  ]
}