{
  "content": [
    {
      "type": "text",
      "text": "# Traditional Phenological Knowledge\n\nTraditional Phenological Knowledge can be seen as a \"subset of Indigenous Knowledge\". Traditional Phenological Knowledge (TPK) is the knowledge based on traditional observations made by Indigenous Peoples that predict seasonal changes of nature and their immediate environment. This can be useful for the management of naturally occurring phenomenon, as well as \"adaptive management\" such as fire management. TPK is not a novel practice and has been practiced for hundreds of years. TPK encompasses history, observations and Traditional Knowledge(TK) or Indigenous Knowledge (IK). Indigenous Knowledge is flexible and always evolves. It considers the past, present and future of environmental and biological generations.\nTPK is integrative and interactive. It falls under the same teachings of Traditional Ecological Knowledge also known as TEK. Both TPK and TEK share close definitions which IK can be an umbrella term. Traditional forms of knowledge are combined with sustainable interaction with the land. Indigenous knowledge creates a relationship that is respectful and symbiotic with the natural world and promotes the existence of passing on hands-on experiences to future generations.\nPhenology in TPK can be qualitative and quantitative. Observations can be described, passed down by oral histories. TPK can reinforce what is measured and recorded scientifically. TPK can be a tool to help leverage climate change and biodiversity loss in today's climate crisis.\nTPK can be \"direct\" or \"indirect\". Direct observations of phenology in TPK can refer to species signals and timings of secondary species. Direct TPK is translated through the use of belief systems, spirituality, stories, myth and ceremonial events. Indirect TPK is passed on through the use of language specifically. The use of both direct and indirect embodies, reinforces and defines the values TPK. The observation of nature timings along with stories and beliefs, pass down the knowledge from elders and family members that also contribute to the essence of TPK.\nPhenology\nPhenology observes the timing of seasonality of biological and weather events. Plant cycles, animal behaviour, weather patterns and climate change cycle through seasonality i.e.Flowering. As Swartz defines; \"Phenology is the study of recurring plant, fungi and animal life cycle stages, especially as they relate to climate and weather\".\nSome of these observations can be variant depending on location. For instance, observing temperature and photoperiod can be indicators of seasonal change in parts the Northern Hemisphere and the Southern Hemisphere.\nObserving plant species is an example of TPK. In temperate locations, the change of increased temperatures will signal growth which, in turn will create an environmental response that indicates spring and/or summer. Consequently, plants will flower with enough \"accumulated heat\".\nPhenological processes\nPhenology is describes as a process that revolves around the development of an organism (plants or animals) in relation to the change of the seasons. Moreover, temperature is a factor of these processes that create changes in the cycles. For instance, vegetation or biological beings can change due to temperature increase or decrease and that surpass a threshold which creates change in behaviour or change in seasonality.\nTraditional phenological knowledge and phenology\nHuman observations and knowledge throughout generations is tied to TPK. The human response tied with seasonal change can create a symbiotic relationship with their proximity to the environment, hence Indigenous Peoples have been and still are practicing traditional practices that match timings of the seasonal change and seasonal indicators.\nSynchronicity and natural timing\nTime in most Indigenous communities is based on the pace of nature. Indigenous communities live synchronously with temporal phenological events that present themselves. It is also the interconnectivity between the natural environment and traditional Indigenous practices. The epistemology may differ from group to group, however, the many Indigenous groups share similarities regarding the innate knowledge of seasonal timings and landscape ecological practices.\nThe perception of time is unlike that of the Western world. For instance, the rainy season in some Indigenous communities may signal spring and/ or fall and  the growing season signals spring and summer. Seasonal timings can relate to traditional practices as well. The observations of fish behaviour and migration patterns can indicate time windows in a season where one can fish. Spawning of salmon is also an indication of reproduction and multiplying of the species. Timing is important for availability. Too early fishing can affect spawning which can result in a decrease in numbers of fish. Fishing is also a cultural practice that many Indigenous communities still practise today and with TPK, these communities know there can be variance in time and change of numbers of fish from one year to the next.\nIndigenous and Western application of Traditional Phenological Knowledge\nTPK can be used as a predictive and management tool in both Traditional Indigenous practices and Western practices. Embracing TK and continuous observations of the physical environment creates reliable information for future generations. It pertains to the interconnectivity of animal species, plant species and human behaviour.\nIndigenous applications\nFire management can be timed with phenological events in North-American Indigenous Nations. Burning shrubs in vast areas would help deer find food in the next season. Burning causes more water to be retained in the soil which promotes seedling sprouts in the spring and summer. For Indigenous communities in California, there can be more grass growth which is used for cultural \"deer grass\" weaving. Spring burning also promote species diversity and different cultivation such as Tobacco. Fire can kill fast growing vegetation and pests, and aid full-light vegetation to grow in these areas i.e. Oak and Huckleberries. Hence, Traditional Knowledge and TPK can help with food security, food for wildlife.\nWestern applications\nTPK and TEK are seen as sustainable practices to help fight against climate change and are starting to be recognised as a tool to help mitigate food insecurity and issues regarding biodiversity loss. A term to describe the combination of Indigenous Knowledge and Western Knowledge is known as Two-eyed seeing. For instance, TPK is a tool for fire management that Western communities have adopted to decrease the severity of fires.\nTPK and language\nThe transmission of TPK is passed down through stories which can be in the form of indirect TPK. It is not actually observed by the eye of the learner but rather transmitted through language by family members and community members.\nSustainability and biodiversity\nConservation of the land is engrained in indigenous knowledge. Practises of Indigenous Knowledge can be useful for sustainability and solutions for modern day environmental issues regarding climate change and biodiversity loss. TPK,TEK, TK, IK are ways to look at landscape ecology in a method that also scientists and the general public can learn from. Many practises can aid sustainable practises and fights against climate change.\nClimate change\nTPK can be a tool in understanding climate change. TPK is based on historical observations that can help climate scientists because of records of past and current changes in the environments around the world. TPK can provide knowledge and information that are not easily accessible to the Western Sciences regarding climate change. It can be a tool for decision making, revolving ecology and conservation where gaps of information and data are lacking.\nClimate change affects First Nations and Indigenous communities differently than Western-based communities.The Western world is impacted mostly economically, financially and ecologically, whereas Indigenous communities have certain practices and traditions that are directly tied to the land. The change in climate might affect and threaten their livelihood and their relationship to the land. In other words, these communities might adapt their practices in new ways to fight against climate change. In recent years, communities have noticed changes of rainy periods and dry periods which can change the predictability of timings of traditional practices. Moreover, TPK can change and adapt due to climate change.\nThe dynamics of climate change in the Western world are linked to the growth of capital. This tends to lead to exploitation of natural resources, therefore leading to increased greenhouse gases in the atmosphere, degradation of the environment, affecting fresh water systems and soil health, etc.\nChanges in climate also change indicators of seasonality. TPK can play a role in the study of climate change and sustainability.\nClimate change impacts on Alaskan TPK\nIn most parts of the world, especially in higher elevations and northern latitudes such as Alaska, Alaskan communities have observed changes in phenological cycles. Locations such as Alaska are severely impacted due to their northern locations and closeness to shore which intensifies the changes in climate.\nThe Yukon-Kuskokwim Delta Indigenous communities have observed changes in berry resources. These communities have noticed a decrease in snowpack in recent winters. Hotter summers and thawing of permafrost also create an unsteady landscape which affects negatively the vegetation in this region, for instance, wild berries. Berries are essential for human consumption and food for wildlife. For Alaskan communities, berry picking provides nutrition, but also indicators of seasonality change. These communities have seen changes in the last ten years; variability in berry abundance from year to year and earlier ripening. This is seen in cloud berries, blueberries and crowberries.\nBarriers and challenges\nSome of the barriers of TPK would be that some institutions do not recognise TPK as a scientific way of practice due to Western ways of teaching. This is can be due to priority of importance of the institutions and education systems already put in place.\nTPK around the world\nIndia\nTripura\nIndigenous communities in the North-East of India such as Tripura can use TPK to predict weather patterns which aid with activities of agroforestry, farming and agriculture. Additionally it is used for prevention of natural disasters. Through folklore and myths, Traditional Knowledge is shared in these means. These lores and myths about weather can be found in ancient scriptures such as Vedang Jyotish of Maharshi Laugakshi, Seval Samhita and Gura Samhita among others.\nTPK can be found under two categories; theories of prediction and observations. The use of astronomy and observation of planetary positions such as conjunctions are important for Tripura Indigenous communities. Atmospheric observations play a big part of weather conditions such as looking at clouds. Behavioural patterns of plants and animals are also indicators of predicting weather.\nThe night-flowering jasmine (Nyctanthes arbor-tristis L.) helps predict abundant rainfall. The night-flowering jasmine flowers year round, therefore, depending on the time of the year it flowers, different amount of rain is predicted. June and July are the months containing the highest amount of rainfall and accurately predicted by traditional farmers in the region which is confirmed by the Meteorological Department of Narsinghgarh Bimangarh India. The Indian Laburnum (Cassia fistula L.) also known as Golden Shower predicts rain. When the Indian Laburnum flows it predicts the beginning of the Monsoon.\nUganda\nIn the Teso Sub-region in Eastern Uganda, the Iteso people of Teso practice TPK in terms of agriculture and pasture. This region has a hot and humid climate. There is a strong agricultural practice in the region of Teso. The main crops cultivated are cereal such as millet, corn, cassava and cotton. The main animals for livestock are pigs, cattle, chickens amongst other animals. Due to the region's geographical location, there are several lakes which permit the community to practise fishing. TPK helps for drought and flood predictions, infestations, water conservation and timings for fishing and plays a role in the prediction of rainfall.\nThe use of TPK has changed in the recent decades because of climate unpredictability, however, the Iteso people have adapted TPK to recent climatic events. Previously, traditional communities of this region used to sow millet seeds according to leaf fall and growth because it would predict the time frame to seed grain to be on time for future rainfall. Now, however, this predictability now varies. Astronomical observations such as the location of the moon and its color are used to determine when is the next onset of rainfall and rain intensity. TPK  is in the hands of elders whose phenological observations are monitored, but there is concern for the younger generations to lose Traditional Knowledge of phenological events. Elders notice longer of droughts, increase winds and species disappearance, and a halt of fish migrations to previously plentiful rivers due to climate change which is affecting phenological cycles at a quicker and greater rate.&nbsp;\nMongolia\nTraditional herders of the land-locked country of Mongolia use TPK and TEK for herding animals, determining height of grasses in the next seasons and their understanding of the ever-changing land. Observations of seasons are present in story telling and observations made through their nomadic way of life.\nHerders have a distinct way of understanding plants of the landscape. Mongolia has a mix of extreme climates which temperatures could reach 40 degrees Celsius in warmer months, to below 30 degrees in colder months. Mongolia is also desertic, mountainous, contains grasslands. It is a considerably dry climate. Traditional herders use TPK to determine rainfall, time of movement and timing of vegetation growth and blooms of medicinal plants. Herder's traditional movement is in accordance with seasonality where observations are made on the relationship and behaviour of vegetation and animals. These observations and knowledge can vary from herder to herder. For instance, in more desertic parts of Mongolia, prediction of grass growth can be described as the same height as the snow in the winter and grass grows to the extent of the amount of rain the area receives. Additionally, numbers are associated with certain areas based on characteristics of viability, zones of ecology, soil health and topology. Furthermore, knowing when a plant will bloom comes from repeated observations and counting the joints of vegetation and relative humidity in the atmosphere i.e. Bagluur or Anabasis Brevifolia.\nSome herders intertwine human existence with phenology. The seasons change and also humans change regarding the seasons. Humans are also an important part in phenology. In the light of climate change,&nbsp; the earth gets older and changes, so do humans.\nProtecting Intellectual Rights\nWith the information provided by Indigenous Peoples, TPK is based on knowledge and intellectual property. Intellectual property ought to be respected, acknowledged, protected and accredited.\nReferences"
    }
  ]
}