{
  "content": [
    {
      "type": "text",
      "text": "# Trade unions in the United Kingdom\n\n|union_percentage1_title = Percentage of workforce unionised\n|union_percentage1 = 22% (2024)\n|union_percentage2_title =\n|union_percentage2 =\n|ILOmember = Yes\n|ILO-87date = 27 June 1949\n|ILO-98date = 30 June 1950\n}}\nUnison, the largest trade union in the United Kingdom]]\nTrade unions in the United Kingdom  emerged in the early 19th century, but faced punitive laws that sharply limited their activities. They began political activity in the late 19th century and formed an alliance with the Liberal Party in the early 20th century. They grew rapidly from 1900 to 1920, lost their legal disabilities, and were well established by the 1920s.  Union members largely switched from Liberal to the new Labour Party. Its leader Ramsay MacDonald became prime minister in 1924 briefly, and then again in 1929. In the 1980s  Margaret Thatcher's Conservative governments weakened the powers of the unions by making it more difficult to strike legally. Most British unions are members of the TUC, the Trades Union Congress (founded in 1867), or where appropriate, the Scottish Trades Union Congress or the Irish Congress of Trade Unions, which are the country's principal national trade union centres.\nHistory\nTrade unions in the United Kingdom were first decriminalised under the recommendation of a Royal commission in 1867, which agreed that the establishment of the organisations was to the advantage of both employers and employees. Legalised in 1871, the Trade Union Movement sought to reform socio-economic conditions for working men in British industries, and the trade unions' search for this led to the creation of a Labour Representation Committee which effectively formed the basis for today's Labour Party, which still has extensive links with the Trade Union Movement in Britain.\nAs factories closed, membership declined steeply in the 1980s and 1990s, falling from 13 million in 1979 to around 7.3 million in 2000. In September 2012 union membership dropped below 6 million for the first time since the 1940s. Union membership has since begun rising gradually again, reaching 6.44 million in 2019.\nLaw\nMuch like corporations,  trade unions were regarded as criminal until the Combination Act 1825, and were regarded as quasi-legal organisations, subjected to the restraint of trade doctrine, until the Trade Union Act 1871. This Act abolished common-law restrictions, but took an abstentionist stance to unions' internal affairs. The Trade Disputes Act 1906 exempted trade-union funds from liability in action for damages for torts, and this freedom gave future union pickets a great deal of power.\nDemocratic organisation\nThe principle that the common law enforced a union's own rules, and that unions were free to arrange their affairs, is reflected in the ILO Freedom of Association Convention and in Article 11 of the European Convention on Human Rights, subject to the requirement that regulations \"necessary in a democratic society\" may be imposed. Unions must have an executive body and that executive must, under the Trade Union and Labour Relations (Consolidation) Act 1992 sections 46 to 56, be elected at least every five years, directly in a secret, equal postal vote of union members.\nUnion constitutions\nThe structure of the unions was based in contract, and the rights of members depended on being able to show some proprietary interest to be specifically enforced. This meant that the express terms of the union rule book can, like any contract, be supplemented with implied terms by the courts as strictly necessary to reflect the reasonable expectations of the parties, for instance, by implying the Electoral Reform Service's guidance to say what happens in a tie break situation during an election when the union rules are silent. If there are irregular occurrences in the affairs of the union, for instance if negligence or mismanagement is not alleged and a majority could vote on the issue to forgive them, then members have no individual rights to contest executive decision making. However, if a union's leadership acts ultra vires, beyond its powers set out in the union constitution, if the alleged wrongdoers are in control, if a special supra-majority procedure is flouted, or a member's personal right is broken, the members may bring a derivative claim in court to sue or restrain the executive members. So in Edwards v Halliwell a decision of the executive committee of the National Union of Vehicle Builders to increase membership fees, which were set in the constitution and required a two-thirds majority vote, was able to be restrained by a claim from individual members because this touched both a personal right under the constitution and flouted a special procedure.\nDiscipline and expulsion\n* ASLEF v United Kingdom [2007] ECHR 184\n* McVitae v UNISON [1996] IRLR 33\n* Roebuck v NUM (Yorkshire Area) No 2 [1978] ICR 676, Templeman J\n* Esterman v NALGO [1974] ICR 625, Templeman J\n* Radford v NATSOPA [1972] ICR 484, Plowman J\nDispute resolution\n* Hamlet v GMBATU [1987] ICR 150, Harman J\n* Longley v NUJ [1987] IRLR 109\nUnion members' rights\n* Trade Union and Labour Relations (Consolidation) Act 1992 ss 28–31, true and fair view of accounts, member's right to inspect, and complaints to Certification Officer.\n* Trade Union and Labour Relations (Consolidation) Act 1992 ss 62–65, right to require a ballot before industrial action, and no detriment may follow\n* Knowles v Fire Brigades Union [1997] ICR 595\n* Edwards v Society of Graphical and Allied Trades [1971] Ch 354\n* Cheall v APEX [1983] 2 AC 180\n* Trade Union and Labour Relations (Consolidation) Act 1992 s 174\n* ASLEF v United Kingdom [2007] ECHR 184\n* Amalgamated Society of Railway Servants v Osborne [1910] AC 87, political donations\n* Trade Union Act 1913\n* Birch v National Union of Railwaymen [1950] Ch 602\n* Trade Union and Labour Relations (Consolidation) Act 1992 s 72–73 and 82\n* Paul v NALGO [1987] IRLR 413\n* Weaver v NATFHE [1988] ICR 599 EAT\nSubscriptions\nMembers' subscriptions are often paid by DOCAS (Deduction of Contributions at Source) i.e. deduction from salary. Implementation of the draft Trade Union (Deduction of Union Subscriptions from Wages in the Public Sector) Regulations 2017 has been delayed until 2019.\nUnion organisation\n, headed by Wanja Lundby-Wedin until May 2011, is the union federation for 37 European countries, the counterpart for the TUC of the UK and the ITUC internationally.]] Margaret Thatcher's Conservative government, first elected in 1979, saw trade unions as an obstacle to economic growth and passed legislation of the sort the Conservatives had mostly long avoided.\nMembership declined steeply in the 1980s and 1990s, falling from 13 million in 1979 to around 7.3 million in 2000. In 2012, union membership dropped below 6 million for the first time since the 1940s. From 1980 to 1998, the proportion of employees who were union members fell from 52 per cent to 30 per cent.\nUnion membership declined in parallel with the reduction in size of many traditional industries which had been highly unionised, such as steel, coal, printing, and the docks.\nIn 2016, the Conservative government passed a new Trade Union Act, which proposes stricter ballot thresholds for industrial action, further restraints on picketing and a requirement that union members contributions to political funds would only be via an ‘opt-in’.\nInternational affiliations\n* European Trade Union Confederation\n* International Trade Union Confederation\nSee also\n* Conspiracy and Protection of Property Act 1875\n* Criminal Law Amendment Act 1871\n* Employers and Workmen Act 1875\n* GCHQ trade union ban\n* History of the socialist movement in the United Kingdom\n* History of trade unions in the United Kingdom\n* Labour Party (UK) affiliated trade union\n* List of trade unions in the United Kingdom\n* Strikes (Minimum Service Levels) Act 2023\n* Student unionism in the United Kingdom\n* Trade Union and Labour Party Liaison Organisation\n* Trade Union Freedom Bill\n* Trade Unionist and Socialist Coalition\n* Trades Union Certification Officer\n* Union Modernisation Fund\n* United Voices of the World\nNotes\nFurther reading\n* Aldcroft, D. H. and Oliver, M. J., eds. Trade Unions and the Economy, 1870–2000. (2000).\n* Blanchflower, David G., Alex Bryson, and Colin Green. \"Trade unions and the well‐being of workers.\" British Journal of Industrial Relations 60.2 (2022): 255-277. [https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/bjir.12627 online]\n* Charlesworth, Andrew, Gilbert, David, Randall, Adrian, Southall, Humphrey and Wrigley, Chris. An Atlas of Industrial Protest in Britain, 1750–1990 (1996).\n* Davies,  A. J.  To Build a New Jerusalem: Labour Movement from the 1890s to the 1990s  (1996).\n* Hunt, Tom, and Heather Connolly. \"Covid‐19 and the work of trade unions: Adaptation, transition and renewal.\" Industrial Relations Journal 54.2 (2023): 150-166. [https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/irj.12395 online]\n* Laybourn, Keith. A history of British trade unionism c. 1770–1990 (1992).\n* Marsh, Arthur Ivor. Trade union handbook : a guide and directory to the structure, membership, policy, and personnel of the British trade unions (1980) [https://archive.org/details/tradeunionhandbo0000mars_x1a7 online]\n* Minkin,  Lewis. The Contentious Alliance: Trade Unions and the Labour Party (1991)\n* Pelling, Henry. A history of British trade unionism (1987).\n* Undy, Roger, et al. Change in Trade Unions: the Development of UK Unions since the 1960s (Routledge, 2022).\n* Wrigley, Chris, ed. British Trade Unions, 1945–1995 (Manchester UP, 1997) [https://archive.org/details/britishtradeunio0000wrig online]\n* Wrigley, Chris. \"Work, the labour market and trade unions.\" in 20th Century Britain (Routledge, 2022). 98-112. [https://www.taylorfrancis.com/chapters/edit/10.4324/9781003037118-8/work-labour-market-trade-unions-chris-wrigley online]\nExternal links\n*\n*[https://www.tuc.org.uk/britains-unions Britain's unions]. Trades Union Congress (TUC)\n**[https://www.tuc.org.uk/joinunion Find a union for you]"
    }
  ]
}