{
  "content": [
    {
      "type": "text",
      "text": "# Traditional society\n\nIn sociology, traditional society refers to a society characterized by an orientation to the past, not the future, with a predominant role for custom and habit. Such societies are marked by a lack of distinction between family and business, with the division of labor influenced primarily by age, gender, and status.\nTraditional and modern\nTraditional society has often been contrasted with modern industrial society, with figures like Durkheim and Pierre Bourdieu stressing such polarities as community vs. society or mechanical vs. organic solidarity; while Claude Lévi-Strauss saw traditional societies as 'cold' societies in that they refused to allow the historical process to define their social sense of legitimacy.\nWithin modernisation theory, traditional society is also the first stage of economic development as established in W.W. Rostow's Economic Growth Model. Classified as \"pre-newtonian,\" science and technology are not practiced. Life is agrarian, and family or clan relationships are the basis for social structures.\nHowever, theories positing the simple, unilineal evolution of societies from traditional to modern industrial are now seen as too simplistic, relying on an ideal typology revolving round such polarities as subsistence/growth; face-to-face/impersonal; informal social control/formal social control; or collective ownership/private ownership. Recent work has emphasised instead the variety of traditional cultures, and the existence of intermediate forms as well as of 'alternative' modernisations.\nRitual\nTraditional societies have been seen as characterised by powerful collective memories sanctioned by ritual, and with social guardians ensuring continuity of communal practices. Practice theory, however, has recently emphasised the role of ritual in facilitating change, as well as continuity.\nDiversity\nFredric Jameson saw 20th-century modernisation as encountering two main kinds of traditional society, tribal, as in Africa, and bureaucratic imperial, as in China and India, but a much wider diversity of traditional societies has existed over time.\nFor most of human existence, small tribes of hunter-gatherers leading an almost static existence formed the only social organisation: where they survived into the 20th century, as in Australia, paintings, songs, myths and rituals were all used to cement links to a deep-reaching sense of continuity with ancestors and ancestral ways.\nThe invention of farming some 10,000 years ago led to the development of agrarian societies, whether nomadic or peasant, the latter in particular almost always dominated by a strong sense of traditionalism. Within agrarian society, however, a wide diversity still existed. Homeric Greece  was a society marked by powerful kinship bonds, fixed status and rigidly defined social expectations; with the classical polis, however, though festivals, in M. I. Finley's words, still \"recreated for their audiences the unbroken web of all life, stretching back over generations of men to the gods\", new and more complex voluntary forms of social and public life balanced traditional society in a new equilibrium.\nMedieval Europe was an intensely local society of self-perpetuating peasant households, living within a slow moving culture dominated by customary law and by respect for ancient authority and pervaded with an ahistorical political mentality focused upon the concepts of experience, usage, and law-as-custom.\nEnlightenment and post-traditionalism\nMuch of the focus of Enlightenment thinking was directed at undoing the mindset of traditional society, and replacing a focus upon such concepts as rural, hierarchical, customary or status with one centred on the ideas of urban, egalitarian, progressive or contractual. Modernism and modernity continued the process of challenging and overcoming traditional society.\nJameson, however, has seen as a defining feature of postmodernism the global elimination of residual, 'traditional' enclaves, giving it its one-dimensional, temporal nature that is no longer offset by living examples of the past alongside the new.\nInternet\nGlobal media such as the Internet have been seen as effective means of recreating traditional cultures. However, a key contrast now with traditional societies as they were is that participation has become voluntary instead of being ascriptive: fixed in space, social stratification and role expectations.\nSee also\n*Aition\n*Folklore\n*Gemeinschaft and Gesellschaft\n*Modernization theory\n*Pre-industrial society\nReferences\nBibliography\n*Lai Chen and Edmund Ryden, Tradition and Modernity, 2009.\n*Jared Diamond, The World until Yesterday: What Can We Learn from Traditional Societies?, Penguin Books, 2012 ().\n*Edward Shils, Tradition, 2006.\n*O. Lewis, Tepoztlán - Village in Mexico, 1960.\n*Julius SSENGENDO Ntege, \"My Journal\", 2018\nExternal links\n*[http://www.encyclopedia.com/topic/traditional_society.aspx Traditional society]"
    }
  ]
}