{
  "content": [
    {
      "type": "text",
      "text": "# Traditional architecture\n\n| alt          =\n| caption      = Top: Old Town of Lijiang, China, China; Center left: Street in Cusco, Peru; Center right: Patwa Haveli in Jaisalmer, India; Bottom:  Al-Balad, Jeddah, Saudi Arabia\n| yearsactive  = 9000 BC–present\n| country      = International\n}}\nTraditional architecture is the built expression of a cultural heritage transmitted across generations, it is not a singular architectural style, since it is neither defined stylistically nor by time period, but rather by its geographical or cultural context. The term traditional does not necessarily mean that building forms are static, as new techniques and approaches are continuously adopted and adapted by local craftspeople.\nDistinctively from vernacular architecture, it does not exclude architect-designed or monumental buildings, but instead encompasses a wide range of structures and building types, including the vernacular.\nBroadly speaking, all architectural styles can be split into two groups: traditional and modernist (which includes modernism ideological successors), this is because modernist architecture was created as the explicit opposition to the continuation of tradition and local character.\nPhilosophy\nLeon Krier argues that as a body of technical knowledge, traditional architecture and urbanism is a method of habitation in a way that is ethical, beautiful, and ecological. Eventually, their forms and materials, as well as their quantity, position, size and scale, will be defined by geography, climate and ecology.\nAccording to Jiri Lev, traditional architecture's practicality and economy, in the natural, evolutionary meaning of the word means obtaining best outcomes with minimum possible outlay of energy and resources. Like in nature, this fine-tuned balance usually also leads to aesthetically pleasing results.\nIn context of sustainability, Steve Mouzon talks of historical and new buildings designed using the lessons of the past as the \"living tradition\" - a collective intelligence underpinning naturally sustainable buildings and places.\nIncorporating regional materials, techniques, craftsmanship and skills into the built environment leads to lasting cultural narratives, maintaining architectural diversity and richness.\nRevival and continuity\nin Japan]]\nSchools teaching contemporary traditional architecture include Notre Dame School of Architecture,  Utah Valley University School of Architecture and American College of the Building Arts, with growing interest and institutions world wide.\nVarious groups, organisations and awards exist that promote traditional principles in architecture and urbanism, such as Traditional Architecture Group (UK), Institute of Classical Architecture & Art (US), The Urban Guild (US), Architectural Uprising (Sweden) or INTBAU (international).\nIn the United States structural masonry is experiencing revival in contemporary traditional architecture.\nIn India buildings with courtyards and balconies are made from handmade clay tiles and stone masonry for resilience and natural cooling.\nIn Australia simple, traditional homes are built using local materials and low-tech construction methods, addressing high labour costs and housing affordability crisis.\nIn Japan buddhist temples have been continuously rebuilt, expanded and updated with contemporary technologies while maintaining their traditional architectural character for many centuries.\nExamples of government policy formed on contemporary traditional architectural principles include Saudi Arabia's design guidelines on its distinctive architectural styles, or European city councils increasingly attentive to traditional architectural principles, as in Norway's Bergen, Oppdal and Grünerløkka, or broader movements such as European Urban Renaissance.\nReferences"
    }
  ]
}