{
  "content": [
    {
      "type": "text",
      "text": "# Traditional candies in Hong Kong__disambig_1\n\nPutting traditional candies into a Chinese candy box is a custom of Hong Kong people at Chinese New Year. In fact, there is a hidden meaning in this practice. It is said that people believe sweet candies symbolize an appealing and delightful start to the new year.\nApart from tradition, traditional candies received a top rating in Hong Kong because of the historical background. Light industries were the most common business in the city from the 1950s to the 1980s. Therefore, an array of traditional candies, like different flavours and packaging, were produced to attract the children.\nHowever, the social atmosphere today has put more emphasis on health protection, and candies are dubbed as food with high energy value solely, which is considered unhealthy. In addition to that, due to the increase of import of foreign sweets, the significance of Hong Kong traditional ones has come down. Though, it may be less popular now, it remains a special part of Hong Kong culture.\nTypical brands of candy\nThe tricky candies\n\"Glasses candy\" () and \"diamond ring candy\" () are interesting to many of the Hong Kong people because of their appearance. Glasses candy has its package imitating a real pair of glasses and allows the children to wear it by using a rubber band to link two ends together. The diamond ring candy (similar to the western Ring Pop) imitates a precious gem by putting the candy on a plastic ring. Usually, people will wear it on their hands while eating. There was also a humorous, but romantic folk story saying that little boys used to express their love with this candy to their dream girl.\nThe reason why the two candies prevailed was because they were very affordable. The society in the old times was not as prosperous as the modern era. Not to mention a diamond ring, even a pair of glasses was a large expenditure to people. Therefore, the tricky candies were in fact some invaluable food commodities to Hong Kong people.\nThe \"Singing\" Candies\n‘Ding Ding Candy’() is also known as ‘Deuk Deuk Tong’() or ‘Ding Ding Tong’ in Cantonese, and it is another traditional candy of Hong Kong. It consists of a hard maltose candy mainly composed of malt and sugar. Other ingredients include corn syrup and water, sometimes sesame. This candy has at least 60 years of history in Hong Kong, and it is still a popular candy. It was named ‘Ding Ding Candy’ because of its traditional production process. The word 'Ding’ is a sounded syllable in Cantonese imitating the noise made by the hawker who used a hammer and cutter to slice a huge chunk into pieces. It represents the process of chiselling the candy. When the hawker makes the candy, the sound ‘Ding Ding Ding Ding' is produced.\nCoconut Candies\nCoconut candy () is a quintessential item found in the platter presented to guests during Chinese New Year in Hong Kong, and it is considered an especially auspicious item to have throughout the year.  Coconut () is synonymous with grandfather () and son (), which implies peace and harmony throughout generations.  Also,‘candy’() symbolizes a warm and sweet family life.\nYan Chim Kee ()\nYan Chim Kee (甄沾記) is a well-known confectionery and foodstuffs manufacturer in Hong Kong with a history that dates back at least a century.  Established in Guangzhou by Yan Lung Lap (甄倫立)  in 1915,  its coconut candy is an acknowledged traditional classic.  The packaging of Yan Chim Kee Coconut Candy was eyecatching shades of red, green and yellow with a distinctive logo.  It is available in multiple flavors and textures to suit local preferences.  The firm insists upon strict quality control and maintain that their products do not contain preservatives or artificial colouring.  The only ingredients permitted were fresh coconut milk, liquid glucose and sugar. Typical price for the candy was 5 cents back in the 1900s -  this was in fact quite a sum in the old days.  The firm was considered a pillar in the local food manufacturing scene during the 1950s to the 1970s - older Hong Kong residents have fond memories of their coconut-based candies, juices and ice cream products.\nThe company ran into financial difficulties in the 1990s due to various disputes between the founder's descendants, and an ill-timed move to Mainland Chinese production.  Its stakeholders were declared bankrupt in 1999 and production ceased in 2006.  The firm was revived in 2013, and its products are now showcased in luxury retailers and the annual HKTDC Food fairs.\nSignificance\nTraditional candies are not only consumed as a treat. It also serves as an important symbol in special occasions, especially in one of the most important festivals in the Chinese calendar which is the Chinese New Year. This festival is mostly celebrated amongst the Chinese population and traditional candies are a big part of it.\nIt is established that families visit one another during the Chinese New Year, so when visits are made, visitors are normally offered candy in a red box often called a \"Tray of Togetherness\" or quanhe (). Different traditional candies such as \"sugar painting\", \"candy doll\", \"ding ding candy\" and \"dragons beard candy\" all convey symbolic meanings from wishing for increased fertility to stronger family ties . It can also mean money and sweetness of life, which is why many chocolates presented in the festival are wrapped and packaged in the shape of a gold coin. Being given candy in the Chinese New Year is seen as a blessing and a sign of luck for the rest of the year.\nHong Kong traditional candies is one of the collective memories because they are the shared experience for many Hong Kong people which cannot be replaced by the new types of candy. Hong Kong people not only remembers the taste of these candies, but also the happy moments that they shared with their friends and family. These experiences are commonly shared between the Hong Kong people who were born and raised in generations before and is easily triggered when they see these candies again.\nSee also\n*Ring Pop\nReferences"
    }
  ]
}