{
  "content": [
    {
      "type": "text",
      "text": "# Traditional rice of Sri Lanka__disambig_1\n\nRice in Sri Lanka has played an important role in the country's functioning and survival for centuries as a major staple food.  Rice continues to be a staple of traditional Sri Lankan cuisine today.\nHistory\nEarly history\nSri Lankan people may have started cultivating rice as early as 800 B.C., according to documentary evidence.  Further evidence of early rice cultivation is the construction, since 390 B.C., of massive irrigation structures, reservoirs, and interconnected canals. From ancient times, rice cultivation was not only an economic activity, but a way of life for the people of Sri Lanka. Some varieties of rice have been passed down for generations, and are called traditional, indigenous, or heirloom.\nOnce renowned as the granary of the east, Sri Lanka offered more than 2000 indigenous rice varieties to the rest of the world. Rice cultivation in Sri Lanka was once considered sacred. The process remained sustainable due to the methods used for production, as well as the sanctity associated with the process of rice cultivation.\nRise of the new rices\nBy the 1980s, 90% of the farmland in Sri Lanka was being used to cultivate the \"semi-dwarf\" (newly improved) rice variety.\nCurrently, 95% of the rice produced in Sri Lanka are hybrid varieties.  These are harvested using non-organic fertilizer and pesticides which are needed to produce larger harvests with lower costs.\nHowever, traditional rice is gradually making a comeback.  This is due to increased global demand for organic food.\nTraditional rices\nSuwandel\nAs the translated name implies, this is a fragrant white rice with an exquisite aroma.\nIts milky taste makes Suwandel a common choice for festive occasions and ceremonies. Nutritionally, the rice consists of 90% carbohydrates, 7% crude protein, 0.7% crude fat, and 0.1% crude fiber. Suwandel is known to contain higher amounts of glutamic acid and vitamins than other, more common rice varieties.\nSuwandel is an heirloom rice variety, cultivated organically with traditional rain-fed methods in the southern lowlands of Sri Lanka. Because of this, cultivation takes longer than other varieties of rice.  It is usually 3 months before harvest.  Heirloom rice cultivation in Sri Lanka is a sacred process.\nKalu Heenati\nKalu Heenati is literally translated as \"dark, fine grain.\" It is a highly nutritious red rice that is considered to be good for daily consumption. It contains a lot of medicinal properties. It is very good for lactating mothers. It enhances sexual potential and physical strength.\nMaa-Wee\nThis is a reddish-brown rice variety with a unique texture.  It is low in carbohydrates, and rich in protein and fiber. Ma-Wee is also proven to have a 25% to 30% lower glycemic index (GI) than other common rice varieties. It is 84.5% carbohydrates, 9.4% protein, 3.6% fat, and 1.1% fiber.\nMa-Wee rice is best when soaked prior to boiling. One traditional dish calls for the rice to be cooked with chopped spring onion and leeks, and served with bottle gourd sautéed in spices and coconut milk.\nMa-Wee was loved by the queens of Sri Lanka, who believed it helped them maintain a trim, shapely figure.\nMa-Wee is also revered for its historical importance in religious ceremonies. According to folklore, Ma-Wee has been placed in the caskets of sacred relics and the pinnacle (kotha) of dagabas.\nPachchaperumal\nThe word \"Pachchaperumal\" means \"The Lord Buddha’s color.\"  It is a wholesome red rice variety. When cooked, it takes on a deep, rich burgundy color. It is rich in nutrients and proteins, and is considered an excellent choice for an every day meal.  It is also said to be part of a good diet for people with diabetes and cardiovascular disease.\nPachchaperumal has long been considered a divine rice in traditional Sinhalese culture. Traditionally, it was often used in alms-giving.\nKuruluthuda\nA nutritious red rice variety rich in proteins and fiber, kuruluthuda has a unique, pleasant taste.\nWater Lilly Rice\nThis is also known as Olu Sahal. Olu rice is one of the staple foods of the Hela diet.\nOthers\nOther varieties include Rathdel, Madathawalu, and Hetadha Wee.\nFuture\nRice has a sacred association among Buddhist, Hindu, and Muslim populations alike. It is said that rice cooked with coconut milk was the first offering made to Buddha, and to this day the dish is a staple of Sri Lankan Buddhist culture during sacred festivals and important events.\nReferences"
    }
  ]
}