{
  "content": [
    {
      "type": "text",
      "text": "# Traditional games in the Philippines__disambig_1\n\nTraditional Filipino games or Indigenous games in the Philippines () are a diverse set of games passed down through generations, often utilizing native materials and instruments. Historically, Filipino children—faced with limited access to manufactured toys—devised games that required little more  than the participation of players. These games vary widely in form and mechanics, and are well-suited for children. Beyond recreation, they contribute meaningfully to the physical and cognitive development of young Filipinos and are recognized as an integral aspect of the nation’s cultural heritage.\nThe term Laro ng Lahi was coined and popularized by Samahang Makasining (commonly known as \"Makasining\"), in collaboration with the National Commission for Culture and the Arts, local government units, and other supporting institutions. A core initiative of the organization involves transmitting knowledge of these traditional games to younger generations. The group also developed a time-based scoring system for several popular games, including patintero, syatong, dama, lusalos and holen butas.\nTraditional Philippine games, such as luksong baka, patintero, piko, and tumbang preso are played primarily as children's games. The yo-yo, a popular toy in the Philippines, was introduced in its modern form by Pedro Flores with its name coming from the Ilocano language.\nAdvocates\nDickie Aguado, executive director of Philippine NGO Magna Kultura Foundation (Arts and Culture), says that traditional Filipino games are \"very much alive in the Philippines\". In many urban and rural areas, a majority of Filipino children play outdoor street games, as most of them have little access to technology. Games such as patintero, tumbang preso, piko, sipa, turumpo, and many others, are played daily. One of the main reasons why some children stop playing Filipino games is because Western sports (e.g. basketball or volleyball) are featured in local barangays and in schools. With a lack of organized sports activities for Filipino street games, Filipino children may adapt to modernity by abandoning their childhood games.\nGames\nTraditional Filipino games are usually played by children of younger age outdoors together with their neighbor and friends. The games have no definite rules nor any strict regulations. Different communities and regions have varying versions of the games that are agreed upon between themselves. Most games and matches have two-team gameplay in which players can divide themselves into a reasonably certain number, usually predetermined by two separate team leaders first playing Jack 'n' poy then selecting a teammate after each match. Another common variation of creating two teams is by 'win-lose' in which each player will pick another person to play Jack 'n' poy with and then grouping the winners and losers. Filipino games number more than thirty-eight. A non-exhaustive list includes:\nBanana Split\nA two-player game where players play rock-paper-scissors but whenever a player loses, the space between their feet gets larger until they can't anymore. The game's name is a pun because of the losing player doing a split.\nDeclan ruki\nDeclan ruki (lit. I declare, do it!): Participants are told to do something by the winner of the previous games, similar to the Western game Simon Says.\nSpider Fighting (Gagamba)\nSpider fighting (Gagamba), ) is a traditional Filipino game that involves captured spiders, often referred to locally as \"kaka\", that are typically kept in empty matchboxes. The game is a form of recreational combat or gambling, where two spiders are placed on a stick or branch and encouraged to fight. The match continues until one spider falls off or retreats. Spider fighting is commonly practiced by children and enthusiasts, particularly in rural areas, and is considered part of Filipino folk culture.\nHand clapping games\nA hand-clapping game generally involves four people. They are split into pairs with each pair facing each other. Members from both pairs face the center (the two pairs are perpendicular to each other). Each pair then does a hand clapping \"routine\" while singing \"Bahay Kubo\" or \"Leron-leron Sinta\". In the middle of the song, each pair exchanges \"routines\" with the other.\nThe lyrics to Bahay Kubo are:\nBahay Kubo, kahit munti\nAng halaman doon ay sari-sari\nSingkamas at talong\nSigarilyas at mani\nSitaw, bataw, patani\nKundol, patola\nUpo't kalabasa\nAt saka meron pa, labanos, mustasa\nSibuyas, kamatis\nBawang at luya\nSa paligid-ligid ay puno ng linga\nLeron-leron Sinta\nLeron-leron sinta\nBuko ng papaya\nDala-dala'y buslo\nSisidlan ng bunga\nPagdating sa dulo'y\nNabali ang sanga\nKapos kapalaran\nHumanap ng iba\nVariations:\nGumising ka, neneng\nTayo'y manampalok\nDalhin mo ang buslong\nsidlan ng hinog\nPagdating sa dulo'y\nLalamba-lambayog\nKumapit ka, neneng\nBaka ka mahulog\nLeron, leron sinta\nBuko ng papaya\nDala-dala'y buslo\nSisidlan ng sinta\nPagdating sa dulo'y\nNabali ang sanga\nKapos kapalaran\nHumanap ng iba\nAko'y ibigin mo\nLalaking matapang\nAng baril ko'y pito\nAng sundang ko'y siyam\nAng lalakarin ko'y\nParte ng dinulang\nIsang pinggang pansit\nAng aking kalaban\nLeron, leron sinta\nBuko ng papaya\nDala-dala'y buslo\nSisidlan ng sinta\nPagdating sa dulo'y\nNabali ang sanga\nKapos kapalaran\nHumanap ng iba\nA variation on the game is an incorporated action according to the lyrics. An example is \"Si Nena\", a song about a girl named Nena, starting when she was born. The song progresses with her life story, (i.e. when she grew up, got married, got children, got old, died, and became a ghost). After she died, one player would act like a ghost and catch the other players.\nLyrics:\nSi Nena ay bata pa, kaya ang sabi nya ay um um um ah ah (players perform a baby action)\nSi Nena ay dalaga na, kaya ang sabi nya ay um um um ah ah (players perform a lady action)\nSi Nena ay nanay na, kaya ang sabi nya ay um um um ah ah (players perform a mother action)\nSi Nena ay namatay na, kaya ang sabi nya ay um um um ah ah (players perform a dead action)\nSi Nena ay mumu na, kaya ang sabi nya ay um um um ah ah (players perform a ghost action)\nNanay tatay\nAnother version of the song is:\nNanay, Tatay, gusto ko tinapay\nAte, Kuya, gusto ko kape,\nLahat ng gusto ko ay susundin niyo.\nAng magkamali ay pipingutin ko... (clap 5x)\n...and so forth\n(lit. game of rings) is noticeably Spanish in influence, deriving from medieval running at the ring. It involves riding a horse while holding a dagger and \"catching\" rings hanging from a tree or some other structure using the dagger. In recent years, a bicycle typically replaces the horse.\nJakempoy\nJakempoy, Jak en poy, Dyak en poy, Dyakempoy from the words Jack 'n' Poy is the local version of rock-paper-scissors (bato, papel, at gunting). Though the origin of the spelling came from American influence, the game is really Japanese in origin (janken) with the lyrics in the Japanese version sounding akin to \"hong butt\".\nThe lyrics:\nJakempoy, hale-hale-hoy! (Jack and Poy, hale-hale-hoy!)Sinong matalo s'yang unggoy! (Whoever loses is the monkey!)\nJuego de prenda\nJuego de prenda (lit. game of looking for the missing bird): Any number of players can play. Players sit in a circle with the leader in the middle. Each player adopts a tree or flower that is given by the leader. The leader recounts the story of a lost bird that was owned by a king. He or she says, The bird of the king was lost yesterday. Did you find it, ylang-ylang? The player who adopted the ylang-ylang tree at once answers that he or she has not found it, so the leader continues to ask the other trees whether the bird has hidden in them. If a player cannot answer after the third count, he or she is made to deposit an object he or she owns to the leader until the leader has been able to gather multiple possessions from the players.\nPiko\nPiko is the Philippine variation of the game hopscotch.It is traditionally played by children, often outdoors, using a diagram of boxes drawn on the ground, commonly in the shape of a cross or a stylized human figure.\nPlayers begin by standing behind the baseline and taking turns throwing a pamato (a cue marker, often a flat stone or tile) onto a designated box. The first to play is typically determined by an informal contest, such as who can throw their marker closest to a specific target like the “moon,” “wings,”, “chest” or \"I\" markings on the diagram. The game proceeds with each player hopping through the course on one foot, except in boxes that allow both feet and on the spaces where the player's cue marker is, retrieving the pamato on their way back, while avoiding touching the lines or placing both feet in single-foot boxes. A player is disqualified from their turn if they step on a line, lose balance, or make an error in the sequence.\nAfter successfully completing a sequence, players are given the right to claim a box. Once a box is claimed, it becomes off-limits to subsequent players, who must avoid stepping on it. This rule increases the difficulty of the game, requiring players to make progressively larger jumps. Optional “wings” may be drawn alongside the main course to accommodate these longer jumps.\nAcross the Philippines, piko is known by various names, reflecting regional linguistic diversity. In the Ilocos Region, it is called kingking. In Cebu and some Visayan-speaking areas, it may be referred to as bikabix, kiki, or vicks-vicks, the latter reportedly due to the use of Vicks Vaporub caps as markers. In parts of Mindanao and the Visayas, it is also known as buan-buan. Among Waray speakers, it is called saya-saya, derived from the word saya, meaning \"skirt\".\nSambunot\nSambunot is a Philippine game played outdoors by ten to twenty players. The goal of the game is to get the coconut husk out of the circle.\nA circle is drawn on the floor, big enough to accommodate the number of players. A coconut husk is placed at the center of the circle. The players position themselves inside the circle. At the signal of \"go\", players rush to the center to get the coconut husk. Players may steal the coconut husk from another player to be the one to take the husk out of the circle. A player who is successful in getting out of the circle with the coconut husk wins, and the game starts again.\nSipa\nSipa (lit. game of kicking): The object used to play the game is also called sipa. It is made of a washer with colorful threads, usually plastic straw, attached to it. Alternatively, sipa can be played using a rattan ball or a lead washer covered in cloth or plastic. The sipa is then thrown upwards with player's foot. The player must not allow the sipa to touch the ground by hitting it several times with their foot or just above the knee. The player must count the number of times they kick the sipa. The one with most kicks wins the game. Sipa was the national sport of the Philippines until 2009.\nThe game mechanics of sipa is similar to the Western game hackysack. Sipa is also played professionally by Filipino athletes with a woven ball, called sepak takraw, with game rules borrowed from Indonesia.\nSikaran\nSikaran is a Filipino traditional martial art that involves hand and foot fighting. Sikaran is a general term for kicking. It is also used as the name of the kicking aspects of other Filipino traditional martial arts.\nHari Osias Banaag, originator of the Global Sikaran Federation and diplomat for the game, was warmly received at the UNESCO Collective Consultation Meeting on the Preservation and the Promotion of Traditional Sports and Game (TSG). Banaag is an appointed member of Ad hoc Advisory Committee Traditional Sports and Games, UNESCO. [http://unesdoc.unesco.org/images/0026/002610/261062e.pdf (TSG)]\nTaguan\nTaguan, or tagu-taguan (lit. twilight game, look out, cover yourself! or take-cover game!): Participants usually step on couches, hide under tables, or wrap themselves in curtains. It is similar to hide and seek. What is unique in taguan is that this game is usually played at sunset or at night as a challenge for the it to locate those who are hiding under the caves in Laguna and Cavite, which is a popular site for professional taguan players. The it needs to sing the following before they start seeking:\nTagu-taguan, maliwanag ang buwan (Hide and seek, the moon is bright)Masarap maglaro sa kadiliman ng buwan (It is fun to play in the semi-dark night)'''Pag kabilang kong sampu (When I finish counting up to ten)Nakatago na kayo (All of you should already been hidden)Isa, dalawa, ... tatlo! (One, two, ... three!)\nAnother version of the chant goes:Tagu-taguan, maliwanag ang buwan (Hide and seek, the moon is bright)Wala sa likod, wala sa harap (Nobody in front, nobody behind)'Pag kabilang kong sampu (When I finish counting up to ten)Nakatago na kayo (All of you should already been hidden)Isa, dalawa, ... tatlo! (One, two, ... three!)\nAnother version of the chant goes:Tagu-taguan, maliwanag ang buwan (Hide and seek, the moon is bright)Tayo maglaro ng tagutaguan'' (let's play hide and seek)isa, dalawa, ...umalis kana sa puwestohan mo (one, two, ... leave that place)\nStick games\nBati-cobra\nBati-cobra is a hitting and catching game. This game is played outdoors only by two or more players.\nTo play this game, two pieces of bamboo sticks (one long, one short) are required. A player acts as a batter and stands opposite the other players at a distance. The batter holds the long bamboo stick with one hand and tosses the short one with the other hand. The batter then strikes the shorter stick with the longer stick. The other players will attempt to catch the flying shorter stick. Whoever catches the stick gets the turn to be the next batter. If nobody catches the stick, any player can pick it up. The batter then puts down the longer stick on the ground. The holder of the shorter stick will throw it with the attempt to hit the longer stick on the ground. If the longer stick is hit, the hitter becomes the next batter. If the player with the shorter stick misses to hit the longer one, the same batter will continue.\nPityaw/Pikyaw\nTsato/Syato\nTsato (lit. stick game, better be good at it) (also spelled syato, syatong, chatong, or shatungs) is a traditional Filipino stick game played primarily in rural areas. It involves two players, a long flat stick (usually ) and a shorter stick (, typically cut from the longer one. The game is known by various names across different regions due to linguistic diversity. In Tagalog and Ilocano, it is called syato or syatong; in Visayan regions, it is often referred to as pityaw, pikyaw, pitiw chato, chatong, or shatungs.\nThe objective of the game is to strike the shorter stick so that it flies into the air and then hit it again midair to send it as far as possible. Points are awarded based on the distance the stick travels, usually measured in stick lengths. The game is traditionally played outdoors on bare ground, where a shallow, slanted hole is dug to position the shorter stick at an angle for striking.\nOne player assumes the role of the hitter while the other acts as the catcher. The hitter attempts to propel the small stick into the air and then hit it forward with the longer stick. The farther the stick lands, the higher the score. To increase their score, players may attempt a more advanced technique by tapping the small stick twice in the air before hitting it forward, resulting in points being measured using the shorter stick’s length instead.\nIf the catcher successfully intercepts the stick midair, the hitter earns no points, and the roles are reversed. If the hitter misses the stick entirely, the turn automatically passes to the other player.\nIn some variations, the losing player is penalized by hopping on one foot from a designated starting point back to the hole. The location is determined by where the stick lands after being hit into the air by the winner during the penalty round.\nTsato is similar in nature to other traditional games found across Southeast Asia and reflects the resourcefulness and playful creativity found in Filipino folk culture.\nThrowing games\nHolen\nDerived from the phrase \"hole in,\" players hold the ball or marble called holen in their hand. They throw it to hit another players ball out of the playing area. Holen is a variation on marbles in the United States. It is played in a more precise way by tucking the marble with the player's middle finger, with the thumb under the marble, and the fourth finger used to stabilize the marble. Players aim at grouped marbles inside a circle and flick the marble from their fingers. Anything they hit out of the circle is theirs. Whoever obtains the most marbles wins the game. Players (manlalaro) can also win the game by eliminating their opponents by hitting another player's marble.\nAnother version of this game requires three holes lined up in the ground separated by some distance. Each player tries to complete a circuit, travelling to all the holes and back in order. Players decide on the starting line and the distance between holes. The first to complete the circuit wins the game. Players can knock other player's holen (marble) away using their own marble. Generally the distance between holes allows for several shots to arrive at the next hole. The players shoots from where the prior shot landed. A variant of this game needs players to require their holen to pass back to the starting line.\nKalahoyo\nKalahoyo (lit. hole-in) is an outdoor game played by two to ten players. Accurate targeting is the critical skill, because the objective is to hit the anak (small stones or objects) with the use of the pamato (big, flat stone), trying to send it to the hole.\nA small hole is dug in the ground, and a throwing line is drawn opposite the hole (approx.  away from the hole). A longer line is drawn between the hole and the throwing line. Each player has a pamato and an anak. All the anak are placed on the throwing line, and players try to throw their pamato into the hole from the throwing line. The player whose pamato is in the hole or nearest the hole gets the chance for the first throw. Using the pamato, the first thrower tries to hit the anak, attempting to send it to the hole. Players take turns in hitting their anak until one of them knocks it into the hole, with the players taking turns. The game goes on until only one anak is left outside the hole. Players who get their anak inside the hole are declared winners, while the alila (loser) or muchacho is the one whose anak is left outside the hole. The Alila or Muchacho is \"punished\" by all the winner/s as follows:\nWinners stand at the throwing line with their anak beyond line A-B (longer line between hole and throwing line). The winners hit their anak with their pamato. The muchacho picks up the pamato and returns it to the owner. The winners repeat throwing as the muchacho keeps on picking up and returning the pamato as punishment. Winners who fail to hit their respective anak stop throwing. The objective is to tire the loser as punishment. When all are through, the game starts again.\nSiklot\nSiklot is a game of throwing stones similar to knucklebones. Siklot means \"to flick\". It uses a large number of small stones that are tossed in the air and then caught on the back of the hand. The stones that remain on the hand are collected by the player and are known as biik (\"piglets\") or baboy (\"pig\"). The player with the most biik plays the second stage first. The second stage involves the stones that fall on the ground. These are flicked into each other and collected if they hit each other. This is done until the player fails to hit a stone, then the next player does the same thing with the remaining stones, and so on. Siklot is also the name of a traditional game of pick up sticks among the Lumad people of Mindanao.\nSintak\nSintak is another game that is similar to modern knucklebones, but is indigenous in origin. It is also called kuru or balinsay, among other names. Instead of a bouncing ball, it uses a larger stone called ina-ina (\"mother\") that the player tosses up into the air and must catch before it hits the ground. During the throw, the player gathers smaller stones (also seeds or cowries) called anak (\"children\"). All of these actions are done with one hand. The game has multiple stages known by different names, each ranking up in difficulty and mechanics. The first stage picks up the smaller stones by ones, twos, threes, and so on. Other stages include kuhit-kuhit, agad-silid, hulog-bumbong, sibara, laglag-bunga, and lukob. For example, in kuhit-kuhit the player must touch a forefinger on the ground at each throw while also collecting the stones. The last stage of the game is known as pipi, where the losing player is flicked on the knuckles by the other player. A variant of the game just throws the collected pebbles (more than one at a time in later stages) without an ina-ina stone.\nSlipper Game (also known as \"Slipper Box\")\nThis game is popular amongst kids and teenagers in the Philippines, especially in the region of Visayas. It is an outdoor team game, composed of two groups. There is no limit to the number of participants but each team must have the same number of members or if not achieved, the team which has the most members get to play first. Moreover, the team to play first is usually decided by jack en poy. The rules of the game is simple and heavily varies according to the agreement of the participants. Players must draw a line as parameters for the game. The slippers will be used as the primary object. The team to play first will stack the slippers (commonly 2-3 levels) and throws it high, marking the start of it. The first players take turns entering the parameter and their goal is to skip the slippers thrown at them by their opponent. If they are hit, they are out. But they can be redeemed when their members gather the slippers thrown at the start of the game and throw it again. Players will be eliminated if they cross the parameters set. If the opposing team hits all the players they win, and they can now exchange roles.\nManeuvering games\nChinese garter\nThere are variations in how teams and players participate depending on the agreed rules. Here are some types of gameplay setups:\nTwo Players Per Team:\nEach team has two players who take turns jumping. If one player misses, the other player continues, and their scores or progress combine.\nThree Players Per Team:\nTeams with three players work together to clear the levels. Players take turns jumping, and any missed jump transfers to the next player.\nSolo Game:\nA single player competes alone, usually aiming to clear as many levels as possible for a high score.\nAll-In-One Team Play:\nEveryone on a team jumps one after the other in a single round, and the team’s progress is judged collectively.\nLuksong tinik\n]]\nLuksong tinik (lit. jump over the thorns of a plant): two players serve as the base of the tinik (thorn) by putting their right or left feet and hands together (soles touching gradually building the tinik). A starting point is set by all the players, giving enough runway for the players to achieve a higher jump, so as not to hit the tinik. Players of the other team jump over the tinik, followed by the other team. If a player hits either hand or feet of the base player's \"tinik\", he or she is punished by giving him or her consequences.\nLuksong-baka\n]]\nLuksong-baka (lit. jump over the cow) is a popular variation of Luksong-tinik. One player crouches while the other players jump over them. The crouching player gradually stands up as the game progresses, making it harder for the other players to jump over them. A person becomes the it when they touch the baka as they jump. It will repeat continuously until the players declare the player or until the players decide to stop the game most of the time once they get tired. It is the Filipino version of leapfrog.\nPalosebo\n]]\nPalosebo (lit. greased bamboo pole climbing): This game involves a greased bamboo pole that players attempt to climb. These games are usually played during town fiestas, particularly in the provinces. The objective of the participants is to be the first person to reach the prize—a small bag—located at the top of the bamboo pole. The small bag usually contains money or toys.\nTen-twenty\nA game involving two pairs, with one utilizing a stretched length of garter. One pair faces each other from a distance and has the garter stretched around them in such a way that a pair of parallel lengths of garter is between them. The members of the other pair then begin doing a jumping \"routine\" over the garters while singing a song (\"ten, twenty, thirty, and so on until one hundred). Each level begins with the garters at ankle-height and progresses to higher positions, with the players jumping nimbly on the garters while doing their routines.\nTinikling\nA game variant of the tinikling dance, with the same goal—for the players to dance nimbly over the clapping bamboo \"maw\" without having their ankles caught.\nOnce one of the players' ankles gets caught, they replace the players who hold the bamboo. The game will continue until the players decide to stop.\nTiyakad\nKadang-kadang, or karang (in Bisaya), and Tiyakad (in Tagalog) means \"bamboo stilts game\" in English. This racing game originated in Cebu. It was a team game introduced during the Laro ng Lahi (Game of the Races). The Laro ng Lahi was a traditional sports event initiated by the then Bureau of Physical Education and School Sports (BPESS). This game was popular long before its inclusion in the Laro ng Lahi. The elders during that period claimed they used to play it when they were younger, and also walked on kadang for fun without the rules, especially when they were done with household chores. Balance and concentration are the two most important skills a player possesses in playing kadang-kadang. However, teamwork is also necessary to successfully bring the game to the finish line.\nGuessing games\nBulong-Pari\nBulong-Pari (lit. whisper it to the priest) is composed of three teams and an it, or \"priest\". The leader of team A goes to the priest and whispers one of the names of the players of team B. Then they return to their place and the priest calls out, \"Lapit!\" (\"Approach!\"). One of the players of team B should approach the priest, and if it happens to be the one whom the leader of team A mentioned, the priest will say, \"Boom\" or \"Bung!\" The player then falls out of line and stays somewhere near the priest as a prisoner.\nPatay patayan (Guess the killer)\nPatay patayan, also referred to as \"killer eye\", involves at least four players. Players cut pieces of paper according to how many players are playing. One player is the judge, at least one is the killer, and at least one is a police officer, with the others playing regular players. The objective of the game is for the police to find and catch the killers by saying \"I caught you\" and say the name of the killer before the killer winks at the judge. The killer is able to kill people by winking at the person he wants to kill. If he kills a normal person, the person says \"I'm dead!\" If he kills the judge without being caught, the judge says \"I'm dead, but I'm the judge\" and the game repeats\nPitik-bulag\nThis game involves two players. One covers his eyes with a hand while the other flicks a finger (pitik) over the hand covering the eyes. The person with the covered eyes gives a number with his hand at the same time the other does. If their numbers are the same, then they exchange roles in the game. Another version of this is that the one with eyes covered (bulag) will try to guess the finger that the other person used to flick them.\nTakip-silim\nTakip-silim: One player is called the taya (the \"it\"). The it is blindfolded and counts to 10 while the other players hide. The \"it\" needs to find at least one player and guess who it is. If the guess is correct, the player becomes the new \"it\".\nGames involving simple objects\nTeks\nTeks or teks game cards (lit. texted game cards): Filipino children collect playing cards which contain comic strips and text placed within speech balloons. The game is played by tossing the cards in the air until they hit the ground. The cards are flipped upwards through the air using the thumb and the forefinger which creates a snapping sound as the nail of the thumb hits the surface of the card. The winner or gainer collects the other players' card depending on how the cards are laid out upon hitting or landing on the ground.[http://www.mb.com.ph/issues/2006/02/20/ENTR2006022056730.html Panaligan, Jojo P. \"Rocksteddy, Sandwich for parody and Pinoy sense of humor\", Entertainment], Manila Bulletin online, MB.com.ph, February 20, 2006, \"...\"Tsubtsatagilidakeyn,\" on the other hand, redounds from a popular children's game of teks cards. One bundles up three cards (yours, your opponent's and a mediator card that decides the winner), flip all into the air, then let them land on the floor. \"Tsub\" means the card is face down, \"Tsa\" means face up, and \"Tagilid\" is when a card lands arguably face up/down...\"Akeyn!\" (Mine!) is what's shouted out by whoever wins the pot of more cards. Sounds fun, doesn't it? So is the music of Rocksteddy...,\" note: Italicization and word translation of Akeyn! are mine, accessed on: April 10, 2008\nAs a children's game, the bets are just for teks, or playing cards as well. Adults can also play for money.\nA variant of the game, pogs, uses circular cards instead of rectangular ones.\nTrompo\nA trompo is a top that is spun by winding a length of string around the top and launching it so that lands spinning on its point. If the string is attached to a stick the rotation can be maintained by whipping the side of the body. The string may also be wound around the point while the trompo is spinning in order to control its position or even lift the spinning top to another surface.\nDampa\nDampa is a game played with the use of rubberbands. Player's hands form a dome with an opening at the tip to force air out, causing the rubber bands to move in a controlled manner. The objective of the game is to be the first player to have their rubber band cross the line.\nVariations of tag\nAgawan base\n(lit. catch and own a corner): the it or tagger stands in the middle of the ground. Players in the corners try to exchange places by running from one base to another. The it tries to secure a corner or base by rushing to any of those when it is vacant. This is called \"agawang sulok\" in some variants, and \"bilaran\" in others.\nSekyu base or Moro Moro\nSekyu base is a version of Agawan Base without score limits. Each two teams has a \"'base'\" which can be any object like a tree or a post and in order to win, the players have to touch the enemy's base and say \"'Sekyubase!'\" before getting touched by the enemies. Players out in the open are vulnerable to getting captured by the enemy players unless they touch their home base and try capture them back by saying \"'Sekyu'\". Captured players have to hold on to the enemy's base and form a human chain reaching towards the allies as touching the hand of the person at the end of the chain grants as an easier win than touching the base itself. This serves as a balancing mechanism if a team has a lot of captives. If a team scores five points, the game continues. The players can hide near the enemy base and ambush them.\nAraw-lilim\nAraw-lilim (lit. sun and shade): The it or tagger tries to tag or touch any of the players in the light.\nBahay-bahayan\nPlayers make imaginary houses using curtains, spare wood, ropes, or other items. They assign each individual what they wanted each implement to be, to not be caught by him.\nIring-iring\nIring-iring (lit. go round and round until the hanky drops): After the it is determined, he/she goes around the circle and drops the handkerchief behind another player. When the player notices the handkerchief is behind them, he or she has to pick up the handkerchief and go after the it around the circle. the it has to reach the vacant spot left by the player before the it is tagged; otherwise, the it has to take the handkerchief once more.\nKapitang bakod\nKapitang bakod (lit. ''touch the post, or you're it! or hold on to the fence): When the it or tagger is chosen, the other players run from place to place and save themselves from being tagged by holding on to a fence, a post, or any object made of wood or bamboo.\nLangit-lupa\nLangit-lupa (lit. heaven and earth) one it chases after players who are allowed to run on level ground (\"lupa\") and clamber over objects (\"langit\"). The it may tag players who remain on the ground, but not those who are standing in the \"langit\" (heaven). The tagged player then becomes it and the game continues.\nIn choosing the first it, a chant is usually sung, while pointing at the players one by one:\nLangit, lupa impyerno, im – im – impyerno (Heaven, earth, hell, he-he-hell)Sak-sak puso tulo ang dugo (Stabbed heart, dripping in blood)Patay, buhay, Umalis ka na sa pwesto mong mabaho ! (Dead, alive, get out of your stinky spot ! )\nAnother version of the song goes:\nLangit, lupa, impyerno, im – im – impyerno (Heaven, earth, hell, he-he-hell)Max Alvarado, barado ang ilong (Max Alvarado has a stuffy nose!)Tony Ferrer, mahilig sa buldak (Tony Ferrer is fond of guns!)Vivian Velez, mahilig sa alis! (Vivian Velez is fond of... Get out!)\nWhen the song stops and a player is pointed at, they are \"out\" and the last person left is the taya or \"it\". One variant of choosing \"it is by having players offer a foot instead to form a circle where one uses the offered feet to point at the players.\nTo prevent cheating, some players count to three, four, or five if they stand on the \"langit\", and can only be stopped if there is another player standing on it.\nLagundi\nA game of Indian influence. It is basically a game of tag, except the players divide into two teams, the it team members get to hold the ball, passing it between themselves, with the ball touching the head of the other (not it) team.\nLawin at sisiw\n(lit. Hawk and Chicken):\nThis game is played by ten or more players. It can be played indoors or outdoors.\nOne player is chosen as the \"hawk\" and another as the \"hen\". The other players are the \"chickens\". The chickens stand one behind the other, each holding the waist of the one in front. The hen stands in front of the file of chickens.\nThe hawk \"buys\" a chicken from the hen. The hawk takes the chicken and asks it to hunt for food, and go to sleep. While the hawk is asleep, the chicken returns to the hen. The hawk wakes up and tries to get back the chicken he bought while the hen and other chickens prevent the hawk from catching the chicken. If the hawk succeeds, the chicken is taken and punished. If the hawk fails to catch the chicken, the hawk will try to buy the chicken.\nThis game was created by Cyberkada in 1995. Until the 2020s, it was one of the most popular traditional games in the Philippines.\nPatintero\n]]\nPatintero, also called harangang taga or tubigan (lit. try to cross my line without letting me touch or catch you): Two teams play: an attack team and a defense team; with five players for each team. The attack team must try to run along the perpendicular lines from the home-base to the back-end, and return without being tagged by the defense players.\nMembers of the defense team are called it, and must stand on the water lines (also \"fire lines\") with both feet each time they try to tag attacking players. The player at the center line is called \"patotot\". The perpendicular line in the middle allows the it designated on that line to intersect the lines occupied by the it that the parallel line intersects, thus increasing the chances of the runners to be trapped. Even if only one member of a group is tagged, the whole group becomes the it.\nPatintero is one of the most popular Filipino street games. It is a similar game to the Korean game squid and the Indian game atya-patya.\nIn 1997, Samahang Makasining (Artist Club), Inc. created time-based scoring similar to that of basketball, and modified the game thusly: Each team is composed of six people (four players and two substitutes). The attacking team is given 20 minutes to cross the perpendicular lines from the home-base to the back-end, and then return. Each team can play for three games. The four horizontal water lines (also \"fire lines\"), two vertical lines (left and right outside lines) and one perpendicular line in the middle of vertical lines. Each box measures 6 meters by 6 meters.\nThe team can win based on the highest score of one player who reaches the farthest distance. Scoring is two points per line for each of the four lines going away from home-base and three points per line for each of the four lines coming back toward home-base, plus five additional points for reaching home-base.\nSomeone who makes it all the way across and back: (2 points × 4 lines) + (3 points × 4 lines) + 5 points home-base = 25 total points.\nPresohan\nSee tumbang preso and patay patayan\nTumbang preso\n]]\nTumbang preso or presohan in Luzon, and tumba-patis or tumba-lata in most Visayan regions (in English Hit The Can). This is one of the most popular Filipino street games, played by children using their slippers to hit a can at the center.\nLike other Filipino games, players (at least three here) take the following roles: one as the taya (it), who is responsible for guarding the lata (can), and two others as the players striking. The game is performed by having the players use a pamato'' (one's own slipper) to strike the can that is held beside the taya.\nThe taya is obligated to catch another player to give them their responsibility of chasing the can. However, the taya is privileged to do so only if the player is holding a pamato while approaching when the can is in its upright position. Therefore, while running after another player, the taya must keep an eye on the can's position. The other spend their time kicking the can and running away from the taya, keeping themselves safe with their pamato, since making the can fall down helps another player recover. Having everyone's turns end can become the climax of the game that leads them to panic, since the taya has all their rights to capture whether or not the players have their pamato.\nThe mechanics of the game give each side privileges. The taya starts on one side of the road, while the can is centered on the median. On the other side a line limits the player when throwing. Players can break the rules and be punished by becoming the taya in several ways: stepping on or outside the boundary line when throwing; kicking the can; striking the can without having oneself reached the line; or touching it.\nRegional variations, especially those in Visayan regions and Southern Luzon, add complexity to the part of the taya. The taya has to make the can stand upright together with their own pamato on top of it. The idea is that even when the taya has already stood the can up, when the slipper falls from the can, they are not allowed to catch any player until the taya puts it back.\nUbusan lahi\nUbusan lahi (lit. clannicide): One player tries to conquer the members of a group (as in claiming the members of another's clan). Out of five to ten players, a tagged player from the main group automatically becomes an ally of the tagger. The more players, the more chaotic the game and optimal their performance. The game starts with only one it and then try to find and tag other players. Once one player is tagged, they will then help the it to tag the other players until no other participant is left. This also is known as bansai or lipunan.\nMethods of Choosing It\nSawsaw-suka\nSawsaw-suka  (lit. dip it into vinegar): This is sometimes done to determine who is \"it\" in the game of tag. One player has one or both hands open while the other players tap that person's palms repeatedly with their index finger, while chanting \"sawsaw suka mahuli taya!\" When the last syllable of the word \"taya\" is shouted, the person with their hands open quickly closes them and whoever is caught becomes the next \"it.\" After they get caught, everyone else runs while the new \"it\" chases them. If the is not used in the chasing game, the process simply repeats around the players. The process of tapping the palm emulates dipping food into vinegar, hence the name \"sawsaw suka.\" which means \"dip into vinegar.\" Another variation of the chant goes \"sawsaw suka, mapaso taya\", or in English \"dip into the vinegar, whoever gets burned is it.\"\nKampihan/Sinong Nag-iiba\nPlayers simply put all their hands in then either show their palms up or down.\nIn Kampihan (lit. making teams), all players with palms up belong to the same team and vice-versa for palms down. If the number of palms up and palms down are not equal, the players do it again.\nIn Sinong Nag-iiba (lit. ''Whoever's different...''), the player who's different from the rest becomes it.\nRacing games\nSangkayaw (Coconut Shell Race)\nSangkayaw is a traditional racing game played in Central Luzon. This game uses coconut shells tied to a string under each foot. The string is placed between the big toe and the index toe with the other end of the string being held by the hands.\nTiyakad or Kadang-kadang\nKadang-kadang, also known as tiyakad in Tagalog, is a traditional Filipino racing game played using bamboo stilts. The term kadang-kadang translates roughly to “simple play” and reflects its recreational nature. The game is typically featured during larong lahi events, which celebrate Filipino indigenous games and cultural heritage.\nThe game was first documented in Cebu in 1969. Players use a pair of bamboo poles of equal length, each equipped with a footrest or platform sized to accommodate the player’s feet. Traditionally, the stilts measure approximately 10 feet (3 meters) in height, although modern versions may use taller or adjustable stilts depending on the players’ skill level and the context of the activity.\nKadang-kadang is primarily a test of balance, coordination, and speed. Players race each other while walking or running on the stilts, often in competitive or festive settings.\nBoard games\nDama\nDama is a game with leaping captures played in the Philippines. It is similar to draughts or checkers. In it, a kinged piece may capture by the flying leap in one direction.\nThe board consists of a 5x5 grid of points, four points in each row, each alternating position with an end point on the left or right edge. Points are connected with diagonal lines.\nTwelve pieces per player are positioned on the first three rows closest to the player. Players take turns moving a piece of their own forward to an empty adjacent spot along the lines. A player may capture an opponent's piece by hopping over it to an empty spot on the opposite side of it along the lines.\nMultiple captures are allowed, if possible. When a player's piece reaches the opposite edge of the board from which it started, it becomes a king. Kings may move any distance diagonally forward or backward, and may capture any number of opponent's pieces it leaps over. The king cannot take multiple directions in one turn. The first player to capture all of the opponent's pieces wins.\nDamath/Scidama\nDamath (sometimes stylized as Scidama) is a variation of Dama played in schools and institutions and briefly introduced by the DepEd. It uses an 8×8 board, similar to a chessboard, with each landing square labeled with a math sign: + - \\times \\div. Each of the players' pieces is labeled with different numbers ranging up to three digits. The name Damath is a portmanteau of dama (a local form of checkers) and math (mathematics), while Scidama blends science and dama, reflecting its educational purpose. The goal of the game is to lose more pieces and accumulate fewer points in order to win; after computation and tallying, the player with the lesser total score or overall value is declared the winner.\nLusalos\nGeneral equivalent of the game “Nine men's morris.”\nTapatan\nGeneral equivalent of the game “Three men's morris.”\nThe rules of the game are exactly the same as those of Three Men's Morris, except that pieces can only move to adjacent points\nSungka\nSungka is a Philippine mancala game popular in the diaspora; e.g. in Macau, Taiwan, Germany, and the United States. Like the closely related congkak, it is traditionally a women's game. Sungka is used by fortunetellers and prophets, also called bailan or maghuhula, for divinatory purposes. Older people hope to find out through the game, with their help, whether the life of a youth is favorable at a certain day, whether they will marry one day, and, in case they will, when this will be. The game is usually played outdoors because of a Filipino superstition about a house burning down if it is played indoors. In the Anay district in Panay, the loser is said to be patay (\"dead\"). The belief is that he will have a death in his family or that his house will burn down.\nshell seeds, along with sipà (rattan wicker ball) and kakasing (tops)]]\nThe game is played with a carved wooden board (e.g. mahogany) with seven small dips or holes on each side called bahay (houses), and two bigger holes on either side, and shells or stones. The premise of the game is to collect more shells than the opponent. In addition, a large store is known as ulo (head) or inay (mother) for the captured stones at either end of the board. A player owns the store to his left. Each small pit initially contains seven sigay (counters), usually cowrie shells. On their turn a player empties one of their small pits and then distributes its contents in a clockwise direction, one by one, into the following pits including their own store, but passing the opponent's store.\nAccording to the National Historical Commission of the Philippines the game is also played counterclockwise with each player owning the store to his right.\nIf the last stone falls into a non-empty small pit, its contents are lifted and distributed in another lap. If the last stone is dropped into the player's own store, the player gets a bonus move. If the last stone is dropped into an empty pit, the move ends, i.e. it is patay (dead). If the move ends by dropping the last stone into one of a player's own small pits, one katak or taktak; literally \"exhausts\" or captures) the stones in the opponent's pit directly across the board and the first player's own stone. The captured stones are subi (deposited) in the first player's store. However, if the opponent's pit is empty, nothing is captured.\nThe first move is played simultaneously. After that players alternate. The first player to finish the first move may start the second move. However, in face-to-face play one player might start shortly after his opponent so that he could choose a response which would give him an advantage. No rule prevents such a tactic. So, in fact, the decision-making may be non-simultaneous.\nPlayers must move when they can. If one cannot, a player must pass until he can move again.\nThe game ends when no stones are left in the small pits.\nThe player who captures the most stones wins the game.\nOften the game is played in rounds. Pits that cannot be filled with captures, are sunog (closed; literally \"burnt\"), while the leftover seeds are put in their store. This continues until a player is unable to fill even one hole.\nOther traditional games\nSpirit of the Paper\nSpirit of the Paper is a traditional Filipino children's divination game. It involves folding three papers with hidden slips marked “yes”, “no\", and \"maybe.\" While thinking of a question, children chant three times. The children interpret the answer based on which slip is revealed. Though regarded as a form of lighthearted fortune-telling, the game is part of a broader set of Filipino folk practices blending superstition and play.\nReferences\n*[http://kulturapilipinas.webs.com/ Larong Pinoy Advocacy] Laro ng Lahi advocacy\n*[http://magnakulturafoundation.webs.com Magna Kultura Foundation] advocacy for Filipino arts & culture\n*[http://kulturapilipinas.webs.com/about-magna-kultura Advocacy to keep the games alive in modern times] as social and cultural entrepreneurship in the Philippines\n*[http://kulturapilipinas.webs.com/patintero-tagalog Patintero] game mechanics in Filipino (Tagalog)\n*[https://healthy.uwaterloo.ca/museum/Archives/Culin/Philippine1900/index.html Additional games played by Filipino children around 1900]\nFootnotes\nBibliography\n* [http://magnakulturafoundation.webs.com/ Aguado, Dickie A., Executive Director of Magna Kultura] \"\"Reviving the Games of our Heritage to instill Filipino Patriotism among the new generation\"\n* [http://makasining.org/ Samahang Makasining(Artist Club), Inc.] Preserving and popularized the Philippine Indigenous Games and they called it Laho ng Lahi.\n* Borja, Bernadette F. \"A Combination of Instructional Materials in Teaching Physical Education\" based on Secondary Education Development Program, Philippine Normal University\n* Flores, Josephine A. Cordillera Game, Cordillera Administrative Region\n* Fontanilla, Victorino D. \"The Cultural Heritage of Central Mindanao: Folk Culture of Region XII\", Cotabato City, DECS, 1992\n* Philacor Young People's Library, \"Games Filipino Children Play\", Manila Philippines, 1978\n*[http://kulturapilipinas.webs.com/about-magna-kultura Magna Kultura Foundation] Reviving larong pinoy in the mainstream of Philippine society"
    }
  ]
}