{
  "content": [
    {
      "type": "text",
      "text": "# Trail of Civilizations\n\nEnsemble of the ballet performance, the floodlit Borobudur towering in the background\nTrail of Civilizations was the motto of a symposium, initially held in August 2006 in Indonesia under the auspices of the governor of Central Java and the Indonesian Ministry of Culture and Tourism. Climax of the event was a ballet performance in front of the temple of Borobudur.\nAlong with the Indonesian hosts the Director of the UNESCO office for Asia and the Pacific in Jakarta as well as the ministers of tourism of the predominantly Buddhist nations of Southeast Asia, i.e., Thailand, Myanmar, Laos, Vietnam and Cambodia were present.\nThe symposium has led to the \"Borobudur Declaration\" which is aimed to foster cooperation and the preservation of cultural heritage among six ASEAN countries: Indonesia, Thailand, Myanmar, Laos, Vietnam and Cambodia.\nThe Trail of Civilization itself has become the biennale event and held again on 26 July 2008 in Borobudur. Present in the Trail of Civilization 2008 was the director of UNESCO, the ministers of tourism of six ASEAN countries, and Indonesian President Susilo Bambang Yudhoyono.\nBackground\nFollowing a series of destructive natural events and the terror attacks in Bali, tourism in large parts had virtually come to a standstill. Even in Bali, a relatively small island that traditionally attracts large numbers of visitors, the crisis was evident at a first glance. Outside Bali, even on the neighbouring islands of Java and Lombok, there were only a handful of western visitors, even at the most famous destinations such as the temples of  Prambanan, Borobudur, and the volcanic range of Mount Bromo.\nIn an attempt to revive tourism in Indonesia, and, in particular, encourage visitors to see the unique monuments of Central Java, the symposium was planned to take place in mid-2006. However, the event itself had to be postponed two times because of further natural disasters: the devastating earthquake on 27 May 2006 in Central Java, and the tsunami that hit the coast of Java on 17 July of the same year.\nThe international tourism slump of Borobudur has made Indonesian Ministry of Tourism to look elsewhere for joint cooperation as well as the new source of international visitors. Other than traditional market of Indonesian tourism such as Japan, United States, and European visitors, the Buddhist nations of Southeast Asia such as Thailand, Myanmar, Laos, Vietnam and Cambodia is considered to become the potential market.\nTaking into account the deeply rooted cultural links among Indonesia, Cambodia, Laos, Myanmar, Thailand and Vietnam dating back to the first millennium. These Southeast Asian nations shared Hindu-Buddhist culture, civilization and archaeological heritages, such as Angkor Wat, Borobudur, Bagan, Ayutthaya, Luang Prabang, and Huế.\nThe Borobudur declaration\n}}\nOn 28 August 2006 the symposium took place in Borobudur Archaeological park. A massive presence of security forces safeguarded the venue, fortunately, it was positioned in a way to provide maximum security and at the same time being virtually invisible temple itself, maintaining the serene atmosphere of the site and the surrounding gardens. Along with internal meetings of the ministers and their key staff, a reception was held on the evening of that day, celebrating the launch of a new book \"The Restoration of Borobudur\", published by the UNESCO.\nThe symposium has produced the declaration called \"Borobudur Declaration\" signed by ministers of tourism of six ASEAN countries:\n* Lay Prohas, Minister of Tourism of the Kingdom of Cambodia\n* Jero Wacik, Minister for Culture and Tourism of the Republic of Indonesia\n* Somphong Mongkhonvilay, the National Tourism Administration of Lao Peoples Democratic Republic\n* Major General Soe Naing, Minister for Hotels and Tourism of the Union of Myanmar\n* Boontham Pigulsri, Assistant Minister of Tourism and Sports of the Royal Kingdom of Thailand\n* Dr. Pham Tu, National Administration of Tourism of the Socialist Republic of Viet Nam\nThe Mahakarya Borobudur ballet performance\nThe main event was the spectacular \"Mahakarya Borobudur\" Javanese dance performance in front of Borobudur directed by PT Taman Wisata. It was performed on Akshobhya open stage in the temple yard involved more than 150 artists from the Indonesian Institute of the Arts (ISI) Surakarta and local performers, choreographed to feature traditional Javanese dancing, music and costumes, and tell the history about the construction of the Borobudur. After the symposium, the Mahakarya Borobudur ballet is performed several times, especially every June during annual national Waisak commemoration at Borobudur attended by Indonesian President.\nHowever, unlike many dance performances which are held on an almost daily basis in neighbouring Yogyakarta, and Prambanan, this was neither just a display of traditional dancing nor a performance of the well-known Hindu epics, the Ramayana, or the Mahabharata. In four scenes, the history of the construction of the Borobudur Temple was shown. In a final climax, the Borobudur temple itself, situated immediately behind the ballet stage, was floodlit and became an integral part of the performance.\nUnlike routine Ramayana ballet performance of Prambanan temple stage, the Mahakarya Borobudur ballet performance is only scheduled to be performed several times a year, usually performed around the Vesak day. The lavish dance performance was an effort to attract more foreign visitors as well as cultural attraction similar to those Ramayana dance performance in Prambanan temple.\nSee also\n* Borobudur\nReferences\n* [https://web.archive.org/web/20071229114449/http://www.unesco.or.id/activities/culture/completed/313.php Unesco website]\nExternal links\n* [https://web.archive.org/web/20100726074717/http://www.borobudurpark.co.id/en-mahakarya.html Mahakarya Borobudur Ballet]"
    }
  ]
}