{
  "content": [
    {
      "type": "text",
      "text": "# Transformers: Beast Wars (2021 comic book)\n\n| publisher      = IDW Publishing (licensed by Hasbro)\n| startmo        = February 3,\n| startyr        = 2021\n| endmo          =June 22,\n| endyr          = 2022\n| issues         = 17 (plus 1 annual)\n| writers        =\n| pencillers     =\n| colorists      =\n| letterers      =\n| editors        =\n}}\nTransformers: Beast Wars is an American comic book ongoing series by IDW Publishing that debuted in 2021, written by Erik Burnham and drawn by Josh Burcham, celebrating the twentieth-fifth anniversary of the Beast Wars brand of the Transformers franchise by Hasbro.\nThe series debuted on February 3, 2021, and concluded on June 22, 2022, following the announcement of the Transformers comic book license leaving IDW by the end of the year.\nPremise\nSet in a distant future of Cybertron, when the Predacons led by Megatron steal a time machine, the Maximals led by Optimus Primal must stop them from changing history.\nPublication history\nBackground\nAfter Beast Machines finished airing in 2000, the Beast Wars franchise was not revisited until Dreamwave Productions acquired the rights to the Transformers comic franchise from Hasbro. Dreamwave first touched on the Beast Wars series with a prequel in 2003's Transformers: More Than Meets The Eye. In 2004, the publisher's Transformers Summer Special featured ''Ain't No Rat, which was the first officially approved comic story to carry on directly from the events seen in the final Beast Wars cartoon. Dreamwave held a contest to select which Transformers continuity (Beast Wars or Robots in Disguise) would be the next to get its own book, and Beast Wars'' was the victor, with writers James McDonough and Adam Patyk and artist Don Figueroa as the initially planned creative team for the new series. However, despite several pieces of artwork being released (and according to those involved with the project some impressive pieces remaining unreleased), Dreamwave's bankruptcy caused the project to be canceled.\nDevelopment\nIn May 2020, IDW's then President Chris Ryall, and editor-in-chief John Barber, announced a new Beast Wars comic book in development.\nIn October 2020, IDW officially announced a new comic book series titled Transformers: Beast Wars, which will be written by Erik Burnham and drawn by Josh Burcham.\nThe series debuted on February 3, 2021, and concluded on June 22, 2022, following the announcement of IDW passing the Transformers comic book license by the end of the year.\nIssues\n{| class=\"wikitable\" style=\"text-align: center;\" width=\"100%;\"\n! style=\"background:#005EB8; color:white\" |Issue\n! style=\"background:#005EB8; color:white\" |Title\n! style=\"background:#005EB8; color:white\" |Written by\n! style=\"background:#005EB8; color:white\" |Drawn by\n! style=\"background:#005EB8; color:white\" |Colored by\n! style=\"background:#005EB8; color:white\" |Publication date\n|-\n|#1\n| style=\"text-align: left;\" |\"Savage Landing Part 01\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|February 3, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |On Cybertron during the distant future, Predacon leader Galavar, calling himself the new Megatron, rebels against the Tripredacus Council with the intention of stealing a golden disk from the Maximal Science Ministry. Aboard the Darksyde, a transwarp vessel they stole from the Great Shipyard of Vos, the Predacons plan to travel through time to unlock the disk's secrets. In response, Optimus Primal, on orders from former Autobot General Ironhide, unites a team of Maximals, and aboard the Axalon, they chase the Predacons through a transwarp portal, which leads both factions to crash on an unknown planet filled with lots of energon. The ridiculously large amount of energon causes both the Maximals and Predacons to short out in robot mode, so their ships' computers rebuild them into techno-organics who can transform into different animal forms.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#2\n| style=\"text-align: left;\" |\"Savage Landing Part 02\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|March 3, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |On the alien planet, Rhinox, unaware that three alien beings known as the Vok are watching both the Maximals and Predacons in secret, is perturbed by the strange geography of the planet's environment. Meanwhile, Optimus lets Nyx explore the skies with her new bat mode while he and Cheetor cover for her regarding repairs to the Axalon. Meanwhile, Megatron is trying to decode the Golden Disk for secrets, Tarantulas and Skold are dealing with Unspace signatures on the Darksyde, Dinobot is feeling like he's the only one who respects the chain of command, and after seeing a light from the Vok's visit but not knowing what it means, Terrosaur goes out for some air. After the Predacon Pterodactyl sees Nyx flying near a floating mountain, the two engage in an aerial battle that Terrorsaur wins by using the powers of his new robot mode while free-falling. He strikes Nyx down by hitting part of her left wing and carries the large fruit bat straight to Megatron's chamber for interrogation and the chance to lure the other Maximals out of hiding.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#3\n| style=\"text-align: left;\" |\"Savage Landing Part 03\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|April 7, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |As Nyx is submitted to torture by Megatron and Tarantulas, Dinobot begins doubting their cruel methods and leaves. The Maximals debate whether Nyx is lost or in trouble; Cheetor wants to go look for her but Optimus rules waiting until daytime for better chances. Nyx defies Megatron by telling him that, like his namesake, history will not remember him, causing him to increase her torture. Dinobot finally steps in to stop it, earning Megatron's rage, but Tarantulas calms him by pointing out Nyx's silence confirms she has allies to protect. Megatron gives Nyx to Tarantulas for his experiments and warns Dinobot against further disobedience. Nyx is thrown outside and kept from transforming by a device of Tarantulas' so the Energon levels will kill her while the Predacons fire on her. Having had enough, Dinobot destroys the device, allowing Nyx to transform and flee while he takes on the vengeful Predacons. Defeating all of them while declaring his honor, he traps them in their ship by locking it down and flees while an impressed Megatron vows retribution.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#4\n| style=\"text-align: left;\" |\"Savage Landing Part 04\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|May 19, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |Dinobot saves Nyx from a native beast resembling a saber-toothed tiger, offering himself to bring her back to the Axalon. Tarantulas takes back control over the Darksyde, freeing the Predacons. Megatron orders the ship to a self-destruction countdown over the Predacons until Dinobot and Nyx are found. The Maximals manage to locate Nyx's signal, but after encountering Dinobot, the latter requests to become a Maximal, as he considers them honorable.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#5\n| style=\"text-align: left;\" |\"Savage Landing Part 05\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|June 30, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |While Dinobot is interrogated, he reveals to Nyx his reasons for joining the Predacons. At the same time, they arrive to attack the Axalon, but the Maximals decide to fight back. When Megatron is about to kill Optimus, Nyx decides to free Dinobot in order to help them.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#6\n| style=\"text-align: left;\" |\"Savage Landing Part 06\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|July 28, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |During the fight, Tarantulas discovers the Maximals were carrying protoform pods before Rattrap fixes the ''Axalon's defense systems. When Dinobot cannot enter, the Predacons surround him to the point of almost killing him. Optimus orders the Axalon'' to use plasma cannons on the Predacons to save Dinobot. Several days later, Dinobot recovers from his injuries and accepts Optimus' offer to stay with the Maximals.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#7\n| style=\"text-align: left;\" |\"Pod Part 01\"\n|Erik Burnham\n|Winston Chan\n|SidvenBlu\n|August 25, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |Dinobot still recovers from his injuries while becoming an official Maximal member. Megatron tries to decrypt the message from his future self inside the Golden Disk. After her stasis pod descends on the planet, Blackarachnia awakes and begins her search for the ''Axalon's signal, which leads her to have a confrontation with Cheetor, to the point of incapacitating him.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#8\n| style=\"text-align: left;\" |\"Pod Part 02\"\n|Erik Burnham\n|Winston Chan\n|SidvenBlu\n|September 22, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |The Maximals found Cheetor while Blackarachnia tries to hack the Axalon's computer system, sending signals to several protoform pods to transform them into Predacons. When Rhinox intervenes, she placed three bomb traps in order to escape. Back on the Darksyde, Tarantulas reveals that he transformed Blackarachnia into a Predacon.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#9\n| style=\"text-align: left;\" |\"Thicker Skin\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|October 27, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |While the Predacons plan their next move, Skold walks on her own and finds a stasis pod containing Maximal adventurer Razorbeast. While walking, Skold reveals Razorbeast about her past prior to being recruited by Megatron, (she wanted to be an artist and was bullied before joining Megatron), but they are chased by a pack of Ironwolves, as part of an experiment made by the Vok. Skold manages to kill an Ironwolf, while incapaciting the others, but Razorbeast is badly injured in the process and forced into stasis lock. Skold then takes Razorbeast to the Axalon'', so the Maximals can take care of him. She then retreats after rejecting Dinobot's offer to join them.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#10\n| style=\"text-align: left;\" |\"Maximals Strike Back Part 1\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|November 24, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |While Optimus plans a strategy to attack the Darksyde, Dinobot reveals how the Golden Disk was retrieved by a group of scientists and taken to Cybertron. The files within the Disk were decoded, but one of the scientists informed Galavar/Megatron about it, leading the Maximals and Predacons to their current time and location. Meanwhile, Terrorsaur has a conflict with Megatron about who should lead the Predacons, until the Maximals, aboard a new ship, attack the Darksyde.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#11\n| style=\"text-align: left;\" |\"Maximals Strike Back Part 2\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|December 22, 2021\n|-\n| colspan=\"6\" style=\"text-align: left;\" |During the fight between Maximals and Prdacons, Nyx and Rattrap go inside the Darksyde. When Razorbeast tries to reason with Skold, Terrorsaur sends the former to the floating mountains, where the volatile energon crystals explode over him. In revenge, Skold murders Terrorsaur.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#12\n| style=\"text-align: left;\" |\"Maximals Strike Back Part 3\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|January 26, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |Nyx destroys the ship's transwarp drive, while Rattrap makes a copy of the Golden Disk. When they reunite with Optimus, Megatron seals on a force field, but Optimus deceives him on letting them go, in exchange for not destroying the Disk. Megatron reluctantly agrees, but he now wants Optimus dead before achieving his other goals of decrypting the Disk and conquer Cybertron. After the battle, Tarantulas uses Terrorsaur's body for some experiment of his.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#13\n| style=\"text-align: left;\" |\"The Speedway of Central Consciousness\"\n|Erik Burnham\n|Winston Chan\n|SidvenBlu\n|March 2, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |After falling unconscious due to an energon crystal that exploded near him, Cheetor gets trapped in an illusory version of Cybertron, where Pakak, a member of the Vok, makes an experiment on him to gain information about the Tiwaz Maneuver. When Cheetor refuses to tell him anything, Pakak challenges him into a race, being disguised as the legendary Autobot speedster Blurr. Cheetor wins the race, but Pakak reveals it was all a trick to get access to the information about the remaining protoforms so the Vok can do experiments on them and fight the Maximals and Predacons with their own people. Cheetor is sent back to reality, where Optimus and Rhinox ask him about the Vok, but Palak erases his memories before he could answer them.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#14\n| style=\"text-align: left;\" |\"Primal Rage\"\n|Erik Burnham\n|Josh Burcham\n|Josh Burcham\n|March 23, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |Scorponok and Waspinator find a crystal of red energon that causes highly aggressive behaviour in the organic beasts. While trying to plant a series of early-warning sensors in the jungles beyond the Axalon, Optimus and Dinobot are attacked by Tarantulas and Blackarachnia. They place a bomb on Dinobot that emits the same radiation from the crystal. As consequence, Optimus is affected and becomes erratic in front of the Maximals to the point of attacking them. Dinobot tricks Optimus on focusing his anger on Megatron, causing him to leave the Axalon. On their way to find each other, both Optimus and Megatron are captured by Polar Claw and Saberback, two followers of the Vok.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|2022 Annual\n| style=\"text-align: left;\" |\"Skold's No Good, Very Bad Day\"\n|Sam Maggs\n| Lanna Souvanny\n|Lanna Souvanny\n|April 20, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |In the Darksyde, Skold falls into a prank by the other Predacons and gets locked inside a cell where she meets a prisoner named Powerhug, but Skold deduces he is a lifeless body that she destroys to gain the hidden key that unlocks the cell.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|2022 Annual\n| style=\"text-align: left;\" |\"Rhinox's Amaze-Ing Adventure\"\n|David Mariotte\n| Phillip Johnson\n|Phillip Johnson\n|April 20, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |While searching for a missing pod, Rhinox falls into a Predacon trap and ends into a hidden labyrinth, where he finds Waspinator. After surviving all the traps, Waspinator leaves Rhinox trapped.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|2022 Annual\n| style=\"text-align: left;\" |\"The Morphlings\"\n|Nick Marino\n| Andra Bell\n|Andra Bell\n|April 20, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |While most of the Maximals stay in a wood fire at night, Cheetor tells his pals a horror story about a group of Servicons getting infected by altered bacteria called Morphlings.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#15\n| style=\"text-align: left;\" |\"Children of the Vok\"\n|Erik Burnham\n|Winston Chan\n|Ellie Wright\n|May 4, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |Optimus and Megatron are trapped in a cave by Tigatron, Polar Claw, Saberback, Inferno, and Airazor, a group of Transformers who worship the Vok. After they retreat, Optimus and Megatron rarely get out of the cave, unaware it is all a test of the Vok. When the duo confront the Vok's followers, some of them are killed, causing the Vok to reveal themselves. Optimus proposes to give them a few cycles before confronting them again, and they accept. Optimus and Megatron are then forced to work together in order to put end to the Vok.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#16\n| style=\"text-align: left;\" |\"The Beginning of the End\"\n|Erik Burnham\n| Josh Burcham\n| Josh Burcham\n|May 25, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |The Maximals and Predacons decide to join forces to fight the Vok. They deduce that they come from unspace. However, Tarantulas intends to betray everyone in exchange of siding with the Vok. When Megatron and Dinobot capture him for interrogation, he is then freed by a sparkless Terrorsaur. Tarantulas then plans to use the skywarp device to track down a data packet that Scorponok sent to Cybertron.\n|-\n! colspan=\"6\" style=\"background:#005EB8\" |\n|-\n|#17\n| style=\"text-align: left;\" |\"The End\"\n|Erik Burnham\n| Josh Burcham\n| Josh Burcham\n|June 22, 2022\n|-\n| colspan=\"6\" style=\"text-align: left;\" |In the final battle, with Tarantulas’ help, the Vok recruit every protoform pod that remained in the planet against the Maximals and Predacons. While Tarantulas wants to return to Cybertron and rule it, the Vok have decided to wipe out the planet, even with his Children on it. Nack on the Axalon, Rattrap and Waspinator discover the Vok and beings that came from unspace. The Vok prepare an energon-powered reversion device the Transformers, until Rattrap and Waspinator use the Axalon's transwarp weapons against them, sending the Vok back to unspace. They too do the same thing to Megatron, but sending him to a future era. While Tarantulas escapes, the Children of the Vok remain on the planet, the Maximals flee, and the Predacons attempt to repair the Darksyde. 114 cycles later, in the future era, Megatron begins to make a new plan to continue the Beast Wars.\n|}\nReception\n{| class=\"wikitable\" style=\"text-align: center;\"\n!Issue\n!Publication date\n!Critic rating\n!Critic reviews\n!Ref.\n|-\n|#1\n|February 3, 2021\n|7.8/10\n|10\n|\n|-\n|#2\n|March 3, 2021\n|6.7/10\n|6\n|\n|-\n|#3\n|April 7, 2021\n|7.6/10\n|5\n|\n|-\n|#4\n|May 19, 2021\n|6.0/10\n|2\n|\n|-\n|#5\n|June 30, 2021\n|4.0/10\n|3\n|\n|-\n|#6\n|July 28, 2021\n|7.2/10\n|4\n|\n|-\n|#7\n|August 25, 2021\n|7.0/10\n|3\n|\n|-\n|#8\n|September 22, 2021\n|5.0/10\n|2\n|\n|-\n|#9\n|October 27, 2021\n|7.0/10\n| rowspan=\"2\" |3\n|\n|-\n|#10\n|November 24, 2021\n|7.3/10\n|\n|-\n|#11\n|December 22, 2021\n|7.0/10\n|4\n|\n|-\n|#12\n|January 26, 2022\n|5.0/10\n| rowspan=\"7\" |1\n|\n|-\n|#13\n|March 2, 2022\n|7.0/10\n|\n|-\n|#14\n|April 27, 2022\n|6.0/10\n|\n|-\n|2022 Annual\n|April 20, 2022\n|8.0/10\n|\n|-\n|#15\n|April 27, 2022\n|5.0/10\n|\n|-\n|#16\n|May 25, 2022\n| rowspan=\"2\" |7.0/10\n|\n|-\n|#17\n|June 22, 2022\n|\n|-\n|Overall\n|\n|6.6/10\n|51\n|\n|}\nCollected editions\nTrade paperback\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! Title\n! Material collected\n! Pages\n! Publication date\n! ISBN\n|-\n| align=\"left\" |Transformers: Beast Wars, Volume 1\n|\n* Transformers: Beast Wars #1−6\n| rowspan=\"2\" | 144\n| August 11, 2021\n|\n|-\n| align=\"left\" |Transformers: Beast Wars, Volume 2\n|\n* Transformers: Beast Wars #7−12\n| June 28, 2022\n|\n|-\n| align=\"left\" | Transformers: Beast Wars, Volume 3\n|\n* Transformers: Beast Wars #13–17\n* Transformers: Beast Wars 2022 Annual\n| 128\n| October 4, 2022\n|\n|}\nOther\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! Title\n! Material collected\n! Publication date\n|-\n| align=\"left\" | Transformers: Best of the Beasts\n|\n* Beast Wars: The Gathering #4\n* The Transformers: Windblade (vol. 2) #6\n* Transformers: Beast Wars #9\n| July 13, 2022\n|}\nSee also\n* Transformers: Beast Wars (comics)\nReferences"
    }
  ]
}