{
  "content": [
    {
      "type": "text",
      "text": "# Transformers: War for Cybertron Trilogy\n\n| website     =\n| footnotes   =\n}}\nTransformers: War for Cybertron Trilogy is a toyline and transmedia series that is part of the Transformers franchise by Hasbro announced in February 2018.\nToy-line\nThe toy-line is split into three subline imprints titled \"Siege\", \"Earthrise\", and \"Kingdom\" respectively. All of the designs are based on the Generation 1 and Beast Wars series. Mass retail figures were sold in prices ranging from $5USD to $160USD.\nTelevision series\n| screenplay           =\n| story                = F. J. DeSantoGeorge Krstic\n| director             = Takashi Kamei.}}\n| creative_director    =\n| voices               =\n| narrator             =\n| theme_music_composer =\n| open_theme           =\n| end_theme            =\n| composer             = Alexander Bornstein\n| country              = United StatesJapan\n| language             = English\n| num_seasons          = 3\n| num_episodes         = 18\n| list_episodes        =\n| executive_producer   =\n| producer             =\n| animator             = Polygon Pictures\n| runtime              = 23–25 minutes\n| company              =\n| network              = Netflix\n| first_aired          =\n| last_aired           =\n| related              =\n}}\nProduction\nIn 2019, Hasbro's production studio, Allspark and Netflix announced a new animated series titled the War for Cybertron Trilogy. The series was produced by Rooster Teeth, alongside Allspark Animation and Polygon Pictures. F. J. DeSanto would return as showrunner while George Krstic, Gavin Hignight and Brandon M. Easton joined as writers. The first season was originally set to be released in June 2020, but was rescheduled to July 30, 2020 due to the COVID-19 pandemic. The second season was released on December 30, 2020. The third and final season was released on July 29, 2021.\nPolygon Pictures President and CEO Shuzo John Shiota said \"We're thrilled to be working with Rooster Teeth, Netflix and Hasbro to bring this fan-oriented More than Meets the Eye story to life. The Transformers universe has so many rich characters and engaging stories. Getting the opportunity to be part of the team bringing the robots in disguise to life in this new trilogy is unbelievable.\"\nTom Warner, Senior Vice President for the Transformers franchise for Hasbro, said \"The Transformers brand is a global phenomenon with toys, consumer products, films, television shows, and literature, resonating with millions of passionate fans around the world. This brand new Netflix series will add to the incredible slate of Transformers offerings with a truly unique story that will delight both existing fans and those being introduced to the wonder of robots in disguise.\"\nRooster Teeth co-founder and Chief Content Officer Matt Hullum said \"Transformers: War for Cybertron Trilogy marks the inaugural production for our Rooster Teeth Studios division and we're proud to be partnering with and entrusted by Hasbro and Netflix. As fans of these characters, it's been a joy bringing our storytelling and animation expertise to this project. This teaser trailer is just a taste of what's to come in this series, and we can't wait to see what the fans think, especially our Rooster Teeth community!\". |country=U.S. |episodes=\n|ShortSummary    = After the crash-landing at different locations, the Autobots and the Decepticons encounter the planet's denizens and are shocked to learn who they are.\n|LineColor       = 3CB043\n}}\n|ShortSummary    = Megatron acquires an advantage in locating the Allspark. The Maximals mount a rescue when the Predacons capture one of their teammates.\n|LineColor       = 3CB043\n}}\n|ShortSummary    = As the Autobots and Decepticons close in on it, the Allspark launches a defense system that alters perception and disrupts all functionality.\n|LineColor       = 3CB043\n}}\n|ShortSummary    = Megatron's continued use of the Golden Disk to guide his actions threatens to derail Optimus Prime's attempt to obtain the Allspark.\n|LineColor       = 3CB043\n}}\n|ShortSummary    = The Autobots and the Maximals attempt to launch the Ark to return to Cybertron. They meet heavy resistance — until something extraordinary occurs.\n|LineColor       = 3CB043\n}}\n|ShortSummary    = The past, present and future collide on Cybertron as the final showdown for the Allspark begins with some unexpected participants.\n|LineColor       = 3CB043\n}}\n}}\nReception\nOn Rotten Tomatoes, the first season, Siege, has an approval rating of 95% based on reviews from 20 critics. The site's consensus is: \"Visually stunning, surprisingly deep, and still a lot of fun, War for Cybertron: Siege breathes new life into the Transformers franchise.\" The second season, Earthrise, has an approval rating of 86% based on reviews from 7 critics. The third season, Kingdom, has an approval rating of 90% based on reviews from 10 critics. The site's consensus is: \"Transporting the Autobots into a strange new world, Kingdom brings the War for Cybertron to a satisfying close with great morphing action and a delightful nod to the Beast Wars.\"\nFans criticized Netflix for not having the likes of Peter Cullen, Frank Welker or voice actors that were involved with the franchise previously and instead hired \"non-union voice talent\".\nNotes\nReferences\n}}\nExternal links\n* [https://tfwiki.net/wiki/War_for_Cybertron_Trilogy Transformers: War for Cybertron Trilogy] on Transformers Wiki\n*"
    }
  ]
}