{
  "content": [
    {
      "type": "text",
      "text": "# Transgender history in the United Kingdom\n\nThis article addresses the history of transgender people in the United Kingdom since its initial formation in 1707. Transgender people have been recognised in the UK by varying titles and cultural gender indicators, such as dress, and people living differently from their sex have contributed to various aspects of the history and culture of the country. Advances in medicine, social and biological sciences and transgender activism have all influenced transgender life in the UK today.\nBackground\nTransgender History in what became the United Kingdom is complex and does not always conform to the same modern or medical definitions, but could be said to have begun with Roman Britain when transgender people are known to have been engaged in the worship of Cybele as Galli. Thereafter, Anglo Saxon Society continued its persecution of transgender or gender non-conforming peoples, referring to them as bæddel or bædling. Some authors have also begun to question the possible roles of transgender people like the 10th century Birka of Viking persons. The Roman Catholic Church played a role in persecuting LGBT groups from the 12th century onwards (see Council of London in 1102), including more recently with Pope Benedict XVI condemning the contents of the Equality Act 2010 and his state visit to the UK being opposed by members of the British transgender community in response.\nDuring the early medieval period, whilst gender roles were strictly defined, some people such as John/Eleanor Rykener prove that gender non-conformity was present in Britain. At the time, the term hermaphrodite or less frequently androgyny was used to refer to transgender, non-binary and queer peoples during the medieval Early Modern English period. Medieval Welsh and French literature such as the Mabinogion mentions the story of Gilfaethwy and Gwydion, and Le Roman de Silence which also contain Transgender themes, but often perpetuate the idea of gender conformity and only returning to one's sex assignment at birth.\nDuring the Elizabethan and Stuart era, roles for transgender people were limited, but were reflected somewhat in genderfluid roles in theatre. This became suppressed during the rise of Oliver Cromwell, but returned with the Glorious Revolution (see the Arts section).\nAt the time of the formation of the United Kingdom, a number of male identifying transgender people, such as Charles Hamilton, began to be identified as 'female husbands'. This neologist phrase was penned by Henry Fielding for his 1746 play 'Female Husband'. Increased awareness and language about the condition eventually led to the term 'Transgender' and Gender Dysphoria being coined in the 20th century, with continued activism leading to greater visibility and public awareness of issues faced by the Trans community in the present day. In 1909, a deserter from the Seaforth Highlanders was on trial in Bradford for fraud and desertion, however May Wilson (formerly Clement Mitchell) had been \"living as a woman\" since she left the regiment.\nLabels\nMany outdated labels include transvestite (1910 by Magnus Hirschfeld), transsexual (1949) and hermaphrodite. New terminology only began to be introduced into the English language with the emergence of more visible transgender activism in the early 20th century, with terminology initially being adopted in from Germany by gay and transgender writers like Edward Carpenter and Thomas Baty from the work of Karl Ulrich's Uranian theories, and the term transgender coined in 1965, shortened to 'trans' in 1996. Other terms such as androgyne were first used in English in 1552.\nIn the arts\nPerhaps deriving from the patriarchal nature of its society, British theatre has often played with notions of sexuality and gender. Early examples such as the portrayals found in 17th-century plays like William Shakespeare's Cymbeline (1611) in the character of Imogen, and Thomas Randolph's Amyntas (1630), portray supernatural and comic tropes and show how gender and sex was seen and understood as fluctuating ideas. Other literary traditions such as science fiction also enabled British writers to engage and ask questions regarding the role of gender and class (such as  The Blazing World) merged in British culture and contemporary society, as well as female-to-male crossdressers were frequently portrayed as heroines in English literature. Later throughout the 17th until the 20th centuries further theatrical roles such as the Restoration Rake, later Macaroni, Grand Dame (found in Pantomime) and the \"drag artists performing in camp and shipboard theatricals ... during the Great War\" explored and gave acceptable boundaries for queer people living in a cis-heteronormative environment.\nCrossdressing in silent films began when Charlie Chaplin and Stan Laurel took the tradition of female impersonation in the English music halls when they went to North America in 1910. In the early 20th century, writers (most famously Virginia Woolf) began to engage with new ideas of sexuality and gender identity. In 21st-century retellings, reworking and reappraisal in queer theory of old folklore and mythology such as Tam Lin and Hervor, plays such as As You Like It and works of science fiction have also been popular as an emerging form of trans literature.\nTimeline of transgender events\nin transition]]\n* - In Cataractonium in North Yorkshire, a grave of the transgender woman 'Gallus' was located, who transitioned into womanhood to serve as a priestess to the Goddess Cybele in the 3rd century CE.\n*1656 - Thomas Blount's Glossographia is published, which defined the term transfeminate as \"to turn from woman to man, or from one sex to another\". Subsequent dictionaries also repeated this definition for over two centuries.\n*1885 - The Criminal Law Amendment Act 1885, that applied in all parts of the UK, was passed into law: the Act included provisions that made transgender people more susceptible to prison time.\n*1889 - Mary Mudge (1814–1889) dies at a workhouse having passed as a woman. Mudge's birth sex was discovered upon postmortem examination.\n*1909 - Thomas Baty publishes Beatrice the Sixteenth, a science fiction utopian novel set in a postgender society and begins working with other lesbian writers on the feminist journal Urania (1916–1940).\n*1928 - Virginia Woolf writes Orlando\n*1933 - Lili Elbe's book Man into Woman detailing her transition journey to female is published in England.\n*1936 - Mark Weston transitions from female to male.\n*1945 - Michael Dillon underwent phalloplasty, concealed as treatment for malformation of the urethra (hypospadias) rather than reveal the nature of the surgery as gender reassignment surgery.\n*1946 - Dillon publishes Self: A Study in Ethics and Endocrinology.\n*1951 - Roberta Cowell, a former fighter pilot in World War II, undergoes male-to-female confirmation surgery on 16 May; she is the first known trans woman to have undergone gender-affirming surgery the UK.\n*1955 - Activist Stephen Whittle is born.\n*1959 - John Randell (1918–1982) enters into association with urologist Peter Phillip at Charing Cross, publishing in 1960 perhaps the first higher degree thesis in the world on transgenderism (\"transvestism\") Cross Dressing and the Desire to Change Sex at the University of Wales having operated on around 41–50 individuals by 1959.\n*1966 - Randell opens the pioneering Charing Cross gender clinic in London, and his colleague Harry Benjamin publishes The Transsexual Phenomenon.\n*25–27 July 1969 - The First International Symposium for Gender Identity: Aims, Functions and Clinical Problems of a Gender Identity Unit, took place at The Piccadilly Hotel in London.\n*1970 - In the case between April Ashley and Arthur Cameron Corbett, their marriage was annulled on the basis that Ashley, a transsexual woman, was a man under then-current British law, setting a legal precedent for trans people in Britain, so that the birth certificates of transsexual and intersex people could not be changed.\n* April 1972 - 26-year-old Seychelles-born cross-dresser Maxwell Confait is murdered in London, England.\n*1972 - The release of the drama I Want What I Want showing an early portrayal of a trans character.\n*1973 - In late 1973, Carol Steele and another transsexual woman (Linda B.) formed the Manchester TV/TS Group (a group for \"transvestites and transsexuals\").\n*1974 - The First National TV/TS (Transvestite/Transsexual Conference) is held in Leeds. The journalist Jan Morris also publishes Conundrum, a personal account of her transition. Caroline Cossey also undergoes reassignment surgery, going on to act in the 1981 Bond film For Your Eyes Only.\n*1980 - Julia Grant participates in the pioneering British documentary A Change of Sex aired on BBC2, enabling viewers to follow her social and medical transition; also providing a snapshot of the Gender Identity Clinic at Charing Cross Hospital in London. The Self Help Association for Transsexuals (SHAFT) was then formed as an information collecting and disseminating body for trans-people. The association later became known as the 'Gender Dysphoria Trust International' (GDTI).\n*1986 - Sonia Burgess in Rees v. the United Kingdom (1986), represented Mark Rees, a British trans man who asked the government to amend his birth certificate to allow him to marry a woman. Burgess and Rees's barrister, Nick Blake, argued unsuccessfully that English law violated the European Convention on Human Rights Article 8 (right to respect for private and family life) and Article 12 (right to marry) in its treatment of transgender people.\n*1989 - The Tavistock Clinic established GIDS, the first and only service of its kind in the UK for young people with gender dysphoria.\n*1993 - Christine Burns and Whittle begin working with Press for Change.\n*1995 - The charity Mermaids is founded.\n*1998 – The fictional character Hayley Patterson is introduced in Coronation Street, played by Julie Hesmondhalgh.\n*2001 - Lauren Harries undergoes gender reassignment and goes on to star in many British television shows and the International Transgender Conference is held at the University of East Anglia continuing as a biennial event.\n*2004 - The Gender Recognition Act 2004 is passed by the Labour Government. The Act gives transsexual people legal recognition as members of the sex appropriate to their gender identity allowing them to acquire a new birth certificate, affording them full recognition of their acquired sex in law for all purposes, including marriage.\n*2005 - Rachel Mann is ordained as deacon in the Anglican Church\n*2007 - Lewis Turner and Stephen Whittle publish ''Engendered Penalties Transsexual and Transgender People's Experience of Inequality and Discrimination (Equalities Review) which is instrumental in ensuring the inclusion of trans people in the remit of the new Commission for Equalities and Human Rights. In the same year Kele Telesford is found strangled in her home. Jenny Bailey is also elected mayor of Cambridge.\n*2011 - Paris Lees begins writing for The Guardian as a journalist.\n*2012 - Jackie Green, a transgender beauty queen, became the youngest person in the world to have gender reassignment surgery, having had treatment at the age of 12 to prevent the onset of puberty. She was subsequently the first trans person to enter the Miss England beauty contest.\n*2013 - Nikki Sinclaire becomes the first openly transgender member of the European Parliament for the UK delegation.\n*2014 - Second Trans Pride Brighton includes the first trans pride march in Europe.\n*May 2014 - Hollyoaks reveals the character Blessing Chambers played by Modupe Adeyeye to be transgender.\n*2015 - Church of England Reverend Chris Newlands, vicar of Lancaster Priory, was approached by a young transgender person who wished to be \"re-baptised\" in their new identity. The vicar created a new service as \"an affirmation of baptismal vows where we could introduce him to God with his new name and his new identity.\" The Danish Girl is also released.\n*September 2016 - Hari Nef becomes the first transgender person to cover any British fashion magazine, Elle''.\n*2017 - Philippa York outed herself becoming the first professional cyclist to have publicly transitioned.\n*2018 - Shon Faye presented at Amnesty International's Women Making History event, where she gave a speech calling to \"re-centre\" underprivileged trans women.\n*2019 - Laverne Cox becomes the first transgender model on the cover of British Vogue.\n*2019 - Study by Paul Baker, a professor at Lancaster University, found that of over 6,000 articles written in the UK press from 2018 to 2019, numerous were written \"in order to be critical of trans people\" and cast \"trans people as unreasonable and aggressive\".\n*2020 - Isla Bryson is jailed for rape committed prior to transitioning, causing controversy when initially placed in a women's prison.\n* February 2023 - Brianna Ghey, a female 16-year-old British transgender teenager is murdered in Cheshire, England. The judge sentencing the killers ruled that transphobia was a motive in the murder.\n* In October 2023, it was reported that hate crimes against transgender people in England and Wales had risen 11%, which represented 4,732 offences in the last year.\n* The 2025 Supreme Court ruling in For Women Scotland Ltd v The Scottish Ministers determined that having a gender recognition certificate did not change a person's sex for the purposes of the 2010 Equality Act.\nNon-binary\nNon-binary people as a group have long existed in the UK, however recorded instance of Non-binary people are scarce due to misconceptions and conflation around gender and sex, and erasure in the written record over time. Non-binary people still suffer from the lingering effects of transphobia and lingering effects of systematic racism under British colonisation.\nCross-dressing is noted to have occurred in British society from the 14th century on. In 1394, John/Eleanor Rykener a prostitute working mainly in London (near Cheapside), but also active in Oxford, was arrested for cross-dressing and interrogated. In 1685, Arabella Hunt divorced her 'husband' Amy Poulter on the grounds that their marriage as two women is not recognised under the law, however initially complaining that Poulter was a hermaphrodite. In 1732, 'Princess Seraphina' (noted as the first drag queen in England) charged Tom Gordon with stealing his crossdresser clothing. In 1812, surgeon James Miranda Barry was found to be biologically female on examination at death and the infamous Boulton and Park case in 1870 took place under heightened Victorian societal legal and moral pressure on transgender peoples, both being acquitted in 1871.\nIn the early 20th century, gender nonconforming or third gender ideas begin to become widespread and accepted between the 1920–1940s. In the 1960s and 1970s, designers like Michael Fish began to promote androgynous fashion, which were made popular by musicians such as Mick Jagger, David Bowie and Freddie Mercury. As the 1980s progressed, the acceptability of gendered clothing began to break down (such as Annie Lennox) and by the 21st century the gender spectrum had begun to become mainstream in fashion with unisex clothing becoming popular.\nTimeline of non gender-conforming events\n*1584 - Mary Ambree, popularised in the ballads of the 1760s, is noted for cross-dressing to join the navy\n*1610 - The Roaring Girl based on Mary Frith is staged\n*1666 - The proto-science-fiction novel The Blazing World is published by Duchess Cavendish, a quasibeast fable which discusses gender roles in 17th-century Britain using contemporary science and mixing these with animal-genders such as bird-men\n*1693 - Christian Davies joins the British Army\n*1700 - Susanna Centlivre begins playing breeches roles\n*1701 - Edward Hyde, 3rd Earl of Clarendon becomes the governor of Jersey in the American colonies. Opening the post, he dressed as a woman as \"in this place and this time I represent a woman and ought in all respects to represent her as faithfully as I can.\"\n*1740 - Ann Mills fights for the British in the War of the Austrian Succession on board the frigate Maidenstone\n*1745 - Hannah Snell and Phoebe Hessel both join the British Army\n*1746 - Mary Hamilton is active in Somerset\n*1752 - The Public Universal Friend is born in the British Colonies\n*1763–1785 - Chevalier d'Éon was said to have passed for a woman amongst British nobility and who was active in London in 1785\n*1780 - Elizabeth Inchbald appears in a breeches role\n*1782 - Dorothea Jordan flees to Leeds and begins playing boys and men roles in theatrical productions\n*1792 - Mary Anne Talbot begins life as a male naval worker, eventually fighting in the French Revolutionary Wars\n*1812 - James Miranda Barry dies and their biological sex revealed\n*1820 - Lucia Elizabeth Vestris begins performing as a man in London operas\n*1825 - Mary Anne Keeley appears in London opera after being noticed by Elizabeth Cobbold\n*1833 - The Irish actress Eliza Edmunds (c. 1790–1833) dies of alcohol poisoning and upon autopsy is found to be female presenting\n*1834 - The outlaw 'Catherine Coombes' was born, passing as a woman for 40 years.\n*1836 - Sarah Fairbrother plays Abdullah in Open Sesame\n*1839–1843 - The Rebecca Riots take place, with many leaders of the movement living or dressed in female clothing.\n*1868 - Nellie Farren began performing as principal boy in London\n*1874 - Vesta Tilley performs her first billing in London, going on to become one of the highest-paid women in acting by the 1890s\n*1877 - Marie Loftus was a Glaswegian known as the Sarah Bernhardt of music hall, and known for busty female to male costumes\n*1888 - Florence St. John begins playing female to male opera roles in the Gaiety Theatre, popularising the roles in Victorian burlesque\n*1893 - Ada Blanche stars in the titular role of the musical adaptation of Robinson Crusoe\n*1898 - Queenie Leighton begins performing in drag or female to male stage roles, which became further popular in the Edwardian period.\n*1901 - Andrew Lang publishes \"The Girl Who Pretended to Be a Boy\" in The Violet Fairy Book this year\n*1904 - Nina Boucicault begins the tradition of cross-dressing female to male when playing Peter Pan\n*1905 - Paul Downing, better known as Caroline Brogden, was found searching for their wife\n*1906 - Gwen Lally begins performing in London, and the duo Dorothy Ward and Shaun Glenville begin with Ward as principal boy playing Prince Charming\n*1907 - Mabel Batten gave Radclyffe Hall the name 'John' after a resemblance to a member of her family which she continued to use with 'masculine' clothing for the rest of her life\n*1913 - Austin Osman Spare writes The Book of Pleasure, which makes reference to morphing into the opposite and other sexes devolved from the ego\n*1914 - Dorothy Lawrence begins duty in WW I\n*1920 - Havelock Ellis coins the archaic neologism eonism\n*1929 - William Sidney Holtom (1886-?) was outed by the News of the World as a \"Man-woman\" who had successfully passed as male from 1914 to 1929\n*1937 - Hy Hazell begins performing in London, known for her principal boy roles\n*1966 - The Beaumont Society was established as a support group for male-to-female cross-dressers, with its namesake from the androgynous Frenchman Chevalier d'Éon.\n*1975 - Genesis P-Orridge, the 'Godparent of Industrial Music', founds the band Throbbing Gristle\n*1979 - The Twyborn Affair is published by Patrick White discussing topics on gender and London\n*1994 - Eddie Izzard relates in Unrepeatable to her relation to her genderfluid identity\n*2006 - La Roux is formed by Elly Jackson\n*2009 - Richard O'Brien describes themselves as the 'third-sex'\n*2015 - Eliot Sumner begins using non-gendered pronouns\n*October 2015 - Jack Monroe comes out as non-binary\n*October 2017 - Sam Smith describes themselves as non-binary\n*2018 - Cara Delevingne identifies herself as genderfluid\n*2020 - Kae Tempest identifies himself as non-binary, later coming out as a trans man\nFile:Mary Ambree.jpg|Mary Ambree (1584)\nFile:The Roaring Girle, or Moll Cut-Purse (1611) detail.jpg|Mary Frith (Early 17th century)\nFile:Portrait of a Lady, Possibly Edward Hyde, Lord Cornbury in a Dress - Dallas Museum of Art.jpg|Earl of Clarendon (1705–1750)\nFile:HannahSnell.jpg|Hannah Snell (1750)\nFile:Mary Anne Talbot 1804 engraving.jpg|Mary Anne Talbot (1804)\nFile:RebeccaRiots.gif|Rebecca Riots (1843)\nFile:Park and Boulton (Fanny and Stella) restored.jpg|Park and Boulton (1869)\nFile:BurlingtonBertie.jpg|Vesta Tilley in a Breeches Role (Late 19th century)\nFile:Caroline Brogden.jpg|Caroline Brogden (1905)\nFile:Charles Buchel - Radclyffe Hall.jpg|Radclyffe Hall (1918)\nFile:Ian Hunter 2 - Mott The Hoople - 1973.jpg|Ian Hunter (1973)\nFile:Boy George F1-200-03.jpg|Boy George (1988)\nFile:La Roux Eleanor Elly Jackson.jpg|La Roux (2010)\nIntersex\nUrania]]\nIntersex peoples have a long history in Britain, with early history particularly in Wales, often falling under the Greek notion of androgyny derived from Ancient Greek and Roman ideals inherently found in the creation myths such as Aphrodite. An early English colonial subject of the American colonies to challenge binary gender roles was Thomas(ine) Hall, a servant who, in the 1620s, alternately dressed in both men's and women's clothing. Hall is likely to have been intersex as they were ordered by the Virginia court to wear both men's breeches and a woman's apron and cap simultaneously by John Pott. However other examples such as Mary Henly, a female-assigned individual in Massachusetts, was charged with illegally wearing men's clothing in 1692, as her wearing an opposing gender marker was \"seeming to confound the course of nature.\"\nDuring the Victorian era, medical authors introduced the terms \"true hermaphrodite\" for an individual who has both ovarian and testicular tissue, verified under a microscope, \"male pseudo-hermaphrodite\" for a person with testicular tissue, but either female or ambiguous sexual anatomy, and \"female pseudo-hermaphrodite\" for a person with ovarian tissue, but either male or ambiguous sexual anatomy. In 1915 The terms 'intersex' for the individual and 'intersexuality' for the phenomenon were coined in the German language by endocrinologist Richard Goldschmidt after studies on gypsy moths. One year later, Goldschmidt used the term to describe pseudohermaphroditism in humans, and in 1932 in Germany, the first intersex surgery to female is carried out. Surgeries in the UK for intersex people were undertaken at Charing Cross Hospital at this time. With the introduction of new writing on the topic, the topic of Intersex peoples began to introduced into the academic circles in the UK in the 1940s to 1960s when a more prevailing notion of tolerance began to take root.\nTimeline of intersex events\n*940 - Hywel the Good's laws include a definition on the rights of 'hermaphrodites'.\n*1100s - The Decretum Gratiani, a canon law collection states that \"Whether an hermaphrodite may witness a testament, depends on which sex prevails\".\n*1188 - Gerald of Wales in Topography of Ireland stated \"Also, within our time, a woman was seen attending the court in Connaught, who partook of the nature of both sexes, and was a hermaphrodite.\"\n*1235 - Henry de Bracton's De Legibus et Consuetudinibus Angliae (On the Laws and Customs of England) classified mankind as \"male, female, or hermaphrodite\" and noted a \"hermaphrodite is classed with male or female according to the predominance of the sexual organs\".\n*1300 - The Hereford Mappa Mundi includes a depiction of a 'hermaphrodite', placed outside the borders of the world known to its makers.\n*1614 - Bartholomew Fair shows Dionysus engaging in contemporary gender discussion\n*1644 - English jurist and judge Sir Edward Coke wrote in his Institutes of the Lawes of England (1628–1644) on laws of succession: \"Every heire is either a male, a female, or an hermaphrodite, that is both male and female. And an hermaphrodite (which is also called Androgynus) shall be heire, either as male or female, according to that kind of sexe which doth prevaile.\" The Institutes are widely held to be a foundation of common law.\n*1792 - Anglo-Welsh philologist William Jones published an English translation of Al Sirájiyyah: The Mohammedan Law of Inheritance which detailed inheritance rights for people described as hermaphrodites in Islam.\n*1839 - James Young Simpson publishes an article on people described as having 'hermaphroditism'\n*1888–1903 - The British Gynecological Society consisting of John Halliday Croom, Lawson Tait and Robert Barnes begin to diagnose people described as having 'hermaphroditism'.\n*1906 - The Cambrian newspaper in Wales published an article on the death in Cardiff of an intersex child who, at post-mortem examination, was determined to be a girl.\n*1933 - Lennox Broster joins the Charing Cross Hospital hospital, and begins operating on intersex patients\n*1943 - The first suggestion to replace the term hermaphrodite with intersex, in medicine, came from British physician Alexander Polycleitos Cawadias in 1943. This was taken up by other physicians in the United Kingdom during the 1960s.\n*1960 - Georgina Somerset, the first openly intersex person, receives another birth certificate designating her as female sex.\n*1968 - Sir Ewan Forbes, 11th Baronet succeeds the Baronetcy as a man having been assigned as female at birth, and Dawn Langley Simmons after sex reassignment surgery in 1968 wed in the first legal interracial marriage in South Carolina.\nBritish trans people\n*Steven Appleby\n*M. J. Bassett\n*Munroe Bergdorf\n*Isla Bryson\n*Elie Che\n*Sophie Cook\n*Charlie Craggs\n*Juno Dawson\n*Noahfinnce\n*Yasmin Finney\n*Jake Graf\n*Stephanie Hirst\n*Jay Hulme\n*Eddie Izzard\n*Juliet Jacques\n*Roz Kaveney\n*Paris Lees\n*Charlotte McDonnell\n*Ash Palmisciano\n*Erica Rutherford\n*Tiffany Scott\n*Abigail Thorn\n*Karen White\nSee also\n*21st-century anti-trans movement in the United Kingdom\n*Androgyny\n*British people\n*English Renaissance theatre\n*Gender identity\n*Gender\n*Hermaphroditus\n*History of cross-dressing\n*History of violence against LGBT people in the United Kingdom\n*Intersex people in history\n*LGBTQ rights in the United Kingdom\n*Press for Change\n*Sex and gender distinction\n*Timeline of LGBT history in the United Kingdom\n*Transgender history\n*Transgender rights in the United Kingdom\n*Victorian burlesque\nReferences\nExternal links"
    }
  ]
}