{
  "content": [
    {
      "type": "text",
      "text": "# Travis Ward\n\n}}\n| birth_place = Jacksonville, TX, U.S.\n| education  = Louisiana State University\n| death_date =\n| occupation  = American Businessman\n| spouse      = Phyllis Ward\n| nickname    = Blacky\n| website     =\n| footnotes   =\n}}\nTravis Ward (January 29, 1922 – November 12, 2015) was an independent Texas oil man.\nEarly life\nWard was born in Jacksonville, Texas.  He grew up in East Texas.  He was the youngest of twelve children.  His mother died when he was four.\nUnited States Air Force\nShortly after Pearl Harbor, Ward volunteered to join the United States Army Air Corps and was commissioned a lieutenant and trained other aviators to fly P-47 and P-51 fighters.  Ward continued his flying after an honorable discharge from the army following the Second World War.\nEducation and Family\nTravis Ward graduated from Louisiana State University with a degree in Petroleum Engineering. In 1943, Ward married Martha Smith. Martha's brother Jerry Wayne Smith, died in a plane crash in Mt Pleasant, Texas on March 3, 1967. He was married to Nora Ellen Smith (1955–1967) and left four children: Eddie, Deborah, Jerry and Beverly. Wayne was partners with Ward in Mobil Well Service along with Arvil Harris and Jim Bob Padgett established in 1953. Ward had four children with Martha: Randy, John, Michael and Debra. Multi-millionaire son Michael is the owner of Double Diamond Resorts located in Dallas, Texas.  Ward and Martha divorced in 1980. Travis Ward then married Phyllis Townsend of Winona, Mississippi to whom he has been married for twenty-seven years.\nBusiness Background\nWard has spent most of his career developing oil and gas reserves around the world.  His many companies include Travis Ward Enterprises, World Wide Exploration, Ward Energy, Inc., Ward Petroleum, Double Diamond Petroleum, Inc., Palestine Well Service Company  and Pan American Sales Corporation. He is credited with drilling the \"discovery well\" in the Fairway James Lime field in east Texas. Each month, Travis Ward placed the proceeds from the minerals from the so-called Tract 548 into the trusts he created for his adult children.\nGulf War\nFollowing the first Gulf War, Ward volunteered to assist in putting out the fires set by Saddam Hussein in the Kuwait oil fields and travelled to the oil fields on two different occasions to render his assistance.\nLawsuit\nIn 1972, Ward and his then wife Martha created trusts for their four children which Ward continued to fund thereafter. In 2009, Ward's son Michael sued him and several of the trustees for mismanagement that supposedly occurred in the 1970s, 1980s and early 1990s. The courts ruled in favor of the Beneficiaries of the trust and against Travis Ward in a final order issued in October 2015. Ward counter-sued based upon an oral agreement entered into with his son in 1977 whereby, in exchange for Travis Ward making his extensive banking contacts available to his son, Michael gave his father a 40% interest in Michael's future income.\nThe claim by Travis was refuted by Michael and the case never went forward. The original filing claimed 50% and there was only mention of a distribution after years of the ongoing suite. Travis Ward testified he intended to put any monies received into the children's trust. Michael denies the existence of this agreement with his father.\nReferences"
    }
  ]
}