{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Tingmosgang\n\n| location_signed         = Tingmosgang, Ladakh\n| mediators               = Mee-pham-wang-po\n| negotiators             =\n| original_signatories    =\n| signatories             =\n| parties                 =\n| languages               =\n| footnotes               =\n}}\nThe Treaty of Tingmosgang (), also known as the Treaty of Temisgam, was a tripartite peace agreement signed in 1684 between the Kingdom of Ladakh and the Ganden Phodrang of Tibet, with the support of the Qing dynasty, at the end of the Tibet–Ladakh–Mughal war. The original text of the Treaty of Tingmosgang no longer survives, but its contents are summarized in the Ladakh Chronicles. The treaty contained clauses that established diplomatic relations, delineated borders, and regulated trade between Ladakh and Tibet.\nBackground\nThe origins of the conflict between Ladakh and Tibet date back to the mid-17th century. Ladakh, a kingdom nestled in the Himalayas, was strategically located along key trade routes connecting Tibet, Central Asia, and the Indian subcontinent. During the reign of king Sengge Namgyal (r. 1616–1642), Ladakh had expanded its territories, leading to tensions with Tibet. These tensions were further heightened by religious differences, as Ladakh followed Tibetan Buddhism, but the ruling Gelug school of Tibet sought dominance over other Tibetan Buddhist sects, which Ladakh supported.\nIn 1679, the 5th Dalai Lama's regent, Desi Sangye Gyatso, sent Tibetan forces to invade Ladakh. This led to the Tibet–Ladakh–Mughal War (1679–1684), during which the Tibetan forces occupied Leh and laid siege to Basgo. Ladakh, under king Delek Namgyal, sought assistance from the Mughal Empire. The combined forces then defeated the Tibetan army in 1683 causing the latter to withdraw to Tashigang.\nNegotiations\nAccording to the Ladakh Chronicles, Prime Minister Desi Sangye Gyatso of Tibet and the King Delek Namgyal of Ladakh agreed on the 'Treaty of Tingmosgang in the fortress of Tingmosgang at the conclusion of the Tibet–Ladakh–Mughal War in 1684.\nThe treaty was mediated by the Qing dynasty of China, which was interested in maintaining stability along its western borders and ensuring Tibetan allegiance. The terms of the treaty were written in both Classical Tibetan and Ladakhi languages, with Qing mediation confirming the final agreement.\nText\nThe original text of the Treaty of Tingmosgang no longer survives, but its contents are summarized in the Ladakh Chronicles.\nAn English translation of the summary reads:\n}}\nTerms\nThe summary of the treaty contained in the Ladakh Chronicles includes six main clauses:\n#A general declaration of principle that the region of Ngari Khorsum was divided into three separate kingdoms in the 10th century;\n#The Tibetan recognition of the independence of Ladakh and the obligation on the King of Ladakh from inviting foreign armies into his kingdom;\n#The regulation of trade of goat-wool, subdivided into two subclauses, for Guge and the northern plain of Tibet (Changthang);\n#A clause fixing the Ladakh–Tibet frontier at the Lhari stream at Demchok, but granting Ladakh an enclave at Menser;\n#Another clause regulating Ladakh–Tibet trade;\n#The arrangement of a fee to the Drukpa lama ''Mi-'pham dBaṅ-po'' for his cost in mediating the treaty.\nBorder delineation\nThe treaty defined the boundary between Ladakh and Tibet. The border was to be respected by both sides, ensuring peace and stability in the region. Historian Alastair Lamb described the border delineation from the treaty as imprecise, writing that there are \"no means of determining exactly what line of frontier was contemplated in 1684\" and that it is \"singularly deficient in precise geographical detail\".\nTrade regulations\nThe trade regulations provided for Ladakh's exclusive right to trade in pashmina wool produced in Tibet, in exchange for brick-tea from Ladakh. Ladakh was also bound to send periodic missions to Lhasa carrying presents for the Dalai Lama. The treaty allowed for continued trade between Ladakh, Tibet, and surrounding regions, including Kashmir and Central Asia. Ladakh was a critical point along the Silk Road, and the agreement secured Ladakh's position as a trade intermediary, bringing prosperity to the region.\nTributary status\nLadakh agreed to pay tribute to Tibet in the form of annual offerings, which symbolized Ladakh's subordination to Tibet. However, Ladakh retained significant autonomy in internal matters, including its governance and religious affairs.\nBuddhist Relations\nThe treaty reaffirmed Ladakh’s right to practice and promote its Tibetan Buddhist traditions, while recognizing the influence of the Gelug school of Tibetan Buddhism. This ensured that Ladakh would not face religious persecution or forced conversions to the Gelugpa sect.\nAftermath\nThe fee in the sixth clause was later paid by Desi Sangye Gyatso to Mi-'pham dBaii-po in the form of three estates in Tibet sometime between the autumn of 1684 and 1685.\nThe Treaty of Tingmosgang had a lasting influence on the geopolitics of the Himalayan region. It helped stabilize the relationship between Ladakh and Tibet for over a century and contributed to regional peace.\nReferences\nBibliography\n*\n* }}\n*\n*\n*\nFurther reading\n*\n*\n*"
    }
  ]
}