{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Accession 1979\n\nTreaty of Accession 1979\n|liststyle = text-align:center;\n| Treaty between the Kingdom of Belgium, the Kingdom of Denmark, the Federal Republic of Germany, the French Republic, Ireland, the Italian Republic, the Grand Duchy of Luxembourg, the Kingdom of the Netherlands, the United Kingdom of Great Britain and Northern Ireland (Member States of the European Communities) and the Hellenic Republic concerning the accession of the Hellenic Republic to the European Economic Community and to the European Atomic Energy Community.\n}}\n| image               = EC10-1981 European Community map enlargement.svg\n| image_width         = 300\n| caption             =Countries involved in the treaty, with newly joining countries in yellow and existing EC countries in blue.\n| type                =\n| date_drafted        =\n| date_signed         = 28 May 1979\n| location_signed     = Athens, Greece\n| date_sealed         =\n| date_effective      = 1 January 1981\n| condition_effective = Ratification by Greece and all 9 Member States of the European Communities\n| date_expiration     =\n| signatories         =  European Communities (9 members)|}}\n| ratifiers           =\n| depositor           =Government of the Italian Republic\n| language            =\n| languages           =All 7 official Languages of the European Communities and Greek\n| website             =\n| wikisource          =\n}}\nThe Treaty of Accession 1979 was the agreement between the European Communities and Greece, concerning this country's accession into the EC. It entered into force on 1 January 1981. The Treaty arranged accession of Greece to the EC and amended earlier treaties of the European Communities. As such it is an integral part of the constitutional basis of the European Union.\nFull title\nThe full official name of the treaty is:\nSee also\n*1981 enlargement of the European Communities\n*Enlargement of the European Union\nReferences"
    }
  ]
}