{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Leake\n\nThe Treaty of  Leake was an agreement between the \"Middle Party\", including courtier adherents of Edward II of England, and the king's cousin, the Earl Thomas of Lancaster and his followers. It was signed at Leake in Nottinghamshire on 9 August 1318. The treaty was meant to reconcile the King and his favourites with Lancaster and other baronial opponents. Central to the negotiations were Aymer de Valence, Earl of Pembroke, Humphrey de Bohun, Earl of Hereford and various prelates.\nThe negotiations opened with a parley at Leicester between the leaders of the \"Middle Party\" and Lancaster or his representatives.\nThe maintenance of the Ordinances of 1311, the basis for reforms during the reign of Edward, was part of the agreement from the first, and the final agreement officially approved them.  The removal of evil counsellors, a constant in pressure for reform from the earliest days of Piers Gaveston's ascendancy, were set aside. Pardon for Lancaster and his friends for all trespasses was extended. A parliament was to be summoned, and, most of all, a council was to be formed, a member of which should be a banneret nominated by Lancaster, who would not otherwise be present. Without the agreement of the council the King was not to exercise authority.\nAt a meeting in the exchequer it was agreed that Lancaster, who had shunned previous parliaments, should be invited to the next as a peer of the realm, \"but without accroaching sovereignty towards the others\", for Lancaster, by far the greatest of the English magnates, assumed for himself what McKisack terms \"a uniquely privileged position vis-à-vis both the king and his fellow-barons.\" The King made a statement at St Paul's Cathedral that he would conform to the Ordinances, make peace with Lancaster, with whom he had been waging all but open war, and rely henceforth on the advice and counsel of his barons. Lancaster insisted that lands alienated by the King should be resumed to their rightful owners  and that evil counsellors be removed, so that he could approach the King with security.\nFive days after signing, the King and Lancaster met to exchange the kiss of peace, and specific letters of pardon were issued to 600 of the Earl's men.\nNotes\nSources\n*\n*\n*"
    }
  ]
}