{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Peace between Austria-Hungary and Finland\n\nThe Treaty of Peace between Austria-Hungary and Finland, also called the Vienna Peace Treaty, was signed in Vienna on 29 May 1918, bringing to an end the state of war that existed between Finland and Austria-Hungary as a result of World War I.\nBackground\nThe Grand Duchy of Finland was a part of the Russian Empire at the time of the Austro-Hungarian declaration of war on Russia on 6 August 1914.\nIn 1917, Russia experienced two revolutions. In the February Revolution, the empire was overthrown and a provisional government established. In the October Revolution, the provisional government was deposed and the Russian Soviet Federative Socialist Republic established.  On 6 December 1917, Finland declared its independence, which Russia recognized on 31 December. Finland nevertheless remained in the same state of war with the Central Powers (Austria-Hungary, Bulgaria, the German Empire and the Ottoman Empire) as it had been when a part of Russia.\nOn 15 December, the Russian government signed an armistice with the Central Powers. On 26 January 1918, a workers' uprising sparked the Finnish Civil War and the establishment of the Finnish Socialist Workers' Republic a few days later. Soviet Russia and the Finnish workers' republic signed a treaty of friendship on 1 March 1918. The armistice with the Central Powers had expired on 18 February, but on 3 March Russia signed the Treaty of Brest-Litovsk and made peace with the Central Powers.\nA Finno-German peace treaty was signed with the government of the conservative Senate of Finland—as opposed to the workers' republic allied with Russia—on 7 March. Germany then sent military assistance to the Finnish government, which defeated the workers' republic by the end of April. A Finno-Bulgarian peace treaty was also signed at Berlin on 21 May 1918.\nTerms\nThe language of the Austro-Hungarian–Finnish peace treaty was German. The signatories were, on the Austro-Hungarian side, Foreign Minister Stephan Burián von Rajecz and Ambassador Kajetan von Mérey, who had been the Austro-Hungarian negotiator for the Treaty of Brest-Litovsk, and, on the Finnish side, Edvard Immanuel Hjelt, who had negotiated the peace treaty with Germany and was envoy and minister plenipotentiary to Germany, and Count Allan Serlachius, interim chargé d'affaires to Norway. The treaty consisted of a mere five articles. Both parties to the treaty waived any claims to costs or damages owing to the war.\nSeveral separate agreements were also signed the same day in Vienna: a \"politico-legal supplementary treaty to the peace treaty\", a commercial convention to regulate the economic relations and a convention \"concerning certain questions of private law\". According to Article 4 of the peace treaty, the treaty governing economic relations would form \"an essential part of this peace treaty\".\nThe German text of the treaty was published in the Neue Freie Presse on 31 May.\nNotes\nReferences"
    }
  ]
}