{
  "content": [
    {
      "type": "text",
      "text": "# Treaty City Titans\n\nTreaty City Titans were an Irish semi-professional rugby league team based in Limerick, Ireland. They played in the Munster Conference of then called 'Irish Elite League' which was the top tier of competition in domestic Rugby league. They played their matches at Tom Clifford Park.\nHistory\nElite League Seasons\nIt was in the first season in 2005, that they won the Elite League winning all of their main eight games along with beating the Carlow Crusaders 24-10 in the Grand Final.\nIn the 2007 season they became champions again. Out of the ten matches played they won eight and drew only twice, both to the Carlow Crusaders. The first match in June, finished at 22 points each and then in August they drew 0-0. In a repeat to last season, the Grand Final was between the Titans and the Crusaders. The Titans won 38-22 at Old Crescent R.F.C.\nIn July 2007 the Sky Sports programme Boots'N'All visited Limerick to record a piece on Rugby League in Ireland. The Titans played a friendly match with their \"A\" team to allow footage to be recorded.\nIn November of that year, for the Ireland Wolfhounds important match over Russia, to allow entry into the 2008 Rugby League World Cup, three Titans players: Michael \"Mike\" Brodie, Billy Treacy and Kevin O'Riordan, were selected in the team. They eventually won 58-18 and clinched a place in the World Cup. The same players were expected to feature in that tournament alongside Irish Super League players.\nThe side won the 2009  Irish Elite League.\n2022 Squad\n|list1b=\n|list1c=\n|list1d=\n|list1e=\n|list1f=\n|list1g=\n|list1h=\n|list1i=\n|list1j=\n|list1k=\n|list1l=\n|list1m=\n|list2a=\n|list2b=\n|list2c=\n|list2d=\n|list2e=\n|list2f=\n|coach=\n|assistant=\n|assistant2=\n}}\nHonours\n* Irish Elite League (8): 2005, 2006, 2007, 2009, 2010, 2011, 2013, 2015\n**Runners-up (2): 2008, 2014\n* Munster League (4): 2011, 2013, 2014, 2015\n**Runners-up (1): 2012\nReferences\nExternal links\n* [https://web.archive.org/web/20110721131505/http://www.rli.ie/ireland/munster.html RLI Munster clubs]"
    }
  ]
}