{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Corbeil (1258)\n\nThe Treaty of Corbeil was an agreement signed on 11 May 1258, in Corbeil (today Corbeil-Essonnes, in the region of Île-de-France) between Louis IX of France and James I of Aragon.\nThe French king, as the heir of Charlemagne, renounced the claims of feudal overlordship over the counties historiographically known as the Hispanic March, that is the part of the March of Gothia which remained within the geographical area known from the 12th century onwards as Catalonia.\nJames I renounced claims to Fenouillet-du-Razès and Peyrepertuse, with the castle of Puilaurens, the castle of Fenouillet, the Castellfisel, the castle of Peyrepertuse and the castle of Quéribus; moreover he renounced his feudal overlordship over Toulouse, Saint Gilles, Quercy, Narbonne, Albi, Carcassonne (part of the County of Toulouse since 1213), Razès, Béziers, Lauragais, Termes and Ménerbes (enfeoffed in 1179 to Roger III of Béziers); to Agde and Nîmes (their viscount was recognized as the feudatory of the counts of Barcelona from 1112), and Rouergue, Millau and Gévaudan (derived from the inheritance of Douce I of Provence). Under his lordship remained the viscounty of Carlat and the lordship of Montpellier with the barony of Aumelas.\nJames I refused to renounce feudal rights over the County of Foix, initially included in the treaty, when he ratified the document on 16 July 1258, on the grounds that it was not under the overlordship of the king of France.\nAccording to this treaty the daughter of James I, Isabella, would marry Philip, son of Louis IX.\nOn 17 July, the Aragonese king renounced his hereditary rights to the County of Provence (then an imperial fief) in favor of Margaret, daughter of his uncle Ramon Berenguer IV, Count of Provence (died in 1245) and wife of the French king.\nThe direct consequence of the treaty was to definitively separate the House of Barcelona from the politics of today's southern France and so, causing the strong cultural and economic ties of the region that became Catalonia with Languedoc to fade progressively. A secondary effect is that it allowed the transfer of Provence to the Capetian House of Anjou, and after extinction of that house, its incorporation into France.\nEditions\n*Joseph de Laborde, Layettes du Trésor des chartes, vol. 3 (Paris: E. Plon, 1875), pp. [https://books.google.com/books?id=NbwYAQAAMAAJ&pg=PA405 405ff.]\nNotes\nFurther reading\n*Engels, Odilo. \"Der Vertrag von Corbeil (1258).\" Gesammelte Aufsätze zur Kulturgeschichte Spaniens 19 (1962): 114–46.\nExternal links\n* [http://libro.uca.edu/worlds/chron.htm The Worlds of Alfonso the Learned and James the Conqueror – Robert I. Burns, S.J., ed.]\n* [http://libro.uca.edu/ck/chron.htm  The Crusader Kingdom of Valencia – Robert Ignatius Burns, S.J.]\n*  [http://histoireduroussillon.free.fr/Histoire/TraiteCorbeil3.php The Corbeil Treaty on the Roussillon History site]"
    }
  ]
}