{
  "content": [
    {
      "type": "text",
      "text": "# Treaty Oak (Jacksonville)\n\n| custodian =\n| felled =\n}}\nThe Treaty Oak is an octopus-like Southern live oak (Quercus virginiana) in Jacksonville, Florida. The tree is estimated to be 250 years old and may be the single oldest living thing in Jacksonville,  predating the founding of the city by Isaiah Hart during the 1820s. It is located in Treaty Oak Park in the Southbank area of Downtown Jacksonville.\nThe name\nThe name's origin is generally believed to be related to local apocryphal stories about peace accords between Native Americans and Spanish or American settlers that were signed under its branches. In the 1930s, the name and history were created by journalist Pat Moran of the Florida Times-Union. In an attempt to rescue the tree from being destroyed by developers, he wrote an article claiming a treaty had been signed at the site by indigenous Floridians and early European settlers and called it the Treaty Oak. Prior to that, the tree was known simply as Giant Oak.\nThe tree\nThe tree has a trunk over 25 feet in circumference, it rises to height of 70 feet, and its crown spreads over 145 feet, with twisting branches that bow to the ground and curl back up. The oak shades a roughly circular area, about 190 feet in diameter.\nIn 1986, JEA began an important preservation program which grows seedlings from Treaty Oak acorns and makes them available through Greenscape for replanting throughout the city.  Since the program was implemented, hundreds of seedlings have been planted, ensuring the legacy of the regal Jacksonville landmark.\nA major project was completed in 1995 to preserve the tree and enhance the park, which was completed through the efforts of the city and private groups and individuals. Cables were installed in the tree to support limbs that threatened to damage the trunk, and a lightning protection system was installed.\nIn 2006, the Jessie Ball duPont Fund awarded $150,000 to the city to cover repairs and renovations to Jessie Ball duPont Park and to maintain and preserve the health of the Treaty Oak, which arborists estimate could live another 400 years.\nJessie Ball duPont Park\nPostcard of Dixieland Park, circa 1909\nThe tree is located in Jessie Ball duPont Park, a  park on the south side of the St. Johns River in downtown Jacksonville. Most of the land surrounding the tree was the location of the Dixieland Amusement Park, which opened in 1907. During that time, the tree was festooned with electric lights and witnessed Babe Ruth playing baseball and John Philip Sousa performing a concert.\nIn the 1930s, the Garden Club of Jacksonville and Pat Moran began efforts to raise awareness and preserve the tree, which was targeted by developers. The land was soon purchased by the Alfred I. duPont Testamentary Trust at the request of Jessie Ball duPont, a garden club member, and was donated to the city of Jacksonville in 1964 with the stipulation that it be used \"only for a public park, one of the purposes of which is to preserve the ancient oak commonly known as the Treaty Oak  for the benefit and enjoyment of the general public\".\nThe city acquired additional property now included in the park, and the preserve was named in honor of Jessie Ball duPont, an ardent philanthropist and part-time Jacksonville resident, after her death in 1970. It is ironic that the smallest nature park in Jacksonville has the largest tree. The park contains paved walkpaths, a score of benches, a handful of picnic tables and informational plaques. It is a favorite spot for workers in nearby buildings who eat lunch, read a book or just sit and converse in the shade of its canopy.\nSee also\n* List of individual trees\nReferences\nExternal links\n*[http://www.jaxfountain.com/Original/oak.htm Treaty Oak Pictures]\n*[https://web.archive.org/web/20120427225553/http://apps2.coj.net/parksinternet/parkdetails.asp?parkid=70 City of Jacksonville Parks: Jessie Ball duPont Park]\n*[http://www.milleronsports.com/2012/01/only-surviving-witness-to-birth-of.html Only surviving witness to birth of Jacksonville]"
    }
  ]
}