{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Beaufort\n\nThe Treaty of Beaufort, also called the Beaufort Convention, is the treaty that originally set the all-river boundary between the U.S. states of Georgia and South Carolina.  It was named for Beaufort, South Carolina, where it was signed in 1787.\nIt set the boundary to be the thalweg (centerline) of the Savannah River, extending north into the Tugalo River (now spelled Tugaloo), and up to the headwater of its primary tributary.  At that time, the area had not been fully surveyed, thus the somewhat ambiguous wording.  If that headwater point was south of Georgia's border with North Carolina (nominally latitude 35°N), then South Carolina would claim everything north of a due-west line from that point, and south of 35°N, as far west as the Mississippi River. This claim was shown on some maps of the time, though it never took effect.\nAs it later was discovered, the primary tributary of the Tugalo is the Chattooga River, which does originate in North Carolina.  In 1787 the area was Cherokee territory and not considered part of either state.  The Treaty of 1816 officially extended the states' frontier northeast up the Chattooga River, where it remains the current boundary.\nThe other issue addressed was the islands in the rivers, which the treaty assigned to Georgia, but in the two rivers (Savannah and Tugalo) known to be the border at the time.  In these cases, the thalweg is drawn through the center of the more northerly (actually northeasterly) channel, curving gradually around the island.  This part of the treaty was the subject of some later border disputes between the two states.\nLegal interpretation\nThere have been two cases before the U.S. Supreme Court regarding the interpretation of this treaty.  (The court has original jurisdiction in such cases.)\nThe first Georgia v. South Carolina case in 1922 was regarding the islands in the Tugaloo, which was not explicitly named in the treaty because that was prior to its discovery.  Although the treaty prescribes the northerly branch as the boundary, and the Chattooga flows in a perpendicular direction (putting Rabun County, Georgia on the north side and Oconee County, South Carolina on the south), Georgia was given the islands as in the lower rivers.\nThe second case of the same name was in 1989 and was more complex, regarding a Georgia island that had become a South Carolina peninsula due to dredging.  Although South Carolina was in adverse possession of the land, Georgia lost this case due to acquiescence, rather than as a matter of the treaty's wording.\nAn 1876 case, South Carolina v. Georgia, was about dredging for navigation around an island in the river at the port city of Savannah, and not about the boundary location.  Georgia won this case, allowing it to widen the shipping channel on the Savannah side at the expense of water flow to the South Carolina boundary side.\nThe legal status of this treaty, given that the later U.S. Constitution of 1789 made interstate treaties unconstitutional, is now that of an interstate compact.  Just as such compacts must be ratified by the U.S. Congress, this treaty was ratified by the Confederation Congress, and is still considered to be legally binding.\nSee also\n*List of treaties\n*Georgia v. South Carolina\nReferences"
    }
  ]
}