{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Amiens (1423)\n\n| parties         =\n}}\nThe Treaty of Amiens, signed on 13 April 1423, was a defensive agreement between Burgundy, Brittany, and England during the Hundred Years' War. The English were represented by John, Duke of Bedford, the English regent of France, the Burgundians by Duke Philip the Good himself, and the Bretons by Arthur de Richemont, on behalf of his brother the Duke of Brittany. By the agreement, all three parties acknowledged Henry VI of England as King of France, and agreed to aid each other against the Valois claimant, Charles VII. It also stipulated the marriage of Bedford and Richemont to Burgundy's sisters, in order to cement the alliance.\nThe Treaty of Amiens was formed in the aftermath of the Treaty of Troyes. It helped maintain the Anglo-Burgundian alliance until 1435, and the basis of the dual-monarchy of the two kingdoms of England and France first formed by King Henry V of England at Troyes.\nTerms\nThe Treaty of Amiens was a tripartite alliance between England, Burgundy and Brittany.  It arranged the marriage of the John, Duke of Bedford to the Duke of Burgundy's younger sister, Anne of Burgundy, and the marriage of Arthur, Earl of Richmond, to the Duke of Burgundy's older sister Margaret of Burgundy, widow of Louis, Dauphin of France. Furthermore, the treaty stated that all three of the parties would willingly acknowledge Henry VI of England as King of France, as had been promised by their oaths taken at the Treaty of Troyes two years before.\nBackground\nAs formalised by the Treaty of Troyes, Henry V and his heirs would inherit the Kingdom of France after Charles VI's death. However Henry V died four weeks before the death of Charles VI, and so never inherited the French throne.\nHenry V's son, though still an infant, became Henry VI, King of England, on his father's death, and shortly thereafter became King of France as well. The accession of an infant king made it easier for the French nobility to refuse him and support the Valois heir, Charles. The infant king of the dual-monarchy thus required a regent. John, Duke of Bedford, who was governor of Normandy and younger brother of Henry V, was made regent of France, and ruled with a joint French administration in Paris until the king came of age to rule his two kingdoms.\nAnglo-Burgundian relations now centred on the two personal figures of the Duke of Bedford and the Duke of Burgundy, who was as strong as any other monarch. In 1422, Bedford had sought to bind Brittany and Burgundy more to his young nephew's interest. Bedford had concluded with a marriage contract in which he would marry Anne of Burgundy, younger sister of Philip, while Arthur, Earl of Richmond, would marry Margaret of Burgundy, older sister of Philip.\nIn February 1423, Bedford appealed for a formal alliance, suggesting that both dukes would come to Amiens for negotiation. The talks ended in April when they signed a personal alliance that would lapse on the signatories' death. The military commitment was that each individual would aid with five-hundred men-at-arms and archers in time of need. The main part of the agreement was the signatories commitment to work for \"the good of our lord the king and his kingdom of France and England\", a clause that recognised Henry VI's title to the French throne, and rejected the authority of Charles.\nThe treaty also gave an unusual clause in which the three dukes would give relief to the poor and those suffering. Despite being fifteen years her senior, Bedford's marriage to Anne of Burgundy turned out to be a love match.\nAftermath\nThe Treaty of Amiens was almost immediately undermined. On 18 April 1423, the Bretons and the Burgundians held a secret meeting in which the two agreed to remain friends if either duke would reconcile himself with Charles. Although for the time being both recognised Henry VI as their sovereign, adherence to the Treaty of Amiens wavered for their own personal interests.\nThe English and Burgundians were masters on the battlefield. They won the Battle of Cravant in 1423, a victory celebrated by the people of Paris, and their victory at Verneuil in 1424 was known as the second Agincourt to many of the Armagnacs (supporters of Charles) who were fighting against the English. This important victory meant there was a smaller need for important administration in Paris.\nHowever, a quarrel between Bedford and Richmond caused the latter to offer his services to the Dauphin in 1424 despite having been created Count of Touraine by Bedford. The same year, Anglo-Burgundian strain had been shown when Humphrey of Lancaster, 1st Duke of Gloucester (the brother of Bedford), attacked the County of Hainault in favour of his wife's right there, thus bringing Anglo-Burgundian confrontation.\nAnne of Burgundy, the Duchess of Bedford, was the primary mediator between her brother and her husband. Her death in 1432 deeply shook the relations between the two. Henry VI's French coronation and consecration at Notre Dame in Paris could do nothing to stop the French from pushing further into English territories. By 1433, the Duke of Burgundy opened negotiations with Charles, and, having only agreed with a small peace settlement near Burgundian-Valois territory, he now started reflecting on a possibility of a Franco-Burgundian reconciliation.\nAt the Treaty of Arras in 1435, the Duke of Burgundy withdrew from the alliance and withdrew his recognition of Henry VI as King of France. Burgundy had a Papal legate which enabled him to break the oath he had made at Troyes, and reconciled with and recognised Charles as King of France. Brittany had always stuck to its tradition of joining the strongest side. When it declared war on England in 1426, Brittany's eastern frontier remained unprotected, besides sending raids into English held territory. In 1427, Brittany was forced to a previous status quo as vassal. Even after the expulsion of Henry VI from France in 1453, the English kings continued to style themselves as Kings of France.\nFootnotes\nReferences\n*Fritze, Ronald H., Historical dictionary of late medieval England, 1272-1485, Publishing William Baxter Robinson, Greenwood Publishing Group,\n*Holmes, George, The Oxford illustrated history of medieval Europe, Editor George Holmes, Oxford University Press, 2001,\n*Lodge, R., The Close of the Middle Ages 1273 to 1494 V3, Kessinger Publishing, 2005,\n*MacFarlane, Charles; Thomson, Thomas, The comprehensive history of England: civil and military, religious, intellectual, and social ... to the suppression of the Sepoy revolt, Publisher Blackie and son, 1861.\n*Ramsay, James H., Lancaster and York; a Century of English History, Edition illustrated, Publisher Adamant Media Corporation, 2002,\n*"
    }
  ]
}