{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Artaxata\n\nThe Treaty of Artaxata, was signed in 66 BCE in the Armenian capital of Artaxata (modern-day Artashat), marked the end of hostilities between the Roman Republic and the Kingdom of Armenia under King Tigranes the Great. The treaty concluded the Armenian involvement in the Third Mithridatic War and established Armenia as a Roman client state, significantly reducing its territorial ambitions in the Near East.\n| languages = Latin, Greek, Armenian\n| wikisource =\n}}\nBackground\nTigranes the Great transformed Armenia into a regional power, expanding his empire into Syria, Phoenicia, Cilicia, and parts of Cappadocia and Mesopotamia. His alliance with Mithridates VI of Pontus (his father-in-law) drew Armenia into the Mithridatic Wars against Rome.\nRoman Intervention\nIn 69 BCE, the Roman general Lucullus invaded Armenia, defeating Tigranes at the Battle of Tigranocerta and sacking the capital. However, Lucullus’s overextended supply lines and mutinous troops forced him to withdraw, allowing Tigranes to regroup. By 66 BCE, the Roman Senate appointed Pompey the Great to replace Lucullus, tasking him with decisively ending the war. Pompey pursued Mithridates into the Caucasus while pressuring Tigranes to surrender, exploiting divisions within the Armenian court, including a rebellion by Tigranes’ son, Tigranes the Younger, backed by Parthia.\nFacing internal revolt and the threat of Roman invasion, Tigranes the Great surrendered to Pompey at Artaxata, accepting terms that preserved his throne but dismantled his empire.\nTerms of the Treaty\nThe treaty was negotiated at Artaxata, the Armenian capital, with Pompey dictating terms that cemented Roman dominance:\n# Political Submission:\n#* Tigranes formally acknowledged Rome as his overlord, reducing Armenia to a client kingdom.\n#* He retained his title as \"King of Kings\" but only within Armenia’s core territories.\n# Territorial Concessions:\n#* Armenia surrendered all territories acquired outside the Armenian Highlands, including:\n#** Syria and Phoenicia (to Rome).\n#** Cappadocia and Sophene (restored to local rulers).\n#** Corduene (ceded to Rome’s ally, the Parthians).\n#* The Armenian Empire was reduced to its traditional borders, roughly corresponding to modern-day Armenia and parts of eastern Turkey.\n# Financial Penalties:\n#* Tigranes paid a war indemnity of 6,000 talents of silver (approximately 180 tons) to Rome.\n# Hostage and Succession:\n#* Tigranes’ rebellious son, Tigranes the Younger, was sent to Rome as a hostage.\n#* Pompey recognized Tigranes the Great’s younger son, Artavasdes II, as heir to the Armenian throne.\nAftermath\nThe Treaty of Artaxata reshaped the political dynamics of the Near East. In the immediate term, it solidified Roman hegemony over Anatolia and the Levant, with Pompey reorganizing the eastern provinces into directly administered territories such as Syria while restoring client kingdoms like Cappadocia. Armenia, though stripped of its imperial possessions, retained nominal independence as a Roman client state, compelled to align its foreign policy with Roman interests. The cession of Corduene to Parthia, however, sowed seeds of future conflict, as Rome and Parthia increasingly clashed over influence in Armenia.\nIn the longer term, the treaty set a precedent for Rome’s client-state system, which became a cornerstone of its imperial policy in the East. The rivalry between Rome and Parthia over Armenia escalated into open warfare under Crassus and Mark Antony, with both powers seeking to install puppet rulers in Armenia. Despite these external pressures, Armenia maintained a degree of cultural and political autonomy under kings like Artavasdes II, who balanced alliances with Rome and Parthia while patronizing Hellenistic art and scholarship.\nPompey’s settlement in the East, including the Treaty of Artaxata, established administrative frameworks that endured into the Imperial period. His reorganization of Anatolia and the Levant into provinces and client states stabilized Rome’s eastern frontier but also entrenched a system of indirect rule that required constant military and diplomatic maintenance.\nSee also\n* Battle of Tigranocerta\n* Siege of Artaxata\n* Lucullus\nReferences\nBibliography\n*"
    }
  ]
}