{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Sablé__disambig_1\n\n}}}}\n| location_signed     = Sablé, Duchy of Brittany, France\n| signatories         =\n* Francis II, Duke of Brittany\n* Charles VIII of France\n| parties             =\n*  Duchy of Brittany\n*\n}}\nThe Treaty of Sablé (also known as the Treaty of Verger or the Treaty of Le Verger) was signed on 20 August 1488 in Sablé, between Duke Francis II of Brittany and King Charles VIII of France.  A year after the signing of Sablé, the treaty was reneged upon in favour of a tripartite alliance at Amiens with Burgundy and England. The town of Sablé was therefore chosen for a summit in 1488 when the duchy was forced to do homage to the King of France for the last time.  The duchy was later merged into the kingdom. Francis, who, under the terms of the treaty, was integrated a member of the French nobility, died on 9 September 1488.\nBased on the terms of the accord, Francis acknowledged himself as a vassal of the king. Moreover, the duke pledged the territories of Saint Malo, Dinan, Fougères and Saint-Aubin-du-Cormier to be controlled by the French crown. Also, Francis promised to remove all foreign troops from his territories, as well as ensure to seek Charles's consent before marrying off his daughter, Anne. In return, Charles removed his forces from Brittany except in the town garrisons of the territories pledged by Francis. In another aspect of the treaty, Francis was no longer permitted to summon any troops from England.\nNotes\nReferences\nSources\n*George Lillie Craik and Charles MacFarlane. The Pictorial History of England: Being a History of the People, as Well as a History of the Kingdom. Charles Knight and Company, 1841 (Original from the New York Public Library).\n*Herbert Albert Laurens Fisher. The History of England, from the Accession of Henry VII, to the Death of Henry VIII, 1485-1547'' (Volume V). Longmans, Green, and Co., 1906.\nExternal links\n*[https://www.britannica.com/topic/Treaty-of-Le-Verger Treaty of Le Verger] in Encyclopædia Britannica\n*[https://web.archive.org/web/20181215222818/http://www.zum.de/whkmla/military/15cen/bretagne14871488.html Franco-Breton War, 1487-1488] at World History at KMLA"
    }
  ]
}