{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Madrid (1670)\n\n| location_signed      = Madrid\n| date_sealed          =\n| date_effective       =\n| condition_effective  = 28 September 1670\n| date_expiration      =\n| date_expiry          =\n| mediators            =\n| negotiators          =  William Godolphin   Gaspar de Bracamonte   Count of Peñaranda\n| original_signatories =\n| signatories          =  William Godolphin   Gaspar de Bracamonte   Count of Peñaranda\n| parties              =\n| ratifiers            =  Charles II of England  Mariana of Austria for Charles II of Spain\n| depositor            =\n| depositories         =\n| citations            =\n| language             = Latin\n| languages            =\n| wikisource           =\n| wikisource1          =\n| footnotes            =\n}}\nThe Treaty of Madrid, also known as the Godolphin Treaty, was a treaty between England and Spain that was agreed to in July 1670 \"for the settlement of all disputes in America\". The treaty officially ended the war begun in 1654 in the Caribbean in which England had conquered Jamaica.\nThe 1670 Treaty of Madrid was highly favourable to England, as its adverse possession in the Caribbean Sea and the rest of the Americas was confirmed and made legal by Spain. Before 1670, Spain had exclusively regarded the Americas as Spanish territory with the exception of Brazil, which was Portuguese according to the 1494 Treaty of Tordesillas that had confirmed Christopher Columbus' claim of the New World for Spain since 12 October 1494.\nBackground\nThe Anglo-Spanish War had begun in late 1654, as England joined France in its conflict with Spain. In Europe, the conflict ended with the Treaty of the Pyrenees (between France and Spain) and King Charles II of England's restoration in 1660, but a treaty between England and Spain was never signed. The conflict in the Caribbean began with the English failed attempt on Hispaniola, followed by a successful invasion of Jamaica. The region thus remained in a state of war, and privateer raids were launched on the Spanish Main led by buccaneers notably Christopher Myngs and Henry Morgan under the behest of Jamaican Governor Thomas Modyford As far as Modyford was concerned, Jamaica would never be secure until Spain had acknowledged England's possession of Jamaica and the Cayman Islands and in a treaty. In 1667 the Treaty of Madrid was signed between England and Spain. Although favourable to the former in terms of trade, there was no mention of the American colonies or the Caribbean as rightful possessions. Attacks, therefore, continued, notably Morgan's brutal attack and sackings of Portobello and Lake Maracaibo over the next two years.\nIn 1669, Mariana, the Queen Regent of Spain, in response ordered attacks on English shipping in the Caribbean. Charles II ordered Modyford to issue official letters of marque against the Spanish. Modyford commissioned Morgan once more to raid the Spanish Main. Spain was politically, economically and militarily weak after years of war and political infighting. Charles saw an opportunity that he could not miss and felt the time was right to negotiate a treaty with Spain since England held a great advantage. The only way Spain could be at an advantage was to recapture Jamaica or France and Holland to join in a potential war, which Charles was seeking to avoid.\nNegotiations began in the autumn of 1669 between the Spanish representative Gaspar de Bracamonte, Count of Peñaranda, with William Godolphin, Envoy Extraordinary from England.\nThe original language of the treaty was in Latin, and the complete English title was \"A treaty for the composing of differences, restraining of depredations, and establishing of peace in America, between the crowns of Great Britain and Spain, concluded at Madrid the 8/18 day of July, in the year of our Lord 1670\".\nTerms\nSpain recognised in Article VII that territory in the Americas settled by England belonged to England. From the Spanish position, it accepted as applicable the legal doctrine of adverse possession. Before the 17th century, Spain had considered the Western Hemisphere exclusively as Spanish territory with the exception of Brazil.\n}}\nUnder the terms of the treaty, all letters of reprisal were revoked by Spain, and reciprocal aid to ships in distress along with permission to repair in each others ports were required.\nEngland agreed to suppress piracy in the Caribbean, and in return, Spain agreed to permit English ships freedom of movement. Both agreed to refrain from trading in the other's Caribbean territory and to limit trading to their own possessions.\nThe treaty was then ratified on 28 September.\nConsequences\nIn Spain and its colonies, the treaty was hated and viewed by many as a humiliating surrender. Spain's military, economic and political weakness meant that it was unable to pose any will, which England had taken easy advantage of. Spanish merchants in particular were unwilling to accept the treaty, and the Spanish crown had to give special tax Cédulas as compensation.\nThe treaty was highly favourable to England, on the other hand, and the fact that Spain recognised England's colonies in the Americas was a major concession. In previous treaties, Spain had always insisted that the New World west of Brazil belonged to it alone.\nEngland effectively challenged Spain in the western Caribbean, and subsequently used Jamaica as a base to support settlements all along the Central American Caribbean coast from the Yucatán to (present day) Nicaragua. The new logwood stations there were accepted by Spain but were not recognised and this increased as many ex privateers turned to logwooding. As such, the treaty did not establish any boundaries: Spain and England only adopted, in Article 7, the principle of actual possession. In Northern America, \"this compact legalized England's ownership as far south as Charleston, and Spain's as far north as Santa Elena Sound, in 32°, 30' north latitude\". As a result, it was met with consternation by the Spanish in Florida, who, despite protests, had to accept the newly encroached English colony of Charleston.\nAlthough piracy was suppressed, English ships were now able to roam the Caribbean without hindrance. England had sought that in negotiations with Spain in 1655, but the Spanish had refused. Spain's acquiescence reversed its previous position that defined any English person in the West Indies as an intruder or a pirate.\nNews of the treaty, however, did not reach the Caribbean in time for Henry Morgan, who on 28 January 1671 launched a devastating raid on Panama City. The Spanish were furious, and the English saw that Morgan and Modyford had violated the treaty. To restore relations, both Modyford and Morgan were recalled and arrested. They went unpunished, however, and were released. Morgan was even knighted by Charles and made Lieutenant Governor of Jamaica.\nSpain and England remained at peace until 1702 with the War of the Spanish Succession.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://books.google.com/books?id=Q74QAAAAYAAJ&pg=PA34 English translation of the treaty]\n* [https://books.google.com/books?id=XE8NAAAAIAAJ&pg=PA162 Spanish translation of the treaty]"
    }
  ]
}