{
  "content": [
    {
      "type": "text",
      "text": "# Treaty with Choctaws and Chickasaws\n\nThe Treaty with Choctaws and Chickasaws was a treaty signed on July 12, 1861 between the Choctaw and Chickasaw (two American Indian nations) and the Confederate States.\nAt the beginning of the American Civil War, Albert Pike was appointed as Confederate envoy to Native Americans. In this capacity he negotiated several treaties, one of the most important being with Cherokee chief John Ross, which was concluded in 1861. The treaty was ratified and proclaimed on December 20, 1861 by the Confederacy. The Choctaw and Chickasaw also duly ratified the treaty.\nSome Choctaws identified with the Confederacy and a few held enslaved people. In addition, they well remembered and resented the Indian removals from 30 years earlier and poor service they received from the federal government. The main reason the Choctaw Nation agreed to sign the treaty, however, was for protection from regional tribes.\nTerms\nThe preamble begins with,\n}}\nwas a commissioner for the Chickasaw Nation. Colbert developed the Chickasaw Nation's constitution in the 1850s.\n]]\nThe treaty had 64 terms. The following abbreviated terms of the treaty were:\n# Perpetual peace and friendship\n# Protection provided by the Confederacy\n# Confederacy will not abandon or desert them\n# Boundaries defined\n# Boundaries defined continued\n# Safe passage for Choctaws through Chickasaw district\n# Choctaw and Chickasaw nations to give full assent to the provisions of the act of the Confederacy\n# Confederacy solemnly guarantees the lands held by the Choctaws and Chickasaws forever\n# Land never will be sold\n# No state or territory laws of the Confederacy will be passed for the Choctaws and Chickasaws governments\n# Confederacy renews leased area from the United States\n# Indians in the leased area shall be subject to Confederacy laws until they are capable of self-government or subjected to Choctaw and Chickasaw laws.\n# Confederacy waterways are free to Choctaw and Chickasaw nations.\n# Choctaw and Chickasaw nations have unrestricted right of self-government\n# Intruders in Choctaw or Chickasaw nations subjected to removal by the nations or the Confederacy\n# Land tracts set aside for Confederacy agencies\n# Confederacy forts in Choctaw and Chickasaw country\n# Confederacy right of way for railroads, telegraph lines\n# No Settlements or farms near forts, posts, or agencies\n# Appointments for Confederacy agent and interpreter\n# Protection from other domestic strife, white or Indian hostilities\n# Legal assistance, intrusion prevention, and removal of dangerous or improper persons\n# Property thief and recovery and payments for property not found\n# Licensed traders approved by National Council and trading taxed\n# United States laws removed that regulated Choctaw or Chickasaw selling\n# Choctaws and Chickasaws can take, hold and pass, purchase or descent lands in any of the Confederate States\n# Choctaws and Chickasaws are entitled to one representative in the House of Representatives of the Confederate States of America\n# Choctaw and Chickasaw country may be admitted as a state when they elect to do so and become citizens in the Confederate States of America\n# Land sales proceeds belong to members of the Choctaw and Chickasaw\n# If Creek, Seminole, and Cherokee desire to become part of the Confederate States of America, then their countries maybe annexed to become part of the Choctaw and Chickasaw confederate state\n# Choctaw and Chickasaw Nations may incorporate and determine who may be citizens of their respective nation\n# Confederate citizens trying to settle Choctaw and Chickasaw Nations forfeit protection of the Confederate States and maybe uncruelly punished by said nations\n# Confederate citizens may not pasture stock on Choctaw or Chickasaw Nations. Confederate citizens may peaceable pass thru Choctaw or Chickasaw Nations, and the Choctaws and Chickasaws have the same privileges in the Confederate States.\n# Violators of laws shall be removed.\n# Movement and settlement rights, voting rights, and prosecution in each nations courts.\n# Criminal jurisdiction\n# Return of criminals between Choctaw/Chickasaw Nations and Confederate State of America.\n# Creation of a Confederate States district court called Tush-ca-hom-ma to carry out the provisions of this treaty.\n# Acts of Congress of the United States will be continued by the Confederate States, provide the common defense and welfare, district court shall have exclusive jurisdiction.\n# Tush-ca-hom-ma district shall have the same admiralty jurisdiction as other district courts of the Confederate States.\n# Trials for offenses in nation will be held in Confederate States district court.\n# Offenses committed before the signing of the treaty will not be prosecuted.\nSignatories\nThere were a total of 36 signatories.\nCommissioner of the Confederate States: Albert Pike\nCommissioners of the Choctaw Nation: R.M. Jones, Sampson Folsom, Forbis Leflore, Geo. W. Harkins, jr., Allen Wright, Alfred Wade, Coleman Cole, James Riley, Rufus Folsom, William B. Pitchlynn, McKee King, William King, John P. Turnbull, William Bryant.\nCommissioners of the Chickasaw Nation: Edmund Pickens, Holmes Colbert, James Gamble, Joel Kemp, William Kemp, Winchester Colbert, Henry C. Colbert, James N. McLish, Martin W. Allen, John M. Johnson, Samuel Colbert, A. Alexander, Wilson Frazier, C. Columbus, Ashalatobbe, John E. Anderson.\nAftermath\nFrom about 1865 to 1918, Mississippi Choctaws were largely ignored by governmental, health, and educational services and fell into obscurity. In the aftermath of the Civil War, their issues were pushed aside in the struggle between defeated Confederates, freedmen, and Union sympathizers.\nThe Confederacy's loss was also the Choctaw Nation's loss. The Choctaw Nation, in what would be Oklahoma, kept slavery until 1866. After the Civil War, they were required by treaty with the United States to free the slaves within their nation. Former slaves of the Choctaw Nation were called the Choctaw Freedmen. After considerable debate, Choctaw Freedmen were granted Choctaw Nation citizenship in 1885. In post-war treaties, the US government also acquired land in the western part of the territory and access rights for railroads to be built across Indian Territory.\nSee also\n* List of Choctaw Treaties\n* List of treaties of the Confederate States of America\nReferences\nFurther reading\n* Matthews, James M. [https://docsouth.unc.edu/imls/24conf/24conf.html The Statutes at Large of the Provisional Government of the Confederate States of America], 1864;\nExternal links\n* [http://docsouth.unc.edu/imls/warfeb4/warfeb4.html Communication From the Secretary of War]\n* [http://www.history.com/this-day-in-history/confederacy-signs-treaties-with-choctaw-and-chickasaw-tribes Confederacy signs treaties with Choctaw and Chickasaw Tribes]\n* [https://web.archive.org/web/20121024013411/http://www.library.okstate.edu/okmaps/ Oklahoma Digital Maps: Digital Collections of Oklahoma and Indian Territory]"
    }
  ]
}