{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Tagilde\n\nThe Treaty of Tagilde is a treaty signed on 10 July 1372 in Tagilde, a village in Portugal. It was signed by King Ferdinand I of Portugal and representatives of John of Gaunt, Duke of Lancaster, a claimant to the Crown of Castile and son of the English king, Edward III. This agreement is considered to have constituted the first legal foundation of the Anglo-Portuguese Alliance, which continues to exist. The agreement was followed up by the Anglo-Portuguese Treaty of 1373, known as the Treaty of Peace, Friendship and Alliance, which was signed in St Paul’s Cathedral by King Edward III of England and King Ferdinand and Queen Leonor of Portugal and is also known as the Treaty of London. Subsequently, the Treaty of Windsor (1386) ratified the London treaty. It is the oldest continuous treaty in effect to this day.\nThe Treaty of Tagilde was signed at the Church of São Salvador of Tagilde and sealed the alliance of the two claimants to the Castilian throne. Prior to the treaty, there had been disputes over the Castilian throne between D. Pedro and his illegitimate brother, D. Enrique de Trastámara. D. Pedro was killed at the Battle of Montiel in 1369, and King Ferdinand then declared war on D. Enrique. John of Gaunt had married D. Pedro's daughter, Constance, in 1371 and therefore had a claim to the Castilian throne. King Ferdinand also had a claim to the throne, as the great-grandson of a previous king of Castile. For Ferdinand, the treaty provided an opportunity to assert the independence of Portugal against interference from Castile. The treaty agreed that the two signatories would wage war against Castile on two fronts: the English on the north and the Portuguese to the west.\nShortly after signing the Treaty, King Ferdinand sent two ambassadors to the Duke of Lancaster in England for him to sign it, which was done at the Savoy Palace, John of Gaunt's residence in the centre of London. The Portuguese ambassadors were also authorised to make alliances with Edward III and with his first son, Edward, Prince of Wales. These negotiations resulted in the Treaty of London of 16 June 1373. In 1385, the Portuguese army, with help from English soldiers, defeated Castilian forces at the Battle of Aljubarrota.\nThe 650th anniversary of the treaty was celebrated in 2022.\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=BNmcZb2MvnU Video discussing the treaty and its purpose]"
    }
  ]
}