{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Senlis\n\n}}\n(1477–1482–1493)\n]]\nThe Treaty of Senlis concerning the Burgundian succession was signed at the French city of Senlis on 23 May 1493, between King Charles VIII of France and Maximilian I, at the time King of the Romans and future Holy Roman Emperor, who acted on behalf of his young son Philip the Handsome, the Habsburg claimant to the Burgundian inheritance. The treaty contained 48 clauses, dealing with various political, dynastic and territorial questions that were previously addressed by the Treaty of Arras (1482).\nBackground\nAfter the last Valois-Burgundy Duke Charles the Bold had died without male heir at the 1477 Battle of Nancy, his third cousin Louis XI of France was determined to come into his inheritance, especially the Duchy of Burgundy and the thriving County of Flanders.\nHowever, Mary of Burgundy, daughter of Charles the Bold, and her husband Maximilian also claimed their rights, which led to clashes of arms culminating at the 1479 Battle of Guinegate, concluded in favor of Mary and Maximilian. Nevertheless, Mary died in 1482 and her claims were inherited by her son Philip, who was still a child and thus under the guardianship of his father Maximilian.\nAccording to the Treaty of Arras (1482), Maximilian had to cede the County of Burgundy, the County of Artois, the County of Charolais and several other lordships to France as dowry for the proposed marriage of their young daughter Margaret, with Louis' son Charles, who became the new king of France in 1483.\nIn 1491, the French king Charles VIII renounced the engagement with Margaret, and married Anne of Brittany who was at that time married in proxy to Maximilian. Thus the question of possession over territories regarded as the Margaret's dowry was reopened, and Maximilian urged the return of his daughter and the retrieval of all those lands. In 1493, Charles VIII, stuck in the conflict with King Alfonso II of Naples, finally had to acknowledge the claims.\nContents\n's dowry, as defined in 1482 by the Treaty of Arras, and redistributed in 1493 by the Treaty of Senlis]]\nBy the Treaty of Senlis, all hostilities between France and the Habsburgs were officially over. Most of the disputed territories of the Margaret's dowry (counties of Burgundy, Artois, Charolais and some other minor territories) were returned to Habsburgs and relinquished to her brother Philip the Handsome.\nThe Duchy of Burgundy (with capital Dijon, not to be confused with the Free County of Burgundy with capital Dole), which was seized by France since 1477, remained in French hands.\nThe Treaty of Senlis had 48 articles, called \"items\":\nReturning to Habsburg feudal possession, Artois and Flanders were in time detached from the French formal suzerainty and officially annexed into the Holy Roman Empire. However, France was still able to retain powerful legal claims and outposts in both provinces, until the final settlements in 1526 and 1529.\nSee also\n* Treaty of Madrid (1526)\n* Treaty of Cambrai (1529)\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[http://www.britannica.com/eb/topic-534601/Treaty-of-Senlis Britannica - Treaty of Senlis]\n*[http://www.newadvent.org/cathen/03068a.htm Catholic Encyclopedia - Burgundy]\n*[https://archives.cotedor.fr/v2/site/AD21/Apprendre/Atelier_du_chancelier_Rolin/Paleographie/Groupe_confirmes/Documents_etudies_en_2008-2009/Documents_1_a_3_-_Le_traite_de_Senlis_23_mai_1493_ Original 1494 correspondence on the difficulties of the application of the Treaty of Senlis]"
    }
  ]
}