{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Accession 2005\n\nTreaty of Accession 2005}}\n|liststyle = text-align:center;\n| Treaty between the Kingdom of Belgium, the Czech Republic, the Kingdom of Denmark, the Federal Republic of Germany, the Republic of Estonia, the Hellenic Republic, the Kingdom of Spain, the French Republic, Ireland, the Italian Republic, the Republic of Cyprus, the Republic of Latvia, the Republic of Lithuania, the Grand Duchy of Luxembourg, the Republic of Hungary, the Republic of Malta, the Kingdom of the Netherlands, the Republic of Austria, the Republic of Poland, the Portuguese Republic, the Republic of Slovenia, the Slovak Republic, the Republic of Finland, the Kingdom of Sweden, the United Kingdom of Great Britain and Northern Ireland (Member States of the European Union) and the Republic of Bulgaria and Romania, concerning the accession of the Republic of Bulgaria and Romania to the European Union\n}}\n| image               = File:EU27-2007 European Union map enlargement.svg\n| image_width         = 300px\n| caption             =\n| type                =\n| date_drafted        =\n| date_signed         = 25 April 2005\n| location_signed     = Neimënster Abbey, Luxembourg\n| date_sealed         =\n| date_effective      = 1 January 2007\n| condition_effective = ratification by Bulgaria, Romania and all 25 Member States of the European Union\n| date_expiration     =\n| signatories         =  European Union (25 members)| Bulgaria| Romania}}\n| ratifiers           =\n| depositor           =Government of the Italian Republic\n| language            =\n| languages           =All 21 official Languages of the European Union, Bulgarian and Romanian\n| website             =\n| wikisource          = Treaty concerning the accession of the Republic of Bulgaria and Romania to the European Union\n}}\nThe Treaty of Accession 2005 is an agreement between the member states of European Union and Bulgaria and Romania. It entered into force on 1 January 2007. The Treaty arranged accession of Bulgaria and Romania to the EU and amended earlier Treaties of the European Union. As such it is an integral part of the constitutional basis of the European Union.\nFull title\nThe full official name of the Treaty is:\nHistory\nFollowing successful completion of accession negotiations European Council concluded on 17 December 2004 that Bulgaria and Romania were ready to become members of the European Union. A request for assent (C6‑0085/2005) was submitted to the European Parliament.\nOn 22 February, the 2005 European Commission delivered a favourable opinion on the accession to the European Union of Bulgaria and Romania. As a result, on 13 April 2005, the European Parliament gave assent to the applications of Bulgaria and Romania to become members of the European Union. The parliament voted in favour of Romania with 497 positive votes, 93 negative votes and 71 abstentions, while Bulgaria received 522 votes in favour, 70 votes against and 69 abstentions. On 25 April 2005, Council of the European Union accepted the applications for admission of Bulgaria and Romania.\nThe treaty was signed on 25 April 2005, in Neimënster Abbey, Luxembourg. In addition to the Treaty of Accession a Final Act was signed. The Final Act registers the results of the accession negotiations, including any declarations made by the parties. It also laid down arrangements for the period between signing and entry into force of the treaty. Ratification of the Treaty of Accession is summarized in the table below. The process was completed on 20 December 2006.\n{| class=\"wikitable\"\n|- style=\"background:#efefef;\"\n! Parliament\n! Date\n! Result\n! Deposition\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|11 May 2005||Yes. Народно събрание (Narodno Sabranie): 231 to 1 in favour, 2 abstentions.|| align=\"center\" |27 May 2005\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|17 May 2005||Yes. Camerele Reunite: 434 to 0 in favour, 0 abstentions.||align=\"center\"|27 May 2005\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|21 June 2005||Yes. Národná rada: 102 to 0 in favour, 2 abstentions.||align=\"center\"|28 September 2005\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|26 September 2005||Yes. Országgyűlés: 257 to 6 in favour, 1 abstention.||align=\"center\"|26 October 2005\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|27 October 2005||Yes. House of Representatives: 56 to 0 in favour, 0 abstentions.||align=\"center\"|26 January 2006\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|16 November 2005||Yes. Riigikogu: 69 to 0 in favour, 0 abstentions.||align=\"center\"|6 February 2006\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|24 January 2006||Yes. Kamra tad-Deputati: Agreed without a division.||align=\"center\"|22 February 2006\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|2 November 2005||Yes. Βουλή των Ελλήνων (Voulí ton Ellínon): Approved by acclamation.|| align=\"center\" |24 February 2006\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|15 September 2005||Yes. Senát: 66 to 0 in favour, 2 abstentions.||rowspan=\"2\" align=\"center\"|3 March 2006\n|-\n|align=\"center\"|6 December 2005||Yes.  Poslanecká sněmovna: 155 to 0 in favour, 1 abstention.\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|22 November 2005||Yes. Senato: Approved by show of hands.||rowspan=\"2\" align=\"center\"|21 March 2006\n|-\n|align=\"center\"|22 December 2005||Yes.  Camera dei Deputati: 415 to 3 in favour, 4 abstentions.\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|29 September 2005||Yes. Državni zbor: 64 to 0 in favour, 0 abstentions.||align=\"center\"|30 March 2006\n|-\n|rowspan=\"2\" align=\"left\" bgcolor=\"#F0F0F0\"|||align=\"center\"|24 November 2005||Yes. Commons: Agreed without a division.||rowspan=\"3\" align=\"center\"|5 April 2006\n|-\n|align=\"center\"|7 February 2006||Yes. Lords: Agreed without a division.\n|-\n|bgcolor=\"#F0F0F0\"|incl. || align=\"center\" |8 December 2006||Yes. Gibraltar Parliament (Then, Gibraltar House of Assembly):\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|26 January 2006||Yes. Saeima: 79 to 0 in favour, 5 abstentions.||align=\"center\"|5 May 2006\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|9 May 2006||Yes. Riksdag: Approved by acclamation.||align=\"center\"|9 June 2006\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|24 November 2005||Yes. Congreso de los Diputados: 303 to 1 in favour, 0 abstentions.||rowspan=\"2\" align=\"center\"|21 June 2006\n|-\n|align=\"center\"|14 December 2005||Yes. Senado: 247 to 1 in favour, 0 abstentions.\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|26 April 2006||Yes. Nationalrat: Approved by show of hands with 2 against.||rowspan=\"2\" align=\"center\"|26 June 2006\n|-\n|align=\"center\"|11 May 2006||Yes.  Bundesrat: Approved by show of hands with 1 against.\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|30 March 2006||Yes. Seimas: 85 to 1 in favour, 3 abstentions.||align=\"center\"|27 June 2006\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|19 June 2006||Yes. Eduskunta/Riksdag: Adopted without voting.||rowspan=\"2\" align=\"center\"|2 August 2006\n|-\n|bgcolor=\"#F0F0F0\"|incl. ||align=\"center\"|20 March 2006||Yes. Lagting: Approved by acclamation.\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|7 February 2006||Yes. Tweede Kamer: 93 to 52 in favour, 0 abstentions.|| rowspan=\"2\" align=\"center\" |31 August 2006\n|-\n|align=\"center\"|13 June 2006||Yes. Eerste Kamer: Adopted without voting with 4 against.\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|8 March 2006||Yes. Assembleia: 181 to 0 in favour, 11 abstentions.||align=\"center\"|2 October 2006\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|10 March 2006||Yes. Sejm: 426 to 1 in favour, 1 abstention.||rowspan=\"2\" align=\"center\"|3 October 2006\n|-\n|align=\"center\"|30 March 2006||Yes. Senat: 71 to 0 in favour, 0 abstentions.\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|29 June 2006||Yes. Chamber of Deputies: 60 to 0 in favour, 0 abstentions.||align=\"center\"|10 October 2006\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|13 June 2006||Yes. Dáil Éireann: Agreed without a division.||rowspan=\"2\" align=\"center\"|16 October 2006\n|-\n|align=\"center\"|21 June 2006||Yes. Seanad Éireann: Agreed without a division.\n|-\n|rowspan=\"9\" bgcolor=\"#F0F0F0\"|||align=\"center\"|30 March 2006||Yes. Senaat / Sénat: 52 to 8 in favour, 0 abstentions.||rowspan=\"9\" align=\"center\"|19 October 2006\n|-\n|align=\"center\"|20 April 2006||Yes. Kamer van Volksvertegenwoordigers / Chambre des Représentants: 115 to 14 in favour, 1 abstention.\n|-\n|align=\"center\"|12 May 2006||Yes. Parlement de la Région de Bruxelles-Capitale / Brussels Hoofdstedelijk Parlement: 77 to 6 in favour, 0 abstentions.\n|-\n|align=\"center\"|12 May 2006||Yes. Assemblée réunie / Verenigde Vergadering (Brussels): 77 (66 French-speaking, 11 Dutch-speaking) to 6 (all Dutch-speaking) in favour, 0 abstentions.\n|-\n|align=\"center\"|27 June 2006||Yes. Parlement de la Communauté française: 57 to 0 in favour, 3 abstentions.\n|-\n|align=\"center\"|12 July 2006||Yes. Vlaams Parlement: 79 to 29 in favour, 0 abstentions on community matters; 77 to 26 in favour, 0 abstentions on regional matters.\n|-\n|align=\"center\"|19 July 2006||Yes. Parlement wallon: 61 to 0 in favour, 1 abstention on regional matters; 60 to 0 in favour, 0 abstentions on transferred community matters.\n|-\n|align=\"center\"|19 September 2006|| Yes. Parlament der Deutschsprachigen Gemeinschaft: 25 to 0 in favour, 0 abstentions.\n|-\n|align=\"center\"|20 October 2006||Yes. Parlement bruxellois francophone:  64 to 0 in favour, 0 abstentions.\n|-\n|bgcolor=\"#F0F0F0\"|||align=\"center\"|21 November 2006||Yes. Folketing: 97 to 2 in favour, 15 abstentions.||align=\"center\"|5 December 2006\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"| 27 June 2006||Yes. Assemblée nationale: Approved unanimously by show of hands.  ||rowspan=\"2\" align=\"center\"|6 December 2006\n|-\n|align=\"center\"|3 October 2006||Yes. Sénat: Approved by show of hands with 2 senators abstaining from voting.\n|-\n|rowspan=\"2\" bgcolor=\"#F0F0F0\"|||align=\"center\"|26 October 2006||Yes. Bundestag:  529 to 12 in favour, 10 abstentions.||rowspan=\"2\" align=\"center\"|20 December 2006\n|-\n|align=\"center\"|24 November 2006||Yes. Bundesrat: 69 to 0 in favour, 0 abstentions.\n|-\n|}\nThe default date for entry into force of the Treaty was 1 January 2007. Provisions were made for the postponement of the accession of one or both countries until 1 January 2008. Such a decision could have been taken by the Council of the European Union acting upon recommendation of the European Commission.  In its 16 May 2006 monitoring report, the Commission delivered the final recommendation about the date of accession, but requested further progress from Bulgaria and Romania.\nThe 26 September 2006 monitoring report concluded that both countries were sufficiently prepared to meet the political, economic and acquis criteria. It recommended against postponement of accession (instead of delaying membership it was decided to address the shortcomings through a subsequent cooperation and verification mechanism). The treaty entered into force on 1 January 2007.\nContents\n1. Introduction\n2. Treaty\nThe Treaty itself consists of six articles.\nArticle 1 arranges the accession of the Republic of Bulgaria and Romania to the European Union.\nParagraph 1 makes the Republic of Bulgaria and Romania full members of the European Union.\nParagraph 2 makes both countries parties to the Treaty establishing a Constitution for Europe and to the Treaty establishing the European Atomic Energy Community. Thus Bulgaria and Romania do not have to separately ratify the Treaty establishing a Constitution for Europe.\nParagraph 3 makes Protocol that sets the conditions and arrangements for admission and its annexes an integral part of the Treaty itself.\nParagraph 4 annexes the above-mentioned Protocol to the Treaty establishing a Constitution for Europe and to the Treaty establishing the European Atomic Energy Community and makes its provisions an integral part of these treaties.\nArticle 2 provides for the situation when the Treaty itself enters into force before the Treaty establishing a Constitution for Europe. Thus it will provide the legal basis of the membership of Bulgaria and Romania from 1 January 2007 until the Constitution of Europe is finally implemented in its present form (if ever).\nParagraph 1 states that both countries become parties to the Treaties on which the European Union is founded. Provisions of Article 1, paragraphs 2-4, will be applicable only from the date of entry into force of the Constitution of Europe.\nParagraph 2 states that, until the above-mentioned event, the conditions of admission and the adjustments to the Treaties on which the Union is founded will be provided by the Act annexed to the Treaty, which forms integral part of the Treaty itself.\nParagraph 3 arranges substitution of the Act with the Protocol upon the entry into force of the Constitution of Europe and legal consequences of this switch.\nArticle 3 defines all member states of the European union, including Bulgaria and Romania as equal in respect of all Treaties of the Union, including this one.\nArticle 4 is about ratification and entry into force of the Treaty.\nParagraph 1 stipulates that the Treaty should be ratified by all parties by 31 December 2006 and ratification instruments should be deposited with the Italian government.\nParagraph 2 and 3 define the data from which the Treaty enters into force, mechanism for eventual postponement in respect of one or both of the acceding states, and provides for the situation when one or more country has ratified the Treaty, but has failed to deposit the ratification instruments by 1 January 2007. The ratification procedures were completed in time and the Treaty entered into force on 1 January 2007 on the territory of all member states.\nArticle 5 stipulates that the Treaty establishing a Constitution for Europe drawn up in the Bulgarian and Romanian languages shall be annexed to this Treaty and they will be authentic under the same conditions as the texts in all other official languages of the European union.\nArticle 6 states that the Treaty exists as a single original drawn in all official languages of the European Union. Each of these texts is equally authentic and the original will be deposited with the Italian government, while all parties will receive certified copies.\n3. Protocol to the Treaty\n4. Act to the Treaty\n5. Final Act\nSee also\n*Law of the European Union\n*2007 enlargement of the European Union\n*Mechanism for Cooperation and Verification\nReferences\nExternal links\n*[http://eur-lex.europa.eu/JOHtml.do?uri=OJ:L:2005:157:SOM:EN:HTML Full text of the Treaty and related documents]"
    }
  ]
}