{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Paris (14 March 1812)\n\nThe Treaty of Paris of 14 March 1812 created an alliance between the Austrian Empire and the French Empire against the Russian Empire. Austria pledged to provide an auxiliary corps of 30,000 troops under the command of the French emperor, Napoleon Bonaparte, in the event of a war with Russia. The signatory for France was its foreign minister, the Duke of Bassano, and for Austria its ambassador in Paris, the Prince of Schwarzenberg. The treaty had nine public and eleven secret articles. The treaty was published in Le Moniteur Universel on 5 October 1813.\nThe Franco-Austrian alliance was sought by Austria. On 28 November 1811, the Austrian foreign minister, Klemens von Metternich, informed the Emperor Francis I that he considered a war between France and Russia likely to come the following year. On 24 February 1812, France and Prussia signed a treaty of alliance that would see Prussian participation in any Franco-Russian war. In the event of victory, Prussia was to be compensated for its pains at neutral Austria's expense. When the Prince of Schwarzenberg warned Metternich that Napoleon would not prevent the Poles of Warsaw from \"revolutionizing\" Austrian Galicia, Metternich decided to seek an alliance with France.\nMetternich offered to send 30,000 men to serve under an Austrian commander on the French right wing in the event of an invasion of Russia. In return, he asked to for the right to station an army of observation in Galicia, which under the terms of its neutrality Austria was forbidden to do. Metternich called Austria's participation in the coming war a \"war of self-preservation\" and his primary purpose was the preservation of Austrian rule in Galicia. The execution of the Austrian commitments was on 2 March delegated to a four-man commission chaired by the war minister, Károly Zichy, and including Metternich; Heinrich von Bellegarde, the president of the Aulic War Council; and the president of the .\nIn the public articles of the treaty signed on 14 March 1812, both parties recognized each other's territorial inviolability and pledged to respect the integrity of the Ottoman Empire. The Austrian auxiliary corps of 30,000 was to include 24,000 infantry and 6,000 cavalry. Secret articles confirmed that Galicia would remain Austrian even in the event that the Kingdom of Poland were restored, although Austria had the option to exchange it for the Illyrian Provinces. Further secret articles stated that the corps would be indivisible and would serve under a commander nominated by Francis I and that Austria's obligation applied only to a war against Russia, wars against the United Kingdom, Spain and Portugal being expressly excluded.\nEven before the Treaty of Paris was signed, Metternich compared the it to the Treaty of Versailles of 1756, which begot a Diplomatic Revolution and a Franco-Austrian alliance, and himself to the Prince of Kaunitz-Rietberg, who negotiated it. He considered it a great diplomatic victory, since it was drawn up as a treaty between equals that preserved Austria's independence. This contrasts with the Franco-Prussian treaty, which turned Prussia into a subordinate of France.\nA month after signing the treaty, Metternich assured Tsar Alexander I of Russia that Austria would not pursue a war with any vigour. Despite this duplicity, Austria did make its required contribution to the French invasion of Russia in June 1812.\nNotes\nBibliography\n*\n*\n*"
    }
  ]
}