{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Fort Laramie (1868)\n\n| location_signed         = Fort Laramie, Wyoming\n| date_sealed             =\n| date_effective          =\n| condition_effective     =\n| date_expiration         =\n| date_expiry             =\n| provisional_application =\n| mediators               =\n| negotiators             = Indian Peace Commission\n| original_signatories    =\n| signatories             =\n* BruléOglalaArapahoMiniconjouYanktonai\n| parties                 =\n| ratifiers               = US Senate\n| depositor               =\n| depositories            =\n| citations               =\n| language                = English\n| languages               =\n| wikisource              = Fort Laramie Treaty of 1868\n| footnotes               =\n}}\nThe Treaty of Fort Laramie (also the Sioux Treaty of 1868}}) is an agreement between the United States and the Oglala, Miniconjou, and Brulé bands of Lakota people, Yanktonai Dakota, and Arapaho Nation. The first Fort Laramie treaty, signed in 1851, had been a resounding failure. The United States had almost immediately violated it, with American miners and settlers immigrating into Indian territory. The United States Army had further broken the 1851 treaty when it initiated an armed invasion that resulted in the Grattan massacre in 1854, which sparked the first Sioux War. The 1868 treaty negotiations were thus initiated to replace the 1851 treaty, which had proven entirely ineffective.\nThe treaty is divided into 17 articles. It established the Great Sioux Reservation including ownership of the Black Hills, and set aside additional lands as \"unceded Indian territory\" in the areas of South Dakota, Wyoming, Nebraska, and possibly Montana. It established that the US government would hold authority to punish not only white settlers who committed crimes against the tribes but also tribe members who committed crimes and were to be delivered to the government, rather than to face charges in tribal courts. It stipulated that the government would abandon forts along the Bozeman Trail and included a number of provisions designed to encourage a transition to farming and to move the tribes \"closer to the white man's way of life.\" The treaty protected specified rights of third parties not partaking in the negotiations and effectively ended Red Cloud's War. That provision did not include the Ponca, who were not a party to the treaty and so had no opportunity to object when the American treaty negotiators \"inadvertently\" broke a separate treaty with the Ponca by unlawfully selling the entirety of the Ponca Reservation to the Lakota, pursuant to Article II of this treaty. The United States never intervened to return the Ponca land. Instead, the Lakota claimed the Ponca land as their own and set about attacking and demanding tribute from the Ponca until 1876, when US President Ulysses S. Grant chose to resolve the situation by unilaterally ordering the Ponca removed to the Indian Territory. The removal, known as the Ponca Trail of Tears, was carried out by force the following year and resulted in over 200 deaths.\nThe treaty was negotiated by members of the government-appointed Indian Peace Commission and signed between April and November 1868 at and near Fort Laramie, in the Wyoming Territory, with the final signatories being Red Cloud himself and others who accompanied him. Animosities over the agreement arose quickly, with open war breaking out again in 1876, and in 1877 the US government unilaterally annexed native land protected under the treaty.\nThe treaty formed the basis of the 1980 Supreme Court case, United States v. Sioux Nation of Indians, in which the court ruled that tribal lands covered under the treaty had been taken illegally by the US government, and the tribe was owed compensation plus interest. As of 2018 this amounted to more than $1 billion. The Sioux refused the payment, having demanded instead the return of their land which would not be possible to contest if the monetary compensation was accepted.\nBackground\nterritories. Later and at different times, each tribe would enter into new treaties with the US. The result was an often-changing patchwork of bigger and smaller parts of the initial allocations, newly established reservations, and former tribal land turned into new US territory. The bold outline shows the 1851 Sioux treaty area.]]\nThe first Treaty of Fort Laramie, signed in 1851, attempted to resolve disputes between tribes and the US Government, as well as among tribes themselves, in the modern areas of Montana, Wyoming, Nebraska, and North and South Dakota. It set out that the tribes would make peace among one another, allow for certain outside access to their lands (for activities such as travelling, surveying, and the construction of some government outposts and roads), and that tribes would be responsible for wrongs committed by their people. In return, the US Government would offer protection to the tribes, and pay an annuity of $50,000 per year.\nNo land covered by the treaty was claimed by the US at the time of signing. The five \"respective territories\" of the participating tribes – Sioux, Arapaho and Cheyenne, Crow, Assiniboine, Arikara, Hidatsa and Mandan – were defined. North of the Sioux, the Arikara, Hidatsa and Mandan held a joint territory. The territory of the Crows extended westward from that of their traditional enemies in the Sioux tribe. The Powder River divided the two lands.\nWhen the Senate reduced the annuity to 10 years from originally 50, all tribes except the Crow accepted the cut. Nevertheless, the treaty was recognized as being in force.\nThe 1851 treaty had a number of shortcomings which contributed to the deterioration of relations, and subsequent violence over the next several years. From an inter-tribal view, the lack of any \"enforcement provisions\" protecting the 1851 boundaries proved a drawback for the Crow and the Arikara, Hidatsa and Mandan. The federal government never kept its obligation to protect tribal resources and hunting grounds, and only made a single payment toward the annuity.\nAlthough the federal government operated via representative democracy, the tribes did so through consensus, and although local chiefs signed the treaty as representatives, they had limited power to control others who themselves had not consented to the terms. The discovery of gold in the west, and the construction of the Union Pacific Railroad, led to substantially increased travel through the area, largely outside the 1851 Sioux territory. This increasingly led to clashes between the tribes, settlers, and the US government, and eventually open war between the Sioux (and the Cheyenne and Arapaho refugees from the Sand Creek massacre in Colorado, 1864) and the whites in 1866.\n, along with major treaty boundaries. During Red Cloud's War, the Sioux defeated the US Army on the same plains on which they previously defeated the Crow. In 1868, the US and the Sioux entered into negotiations regarding the western Powder River area, although neither held the treaty rights to the land.]]\nNone of the other tribes signing the 1851 treaty engaged in battle with the US soldiers, and most allied with the Army. With the 1851 intertribal peace soon broken, the Arikara, Hidatsa and Mandan called for US military support against raiding Sioux Indians in 1855. By summer 1862, the three tribes had abandoned all their permanent villages of earth lodges in the treaty territory south of the Missouri, which was now under Sioux control, and lived together in Like-a-Fishhook Village north of the river.\nIn the mid-1850s, the western Sioux bands crossed the Powder River and entered the Crow treaty territory. Sioux chief Red Cloud organized a war party against a Crow camp at the mouth of Rosebud River in 1856. Despite the Crows fighting \"... large-scale battles with invading Sioux\" near present-day Wyola in Montana, the Sioux had taken over the western Powder River area by 1860.\nIn 1866 the United States Department of the Interior called on tribes to negotiate safe passage through the Bozeman Trail, while the United States Department of War moved Henry B. Carrington, along with a column of 700 men into the Powder River Basin, sparking Red Cloud's War. However, most of the wagon track to the city of Bozeman \"crossed land guaranteed to the Crows under the 1851 treaty\" \"... the Sioux attacked the United States anyway, claiming the Yellowstone was now their land.\" Red Cloud's war \"... appeared to be a great Sioux war to protect their land. And it was – but the Sioux had only recently conquered this land from other tribes and now defending the territory both from other tribes\" and the passing through of whites. During the war, the Crows sided with the soldiers in the isolated garrisons. Crow warrior Wolf Bow urged the Army to, \"Put the Sioux Indians in their own country, and keep them from troubling us.\"\nAfter losing resolve to continue the war, following defeat in the Fetterman Fight, sustained guerrilla warfare by the Sioux, Cheyenne and Arapaho, exorbitant rates for freight through the area, and difficulty finding contractors to work the rail lines, the US Government, organized the Indian Peace Commission to negotiate an end to ongoing hostilities. A peace counsel chosen by the government arrived on April 19, 1868, at Fort Laramie, in what would later become the state of Wyoming. The outcome would be the second treaty of Fort Laramie Treaty, signed in 1868.\nArticles\nThe treaty was laid out in a series of 17 articles:\nArticle I\nwith annuities owed the Sioux, after the Massacre Canyon battle in Nebraska on August 5, 1873. The Pawnee received $9,000.]]\nArticle one called for the cessation of hostilities, stating \"all war between the parties to this agreement shall for ever  cease.\" If crimes were committed by \"bad men\" among white settlers, the government agreed to arrest and punish the offenders, and reimburse any losses suffered by injured parties. The tribes agreed to turn over criminals among them, any \"bad men among the Indians,\" to the government for trial and punishment, and to reimburse any losses suffered by injured parties. If any Sioux committed \"a wrong or depredation upon the person or property on any one, white, black, or Indians\" the US could pay damages taken from the annuities owed the tribes. These terms effectively relinquished the authority of the tribes to punish crimes committed against them by white settlers. In addition, these terms would subject tribal members to judgment under the U.S. government.\nSimilar provisions appeared in nine such treaties with various tribes. In practice, the \"bad men among the whites\" clause was seldom enforced. The first plaintiff to win a trial case on the provision did so in 2009, based on the 1868 Fort Laramie treaty.\nIn 1873, the US exercised the right to withhold annuities and compensate for Sioux wrongs against anyone, including Indians. After a massacre on a moving Pawnee camp during a legal Sioux hunting expedition in Nebraska, the Sioux \"were made to pay reparations for the loss of life, meat, hides, equipment, and horses stolen...\" The Pawnee received $9,000.\nArticle II\n]]\nArticle two of the treaty changed the boundaries for tribal land and established the Great Sioux Reservation, to include areas of present day South Dakota west of the Missouri River, including the Black Hills. This was set aside for the \"absolute and undisturbed use and occupation of the Indians\". In total, it allocated about 25% of the Dakota Territory as it existed at the time. It made the total tribal lands smaller, and moved them further eastward. This was to \"take away access to the prime buffalo herds that occupied the area and encourage the Sioux to become farmers.\"\nThe government agreed that no parties, other than those authorized by the treaty, would be allowed to \"pass over, settle upon, or reside in the territory\". According to one source writing on article two, \"What remained unstated in the treaty, but would have been obvious to Sherman and his men, is that land not placed in the reservation was to be considered United States property, and not Indian territory.\"\nAs in 1851, the US recognized most of the land north of the Sioux reservation as Indian territory of the Arikara, Hidatsa and Mandan. In addition, the US still recognized the 1851 Crow claim to the Indian territory west of the Powder. The Crow and the US came to an agreement about this expanse on May 7, 1868.\nWith the reservation border following \"the northern line of Nebraska\", the Peace Commission ceded to the Sioux the original Ponca Reservation, which had already been guaranteed the Ponca in multiple treaties with the government. \"No one has ever been able to explain\" this blunder, which was nonetheless enforced by the government, irrespective of their earlier agreements.\nArticle III\nArticle three provided for allotments of up to  of tillable land to be set aside for farming by members of the tribes. By 1871, 200 farms of  and 200 farms of  had been established including 80 homes. By 1877, this had risen to 153 homes \"50 of which had shingle roofs and most had board floors\" according to an 1876 report by the Bureau of Indian Affairs.\nArticle IV\nThe government agreed to build a number of buildings on the reservation:\n* Warehouse\n* Store-room\n* Agency building\n* Physician residence\n* Carpenter residence\n* Farmer residence\n* Blacksmith residence\n* Miller residence\n* Engineer residence\n* School house\n* Saw mill\nArticle four also provided for the establishment of an agency on the reservation for the purpose of government administration. In practice, five were constructed and two more later added. These original five were composed of the Grand River Agency (Later Standing Rock), Cheyenne River Agency, Whetstone Agency, Crow Creek Agency, and Lower Brulé Agency. Another would later be set up on the White River, and again on the North Platte River, but would later be moved to also be on the White.\nArticles V through X\nThe government agreed that the agent for the Bureau of Indian Affairs shall keep his office open to complaints, which he will investigate and forward to the Commissioner. The decision of the Commissioner, subject to review by the Secretary of the Interior, \"shall be binding on the parties\".\nArticle six laid out provisions for members of the tribes to take legal individual ownership of previously commonly held land, up to  for the heads of families, and  for any adult who was not the head of a family. This land then \"may be occupied and held in the exclusive possession of the person selecting it, and of his family, so long as he or they may continue to cultivate it.\"\nArticle seven addressed education for those aged six to 16, in order, as the treaty states, to \"insure the civilization of the Indians entering into this treaty\". The tribes agreed to compel both male and females to attend school, and the government agreed to provide a schoolhouse and teacher for every 30 students who could be made to attend.\nIn article eight, the government agreed to provide seeds, tools, and training for any of the residents who selected tracts of land, and agreed to farm them. This was to be in the amount of up to $100 worth for the first year, and up to $25 worth for the second and third years. These were one of a number of provisions of the treaty designed to encourage farming, rather than hunting, and move the tribes \"closer to the white man's way of life.\"\nAfter 10 years the government was able to withdraw the individuals from article 13, but if so, it would provide $10,000 annually \"devoted to the education of said Indians ... as will best promote the education and moral improvement of said tribes.\" These were to be managed by a local Indian agent under the Commissioner of Indian Affairs.\nArticle 10 provided for an allotment of clothes, and food, in addition to one \"good American cow\" and two oxen for each lodge or family who moved to the reservation. It further provided for an annual payment over 30 years of $10 for each person who hunted, and $20 for those who farmed, to be used by the Secretary of the Interior for the \"purchase of such articles as from time to time the condition and necessities of the Indians may indicate to be proper.\"\nArticle XI\ns for the tribal leaders, as a substitute for signed names]]\nArticle 11 included several provisions stating the tribes agreed to withdraw opposition to the construction of railroads (mentioned three times), military posts and roads, and will not attack or capture white settlers or their property. The same guarantee protected third parties defined as \"persons friendly\" with the United States. The government agreed to reimburse the tribes for damages caused in the construction of works on the reservation, in the amount assessed by \"three disinterested commissioners\" appointed by the President. It guaranteed the tribes access to the area to the north and west of the Black Hills as hunting grounds, \"so long as the buffalo may range thereon in such numbers as to justify the chase.\"\nAs one source examined the treaty language with regard to \"so long as the buffalo may range\", the tribes considered this language to be a perpetual guarantee, because \"they could not envision a day when buffalo would not roam the plains\"; however:\nThe concept was clear enough to the commissioners … [who] well knew that hide hunters, with Sherman's blessing, were already beginning the slaughter that would eventually drive the Indians to complete dependence on the government for their existence.\nDespite Sioux promises of undisturbed construction of railroads and no attacks, more than 10 surveying crew members, US Army Indian scouts and soldiers were killed in 1872 and 1873.\nBecause of the Sioux massacre on the Pawnee in southern Nebraska during a hunting expedition in 1873, the US banned such hunts outside the reservation. Thus, the US decision nullified a part of Article XI.\nArticle XII\nArticle 12 required the agreement of \"three-fourths of all the adult male Indians\" for a treaty with the tribes to \"be of any validity\".  Hedren reflected on article 12 writing that the provision indicated the government \"already anticipated a time when different needs would demand the abrogation of the treaty terms.\" These provisions have since been controversial, because subsequent treaties amending that of 1868 did not include the required agreement of three-fourths of adult males, and so under the terms of 1868, are invalid.}}\nArticles XIII through XV\nThe government agreed to furnish the tribes with a \"physician, teachers, carpenter, miller, engineer, farmer, and blacksmiths\".\nThe government agreed to provide $100 in prizes for those who \"in the judgment of the agent may grow the most valuable crops for the respective year.\" Once the promised buildings were constructed, the tribes agreed to regard the reservation as their \"permanent home\" and make \"no permanent settlement elsewhere\".\nArticle XVI\nterritory west of Powder River enlarged]]\nArticle 16 stated that country north of the North Platte River and east of the summits of the Big Horn Mountains would be \"unceded Indian territory\" that no white settlers could occupy without the consent of the tribes. This included  of land outside the reservation which were previously set aside by the 1851 treaty, as well as around an additional . As part of this, the government agreed to close the forts associated with the Bozeman Trail. Article 16 did not however, address issues related to important hunting grounds north and northwest of the reservation. The Arikara, Hidatsa and Mandan held the treaty right to the bigger part of those hunting grounds according to the 1851 treaty. With the 1868 treaty, the Sioux ceded land to the US directly north of the reservation.\nThis article proclaims the shift of the Indian title to the land east of the summits of the Big Horn Mountains to Powder River (the combat zone of Red Cloud's War). In 1851, the US had acknowledged the claim of the Crow to this area. Following defeat, the Peace Commission recognized it as \"unceded Indian territory\" held by the Sioux. The US Government could only dispose of Crow treaty territory, because it held parallel negotiations with the Crow tribe. The talks ended on May 7, 1868. The Crows accepted to give up large tracts of land to the US and settle on a reservation in the heart of the 1851 territory.\nIt was possible for the Peace Commission to allow the Sioux to hunt on the Republican Fork in Nebraska (200 miles south of the Sioux reservation) along with others, because the US held the title to this river area. The Cheyenne and Arapaho had ceded the western part of the Republican Fork in 1861 in a more-or-less well-understood treaty. The US had bought the eastern part of the Republican Fork from the Pawnee in 1833. The Pawnee held a treaty right to hunt in their ceded territory. In 1873, the Massacre Canyon battle took place here.\nArticle XVII\nThe treaty, as agreed to \"shall be construed as abrogating and annulling all treaties and agreements heretofore entered into.\"\nSigning\nOver the course of 192 days ending November 6, the treaty was signed by a total of 156 Sioux, and 25 Arapaho, in addition to the commissioners, and an additional 34 signatories as witnesses. Although the commissioners signed the document on April 29 along with the Brulé, the party broke up in May, with only two remaining at Fort Laramie to conclude talks there, before traveling up the Missouri River to gather additional signatures from tribes elsewhere. Throughout this process, no further amendments were made to the terms. As one writer phrased it, \"the commissioners essentially cycled Sioux in and out of Fort Laramie ... seeking only the formality of the chiefs' marks and forgoing true agreement in the spirit that the Indians understood it.\"\nFollowing initial negotiations, those from the Peace Commission did not discuss the conditions of the treaty to subsequent tribes who arrived over the following months to sign. Rather, the treaty was read aloud, and it was permitted \"some time for the chiefs to speak\" before \"instructing them to place their marks on the prepared document.\" As the source continues:\nThese tribes had little interest in or understanding of what had taken place at the Fort Laramie councils. They wanted the whites out of their country and would fight as long as necessary.\nThe process of abandoning the forts associated with the Bozeman Trail, as part of the conditions agreed to, proved to be a long process, and was stalled by difficulty arranging the sale of the goods from the fort to the Bureau of Indian Affairs. Fort C.F. Smith was not emptied until July 29. Fort Phil Kearny and Fort Reno were not emptied until August 1. Once abandoned, Red Cloud and his followers, who had been monitoring the activities of the troops rode down and burned what remained.\nThe peace commission dissolved on October 10 after presenting its report to Congress, which among other things, recommended the government \"cease to recognize the Indian tribes as domestic dependent nations,\" and that no further \"treaties shall be made with any Indian tribe.\" William Dye, the commander at Fort Laramie was left to represent the commission, and met with Red Cloud, who was among the last to sign the treaty on November 6. The government remained unwilling to negotiate the terms further, and after two days, Red Cloud is reported to have \"washed his hands with the dust of the floor\" and signed, formally ending the war.\nThe US Senate ratified the treaty on February 16, 1869.\nSignatories\nNotable signatories presented in the order they signed are as follows. Two exceptions are included. Henderson was a commissioner, but did not sign the treaty. Red Cloud was among the last to sign, but is listed here out-of-order along with the other Oglala.\nCommissioners\n* Nathaniel Green Taylor, Commissioner of Indian Affairs\n* William Tecumseh Sherman, lieutenant general, US Army According to the same source, Sherman was also recalled to Washington D.C. the following April to testify in the Impeachment of Andrew Johnson.}}\n* William S. Harney, Brevet major general, US Army\n* John B. Sanborn, former  brevet major general of volunteers, and former member of a previous peace commission organized by Alfred Sully\n* Samuel F. Tappan, journalist, abolitionist, and activist who rose to prominence after investigating the Sand Creek massacre\n* Christopher C. Augur, Brevet Major General, and commander of the Department of the Platte}}\n* Alfred Terry, Brevet major general, US Army\n* John B. Henderson, US Senator and Chairman of the United States Senate Committee on Indian Affairs\nChiefs and headmen\nBrulé\n* Iron Shell\n* Spotted Tail\n* White Bull\n* Iron Nation\nOglala\n* Young Man Afraid Of His Horses\n* Clown Horse\n* Sitting BullAlthough Sitting Bull was a member of the Hunkpapa Lakota, his signature is listed on the treaty itself under \"the Ogallalla band of Sioux by the chiefs and headmen whose names are hereto subscribed\". Whether this may be attributable to error on the part of those who crafted the treaty or those bearing witness and recording the signatures is unclear.}}\n* American Horse\n* Blue Horse\n* Red Cloud His arrival at the fort is variously reported as both November 4 and October 4, although both agree he signed the treaty on November 6.}}\nArapaho\n*Black Bear\n*Black Coal\n*Sorrel Horse\nMiniconjou\n* Lone Horn\n* Spotted Elk\n* Big Eagle\nYanctonais\n* Little Soldier\n* Red Horse\n* Little Shield\nAftermath and legacy\n, and the subsequent changes in reservation borders]]\nAlthough the treaty required the consent of three-fourths of the men of the tribes, many did not sign or recognize the results. Others would later complain that the treaty contained complex language that was not well explained in order to avoid arousing suspicion. Yet others would not fully learn the terms of the agreement until 1870, when Red Cloud returned from a trip to Washington D.C.\nThe treaty overall, and in comparison with the 1851 agreement, represented a departure from earlier considerations of tribal customs, and demonstrated instead the government's \"more heavy-handed position with regard to tribal nations, and ... desire to assimilate the Sioux into American property arrangements and social customs.\"\nAccording to one source, \"animosities over the treaty arose almost immediately\" when a group of Miniconjou were informed they were no longer welcome to trade at Fort Laramie, being south of their newly established territory. This was notwithstanding that the treaty did not make any stipulation that the tribes could not travel outside their land, only that they would not permanently occupy outside land. The only travel expressly forbidden by the treaty was that of white settlers onto the reservation.\nAlthough a treaty between the US and the Sioux, it had profound effect on the Crow tribe, since it held the title to some of the territories set aside in the new treaty. By entering the peace talks \"... the government had in effect betrayed the Crows, who had willingly helped the army to hold the [Bozeman Trail] posts ...\".\nWhen the Sioux Indians had stopped the advance of the US in 1868, they quickly resumed their \"own program of expansions\" into the adjoining Indian territories. Although all parties took and gave, the Sioux and their allies once again threatened the homeland of some of the Indian nations around them. Attacks on the Crows and the Shoshones were \"frequent, both by the Northern Cheyennes and by the Arapahos, as well as the Sioux, and by parties made up from all three tribes\". The Crows reported Sioux Indians in the Bighorn area from 1871. This eastern part of the Crow reservation was taken over a few years later by the Sioux in quest of buffalo. When a force of Sioux warriors confronted a Crow reservation camp at Pryor Creek in 1873 throughout a whole day, Crow chief Blackfoot called for decisive actions against the Indian intruders by the US. In 1876, the Crows (and the Eastern Shoshones) fought alongside the Army at the Rosebud. They scouted for Custer against the Sioux, \"who were now in the old Crow country\".\nBoth the tribes and the government chose to ignore portions of the treaty, or to \"comply only as long as conditions met their favor,\" and between 1869 and 1876, at least seven separate skirmishes occurred within the vicinity of Fort Laramie. Prior to the Black Hills expedition, Army sources mention attacks in Montana north of the Yellowstone and north of the Sioux reservation in North Dakota carried out by unidentified groups of Sioux. Large war parties of Sioux Indians left their reservation to attack distant Indian enemies near Like-a-Fishhook Village. The first talks of actions against the Sioux arose. In his 1873 report, the Commissioner of Indian Affairs advocated, \"that those [Sioux] Indians roaming west of the Dakota line be forced by the military to come in to the Great Sioux Reservation.\"\nThe government eventually broke the terms of the treaty following the Black Hills Gold Rush and an expedition into the area by George Armstrong Custer in 1874, and failed to prevent white settlers from moving onto tribal lands. Rising tensions eventually led again to open conflict in the Great Sioux War of 1876.\nThe 1868 treaty would be modified three times by the US Congress between 1876 and 1889, each time taking more land originally granted, including unilaterally seizing the Black Hills in 1877.\nUnited States v. Sioux Nation of Indians\nOn June 30, 1980, the US Supreme Court ruled that the government had illegally taken land in the Black Hills granted by the 1868 treaty, by unlawfully abrogating article two of the agreement during negotiations in 1876, while failing to achieve the signatures of two-thirds the adult male population required to do so. It upheld an award of $15.5 million for the market value of the land in 1877, along with 103 years worth of interest at 5 percent, for an additional $105 million. The Lakota Sioux, however, have refused to accept payment and instead continue to demand the return of the territory from the United States.  the Sioux interest on the money has compounded to over 1 billion dollars.\nCommemoration\nMarking the 150th anniversary of the treaty, the South Dakota Legislature passed Senate Resolution 1, reaffirming the legitimacy of the treaty, and according to the original text, illustrating to the federal government that the Sioux are \"still here\" and are \"seeking a future of forward-looking, positive relationships with full respect for the sovereign status of Native American nations confirmed by the treaty.\"\nOn March 11, 2018, the Governor of Wyoming, Matt Mead signed a similar bill into law, calling on \"the federal government to uphold its federal trust responsibilities,\" and calling for a permanent display of the original treaty, on file with the National Archives and Records Administration, in the Wyoming Legislature.\nHerrera v. Wyoming\nIn May 2019, in a 5–4 decision, the U.S. Supreme Court ruled in the Herrera v. Wyoming case that Wyoming's statehood did not void hunting rights which were guaranteed to the Crow tribe by the treaty.\nSee also\n* Black Hills Land Claim, ongoing dispute between the Sioux and the US Government\n* Dakota Access Pipeline, underground oil pipeline, opposed by some Sioux based on the terms of the 1851 and 1868 treaties\n* Indian Appropriations Act, series of legislation passed by the US government related to tribal lands\n* List of United States treaties, articles on treaties to which the US was a party\n* Medicine Lodge Treaty – Negotiated by the Peace Commission with southern Plains Indian tribes in 1867\nNotes\nReferences\nFurther reading\n* [http://digital.library.okstate.edu/kappler/Vol2/treaties/sio0998.htm \"Treaty with the Sioux — Brulé, Oglala, Miniconjou, Yanktonai, Hunkpapa, Blackfeet, Cuthead, Two Kettle, Sans Arcs, and Santee — and Arapaho, 1868\" (Treaty of Fort Laramie, 1868).] , April 29, 1868. Ratified February 16, 1868; proclaimed February 24, 1868. In Charles J. Kappler, compiler and editor, Indian Affairs: Laws and Treaties — Vol. II: Treaties. Washington, D.C.: Government Printing Office, 1904, pp.&nbsp;998–1007. Through Oklahoma State University Library, Electronic Publishing Center...\n*\nExternal links\n* [https://www.govinfo.gov/link/statute/15/635?link-type=pdf&.pdf Treaty text] ([https://www.govinfo.gov/link/statute/15/635?link-type=details 15 Stat. 635]) in the US Statutes at Large\n* [http://insiderexclusive.com/american-indian-rights-and-treaties-the-story-of-the-1868-treaty-of-fort-laramie/ American Indian Rights And Treaties – The Story Of The 1868 Treaty Of Fort Laramie], video from Insider Exclusive\n* [http://nmai.si.edu/nk360/plains-treaties-fort-laramie/index.html#introduction Fort Laramie Treaty: Case Study] from the National Museum of the American Indian\n* [http://www2.mnhs.org/library/findaids/sv000194.xml Collection of Photographs] by Alexander Gardner, from his travels with the Peace Commission at Fort Laramie in 1868, from the Minnesota Historical Society"
    }
  ]
}