{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Karlowitz__disambig_1\n\n| location_signed     = Karlowitz, Military Frontier, Habsburg monarchy (now Sremski Karlovci, Serbia)\n| date_sealed         =\n| date_effective      =\n| condition_effective =\n| date_expiration     =\n| date_expiry         =\n| negotiators         =\n| signatories         =\n*  Rami Mehmed Pasha (Reis ül-Küttab)\n*  Alex. Mavrocordatos (Dragoman of the Porte)\n*  Count Kinsky\n*  Count Oettingen\n*  Leopold Schlick\n*  Carlo Ruzzini\n*  Stanisław Małachowski|pl|3=Stanisław Małachowski (wojewoda poznański)}}\n*\n| parties             =\n*  (mediators)\n*  (mediators)\n*\n*\n*  Poland–Lithuania\n*\n*\n*  Tsardom of Russia (truce)\n| ratifiers           =\n| depositor           =\n| depositories        =\n|\n| languages           =\n| languagesclass      =\n|\n| wikisource          =\n| wikisource1         =\n}}\nThe Treaty of Karlowitz, concluding the Great Turkish War of 1683–1699, in which the Ottoman Empire was defeated by the Holy League at the Battle of Zenta, was signed in Karlowitz (present-day Sremski Karlovci, Serbia), in the Military Frontier of the Habsburg Monarchy, on 26 January 1699. Also known as \"The Austrian treaty that saved Europe\", it marks the end of Ottoman control in much of Central Europe, with their first major territorial losses in Europe, beginning the reversal of almost three centuries of expansion (1299–1683). The treaty established the Habsburg monarchy as the dominant power of the region.\nContext and terms\nFollowing a two-month congress between the Ottoman Empire on one side, and the Holy League of 1684– a coalition of the Holy Roman Empire (HRE), the Polish–Lithuanian Commonwealth, the Republic of Venice, and Peter the Great– the tsar of Russia, a peace treaty was signed on 26 January 1699.\nOn the basis of , the treaty confirmed the territorial holdings of each power. The Habsburgs received from the Ottomans the Eğri Eyalet, Varat Eyalet, much of the Budin Eyalet, the northern part of the Temeşvar Eyalet, and parts of the Bosnia Eyalet. That corresponded to much of Hungary, Croatia, and Slavonia. The Principality of Transylvania remained nominally independent, but was subject to the direct rule of Austrian governors.\nThe Polish–Lithuanian Commonwealth recovered Podolia with the undestroyed fortress at Kamianets-Podilskyi (Although the fortress in Kamianets was not recaptured in the 1698 campaign). Therefore, the areas that were lost 27 years earlier in the Treaty of Buchach in 1672 were regained. In return, the Polish–Lithuanian Commonwealth gave back captured fortresses in Moldova. The treaty also assumed the release of prisoners, the displacement of the Buda Tatars from Moldova, the end of Tatar raids, the rendition of fugitives (Cossacks to the Commonwealth, Moldovans to Ottomans), and the cessation of tribute payments by the commonwealth. The commonwealth never again had a military conflict with Ottomans.\nVenice obtained most of Dalmatia, along with the Morea (the Peloponnese peninsula of southern Greece), though the Morea was restored to the Turks within 20 years by the Treaty of Passarowitz. There was no agreement about the Holy Sepulchre, although it was discussed in Karlowitz.\nThe Ottomans retained Belgrade, the Banat of Temesvár (now Timișoara), as well as suzerainty over Wallachia and Moldavia. Negotiations with the Tsardom of Russia for a further year, under a truce agreed at Karlowitz, culminated in the Treaty of Constantinople of 1700, in which the Sultan ceded the Azov region to Peter the Great. (Russia had to return the territories eleven years later after the failed Pruth River Campaign and the Treaty of the Pruth in 1711.)\nCommissions were set-up to devise the new borders between the Austrians and the Turks, with some parts disputed until 1703. Largely through the efforts of the Habsburg commissioner Luigi Ferdinando Marsili, the Croatian and Bihać borders were agreed-upon by mid-1700, and the borders at Temesvár by early 1701, leading to a border that was demarcated by physical landmarks for the first time.\nThe acquisition of around  of Hungarian territories at Karlowitz, and of the Banat of Temesvár 18 years later by the Treaty of Passarowitz, enlarged the Habsburg monarchy to its largest extent to that point, cementing the Archduchy of Austria as a dominant regional power. It was later increased further in size by the acquisition of Polish territories in 1772 and 1795, by the annexation of Dalmatia in 1815, and by the annexation of Bosnia and Herzegovina in 1908.\nThe treaty was a watershed moment in the history of the Ottoman Empire, which, for the first time, lost substantial amounts of territory after three-and-a-half centuries of expansionism in Europe. Although the Ottoman borders in the region would wax and wane over the next 100 years, never again would there be any further acquisition of territory on a scale seen during the reigns of Mehmed the Conqueror, Selim the Grim, or Suleiman the Magnificent in the 15th-16th centuries. Indeed, after the mid-1700s, the Ottoman frontier was largely delimited to the south of the Sava River and the Balkans proper, and would be further pushed southward as the 19th century began.\nMaps and images\n|File:Eyalet of temesvar1699.png|alt3=Another map of the northern Balkans, now in 1699 after the treaty. The same area is now mainly possessed by the Habsburg Empire.|Political situation in 1699, after the treaty:\n|File:Territorial changes of the Polish–Lithuanian Commonwealth (union state of the Crown of the Kingdom of Poland and Grand Duchy of Lithuania), 1686.jpg|alt4=|The Polish–Lithuanian Commonwealth in 1686, before the treaty\n|File:Territorial changes of Poland 1699.jpg|alt5=|The Polish–Lithuanian Commonwealth in 1699, after the treaty. Note the Ottoman loss of territory at the bottom of the map.\n|File:Sremski_Karlovci,_Kapela_Mira.jpg|alt6=|Chapel of Peace, where the Treaty of Karlowitz was negotiated\n}}\nSee also\n* Great Migrations of the Serbs\nNotes\nReferences\n*\n*\nFurther reading\n*\n*\n*\nExternal links\n* [http://www.britannica.com/eb/article-9020364/Treaty-of-Carlowitz Treaty of Karlowitz], Encyclopædia Britannica\n* [https://archive.org/stream/generalcollectio00lond#page/290/mode/2up English text of treaty]"
    }
  ]
}