{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Labiau\n\nCharles X Gustav of Sweden\n*  Frederick William I of Brandenburg\n| parties             =\n*  Swedish Empire\n*  House of Hohenzollern\n| depositor           =\n| language            = Latin\n| languages           =\n| website             =\n| wikisource          =\n}}\nThe Treaty of Labiau was a treaty signed between Frederick William I, Elector of Brandenburg and Charles X Gustav of Sweden on 10 November (O.S.) / 20 November (N.S.) 1656 in Labiau (now Polessk). With several concessions, the most important being the elevation of Frederick William I from a Swedish vassal to a full sovereign in the Duchy of Prussia and in Ermland (Ermeland, Warmia), Charles X Gustav strove to \"buy Frederick William's support\" in the ongoing Second Northern War.\nBackground\n(yellow) in a map of 1576, 1645 reprint. Labiau indicated as \"Labiaw\"]]\nWhen the Second Northern War broke out in 1654, Charles X Gustav of Sweden offered an alliance to Frederick William I, the \"Great Elector\" of Brandenburg and duke of Prussia. As the price for this alliance would have been the surrender of the Prussian ports of Pillau (now Baltiysk) and Memel (now Klaipėda) to Sweden, Frederick William I refused and instead signed a defensive alliance with the Dutch Republic in 1655.\nFollowing Swedish military successes, including an invasion of Prussia, Frederick William I was forced to take Prussia as a fief from the Swedish king in the Treaty of Königsberg on 7 January (O.S.) / 17 January (N.S.) 1656. Before, Frederick William I had held that duchy as a fief of the Polish king. In Königsberg, the \"Great Elector\" further had to meet the Swedish demands for Pillau and Memel, promise financial and military aid, and surrender half of the port duties to Sweden.\nOn 15 June (O.S.) / 25 June (N.S.) 1656, Charles X Gustav and Frederick William I concluded a formal alliance in the Treaty of Marienburg after Swedish advances in the Polish–Lithuanian Commonwealth had stalled. Sweden offered conquered Polish territories, and Frederick William I went to support Charles X Gustav with his newly formed army in the Battle of Warsaw on 28–30 July, which marked \"the beginning of Prussian military history\".\nThough victorious, the subsequent entry into the war of the Russian tsar, the Holy Roman Emperor and the Dutch navy left Sweden in an unfavourable condition, and dependent on further Brandenburgian support. This enabled Frederick William I to raise the price for remaining a Swedish ally, and Charles X Gustav met his demands in the treaty of Labiau.\nTerms\nCharles X Gustav granted Frederick William I full souvereignity in the Duchy of Prussia and Ermland (Ermeland, Warmia). For his Prussian possessions, Frederick William I was elevated from the status of a duke to a princeps summus & Suverenus. Article III specifies that this applies also to Frederick William I's successors, who likewise would have the status of principes summi & absoluti Suverenii.\nSweden further relinquished her rights to collect custom dues in Prussian ports, in turn, Frederick William I was to satisfy Sweden with 120,000 riksdalers. A Calvinist himself, he also obliged himself to grant religious freedom to the Lutherans in his Prussian territories, confirming the similar articles IV and XVII of the treaties of Marienburg and Königsberg, respectively.\nIn addition to these terms, the treaty also included secret articles: therein, Frederick William I accepted Swedish claims to the Baltic coastal areas between Prussia and Swedish Livonia, namely Courland, Lithuania, Samogitia and Semigallia.\nConsequences\nas a Polish fief before the Second Northern War and as a Swedish fief after the Treaty of Königsberg.  Sweden granted sovereignty in Labiau and Poland–Lithuania in the Treaty of Wehlau-Bromberg.]]\nAfter the treaty, Frederick William I first continued his military support for Charles X Gustav by detaching some forces to join the latter's Polish campaigns in early 1657. However, after Denmark entered the war and Charles X Gustav left the Polish theater to campaign in Denmark, Frederick William I withdrew his forces from Poland and entrenched them in his Prussian territories.\nWhen an envoy of Ferdinand III, Holy Roman Emperor proposed Polish acceptance of Hohenzollern sovereignty in Prussia in turn for Frederick William I joining the anti-Swedish camp and supporting the Habsburg candidate in the next imperial elections, the \"Great Elector\" signaled his willingness to change sides. Thereupon, Polish king John II Casimir concluded the secret Treaty of Wehlau on 19 September 1657, wherein the Hohenzollern sovereignty over the Duchy of Prussia, but not Ermland, was confirmed in turn for an \"eternal alliance\" between Brandenburg-Prussia and Poland and religious freedom for the Catholics in Prussia.\nThe terms of Wehlau was confirmed by the Treaty of Bromberg in November, after which Brandenburg actively campaigned against Sweden. Frederick William I also gave his vote to the Habsburg candidate, after the emperor on 29 February 1658 agreed to another treaty providing Frederick William I with 10,000 forces to support his campaign in Swedish Pomerania.\nOn 18 January 1701, based on the sovereignty of the Prussian duchy, Frederick I of Prussia crowned himself \"King in Prussia.\"\nSee also\n*List of treaties\nReferences\nCitations\nGeneral and cited references\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n* [https://web.archive.org/web/20110719044609/http://www.ieg-mainz.de/likecms/index.php?site=site.htm&dir=&nav=&siteid=133&treaty=314&page=1&lastsiteid=77&sq=&is_fts=1&filter_select=&filter_wt=&filter_id=&filter_l=&filter_p=&searchlang=de&searchstring=1656&date=&year_from=&year_till=&location= Scan of the treaty of Labiau at ieg-mainz.de (Institut für Europäische Geschichte Mainz), 27 pages]"
    }
  ]
}