{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Berum\n\nThe Treaty of Berum was a treaty concluded on 28 January 1600 at Berum Castle, Berum, between Count Enno III of East Frisia and the County of Rietberg, which regulated the sale of the Lordships of Esens, Stedesdorf, and Wittmund to East Frisia.\nBackground\nWith the death of Balthasar Oomkens von Esens in 1540, the Attena line of East Frisian chieftains ruling Esens, Stedesdorf, and Wittmund died out and the Harlingerland fell to the Counts of Rietberg, who were related to the Attenas. From 1540, Harlingerland was ruled by Count John II of Rietberg, the son of Balthasar's sister. After his death, the Harlingerland went to his second daughter, Walburgis. In 1581, she married Count Enno III of East Frisia. They had two daughters, who, by the Treaty of Berum, waived their right to inherit Harlingerland, in favour of Enno's son Rudolf Christian, from his first marriage.\nContents\nSabine Catharine and her sister Agnes sold the Lordships of Esens, Stedesdorf, and Wittmund, and thus the entire Harlingerland, to their father, for . The payment was later increased to .  Sabina Catherine, the elder sister, would inherit the county of Rietberg. The Treaty was confirmed on 19 September 1600 by Emperor Rudolph II and later also by Archduke Albert, who was nominally Duke of Guelders and thereby liege lord of the Harlingerland.\nAftermath\nIn 1622, Ernst von Mansfeld stole the , packed in barrels, which Enno III had prepared as payment for Agnes and her husband Prince Gundakar of Liechtenstein.  So the payment could not be made then.\nIn 1663, demands for payment were renewed. Since East Frisia under Prince George Christian still could not pay, the liege lord of the County if Rietberg, the Prince-Bishop of Münster, try to collect the debt. He attacked East Frisia and occupied the sconce at Diele.  The States-General and Duke Eberhard III of Württemberg intervened. They drove out the Münster troops from Diele and mediated a compromise in which the payment was raised by another ."
    }
  ]
}