{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Compiègne (1624)__disambig_1\n\n| location_signed     = Compiègne, France\n| date_sealed         =\n| date_effective      =\n| condition_effective =\n| date_expiration     =\n| mediators            =\n| negotiators          =\n*  Cardinal Richelieu\n*  Nicolaas van den Bouckhorst\n*  Sweder van Haersolte\n*  Arnold van Randwijck\n| original_signatories =\n*  Louis XIII\n*  Frederick Henry\n| signatories         =\n| parties             =\n*\n*\n| depositor           =\n| languages           = French\n| website             =\n}}\nThe Treaty of Compiègne, signed on 10 June 1624, was a mutual defence alliance between the Kingdom of France and the Dutch Republic, for an initial period of three years.\nOne of a series of treaties designed to isolate Spain, France agreed to subsidise the Dutch in their War of Independence in return for naval assistance, as well as trading privileges. It ultimately proved controversial, since its provisions were used to require the Protestant Dutch to help suppress their French co-religionists in La Rochelle.\nBackground\nThe first half of the 17th century in Europe was dominated by the struggle between the Bourbon kings of France and their Habsburg rivals in Spain and in the Holy Roman Empire. Habsburg territories in the Spanish Netherlands, Franche-Comté, and the Pyrenees blocked French expansion, and left France it vulnerable to invasion. During the French Wars of Religion, Spain co-operated with the Catholic League in occupying large areas of France, before the succession of Henry IV in 1589 ended the conflict.\nAfter Henry's assassination in 1610, his wife Marie de' Medici became regent for the nine-year-old Louis XIII, and continued to exercise considerable influence after the regency ended in 1614. This led to a series of revolts by powerful regional nobles, both Catholic and Protestant, who resented attempts to reduce their authority, while religious tensions were heightened by the outbreak in 1618 of the Thirty Years War. In 1621, Royalist forces re-established Catholicism in the Protestant region of Béarn, resulting in a Huguenot rebellion led by Henri de Rohan and his brother Soubise. The revolt ended in stalemate with the October 1622 Treaty of Montpellier.\npossessions 1547]]\nHaving first entered government in 1616, Cardinal Richelieu's policy was to 'arrest the course of Spanish progress', and 'protect her neighbours from Spanish oppression'. Unlike many of his colleagues, he primarily opposed the Huguenots because their autonomy threatened the strong, centralised state needed to defeat Spain, rather than because of their religion; he later proved equally ruthless in attacking their Catholic counterparts.\nWith France weakened by internal divisions, Richelieu avoided direct conflict by supporting Spain's opponents, regardless of religion. This included funding the Protestant Dutch Republic in their 1568 to 1648 struggle for independence from Spain. In 1609, the two sides agreed a Twelve Years' Truce, and when the war restarted in 1621, Spain won a series of victories; by 1623, domestic opposition to the war and the heavy taxes levied to pay for it led the Dutch to seek external support.\nFor different reasons, both England and France were concerned by Spanish advances in the Netherlands; in the Anglo-Dutch defensive alliance of 5 June 1624, James I agreed to provide 6,000 troops for two years. The Treaty of Compiègne was part of a two-pronged approach by Richelieu, who was also negotiating an alliance with England that resulted in the marriage of Henrietta Maria of France to Charles I of England.\nProvisions\nThe principal negotiators were Richelieu for France and Nicolaas van den Bouckhorst, Sweder van Haersolte, and Arnold van Randwijck for the Dutch Republic. The signatories were Louis XIII and Frederick Henry, Prince of Orange.\nThe term of the treaty was three years, during which France would pay subsidies as long as the Dutch continued fighting Spain. They received an immediate payment of 480,000 thalers, with the second instalment in November; by 1625, France was funding approximately 8% of the total Dutch defence budget.\nAt this point, the French Navy was a negligible force, while the bulk of their merchant fleet was controlled by Huguenots. The Dutch gave France the right to purchase warships, agreed to contribute twenty for a joint attack on the Republic of Genoa, provide protection against pirates based in the Barbary States, and favourable terms for transporting French goods. However, they refused to allow French merchants to join voyages made by the Dutch East India Company or Dutch West India Company; the treaty ultimately agreed only to 'continue discussions'.\nThe Treaty of Compiègne was concluded on 10 June, ratified by the States General of the Netherlands on 12 July and by Louis XIII on 4 September.\nAftermath\n]]\nEncouraged by Richelieu, over the next few months England, Sweden, Denmark-Norway, Savoy and Republic of Venice agreed to co-ordinated action against Spain. In 1625, England declared war on Spain, Denmark invaded the Holy Roman Empire, while Venice and Savoy agreed to attack the Spanish Road, an overland route connecting Spanish areas in Italy with Flanders.\nHowever, this network of alliances was threatened in 1625 by another Huguenot revolt, centred on La Rochelle, then the second or third largest city in France, with over 30,000 inhabitants, and one of its most important ports. In addition to the customs duties generated by imports, it was also among the biggest producers of salt, a major source of taxes for the state; its economic  value and position made its capture crucial.\nRichelieu now activated the mutual defence provisions of both treaties; England was asked for seven warships, while the twenty Dutch vessels allocated for the attack on Genoa were now to be used against La Rochelle. Despite popular opposition to attacking fellow Protestants, the Dutch States-General felt they had no option, since they could not afford to lose France as an ally.\nA combined French, English and Dutch force defeated a Huguenot squadron at Pertuis Breton in September 1625; the remnants led by Soubise were given refuge in Falmouth, calling into question England's commitment to the French alliance. In December, the States General gave secret orders to their commander, Admiral Willem Haultain de Zoete, to use any excuse possible to withdraw his ships. He did so in February 1626, at which point the French exercised their right to purchase six of them.\nThe treaty of Compiègne thus allowed Richelieu to achieve his aim of neutralising Huguenot seapower and blockade La Rochelle; despite English attempts to relieve it, the city surrendered in October 1628, and the June 1629 Peace of Alès largely ended Protestant autonomy.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}