{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Thapathali\n\nThe Treaty of Thapathali () was a treaty signed between the Tibetan government of Ganden Phodrang (then a protectorate of the Qing dynasty) and the Kingdom of Nepal in Thapathali Durbar in Kathmandu, the capital of Nepal, following the Nepal-Tibet War (1855–1856). In January 1856, a representative group of Tibet (along with a Chinese ambassador) came to Kathmandu for discussion of the treaty. After a long discussion, the representative group ultimately signed a treaty on 24 March.\nFailure of first attempt\nA meeting of delegation teams was first called in Shikarjong but no decision was made. The Nepali delegation team returned, as they were to discuss with the prime minister, Jung Bahadur Rana. In the meeting with Tibetan delegation, Jung Bahadur demanded one crore rupees for expenses of war and the return of all Tibetan land captured by Nepal. It was very hard for the Tibetan delegation to make such a decision, so Kaji Til Bikram was sent to Sikarjong along with the Tibetans in September. The ambassador of China replied that he could offer four lakhs rupees for war expenses and five lakhs rupees as reparations for the destruction of Nepalese troops in Lhasa. The ambassador also stressed that Tibet was a state of China that the Emperor had given to the local monks only for religious purpose, so Tibet was not subjected to give any land to Nepal; if Nepal did not return immediately from Tibet then Nepal must be ready to fight a war with China. As the Nepalese were not in support of this condition, the attempt at a treaty failed.\nTreaty of Thapathali\nIn March of the sixth year of Xianfeng (1856), After Nepal's defeat in third Nepal-Tibet War ,the two sides signed a peace treaty in Thapathali, Nepal, with the approval of the Chinese Amban.\nThere are ten articles in the treaty:\n(1) Tibet pays 10,000 rupees as reparations to the Kingdom of Nepal annually.\n(2) Nepal and Tibet shall always respect the Qing Emperor. There are many monasteries in Tibet, and many practitioners live alone and follow religious rules.\n(3) Afterwards, for Nepali merchants and citizens, Tibet will not collect merchant tax, road tax and other taxes.\n(4) Tibet allows the Sikh soldiers captured before and the Nepali soldiers, officials, servicemen, women, and artillery positions captured in the war to be returned to Nepal; All items left behind by Tibetans in Long, Nyalam, Tsongkha, Blang, and Rongju areas were returned to Tibet.\n(5) Nepal will subsequently send a senior official to be stationed in Lhasa, but not Newars.\n(6) Nepalese are allowed to open shops in Lhasa to sell and buy jewelry, clothing, food, and other various items at will.\n(7) If there are disputes between Lhasa businessmen and citizens, Nepali officials are not allowed to interrogate them; if there are disputes between Nepali merchants and residents in Lhasa or Kathmandu Muslims, they are not allowed to be interrogated by Tibetan officials; if there are disputes between Tibetan people and Nepali people , The officials of the two sides will be interrogated together, the Tibetan people will be fined, and the Tibetan officials will be fined, and the Nepali businessmen and Muslims will be fined and returned to the Nepali officials.\n(8) If any Nepali fled to Tibet for murder, Tibet will hand them over and send them to back to Nepal; if any Tibetans fled to Nepal because of murder, the Nepalese will hand them over and send them to Tibet.\n(9) Tibetan officials should investigate the property of the Nepali merchants and citizens who robbed them and ordered them to be returned to their original owners. If the criminal cannot return the original item, the Nepali officials should make him make a promise and pay him back within a time limit.\n(10) After the treaty has been concluded, neither party shall retaliate against the family property of the Tibetans who are attached to the Nepalese or the family property of the people who are attached to the Nepalese living in Tibet.\nSee also\n* Treaty of Tingmosgang (1684)\n* Treaty of Chushul (1842)\n* British expedition to Tibet (1903-4)\n* Convention of Lhasa (1904)\n* Convention Between Great Britain and China Respecting Tibet (1906)\n*Thapathali Durbar\n*History of Nepal\n*Tibet under Qing rule\n*Sino-Nepalese War\n*Nepalese–Tibetan War\n*China-Nepal relations\nReferences"
    }
  ]
}