{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Paris (1810)\n\n| location_signed      = Paris, France\n| date_sealed          =\n| date_effective       =\n| condition_effective  =\n| date_expiration      =\n| date_expiry          =\n| mediators            =\n| negotiators          =\n| original_signatories =\n* First French Empire\n* Sweden\n| signatories          =\n| parties              =\n| ratifiers            =\n* France\n* Sweden\n| depositor            =\n| depositories         =\n| citations            =\n| language             =\n| languages            =\n| wikisource           =\n| wikisource1          =\n| footnotes            =\n}}\nThe Treaty of Paris, signed on 6 January 1810, ended the Franco-Swedish War after Sweden's defeat by Russia, an ally of France, in the Finnish War of 1808–1809.\nHistory\nRussia had been an ally of Sweden in the Third and Fourth Coalitions against France but, after Russia's defeat at Friedland, joined France and attacked Sweden to compel it to join Napoleon I's Continental System. The primary result of the treaty was Sweden's agreement to join the Continental System so that Sweden would not trade with the United Kingdom.\nShortly after the treaty was signed, on 21 August 1810, one of Napoleon's marshals, Jean-Baptiste Bernadotte, was elected crown prince of Sweden, and he went on to found the House of Bernadotte, which remains the Royal House of Sweden. The peace resulting from the treaty lasted until Napoleon's refusal to permit Sweden to annex Norway, which was then under the sovereignty of Denmark, an ally of France. That was followed in January 1812 by the French occupation of Swedish Pomerania for violating the Continental System since Sweden was still trading with the United Kingdom. In April 1812, Sweden signed the Treaty of Petersburg with Russia against France.\nNotes\nRelated reading\n* Will Durant, Ariel Durant (1975) The Age of Napoleon (Simon and Schuster)\n*Ulf Sundberg (1997) Svenska freder och stillestånd 1249-1814 (Hjalmarson & Högberg)"
    }
  ]
}