{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Tientsin__disambig_1\n\nYevfimiy Putyatin\n*  William Bradford Reed\n*  James Bruce, 8th Earl of Elgin\n*  Jean-Baptiste-Louis Gros\n|parties =\n* China\n*  Russia\n*  United States\n*  United Kingdom\n*  France\n|ratifiers =\n|depositor = National Palace Museum, Taipei City\n|language  =\n| wikisource          =\n}}\n|s=\n|p=Tiānjīn Tiáoyuē |w=T‘ien-chin T‘iao-yüeh\n|h=Tien1-zin1 Tiau2-yok5}}\nThe Treaty of Tientsin, also known as the Treaty of Tianjin, is a collective name for several unequal treaties signed at Tianjin (then romanized as Tientsin) in June 1858.  The Qing dynasty, Russian Empire, Second French Empire, United Kingdom, and the United States were the parties involved. These treaties, counted by the Chinese among the unequal treaties, opened more Chinese ports to foreign trade, permitted foreign legations in the Chinese capital Beijing, allowed Christian missionary activity, and effectively legalized the import of opium. They ended the first phase of the Second Opium War, which had begun in 1856 and were ratified by the Emperor of China in the Convention of Peking in 1860, after the end of the war.\nDates\nThe Xianfeng Emperor authorized negotiations for the treaty on May 29, 1858. His chief representatives were the Manchu  and the Mongol . The Russian treaty was negotiated by Yevfimiy Putyatin and finalized on June 13; the American treaty was negotiated by William Bradford Reed and finalized on June 18; the British treaty was negotiated by James Bruce, 8th Earl of Elgin, and finalized on June 26; and the French treaty was negotiated by Jean-Baptiste-Louis Gros and finalized on June 27.\nAmerican involvement\nFollowing the pattern set by the great powers of Europe, the United States took on a protectionist stance, built up its navy, and tried to create a mercantile empire. The United States was one of the leading \"treaty powers\" in China, forcing open a total of 23 foreign concessions from the Chinese government. While it is often noted that the United States did not control any settlements in China, it shared British land grants and was actually invited to take land in Shanghai but refused because the land was thought to be disadvantageous.\nTerms\nMajor points\n# Russia, which had previously been limited to trading at designated border posts, received the right to trade with the treaty ports by sea. Most-favored nation clauses in each treaty further ensured that all concessions were shared by the four powers.\n# Guangzhou.}} and the four treaty ports opened to foreign trade and residence by the Treaty of Nanjing were joined by Tainan, Haikou, Shantou, Haicheng, Penglai, Tamsui, and (notionally) Nanjing. The ports at Haicheng and Penglai being found inadequate for European vessels, their status was later extended to nearby Yantai and Yingkou, effectively opening another two ports.\n# China was forbidden from considering Russian Orthodox, Protestant, and Roman Catholic Christianity, whether practiced by foreigners or Chinese converts, to be a harmful superstition. All laws, regulations, and practices limiting its observance became null and void everywhere in the country.\n# The extraterritoriality of American citizens and Russian, British, and French subjects was reaffirmed. They further received the right to travel throughout the Qing Empire for pleasure or business so long as they possessed a valid passport, but the Qing Empire was able to prevent them from lawfully residing in the interior with extraterritoriality.\n# The Qing Empire permitted foreign vessels to navigate on the Yangtze River but established that no legal trade would be permitted with areas held by the Taiping Rebellion until their reconquest. Foreign trade was to be limited to Zhenjiang, pledged to be opened within the year, and a further three ports to be opened after the suppression of the Taipings. This clause was later used to establish treaty ports at Wuhan and Jiujiang.\n# The four nations gained the right to station permanent diplomatic legations in Beijing,}} which had previously been a closed city. The Russians' ecclesiastical mission in Beijing was also exempted from its previous restrictions.\n# China was forbidden from using the character }} (understood to mean \"barbarian\") in official documents to refer to officials, subjects, or citizens of the four nations.\n# China was forbidden from establishing or permitting any further monopolies or cartels over its domestic trade.\n# Addenda to the treaties settled China's duties and tariffs on terms advantageous to the victors and pledged the Qing Empire would pay an indemnity of 6,000,000 taels of silver: 2 million to France, 2 million to Britain for military expenses, and 2 million as compensation to British merchants.\nDefinitions\nThe Treaties of Tientsin use several words that have somewhat ambiguous meanings. For example, the words \"settlement\" and \"concession\" can often be confused. The term \"settlement\" refers to a parcel of land, leased to a foreign power, which is composed of both foreign and national peoples, and governed by locally elected foreigners.  The term \"concession\" refers to a long-term lease of land to a foreign power, under which the foreign nation has complete control of the land, which is governed by consular representatives.\nSee also\n* Unequal treaty\n* Imperialism in Asia\n* 19th-century Protestant missions in China\n* William Bradford Reed\nNotes\nReferences\nCitations\nBibliography\n*\n*\n*\n*\nPrimary sources\n*  |title-link=:s:Treaty of Tien-Tsin between the Queen of Great Britain and the Emperor of China }}.\n* .\n*  |title-link=:s:Treaty of Tien-Tsin between the United States of America and the Empire of China }}.\n*  |access-date=2019-11-27 |archive-date=2016-03-05 |archive-url=https://web.archive.org/web/20160305022918/http://www.chinaforeignrelations.net/node/162 |url-status=usurped }}\n*  |access-date=2023-09-08 |archive-date=2016-03-06 |archive-url=https://web.archive.org/web/20160306012334/http://chinaforeignrelations.net/node/233 |url-status=usurped }}\nExternal links\n* , , , and  at China Foreign Relations\n* [https://books.google.com/books?id=soz2uJjn7BUC&lpg=PA925-IA5 American treaty in United States Statutes at Large, Vol. XII] (1863)\n* [https://books.google.com/books?id=matbAAAAQAAJ&pg=PA347 British treaty in Accounts and Papers of the House of Commons, Vol. XXXIII: ''Correspondence Relative to the Earl of Elgin's Special Missions to China and Japan...''] (1859)"
    }
  ]
}