{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Füssen__disambig_1\n\nThe Peace of Füssen () was a peace treaty signed at Füssen, between the Electorate of Bavaria and Habsburg Austria. Signed on 22 April 1745, it ended the participation of Bavaria on the French side in the War of the Austrian Succession.\nBackground\nAfter the conquest of Prague by Bavarian and French troops on 26 November 1741, Elector Charles Albert of Bavaria, with French and Prussian support, declared himself King of Bohemia and was elected Emperor Charles VII on 24 January 1742. Charles Albert was then crowned on 12 February.\nOn the same day as his coronation in Frankfurt, however, Austrian troops occupied Bavaria and Hungarian hussars plundered Munich and the Bavarians were forced also to evacuate Bohemia which they had occupied for a few months. With French assistance, Charles VII fought Austria for three years, but was unable to secure victory.\nWhen Charles VII died in Munich on 20 January 1745, his successor as Elector of Bavaria, Maximilian III Joseph, signed a preliminary peace with Austria. But a strong war-party led by Ignaz von Törring and supported by France wanted to continue the war.\nAfter the decisive defeat in the Battle of Pfaffenhofen on 15 April, Maximilian Joseph chose for peace.\nPeace treaty\nThe formal peace treaty signed in Füssen consisted of seventeen articles, two side articles, and a secret additional clause.\nMaximilian abandoned his father's claim on Bohemia and recognized the Pragmatic Sanction of 1713. Austria did not demand any reparations and recognized the legitimacy of Charles VII's election as Holy Roman Emperor. Maximilian III promised to support the imperial candidacy of Maria Theresa's husband and future Habsburgs, Francis Stephen of Lorraine, and to influence the votes of the Electorate of the Palatinate and the Electorate of Cologne, both ruled by the Wittelsbach.\nThe treaty was signed by Joseph Fürst zu Fürstenberg for Bavaria and Rudolf Graf von Colloredo for Austria.\nReferences"
    }
  ]
}