{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of the Triple Alliance\n\nEmpire of Brazil\n*  Argentina\n*  Uruguay\n}}\n| parties             =\n| languages           = Spanish, Portuguese\n| website             =\n| wikisource          =\n}}\nThe Treaty of the Triple Alliance was a treaty that allied the Empire of Brazil, Argentina, and Uruguay against Paraguay. Signed in 1865, after the outbreak of the Paraguayan War, its articles (plus a Protocol) prescribed the allies' actions both during and after the war. An English translation of the text is reproduced in this article.\nThe war lasted until 1870 and led to the near-annihilation of Paraguay.  After Paraguay's defeat, Brazil and Argentina, who were traditional enemies, hovered on the brink of mutual warfare for six years because of disputes and misunderstandings about the treaty.\nAccording to article XVI Argentina was to receive a 600 km strip of territory in the Chaco north of the Pilcomayo River, nearly up to the Bolivian border.  From the start the Brazilian government set out to frustrate the implementation of this particular stipulation, and eventually succeeded.  Today this territory — the Central Chaco — belongs to Paraguay.\nBackground\nWhitworth pattern here directed by Lt. Col. George Thompson one of 200 British technicians in Paraguay]]\nAlthough the Empire of Brazil and Argentina were traditional enemies, they, together with Uruguay, united against Paraguay in 1865. The causes of the war were various and have been hotly disputed by modern writers, and have even been traced back to territorial disputes between Portugal and Spain stemming from the Treaty of Tordesillas (1494). \"Indeed the Paraguayan War was just the last chapter in a two-century conflict between the Spanish and Portuguese over the region\".  But for the purposes of this article, it may be enough to outline the geopolitical situation and the immediate antecedents of the treaty.\nDisputes over vital communications arteries\nIn the middle of the 19th century, vast tracts of South America were undeveloped, railways were few and short, and surfaced roads practically did not exist; so navigable rivers were \"vital arteries\".  Of particular relevance were the Paraná and Paraguay rivers. Using the Paraná-Paraguay system, quite large ships could steam 1,870 miles (3,010&nbsp;km) upriver from Buenos Aires well into the Brazilian Mato Grosso province. These rivers were of crucial importance to landlocked Paraguay, to Brazil and to the trade of some Argentine provinces. It was, as wrote D.S. Chandler  }} Thus Buenos Aires Province under Juan Manuel de Rosas had restricted river traffic to put pressure on upstream Paraguay, and Paraguay under Carlos Antonio López had done the same to put pressure on Brazil.\nIn 1855 Paraguay, with an understandable fear and distrust of its neighbours, began to develop the formidable Fortress of Humaitá. Established near the mouth of the River Paraguay and known as the Gibraltar of South America, the fortress was the gateway to the country. However, it may have caused the Paraguayan government to feel itself invulnerable (wrongly, as it turned out), and it caused tension with Brazil. As explained by lieutenant colonel George Thompson of the Paraguayan Army:\n}}\nTerritorial disputes\nFurthermore, immense territories were disputed. Not effectively occupied by anyone, except the aboriginal inhabitants, they had no obvious international boundaries. There was a boundary dispute between Brazil and Paraguay going back to colonial times, and there were large areas in dispute between Paraguay and Argentina in the Gran Chaco and in the territory of Misiones. Then, there were no obvious and accepted principles according to which they might have been resolved, and no established practice of international arbitration existed. In international law victory in war was a recognised way of acquiring territory.\nParaguayan military buildup\nBetween 1854 and 1864, and supervised by Francisco Solano López, Carlos Antonio López's son, Paraguay built up its military forces because it thought that the outside world (in particular Brazil, Argentina, the United States, and the British Empire) was disrespecting it. Paraguay imported some 200 foreign technicians, mostly British, and  developed an iron foundry, an arsenal, a shipyard, a telegraph and a railway. This modernisation was military-oriented.  It also imported from Britain the cadre of a military medical corps who trained Paraguayan medical students. Thus Paraguay became an important regional power. However, as noted by John Hoyt Williams, \"the dizzying speed with which his nation was 'modernized' and strengthened tempted López to flex his new muscle and seek an ever-expanding, activist role in international affairs\". López became ruler of Paraguay in September 1862 after the death of his father.\nIntrigues\nIn 1862, the Uruguayan Blanco Party, traditionally hostile to Brazil, and now alarmed because its bitter enemies had seized power in Buenos Aires too,\nfelt itself to be acutely short of allies. It began a covert diplomatic campaign to turn Paraguay aggressively against Buenos Aires. This campaign, which continued through 1864, insinuated that Buenos Aires had designs on both Paraguay and Uruguay, who should make a warlike alliance, detach the Argentine provinces of Corrientes and Entre Ríos and seize Martín García Island.  Although Francisco Solano López of Paraguay did not trust the Blancos and did not sign an alliance with Uruguay, he nevertheless built up his strength.  Because women had always grown the subsistence crops in Paraguay, all able bodied men aged 16–50 were available for service and, in March 1864, they were conscripted for \"intensive\" military training. By September 1864 López had an estimated 48,000–150,000 men on a war footing, more than any other power in the region. Wrote Thomas L. Whigham: \"Paraguay was the only country in the region that could boast of its military preparedness and a full treasury\".\nParaguay invades two Brazilian provinces\nHowever, as events transpired, López did not launch this force on Argentina, but on Brazil.  Across the border in Uruguay lived many who claimed Brazilian nationality, and Brazil complained these people were being mistreated with the connivance of Uruguay's ruling Blanco party: it was a long-standing grievance. In April 1864 political agitation brought Brazilian anger to the boil. In May 1864 Brazil sent a diplomatic mission to Uruguay to demand reparations, accompanied by a naval squadron; Brazilian troops massed along the border. On 30 August 1864 Paraguay warned Brazil against military action in Uruguay, but this was ignored: the Uruguayan War began.  In November 1864, Paraguay fired upon and seized the Brazilian government ship Marquês de Olinda as it was steaming up the River Paraguay on its routine monthly voyage to the Mato Grosso. It proved to be carrying military stores.  Paraguayan armies proceeded to invade the Brazilian province of Mato Grosso.  Later, they invaded Rio Grande do Sul.\nParaguay invades an Argentine province\nParaguay, difficult of access, might have resisted Brazilian retaliation for a long time, but now it took a step that was to give Brazil what it had lacked hitherto: a good forward base from which to attack it.  It did so by invading Argentina.  First, on 14 January 1865, the Paraguayan government asked Argentina for permission to attack Brazil across the Corrientes Province, which was refused. On 13 April, Paraguayan ships fired upon and seized two Argentine naval vessels moored in the Argentine port of Corrientes and the Paraguayans proceeded to invade the province itself. It prompted the alliance with Brazil.\nUpshot\nParaguay had now made war on the much more populous Empire of Brazil, on Argentina (also more populous), and threatened the Colorado faction of Uruguay, which by now had come into power. The three countries had been accustomed to thinking about Paraguay as a backward upstart and were outraged. Their foreign ministers met in Buenos Aires and negotiated the Treaty of the Triple Alliance.\nNegotiations\nIn March 1865, a change of government in Brazil had Liberal Party member Francisco Otaviano de Almeida Rosa sent on a special mission to the River Plate region. Paraguay was at war with Brazil but had not yet attacked Argentina. Some of his instructions were to bolster the Uruguayan government of the pro-Brazilian Venancio Flores, to see how Uruguay might co-operate in the war against Paraguay, and to stop the Argentine government from making any obstacles.\nThe Paraguayan attack on Argentine territory (13 April) precipitated the Brazil-Argentina alliance so that the 40-year old Otaviano had to negotiate its terms on the spot, without specific instructions from Rio de Janeiro since there was no telegraph link with that capital. His general instructions had been that Paraguay should have to pay for the war, the Humaitá fortifications must be destroyed to guarantee freedom of navigation, and a boundary treaty must be signed with Paraguay according to certain Brazilian proposals of 1853.\nBecause Argentina and Brazil were traditional enemies, Brazil did not trust Argentine intentions in the River Plate basin.  Otaviano thought the Argentine government meant to get aid from Brazil without assuming any obligations so that once the conflict was over, it could reincorporate Paraguayan territory into an Argentine-led successor to the old Viceroyalty of the River Plate. Accordingly, Otaviano insisted that the Treaty of the Triple Alliance guarantee the independence of Paraguay.  This did not go down well with Argentina, which insisted on receiving its Misiones and Chaco territorial claims in full, all the way up to the Bolivian border.\nThe treaty was signed on 1 May 1865.\nBrazilian government's reaction\nWhen the Brazilian government discovered what Otaviano had negotiated, particularly his concessions toward Argentina, it was not pleased, and the terms of the treaty were strongly criticised by the Conservative opposition. The general belief in Brazil was that it did not need an alliance with Argentina to beat Paraguay, only that Argentina should keep out of the way. Emperor Pedro II of Brazil referred the Treaty to the Section of Foreign Affairs of the Council of State,  which advised that the treaty was disadvantageous to Brazil in several ways by making it too easy for Argentina to annex Paraguay at some future date and too hard for the Brazilian navy to blockade Paraguay if necessary.  Otaviano's terms were severely criticised, but he claimed that the situation in 1865 was so critical that if Argentina had wanted to take advantage of it \"we would have given them twice, or three times as much.\"\nThe Section of Foreign Affairs said that as it was now too late to renegotiate the treaty, the best way out, despite what it said, was that Argentina must not obtain \"a handbreadth of territory\" above the Pilcomayo River.  The Pilcomayo flows through the Gran Chaco into the right bank of the River Paraguay (see map), but Argentina's claim to the Chaco went far north of that. Indeed, according to Article XVI it was to receive territory up to Bahía Negra, near the Bolivian border. After the War of the Triple Alliance, by a long-drawn out process, Brazil managed to prevent Argentina from getting territory to the north of the Pilcomayo, and that river is still the international boundary between the Argentine province of Formosa and the Paraguayan department of Presidente Hayes.\nSources\nThree versions\nFollowing the diplomatic usage of the era, the treaty has three different versions. There are no significant differences but the sequence of passages may vary.\nThe treaty was celebrated (made) at Buenos Aires on 1 May 1865, and each country had its own version, with these differences:\n#Language: the Argentine and Uruguayan versions were in Spanish.  The Brazilian version was in Portuguese.\n#Sequence: each version gave prominence to its own nation, diplomatic representative and army by naming them first if possible. For example, in the Uruguayan version, Uruguay and its diplomat, Dr. de Castro, are mentioned before the much larger Brazil and Argentina and their representatives. Another example, in Article III (Uruguayan version) is that the role of the Uruguayan commander, Venancio Flores, is described before the role of the commander of the much larger Brazilian land forces. The reverse happens in the Brazilian version.\nThus, a precise label of a particular provision might require one to say, for example, \"Article III, third indent (Uruguayan version)\" (as the case might be).\nSource reproduced here\nThe treaty was secret, but de Castro supplied a copy to William Garrow Lettsom, the British minister at Montevideo, who, on 27 June, forwarded a translation of the Uruguayan version to British Foreign Secretary Lord Russell. The British government ordered it to be printed and laid before both houses of Parliament, the text of which is reproduced in this article. It is the version utilised in most scholarly accounts in the English language.\nIn other languages\nThe Brazilian version was published in Schneider, 1902, and may be downloaded.\nThe Argentine version, as published in a 1884 reprint of the Registro Nacional, may be downloaded.  Defective versions circulate online.\nA German version was published in Schneider, 1872, and can be downloaded. However, it is not a direct translation from either Portuguese or Spanish, but a translation of the English (British parliamentary) text.\nText\n(Note: The red superscript numerals are not part of the original text.)\nThe Government of the Oriental Republic of Uruguay, the Government of his Majesty the Emperor of Brazil, and the Government of the Argentine Republic:\nThe two last, finding themselves at war with the Government of Paraguay by its having been declared against them in fact by this Government, and the first in a state of hostility, and its internal security menaced by the said Government, which violated the Republic, solemn Treaties, and the international usages of civilised nations and committed unjustifiable acts after having disturbed the relations with its neighbours by the most abusive and aggressive proceedings:\nPersuaded that the peace, security, and well-being of their respective nations is impossible while the actual Government of Paraguay exists, and that it is an imperious necessity, called for by the greatest interest, to cause that Government to disappear, respecting the sovereignty, independence, and territorial integrity of the Republic of Paraguay:\nHave resolved with this object to celebrate a Treaty of Alliance offensive and defensive, and thereto have appointed to be their Plenipotentiaries, to wit:\nHis Excellency the Provisional Governor of the Oriental Republic of the Uruguay: his Excellency Doctor Carlos de Castro, his Minister Secretary of State in the Department of Foreign Affairs;\nHis Excellency the Emperor of Brazil: his Excellency Senhor Dr F. Octaviano de Almeida Rosa, of his Council, Deputy to the General Legislative Assembly and Officer of the Imperial Order of the Rose;\nHis Excellency the President of the Argentine Confederation: his Excellency Señor Dr. Don Rufino de Elizalde, his Minister and Secretary of State in the Department Foreign Affairs;\nWho after having exchanged their respective credentials, which were found to be in good and due form, did agree as follows:-\nARTICLE I\nThe Oriental Republic of the Uruguay, His Majesty the Emperor of Brazil, and the Argentine Republic unite in offensive and defensive Alliance in the war provoked by the Government of Paraguay.\nARTICLE II\nThe allies will contribute with all the means they can dispose of by land or on the rivers according as may be necessary.\nARTICLE III\nThe operations of the war being to commence in the territory of the Argentine Republic, or on a part of Paraguayan territory bordering on the same, the command in chief and the direction of the allied armies remains entrusted to the President of the Argentine Republic, General-in-chief of its army, Brigadier-General Don Bartolomé Mitre.\nThe maritime forces of the allies will be under the immediate command of Vice-Admiral Viscount de Tamandaré, Commander-in-chief of the squadron of His Majesty the Emperor of Brazil.\nThe land forces of the Oriental Republic of the Uruguay, a division of the Argentine forces, and another of the Brazilian forces to be designated by their respective superior chiefs, will form an army under the immediate orders of the Provisional Governor of the Oriental Republic of the Uruguay, Brigadier-General Don Venancio Flores.\nThe land forces of His Majesty the Emperor of Brazil will form an army under the immediate orders of their General-in-Chief, Brigadier Manoel Luis Osorio.\nAlthough the High Contracting Parties are agreed not to change the field of the operations of war, nevertheless in order to preserve the sovereign rights of the three nations, they do agree from this time, on the principle of reciprocity for the command in chief, in the event of those operations having to pass over to the Oriental or Brazilian territory.\nARTICLE IV\nThe internal military order and economy of the allied troops will depend solely on their respective chiefs.\nThe pay, victuals, munitions of war, arms, clothing, equipment, and means of transport of the allied troops will be for the account of the respective States.\nARTICLE V\nThe High Contracting Parties will afford mutually all the assistance or elements which they may have, and which the others may require, in the form to be agreed upon.\nARTICLE VI\nThe allies pledge themselves solemnly not to lay down their arms unless by common accord, nor until they have overthrown the present Government of Paraguay, nor to treat with the enemy separately, nor sign any Treaty of peace, truce, armistice, or Convention whatsoever for putting an end or suspending the war, unless by a perfect agreement of all.\nARTICLE VII\nThe war not being against the people of Paraguay, but against its Government, the Allies may admit into a Paraguayan legion all the citizens of that nation who may choose to concur to overthrow the said Government, and will furnish them with all the elements they may require, in the form and under the conditions to be agreed upon.\nARTICLE VIII\nThe allies oblige themselves to respect the independence, sovereignty, and territorial integrity of the Republic of Paraguay. Consequently, the Paraguayan people may choose their Government and give to themselves the Institutions they please, not incorporating it nor asking for a Protectorate under any one of the allies as a consequence of this war.\nARTICLE IX\nThe independence, sovereignty, and territorial integrity of the Republic of Paraguay will be guaranteed collectively in conformity with the foregoing Article by the High Contracting Parties during the period of five years.\nARTICLE X\nIt is agreed between the High Contracting Parties that the exemptions, privileges, or concessions which they may obtain from the Government of Paraguay, shall be common to all gratuitously, if they be gratuitous, and with the same compensation if they be conditional.\nARTICLE XI\nThe present Government of Paraguay being overthrown, the Allies will proceed to make the necessary arrangements with the authority constituted, to insure the free navigation of the Rivers Parana and Paraguay, in such manner that the regulations or laws of that Republic shall not obstruct, hinder nor burthen the transit and direct navigation of the merchantmen and vessels-of-war of the allied States proceeding to their respective territory, or to territory not belonging to Paraguay, and they will take suitable guarantees for the effectiveness of those arrangements on the base that those regulations of fluvial police, whether they be for those two rivers or likewise for the River Uruguay, shall be made by common accord between the allies and such other bordering States as shall, within the term to be agreed upon by the said allies, accept the invitation made to them.\nARTICLE XII\nThe allies reserve to themselves to concert the measures most suitable in order to guarantee peace with the Republic of Paraguay after the overthrow of the present Government.\nARTICLE XIII\nThe allies will appoint in due season the Plenipotentiaries required to celebrate the arrangements, Conventions or Treaties that may have to be made with the Government that shall be established in Paraguay.\nARTICLE XIV\nThe allies will exact from this Government payment of the expenses of the war which they have seen  themselves obliged to accept, as well as reparation and indemnification for the damages and injuries caused to their public and private properties, and to the persons of their citizens, without express declaration of war, and for the damages and injuries committed subsequently in violation of the principles which govern the laws of war.\nThe Oriental Republic of the Uruguay will likewise exact an indemnification proportioned to the damage and injury caused to it by the Government of Paraguay through the war into which it is forced to enter to defend its security threatened by that Government.\nARTICLE XV\nIn a special Convention shall be determined the manner and form of liquidating and paying the debt proceeding from the aforesaid causes.\nARTICLE XVI\nIn order to avoid the discussions and wars which questions of boundaries involve, it is established that the allies shall exact from the Government of Paraguay that it celebrate definitive boundary Treaties with their respective Governments upon the following basis:–\nThe Argentine Republic shall be divided from the Republic of Paraguay by the Rivers Parana and Paraguay, until meeting the boundaries of the Empire of Brazil, these being on the right margin of the River Paraguay, the Bahía Negra.\nThe Empire of Brazil shall be divided from the Republic of Paraguay on the side of the Parana by the first river below the Salto de las Siete Cahidas, which, according to the recent map by Manchez, is the Igurey, and from the mouth of the Igurey and its course upwards until reaching its sources.\nOn the side of the left bank of the Paraguay by the River Apa from its mouth to its sources.\nIn the interior from the summits of the mountain of Maracayú, the streams on the east belonging to Brazil, and those on the west to Paraguay, and drawing lines as straight as possible from the said mountain to the sources of the Apa and of the Igurey.\nARTICLE XVII\nThe allies guarantee to each other reciprocally the faithful fulfilment of the agreements, arrangements, and Treaties that are to be celebrated with the Government that shall be established in Paraguay, in virtue of what is agreed upon by the present Treaty of Alliance, which shall always remain in its full force and vigour to the effect that these stipulations be respected and executed by the Republic of Paraguay.\nIn order to obtain this result they do agree that, in the case that one of the High Contracting Parties should be unable to obtain from the Government of Paraguay the fulfilment of what is agreed upon, or that this Government should attempt to annul the stipulations adjusted with the Allies, the other shall employ actively their exertions to cause them to be respected.\nIf these exertions should be useless, the allies will concur with all their means in order to make effective the execution of what is stipulated.\nARTICLE XVIII\nThis Treaty shall be kept secret until the principal object of the alliance shall be obtained.\nARTICLE XIX\nThe stipulations of this Treaty which do not require legislative authorization for their ratification, shall begin to take effect so soon as they are approved by the respective Governments, and the others from the exchange of the ratifications, which shall take place within the term of forty days counted from the date of the said Treaty, or sooner, if it be possible, which shall be done in the city of Buenos Ayres.\n:In testimony whereof, the Undersigned Plenipotentiaries of his Excellency the Provisional Governor of the Oriental Republic of the Uruguay, of His Majesty the Emperor of Brazil, and of his Excellency the President of the Argentine Republic, in virtue of our full powers, do sign this Treaty and do cause to be put thereto our seals in the city of Buenos Ayres, the 1st of May, in the year of our Lord 1865.\n(Signed)\n:::C. DE CASTRO.\n:::F. OCTAVIANO DE ALMEIDA ROSA\n:::RUFINO DE ELIZALDE\nProtocol\n:THEIR Excellencies the Plenipotentiaries of the Argentine Republic, of the Oriental Republic, of the Oriental Republic of the Uruguay, and of his Majesty the Emperor of Brazil being assembled at the Department for Foreign Affairs, agreed:\n:1.  That in fulfilment of the Treaty of Alliance of this date, the fortifications of Humaitá shall be caused to be demolished, and it shall not be permitted that others of an equal nature should be erected, which might impede the faithful execution of that Treaty.\n:2.  That it being one of the measures necessary to guarantee peace with the Government that shall be established in Paraguay not to leave arms or elements of war, those that are met with shall be divided in equal shares between the allies.\n:3.  That the trophies and booty that may be taken from the enemy shall be divided between the allies who make the capture.\n:4.  That the Chiefs in command of the allied armies shall concert measures to carry what is here agreed on into effect.\nAnd they signed this at Buenos Ayres on the 1st of May,1865.\n(Signed)\n:::CARLOS DE CASTRO.\n:::RUFINO DE ELIZALDE\n:::F. OCTAVIANO DE ALMEIDA ROSA\nRatification\nThe treaty could not take full effect until ratification. In Argentina, it was ratified by the Senate and the House of Representatives in secret session on 24 May 1865 but subject to a little-known exception. Instruments of ratification were exchanged between Argentina and Brazil on 12 June and between Argentina and Uruguay on 13 June.\nException to ratification\nThe legislature of the Argentine Republic did not fully ratify Article I of the Protocol to the Treaty, which omission was kept secret until after the war.\nIn 1872, historian Louis Schneider wrote that the allies did not ratify all of the clauses of the Treaty but without further specifying. However, in a note published in the Portuguese translation of Schneider's work (1902), the Brazilian diplomat José Maria da Silva Paranhos qualified that assertion as follows:\nThere only was not approved by the Argentine Congress the clause relating to the fortifications, and this lack of approbation, kept secret, was only communicated to Brazil long after the war.\nThat had already been acknowledged in 1872 by the future Argentine diplomat Estanislao Zeballos, who noted that the Protocol (concerning fortifications) had not been submitted for ratification by the Argentine Congress as required by the Argentine constitution. What was objectionable, for Argentina, was not that the Humaitá fortifications should be demolished, but the stipulation that no similar ones should be built even after the overthrow of López.\nArgentina's refusal to ratify the Protocol came to light when it and Brazil were disputing the meaning and effect of the treaty, and the Brazilian government published some of the correspondence. (See Conflict between Argentina and Brazil, below.)\nIt was never determined whether the Argentine legislature's refusal to ratify Article 1 of the Protocol was effective according to the law of nations or whether it was ineffective because it was not communicated to Brazil in a timely manner.\nSpecific articles\nTo this day, South America continues to debate the merits (or lack thereof) of specific treaty articles. In particular, Articles III, VI, VII, VIII, IX, XIV, and XVIII.\nArticle III\nBy this article the Allies agreed to confer the overall command of the land forces on president Bartolomé Mitre of Argentina initially, even though the Brazilian military resources were much larger, mainly because the initial campaign would have to take place in Argentine territory, and then in Paraguayan territory adjoining Argentina.  Because Brazil had incomparably the biggest navy, however, they agreed that command of the naval forces should be conferred initially on the Brazilian admiral Joaquim Marques Lisboa, the Viscount of Tamandaré. The decisions, however, caused a lot of friction and dissension with the Uruguayans accusing Mitre of being overcautious and the Argentines accusing Brazil's navy of failing to cooperate with the army. It is discussed in the article Passage of Humaitá.\nThe third indent of Article III led to the creation of the Army of the Vanguard led by the fierce Uruguayan gaucho Venancio Flores, whose function was to hurry ahead through the eastern part of the province of Corrientes, as described in León de Palleja's diaries.\nArticle VI\nBy this article the Allies pledged not to lay down their arms, unless by mutual consent, until they had abolished the López government, nor to treat separately with the enemy.  This article has been criticised for making it difficult to negotiate peace. Indeed, after the initial enthusiasm, Argentina had a strong antiwar party and had it not been for Brazil, it is possible that Argentina might have opted to negotiate peace.  As against that, however, Domingo Faustino Sarmiento, winner of the 1868 presidential election on an anti-war platform, did try to bring about Argentina's unilateral withdrawal —  Article VI or not.  But he was unable to do so, in part because of anti-López sentiment.\nArticle VII\nin 1866]]\nAs foreshadowed in Article 6, this stipulated that the enemy was the Paraguayan government (i.e., López) rather than the country of Paraguay. (The concept was not without precedent in international affairs.  \"Talleyrand had also obtained from the Congress of Vienna that the enemy of the Coalition was Napoleon alone, and not the French people\".). Therefore, a volunteer anti-López Paraguayan Legion would be admitted to join the Allies. It has been objected that the Paraguayan Legion were traitors to their country, but there can be no doubt that the López government was a dictatorship with an emigrée opposition. A different objection is that Paraguayan prisoners of war were forced to join the Legion or, at any rate, the Allied armies, which, had it been true, would have been outrageous.\nArticle VIII\nThis reiterated that the Allies bound themselves to respect the independence and sovereignty of the Paraguayan Republic, because the real enemy was the López regime.  Although at the time some objected to this as a cynical manoeuvre, there is really little ground to doubt the sincerity of the Allies' motives on this point.  Brazil and Argentina were traditional rivals, and neither wanted the other to absorb Paraguay.  That this was so in the case of Brazil is demonstrated twice, not only when she insisted in this clause in the first place, but after winning the war, when she could easily have annexed Paraguay had she wished to do so.\nArticle IX\nStill on the theme that the war was really against the López regime, this article provided that the Allies would collectively guarantee the independence of Paraguay for five years.  In nineteenth century international practice a Power that guaranteed the independence of a country was agreeing to protect it by force should it be threatened.  Bearing in mind the traditional rivalry and suspicion between Brazil and Argentina, what this signified was that if one threatened Paraguay the other would come to Paraguay's aid.\nAn objection against Article 9 was that the guarantee was only for 5 years, which was practically meaningless since the war lasted for 5 years anyway.  However, the Allies were not to know this in 1865.  Besides, another interpretation is that the 5 years would begin to run at the conclusion of the war.  This interpretation is supported by the words \"in conformity with the foregoing article\".  The foregoing article (article 8) said that \"the Paraguayan people may elect their own government and give it any institutions they make fit\", which would not have been possible until López's overthrow—i.e., until the end of the war.\nArticle XIV\nThis article provided that Paraguay would pay an indemnity for the war, which was criticized for being excessively harsh. But at the war's end, Paraguay was in no position to pay any indemnities, which were ultimately cancelled, nothing having been paid.\nParaguay successfully argued that if Paraguay had to pay indemnities, it would indicate, contrary to the Allies' claim, that the war was against the nation of Paraguay rather than López, the former president and instigator of the war.\nArticle XVI\nBy this article the allies agreed the boundaries that would result from their victory in the war.  Subject to the later Hayes arbitration (which awarded the Chaco north of the Pilcomayo river to Paraguay), and subject to the territorial dispute between Paraguay and Bolivia (which was resolved by the much later Chaco War), the boundaries are those which exist now.  The lower part of the Mato Grosso belongs to Brazil.  The provinces of Formosa, Chaco and Misiones belong to Argentina.\nNote that, by the second indent of this Article, Argentina was supposed to receive territory on the right bank of the River Paraguay (i.e. in the Gran Chaco) all the way up to Bahia Negra.  That is about 600&nbsp;km to the north of the present boundary at the Pilcomayo river.  For the reasons explained in the second section of this Article, from the moment the Treaty was signed Brazil set out to frustrate Argentina's claim to this territory, and succeeded. For a detailed account see Warren, chapter 10.\nArticle XVIII\nThe treaty was to be secret until its principal object had been fulfilled.  Secret treaties, though they went out of fashion after the First World War, and are now regarded as unwise, were commonplace in the nineteenth century.\nThe British consul at Rosario, Thomas Hutchinson, thought that the \"principal object\" referred to the demolition of the Fortress of Humaitá, though not mentioned until the Protocol.\nProtocol\nThe Protocol was an appendix to the treaty signed on the same day, apparently as an afterthought.\nArticle 1 expressly provided that the Fortress of Humaitá must be demolished and that \"it shall not be permitted that others of an equal nature should be erected, which might impede the faithful execution of the Treaty.\"\nThe protocol also required the disarmament of Paraguay and the sharing of military trophies and booty.\nAlleged \"secret clauses\"\nSome writings on the Paraguayan war may give the impression that certain special clauses of the Treaty were secret but that others were not.  For example:\nBrazil, Argentina and Uruguay signed the Treaty of the Triple Alliance, which committed the three countries to a war to remove Solano López.... The Treaty as published declared that the Allies would respect the independence of Paraguay... The Treaty also contained secret clauses which foresaw fundamental adjustments in Paraguay's borders after the war.... Paraguay would be reduced to a quarter of its existing territory.\"\nHowever, under Article 18 of the treaty, all of its clauses were equally secret. None of them was public, and all have been given in  this article.\nThat said, some provisions of the Treaty were obvious at the time or easy to guess (such as that there was some sort of alliance against López) and others were less so (such as the precise extent to which Argentina's territorial claims were to be vindicated). Confusion arose because all of the clauses were closed to public inspection, which led to rumours.\nPublication\nAccording to Thompson, the main provisions were quickly leaked to the Buenos Aires press.\nAccording to Professor Thomas L. Whigham, the detailed text was published as follows. The British chargé d'affaires in Montevideo, William Garrow Lettsom, had asked Uruguayan Foreign Minister Carlos de Castro directly whether the allies planned to partition Paraguay \"like some South American Poland\". With the intention of soothing him, de Castro gave him, in confidence, a complete copy of the treaty. However, Lettsom was not satisfied and wondered if confiscation of part of its territory was really better than a general annexation. He decided to send a copy to Lord Russell. The British government had for long been opposed to any sort of territorial concessions in Uruguay and, by extension, anywhere in the Plate region:\nThe text of the Treaty seemed to violate long-established diplomacy in the region.  The British government decided to ignore Lettsom's promises of discretion, and hastened to publish the entire treaty...\nThe treaty was published in March 1866 and denounced in the London newspapers.  The news reached South America some weeks later and created an avalanche of adverse publicity.\nBolivia and Peru protested against the treaty, and Chile seemed inclined to do the same. On the other hand, when the treaty was published in a Paraguayan weekly, many people were convinced that López was right to wage war with the Allies and that \"Paraguay was compelled to fight for her very existence.\" Thompson noted that \"it gave me a further zest to fight for Paraguay, as I believed, from the terms of the Protocol, that she must either fight or be absorbed.\"\nAftermath\nAllies\n, 1830–1901)]]\nIt took nearly a year to expel Paraguayan troops from allied territory.  In April 1866 the allies invaded Paraguay.  Eventually, after four years of warfare – in most of which they were held up by the Fortress of Humaitá – they overthrew the government of López, who was killed in battle.  As required by the Protocol, they razed the Fortress to the ground.\nThe war was a catastrophe for Paraguay, which on a conservative estimate lost between a quarter and a half of its population.  Despite Article XIV's stipulations on indemnities, Paraguay's bankruptcy meant that the expenses of the war were irrecoverable and so the demands were eventually dropped.\nAt the end of the war a provisional government was set up in Paraguay under the auspices of the Allies. Paraguay was occupied by Allied troops, chiefly Brazilian. For a time Brazilian forces continued to occupy the Isla del Cerrito, an island near the mouth of the Paraguay River that was claimed by Argentina but which had served as Brazil's main naval base during the war.\nConflict between Argentina and Brazil\nArgentina and Brazil were on the brink of war between 1870 and 1876 because of treaty disputes and misunderstandings.\nand Carlos Tejedor (a noisy dog) disturb a sleeping lion (Brazil) and its sentinel the press.  (Semana Illustrada, 29 June 1872.)]]\nDespite Article VI, which forbade a separate peace treaty, in 1872, Brazil sent the Baron of Cotegipe to Asunción to negotiate a separate treaty with Paraguay without any explanation to Argentina or Uruguay. Argentina was infuriated and its foreign minister, Carlos Tejedor, sent a harshly-worded missive, excoriating Brazil for trying to negotiate privately with Paraguay. The Buenos Aires press misunderstood and exaggerated the extent of Brazil's breach of faith and claimed that war with Brazil was the only way of answering it. (In fact, Brazil and Paraguay signed four treaties in 1872, but none of them had any implications for the rights of Argentina; they dealt with extradition, commerce, and consular privileges).\nAs a result, Argentina took possession of Villa Occidental, a settlement in the Central Chaco, to the north of the Pilcomayo River. The Central Chaco was an area claimed by Paraguay and Argentina but had been given to Argentina by Article XVI of the Treaty of the Triple Alliance.\nArgentina sent former president Bartolomé Mitre to Brazil to help to restore good relations, and by late 1873 the tension seemed to be over. However, it was not long before Argentina fortified Martín García Island. This island is a geographical anomaly, since by agreement it is today an exclave of Argentine territory located entirely in Uruguayan territorial waters.  At the time, however, it was a longstanding bone of contention, being disputed between Argentina and Uruguay (backed by Brazil). Its location off the Uruguayan coast near the mouths of the Rivers Paraná and Uruguay meant it could be used to threaten the free navigation of the River Plate basin (which makes up one-fourth of the South American continent's surface), including Brazil's best route to its Mato Grosso province.\nAs a result, Brazil reinforced its fleet in the River Plate. Argentina began to acquire war materiel and to buy warships. The American minister in Rio de Janeiro also thought that Argentina was behind an unsuccessful attempt to topple president Salvador Jovellanos of Paraguay, who, the Argentines said, was a Brazilian puppet.\nIn April 1874, Uruguay, the junior partner of the alliance, negotiated a separate treaty of friendship with Paraguay, under the auspices of Brazil. Argentina broke off diplomatic relations with Uruguay. The American minister thought that if war broke out between Argentina and Brazil, Uruguay would be on Brazil's side and that the Argentine provinces of Corrientes and Entre Ríos, where there was considerable opposition to the government in Buenos Aires and were virtually self-governing, would break away. He would not be surprised if, under Brazilian influence, there was formed \"a new Riverine Republic... [which] would be composed of Uruguay, Entre Rios, Corrientes and Paraguay\".\nIn 1875, Argentina started fortifying Martín García Island again, which the U.S. saw as a full treaty violation, threatening free navigation: \"The problem was compounded by the appearance of two new Argentine ironclads, which caused further Brazilian apprehension and curiosity\".\nIn 1875, Emperor Pedro II of Brazil decided to try to prevent a war with Argentina by taking up the matter with Tejedor himself. Matters seemed to be progressing well until Tejedor suddenly left Brazil. It appeared that Tejedor had been negotiating Argentina's own unilateral treaty with Paraguay, taking advantage of the fact that Paraguayan envoy Jaime Sosa was in Rio de Janeiro at the time. They signed the Tejedor-Sosa treaty, which called for the territory of Villa Occidental to be given to Argentina. The treaty was quickly rejected by the Paraguayan government. It seems that Tejedor and Sosa expected that outcome, but that Tejedor signed the treaty anyway to defy Brazil.\nIn the end Brazil and Argentina resolved their differences because \"[they] had both learned from past experience that even a successful war would end in national financial disaster\". In December 1876 they signed an agreement by which the island of Cerrito was ceded to Argentina, the Chaco south of the Pilcomayo River went to Argentina, the northern Chaco was left to Paraguay, and the Central Chaco was to be arbitrated between Argentina and Paraguay.\nBrazil\nOn 9 January 1872, Paraguay and Brazil signed a treaty in which Paraguay recognized, as debt to Brazil, all damages caused to Brazilian people and cities at an interest of 6% with an annual amortization of 1%. Paraguay opened up all of its waterways, the Paraná and Uruguay rivers, to Brazilian trade and navigation. Brazil also reserved the right to occupy Paraguay with its Imperial Army to maintain peace and ensure treaty compliance.\nThe borders between Paraguay and Brazil were established in three different treaties. In the treaty signed on 9 January 1872, the limits were set to be the riverbed of the Paraná River from Yguasu's mouth up to Paraná's Seven Falls waterfall or Guairá Falls; from the Guairá Falls, by the summit of the Mbaracayu Range and later by Amambay's up to Apa River's source, from where it follows its riverbed down to its mouth on the eastern shore of the Paraguay River.\nOn 16 January 1872, another treaty was signed for the release of all deserters, prisoners, and war criminals. Two days later a new treaty of Friendship, Commerce and Navigation was signed. By the 7 January 1874 protocol, the Estrella stream was considered the Apa River's source.\nThe last and definite treaty was signed on 21 May 1927, in Rio de Janeiro. A complement to the first treaty, it established that the limit between both countries was the riverbed of the Paraguay river from the mouth of the Apa River with the Paraguay River up to its mouth in Bahía Negra.\nUruguay\nThe Treaty of Peace, Commerce and Navigation was signed on 13 December 1873, between Paraguay and Uruguay. As with the Brazilian treaty, Paraguay recognized the expenses, damages, and detriments of the Uruguayan campaign. Both governments also committed to return all prisoners of war and to reopen commerce on the rivers.\nArgentina\nA treaty was signed on 3 February 1876, between Paraguay and Argentina. In it, Paraguay recognized all war expenses, damages, and detriments caused to Argentine public and private property, though they were never paid (see above).  The Paraguay, Paraná, and Uruguay rivers were also reopened to navigation and transit.\nThe Argentine-Paraguay territorial disputes in the Chaco were resolved as follows.  The portion south of the main Pilcomayo riverbed was assigned to Argentina.  The portion north of the Verde River (23° 10' Latitude South) was assigned to Paraguay.  The central portion was submitted to arbitration.\nThe arbitrator chosen by both nations was U.S. president Rutherford B. Hayes, who awarded Central Chaco to Paraguay in 1878.  The Argentine army left in May 1879.  In gratitude, Paraguay renamed the department as \"Presidente Hayes\" and the capital as \"Villa Hayes\".\nBolivia\nThe 1864–1870 war eventually settled the boundary disputes in the Chaco, but not between Paraguay and Bolivia, which continued to fester.  In 1931 Bolivian oil hunger caused its military to invade the disputed area, leading to the Chaco War. There turned out to be no oil worth fighting over. The Paraguay-Bolivia boundaries were not finally resolved until a treaty of 28 April 2009.\nSee also\n* Fortress of Humaitá\n* Paraguayan War\n* Paraguayan War casualties\n* Paraguay expedition\n* Siege of Humaitá\n* Women in the Paraguayan War\nNotes\nReferences\n*\n*\n*\n*\n}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* (ebook)\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links (open access)\n*[https://books.google.com/books?id=HylcAAAAQAAJ&pg=RA3-PA13 English language text of the Treaty of the Triple Alliance (British Parliamentary translation of Uruguayan text)]\n*[https://archive.org/stream/guerradatrplic01schnuoft#page/100/mode/2up/search/tratado Brazilian text of the Treaty (in Portuguese)]\n*[https://babel.hathitrust.org/cgi/pt?id=uc1.b2884043&view=1up&seq=267 Argentine text of the Treaty (in Spanish)]\n*Pelham Horton Box's [https://babel.hathitrust.org/cgi/pt?id=uc1.b3865778&seq=9 The Origins of the Paraguayan War (1930)]\n*[https://library.oapen.org/handle/20.500.12657/57513  Thomas Lyle Whigham'sThe Paraguayan War: Causes and Early Conduct (2018)]"
    }
  ]
}