{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Viborg\n\n-->\n| location_signed = Round Tower, Viborg, Sweden (now in Russia)\n| date_sealed =\n| date_effective =\n| condition_effective =\n| amendment =\n| date_expiration =\n| date_expiry =\n| provisional_application =\n| mediators =\n| negotiators =\n| original_signatories =\n| signatories = * Sweden\n* Tsardom of Russia\n| parties =\n| ratifiers =\n| depositor =\n| depositories =\n| citations =\n| language =\n| languages =\n| wikisource =\n| wikisource1 =\n| wikisource2 =\n| wikisource3 =\n| wikisource4 =\n| wikisource5 =\n| footnotes =\n}}\nThe Treaty of Viborg was a package of 7 documents signed in Viborg during 1609 between Sweden and Russia on the provision by Sweden of military assistance to the government of Vasily Shuisky.\nConditions\nUnder the terms of the agreement and the secret protocol thereto, Sweden provided a mercenary corps, paid for by Russia, in exchange for the Korela Fortress and the surrounding county. In 1609–1610, the Swedish auxiliary corps under the command of Jacob De la Gardie participated in battles against the supporters of False Dmitry II and the Polish interventionists. After the overthrow of Shuisky, De la Gardie, under the pretext of non-fulfillment by the Russians of the terms of the treaty, in 1610–1613 captured Novgorod and a number of other northern Russian cities, further drawing Sweden into the Russian Troubles. The government of Mikhail Romanov during the years 1614–1617 held negotiations to end the occupation, but the Swedes insisted on territorial concessions. The negotiations were held in the midst of repeatedly renewed hostilities and culminated in the signing of the Treaty of Stolbovo.\nAccording to William Pokhlebkin, the so-called \"three-year war\" of 1614–1617 was caused by the \"mistake of Russian diplomacy under Vasily Shuisky\" – \"an uncritical choice of an ally in difficult times from among the eternal and traditional opponents of Russia\".\nBackground\nWith the advent of the first news of the pretender to the Moscow throne announced in Poland and his support by the Poles, Charles IX began to pay more attention to the situation in the east. On the one hand, Sweden fought with Poland and it was impossible to allow its strengthening due to Russian lands or its rapprochement with Russia. On the other hand, the Treaty of Teusina had recently been signed with Russia, according to which Sweden had to return most of Ingria. Having decided to use the difficult situation of the Moscow government and at the same time to tie the forces of the Polish–Lithuanian Commonwealth, the king at the beginning of 1604 offered a large army to help Boris Godunov. And in February 1605, an embassy went from Stockholm to Moscow to conclude an agreement. The price of military support was supposed to be the transfer of Sweden to the cities of Ivangorod, Yam, Koporye and Korela. Due to the sudden death of Boris Godunov, negotiations did not take place, and False Dmitry I soon ascended the throne.\nAt the end of 1606, when the south of the country was gripped by a peasant uprising, and later, in May 1608, when the units of False Dmitry II approached Moscow, Charles was thinking about an open attack on the bordering Russian lands. However, the ongoing war with Poland in Livonia did not allow the release of troops for this.\nConclusion of the Viborg Agreement\nIn the summer of 1608, the situation of Vasily Shuisky became critical – Moscow was besieged by the Tushins, and on August 10 the tsar himself sent a letter to the Swedish king asking for military assistance. Mikhail Skopin-Shuisky was sent to Novgorod to conduct negotiations and gather troops. On the Swedish side, Mons Mortensson, an officer of the Commander-in-Chief in the Baltic, Friedrich Mansfeld, went to Novgorod for preliminary negotiations. By the end of November, they agreed to send a Swedish auxiliary corps to Russia of 5 thousand people and to pay large salaries to the mercenaries by the Moscow government. The news of the upcoming arrival of the traditional enemy, the Swedes, caused discontent among the inhabitants of the border cities, one by one they went over to the side of False Dmitry II: first Pskov, then Korela and Oreshek.\nIn early February 1609, in Viborg, in the Round Tower of the Viborg Fortress, negotiations began on the terms of the contract. The king of Sweden in the negotiations was represented by, among others, a member of the State Council (riksråd)  and the regional judge of Karelia, the commandant of Viborg . On the Russian side there were two ambassadors – the stolnik Semyon Vasilyevich Golovin, brother-in-law of Mikhail Skopin-Shuisky, and the dyak Sydavny Vasilyevich Zinoviev. On the main issue, it was decided to dwell on the conditions adopted in Novgorod, but the Swedish ambassadors objected:\nAfter that, the ambassadors proposed to all members of the Russian embassy to leave the premises, and they swore an oath from the Swedish representatives to keep further negotiations secret. As a result, a secret protocol to the treaty was signed, according to which the Korela Fortress with the county was ceded to perpetual possession. The geographical position of Korela is not advantageous for defense, and it was clear to the Shuisky government that \"if we do not make a voluntary concession, the Swedes will take this territory by force\"; moreover, at that time, Korela did not actually belong to Shuisky. Nevertheless, the secrecy of the additional negotiations was caused by the fear that the voluntary cession of the state's territory would further increase the king's discontent in the country.\nThe contract and the secret protocol were signed on February 28. A separate line was the obligation of both parties not to conclude separate treaties with the Poles, and the Treaty of Teusina, concluded 13 years earlier, was also ratified.\nAdditional documents\nThe secret protocol stipulated that after 3 weeks after the Swedish troops crossed the border, the commander of the Swedish corps De la Gardie will be awarded with confirmation letters signed by Skopin-Shuisky, and after another 2 months – letters signed by the tsar. Korela should be transmitted after 11 weeks (that is, simultaneously with the royal letters), on the condition that its inhabitants can leave the city and \"go to Russia\".\nUpon the arrival of the De la Gardie corps in Novgorod, Skopin-Shuisky really gave him letters of confirmation to the contract and the secret protocol. But two months later the royal letters were not handed over, and the city was not handed over, as the townspeople did not even let the royal ambassadors into the city:\nAfter the battle near Tver, a revolt occurred in the De la Gardie corps, mainly due to the irregular payment of salaries, most of the mercenaries deserted. The significantly thinned corps went to Valdai, where by autumn De la Gardie still received some confirmation from the tsar of the terms of the agreement and two more letters of confirmation from Kalyazin from Skopin-Shuisky addressed to him and the Swedish king. However, even after this the city was not transferred.\nOn December 17, 1609 in Alexandrovskaya Sloboda, Mikhail Skopin-Shuisky and De la Gardie entered into an agreement on additional military assistance (confirmed a month later by the tsar), which again referred to Korela's ambulance, and the exchange for additional troops promised \"full of Sweden to make a retribution from her it will be required\". The Shuisky government, however, did nothing to actually transfer the land, looking through the fingers at the disobedience of the townspeople, and even rewarding them for this:\nUnder various pretexts, the Karelian authorities postponed the implementation of the tsar's order until Shuisky was overthrown. In these conditions, the Swedes decided to take what was promised by force – the Swedish intervention of 1610–1617 began.\nReferences\nSources\n*Johan Videkind. [http://www.vostlit.info/Texts/rus13/Videkind/frametext1.htm The History of the Swedish-Moscow War of the 17th Century] Moscow: Russian Academy of Sciences, 2000\n*Igor Shaskolsky. [http://www.kirjazh.spb.ru/biblio/shask_17/shask0.htm Swedish Intervention in Karelia at the Beginning of the 17th Century] Petrozavodsk: State Publishing House of the Karelian Autonomous Soviet Socialist Republic, 1950. 167 Pages\n*William Pokhlebkin. [http://www.kirjazh.spb.ru/biblio/pohleb/pohleb5.htm Foreign Policy of Russia and the Soviet Union for 1000 years in Names, Dates, Facts] Moscow: \"International Relations\", 1995"
    }
  ]
}