{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Ribe\n\nThe Treaty of Ribe ( meaning The Ribe letter; ) was a proclamation at Ribe made in 1460 by King Christian I of Denmark to a number of Holsatian nobles enabling himself to become Count of Holstein and gain control of the Duchy of Schleswig, on Denmark's southern border. The most famous line of the proclamation was that the Danish Duchy of Schleswig and the County of Holstein within the Holy Roman Empire, should now be, in the original Middle Low German language, Up Ewig Ungedeelt, or \"Forever Undivided\".\nThe treaty\nThe proclamation was issued in 1460 and declared that the King of Denmark should also be Duke of Schleswig and Count of Holstein.  Another clause granted the nobility the right to revolt should the king break the agreement (a common feature of several medieval coronation charters). The agreement was most straightforward in regard to the future of Holstein, since King Christian I merely added the title of count to his existing titles. He was forbidden from annexing Holstein to Denmark and Holstein retained its independence and its position as an afterlehen of Saxe-Lauenburg (which, as part of the former Saxony, inherited this right), indirectly under the Holy Roman Emperor.\nRegarding the future of Schleswig, the agreement seems at first sight to contradict itself: the Danish king became Duke of Schleswig, a Danish fief, in effect becoming his own vassal. This arrangement should be seen as a guarantee against excessive Danish domination of the new union, whilst safeguarding against the partitioning of Holstein among Danish nobles.\nThe most obvious result of this distinction was the exclusion of Schleswig in subsequent Danish laws, although the medieval Danish Code of Jutland (Danish: Jyske Lov) was retained as Schleswig's legal code. Another important, but much later, development was the gradual introduction of German-speaking administrators in the duchy resulting in a gradual but permanent Germanisation of the southern part of the province.  German culture first spread in the cities, most probably as a result of the presence of merchants from the Hanseatic League.  The process was greatly accelerated following the Lutheran Reformation, which introduced German liturgy in the churches in southern Schleswig - although the vernacular in most of this area was Danish.  The major breakthrough of the process of Germanisation, however, did not occur until the end of the eighteenth century.\nHistorical background\nEarly history\nFrom the beginning of Danish history, the direct border to the mighty Frankish Empire posed a strategic threat to Danish independence.  In fact, many historians have seen the construction of the first border fortifications, known as the Danevirke, as the first proof of the beginning of an independent Danish state.  The border was challenged from both sides; Charlemagne sought to conquer Denmark, and Danish kings supported Saxons wishing to cast off the Frankish rule.  Despite minor wars, a border was relatively quickly established at the River Eider.  This border, which Denmark later considered to be its \"natural border\" is exemplified in a stone once set in the walls of Rendsburg (), a city on the border between Schleswig and Holstein. The stone had the following inscription: Eidora Romani Terminus Imperii (The Roman Empire ends at the Eider).\nValdemar the Victorious\nDuring the early Middle Ages, a number of nobles from Holstein tried to expand their influence across the border into Schleswig.  Most notably of these were the Counts of Schauenburg and Holstein ruling Holstein.  The border was also challenged by a number of Danish kings, most notably King Valdemar the Victorious who sought to obtain control of Northern Germany, then a part of the Holy Roman Empire.\n1214 marked an important step in this process, when the Holy Roman Emperor Frederick II issued a Golden Bull surrendering all imperial territories north of the rivers Elbe and Elde to Valdemar the Victorious.  An action provoking many Holsatian nobles.  In 1223, the fates were reversed when Henry I, Count of Schwerin (a.k.a. Heinrich der Schwarze) abducted Valdemar and his eldest son and imprisoned them in the Waldemarturm of Dannenberg Castle. Henry demanded that Valdemar should surrender all of his conquests in the Holy Roman Empire and instead swear allegiance to the Holy Roman Emperor. In fact, Emperor Frederick II tried to intervene and arrange Valdemar's release, but he was rebuffed by Count Henry.\nHenry's terms were flatly refused by the Danish envoys sent to negotiate the release of their king, and Danish nobles decided to attack Henry. The war ended in 1225 in Danish defeat. Valdemar was now forced to not only surrender his conquests in the Holy Roman Empire but also to take an oath not to seek revenge. Henry released him in 1226 and Valdemar immediately appealed to Pope Honorius III to have his oath declared void, a request granted by the Pope. In 1226, Valdemar returned with an army and attacked the Schauenburgers in Holstein.\nHe used the utmost diligence in collecting an army, with which he entered Holstein, and, in the terms of the treaty concluded with his nephew Otto I, Duke of Brunswick-Lüneburg, he was joined by Otto and the troops of Brunswick. Their united forces formed a very respectable array, and they took and destroyed a number of towns, and had recovered a great part of the County of Holstein, when they were opposed by Schauenburg Count Adolf IV of Holstein, who had been joined by his liege lord Albert I, Duke of Saxony and Prince-Archbishop Gerhard II of Bremen. The two armies were nearly of equal strength, and as both parties were anxious to try the issue of a general battle, they were not long in coming to an engagement. The field chosen for this action, was in the neighborhood of the town of Bornhöved in Holstein.\nOn 22 July 1227, the two armies clashed in the Battle of Bornhöved. The battle was a decisive victory for Count Adolf IV of Holstein, in part owed to a number of troops from Dithmarschen who abandoned the Danish army during the battle. In the following peace settlement, Valdemar definitively gave up the hope of ever regaining his former possessions in the northern Holy Roman Empire (Northern Germany).\nDenmark is dissolved\nThe next major turn of events took place in the early fourteenth century, as a result of the bankruptcy of the Danish state. This century saw Schleswig being dominated by a more Holstein-born or Low Saxon-speaking nobility. These local lords sought to keep Schleswig independent of the king and to forge close ties to Holstein within the Holy Roman Empire. This pursuit of autonomy would have effects for centuries to come.\nThe bankruptcy of Denmark resulted in a rising influence of the King's creditors (mostly Holsatian nobles) in all parts of the country. In 1326, King Valdemar III of Denmark - by many Danish regarded as a usurper - was forced by the nobility of Schleswig and Holstein to sign the Constitutio Valdemaria promising that the Duchy of Schleswig and the Kingdom of Denmark may never be united under the same ruler, a first precursor to the Treaty of Ribe. Schleswig was consequently granted as a fief to Count Gerhard III of Holstein-Rendsburg, the leader of one of the then four Holstein lines of the Schauenburg dynasty. By 1327, virtually all strongholds in Denmark had fallen under the control of Holsatian noblemen. In 1330, Valdemar III of Denmark abdicated his untenable kingship and returned to his former position as Duke Valdemar V of Schleswig). As compensation, Gerhard was awarded the island of Funen as a fief instead. In 1331 war broke out between Gerhard and the new king, Christopher II, ending in a Holstein-Rensburg victory. The peace terms were extremely harsh. King Christopher was only left in effective control of the island of Langeland and was faced with an impossible task of raising 100,000 silver marks to redeem his country. Denmark had effectively been dissolved and the country was left without a king between 1332 and 1340.\nValdemar IV regains Denmark\nIn 1340, King Valdemar IV of Denmark began a more-than-twenty-year-long struggle to reclaim his father's kingdom. Although eventually succeeding in regaining control of Zealand, Funen, Jutland, and the Scanian lands, he failed to obtain control of Schleswig, whose ducal House of Estridsen managed to continue its virtual independence. To gain influence over the province, Valdemar married Helvig of Schleswig, the only daughter of Duke Eric II of Schleswig. In 1372, he again turned his attention to Schleswig and conquered Gram. In 1373, he conquered Flensburg. The southern part of Schleswig had been mortgaged to a number of Holsatian nobles by Duke Henry of Schleswig (d 1375, a son of the former king Valdemar III of Denmark), the last duke of the Estridsen line. The childless, elderly Henry transferred his rights to his kinsman and brother-in-law, King Valdemar IV in 1373. This seemed a clear success for the king, but the Holsatian nobles refused to allow him to repay the mortgage and redeem the area in question. In 1374, Valdemar succeeded in buying large tracts of land in the province and was on the verge of starting a campaign to conquer the rest when he died on 24 October 1374. The nobles acted quickly and managed to establish control over the province in 1376. In 1386, Queen Margaret I of Denmark, the younger daughter of Valdemar IV of Denmark and Helvig of Schleswig, gave Schleswig as a hereditary fief under the Danish crown to Count Gerhard VI of Holstein-Rendsburg, provided that he swore allegiance to her son King Oluf. She too was unsuccessful in regaining effective control of the province.\nIn 1409, Margaret's adopted son and Denmark's future king, Eric of Pomerania forced the Schauenburgers to surrender the city of Flensburg to him. War broke out in 1410, and Eric conquered the islands of Als and Ærø. In 1411, Holstein-Rendsburg, which until 1403 had incorporated all Schauenburg lines except of Pinneberg, retook Flensburg, but in 1412 both sides agreed that an arbiter should settle the dispute, Ulrich I, Duke of Mecklenburg-Stargard. Ulrich awarded the city to Denmark, and Queen Margaret took possession of it. During her stay in Flensburg, she was struck by the plague and died shortly after. War returned and a new mediation attempt was undertaken in 1416 by the Hanseatic League. Both sides recognised the League as arbitrators and Denmark pledged the city of Schleswig as security; the Holstein-Rendsburg pledged the stronghold of Tönning, but the mediation attempts were in vain. In 1421, the Holsteiners succeeded in regaining the cities of Haderslev, Schleswig, and Tønder.\nThe Emperor's verdict\nIn 1422, both sides recognised Duke Henry X Rumpold, Duke of Żagań, envoy of the Holy Roman Emperor, as arbitrator. He managed to persuade the Schauenburgers to call off a planned attack on Flensburg, but died on 18 January 1423 before reaching a verdict. His master, Emperor Sigismund, now wished to settle the issue, a decision strongly opposed by the Schauenburgers. He called upon Louis of Cattaneis from Verona to travel to the disputed province and investigate the case.\nA similar process took place in Denmark. The Assemblies of both Lund, Ringsted, and Ribe all reached the conclusion that Schleswig was governed by Danish laws and formed part of Denmark. The decision made by the Assembly of Ribe on 4 August 1421 is of particular interest, since both the bishops of Ribe and Schleswig, the abbots from the monasteries of Ryd (modern Glücksburg) and Løgum as well as councillors from Flensburg, Aabenraa, Haderslev, and Ribe were all present. The assembly ruled that Schleswig was part of Denmark with the following argument ... the (people) of Southern Jutland use Danish law and have kept it since it was given. Second, all the old rights granted upon the chapels and House of God in Schleswig, Ribe, and Haderslev were given by the kings of the Realm. Thirdly, every man knows where the borders are located, that Denmark and Holstein are separated; even the language in Southern Jutland is Danish to this day.\nIn 1424, a similar decision was made by Emperor Sigismund who decided that since his envoy had reported that the people of Schleswig spoke Danish, followed Danish customs, and considered themselves to be Danes, the province rightfully belonged to Denmark. Henry IV, Count of Holstein-Rendsburg and Duke of Schleswig, strongly protested this verdict and refused to follow it.\nWar returned in 1425. In 1431, a group of burghers in favour of Holstein-Rendsburg opened the gates of Flensburg and a Holsatian army took control of the city. In 1432, peace was settled, and Eric recognised the conquests made by the Holsatian nobles.\nAdolf VIII dies\nIn 1439, the new Danish king Christopher III (a.k.a. Christopher of Bavaria) acquired the loyalty of Count Adolf VIII of Holstein-Rendsburg by granting him the entire Duchy of Schleswig as a hereditary fief but under the Danish crown. In 1459, Adolf died without leaving an heir and no other count could produce claims to both the Duchy of Schleswig and the County of Holstein-Rendsburg. King Christian I of Denmark did however hold a claim to Schleswig, and the separation of Schleswig and Holstein would have meant economic ruin for many members of the Schleswig and Holstein nobility. Moreover, the nobility failed to agree on taking a course. In 1460, King Christian summoned the nobles to Ribe, and on 2 March 1460, they agreed to elect him as the successor of Count Adolf and new count of Holstein. Their main motivation was to prevent the separation of the two provinces. On 5 March, Christian granted a coronation charter (or Freiheitsbrief) which repeated that Schleswig and Holstein must remain united dat se bliven ewich tosamende ungedelt.\nBy this action, Christian managed to gain control of the county of Holstein-Rendsburg within the Empire, but the price was a permanent link between two provinces, one Danish and one of the Holy Roman Empire. In 1474 Emperor Frederick III elevated Christian as Count of Holstein-Rendsburg to Duke of Holstein, thus becoming an immediate imperial vassal (see imperial immediacy). The smaller Holstein-Pinneberg remained a county further ruled by the House of Schauenburg until seized by the duchy in 1640.\n19th century nationalism and the Treaty of Ribe\nThe proclamation later played an important role in the nineteenth century during the nationalist awakening in both the German Confederation and Denmark. German nationalists, seeking the Unification of Germany, cited the Treaty of Ribe and wished to integrate the ethnically mixed Schleswig as well as the all-German Holstein, which until 1806 had been part of the Holy Roman Empire and then was part of the German Confederation, into a new German Empire. Danes refused to abandon Schleswig and sought to integrate the duchy into the Danish kingdom. The status of Holstein as part of the confederacy, on the other hand, was not questioned. This dispute culminated in two wars, the First War of Schleswig in 1848–1851 and the Second War of Schleswig in 1864.\nSee also\n* History of Schleswig-Holstein\n* List of treaties\n* Schleswig-Holstein Question\nReferences\nFurther reading\n* Sir Andrew Halliday Annals of the House of Hannover, v.2, London, 1826. [https://books.google.com/books?id=qoWVC1UTyaIC&q=Annals+of+the+House+of+Hannover]"
    }
  ]
}