{
  "content": [
    {
      "type": "text",
      "text": "# Treaty of Kurakchay\n\n| location_signed         = On the bank of the Kurekchay river, near Ganja\n| date_sealed             =\n| date_effective          =\n| condition_effective     =\n| amendment               =\n| date_expiration         =\n| date_expiry             =\n| provisional_application =\n| mediators               =\n| negotiators             =\n| original_signatories    =\n| signatories             =\n| parties                 =\n| ratifiers               =\n| depositor               =\n| depositories            =\n| citations               =\n| language                = Russian\n| languages               =\n| wikisource              =\n| wikisource1             =\n| wikisource2             =\n| wikisource3             =\n| wikisource4             =\n| wikisource5             =\n| footnotes               =\n}}\nKurakchay treaty (, May 14, 1805) is a contract confirming the integration of the Karabakh Khanate into the Russian Empire. The signing ceremony took place on May 14, 1805, in a Russian military camp on the banks of the Kurekchay river, not far from Ganja. The agreement was signed by Ibrahim Khalil Khan and Commander-in-Chief of Georgia, Infantry General Pavel Tsitsianov (on behalf of Emperor Alexander I).\nBackground\nThe Russian Empire took advantage of the division of the various Caucasian khanates and concluded agreements in the process. Commander-in-Chief of Russian troops in the Caucasus P.&nbsp;D. Tsitsianov began to exert military-diplomatic pressure on the Karabakh khanate after the occupation of Ganja Khanate. It is clear from Tsitsianov's correspondence with Ibrahim khan from Karabakh, the instructions of Georgian nobleman Ivan Jorayev and Lisanevich, who mediated the negotiations, that the khan tried to conclude the contract on favorable terms. From the agreements concluded by Tsarism with the rulers of the South Caucasus up to Kurakchay, the conditions for the annexation of these state institutions, the directive documents on their abolition, it is clear that the main articles of the Georgievsk Treaty were taken as a basis.\nTreaty\nThe capture of Ganja Khanate played an important role in accelerating the invasion of the Caucasian khanates. Back in early 1804, General Tsitsianov sent Lisanevich to Karabakh to Ibrahim Khalil Khan and demanded that transfer to Russian subordination. Ibrahim Khalil Khan asked Tsitsianov for military assistance to prevent the attack of Iranian troops and promised to help and remain loyal to Russia. At his request, Tsitsianov sent a team to Karabakh, led by Lisanevich. Tsitsianov set up camp on the Kurakchay River near Ganja. Ibrahim Khalil Khan came here with his sons Mammad Hasan agha, Mehdigulu Khan, Khanlar agha and other nobles of Karabakh.\nThe treaty of Kurakchay consisted of a preamble and 11 articles. The introduction of the agreement stipulates the transfer of the Karabakh khanate to the Russian Empire, and the articles define the conditions arising from this. Articles 1, 4, 6, 8 and 9 of the agreement reflect the obligations of Ibrahim Khan, and Articles 2, 3, 5 and 7 reflect Russia's obligations. Russia unequivocally accepted the Karabakh khanate as an independent state, affirmed Ibrahim Khan and his successors as the only owners of the khanate. An important issue was the emperor's guarantee of the integrity of the Karabakh khanate. Khan undertakes to receive and maintain a 500-strong Russian garrison in Shusha fortress. The khan undertook to pay Russia an annual tribute of 8,000 chervonets and to send Mammad Hasan agha's son Shukur agha, as hostages to Tbilisi. The tsar promised to give 10 silver rubles a day to the grandson of the khan held hostage in Tbilisi.\nArticle X of the treaty stated that this treaty is concluded for an indefinite period and should not be changed. Article XI was about ratification. The Kurakchay treaty was signed in Russian. With the abolition of the Karabakh khanate by Russia in 1822, the Kurakchay treaty was terminated.\n;In The Name Of God Almighty\nWe, i.e. Ibrahim-khan Shushinsky (of the city of Shusha) and Karabakhsky (of the khanate of Karabakh) and General of infantry of all Russia’s troops Caucasian inspection on infantry and others Prince (knyaz) Pavel Tsitsianov with the full power given to me by his Emperor’s Highness the dearest and greatest Sir Emperor Alexander Pavlovich took up with the help of God the matter of granting everlasting citizenship of all Russian Empire to Ibrahim khan Shushinsky and Karabakhsky with all family, posterity and possessions of his. The Treaty was concluded, confirmed and signed with the following articles.\n;The First Article\nIbrahim khan Shushinsky on my behalf, on behalf of my heirs, successor abdicate and vassalage and whichever title it might be any dependence from Persia or any other state and in this way I declare the fact to the whole world that I don’t consider myself and the successors of mine of having any power. The only power we recognize is the Supreme Power of His Emperor’s Highness All Russia’s great Emperor and his greatest heirs and successors of All Russia’s Emperor Throne. I promise to keep faithfulness to the throne-like faithful slave and to which I have to swear on Koran in accordance with the custom.\n;The Second Article\nHis Emperor’s Highness on behalf of his openhearted promise gives his word of honour and reassures with his Emperor’s word of honour for himself and for his successors that favour and care towards Ibrahim Khan Shushinsky and Karabakhsky and will never cease to exist.\nTo prove this fact His Emperor’s Highness gives the guarantee to keep the whole possessions and successors of His Magesty (khan) intact.\n;The Third Article\nTo repay the openheartedness of Ibrahim-khan Shushinsky and Karabakhsky to recognize the supreme and sole power of All Russia’s Emperor over himself and his successors this article states that he, the Khan and later his elder son and each elder successor when accepting the khanate has the right to receive Emperor’s confirmation on the khanate from the Governor of Georgia. It consists of the deed (official document), official state seal. While receiving it the new Khan is to take the oath to be faithful to Russian Empire and to recognize the supreme and sole power of Russian Emperor over himself and his successors. The form of the oath is enclosed in this Treaty. The present Ibrahim-khan Shushinsky and Karabakhsky took the oath in presence of Governor of Georgia and general of infantry prince Tsitsianov.\n;The Fourth Article\nI, i.e. Ibrahim-khan Shushinsky and Karabakhsky to prove that my intentions towards my and my successors’ faithfulness to All Russia’s Empire and recognition of the Supreme and sole power of the highest possessors of the Empire promise not to have any relations with neighboring possessors without preliminary consent of Governor of Georgia. And when the envoys from them come or the letters are sent I promise to send the most important ones to the Governor and demand the solving of the questions from him and the ones with less importance to be reported and discussed with the person representing the Georgian Governor at my place.\n;The Fifth Article\nHis Emperor’s Highness accepts the recognition of his supreme and sole power over the possessions of Ibrahin-khan Shushinsky and Karabakhsky with good will and promises: 1) to treat the peoples of these possessions with the same honour as his own faithful citizens without sorting them out from those inhabiting the vast Russian Empire. 2) to preserve continuously the honour of Ibrahim-khan, his spouse, heirs and posterity in the area of Shusha khanate. 3) to give all the power of internal governing, court and persecution, income and its possession to Ibrahim-khan. 4) in order to guard Ibrahim-khan, his spouse and his possessions I promise to send troops (500 persons) with cannons, headquarters and officers and in case of greater defense the Governor of Georgia will have to increase the number of troops due to circumstances to defend militarily the possessions of All Russia’s Empire.\n;The Sixth Article\nI, i.e. Ibrahin-khan Shushinsky and Karabakhsky in response of my faithful diligence make commitment: 1) At the beginning and later on to store up the necessary quantity of wheat and corn by reasonable price determined by the Chief Governor because its supply from Elisavetpol is rather difficult or even must be stated as impossible. 2) The above mentioned troops should be provided with houses to stay in Shusha Fortress. They should be selected by the will of the Commander. They should be supplied with reasonable quantity of firewood. 3) To make the Elisavetpol bound entrance into Shusha fortress comfortable and to build the road suitable for arba passing. 4) It would be convenient for the government to build up a road from Shusha Fortress in direction of Djevad. The workmen must be paid the salary determined by the government.\n;The Seventh Article\nHis Emperor’s Highness showing his goodwill and kindness to his majesty Ibrahim-khan kindly presents his banner with the state Emblem of Russian Empire which is to be kept with him a symbol of khanate and power. Nobody except the khan has the right to carry it to war as it was presented by his Emperor’s Highness.\n;The Eighth Article\nI, i.e. Ibrahim-khan Shushinsky and Karabakhsky having His Emperor’s Highness permission to spend my usual incomedefensehe commitment to pay contribution into the exchequer treasury of His Emperor’s Highness in Tifliss 8.000 chervonets (gold piece coin) a year, to pay it in two halves. 1st half on February 1 and the second half on September 1 beginning with the 1st payment of 4.000 chervonets. Conforming the concluding this treaty by his Emperor’s Highness and according to Asian tradition, besides the oath to faithfulness I pawn my elder son’s Mamed-Hassan-Aga’s son of the second Shukur-Ullah to stay forever in Tifliss.\n;The Ninth Article\nHis Emperor’s Highness kindly expressing his mercy as a taken of faithfulness guarantees his Majesty khan’s grandson 10 roubles of Russian money a day.\n;The Tenth Article\nThis Treaty is concluded for ever and is not to be subjected to any changes from now to forever.\n;The Eleventh Article\nThe confirmation of this Treaty by His Emperor’s Highness with the state sealed deed (official document) must be presented within 6 months after its signing or sooner if possible.\nIn confirmation of that the undersigned parties signed these articles in the camp of Elisavetpol region near Kurek River in summer of 1805 A. D. (Mohammedan 1220) on May 14.\nReferences"
    }
  ]
}