{
  "content": [
    {
      "type": "text",
      "text": "# Trenton Battle Monument\n\n| locmapin                       = USA New Jersey Mercer County#New Jersey#USA\n| area                           =\n| built                          = 1891–1893\n| architect                      = John H. Duncan\n| architecture                   = Beaux ArtsSculptors:William Rudolf O'DonovanThomas EakinsCharles Henry Niehaus\n| added                          = May 6, 1977\n| refnum                         = 77000881\n| designated_other1_name         = New Jersey Register of Historic Places\n| designated_other1_abbr         = NJRHP\n| designated_other1_link         = New Jersey Register of Historic Places\n| designated_other1_date         = October 14, 1976\n| designated_other1_number       = 1800\n| designated_other1_num_position = bottom\n| designated_other1_color        = #ffc94b\n}}\nThe Trenton Battle Monument is a massive column-type structure in the Battle Monument section of Trenton, Mercer County, New Jersey, United States.  It commemorates the December 26, 1776, Battle of Trenton, a pivotal victory for the Continental forces and commander George Washington during the American Revolutionary War.\nDescription\nThe Trenton Battle Monument concourse during its dedication ceremony on October 19, 1893\nDesigned by John H. Duncan, the architect of Grant's Tomb, the monument is an early example of Beaux-Arts architecture in America. The design is based on \"The Monument\", a 1671 structure built to commemorate the Great Fire of London, on the London street where the 1666 fire started. The height of the Trenton monument is intentionally the same height as the London monument.\nThe hollow Roman-Doric fluted column of the monument is constructed of granite, as is the pedestal which supports it, although slightly darker stone was used to give the base the appearance of more solidity. The column is capped by a small, round pavilion, forming an observation deck; accessible by means of an electric elevator, that has provided thousands of tourists an excellent view of the city and the surrounding scene of the battle. Encircling the column, just above the cap, thirteen electric lights, symbolizing the original Thirteen Colonies, shed their radiance at night.\nThe pavilion is surmounted by an acanthus leaf pedestal where, atop the entire structure, a colossal bronze statue of General George Washington by William Rudolf O'Donovan crowns the monument. Washington is depicted as he appeared at the opening of the engagement and, with his extended right hand, directs the fire of the Continental artillery down King (now Warren) Street. The figure is  feet tall, while the monument, including the statue, is  above street level.\nOn the base of the pedestal are two bronze relief panels by Thomas Eakins titled \"The Continental Army Crossing the Delaware River\" and \"The Opening of the Fight.\" The latter panel depicts the battery of Alexander Hamilton about to fire down King Street. The original Eakins bronzes were part of the monument from 1895 until 1969, when they were removed and exhibited at the Corcoran Gallery of Art in Washington, DC. Duplicate castings were made and the copies were reapplied to the monument. The original bronzes were donated to the New Jersey State Museum, where they are on permanent view.\nA third bronze relief panel, \"The Surrender of the Hessians,\" was modeled by Charles Henry Niehaus. On the north side of the pedestal is a bronze tablet presented by the Society of the Cincinnati of New Jersey.\nGuarding the entrance to the monument stand two bronze figures of Continental soldiers by O'Donovan. One is a statue of Private John Russell, a member of Colonel John Glover's Marblehead Regiment of seafaring men from Marblehead, Massachusetts, who gained fame by transporting Washington's army across the ice-choked Delaware River on the night of December&nbsp;25–26, 1776. The other figure is modeled after a likeness of Private Blair McClenachan, of the Philadelphia Light Horse Troop, a unit which also took part in the battle.\nHistory\nThe monument is located in an area of the city known as \"Five Points\". It was here, at the intersection of Warren (King) Street, North Broad (Queen) Street, Brunswick, Pennington and Princeton Avenues, that the American artillery was placed. From this high vantage point, they dominated the streets of Trenton, preventing the Hessian troops from organizing an effective counterattack.\nA movement to erect a monument commemorating the victory at Trenton began in 1843. About forty years later in 1886, the property for the monument was acquired by the Trenton Monument Association. To build the monument, the New Jersey legislature appropriated $15,000, Congress $30,000, and citizens contributed $15,000. Monument Park at the \"Five Points\" was acquired under the provisions of an ordinance passed June 28, 1893.\nThe cornerstone was laid Saturday, December 26, 1891, on the 115th anniversary of the Battle of Trenton. The base and pedestal were erected in the spring of 1892, the capstone raised into position on Saturday, August 31, 1893, and the statue of General Washington finally placed atop the shaft September 5 of the same year. The completed memorial was dedicated with elaborate ceremonies on October 19, 1893, the 112th anniversary of the surrender of General Lord Cornwallis at the Siege of Yorktown in Virginia; in attendance were eight governors of the original thirteen states. The public was first invited to ride an electric elevator up to the observation platform on Christmas Day, December 25, 1896. It is no longer operable, making visiting the vantage point impossible. However, the social documentary photographer Grant Castner was one of the visitors to the top on December 25, 1896, and he took pictures of the view in all directions. Glass plate negatives of these views are part of the permanent collection of the Castner archive at the New Jersey State Museum.\nAlthough various changes have taken place in the immediate vicinity of the monument since its dedication, the commanding figure of Washington still looks down upon the city, which has developed from what was a small village in 1776.  The monument was listed on the National Register of Historic Places in 1977.\nThe Trenton Battle Monument was constructed to commemorate General George Washington's victory at the Battle of Trenton on December 26, 1776. The monument was designed by architect John H. Duncan, who also designed Grant’s Tomb in New York City. It was dedicated on October 19, 1893, in a ceremony that included veterans, state officials, and thousands of visitors.\nThe granite column rises approximately 150 feet and is topped by a statue of George Washington facing south toward the Assunpink Creek, symbolizing his advance after the victory. Bronze relief panels around the base depict key scenes from the battle, including Washington leading his troops across the Delaware River.\nToday, the monument serves as a focal point for local commemorations of the American Revolution. Events such as annual reenactments and community programs begin at the site, which also anchors the northern end of the “Ten Crucial Days” heritage corridor linking Washington Crossing, Trenton, and Princeton.\nSee also\n* Battle of the Assunpink Creek (Second Battle of Trenton)\n* Battle of Princeton\n* Princeton Battlefield\n* National Register of Historic Places listings in Mercer County, New Jersey\n* List of memorials to George Washington\nReferences\n* Trentoniana Collection, Trenton Free Public Library, Trenton, NJ\n* 'Some Early Trenton Washington Celebrations.' Trenton Historical Society, 1933.\n* [https://query.nytimes.com/gst/abstract.html?res=9A03E6DD173EEF33A25756C1A9669D94629ED7CF \"Battle Monument Unveiling; Preparations Nearly Completed for the Ceremony.\"] — The New York Times, 1893.\n* Trenton Historical Society, 'A History of Trenton,' 1679-1929: Two Hundred and Fifty Years of a Notable Town with Links in Four Centuries. Princeton University Press, 1929.\n* Trenton Newspapers, 1778-1932. Trenton, Trenton Times, 1932; Bound volumes on file in the New Jersey State Library and the Trenton Free Public Library.\n* New Jersey Division of Parks and Forestry (NJDEP)\nNotes\nExternal links\n* [http://www.state.nj.us/dep/parksandforests/historic/Trentonbattlemonument/ New Jersey Department of Environmental Protection parks and forestry]"
    }
  ]
}