{
  "content": [
    {
      "type": "text",
      "text": "# Tribes and Empires: Storm of Prophecy\n\n| last_aired           =\n| related              =\n| budget               = US$45.2 million\n| image_size           = 200\n}}\nTribes and Empires: Storm of Prophecy () is a 2017 Chinese television series adapted from the novel of the same name written by Jin Hezai, who also wrote Legend of Winged Tribe, and directed by Cao Dun. It is part of the Novoland series, a media franchise depicting the fictional universe with a known world of three continents and nine provinces divided into the prosperous Eastern Land of Zhongzhou and the nomadic Eight Tribes in Hanzhou.\nIt stars Huang Xuan, Shawn Dou, Zhou Yiwei, Xu Lu, Janice Man and Zhang Jianing. The series airs on iQiyi, Tencent and Youku starting November 21, 2017. The series was a hit among international fans due to its high standard of production, impressive storyline and exceptional performance. The series currently has a 6.8 rating on Douban.\nSynopsis\nThe series is set in the fictional world of Novoland and tells the story of loyalty, friendship, enmity and romance between the young descendants during the twilight years of the Duan Dynasty. The Duan Dynasty has been ruled by the royal Muyun Clan for more than 300 years, assisted by the Muru Clan and its powerful army in controlling Zhongzhou and suppressing the eight nomadic tribes in Hanzhou.\nOur three young male protagonists find their lives and fates intertwined in historical intrigue, political turmoil, and the worlds of magical beings.\nWith the birth of the sixth prince of the Duan Dynasty, he is prophesied to \"bring chaos to the world when he holds the Emperor's sword\". Though a prince and son of Emperor Ming, Muyun Sheng (Zheng Hao / Huang Xuan) lived a lonely and isolated childhood accompanied only by a personal attendant Lan Yu Er. Growing up a kind-hearted young man, he is shunned by others and seen as dangerous due to the prophecy and for being half-human and half-spirit. His life changes when Muru Hanjiang is assigned as his companion in the palace and the two becomes friends. Hanjiang encourages the prince to find out about the disappearance of his mother, a beautiful Mei spirit who became Emperor Ming's Consort Yinrong (Janine Chang). With the discovery of the truth and inheritance of a magical orb, the Muyun Pearl left behind by his mother, the young prince begins his journey in the treacherous Duan court, and becomes a master painter while discovering the world of magical arts. He eventually falls in love with a Mei spirit woman residing in the orb, whom he names Pan Xi (Janice Man). He does not believe in prophecies and uses his own will to suppress his dark side to prevent calamity.\nMuru Hanjiang (Shi Yunpeng / Shawn Dou), the youngest son of General Muru Shuo, is also plagued by a prophecy where he will usurp the Duan Dynasty and become future Emperor. In a display of loyalty to the Duan Dynasty, the General abandons him at a temple. He grows up as Hanjiang and becomes a resilient young man well trained in martial arts. He incidentally saves the young Su Yuning (Eleanor Lee / Xu Lu) and sends her back to the Novoland Inn, but gets mistaken as a thief and thrown in the inn's dungeon to work as a fighter slave for the entertainment of the rich and powerful. He meets and befriends a young Shuofeng Heye, who is originally from the Hanzhou nomadic tribes and sold into slavery. Without realizing the sins of the past generation, the two new friends work together to survive. Hanjiang makes it to the Muru mansion but discovers that his hero, General Muru, is the cold-hearted father that abandoned him. In despair, he willingly stabs himself in the chest at the General's request to kill himself. He survives and for his loyalty, is spared and assigned as the sixth prince's companion. He reunites and falls in love with Su Yuning, who is prophesied to be the future Empress of Duan and destined to marry a prince from the Muyun Clan. He does not care for the prophecy and eventually leaves the palace to join the army, leaving behind a dear friend and young love whom he will meet again.\nShuofeng Heye (Zheng Wei / Zhou Yiwei) was the heir to the Chieftain of the Northern Hanzhou Shuofeng Clan. Under his father's leadership, the tribe finally wins over fertile land from the Suqin tribe and looks forward to a better life, but catastrophe struck. Heye's parents and almost the entire tribe was massacred by the Muru Army for unintentionally harboring a runaway convict of Duan. The surviving children were enslaved, brought to Zhongzhou to becomes a fighter. It is here where he befriends Hanjiang and meets the woman who buys over his slave contract and eventually becomes the love of his life, Muyun Yanshuang (Zhang Jianing), Princess Jing of Duan. The three young men meets in a twist of fate to discover the sins inherited from their parents. Heye eventually returns to Hanzhou and finds new family and reunite with old ones. Driven by vengeance and a desire for a better life for the people of Hanzhou, he pursues his destiny to be the \"Tie Qin\" to unite the eight nomadic tribes to revolt against Duan.\nThe series also depicts the intertwined fates of the past generation: the love triangle in the royal Muyun Clan between Emperor Ming (Lu Fangsheng), Consort Yinrong (Janine Chang), and Empress Nanku (Jiang Qinqin); the rivalry amongst the Princes Muyun Han (Li Zifeng), Muyun Lu (Sun Jian), Muyun Hege (Peng Guanying); the hidden agendas of the Wanzhou Muyun Clan, led by the conniving father-son duo Muyun Luan (Wang Qianyuan), and Muyun De (Zhang Xiaochen) with the help of the mysterious Mo Yu Chen (Zhao Wei); the people seeking to reinstate the fallen Sheng Dynasty, Princess Ji Yuncong (Kan Qingzi), and Long Jinhuan (Du Yuming).\nPain and sorrows of past wounds now manifest in the new generation. Can they escape from the storm of prophecies?\nCast\n;Clans in Zhongzhou\n;The Muyun and Muru Clans signed a pact of trust 300 years ago after taking over Zhongzhou from the Sheng Dynasty. Both vowed to defend each other's status and glory as the ruling royal clan and military clan of the Duan Dynasty.\n;\n;Muyun Clan\nInvaded Zhongzhou and overthrew the Sheng Dynasty with the Muru Clan 300 years ago. The current royal family of the Duan Dynasty who has ruled Zhongzhou and subjugated Hanzhou from the capital, Tian Qi. Infighting amongst Clan members and the Duan court led to bloodshed and two attempted coups to install Muyun Hege as the new Emperor of Duan.\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\" |Actor !! style=\"width:17%\" |Character !! Introduction\n|-\n| colspan=\"3\" |The Zhongzhou Muyun Clan, current ruling family in the series\n|-\n| Lu Fangsheng || Muyun Qin || Emperor Ming of Duan.\nHe is constantly pained by the loss of his true love, Yinrong, whom he sacrificed to keep his throne. Though outwardly indifferent to Muyun Sheng, he wish to keep him safe. He endears himself to Muyun Sheng after the latter saves him from death in the first coup by the Nanku Clan. During the second coup, he is threatened by members of the Duan court to execute Muyun Sheng, but refuses.\nAt the end of the series, he is stabbed to death by Empress Nanku's personal attendant and dies, allowing Muyun Hege to ascend to the throne in the second coup.\n|-\n|Jiang Qinqin\n|Nanku Mingyi\n|Empress of Duan, wife of Emperor Ming and Muyun Hege's mother.\nDespite her strong family background and devotion for Muyun Qin, her love for her husband was never reciprocated. Her clan was punished for treason after the first coup fails, she is spared but suffers daily being treated as Yinrong's replacement for the Emperor and has to see her son, Muyun Hege placed under house arrest.\nAt the end of the series, she briefly ascends as Empress Dowager in the second coup before committing suicide after Hege is killed by Yu Xinji during the coronation.\n|-\n| Li Zifeng || Muyun Han || Prince Sawu of Duan, eldest prince and son of Emperor Ming. A disciple of General Muru Shuo, whom he seems as a godfather.\nHe is upright and candid, with supreme martial arts skills. He holds an unexpressed love for Muyun Yanshuang since childhood, but when he finally proposes to Yanshuang, she has already fallen for another.\nAt the end of the series, he leads the Sliver Armor Guards with Muyun Yanshuang in an attempt to retake the capital after the second coup.\n|-\n|  Sun Jian|| Muyun Lu || Prince Ruiwen of Duan, second prince and son of Emperor Ming.\nElegant and kind, he is a master of strategies and tactics. He has a one-sided love for Su Yuning and once sought for the throne so he could marry her. Despite the rivalry in love with Muru Hanjiang, he befriends  and helps the latter multiple times in the series.\n|-\n| Peng Guanying|| Muyun Hege || Prince Yuxing of Duan, third prince and son of Emperor Ming and Empress Nanku.\nAmbitious and talented, his greed for the throne eventually destroyed him. He resents his half-brother Muyun Sheng, whom he sees as a \"monster\". After the first coup fails, he is placed under house arrest and becomes dispirited. He loves Nanku Yueli, but chooses to betray her after ascending to the throne in the second coup, installing the daughter of Minister Xue as Empress instead. Killed by Yu Xinji during his coronation.\n|-\n| Huang XuanZheng Hao (young)|| Muyun Sheng|| Prince Ningrui and later, Crown Prince of Duan, sixth prince and son of Emperor Mingle and Consort Yinrong. Trusted confidant of Muru Hanjiang.\nA half-human and half-spirit. He was prophesied to become the future Emperor and would destroy the world. He becomes a master painter that produces lifelike paintings. Instead of fighting for the throne, he enjoys spending his time with a magical being living in the Muyun Pearl whom he names Panxi.\nUpon the death of Muyun Hege, he ascends to throne but gives it up at the end of the series in search of a way to revive Panxi.\n|-\n| colspan=\"3\" |The Wanzhou Muyun Clan\n|-\n| Wang Qianyuan|| Muyun Luan || Prince Ye, deposed crown prince of the former emperor and Emperor Ming's older half-brother. Husband of Muru Ping and Muyun De's father.\nHiding a cunning and scheming personality behind a humorous facade, he plots to usurp the throne and plays an important role in the various schemes against both the ruling Zhongzhou Muyun Clan and the Muru family. He has ambiguous feelings towards his sister-in-law, Empress Nanku and dubious relations with Nanku Yueli. Mastermind of the second coup. Guarding against his wife from the Muru Clan, he personally kills her after the success of the second coup.\n|-\n| Zhang Yao || Muru Ping || General Muru Shuo's sister, Muyun Luan's wife and Muyun De's mother.\nLike her brother, she displays great loyalty to the dynasty and Muru Clan. She incites hatred from Muyun Luan for her loyalties and often chides her husband for his treasonous nature. Murdered by Muyun Luan.\n|-\n| Zhang XiaochenZhou Qi (young) || Muyun De || Muyun Luan's second son. Disciple and godson of Mo Yu Chen.\nHe is obsessed with the magical arts. A smooth talking and sly man who often moves with a purpose in mind, he colludes with Mo to achieve his goal of conquering the world with magical arts. He maintains ambiguous relationships with Lan Yu'er and Nanku Yueli.\n|-\n| colspan=\"3\" |Other Muyun Clan Members\n|-\n| Zhang Jianing || Muyun Yanshuang || Princess Jing of Duan, daughter of Prince Jing and Commander of the Sliver Armor Army.\nA general who is headstrong and competitive. She initially admires Muyun Han, and has a complex relationship with Shuofeng Heye, whom she bought as a slave. She eventually falls for Heye, though they could not be together being on opposing sides of the political turmoil.\n|-\n|Wang Yinan\n|Muyun Yan\n|The Emperor's younger sister and Muru Shuo's wife.\nSee Muru Clan.\n|}\n;Muru Clan\nInvaded Zhongzhou and overthrew the Sheng Dynasty with the Muyun Clan 300 years ago. The aides of the current royal family and entrusted with great military power, the Muru Army commands great fear amongst the Hanzhou Tribes. The Muru Clan suffers from political machinations in the war with the Helan Tribe and subsequent second coup. Despite years of meritorious service, the clan is eliminated under the rule of Muyun Hege - the army is disbanded, men are exiled to the land of the Titans to build a new city, and women and the young are beheaded.\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\" |Actor !! style=\"width:17%\" |Character !! Introduction\n|-\n| Cao Weiyu || Muru Shuo || Great General of Duan and trusted aide of Emperor Ming. Father to Muru Hanshan, Hanchuan, and Hanjiang\nHe is known for his loyalty and allegiance toward the royal family and righteous personality even in times of war. To avoid suspicion by the emperor, he often treats Hanjiang callously, but loves him deeply.\nAt the end of the series, he refuses to rebel against Muyun Hege in the second coup and leads the remaining male Muru clan members into exile at the land of the Titans.\n|-\n|Wang Yinan\n|Muyun Yan\n|The Emperor's younger sister and Muru Shuo's wife.\nA gentle woman and mother to Muru Hanshan, Hanchuan and Hanjiang. She kills herself in an attempt to plead Muru Shuo to spare an adult Hanjiang's life.\n|-\n| Qu Gaowei || Muru Hanshan ||Eldest son of Muru Shuo and Muyun Yan and older brother to Hanchuan and Hanjiang.\nUnlike his father, he is willing to use despicable means to win wars and defend the honour of the Muru Army. During the war with the Helan Tribe, he is captured, branded as a slave, and sent back to the capital to humiliate the Muru Army and Duan Dynasty.\nAt the end of the series, he went into exile with the remaining male Muru clan members at the land of the Titans.\n|-\n| Zhang Junming || Muru Hanchuan || Second son of Muru Shuo and Muyun Yan and older brother to Hanjiang.\nDespite blaming Hanjiang for their mother's death, he still rushes to save him when the latter is accused of treason in the second coup.\nAt the end of the series, he went into exile with the remaining male Muru clan members at the land of the Titans. He is hurt and left crippled and dispirited after witnessing the beheading of his wife and children.\n|-\n| Shawn Dou Shi Yunpeng (young) ||  Muru Hanjiang || Third son of Muru Shuo and Muyun Yan. Trusted confidant of Muyun Sheng.\nDue to a prophecy that has declared him as a future monarch, his father abandoned him since young. He grows into a resilient young man with a strong personality. He falls in love with Su Yuning and protects her throughout the series. He yearns for freedom, but at the same time is dedicated to protecting the peace of the world and Muyun Sheng. Framed for the regicide of Emperor Ming in the second coup.\nAt the end of the series, he went into exile with the remaining male Muru clan members at the land of the Titans.\n|-\n|Zhang Yao\n|Muru Ping\n|General Muru Shuo's sister, Muyun Luan's wife and Muyun De's mother.\nSee Muyun Clan.\n|}\n;Nanku Clan\nA powerful clan with ministers in court and a clanswoman as Empress, the clan was eventually banished after the first coup failed.\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\"|Actor !! style=\"width:17%\"|Character !! Introduction\n|-\n|Jiang Qinqin\n|Nanku Mingyi\n|Empress of Duan, wife of Emperor Ming and Muyun Hege's mother.\nSee Muyun Clan.\n|-\n| Yanko Kouji || Nanku Qi || Empress Nanku's older brother. A court minister and father of Nanku Yueli.\nThe mastermind in the first coup for Muyun Hege to ascend to the throne, even to the extent of committing the regicide of Emperor Ming. Eventually executed and causes the entire Nanku Clan to be punished when the plan goes awry.\n|-\n| Wan QianMa Zehan (young) || Nanku Yueli|| Empress Nanku's niece and Nanku Qi's daughter.\nGroomed to be the next Empress, she yearns for a royal destiny like her aunt. She is jealous of Su Yuning's royal destiny and attempts to kill the latter many times. Unscrupulous and prone to flying into a murderous rage, she was set to become Muyun Hege's wife in the first coup. But the plan goes awry and women of the Nanku Clan were banished to serve as court courtesans. She is rescued by Muyun De and attempts to reverse her destiny through employing her feminine charms on Muyun Luan, Muyun Hege, and Qin Yu Feng.\nAt the end of the series, she is abandoned at the altar by Muyun Hege after he ascends to the throne in the second coup. However, she is able to escape punishment by faking her death and evading capture from the Muru Army. She is saved by Qin Yu Feng and pretends to have lost her memories and previous personality, becoming a sweet little fool.\n|}\n;Nomadic Tribes in Hanzhou\n;At the start of the series, the eight nomadic tribes were competing and killing one another, unable to fight against persecution by the Duan court and Muru Army. It is later revealed that the tribes were united 300 years ago, but cursed by a prophet from Duan to suffer from in-fighting and never to pose a threat to Zhongzhou ever again.\n;\n;Shuofeng Tribe\nThe leader of the nomadic tribes in Hanzhou before the rise of the Duan Dynasty 300 years ago, the Tie Qin was from Shuofeng and wields the legendary sword. The Duan Dynasty's Muyun and Muru Clans were later revealed to be of nomadic lineage and rose from the sub-branches of the Shuofeng Tribe. During the start of the series, they were living in harsh conditions and eventually annihilated by the Muru Army.\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\" |Actor !! style=\"width:17%\" |Character !! Introduction\n|-\n| Jiang Yi || Shuofeng Da ||Shuofeng Heye's father. The late Chieftain of the Northern Hanzhou Shuofeng Tribe.\nDue to the harsh living conditions, he attempts to move the clan to the lands of the Suqin Tribe. Killed early in the series by the Muru Army for unintentionally harboring an escaped convict from Duan.\n|-\n| Li Nian || Longke Danzhu || Shuofeng Da's wife and Shuofeng Heye's mother.\nKilled early in the series by the Muru Army for unintentionally harboring an escaped convict from Duan.\n|-\n| Zhou YiweiZheng Wei (young) || Shuofeng Heye || Shuofeng Da and Longke Danzhu's son, heir of the Northern Hanzhou Shuofeng Clan. Husband to the deceased Jin Zhuhai, and in love with Muyun Yanshuang\nHe grows from a vindictive and revengeful boy into a brave and insightful ruler, who seeks to unify the nomadic tribes and finally give them a home of their own. To achieve this goal, he is willing to give up the glory and the legendary sword of the \"Tie Qin\" to serve under the stronger Helan Tieyuan and his tribe. At the end of the series, the Helan tribe is defeated and nearly annihilated in the war with Duan, but he survives with the Helan siblings.\n|-\n| Chen BingqiangCao Yingrui (young)|| Shuofeng Suhe || A young shaman born by a father from the Shuofeng Clan and mother from the cursed Dan Yao tribe that is skilled in the magical arts.\nAs the first male descendant of his maternal tribe in 300 years, he is bestowed with powers that others do not have - the art of spiritual navigation and prayer of blessings. He is prophesied to be the greatest of his clan and to help the \"Tie Qin\" united Novoland. He guides Shuofeng Heye in retrieving the legendary sword of the \"Tie Qin\". He falls in love with Heshu Hongling.\n|}\n;Helan Tribe\nAnnihilated by the Muru Army at the start of the series, sibling Helan Tieyuan and Helan Tieduo were able to rebuild the tribe with the help of someone in Duan.\n{| class=\"wikitable\"\n|-\n! style=\"width:18%\" |Actor !! style=\"width:17%\" |Character !! Introduction\n|-\n| You Daqing || Helan Dao || The late Chieftain of the Hanzhou Helan Tribe.\n|-\n| Cai Lu  Di Xiaoguang (young) || Helan Tieyuan || Helan Duo's son and Helan Tieduo's older brother. Chieftain of the Hanzhou Helan Tribe.\nShuofeng Heye's childhood friend who rebuilt and leads the Helan Tribe with the help of someone from Duan. A pompous and vicious man who employs violent methods in establishing and expanding his power. Declares himself the \"Tie Qin\", Ruler of Novoland and begins a war with Duan with the support of Shuofeng Heye, the Suqin Tribe, and the Dan Yao Tribe. The tribe is defeated and nearly annihilated in the war, but he survives with his sister and Shuofeng Heye.\n|-\n|Gao Ye\n|Suqin Ziyan\n|Cheftian of the Suqin Tribe and wife of Helan Tieyuan.\nShe holds a deep grudge against Shuofeng Heye, whose tribesmen massacred hers in childhood, leaving her the sole survivor. After marrying Tieyuan, she schemes but fails to eliminate Shuofeng Heye. At the end of the series, she is captured by the Muru Army after the Helan Tribe loses the war. Her and her unborn child are enslaved and bestowed upon power of the dark arts by the God of Chaos. In exchange, he takes away her goodness, but saves her from captivity and promises misery upon her enemies .\n|-\n| Wang Sisi   Chen Qianyang (young) || Helan Tieduo || Helan Duo's daughter and Helan Tieyuan's younger sister.\nShuofeng Heye's childhood friend who is in love with him. Separated at childhood, she is reunited with Heye when he is married to his first wife, Jin Zhuhai. In a jealous rage, she asks her brother, Helan Tieyuan to get rid of Zhuhai. For her ruthless schemes, Heye swears he will never fall for her. Despite this, she betrays her brother to support him in his journey of becoming \"Tie Qin\", Ruler of Novoland. The tribe is defeated and nearly annihilated in the war, but she survives with her brother and Shuofeng Heye.\n|}\n;Others\n;People in Duan court\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\"|Actor !! style=\"width:17%\"|Character !! Introduction\n|-\n| Xu Lu  Eleanor Lee (young) || Su Yuning || Daughter of a eunuch.\nDuring the palace selection, she was prophesied to be the future Empress of Duan and incurs the wrath of Nanku Yueli, who bullies and attempts to murder her multiple times. She develops feelings for Muru Hanjiang, who saves her multiple times before and after she enters the palace. Surviving the latest attempt on her life, she returns home and is sent away by her father to live with Su Zhen to keep her safe. At Yi Shui village, she meets Muru Hanjiang and Muyun Lu, who were in danger and escaped to Yi Shui village while looking for a national treasure. Surviving an ambush by Ji Yuncong and the Tian Luo Hall, the trio eventually returns to the capital where Yuning is forced to marry Muyun Sheng when he becomes Crown Prince. With all parties unhappy with the marriage, Muru Hanjiang kidnaps Yuning and sends her back to Yi Shui village to live quietly and away from political intrigue.\nAt the end of the series, she escapes the Duan prison and seeks to reunite with Muru Hanjiang, who was banished to the land of the Titans with the Muru Clan.\n|-\n| Song Yunhao ||Lingge Qing || Prophet of Duan and leader of the Huangji Jingtian Sect.\nHe prophesied the destinies of Muyun Sheng and Su Yuning. The Sect harbors a deep secret related to the barbaric invasion 300 years ago - their leader had sacrificed his life to curse the Tie Qin sword, cursing the eight nomadic tribes to suffer from in-fighting and never to pose a threat to Zhongzhou ever again\n|-\n| Su Guotao || Gu Songzhi || Court Minister Gu.\n|-\n|\n|Xue Huo\n|Court Minister Xue.\nPlays an important role in the second coup for Muyun Hege to ascend as Emperor and install his daughter as the new Empress.\n|-\n| Liu Bo || Jin Bingyi || Emperor Ming's Head Eunuch. Killed on Empress Nanku's orders for witnessing an argument between the latter and Emperor Ming.\n|-\n| Wang Gang || Wu Ruyi || Empress Nanku's trusted Head Eunuch who is willing to give up his life for the empress.\n|-\n| Sun Zhenglin || Mu Yuan || Muyun Luan's assistant.\n|-\n| Feng Xinyi || Yu Xinji || General Long Kui, Muyun Han's loyal assistant.\nOriginally a general of the Muru Clan assigned to guard Muyun Sheng outside the palace, he saves Emperor Ming in the first coup and is granted the title Long Kui. At the end of the series, he leads the Muru Army into the palace after the second coup and successfully removed Muyun Hege from the throne during the latter's coronation.\n|-\n| He Dujuan || Lan Yu'er || Muyun Sheng's personal attendant.\nHaving accompanied Muyun Sheng since childhood, she leaves him to follow Muyun De as her love for the former remains unrequited. Despite Muyun De's often callous treatment of her feelings towards him, she maintains her kind and caring nature, especially towards Muyun Sheng.\nShe takes over Qin Yufeng as the new Head shopkeeper of the Novoland Inn.\n|-\n| Yu Haoming || Gu Songtuo || Lieutenant general of the Muyun Silver Armor Army.\n|-\n| Zhang Yanyan || Su Zhen || Su Yuning's etiquette teacher who cares deeply for her.\nAddressed as Su Momo (nanny) by Yuning, she settles down in the idyllic Yi Shui village after the disappearance of the former during the palace selection. She is hurt and eventually dies while trying to save Yuning from Princess Ji and the Tian Luo Hall.\n|-\n|\n|Lin Xiu Man\n|Personal attendant to Consort Yinrong.\nShe is bounded to Empresses Nanku to keep the events a secret through the Duan Xin poison and continues to keep Yinrong alive in the palace under the Empress' orders. She eventually reveals to Muyun Sheng the truth about Yinrong's disappearance - when forced by Muyun Luan to make a choice between his Kingdom or protecting the love of his life, Muyun Qin chose his kingdom and stabs Yinrong - and activates the poison. She also safekeeps the Muyun Pearl and passes it to Muyun Sheng before dying.\n|}\n;Magical beings\nIn addition to Humankind, they form the six intelligent races of Novoland: Spirits, Snow Wolves, Merfolks, Titans, Winged People, and Dwarves.\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\" |Actor !! style=\"width:17%\" |Character !! Introduction\n|-\n| colspan=\"3\" |Spirits / Mei Ling 魅灵 - They are \"essences\" of the earth that after years of cultivation, able to develop consciousness. They are feared and persecuted by the Duan court as higher level beings are able to develop human form and manipulate the energy around them, or skilled in what humans call the magical arts.\n|-\n| Janice Man|| Panxi|| A Spirit / Mei Ling from the sea who resides in a magical orb, and Muyun Sheng's true love.\nShe initially does not have any memories of who she is as her actual identity is the slave of the God of Chaos who orders her to teach Muyun Sheng the magical arts in an attempt to awaken his suppressed dark side. She believes she has a heart that is in love with Muyun Sheng and willing to defy her creator to protect the man she loves.\nShe is captured and killed while protecting Muyun Sheng.\n|-\n| Janine Chang|| Yinrong || A Spirit / Mei Ling, Muyun Sheng's mother and Consort to the Emperor Ming of Duan\nOnce the most beautiful woman in the dynasty, and the Emperor Ming's true love. She willingly sacrifices herself to avoiding hurting him with her powers after he stabs her. Initially thought to have died, she is deliberately kept alive by Empress Nanku after losing her humanlike appearance as a form of humiliation. In their final encounter, she considers Empress Nanku \"pitiful\" before being murdered by the latter.\n|-\n|Gu Xuan\n|Qianhong\n|A Spirit / Mei Ling.\n|-\n|Du Yuming\n|Long Jinhuan\n|Head of Tian Luo Hall, a spirit-human being like Muyun Sheng.\nSee People in Zhongzhou.\n|-\n| colspan=\"3\" | Snow Wolf / Xue Lang 雪狼 - Created by the God of Chaos by enslaving and cursing Heshuo Hongling with powers to create therianthropic beings that can shift between wolf and human form. They live and guard the Black Forest, ensuring humans do not enter the forest.\n|-\n|Huo Zhengyan || Hui Er Duo|| King of the therianthropic Snow Wolf Tribe.\nHe gifted the Snow Wolf Heart and pledged allegiance toward Shuofeng Heye after the latter saved his life and lifted the curse placed on his tribe. As his three promises to Heye, his tribe assisted in the Helan war against the Muru Army and helped to save Muyun Yanshuang when she was used as bait during the war.\n|-\n| colspan=\"3\" | Merfolk / Jiao Ren 鲛人 - Humanoid beings that live under the sea and can survive on land. They are able to produce valuable mer-pearls.\n|-\n| Hou Yidi || Meiyin || A glamorous Merfolk woman assigned to accompany Muyun Hege back to Zhongzhou to ensure he keeps his promise to cede control of the seas to the Merfolk Tribe once he ascends to the throne. Murdered by Nanku Yueli after humiliating her with the scar on her face and appearing seductive in front of Hege.\n|-\n| colspan=\"3\" |Titans / Kua Fu 夸父 - Humanoid beings that grow to twice the size of human beings. They live in the cold and snowy areas of the Northern Shangzhou.\n|-\n| Jia Haitao ||Fanla Kaise || King of the Titans, ruler of Shangzhou.\n|-\n| colspan=\"3\" |Winged People / Yu Ren 羽人 - Humanoid beings that are able to deploy their wings under the energy of moonlight.\n|-\n| Du Chun || Lu Ranqing || King of the Winged Tribe.\n|-\n| colspan=\"3\" |Dwarves / He Luo 河络 - Humanoid beings a third of the size of humans. They are incredibly intelligent and skilled at creating technologically advanced inventions and weapons. In this series, they live in well developed underground cities.\n|-\n|\n|\n|An expert craftsman who lost his right arm and befriends Muru Hanjiang while working with the Muru Army before being kidnapped by the Dwarves' leader. He has a soft spot for Hanjiang. In the series finale, he unlocks the secret of the Heavenly Stone and location of the Dynastic Seal.  He describes the creation of Novoland - from a battle between the God of Chaos and God of Creation 8,000 years ago.\nAt the end of the series, he deciphers the location of the national treasure.\n|-\n|\n|\n|Leader of the Dwarves who wish to lead his people to living on land where there is sunshine.\n|}\n;People in Zhongzhou\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\"|Actor !! style=\"width:17%\"|Character !! Introduction\n|-\n| Zhao Wei || Mo Yu Chen || Teacher of the dark magical arts and godfather to Muyun De. Has an obsession with Muyun Sheng, and Panxi, and the powers they hold as magical beings.\nA mysterious man from Chen Yue Sect who is skilled in dark magical arts. His is in cahoots with Muyun De to fulfill his ultimate goal to cause chaos in the world.\n|-\n| Kan Qingzi || Ji Yuncong || Princess Ji of the fallen Sheng Dynasty who harbors a dream of rebuilding her country.\nThough she admires Muyun Sheng, she hopes to eliminate the Muyun Clan for usurping her family's throne. She lives in an underground palace and saves Su Yuning after she is pushed off a cliff by Nanku Yueli. Though she uses Yuning in her schemes later in the series, she considers Yuning her only friend.\n|-\n| Du Yuming ||  Long Jinhuan || Head of Tian Luo Hall.\nLeader of a group of skilled assassins once thought to have been eliminated by the Duan court. He assists Princess Ji and reveals himself as a spirit-human being like Muyun Sheng. Though a ruthless killer, he shows kindness towards the underdogs of society and longs for a safe land for Spirits who are persecuted by humankind.\nAt the end of the series, he promises Muyun Sheng a way to bring Panxi back to life as a physical being with human form - the two embark on a journey to a faraway land.\n|}\n;People in Hanzhou\n{| class=\"wikitable\"\n|-\n! style=\"width:13%\"|Actor !! style=\"width:17%\"|Character !! Introduction\n|-\n| Re Yizha || Jin Zhuhai || A daughter of a Muru warrior and nomad woman and Shuofeng Heye's former and deceased wife. She is framed by Helan Tieyuan for infidelity. Though Heye trusts and loves her, she kills herself after being sullied.\n|-\n|Wang Jianxin\n|Jin Ji / Muru Jinji\n|Father of Jin Zhuhai. Originally named Muru Jijin, he defected from the Muru Army to marry a nomad woman. He dies from a wolf attack while guarding his daughter's corpse in the desert. His death causes Shuofeng Heye to lose his newfound family and return to the Helan Tribe.\n|-\n|Li Xinai\n|Heshu Hongling\n|Daughter of Heshu Zhuozhuo and cursed by an unknown entity with the ability to turn people into snow wolves.\nA young female descendant of the Heshu Tribe residing in the Black Forest. She was kidnapped at four years old and given the power to turn children into Snow Wolves. She was cursed with the appearance of an old witch in red robe and to control the Snow Wolves. She takes a liking to Shoufeng Suhe who managed to lift the curse placed on her and the Snow Wolf Tribe. Separated from her father, Heshuo Zhuozhuo at a young age, they reunite for a short while before he is killed by the Muru Army.\n|-\n|Sun Liang\n|Heshu Zhuozhuo\n|Father of Heshu Hongling and enslaved by the Muru Army as a horse rearer.\nAs a descendant of the Heshu Tribe and like Hongling, he is able to communicate with animals and have a keen sense of affinity with all living beings on earth. He hopes for the return of the Tie Qin so he can stop working for the enemy. After reuniting with Hongling during the war with Helan Tribe, he is killed for releasing all the Muru Army's war horses.\n|-\n| Ji Huanbo || Longke Kun || Fiercest slave hunter of the Longke Tribe.\n|-\n| Han Pujun || Agebu || A barbarian businessman who owns many slaves.\n|}\nProduction\nProduced by Novoland International Cultural Communication Ltd, Tribes and Empires: Storm of Prophecy is one of the most expensive Chinese drama produced, boasting a budget ranging from 300 Million RMB to 500 Million RMB. Filming began in August 2015 at Xinjiang, China and wrapped up on 27 May 2016 at Hikone, Japan; taking a total of 270 days.\nCrew\nThe series is directed by Cao Dun, who directed the hit social commentary Dwelling Narrowness. It is co-written by Jin Hezai, the author of the original novel. Other notable cast members include artistic director Huang Wei who once worked as the creative director of Vogue and is known for his costume designs in Tiny Times and My Sunshine; as well as stunt choreographer Lin Peng who has mostly worked in Hollywood productions like Kingsman: The Secret Service and Urban Games.\nIt is reportedly the first Chinese television series to employ the Animatronics filming technique. The special effects are handled by French company Technicolor SA.\nAwards and nominations\n{| class=\"wikitable\"\n|-\n! Year !! Award !! Category !! Nominee !! Result!!Ref.\n|-\n| rowspan=1|2017 ||8th Macau International Television Festival || Best Supporting Actor || Zhou Yiwei ||||rowspan=1|\n|-\n| rowspan=3|2018 || rowspan=2| 24th Shanghai Television Festival || Best Cinematography ||Jing Chong|| || rowspan=2|\n|-\n| Best Art Direction ||||\n|-\n|24th Huading Awards\n|Best Actor (Ancient Drama)\n|Huang Xuan\n|\n|\n|-\n|}\nInternational broadcast\n{| class=\"wikitable\"\n! Country\n! Network\n! Airing dates\n|-\n||  China\n|| Tencent Video  iQiyi  Youku\n|| November 21, 2017 - (20 updates each Tuesday to Saturday Members see ahead of next Saturday)\n|-\n||  Malaysia\n|| dimsum\n|| December 19, 2017 - (20:00 Tuesday to Saturday update two episodes) (Horse Network Premiere)\n|-\n||  Thailand\n|| Amarin TV (อมรินทร์ทีวี)\n|| March 3, 2018 - March 26, 2018 (Every Saturday and Sunday at 18.36 - 19.30.)\n|-\n||  Taiwan\n|| GTV (八大電視)\n|| December 11, 2017 - February 15, 2018 (Monday to Friday 23:00 - 00:00 From February 5, it will be changed to 22:00 - 00:00)\n|-\n||  Singapore    Malaysia    Thailand   United States\n|| Sony One, Dramafever.com\n|| Dramafever.com in the United States.\n|-\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}