{
  "content": [
    {
      "type": "text",
      "text": "# Triggerfinger (The Walking Dead)\n\n|writer=David Leslie Johnson\n|director=Billy Gierhart\n|photographer   = Rohn Schmidt\n|editor         = Hunter M. Via\n|guests=*IronE Singleton as Theodore \"T-Dog\" Douglas\n*Lauren Cohan as Maggie Greene\n*Emily Kinney as Beth Greene\n*Michael Zegen as Randall Culver\n*Scott Wilson as Hershel Greene\n*Jane McNeill as Patricia\n*James Allen McCune as Jimmy\n*Aaron Munoz as Tony\n*Keedar Whittle as Sean\n*Phillip DeVona as Nate\n| season_article = The Walking Dead season 2\n| episode_list = List of The Walking Dead episodes\n|prev=Nebraska\n|next=18 Miles Out\n}}\n\"Triggerfinger\" is the ninth episode of the second season of the post-apocalyptic horror television series The Walking Dead. It originally aired on AMC in the United States on February 19, 2012. The episode was written by David Leslie Johnson and was directed by Billy Gierhart. In the episode, Rick Grimes (Andrew Lincoln)'s actions initiate a standoff between his group, Dave (Michael Raymond-James) and Tony's (Aaron Munoz) men, and the walkers nearby. Meanwhile, Shane Walsh (Jon Bernthal) decides to save Lori Grimes (Sarah Wayne Callies), who has been injured in a car crash.\nPlot\nLori Grimes, having gotten into a car crash while trying to find Rick, fends off two walkers and makes her way toward town. Back on the Greene farm, the rest of the group discover Lori's absence. Carol Peletier attempts to ask Daryl Dixon go find Lori, but learns he was the one who let her go alone to find Rick, and no longer wishes to be anyone's \"errand boy.\" Daryl berates Carol for not minding her own business. Carol leaves to find Shane Walsh and explains Lori's absence. Shane is able to find her, and lies to her that Rick has returned to the farm to get her to come back with him. When they return to the farm and Rick is not yet there, Shane admits to Lori he was more worried about her unborn child, inadvertently revealing her pregnancy to the rest of the group. Meanwhile, Andrea consoles Hershel's daughter Maggie and tells her to be strong for her sister, Beth, who is still in a comatose state.\nIn town, Rick, Hershel Greene, and Glenn prepare to leave after shooting down Dave and Tony, when a three-man search party arrives outside the tavern looking for Dave and Tony. Rick tries to profess self-defense, but the search party refuses to accept this, leading to a standoff. Rick's group escapes out the back of the tavern, and Rick tells Hershel to cover Glenn while he makes a run for the car. A man named Sean (Keedar Whittle), who was part of the group, sneaks up behind Glenn and attempts to shoot him. Hershel shoots and wounds Sean, who starts crying out in pain. Rick asks Hershel what happened, he says he thinks Glenn was hit. Rick finds Glenn is just frozen behind a dumpster. Walkers begin to devour Sean and he is left for dead. Gunfire between the groups attracts a nearby horde of walkers. The attackers cease fire and attempt to escape, but one, Randall (Michael Zegen), ends up impaling his left leg on a fence. Rick's group decides to save Randall by yanking him off the fence.\nThey blindfold Randall and return to the farm. Hershel immediately operates to save Randall's leg, but he states he sustained nerve damage and will not be able to walk for a week. Rick's decision to return with Randall is met with skepticism from Shane who believes this to be a risky decision. Rick says that once Randall is well enough, they will release him far enough away from the farm to keep its location unknown; Hershel backs this plan up, telling Shane that Rick's group will have to leave the farm should they do otherwise. Glenn attempts to distance himself from Maggie, telling her that their relationship caused him to lose his focus during the shootout in town.\nDale Horvath continues to ask the others about Shane, and is shocked that Andrea seems to side with Shane that Rick has refused to accept the reality of the situation. Lori speaks to Rick about what Dale has told her regarding Shane, including the threats he made towards Dale and his involvement in Otis' death. She also tells Rick that Shane believes her child is Shane's, and that their affair was not a mistake. Lori warns Rick that Shane is dangerous.\nReception\nRatings\nUpon its initial broadcast on February 19, 2012, \"Triggerfinger\" was watched by an estimated 6.89 million viewers, down from the previous episode which reached 8.10 million viewers.\nCritical response\nZack Handlen writing for The A.V. Club rated the episode B on an A to F scale. Eric Goldman at IGN gave the episode 8.5 out of 10.\nReferences\nExternal links\n*[https://www.amc.com/twdu/the-walking-dead/season-2/episode-9 \"Triggerfinger\"] at AMC\n*"
    }
  ]
}