{
  "content": [
    {
      "type": "text",
      "text": "# Trinity College Queensland\n\nTrinity College Queensland is a theological institution of the Queensland Synod of the Uniting Church in Australia.\nTrinity College Queensland is responsible for the delivery of undergraduate and postgraduate degrees, chaplaincy training and lay education in the Queensland Synod.\nHistory\nThe steps towards the creation of Trinity Theological College (now known as Trinity College Queensland) are outlined in Teaching the faith in an age of doubt, a booklet by R.H. Gough, Chairman of the Ministerial Education Board in 1980.\nIn brief, the three theological halls of the foundational churches which came into union in 1977 were already actively cooperating in the 1960s, leading to the creation of a Joint Faculty in 1968. All three colleges were associated with residential colleges at the University of Queensland at St Lucia; the Congregational Hall at Cromwell College, the Presbyterian Divinity Hall at Emmanuel College and the Methodist Theological Hall at King's College.\nTrinity Theological College was inaugurated in 1977 under the leadership of the founding Principal, Rev Professor Roland Busch and originally situated at Emmanuel College. The founding and commissioning service for Trinity Theological College was held 23 February 1978 at Albert Street Uniting Church, Brisbane.\nThe opening and dedication service of new premises at Ryan's Road St Lucia was held 22 June 1980, formerly the site of the Toowong Reach Methodist Church which opened in 1915.\nAfter the Uniting Church Centre on Bayliss Street Auchenflower was established (dedicated 9 October 1988) Trinity Theological College moved to historic Drysllwyn House (circa 1904) on the same premises. In 2014 the Pilgrim Learning Community, Chaplaincy Education and Trinity Theological College were amalgamated into Trinity College Queensland. This transformation was undertaken with a vision to offer a whole-of-church approach to theological education.\nTrinity College Queensland is now located within the Uniting Church Centre.\nDr. Scott Downman was appointed as Acting Principal of Trinity College Queensland in March 2025.\nCourses and programs\nThe college delivers undergraduate and postgraduate courses in partnership with the Australian University of Theology.\nTrinity courses include chaplaincy pathways and Continuing Education for Ministry (CEM). Some courses are available through week-long intensives and online as well as face-to-face weekly classes.\nDegrees and programs\nThe College is accredited to offer the following undergraduate and postgraduate courses:\n* Undergraduate Certificate of Ministry\n* Undergraduate Certificate of Theology\n* Diploma of Ministry\n* Diploma of Theology\n* Bachelor of Ministry\n* Bachelor of Theology\n* Bachelor of Ministry (Honour)\n* Bachelor of Theology (Honour)\n* Graduate Certificate of Divinity\n* Graduate Diploma of Divinity\n* Master of Theological Studies\n* Master of Divinity\nLocation and facilities\nThe college is part of a larger campus that accommodates Raymont Residential College and the Queensland Synod office. College faculty and students and the Trinity Theological Library are located in the Uniting Church Centre adjacent to Drysllwyn.\nTrinity College Queensland is located within easy reach of the Auchenflower train station, and a short walk to buses, the Coronation Drive bike path and the Regatta ferry terminal.\nReferences"
    }
  ]
}