{
  "content": [
    {
      "type": "text",
      "text": "# Triumvirate (ancient Rome)\n\nIn the Roman Republic,  or  were commissions of three men appointed for specific tasks. There were many tasks that commissions could be established to conduct, such as administer justice, mint coins, support religious tasks, or found colonies.\nMost commonly, when historians refer to Roman \"triumvirs\", they mean two political alliances during the crisis of the Roman Republic. The informal First Triumvirate of Julius Caesar, Pompey the Great, and Marcus Licinius Crassus was a loose political alliance arranged in 60 or 59 BC that lasted until the death of Crassus in the Battle of Carrhae in 53 BC; they had no official capacity or function as actual triumviri, and the term is used as a nickname.\nThe Second Triumvirate or  of Octavian (later Augustus), Mark Antony, and Marcus Aemilius Lepidus was formed in 43 BC by passage of the lex Titia. Created for a five-year term and renewed for another five years, it officially lasted until the last day of 33&nbsp;BC or possibly into 27&nbsp;BC.\nTriumviri capitales\nThe triumviri capitales oversaw prisons and executions, along with other functions that, as Andrew Lintott notes, show them to have been \"a mixture of police superintendents and justices of the peace.\" The capitales were first established around 290 to 287 BC. They were supervised by the praetor urbanus. These triumviri, or the tresviri nocturni (so called because they were on the streets at night), may also have taken some responsibility for fire control.\nThey went the rounds by night to maintain order, and among other things they assisted the  in burning forbidden books. It is possible that they were entrusted by the praetor with the settlement of certain civil processes of a semi-criminal nature, in which private citizens acted as prosecutors. They also had to collect the  (deposits forfeited by the losing party in a suit) and examined the plea of exemption put forward by those who refused to act as jurymen. Their number were increased to four, but Augustus reverted it to three. In imperial times most of their functions passed into the hands of the .\nTriumviri monetalis\nThe  supervised the issuing of Roman coins. Their number was increased by Julius Caesar to four, but again reduced by Augustus. As they acted for the senate they only coined copper money under the empire, the gold and silver coinage being under the exclusive control of the emperor.\nTresviri epulones\n, a priestly body, assisted at public banquets. Their number was subsequently increased to seven, and by Caesar to ten, although they continued to be called , a name which was still in use at the end of the 4th century. They were first created in 196 BC to superintend the  feast on the Capitol, but their services were also requisitioned on the occasion of triumphs, imperial birthdays, the dedication of temples, games given by private individuals, and so forth, when entertainments were provided for the people, while the senate dined on the Capitol. Their number was later increased to seven (septemviri epulones).\nOther triumviri\nThree-man commissions were also appointed for purposes such as establishing colonies (triumviri coloniae deducendae) or distributing land. Triumviri mensarii served as public bankers; the full range of their financial functions in 216 BC, when the commission included two men of consular rank, has been the subject of debate.\nReferences"
    }
  ]
}