{
  "content": [
    {
      "type": "text",
      "text": "# Trójkąt warszawski\n\n| label        = Taco CorpAsfalt Records (re-release)\n| producer     = RumakAugustynBebun\n| prev_title   = Young Hems\n| prev_year    = 2013\n| next_title   = Umowa o dzieło\n| next_year    = 2015\n}}\nTrójkąt Warszawski is second EP by Polish rapper Taco Hemingway. It was self-released on 19 December 2014. The recordings were made available as a free digital download on the rapper's official website. The material was recorded between 2013 and 2014. The album represents a hip-hop style with influences from other genres. It is a concept album, depicting the story of a character who follows his ex-girlfriend and her new love, Peter.\nTrójkąt warszawski received excellent reviews from music critics. Reviewers praised it for the brilliant lyrics and well-chosen music production, interestingly told story and for introducing novelty to the Polish music market. The album became a commercial success after a while, recording high playbacks on streaming services and debuting at number three on the nationwide OLiS sales list. In 2018, the album was certified gold by ZPAV for selling over 15,000 copies. Years later, it was nominated for the 2020 Popkillery Awards, in the Album of the Decade category.\nBackground, production and release\nAfter the poor commercial reception of the previous album, Taco switched from rapping in English to Polish after being persuaded by his friends. Some of the songs were written before the previous minialbum was made, and some after it was finished. Trójkąt warszawski was recorded at a studio in Muranów. On 19 December 2014 the material was made available on the rapper's channel on the YouTube platform and on his own website. The main production of the album was handled by the rapper's friend Rumak, while some tracks were produced by Augustyn and Bebun. A day later the artist played his first concert Cafe Kulturalna in Warsaw. On 2 April 2015 the first physical release of the album was premiered, the rapper self-released 500 copies of the album.\nA few months after its release and after recording a single for his next album, titled 6 zer, the rapper began to gain popularity in the country. At that time, Taco Hemingway's recordings met the interest of Marcin \"Tytus\" Grabski - the owner of Asfalt Records, who signed a publishing contract with the rapper. On 19 August 2015 the music label Asfalt Records released a re-release of the recordings in an unlimited edition. The release included two CDs, while Łukasz Partyka is responsible for the graphic design.\nOn 26 January 2016, again thanks to Asfalt Records, the recordings were released on 12\" vinyl in a limited edition of 500 copies. Meanwhile, on 15 August that year, an unlimited run of vinyl records was launched. The rapper promoted the recordings on a concert tour following the release of his next minialbum, Umowa o dzieło, called Następna stacja Tour, visiting such cities as Warsaw, Sopot, Poznań and Kraków, during which he presented recordings from the album.\nTrack listing\nSample credits\n* The song \"Szlugi i kalafiory\" uses samples from the song \"Race With the Devil\" by The Gun and dialogues from the documentary \"Konsul\" i inni directed by Krzysztof Gradowski and the documentary film Paragraf zero directed by Wlodzimierz Borowik.\n* The song \"Marsz, marsz\" uses dialogues from the documentary film Na wsi zabawa directed by Natasza Ziolkowska-Kurczuk.\n* The song \"Trójkąt\" uses samples from the song \"Penty Harmonium\" by Aphex Twin and dialogues from the documentary \"Konsul\" i inni, directed by Krzysztof Gradowski.\n* The song \"(Przerywnik)\" uses dialogues from the documentary film Na wsi zabawa directed by Natasza Ziółkowska-Kurczuk.\n* The song \"900729\" uses samples from the song \"Spierdalaj\" performed by Sokół and Marysia Starosta.\nCharts\n{| class=\"wikitable plainrowheaders\"\n!Chart (2015)\n!Peakposition\n|-\n!scope=\"row\"|OLiS (Poland)\n|align=\"center\"|3\n|}\nCertifications\n{| class=\"wikitable\"\n!Certification\n!Number of copies\n!Date\n!\n|-\n|gold\n|15 000+\n|4 July 2018\n|\n|-\n|platinum\n|30 000+\n|25 August 2021\n|\n|}\nReferences"
    }
  ]
}