{
  "content": [
    {
      "type": "text",
      "text": "# Tropical Storm Warren (1984)\n\nSevere Tropical Storm Warren, known in the Philippines as Tropical Storm Reming, affected the Philippines during October 1984. An area of convection was first observed on October 17 in the Philippine Sea. After killing 17 while crossing the archipelago, the system developed into a tropical storm on October 23. Warren moved north and later north-northwest but late on October 24, the storm began to meander in the South China Sea. On October 26, Warren drifted west while attaining peak strength. Two days later, Warren turned back to the east-northeast and away from the Philippines. A weakened trend began on October 29 as the storm entertained cooler, drier air. Despite this, the storm's center of circulation remained well-defined until Warren moved ashore in Vietnam on November 1. Warren dissipated the next day.\nOffshore the Philippines, the vessel Venus sunk due to rough seas caused by the storm. As a result of the shipwreck, 29 people were killed. a total of 174 were rescued, including 96 people that were rescued via a fishing boat. Nearby, another cargo container ship, the Lorcon 8, sank but all 19 crewmen were rescued. Across the island chain, 73 people died, 25 due to landslides, while 18 others were injured. Greater than 10,000 people were directly affected by the typhoon. Moreover, 740 houses were destroyed, with an additional 891 damaged. Damage was estimated at $239,000 (1984 USD), with $59,000 from crops and $180,000 from infrastructure.\nMeteorological history\nThe precursor of Tropical Storm Warren was first noted on October 17 as a poorly organized area of convection over  northeast of Mindanao Island. Initially, synoptic data suggested that the storm's circulation was broad, ill-defined, and positioned over the monsoon trough. The disturbance began to encounter lower wind shear, prompting a small increase in organization. At 15:00 UTC on October 18, a Tropical Cyclone Formation Alert (TCFA) was issued. The alert was cancelled less than 24 hours later, however, in response to a decrease in the storm's convection, as well as, strong wind shear and its close proximity to land. Over the next few days, the system moved over the Philippines, disrupting its surface circulation. Moving west-southwest, the disturbance entered the South China Sea on October 22. Despite initially remaining poorly organized, conditions aloft became much more conducive for development that evening, and aided by the monsoonal flow, the system developed a well-defined surface circulation. At 00:00 UTC on October 23, both the Joint Typhoon Warning Center (JTWC) and the Japan Meteorological Agency (JMA) started tracking the system.|group=\"nb\"}} The aforementioned circulation was at first exposed from the deep convection, but by 03:00 UTC on October 23, the storm had rapidly become better organized. Following a further increase in the system's organization, a second TCFA was issued at 11:30 UTC. Based on a Dvorak estimate of T2.5, the JTWC upgrade the system into a tropical depression at 18:00 UTC, although post-season analysis from the agency suggests that the cyclone was a tropical storm by this time. Early on October 24, the JMA followed suit and upgraded Warren into a tropical storm.|group=\"nb\"}} Also around this time, the Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA) started tracking the storm and assigned it with the local name Reming.\nInitially, Tropical Storm Warren drifted north and then north-northwest. Later on October 24, the center once again became partially exposed from the deep convection. Thereafter, Warren began to move erratically. Early on October 25, the JMA classified Warren as a severe tropical storm. After performing a small cyclonic loop, Warren, still embedded in the monsoon trough, began to drift westward, while a mid-latitude cyclone was located to the cyclone's north. Later that day, Warren existed PAGASA's area of responsibility. At 06:00 UTC on October 26, the JTWC designated Warren a typhoon while increasing the intensity of Warren to , its maximum intensity. Meanwhile, the JMA estimates that Warren peaked in intensity, with winds of  and a minimum barometric pressure of , an intensity it would remain at for several days. Starting midday on October 26, Warren stalled out for the next 12 hours, only to drift east-northeast in response to the inflow to Typhoon Vanessa and a trough to its north. On October 28, after re-entering PASAGA's warning responsibility, Warren slowed and made a cyclonic turn back to the east-northeast as the trough moved to the east of Warren and a subtropical ridge became center to the north of the cyclone.\nBy October 29, Warren began to expand in size in response to a monsoonal surge of moisture into the South China Sea. This also caused the storm to inherit cooler, drier air, which prompted weakening while also recurving towards the northeast. At 00:00 UTC on October 29, the JTWC downgraded Warren into a tropical storm, though the JMA would not follow suit until 36 hours later. On August 30, the storm exited PASAGA's warning zone. Thunderstorm activity continued to decrease, and by October 31, the low-level center had become displaced to the convection and the upper-level center. At 06:00 UTC that day, the JTWC issued the final warning on the cyclone while it was still producing winds of . Despite this, the storm's center remained well-defined for an additional 24 hours. The remnants of the storm later crossed the coast of Vietnam, with winds of . Late on November 1, the circulation had become less defined and increasingly difficult to locate, and the JTWC estimated that Warren dissipated the next day. During the afternoon of November 2, the JMA ceased tracking Warren.\nImpact\nThe precursor disturbance to Warren drenched the nations in heavy rains that led to the deaths of 17. As a result of Warren's turn to the west on October 28, the storm posed a serious threat to the Philippines. All U.S. Navy and Air Force bases in the region were placed in \"Condition of Readiness I\" early that day. Although no major damage ultimately occurred on the naval bases, winds of  and  of rain were recorded at Clark Air Base. In the province of Bataan, 30 houses were destroyed, which led to 200 people without a home. A family of 13 died after their house was buried in a landslide in Aurora. Elsewhere, twelve other people died due landslides.\nOffshore Marinduque Island, strong waves generated by the storm sunk a  vessel, Venus, within three minutes. Officially, the ship consisted of 83 passengers and 42 crewmen when it left Laoang for Samar Island, even though the captain claimed that there were as many as 240 aboard. Later reports indicates that vessel had 200 passengers and 42 crewman on board. A total of 174 were rescued, including 96 people that were rescued via a fishing boat and many others that was rescued by fishermen. Twenty-nine people, including two children, drowned due to the incident. Nearby, a cargo container ship, the Lorcon 8, sank, but all 19 crewmen were rescued. Nationwide, 73 people perished, with 18 others hurt. A total of 10,815 people or 1,914 families were directly affected by the typhoon. Furthermore, 740 houses were destroyed, with an additional 891 damaged. Damage was estimated at $239,000, with $59,000 from crops and $180,000 from both public and private infrastructure.\nSee also\n* Typhoon Wayne (1986)\nNotes\nReferences"
    }
  ]
}