{
  "content": [
    {
      "type": "text",
      "text": "# Trowbridge (Cardiff electoral ward)\n\n| os_grid_reference           =\n| community_wales             = Trowbridge\n| post_town                   = CARDIFF\n| postcode_area               = CF\n| postcode_district           = CF3\n| dial_code                   = +44-29\n| constituency_westminster    = Cardiff East\n| unitary_wales               = Cardiff\n| constituency_welsh_assembly = Cardiff South and Penarth\n| CASCode                     =\n| councillors                 = 3\n| hide_services               = yes\n}}\nTrowbridge is an electoral ward in the east of Cardiff, capital city of Wales. It covers the working class residential community of Trowbridge, which also includes the modern suburb of St Mellons. Created in 1983, the ward has elected mainly Labour Party councillors to the local Cardiff authority.\nDescription\nThe Trowbridge ward is bordered to the west by the Rumney ward, to the east by the Newport ward of Tredegar Park and Marshfield, and to the south by the Bristol Channel. It includes the suburbs of Trowbridge and St Mellons, the Shirenewton caravan site and the hamlet of Newton.\nIt was created by The City of Cardiff (Electoral Arrangements) Order 1982 which came into effect from the May 1983 Cardiff City Council election.\nRepresentatives\nFrom 1983 the Trowbridge ward elected two councillors to Cardiff City Council and (since 1996) to the County Council of the City and County of Cardiff. Representation increased to three councillors from the 1999 Cardiff Council election. Since 1983 the ward has consistently elected Labour Party councillors, with strong majorities, though elected a Liberal Democrat councillor in 2008.\nThe future Home Secretary and First Minister of Wales, Alun Michael, spent his early political career as a councillor for Trowbridge.\nAt a by-election in September 2025, Trowbridge elected Cardiff's first Reform UK councillor, Edward Topham.\nElection results\n1983\no existing councillor, though because of boundary changes not for the same ward\n2022\n}}\n|percentage = 22.8\n|change     = -3.8\n}}\n= sitting councillor in this ward prior to election\n2025 by-election\nLabour councillor Chris Lay stood down on 7 August 2025 after getting promotion in his job and moving to Telford, Shropshire. A by election was called for 18 September 2025, which was won comfortably by Reform UK, pushing Labour into third place. The new councillor, Edward Topham, was employed as a security guard at the Senedd in Cardiff Bay. The Senedd had confirmed Topham could keep his job if he won the by-election.\n}}\nReferences"
    }
  ]
}