{
  "content": [
    {
      "type": "text",
      "text": "# True to Self (King Promise album)__disambig_1\n\n|genre =\n|label =\n|released =\n|artist = King Promise\n|producer =\n|prev_year = 2022\n|prev_title = 5 Star\n| misc =\n}}\nTrue to Self is the third studio album by Ghanaian singer-songwriter King Promise, released on 14 June 2024 through 5K Records Limited and Sony Music UK. The album includes features from Shallipopi, Fave, Gabzy, Fridayy, Lasmid, Ladipoe, Sarkodie, and OliveTheBoy. Throughout its 12 tracks, the album blends in a mixture of the music genres Highlife and Afrobeats.\nBackground\nTrue to Self follows King Promise's two previous studio albums, As Promised (2019) and 5 Star (2022), the first of which was his debut.\nRecording and production\nThe album is a fusion between the music genres Highlife and Afrobeats, and features artists such as Shallipopi, Fave, Gabzy, Fridayy, Lasmid, Ladipoe, Sarkodie, and OliveTheBoy. In an interview with Revolt, Promise described the tracks on the album ranges between \"uptempo, calm, love music, life music and hustle music.\"\nIn the same interview, King Promise goes insight on the overall theme of the album.\nTrue to Self's lyricism centers around Promise's journey to stardom, struggles, and his love life.\nRelease and critical reception\nSoon after the album's release, on 19 June 2024, Ghanaian music entrepreneur Smallgod brought True to Self's cover art for  ($38,040). The purchase took place at Country Club, Trasacco, Accra.\nPromotion\nIn celebration of the album's release, King Promise embarked on the True to Self world tour, which spanned 12 cities across North America, Europe, Asia, and Australia.\nAccolades\nThe album's lead single \"Terminator\" won Song Of The Year at the 2024 3Music Awards and Most Popular Song, along with Best Afropop Song at the 2024 Ghana Music Awards but was nominated for International Collaboration of The Year, along with the album's other single \"Perfect Combi\". King Promise also won Best Afrobeat/Afropop Artist at the 2024 Ghana Music Awards. At the 26th edition of the Ghana Music Awards, True to Self won Album of the Year.\nTrack listing\n|title11 = Own It\n|length11 = 2:42\n|extra11 = Niphkeys\n|title12 = Terminator\n|length12 = 3:54\n|extra12 = GuiltyBeatz\n}}\n|title2 = Set Me Free\n|length2 = 3:06\n|extra2 = Hylander\n|title3 = Keep It Sexy\n|length3 = 2:39\n|extra3 = KillBeatz\n|title4 = 2 Paranoid\n|length4 = 3:33\n|note4 = featuring Ronisia\n|extra4 = Telz\n}}\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for True to Self\n! scope=\"col\"| Chart (2025)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Nigerian Albums (TurnTable)\n| 57\n|}\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|+Release history and formats for True to Self\n! scope=\"col\"| Region\n! scope=\"col\"| Date\n! scope=\"col\"| Edition\n! scope=\"col\"| Format(s)\n! scope=\"col\"| Label\n|-\n! scope=\"row\" rowspan=\"2\"| Various\n| 14 June 2024\n| Standard\n| rowspan=\"2\" |\n| rowspan=\"2\" |\n|-\n|13 December 2024\n|deluxe\n|}\nReferences\nWork cited\n* }}\nExternal links\n*"
    }
  ]
}