{
  "content": [
    {
      "type": "text",
      "text": "# Truman High School (Independence, Missouri)\n\nTruman High School}}\n| staff       = 87.69\n| ratio       = 19.39\n| colors      =    Red, White, and Blue\n| free_label4 = Mascot\n| free_text4  = Patriot\n| location    = 3301 South Noland RoadIndependence, MO 64055\n| website     = http://sites.isdschools.org/truman\n}}\nTruman High School  is a public high school located in Independence, Missouri, serving students in grades 9-12. It is named after hometown resident U.S. President Harry S Truman and his family. The mascot of Truman is a patriot, and the school's colors are red, white, and blue. Truman students are competitive with students from surrounding areas, but mostly towards William Chrisman, their cross-town rivals.\nAthletics\nTruman is a member of the Missouri State High School Activities Association. As of the 2009-2010 school year, in athletic activities Truman is a Class 5 school in basketball (girls and boys), cross-country (girls and boys), track and field (girls and boys), and football. Truman is a Class 4 school in baseball, boys' golf, softball, volleyball, and wrestling. The school is a Class 4 school in soccer (girls and boys) and is a Class 111 school in tennis (girls and boys) and girls' golf.\nForensics and music\nTruman's debate and competitive drama department has been ranked among the top high schools in the National Speech and Debate Association. Truman is Class 1 for speech and debate, Class 5 for music activities, and Class 4 for Academic Team (aka Scholar Bowl which is what the school formally calls the activity). Truman High School's Patriot Marching Band is active from July through the end of October, performing at home football games as well as multiple marching competitions.  Starting in November, the band is then split into Symphonic and Concert bands. Placement for the bands are based on a students audition. Truman's orchestra is divided into the Concert and Symphonic classes. Freshmen begin in Concert and have the opportunity to audition to be in Symphonic the next year. Students not in Symphonic can stay in Concert.\nRobotics\nThe school district's FIRST Robotics Competition team, Team 1723 the FBI (First Bots of Independence), was founded in 2006. The student members from all three ISD high schools meet almost all year round at William Chrisman High school. The FBI is also active in the ISD community; many members from the team mentor ISD middle school and elementary school FIRST Lego League teams and host an annual FIRST Lego League tournament at George Caleb Bingham Middle School.\nNotable alumni\n*Rudy Bears, professional mixed martial arts fighter\n*Jim Blazquez, author\n*Dave Haas, Former MLB player Detroit Tigers\n*Arliss Howard, actor\n*Gregg Miller, inventor and author. IG Nobel Peace Prize for Medicine 2005\nReferences\nExternal links\n*[http://sites.isdschools.org/truman Truman High School]"
    }
  ]
}