{
  "content": [
    {
      "type": "text",
      "text": "# Tufail Shinwari\n\n| birth_place = Landi Kotal, Pakistan\n| height =\n| position = Attacking midfielder\n| currentclub = Karachi United\n| clubnumber = 24\n| youthyears1 = 2022–2023\n| youthclubs1 = Muslim Hands\n| youthyears2 =\n| years1 = 2024–\n| clubs1 = Karachi United\n| caps1 = 50\n| goals1 = 12\n| nationalyears1 = 2025–\n| nationalteam1 = Pakistan U23\n| nationalcaps1 =\n| nationalgoals1 =\n| nationalyears2 = 2025–\n| nationalteam2 = Pakistan\n| nationalcaps2 = 2\n| nationalgoals2 = 0\n| club-update =\n| nationalteam-update =\n}}\nTufail Khan Shinwari (born 10 May 2006) is a Pakistani footballer who plays as an attacking midfielder for Karachi United and the Pakistan national team.\nEarly and personal life\nShinwari was born in Landi Kotal, a town in Khyber Pakhtunkhwa, Pakistan. He started playing football in the streets. In 2022, he completed grade 12 on a scholarship from a private institution in Peshawar.\nClub career\nEarly career\nShinwari represented Pakistan in the Street Child World Cup in Qatar in 2022, after getting noticed by a charity organisation called Muslim Hands, during open trials in Nowshera. With three hat-tricks and 13 goals, he won the Golden Boot, and led the team to the final, which they lost to Egypt on penalties.\nIn 2023, he represented the Pakistan street child football team at the Norway Cup in Oslo, leading the team to the runner-ups place after losing to Sola FK in the final.\nKarachi United\nIn 2024, Shinwari signed his first club contract with Karachi United.\nInternational career\nIn September 2025, Shinwari represented Pakistan U23 at the 2026 AFC U-23 Asian Cup qualification. The next month, he made his senior international debut with Pakistan against Afghanistan at the 2027 AFC Asian Cup qualification ending in a goalless draw. He also started the away match against Afghanistan that was held in Kuwait.\nCareer statistics\nInternational\n{| class=\"wikitable\" style=\"text-align:center\"\n|+Appearances and goals by national team and year\n!National team\n!Year\n!Apps\n!Goals\n|-\n|Pakistan\n|2025\n|2\n|0\n|-\n! colspan=\"2\" |Total\n!2\n!0\n|}\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}