{
  "content": [
    {
      "type": "text",
      "text": "# Tufts OpenCourseWare\n\nThe Tufts OpenCourseWare (OCW) project, was a web-based publication of educational material from a number of Tufts University courses, providing open sharing of free, searchable, high-quality course content to educators, students, and self-learners throughout the global community.  The Tufts OCW initiative encouraged the publication and free exchange of course materials on the World Wide Web.  First launched in June 2005, Tufts OCW provided materials with strong representation from Tufts' health sciences schools, some of which were equivalent to textbooks in depth. All materials on the Tufts OCW site were accessible and free of charge.  As Tufts OCW is not a distance learning program, no registration, applications, prerequisites, or fees are required and no credit is granted. Tufts ended funding for its Open Courseware initiative in 2014, and content on the Tufts OCW web site was removed on June 30, 2018.\nHistory\nOpenCourseWare was launched by the Massachusetts Institute of Technology (MIT) in 1999 as an initiative with the goals of providing free, searchable access to MIT's course material for the general public and expanding the reach of the OCW concept.  In 2004, Tufts was invited to join MIT in its OpenCourseWare initiative. Tufts' expertise in the health sciences and international policy complemented MIT's strengths in engineering and science, and Tufts' track record of creating an extensive body of digital materials and tools to support health sciences education made Tufts a ready partner.\nTufts OCW launched in June 2005 as a University-wide initiative, with six courses from three of its four health sciences schools. Tufts' partnership with MIT and other early participants in the OCW movement has evolved into the OpenCourseWare Consortium (OCWC), an organization with more than 200 member universities and associated institutions from around the world dedicated to advancing education and empowering learners through OCW.\nTufts ended funding for its Open Courseware initiative in 2014, and content on the Tufts OCW web site was removed on June 30, 2018; however, Tufts continued to partner with MIT to provide content via MIT OpenCourseWare.\nOER\nTufts OCW could be considered within the broader context of the open educational resources (OER) movement.  OER can include open content, tools, or infrastructure. Tufts has been engaging in OER work for more than a decade, with the majority of efforts related to the development of the Tufts University Sciences Knowledgebase (TUSK).  TUSK is an integrated digital repository and curriculum knowledge management and delivery system used by Tufts' health sciences schools and programs, and health sciences institutions in India, Tanzania, Uganda, Kenya, and the United States.  TUSK's use of the National Library of Medicine's Unified Medical Language System (UMLS) as the controlled vocabulary for its content management (metadata, searching, etc.) enables the creation and delivery of integrated, developmental curricula by individuals or teams of faculty across the health sciences.\nIn 2002, UNESCO organized the Forum on the Impact of Open Courseware for Higher Education in Developing Countries, which was attended by representatives of universities from both developed and developing countries. At this conference, the term open education resource was more clearly defined as \"the open provision of educational resources, enabled by information and communication technologies, for consultation, use, and adaptation by a community of users for non-commercial purposes\".\nIn addition to TUSK, a number of other Tufts OER initiatives can be accessed from the Tufts OCW site including:\n* The Child & Family WebGuide – describes trustworthy websites on topics of interest to parents and professionals.\n* The Perseus Digital Library – provides content and tools to enhance the study of the classics, including ancient Greek and Latin literature, history, art, and archeology.\n* Selected Patient Information Resources in Asian Languages (SPIRAL) – funded by the National Library of Medicine to promote patient education, particularly for the underserved, provides health information in Chinese, Cambodian/Khmer, Hmong, Japanese, Korean, Laotian, Thai and Vietnamese.\n* Tufts Digital Library – digital resources produced and developed at Tufts University for teaching and research; built on Fedora, an Open Source digital repository architecture.\n* Visual Understanding Environment (VUE) – an information management application that provides an interactive, concept mapping interface to digital resources accessed via the Web, from Fedora-based digital repositories, FTP servers, or local file systems.\nCreative Commons Licensing\nTufts OCW is licensed under the terms of the Creative Commons (CC) license, which protects the copyright holder's works while encouraging certain uses of the works.  Tufts OCW has chosen the following CC license options: Attribution-NonCommercial-ShareAlike.  Most content published on the Tufts OCW site is licensed under the Creative Commons license which allows reuse and the creation of derivative works as long as the terms of the CC license are met.\nTufts Schools represented through OCW\n* Tufts School of Dental Medicine\n* Tufts School of Medicine\n* Friedman School of Nutrition Science and Policy\n* The Fletcher School\n* Cummings School of Veterinary Medicine\n* School of Arts & Sciences\nSee also\n* Open educational resources\n* Selected Patient Information Resources in Asian Languages, educational web resource maintained by Tufts University\nNotes and references\nExternal links\n* The site has been \"retired\" in 2014: \"Tufts ended funding for its Open Courseware initiative in 2014. As a result, we retired the Tufts OCW web site on June 30, 2018\"."
    }
  ]
}