{
  "content": [
    {
      "type": "text",
      "text": "# Tug of war (astronomy)\n\nThe tug of war in astronomy is the ratio of planetary and solar attractions on a natural satellite. The term was coined by Isaac Asimov in The Magazine of Fantasy and Science Fiction in 1963.\nLaw of universal gravitation\nAccording to Isaac Newton's law of universal gravitation\n: F= G\\cdot \\frac{m_1 \\cdot m_2} {d^2}\nIn this equation\n:F is the force of attraction\n:G is the gravitational constant\n:m1 and m2 are the masses of two bodies\n:d is the distance between the two bodies\nThe two main attraction forces on a satellite are the attraction of the Sun and the satellite's primary (the planet the satellite orbits). Therefore, the two forces are\n: F_p= \\frac{G \\cdot m \\cdot M_p} {d_p^2}\n: F_s= \\frac{G \\cdot m \\cdot M_s} {d_s^2}\nwhere the subscripts p and s represent the primary and the Sun respectively, and m is the mass of the satellite.\nThe ratio of the two is\n: \\frac{F_p}{F_s} = \\frac{M_p \\cdot d_s^2}{M_s \\cdot d_p^2}\nExample\nCallisto is a satellite of Jupiter. The parameters in the equation are\n*Callisto–Jupiter distance (dp) is 1.883 · 106 km.\n*Mass of Jupiter (Mp) is 1.9 · 1027 kg\n*Jupiter–Sun distance (i.e. mean distance of Callisto from the Sun, ds) is 778.3 · 106 km.\n*The solar mass (Ms) is 1.989 · 1030 kg\n: \\frac{F_p}{F_s} = \\frac{1.9 \\cdot 10^{27} \\cdot (778.3)^2}{1.989 \\cdot 10^{30} \\cdot(1.883)^2} \\approx 163\nThe ratio 163 shows that the solar attraction is much weaker than the planetary attraction.\nThe table of planets\nAsimov lists tug-of-war ratio for 32 satellites (then known in 1963) of the Solar System. The list below shows one example from each planet.\n{| class=\"sortable wikitable\"\n!Primary\n!Satellite\n!Tug-of-war ratio\n|-\n|Neptune||Triton||8400\n|-\n|Uranus||Titania||1750\n|-\n|Saturn||Titan||380\n|-\n|Jupiter||Ganymede||490\n|-\n|Mars||Phobos||195\n|-\n|Earth||Moon||0.46\n|}\nThe special case of the Moon\nUnlike other satellites of the Solar System, the solar attraction on the Moon is more than that of its primary. According to Asimov, the Moon is a planet moving around the Sun in careful step with the Earth.\nReferences"
    }
  ]
}