{
  "content": [
    {
      "type": "text",
      "text": "# Tule River War\n\n*\n|combatant2=Yokuts\n|commander1= Foster DeMasters W. G. Poindexter LaRhett Livingston\n|commander2= unknown\n|strength1= 300–400\n|strength2= >700\n|casualties1= Some wounded\n|casualties2= >100 killed\n}}\nThe Tule River War of 1856 was a conflict where American settlers, and later, California State Militia, and a detachment of the U. S. Army from Fort Miller, fought a six-week war against the Yokuts in the southern San Joaquin Valley.\nPrelude\nThe Native Americans living in the foothills of the Sierra Nevada mountains were relatively undisturbed by early Spanish colonization. During the late 1840s and into the 1850s, once gold was discovered in California, American miners began encroaching on Indigenous lands. In late 1850, a trader named James Woods settled on the south bank of the Kaweah River along with a party of approximately 15 men. According to a contemporary account, the Native Americans killed the entire party of settlers in the spring of 1851. The Kaweah people imposed a ten-day deadline for the settlers to vacate their lands. After the settlers missed the deadline, the locals attacks the non-Native settlers and skinned Woods.&nbsp; Other accounts come from American survivors who state Woods was the lone victim, although the various accounts all agree Woods was skinned.\nAlthough the United States drafted a treaty with the local tribes in 1851 (one of 18 such treaties signed state-wide, setting aside 7.5 percent of California's land area), defining a proposed reservation and 200 head of cattle per year, the US Senate failed to ratify any of the eighteen treaties in a secret vote cast on July 8, 1852, with every member either abstaining or voting no. The result of the vote was not made public until 1905.\nIn the fall of 1851, the Wingfield brothers settled and claimed the land near the cabin built by Woods. The Wingfields did not initially experience any trouble with the Native population. On April 20, 1852, Mariposa County was subdivided, creating Tulare County, with the temporary county seat to be near the Woods cabin. Creating a new county brought new government positions, and during the preparation for elections to be held in July 1852, the Wingfield brothers were taken captive by Native Americans. They were later released when an armed expedition under Major James Savage approached the encampment.\nIn 1851, William Campbell and John Poole set up a ferry across the Kings River on land reserved for the Choinumni in one of the un-ratified 1851 treaties. The nearby Choinumni village in the Kings River Reservation was raided in July 1852 by the newly elected Judge Walter Harvey. After the skirmish, Judge Harvey shot and killed Major James Savage.\nThroughout the 1850s, settler-led militias would attack Native American villages, justifying their actions as retaliation for raids of cattle and horses. Although the Native Americans did steal horses and cattle, they were often motivated by subsistence, as their normal means of living were often cut off by settlers, and these raids generally did not threaten settler lives. In contrast, the militias would often indiscriminately slaughter Native people.\nIn 1853, some of the Yokuts-speaking population were relocated to the Sebastian Indian Reservation by California's first Superintendent of Indian Affairs, Ned Beale. Beale's vision was similar to the Spanish Missions, and he intended the Sebastian Reservation to be self-sustaining. Since the Sebastian Reservation was not located close to traditional Yokuts territories, though, the majority of the Yokuts population stayed in the newly-formed Tulare County.\nIn August 1855, citizens of Visalia petitioned Beale's successor, Superintendent Thomas Henley to prevent starvation amongst the Native populace. The settlers reasoned that potential raids could be averted by establishing an agency to ensure Native welfare. Henley's plan was similar to Beale's: establish self-sufficient reservations. In preparation, Henley delegated scouts to identify suitable locations in the Tule Lake region.\nFighting\nIn the spring of 1856, a rumor that 500 cattle had been stolen by Native Americans began to circulate. Upon further investigation, a single yearling calf had been taken and slaughtered as a bridal gift during the wedding feast. In addition, Orson Smith's sawmill burned, and the fire was attributed to Native American marauders. Armed militias were organized to counter the perceived menace, and commenced raiding Native camps and killing their inhabitants.\nIn Visalia, some citizens took in a village of Native Americans upon overhearing a militia plan to ambush the village at night.\nOne militia, under the leadership of Captain Foster DeMasters, ventured up the north fork of the Tule River, where they encountered a well-sited Native encampment. According to historical reports, the encampment had fortifications which consisted of a two- to four-foot high breastworks composed of boulders and brush, and the terrain made it difficult for an attacker to flank. In the initial attack, the militia under DeMasters failed to dislodge the numerically superior Native force. DeMasters' militia was wearing makeshift body armor consisting of cotton-padded jackets, which proved ineffective against arrows.&nbsp;\nIn pursuit of the presumed cattle raiders, a small detachment under the command of John Williams had earlier separated from the main force of DeMasters' militia, and encountered a small party of Native Americans. After attacking and driving off the party at daybreak, Williams' group returned to DeMasters, and it was decided to send for reinforcements. During the ride to Keyesville, Williams encountered what he thought was a bear, which he promptly shot. Later, when riding back with the Keyesville reinforcements, it was discovered that Williams had shot a large black mule owned by a local settler.\nThe combined force, including reinforcements from Keyesville, now under the leadership of Sheriff W.G. Poindexter, were also unable to dislodge the Native encampment. After falling back, the militia then proceeded to move, by force, the Native Americans which had been previously protected by other settlers. In addition, the militias conducted a scorched-earth campaign by destroying Native American supply caches.\nNews of these engagements spread throughout California, exaggerating the degree of menace and misrepresenting its causes. Finally, in May 1856, army soldiers and others under the combined command of Lt LaRhett Livingston were able to drive off the defenders. It had been decided the night before to divide the combined forces into four divisions to envelop and simultaneously assault the encampment at daybreak. However, during the preliminary scouting, Livingston was in the process of selecting the most advantageous ground for a howitzer he had brought along when he came under attack. Livingston then ordered a charge and drove off the encampment's defenders.  The natives were pursued for a few days into the mountains but could not be found before the Livingston's force was compelled to return to the valley.\nThis was the last engagement in the war.  After several more weeks of raids on cattle herds and settler houses, the Indian sub-Agent William Campbell, sought out the natives in the mountains and found they were willing to make peace.  About 100 of the native people had died in the war. The Tule River War lasted approximately six weeks.\nAftermath\nIn retrospect, George Stewart wrote \"Thus ended the Tule river war of 1856; a war that might have been prevented had there been an honest desire on the part of the white settlers to do so, and one that brought little glory to those who participated therein. The responsibility cannot now be fixed where it properly belongs. Possibly the Indians were to blame. Certainly the whites were not blameless, and it is too seldom, indeed, that they have been in the many struggles with the aboriginal inhabitants of this continent.\"\nHistorian Annie Mitchell later wrote in the Tulare County Historical Society bulletin (Los Tulares No. 68, March 1966): \"Over the years it has been assumed that the Tule River War was a spontaneous, comic opera affair. It was not and if the Indians had been armed with guns instead of bows and a few pistols they would have run the white men out of the valley.\"\nReferences\nNotes\nBibliography\n*"
    }
  ]
}