{
  "content": [
    {
      "type": "text",
      "text": "# Tumbuka–Ngoni war\n\nThe Tumbuka–Ngoni war refers to a series of conflicts in the mid-19th century between the Tumbuka people and the Ngoni, a group of Nguni refugees from South Africa. The war was part of a broader pattern of Ngoni expansion and conquest across southeastern Africa during the Mfecane (also known as the Difaqane), a period of widespread chaos and displacement caused by the rise of the Zulu Kingdom under Shaka Zulu.\nThe Ngoni tribe that were on war with the Tumbuka was a rebellious section of the tribe led by Zwangendaba who ran away from the harsh reign of Shaka Zulu. This Ngoni segment travelled up to Tanzania through Malawi causing chaos as well as raiding kingdoms along their way.\nThe Ngoni reign on the tribes they conquered was cruel, inhumane and oppressive. As a result, these oppressed groups including the Tumbuka rebelled against the Ngoni in 1979.  The rebellion took place at Hora Mountain where a group of Tumbuka warriors climbed on top of the hill and rolled down big stones towards the Ngonis who had surrounded the mountain.\nBackground\nThe Tumbuka people are an ethnic group native to Malawi, Zambia and Tanzania. The Tumbuka had been living in the three countries  for more than 500 years before the Ngoni intrusion. The Tumbuka established centralized chiefdoms, such as the Chikulamayembe dynasty, which governed the area before the arrival of the Ngoni. The Ngoni, led by Zwangendaba, began their northward migration from South Africa in the early 19th century, reaching the Tumbuka territories around 1855.\nCourse of the conflict\nThe Ngoni employed advanced military tactics and organization, which tricked the Tumbuka, who were less militarized. The Tumbuka were subjected to raids, forced migrations, and cultural assimilation. Many Tumbuka villages were destroyed, most men killed, and the survivors were integrated into the Ngoni social and political structures. The period led to cultural changes, with the Tumbuka adopting Ngoni customs and governance systems.\nAftermath\nFollowing the Ngoni conquest, the Tumbuka people experienced a loss of autonomy and cultural identity. However, with the advent of British colonial rule in the late 19th century, the Tumbuka began to reassert their traditional leadership and cultural practices. In 1907, the British reinstated the Chikulamayembe dynasty as part of their colonial administration, marking a revival of Tumbuka authority in the region. The colonial government choose Chitumbuka language as a medium of instruction.\nLegacy\nWhile the Ngoni influence led to the changes in Tumbuka society, the resilience of the Tumbuka people ensured the survival and eventual resurgence of their cultural identity. Today, the Tumbuka people continue to celebrate their heritage through festivals and cultural practices.\nSee also\n* Tumbuka people\n* Chikulamayembe dynasty\nReferences"
    }
  ]
}