{
  "content": [
    {
      "type": "text",
      "text": "# Tungus Republic\n\nThe Provisional Tungus Central National Government (PT-CNG; ; ), more commonly known as the Tungus Republic (; ; ) was a short-lived unrecognized secessionist state covering mostly Okhotsk region and the eastern regions of the Yakut ASSR from July 1924 to May 1925.\nBackground\nIn April 1922, the Okhotsk region was separated from the Yakut ASSR and was transferred to the Primorsky and Kamchatka krai. As a result, while a new military-political line was pursued in Yakutia under the conditions of the New Economic Policy, on the Okhotsk coast the local party-Soviet leadership and organs of the OGPU continued to pursue a policy of terror against the population of the “war communism” era. Chekists swept away Tungus yurts with artillery fire, where women, children, and old men were hiding; machine-gun fire drowned bark boats with peaceful hunters and fishermen. The native populations were set exorbitant \"taxes\" for almost everything: for feather, weapons, firewood, dogs, peeled bark of trees, etc. It came to the point that they began to take the old debts established by the White Guards in 1919–1923. The representatives of the Soviet government did not know the Tungus customs and culture. There were no national schools, there was native representative in the composition of the co-institution, the prosecutor's office, and there weren't enough translators for the Soviet representatives.\nFormation\nOn May 10, 1924, the rebels under the leadership of Mikhail Artemyev occupied the town of Nelkan. Captured Soviet workers A.V. Yakulovsky, F.F.Popov, Koryakin were released into the wild. On June 6, the rebels numbering 60 people under the leadership of the Tungus P. Karamzin and the Yakut MK Artemyev seized the port of Ayan after an 18-hour battle. During the battle, the head of the OGPU, Suvorov and three Red Army soldiers were killed, and the surrendered garrison was liberated by the Tungus and sent to Yakutia.\nIn Nelkan, Artemyev convened a congress of the Ajano-Nelkan, Okhotsk-Ayan, Maymakan Tunguses and Yakuts in June. The congress elected the Provisional Central Tungus National Government, which decided to secede from Soviet Russia and form an independent state. Artemyev was elected chief of staff of the armed detachments, and the leader of all detachments was the Tungus P. Karamzin.\nOn July 14, 1924, Tungus independence was declared at Ayan at the \"All-Tungus Congress of the Okhotsk coast and the surroundings\", for the Tungus people and the inviolability of its territory, sea, forest, mountain riches and resources. The leaders of the movement of different nationalities : Artemyev, P. Karamzin, S. Kanin, I. Koshelev, G. Y. Fedorov and others, a total of 10 people, made up an appeal to the world community. It dealt with the fact that backward “in all respects from the world progress of science and technology” the Tungus Republic appealed to foreign states and the League of Nations, “as powerful defenders of small nationalities on a global scale” on the issue of saving them from the “common enemy of the world nationalism - Russian communism ”. Such a statement of the problem by the leadership of the movement indicates a fairly mature level of political self-awareness and socio-political views. The movement also adopted a tricolor as the flag of the Tungus Republic. The white color of the flag symbolized the Siberian snow, green symbolizes wood and taiga, and black symbolizes the ground. The song “Sargılardaah sahalarbıt” was also adopted as the national anthem.\nDissolution\nIn May 1925, in the course of the peace negotiations between M.K. Artemyev and I.Y.Strod, R.F. Kulakovsky, both sides managed to find a meeting point.\nArtemyev was convinced that the leader of the Yakut ASSR did not carried out the policy of terror, a national revival is being carried out in the republic, and the question of the accession of the Tungus region to the Yakut ASSR is at the discussion stage. As a result of successful negotiations on May 9, a peace agreement was concluded and the detachment of M.K. Artemyev unanimously decided to lay down arms. On July 18, the detachment led by P. Karamzin in the Medvejya area, located 50&nbsp;km from Okhotsk, joined the peace surrender. In total, 484 rebels from the Artemyev detachment and 35 rebels of Karamzin detachment laid down arms. Out of the 484 rebels in the Artemyev detachment, there were 315 Yakuts, 85 Tunguses, 46 Russians, 3 Tatars, 2 Poles, one Kamchadal, one Korean and 14 persons of unknown nationality.\nSee also\n*Yakut revolt (1918)\n*Yakut revolt (1921–23)\n*Flag of the Sakha Republic\n*Ural Republic (1993), adopted a similar tricolor flag\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}