{
  "content": [
    {
      "type": "text",
      "text": "# Turbak's invasion of Assam\n\n** Kachari Kingdom\n| combatant2        = Bengal Sultanate\n| commander1        =  Suhungmung Suklen Kan-Seng l Mula Gabharu Senglung  Frasengmung TonkhamBorgohain rasengmung Gogogi Borgohain\n| commander2        = TurbakHussain Khan\n| strength1         = Large700 ships\n| strength2         = Large1,100 cavalry1,000 infantry36 elephants\n| casualties1       = 4000 men\n170 boats\n| casualties2       = 2,500 men20 ships28 elephants850 horses\n| image             = Brahmapoutre.png\n| image_size        =\n| caption           = Path of the Brahmaputra River\n}}\nThe '''Turbak's invasion of Assam''', one of many  Turko-Afghan invasions of Assam, was a sustained military engagement between Turbak Khan, a Turko-Afghan commander from Bengal Sultanate and the Ahom kingdom. After some initial success Turbak was eventually killed in battle by the Ahom forces, and his army was routed pursued to the Karatoya River.\nThe Ahoms pursued the retreating forces up to the point where the Karatoya River meets the Brahmaputra River. This victory was crucial for the Ahoms, and the ruler of Gauda had to yield, surrendering land and even arranging marriage alliances. Visva Singha, a Koch ruler, was also acknowledged as a subordinate leader under Ahom rule and was expected to send regular tribute to the Ahoms.\nAccording to historians, Turbak's invasion introduced firearms in Assam, but there are Ahom records that mention firearms even before that, when they conquered the Chutiyas. The Ahoms also constructed a road from Gauhati to the Karatoya River during this campaign and formed alliances with other kingdoms, including Vikram Sen of Orissa. King Suhungmung erected a bold stone pillar inscribed with a caution and constructed a tank at Puri after getting permission from the Orissa ruler, reportedly as an intimidation to the rulers of Bengal.\nBackground\nThe first important Muhammadan invasion which is recorded in the Ahom history is that of 1527 when the great Vazir led the invasion. The Ahoms gave chase, with great tenacity, to the invaders, seized forty horses, and many more cannons. Suhungmung then went to Sala and captured Duimunisila, erected a fort at the mouth of the Burai River, and established troops at Phultiari. More expeditions were made up the Kallang and Bharali rivers. Slaves and other spoils were captured in these. A strong guard was left behind at Narayanpur to secure the area.\nAfter the resolution of the Kachari struggles, Muhammadan hostilities again turned against the Ahoms. The first Muhammadan counterattack came in the form of a Muslim commander, Luipat (or Luput), who marched up the Brahmaputra with fifty vessels. The outcome of the battle at Temeni was the victory of the Ahoms, forcing the Muslim commander to flee on horseback. After this victory, the Ahoms rebuilt their forts at Kangaripara and Sala on the river Bharali.\nSubsequently, garrisons were posted at Sala, Singiri, and on the Bharali. Singiri, under the command of Barpatra Gohain. The Muhammadans resumed their march up the Brahmaputra, and another encounter took place at Temeni. Kangaripara, under the command of Senglung Barpatrugohain, was subsequently invaded by a fresh Muslim general, Bit Malik (also known as Mit Manik). The Ahoms again defeated the Muslims, and their general was slain in action.\nThe Ahoms captured fifty horses, besides many cannons and guns. The pursuit of the retreating enemy went up to Khagarijan, the present Nowgong. Suhungmung rewarded the Ahom soldiers for their service after the battle. By early 1532, a new fort had been built at Temeni under the supervision of Senglung. Suhungmung eventually rewarded Barpatra Gohain with a beautiful girl and with an elegant trophy and a ceremonial tribute known as the Rikkhvan Ceremony.\nInvasion\nBattle of Singri\nIn 1532, a Bengali Muslim commander named Turbak invaded Ahom territory with 1,000 cavalry, 30 elephants, and plenty of guns and cannons. He set up his camp near the fort at Singiri. He set up camp near the fort at Singiri. Suklen, Ahom forces crossed Brahmaputra, and then, against warnings by the astrologers, they attacked the Muslim camp, and the result of the battle proved disastrous to the Ahoms: eight of its commanders including Frasengmung were killed. Suklen narrowly escaped with a grievous wound. The Muslims held back the advance for the rainy season at Koilabar.\nFurther preparations\nThe Ahoms withdrew to Sala, where they rallied with fresh troops and elected Senglung as the new commander-in-chief. The Muslim forces continued their march and camped at Kaliabar. Understanding that the previous defeat was because of their weak naval power, King Suhungmung ordered the preparation of a more powerful navy. By June, the Ahoms had prepared 700 ships, and the Kachari army joined them to strengthen their position.\nThe participation of Ahom women is also notable. Mula Gabharu was a key leader in the Assamese resistance to the invasion of Assam by Turbak, in 1532. She is referred to by historians as a symbol of sacrifice and courage in the resistance against the invading forces. Mula Gabharu was married to Phrasengmung Borgohain, an Ahom army commander and nobleman. She lost a loved one when her husband was killed in battle. Upon hearing the news of his death, she decided to lead the enemy soldiers into battle despite the danger, putting the dignity of the Ahom kingdom above her life.\nBattle of Duimunisila\nIn October, the Muslims moved forward to Ghiladhari, and by November, Suklenmung had recovered from his wounds and led the Ahom forces at Sala. The Muslim forces launched an attack and set fire to houses outside the fort, but were surprised and routed in a counterattack by the Ahoms.\nThough the Muslims continued their cautious advance in the following months, the tide of the conflict turned in March 1533, when they were attacked again but this time they successfully defended the fort by pouring boiling water over the enemy.\nDespite this, the Muslims succeeded in gaining some ground in the subsequent encounters. However, by March 1533, the Ahoms were able to reverse the tide in their favor. In a naval battle at Duimunsilla, they inflicted heavy losses on the Muslim forces, The Muslim commanders, Taju and Sangal, were killed, The invading forces lost 2,500 men, 20 ships, and several large cannons, marking a turning point in the war in favor of the Ahoms.\nBattle of Bharali\nHusain Khan, another Muslim general, arrived to reinforce Turbak's forces with six elephants, 100 cavalry, and 1,000 infantry troops. Reinforced by Hussain Khan, Turbak took position near the Dikrai River, across from the Ahom camp. However, the Ahoms were now better prepared and managed to defeat the Muslims in several engagements. Mula Gabharu showed immense courage on the battlefield, killing several enemy soldiers. She was, however, later struck by a bullet from Turbak, killing her instantly. The five women who accompanied her to the battlefield also died. The women's sacrifice galvanized the Ahom forces, which fought with renewed passion.\nThe final confrontation occurred near the Bharali River, Eventually, the Ahom general Kan-Seng Barpatra Gohain managed to drive Turbak out, where Turbak was killed by a spear, presenting his severed head to the Ahom king. The Muslims were thrown into disarray. The Ahoms pursued the retreating forces to the river Karatoya, at which they won a complete victory.\nAhom forces managed to capture rich spoils of war in the form of 28 elephants, 850 horses, many cannons, and matchlocks. An envoy was then sent by the Ahom king to the sultan of Gauda, who, in submission, sent a princess to the Ahom court. Hussain Khan was captured and executed. To celebrate the victory, they constructed a temple and dug a tank next to the Karatoya River. According to local custom, they buried heads of Turbak and Hussain Khan at Charaideo Hill.\nOutcome\nWith the victory of these battles, Ahoms now start to implement firearm and artillery for their battle use. The guns and ammunition start to make there, they acquire the cannons production and powder formulation, that perhaps with Muslim captured prisoners help in this phase of development. During time they improve their technology on firearms, they will face most of their serious battles; some of which includes the celebrated invasion by Mir Jumla in the 1660s.\nIt was a battle that had military significance, as well as one of strategic value. The Ahoms proved able to defend their land against such a mighty power. It not only solidified their position but also brought greater relations with powers neighboring them and their relations to the Koch rulers. After this, the Ahoms began to expand their territory and consolidate power within Assam, learning from the battle against Turbak to strengthen their defenses.\nAftermath\nDuring the campaign, Ahom forces constructed a road connecting Gauhati to the Karatoya River. King Suhungmung also forged alliances, sending messages to Vikram Sen, the King of Orissa, and establishing friendly ties. With the permission of the king of Orissa, Suhungmung excavated a tank at Puri, probably to bolster his position against the Muslim rulers of Bengal. The Ahoms erected a stone pillar with an audacious warning inscribed:\n}}\nInterestingly, Muslim records do not mention these events, leading to debates. Gait thought the invasions were by local Muslim chiefs or freelancers, not the Bengal Sultan. But the recent studies tend to conclude that big military resources involved, like cannons, suggest otherwise. According to Acharya the aggressor was the Bengal Sultan, and their defeats were deliberately left out by Muslim chroniclers.\nSuhungmung captured Namdang from the Chutiyas and established a town there. He later shifted his capital to Bakata, near the Dihing River. He transplanted many Ahoms from Garhgaon, such as 300 Gharphaliya families with their chiefs, to Sadiya and the Dihing region. Skilled artisans like blacksmiths, Brahmins, and artisans were brought to the capital.\nAfter defeating the forces of Turbak, prisoners Muhammadans were settled in different areas. Initially, they were given some jobs such as cultivating or cutting elephant grasses. Since they were not good at the same, they changed their job to working in brass. Their descendants still continue doing this trade, called as Morias.\nThe major loss in his reign came through a cattle epidemic in 1534, while the Jovian cycle was replaced by the Hindu Saka era. His reign witnessed Vaishnavism spreading as a result of the teachings by Sankar Deva. The success, however, proved a cause of betrayal for Suhungmung when Suklen conspired with a Kachari servant named Ratiman who assassinated the king when he was sleeping.\nSuhungmung was a bold and effective ruler. Within his regime, the Ahoms annexed lands by beating back the Chutiyas, breaking Kachari power, and repulsing Muslim incursions and conquering Naga raiders. In 1535, several Naga villages, including Malan and Pangkha, rebelled and soon included the Jakhang Nagas. Suhungmung dispatched his generals, who successfully crushed the uprising. The Khamjangia Nagas surrendered, presenting 100 methons}} to him as a token of their surrender, and peace returned to the region.\nLegacy\nThe practice of gunnery in Assam is typically attributed to Turbak's invasion in the year 1532, but Assamese histories trace their existence dating back to the Ahom conquest of the Chutiyas. This would place the establishment of gunnery in Assam some many years before Turbak. The Koches and the Ahoms, formally, came into mutual contact around the year 1533 when Koch chieftain Visva Singha submitted to the Ahom forces, vowing to pay annual tribute.\nAccording to legend, Mula Gabharu caused the death of her husband, as she was unable to prepare a Kabas Kapor (amulet cloth) in time due to her menstrual cycle—a ritual considered necessary for gaining protection while in battle. Seeking revenge, she rallied a group of five other women from the Ahom kingdom to accompany her to the battle. Their presence and courage are said to have energized the Ahom soldiers, giving them a new motivation to fight the invaders.\nMula Gabharu's legacy remains a source of inspiration for Assamese, particularly as a symbol of patriotism, sacrifice, and resilience. Historians debate the exact timeline of these events with some sources pointing to Phrasengmung being killed during the fifth Muslim invasion in 1527, and Turbak's invasion in 1532. Irrespective of the exact timeline, Mula Gabharu remains a revered figure in Assam's history.\nA contrasting view, however, is presented by historian Amanatulla Ahmed, who suggests that the Ahom army launched a sudden attack on Koch territory, forcing Visva Singha to capitulate. One Ahom chronicle records that Visva Singha initially planned to intercept the returning Ahom army from Gauda. However, his advisors, anticipating the devastating consequences of a confrontation with the superior Ahom forces, dissuaded him. Ultimately, Visva Singha succumbed peacefully and henceforth sealed a relationship between the Koches and the Ahoms.\nWestward expansion of the Ahoms would be another viable factor during the early 16th century, despite the fact that their dominions were not in direct communication. Following submission by Visva Singha, after consultation with King Suhungmung (1497–1539), Ahom general Chao-sheng-lung Tan-Khan recognized the alliance. In this treaty, the Gauda ruler, who was defeated by the Ahoms, presented the Ahoms with two princesses and five parganas on the west side of the Sankosh River as dowry. This maintained an alliance between the Koches and the Ahoms.\nSee also\n*Ahom–Mughal wars\n*Turco-Afghan\n*Suklenmung\n*Battle of Bharali\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}