{
  "content": [
    {
      "type": "text",
      "text": "# Turtlecreek Township, Warren County, Ohio\n\nTurtle Creek Township}}\n|population_density_km2   = 78.9\n|population_density_sq_mi = 204.3\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 255\n|elevation_ft             = 837\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 39-77868\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1087120\n|website                  =\n|footnotes                =\n}}\nTurtlecreek Township is one of the eleven townships of Warren County, Ohio, United States.  It is in the central part of the county and surrounds the county seat of Lebanon.  Turtlecreek is the largest township in the county, originally containing sixty-three whole and seven fractional sections.  The population was 17,644 as of the 2020 census.\nGeography\nLocated in the central and western parts of the county, it borders the following townships:\n*Clearcreek Township - north\n*Wayne Township - northeast\n*Washington Township - east, across the Little Miami River\n*Salem Township - southeast\n*Union Township - south\n*Deerfield Township - southwest\n*Lemon Township, Butler County - west, north of Liberty Township\n*Liberty Township, Butler County - west, south of Liberty Township\n*Franklin Township - northwest\nThe city of Lebanon withdrew from the township in the 1960s and formed a paper township.  Portions of the township have also been lost to annexations by the cities of Monroe, Middletown, and Mason.  Those areas within Monroe, however, remain in the township.\nMost of the township was in the Symmes Purchase, but the two northernmost rows of sections were not, though they are surveyed in the same manner as the Purchase.\nThe township is named for the Turtle Creek, a stream named for Indian chief Little Turtle.  It is the only Turtlecreek Township statewide, although there is a Turtle Creek Township in Shelby County.\nHistory\nTurtlecreek Township was established by the Warren County Commissioners on August 15, 1804.\nGovernment\nThe township is governed by a three-member board of trustees, who are elected in November of odd-numbered years to a four-year term beginning on the following January 1.  Two are elected in the year after the presidential election and one is elected in the year before it.  There is also an elected township fiscal officer, who serves a four-year term beginning on April 1 of the year after the election, which is held in November of the year before the presidential election.  Vacancies in the fiscal officership or on the board of trustees are filled by the remaining trustees.\nThere are two large state prisons located in the western part of the township:  Lebanon Correctional Institution and Warren Correctional Institution.\nPublic services\nBoth Interstate 75 and Interstate 71 cross the township, as do U.S. Route 42 and State Routes 48, 63, 123, 350, and 741.  The Lebanon-Warren County Airport is located in Turtlecreek Township on Greentree Road between Lebanon and Greentree Corners.\nMost of the township is in the Lebanon City School District but a portion of the north center is in the Springboro Community City School District.  The portion within the city of Monroe was detached circa 2002 and placed in the new Monroe Local School District.  A part in the northwest is in the Middletown City School District, a part in the southwest is in the Mason City School District, and a part in the southeast is in the Little Miami School District.\nMost of Turtlecreek Township is served by the Lebanon (45036) and Oregonia (45054) post offices, but parts are served by Middletown (45044), Monroe (45050), Mason (45040), and Franklin (45005).  Most of the township is in the Lebanon telephone exchange but parts are within the Mason, Franklin, Morrow, Monroe, and Middletown exchanges.\nReferences\nExternal links\n*\n*[http://www.co.warren.oh.us County website]"
    }
  ]
}