{
  "content": [
    {
      "type": "text",
      "text": "# Tuskegee Confederate Monument\n\n-->\n| completion_date    =\n| catalogue          =\n| medium             = granite\n| movement           =\n| subject            =\n| height_metric      =\n| width_metric       =\n| length_metric      =\n| diameter_metric    =\n| height_imperial    =\n| width_imperial     =\n| length_imperial    =\n| diameter_imperial  =\n| dimensions         =\n| dimensions_ref     =\n| metric_unit        = cm\n| imperial_unit      = in\n| weight             =\n| designation        =\n| condition          =\n| museum             =\n| city               = Tuskegee, Alabama, U.S.\n| coordinates        =\n| mapframe           = yes\n| mapframe-zoom      = 13\n| owner              =\n| accession          =\n| preceded_by        =\n| followed_by        =\n| module             =\n| website            =\n}}\nThe Tuskegee Confederate Monument, also known as the Macon County Confederate Memorial and Tuskegee Confederate Memorial, is an outdoor Confederate memorial in Tuskegee, Alabama, in the United States. It was erected in 1906 by the United Daughters of the Confederacy to commemorate the Confederate soldiers from Macon County, Alabama. The monument is in Tuskegee Square in front of the Macon County Courthouse.\nControversy\nThe monument is located on land given in 1906 by the county government to the United Daughters of the Confederacy, with the stipulation that it was for the use of whites only. , the town square is still owned by UDC, although the city of Tuskegee maintains it as a public space.\nWhen the monument was erected in 1906, the county population was 82% African-American. Per the 2010 United States census, the city of Tuskegee is 97% African-American.\nIn 1966, after an all-white jury acquitted the admitted killer of Civil Rights worker Samuel Younge Jr., there was an unsuccessful attempt to tear the monument down; it was defaced with \"Black Power\" and a yellow stripe down its back. It was vandalized with spray paint in 2015 and on October 11, 2017; after the latest incident the United Daughters of the Confederacy, its owner, decided not to clean it, \"out of fear it would only be repeated\". In 2015, Mayor Johnny Ford sought to relocate the Confederate statue to the Tuskegee cemetery. According to Dyann Robinson, president of the Tuskegee Historic Preservation Commission, \"it would probably take a bomb to get it down\".\nIn June 2020, the statue was again vandalized with graffiti. The city covered the base with tarpaulins, and was looking into a way to legally have the statue removed and relocated.\nDescription\nOn the front, the monument reads:\nIt has Confederate flags on both the right and left sides. The rear contains an unidentified shield, the words \"Honor the Brave\", and in the same size as on the front, \"C.S.A.\"\nThe monument is in Tuskegee Square, in front of the Macon County Courthouse, between North and South Main Streets, West Northside Street/East Rosa Parks Avenue, and Martin Luther King Highway. The square and monument are contributing resources to the Main Street Historic District.\nSee also\n* List of Confederate monuments and memorials\nReferences\nExternal links\n* [https://www.loc.gov/item/2010640065/ Confederate statue in the town square of Tuskegee, Alabama] Library of Congress"
    }
  ]
}