{
  "content": [
    {
      "type": "text",
      "text": "# Twentieth Indian Expedition to Antarctica\n\n}}\nThe 20 Indian Antarctic Expedition was flagged off on-board M.V. Magdalena Oldenorff from Cape Town on 30 December 2000. The team comprising a total of 51 members was led by Shri Mervin J. D’Souza from Geological Survey of India. The 20th IAE team consisted of 51 members including 34 scientists from various scientific Organizations/Universities/Departments and 17 logistic members. After successful completion of all logistics and scientific tasks the 20th IAE team returned to India in March 2002.\nObjectives\n*Measurement of the ice thickness to decipher the sub-ice stratigraphy by ground probe radar profiling.\n*Systematic coring of the lake bottom sediments for reconstruction of the past vegetative history.\n*Study of the influence or aerosol forcing on the atmospheric radiation budget and climate over Antarctica.\n*Micro plankton distribution and their energy pattern in fresh water lake ecosystem\nScientific Achievements\nAtmospheric Sciences and Meteorology\n*A 3-station triangulation experiment and simultaneous magnetic recording (digital and/or analog) were carried out with a view to understanding the dynamics of the auroral current systems.\n*Atmospheric electrical parameters near the Kamat Hut at Maitri were measured to study the global electric circuit. A maximum of 2000 UT observed confirms the traditional view that the thunderstorms are the main drivers of the global circuit. Effects of local meteorological conditions on the measured electrical parameters and the magnetospheric contributions to the ionospheric potential and the global circuit were investigated in detail.\nClimatological and Meteorological studies\n*Continuous observation on the weather pattern, atmospheric pressure, surface ozone and global solar radiation was made at Maitri.\n*Four ozone sonde ascents were taken during summer season. All the ascents reached more than 30&nbsp;km height.\n*Measurement of atmospheric turbidity was done using Sun Photometer with filters of 500&nbsp;nm & 560&nbsp;nm.\nVLF Propagation Studies\n*VLF propagation data were recorded by digital audio recorder PCM-R300 continuously.\n*Whistler and related events were detected manually from the recorded data.\nEarth Sciences and Glaciology\n*Geological mapping and glaciological studies carried out by Geological Survey of India, in the Muhlig-Hoffmannfjell area revealed very coarse-grained porphyritic granite and charnockite. A nunatak east of Muhlig-Hoffmannfjell depicts a classical inter-relationship between charnockite and granite; but no textural difference between these two types of rocks was observed.\n*Glaciomorphological studies in Schirmacher Oasis have helped in defining the important glaciomorphological features on map, which include deglaciated areas, U valley, glacial terraces, etc. An interesting feature recorded north of Novo station showed a rounded pebble bed suggesting the influence of considerable fluvial action in its deposition.\nPlanetary Geomdetic Studies\nThe data were generated on surface geometry and surface height ranges as well as surface motion. The computation of the data would be useful for assessing the changes in bedrock elevation. The GPS data obtained from the GPS station established at Maitri served as a fundamental marker to International Scientific Committee on Antarctic Research (SCAR) GPS campaign for 2001.\nTele Seismic Studies\n*The seismic station equipped with high-resolution digital seismograph and an analog seismic recorder was upgraded with the installation of additional Broad Band Seismic System with Gurlap CMG-3ESP sensor and Digital acquisition system RT 121 from Reftek.\n*The data in January 2001 Bhuj earthquake recorded at Maitri seismic station were analysed and sent to NGRI. Using SEISAN software, preliminary analysis of both the digital and analog records was carried out. Archiving of the DAT tapes as well as CDs for further analysis of the events was also completed.\nCrack Propagation Studies\n*Collection of Albedo values and other parameters near Veteiah hill and Dakshin Gangotri station was completed. Also, at these locations Automatic Weather Stations with sensors recording wind speed and wind direction, relative humidity and ambient temperature and atmospheric pressure, were made operational along with Albedometer and snow depth sensors.\n*The snow grain identification studies indicated predominantly sugary grains at Veteiah, Shivling and Russian Aerodrome site.\n*Crack propagation study of the crack in India Bay was initiated. GPS reading for the crack was taken for long-term monitoring.\nGround Probe radar Survey\nThe Ground Penetrating Radar Survey carried out near the Veteiah nunatak (Latitude:70° 47.75′ S; Longitude:11° 41.73′ E) indicated an ice thickness of 5–7&nbsp;metres, which gradually increased to 100&nbsp;metre at 400&nbsp;metre along the survey profile from the Veteiah nunatak (due south).\nHydrographic Survey\nAt three locations, current direction and speed, water temperature, salinity and velocity of sound were observed using Smart Acoustic Current Meter. Ice shelf delineation was undertaken using the Helicopter. Meteorological data were collected that could be used in developing a database and correlating it with other data.\nGlobal Change\nFor Palyno-stratigraphic studies, air samples were collected using Burkard Volumetric Sampler (UK) on the voyage starting from 40° South latitude to Indian Research Station Maitri, Schirmacher Oasis, East Antarctica. Thirty-five moss cushions, 15 dry soil samples, 5 dry algal mats and 10 glacial dust samples were collected from different dry lake sites and along the margin of polar ice cap, valleys and Nunataks, in a transect at an interval of 200–500&nbsp;m in and around Schirmacher Oasis. Water samples from six different glacial lakes, three fresh snow samples and three blue ice samples were collected for palynological as well chemical analysis.\nAerosol optical depth at five wavelengths, columnar ozone concentration and surface level size segregated mass concentration of aerosols were carried out. Average mass concentration found was 7 μg/m^3 of which particles of radius greater than 1 μm contributed 63% of mass. Dominance of large size of particles was confirmed in spectral AOD values.\nBiological Sciences and Environmental Conservation\nEcology of 16 selected lakes of Schirmacher oasis was studied by collecting water and plankton samples.\nHuman Biology and Medicine\nStudies on leptin neuropeptide status in human beings was conducted in three phases viz., Phase I at Goa, Phase II immediately after reaching Antarctica and Phase III after one month of stay in Antarctica. Blood, urine and food samples were collected, apart from anthropometric and body fat measurements. Tests for taste sensitivity and perception were also carried out during the expedition.\nWind energy utilization in Antarctica\n*A portable windmill, and a small windmill were also installed and commissioned on a Mobile lab and near the Maitri Workshop, respectively for testing the design capabilities suitable for Antarctic conditions.\n*A prototype vertical axis Windmill was successfully installed and commissioned near the Nandadevi hut for testing the performance of the machine and machine sub-assembly components in Antarctic conditions.\nReferences\n#Prologue to the 20th Indian Antarctic Expedition by Mervin J. D'Souza (Team Leader). [http://dspace.ncaor.org:8080/dspace/bitstream/123456789/807/1/Technical+Publication+No.+18,+pp+1-36.pdf]\n#XX Indian Antarctic Expedition by Ministry of Earth Sciences, Government of India. [http://www.dod.nic.in/20IAE.pdf]"
    }
  ]
}