{
  "content": [
    {
      "type": "text",
      "text": "# Tyler Run-Queens Gate, Pennsylvania\n\n|postal_code_type         = ZIP codes\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               =\n|blank1_name              = GNIS feature ID\n|blank1_info              =\n|website                  =\n|footnotes                =\n}}\nTyler Run-Queens Gate was a census-designated place (CDP) in York County, Pennsylvania, United States. The population was 2,926 at the 2000 census. The area was redelineated as two separate CDPs, Tyler Run and Queens Gate, for the 2010 census.\nGeography\nTyler Run-Queens Gate was located at  (39.934049, -76.696590).\nAccording to the United States Census Bureau, the CDP had a total area of , all land.\nDemographics\nAs of the census of 2000, there were 2,926 people, 1,435 households, and 730 families residing in the CDP. The population density was . There were 1,547 housing units at an average density of . The racial makeup of the CDP was 93.92% White, 3.01% African American, 0.10% Native American, 1.71% Asian, 0.07% Pacific Islander, 0.62% from other races, and 0.58% from two or more races. Hispanic or Latino of any race were 1.30% of the population.\nThere were 1,435 households, out of which 17.6% had children under the age of 18 living with them, 43.2% were married couples living together, 6.1% had a female householder with no husband present, and 49.1% were non-families. 42.2% of all households were made up of individuals, and 22.0% had someone living alone who was 65 years of age or older. The average household size was 1.95 and the average family size was 2.67.\nIn the CDP, the population was spread out, with 15.4% under the age of 18, 9.6% from 18 to 24, 24.6% from 25 to 44, 21.6% from 45 to 64, and 28.7% who were 65 years of age or older. The median age was 45 years. For every 100 females, there were 82.2 males. For every 100 females age 18 and over, there were 79.9 males.\nThe median income for a household in the CDP was $38,523, and the median income for a family was $48,974. Males had a median income of $34,286 versus $27,722 for females. The per capita income for the CDP was $25,589. About 5.0% of families and 7.6% of the population were below the poverty line, including 3.1% of those under age 18 and 11.1% of those age 65 or over.\nReferences"
    }
  ]
}