{
  "content": [
    {
      "type": "text",
      "text": "# Tyler Ward\n\n| birth_name      = Tyler Ray Ward\n| origin          = Aurora, Colorado, U.S.\n| instrument      =\n| genre           = Acoustic rock, country pop\n| occupation      = Musician\n| years_active    = 2007–present\n| spouse          =\n| label           = Tyler Ward Studios, Sony Music\n| website         =\n}}\nTyler Ray Ward (born March 12, 1984) is an American independent singer, songwriter, and producer. On his YouTube channel, he has over 2 million subscribers with 5+ billion views. Ward also has a strong social media following on sites like Facebook, Twitter, Instagram, and Spotify.\nPersonal life\nBefore Ward had interest in music, his focus was on athletics. After graduating from high school, he enrolled at the United States Air Force Academy Preparatory School, where he studied and played football. Ward left the Air Force Academy after his first semester and transferred to University of Northern Colorado as a scholarship collegiate football athlete.\nOn December 10, 2024, Ward's wife, Emmy Russell, revealed that she was expecting her first child, a girl. The couple's daughter was born on January 31, 2025.\nMusical career\nWard has become a well-known artist in part through his use of social media, posting a mix of covers and originals on YouTube. He has successfully completed five worldwide headlining tours and has played shows with many mainstream artists including Switchfoot, the Beach Boys, Aloe Blacc, the Jonas Brothers, the Fray, Yung Joc, and many more. Through his music video career, Ward has performed and produced most of his early songs and many of the current ones in his parents' basement, which he later turned into a proper recording space. Nowadays, Ward produces most of his music on the road or in his Los Angeles recording studio.\nWard was number five on Billboard's Top 100 Uncharted List and was also ranked on Billboard's Social 50 Chart for several weeks.\nIn 2011, Ward performed a duet with the Band Perry, celebrating the Academy of Country Music Awards, and went on a tour with Boyce Avenue. Later that year, he performed with Christina Grimmie live on The Ellen DeGeneres Show. Their performance aired nationwide on October 10, 2011.\nOn September 25, 2012, Ward released an EP titled Hello. Love. Heartbreak. on iTunes. In early January 2013, the artist confirmed that he had signed with Sony Music Germany.\nIn June 2013, Jason Derulo joined Ward by singing the acoustic version of \"The Other Side\".\nIn October 2013, Warner Music Group retained seven YouTube stars, including Ward, Kina Grannis, and Peter Hollens, to help promote a new single by Hunter Hayes and Jason Mraz. Ward and the others independently recorded versions of the song, \"Everybody's Got Somebody But Me\"; these were subsequently mashed up into a video posted exclusively on YouTube. This was the first such venture by Warner, whose senior vice-president for interactive marketing said optimistically that \"[f]or some kids, people like Kurt Schneider and Tyler Ward are people that they trust.\"\nWard released his debut album on October 18, 2013, titled Honestly. It included twelve original songs that featured up-and-coming artists including Alex G. and Lindsey Stirling. Ward completed his fifth headlining tour in the winter of 2015 in Europe and North America.\nIn December 2015, he was picked as Elvis Duran's Artist of the Month and was featured on NBC's Today show hosted by Kathy Lee Gifford and Hoda Kotb and broadcast nationally, where he performed live his single \"Yellow Boxes\".\nIn 2016, after the tragic death of Christina Grimmie, Tyler released a music video named \"A song for Christina Grimmie\", dedicated to her and their friendship.\nBetween 2017 and 2018, Ward released ten original singles. His song \"What It's Like to Be Lonely\" was well received by critics and fans.\nDiscography\nAlbums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|+ List of studio albums, with selected chart positions\n|-\n! scope=\"col\" style=\"width:16em;\" | Title\n! scope=\"col\" | Details\n|-\n!scope=\"row\"|Honestly\n|\n* Released: October 18, 2013\n* Label: Tyler Ward Studios, Sony Music\n* Formats: CD, digital download\n|}\nEPs\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|+ List of EPs, with selected chart positions\n|-\n! scope=\"col\" style=\"width:16em;\" | Title\n! scope=\"col\" |Details\n|-\n!scope=\"row\"|Yellow Boxes\n|\n* Released: October 1, 2015\n* Label: Tyler Ward Studios, Sony Music\n* Formats: CD, digital download\n|}\nSingles\n{| class=\"wikitable plainrowheaders\" style=text-align:center;\n|+ List of singles, with selected chart positions\n|-\n! scope=\"col\" style=\"width:16em;\" | Title\n! scope=\"col\" | Year\n! scope=\"col\" style=\"width:14em;\"| Album\n|-\n! scope=\"row\"| \"The Way We Are\"\n| rowspan=\"1\" style=\"text-align:center;\"|2012\n| rowspan=\"7\" style=\"text-align:center\" |Honestly\n|-\n! scope=\"row\"| \"Falling\"(featuring Alex G)\"Official German Release\n| rowspan=\"3\" style=\"text-align:center;\"|2013\n|-\n! scope=\"row\"| \"Forever Starts Tonight\"\n|-\n! scope=\"row\"| \"Some Kind of Beautiful\"(featuring Lindsey Stirling)\n|-\n! scope=\"row\"| \"Beginning of a Bad Idea\"\n| rowspan=\"3\" style=\"text-align:center;\"|2014\n|-\n! scope=\"row\"| \"Hoopty Hoop\"\n|-\n! scope=\"row\"| \"SOS\"\n|-\n! scope=\"row\"| \"What It's Like to Be Lonely\"\n| style=\"text-align:center;\"|2017\n| style=\"text-align:center\" |Non-album single\n|-\n|}\nReferences\nExternal links\n*"
    }
  ]
}