{
  "content": [
    {
      "type": "text",
      "text": "# Tyndale Monument\n\nat the base\n| height        =\n| weight        =\n| visitors_num  =\n| visitors_year =\n| begin         =\n| complete      = 1866\n| dedicated     =\n| open          = 6 November 1866\n| restore       =\n| dismantled    =\n| dedicated_to  = William Tyndale\n| map_name      =\n| map_text      =\n| map_width     =\n| map_relief    =\n| coordinates   =\n| website       =\n| extra_label   =\n| extra         =\n}}\nThe Tyndale Monument is a tower built on a hill at North Nibley, Gloucestershire, England. It was built in honour of William Tyndale, an early translator of the New Testament into English, who was born nearby. It is a Grade II* listed building.\nThe tower was constructed in 1866 and is 111&nbsp;ft (34 m) tall. It is possible to enter and climb up a spiral staircase composed of 121 steps to the top of the tower. The hill it is on allows a wide range of views, especially looking down to the River Severn. A nearby topograph points to some other landmarks visible. The hill on which the monument stands is quite steep. The path follows a rough fairly steep bridleway which is part of the Cotswold Way. The tower itself is surrounded by fencing and has floodlights that light up the tower at night. The stairway has automatic lighting. The Cotswold Way long-distance footpath passes the foot of the monument, and then descends the hill into North Nibley.\nThe door to the tower is open most of the time for free access to a staircase which takes you to the top. Locally, it is commonly called Nibley Monument rather than its official name. The hill is called Nibley Knoll or Nibley Knob.\nThere is a commemorative plaque on the front of the tower. The text engraved on it reads:\nWilliam Tyndale.\n:ERECTED A.D. 1866\n:IN GRATEFUL REMEMBRANCE OF\n:WILLIAM TYNDALE\n:TRANSLATOR OF THE ENGLISH BIBLE\n:WHO FIRST CAUSED THE NEW TESTAMENT\n:TO BE PRINTED IN THE MOTHER TONGUE\n:OF HIS COUNTRYMEN\n:BORN NEAR THIS SPOT HE SUFFERED\n:MARTYRDOM AT VILVORDEN IN\n:FLANDERS ON OCT 6 1536\nThe monument is a landmark that can be seen even in places as far as Bristol, which is over 20 miles away. In the town of Thornbury there is a street called Tyndale View where the tower can be seen from approximately 10 miles away.\nFurther down the Cotswold Edge, at Hawkesbury, is the Somerset Monument, erected in 1846, and the design of the Tyndale tower has features in common with this.\nIn October 2019 protesters from Extinction Rebellion used the monument to display a protest banner.\nReferences\nExternal links\n*[https://tyndalemonument.uk/donate/ Official website]\n*[http://www.northnibley.org.uk/monument.php North Nibley website]\n*[http://www.tyndale.org/TSJ/18/monument.html Illustrated London News, November 17th 1866 - Monument opening announcement]"
    }
  ]
}