{
  "content": [
    {
      "type": "text",
      "text": "# Tyne Valley, Prince Edward Island\n\n|subdivision_type = Country\n|subdivision_name = Canada\n|subdivision_type1 = Province\n|subdivision_name1 = Prince Edward Island\n|subdivision_type2 = County\n|subdivision_name2 = Prince County\n|subdivision_type3 = Parish\n|subdivision_name3 =\n|subdivision_type4 = Lot\n|subdivision_name4 =  13\n|government_footnotes =\n|government_type =\n|leader_title = Chairperson\n|leader_name =\n|leader_title1 = Councillors\n|leader_name1 =\n|leader_title2 = CAO\n|leader_name2 =\n|established_title =\n|established_date =\n|established_title2 =\n|established_date2 =\n|established_title3 =\n|established_date3 =\n|area_magnitude =\n|unit_pref =\n|area_footnotes =\n|area_total_km2 =\n|area_land_km2 =\n|area_water_km2 =\n|area_total_sq_mi =\n|area_land_sq_mi =\n|area_water_sq_mi =\n|area_water_percent =\n|area_urban_km2 =\n|area_urban_sq_mi =\n|area_metro_km2 =\n|area_metro_sq_mi =\n|population_as_of =\n|population_footnotes =\n|population_note =\n|population_total =\n|population_density_km2 =\n|population_density_sq_mi =\n|population_metro =\n|population_density_metro_km2 =\n|population_density_metro_sq_mi =\n|population_urban =\n|population_density_urban_km2 =\n|population_density_urban_sq_mi =\n|population_blank1_title =\n|population_blank1 =\n|population_density_blank1_km2 =\n|population_density_blank1_sq_mi =\n|timezone = AST\n|utc_offset =\n|timezone_DST = ADT\n|utc_offset_DST =\n|elevation_footnotes =\n|elevation_m =\n|elevation_ft =\n|postal_code_type = Canadian postal code\n|postal_code =\n|area_code = 902\n|blank_name = Telephone Exchange\n|blank_info =\n|blank1_name            = NTS Map\n|blank1_info            =\n|blank2_name            = GNBC Code\n|blank2_info            =\n|website =\n|footnotes =\n}}\nTyne Valley is a rural municipality in Prince Edward Island, Canada. It is located in Prince County. Incorporated in 1966, the community is located in the township of Lot 13 at the intersection of Routes 12 and 167.\nHistory\nIn 1765, the Tyne Valley area was known as “The Landing”, as lumber floated up the Trout River from the shipyards at Bideford and Port Hill. The community was named Tyne Valley in 1868, after the River Tyne in England. At that time, the community's economy was bustling, with a blacksmith, cheese factory, tannery, tailor, carriage shop, plasterer, shoemaker, grist mills, and saw mills. This geographic area's shipbuilding history is commemorated in nearby Green Park Provincial Park, in which is found the homestead of the Yeo family. This, in addition to a local theatre group and an annual folk music festival contribute to keeping Tyne Valley's cultural life rich and vital.\nThe 831 telephone exchange is reputed to be the last in Canada to change to rotary style telephones from the traditional operator assisted dialing systems.\nDemographics\n}}}}\nIn the 2021 Census of Population conducted by Statistics Canada, Tyne Valley had a population of  living in  of its  total private dwellings, a change of |249|1}} from its 2016 population of . With a land area of , it had a population density of  in 2021.\nEconomy\nAgriculture is an important economic activity in and around Tyne Valley. The area has approximately 1.8% of the total number of farms in PEI and represents approximately 1.6% of the total provincial area. Total gross farm receipts in the area were about 1.7% of the provincial total. Municipal Tax Rates for Tyne Valley in 1998 are $0.45 per $100 of assessment for commercial properties and $0.35 for non-commercial properties. The annual sewer rates are $60.00.\nNotable people\nSome famous Islanders hailing from, or who have hailed from, the community include 'Dambuster' F/O Vincent Sanford MacCausland, former Premier Keith Milligan, former Dean of McGill Law, Percy Ellwood Corbett, Member of Parliament Joseph McGuire, Island visual artist Charlene Williams, historic shipbuilder James Yeo, and deceased folk artist Larry Gorman.\nNotable buildings\nOne of the island's oldest Masonic lodges exists in the area outside the community known as Port Hill. It is called Alexandra #5, in honour of Queen Alexandra of the United Kingdom.\nThere are two churches in Tyne Valley, United and Presbyterian. Adjacent Ellerslie has an Anglican church. The local fire station is referred to by the locals as The Pig and Whistle (or simply The Pig), after the television show of the same name. The sign currently depicts a comical pig wearing a fireman's uniform. The same building houses a bowling alley and other recreation facilities.\nHigh school students in the area attend Westisle Composite High School along with all other communities in West Prince.\nReferences"
    }
  ]
}