{
  "content": [
    {
      "type": "text",
      "text": "# Tywardreath and Par\n\n|official_name=            Tywardreath and Par\n|cornish_name=\n| population = 3,247\n| population_ref = (Parish, 2021)\n|civil_parish=             Tywardreath and Par\n|unitary_england=          Cornwall\n|lieutenancy_england =     Cornwall\n|region=                   South West England\n|constituency_westminster= St Austell and Newquay\n|post_town=                PAR\n|postcode_district =       PL24\n|postcode_area=            PL\n|dial_code=                01726\n|os_grid_reference=        SX0854\n}}\nTywardreath and Par is a civil parish in Cornwall, England, United Kingdom. The parish takes its name from its principal villages, Tywardreath and the china clay port of Par. At the 2021 census the population of the parish was 3,247.\nGeography\nThe A390, a primary route, crosses the northern boundary of the parish at a point 200 metres north of Higher Caruggatt.\nThe Cornish Main Line Railway enters the parish, from the east, at a point 50 metres north-east of Little Treverran, and exits the parish as it crosses the Par River, approximately 750 metres south of Par Station.\nThe population of the parish was 3,247 at the 2021 census. The population had been 3,161 in 2001, and 3,192 in 2011.\nGovernance\nThere are two tiers of local government covering Tywardreath and Par, at parish and unitary authority level: Tywardreath and Par Parish Council and Cornwall Council. The parish council generally meets at the Methodist Church on Well Street in Tywardreath.\nAdministrative history\nTywardreath was an ancient parish in the Powder Hundred of Cornwall. In 1934 the parish was absorbed into the St Austell Urban District. Tywardreath continued to exist as a civil parish until 1968, but as an urban parish after 1934 it was ineligible for a parish council; St Austell Urban District Council was the lowest tier of local government. St Austell Urban District was replaced in 1968 by the larger borough of St Austell with Fowey, which was in turn abolished six years later in 1974 to become part of the larger borough of Restormel. A new civil parish of Tywardreath was created in 1983. The parish was renamed from Tywardreath to Tywardreath and Par in 2000.\nRestormel was abolished in 2009. Cornwall County Council then took on district-level functions, making it a unitary authority, and was renamed Cornwall Council.\nSee also\n*:Category:People from Tywardreath and Par\nReferences\nExternal links\n* [http://www.tywardreathandparparishcouncil.gov.uk Parish Council website]"
    }
  ]
}