{
  "content": [
    {
      "type": "text",
      "text": "# U-boat War Badge__disambig_1\n\nThe U-boat War Badge () was a German war badge that was awarded to U-boat crew members during World War I and World War II.\nHistory\nThe U-boat War Badge was originally instituted during the First World War on February 1, 1918. It was awarded to recognize U-boat crews who had completed three war patrols. The badge was worn on the lower left side of the uniform and was oval shaped resembling a wreath of laurel leaves. A submarine lay across the center and the German State Crown (Reichskrone) was inlaid at the top center of the wreath.\nOn October 13, 1939, the U-boat War Badge was reinstituted. It was very similar to the original badge with the exception of the imperial crown being replaced with a German Eagle above a swastika, and a more modernized submarine now facing towards the left was used. The new version was first made of bronze metal, with later ones made of zinc with a \"gold wash\".\nClasses\nThe award was bestowed in two classes:\nU-Boat War Badge\nin gold.]]\nThere were several ways to be awarded this medal. The most common would be the completion of two or more war patrols. Although the completion of two war patrols might seem a lowly requirement, but a typical U-boat war cruise would often run into months at a time. Completing two war patrols could be equally dangerous as the U-boat has to endure constant attacks by Allied aircraft and warships. The other occasion when this badge was awarded was having been wounded during a patrol or killed in action.\nU-boat War Badge with Diamonds\nThe U-boat War Badge with Diamonds was instituted by Großadmiral Karl Dönitz after he had received from Grand Admiral Erich Raeder a special solid gold version of the U-boat War Badge in which the wreath as well as the swastika were inlaid with diamonds.\nThe badge was a special issue award given to U-boat commanders who had received the Knight's Cross of the Iron Cross with Oak Leaves. This version was made of gold plate over silver. Manufactured by the firms Schwerin u. Sohn and Gebr. Godet & Co. It was the same as the basic pattern but with nine small diamonds inlaid in the swastika. This award was more of a personal award by Dönitz. Approximately 30 were awarded, including the original one to Admiral Dönitz.\nRecipients of the U-boat War badge with Diamonds\n* Albrecht Brandi\n* Heinrich Bleichrodt\n* Otto von Bülow\n* Karl Dönitz\n* Carl Emmermann\n* Engelbert Endrass\n* Friedrich Guggenberger\n* Robert Gysae\n* Reinhard Hardegen\n* Werner Hartmann\n* Werner Henke\n* Otto Kretschmer\n* Hans-Günther Lange\n* Georg Lassen\n* Heinrich Lehmann-Willenbrock\n* Heinrich Liebe\n* Wolfgang Lüth\n* Johann Mohr\n* Rolf Mützelburg\n* Karl-Friedrich Merten\n* Gunther Prien\n* Joachim Schepke\n* Adalbert Schnee\n* Klaus Scholtz\n* Viktor Schütze\n* Herbert Schultze\n* Reinhard Suhren\n* Rolf Thomsen\n* Erich Topp\nNotes\nReferences\n*\n*"
    }
  ]
}