{
  "content": [
    {
      "type": "text",
      "text": "# U. Diane Buckingham\n\n}}\n| birth_place =\n| death_date =\n| death_place =\n| death_cause =\n| nationality =\n| citizenship =\n| education =\n| occupation =\n| years_active =\n| known_for = Psychiatric care for African Americans and multicultural children\n| relations =\n| website =\n| profession = Child and Adolescent Psychiatry\n| field =\n| work_institutions =\n| specialism =\n| research_field =\n| prizes =\n| child =\n| module2 =\n| signature =\n}}\nUlisa Diane Buckingham (born 1955) is an African-American psychiatrist known for her development of culturally sensitive diagnosis and treatment of mental illness in children and adolescents.\nBuckingham is currently in private practice. Prior to that she taught at the University of Missouri, Kansas City School of Medicine. Her research focuses on ADHD, Tourette syndrome and obsessive-compulsive disorder. One of her aims is to challenge, through education, the reluctance of minority parents to allow their children to be evaluated by psychiatrists for fear of having them stigmatized.\nEducation, awards\nBuckingham graduated from the University of Kansas School of Medicine after starting her career as a nurse. In 1991 she received her first major award, the Presidential Scholar Award from the American Academy of Child and Adolescent Psychiatry. Two years later she was awarded the Chester Pierce Residents' Award by the National Medical Association, and in 1994 Black Psychiatrists of America named her Black Outstanding Psychiatric Resident in the Cause of African American Families and Children.\nFrom 2007 to 2009, Buckingham was chair of the psychiatry section of the National Medical Association. In July 2008, according to the National Institutes of Health, she was awarded \"one of the largest unrestricted educational grants in the history of the psychiatry section.\" She has also served as an officer for her local chapter of the NAACP.\nSee also\n*Cross-cultural psychiatry\nReferences\nFurther reading\n*Buckingham, Diane. \"Psychopharmacology of Children and Adolescents,\" in John M. Herrera, William B. Lawson, John J. Sramek (eds.), Cross Cultural Psychiatry, Wiley-Blackwell, 1999, 373–381.\n*\n*"
    }
  ]
}