{
  "content": [
    {
      "type": "text",
      "text": "# U.S. Route 301 in Delaware\n\n}}\n| map_custom = yes\n| map_notes =  US&nbsp;301 highlighted in red\n| length_mi = 11.9\n| length_round = 1\n| length_ref =\n| maint = DelDOT\n| established = 1959\n| direction_a = South\n| direction_b = North\n| terminus_a =  at the Maryland state line\n| junction =  near Middletown\n* near Middletown\n}}\n| terminus_b =  in Biddles Corner\n| counties = New Castle\n| previous_type = DE\n| previous_route = 300\n| next_type = DE\n| next_route = 404\n}}\nU.S. Route&nbsp;301 (US&nbsp;301) is a US Highway running from Sarasota, Florida, north to Biddles Corner, Delaware. In the state of Delaware, the route runs  across New Castle County from the Maryland state line southwest of Middletown northeast to its northern terminus at the Delaware Route&nbsp;1 (DE&nbsp;1) freeway in Biddles Corner, just south of the Senator William V. Roth Jr. Bridge that carries DE&nbsp;1 over the Chesapeake & Delaware Canal in St. Georges. US&nbsp;301 in Delaware is a controlled-access toll road that is designated as the First Responders Memorial Highway. The freeway has interchanges with DE&nbsp;299 west of Middletown, DE&nbsp;71 north of Middletown, and Jamison Corner Road, and uses all-electronic tolling, with tolls paid by E-ZPass or toll-by-plate. A mainline toll gantry is located north of the Maryland state line while there are ramp tolls on the southbound exits and northbound entrances at the three interchanges.\nUS&nbsp;301 has moved numerous times throughout its history in Delaware, often following radically different alignments.  Prior to 1959, US&nbsp;301 ended in Maryland, but it was extended into Delaware from Maryland that year.  At that time, it ran from the Maryland state line northeast to a terminus at an intersection with US&nbsp;13, US&nbsp;40, and the southern terminus of US&nbsp;202 in State Road. In 1964, US&nbsp;301 was extended north along US&nbsp;13/US&nbsp;40 to an interchange with I-295 west of the Delaware Memorial Bridge in Farnhurst.  There was, for a time, a split routing, known as US&nbsp;301N and US&nbsp;301S, which diverged in Middletown and rejoined at US&nbsp;13 in Tybouts Corner.  From there, US&nbsp;301 followed US&nbsp;13 and US&nbsp;13/US&nbsp;40 to Farnhurst. In 1971, US&nbsp;301 was rerouted to head north from Middletown to the community of Summit Bridge, where US&nbsp;301N was then routed over the Summit Bridge and along the north side of the Chesapeake & Delaware Canal while US&nbsp;301S stayed south of the canal before rejoining US&nbsp;301N near the Farnhurst terminus. US&nbsp;301 was rerouted again in 1985 at Mount Pleasant to follow DE&nbsp;896 east to Boyds Corner and US&nbsp;13 north to Farnhurst, eliminating the split routing. US&nbsp;301 was rerouted again in 1992 and terminated at US&nbsp;40 in Glasgow. Plans have existed since the 1950s to build a freeway along the US&nbsp;301 corridor in Delaware, with formal plans for a modern toll road beginning in 2005, running from the Maryland state line northeast to DE&nbsp;1 in Biddles Corner. Construction on the US&nbsp;301 freeway began in 2016 with the road opening in 2019, eliminating the alignment that from 1992 to 2019 ended in Glasgow, and returning the road to a similar alignment it followed from 1959 to 1971.\nRoute description\nUS&nbsp;301 enters Delaware from Maryland to the east of the community of Warwick, Maryland, where it heads north-northeast as a four-lane freeway that is tolled and named the First Responders Memorial Highway. The road passes through a mix of farms and woods, coming to a northbound weigh station. The route runs through rural areas with some nearby development and DE&nbsp;299 becomes parallel to the west. US&nbsp;301 reaches a mainline toll gantry before it enters the town of Middletown and comes to a diamond interchange with DE&nbsp;299. This interchange has toll gantries on the southbound exit and northbound entrance. Past DE&nbsp;299, the road continues through the western portion of Middletown as it heads between Appoquinimink High School to the west and a residential neighborhood to the east before passing under DE&nbsp;15 without an interchange. The route leaves Middletown and continues northeast through a mix of farmland and woodland with some development. The road comes to a dogbone interchange with Connector Road, which leads east to DE&nbsp;71 north of Middletown and west to a park and ride lot; the interchange features toll gantries on the southbound exit and northbound entrance. From here, US&nbsp;301 has bridges over DE&nbsp;71 and the Delmarva Central Railroad's Delmarva Subdivision line as it runs through agricultural areas with some woods. The freeway turns north and passes over DE&nbsp;896 without an interchange. The road runs through more rural areas and makes a turn to the east to come to a dumbbell interchange with Jamison Corner Road; toll gantries are located on the southbound exit and northbound entrance. The route runs east through fields and woods with nearby residential development. US&nbsp;301 curves northeast and comes to its northern terminus at a partial interchange with the DE&nbsp;1 freeway in Biddles Corner, south of the Senator William V. Roth Jr. Bridge that carries DE&nbsp;1 over the Chesapeake & Delaware Canal in St. Georges, where the route merges into northbound DE&nbsp;1. At this interchange, a ramp from US&nbsp;13 from its intersection with Port Penn Road merges into the northbound US&nbsp;301 ramp to northbound DE&nbsp;1.\nTolls\nThe US&nbsp;301 toll road uses all-electronic tolling, where tolls are paid with E-ZPass or toll-by-plate, which uses automatic license plate recognition to take a photo of the vehicle's license plate and mail a bill to the vehicle owner. The road has a mainline toll gantry north of the Maryland state line and ramp toll gantries on the southbound exits and northbound entrances at the DE&nbsp;299, DE&nbsp;71, and Jamison Corner Road interchanges. The mainline toll gantry costs $4.00 using E-ZPass and $5.60 using toll-by-plate for passenger vehicles. The ramp toll gantries cost $1.00 using E-ZPass and $1.40 using toll-by-plate for passenger vehicles at the DE&nbsp;299 interchange, $0.75 using E-ZPass and $1.05 using toll-by-plate for passenger vehicles at the DE&nbsp;71 interchange, and $0.50 using E-ZPass and $0.70 using toll-by-plate for passenger vehicles at the Jamison Corner Road interchange.\nHistory\nSurface alignment\nWhat became US&nbsp;301 in Delaware was originally an unnumbered county road by 1920. The roadway was paved by 1924. It was upgraded to a state highway between Mount Pleasant and Summit Bridge a year later. The roadway between Middletown and Mount Pleasant became a state highway in 1930. As part of this improvement, a connecting road was built between the Middletown-Mount Pleasant road and the road leading towards Warwick that passed to the west of Middletown to avoid a pair of railroad crossings. On July 1, 1935, the portion of road between Summit Bridge and Glasgow was taken over by the state. The roadway was designated as DE&nbsp;4 between the Maryland state line and Middletown, DE&nbsp;71 between Middletown and Summit Bridge, and DE&nbsp;896 between Summit Bridge and Glasgow by 1938. By 1957, DE&nbsp;4 was renumbered to DE&nbsp;299 and DE&nbsp;71 was realigned to follow DE&nbsp;299 west of Middletown before splitting onto a new alignment to the Maryland border that connected to Maryland Route&nbsp;71 (MD&nbsp;71). In addition, DE&nbsp;896 was designated concurrent with DE&nbsp;71 between north of Middletown and Summit Bridge.\nUS&nbsp;301 northbound at northern terminus of concurrency with DE&nbsp;15 and DE&nbsp;299 in Middletown in 2008\nThe US&nbsp;301 designation was extended north into Delaware from Maryland by 1959. When first designated, the route entered Maryland from MD&nbsp;71 and followed DE&nbsp;71 and DE&nbsp;299 to Middletown. Here, the route split into US&nbsp;301N and US&nbsp;301S. US&nbsp;301N followed DE&nbsp;299 east to Odessa, where it turned north onto US&nbsp;13 and followed that route across the Chesapeake & Delaware Canal on the St. Georges Bridge. US&nbsp;301S headed north along DE&nbsp;71/DE&nbsp;896 to the Summit Bridge over the canal. Past the canal, US&nbsp;301S headed northeast along DE&nbsp;71 to Tybouts Corner, where it intersected US&nbsp;13 and rejoined US&nbsp;301N. From Tybouts Corner, US&nbsp;301 continued north concurrent with US&nbsp;13 to State Road, where it ended at an intersection with US&nbsp;13, US&nbsp;40, and the southern terminus of US&nbsp;202. From this intersection, US&nbsp;13/US&nbsp;40/US&nbsp;202 continued northeast to Wilmington. US&nbsp;301S was realigned to a new Summit Bridge a short distance to the west in 1960, following new roads that led to the bridge. As a result of this, US&nbsp;301S/DE&nbsp;71 was designated onto a former piece of DE&nbsp;896 between the new alignment and Red Lion Road to the east, with the rest of the former alignment becoming a dead end road south to the canal and the former alignment south of the canal becoming a local road serving the community of Summit Bridge. In 1964, US&nbsp;301 was extended northeast along US&nbsp;13/US&nbsp;40 to an interchange with I-295 in Farnhurst, where US&nbsp;13/US&nbsp;202 continued north to Wilmington and US&nbsp;40 headed east along I-295 towards the Delaware Memorial Bridge. At the same time, US&nbsp;202 was removed from the section of road between State Road and Farnhurst. In 1971, the American Association of State Highway Officials (AASHO, now the American Association of State Highway and Transportation Officials or AASHTO) approved realigning US&nbsp;301 to head north from Middletown to Summit Bridge along DE&nbsp;71/DE&nbsp;896, where it would split. US&nbsp;301N was realigned to follow DE&nbsp;896 north to Glasgow and US&nbsp;40 east from Glasgow to US&nbsp;13 at State Road while US&nbsp;301S continued to follow DE&nbsp;71 from Summit Bridge to Tybouts Corner and US&nbsp;13 from Tybouts Corner to State Road.\nIn 1983, AASHTO approved for the realignment of US&nbsp;301 to follow a newly-aligned DE&nbsp;896 east from Mount Pleasant to Boyds Corner, where it would continue north along US&nbsp;13 to the I-295/US&nbsp;40 interchange in Farnhurst; this change was implemented in 1985. The concurrency with DE&nbsp;71 between the Maryland border and Summit Bridge was removed by 1987. By 1990, US&nbsp;301 became concurrent with DE&nbsp;71 again between Middletown and Mount Pleasant. AASHTO approved for US&nbsp;301 to be realigned to follow DE&nbsp;896 between Mount Pleasant and US&nbsp;40 in Glasgow, US&nbsp;40 between Glasgow and State Road, and US&nbsp;13/US&nbsp;40 between State Road and I-295 in Farnhurst in 1992. However, US&nbsp;301 was only signed up DE&nbsp;896 to US&nbsp;40 in Glasgow. By 1996, US&nbsp;301 was realigned to bypass Middletown further to the west along a newly-built extension of Middletown Warwick Road, having previously followed DE&nbsp;299 and Peterson Road to bypass Middletown to the west. Also by 1996, US&nbsp;301 and DE&nbsp;896 were rerouted to bypass Glasgow to the east, with the former alignment becoming DE&nbsp;896 Bus. In July 2008, a widening project began on US&nbsp;301/DE&nbsp;299 between United Drive and the east end of the concurrency. This widening to four lanes was completed in November 2010.\nFreeway alignment\nPlans for a four-lane superhighway connecting the New Jersey Turnpike (via the Delaware Memorial Bridge) with the Washington, D.C. metro area date back to the opening of the Chesapeake Bay Bridge in the 1950s. In December 1950, a report was prepared for the Delaware State Highway Department that recommended a route running between the Maryland state line near Warwick, where it was to connect to a proposed expressway on the other side of the state line, and the Delaware Memorial Bridge approach in Farnhurst. The route was to follow DE&nbsp;4 (now DE&nbsp;299) to Middletown, where it would head north and parallel DE&nbsp;71 to the Summit Bridge before continuing northeast to US&nbsp;40 between Glasgow and Bear. From here, the highway was to follow US&nbsp;40 northeast to State Road and then run to the east of US&nbsp;13 in the New Castle area before reaching the bridge approach. Interchanges were to be located at DE&nbsp;4 southwest of Middletown, DE&nbsp;71 in Summit Bridge, DE&nbsp;71/DE&nbsp;896 north of Summit Bridge, US&nbsp;40 and US&nbsp;13 in State Road, and DE&nbsp;41 (now DE&nbsp;141) near New Castle. Legislation to build this freeway was requested to the Delaware General Assembly in 1951; it was not approved.\nFrom the 1960s to the early 1990s, the Delaware Department of Transportation (DelDOT) planned for a freeway along the US&nbsp;301 corridor. The freeway would bypass Middletown to the west and continue north to Glasgow, where it would head northeast to an interchange with I-95 (Delaware Turnpike). The northern terminus of US&nbsp;301 would have been at exit 2 of I-95. DelDOT had purchased land at US&nbsp;40 east of Glasgow for an interchange along this freeway. Over the years, plans for the freeway progressed slowly, with priority given to other road projects in the state. As a result, through traffic traveling from I-95 to US&nbsp;301 in Maryland was forced to use two-lane roads such as DE&nbsp;896. By 1992, six corridors were proposed for this freeway. One followed DE&nbsp;896, one ran from Middletown to DE&nbsp;1, another ran north to the Summit Bridge and followed two corridors between Glasgow and I-95, another ran near the Delaware-Maryland state line and crossed the existing Summit Bridge, and the other ran to the east of Middletown. The proposal near the state line was dropped because of impact on wetlands and stream crossings while the proposal to the east of Middletown was eliminated because it would impact too many agricultural areas. In 1994, plans resurfaced for capacity improvements to the US&nbsp;301 corridor, with options for a new freeway, widening the current route, or adding interchanges along DE 896. Three alignments were proposed for the freeway: one running northeast from US&nbsp;40 at Glasgow to I-95, one bypassing Summit Airport to the west, and another running to the west of Middletown and the Summit Bridge. Nothing came from these plans as state officials could not come to an agreement. In 1998, plans were made again to expand capacity along US&nbsp;301, with five options. The options included a US&nbsp;301 freeway between the Maryland state line and I-95; commuter rail linking Middletown to Newark and Wilmington; high-occupancy vehicle lanes on I-95, DE&nbsp;1, and DE&nbsp;896; widening US&nbsp;301 and DE&nbsp;1; and an express road between US&nbsp;301 in Middletown and DE&nbsp;1. At the time, the option for a US&nbsp;301 freeway cost $205 million. Of all the ideas suggested, the freeway proposal received the most support.\nIn 2005, plans for a freeway along the US&nbsp;301 corridor surfaced once again. DelDOT proposed several options for this freeway: \"yellow route\", \"brown route\", \"green route + spur\", \"purple route + spur\", and \"no build\". On November 13, 2006, DelDOT announced that it had chosen the \"green route + spur\" option to build the new US&nbsp;301. This option was the lowest cost, and had minimum impact on property acquisition (35 residential and business properties total, mostly farmland) and did not allow for the demolishing of two local churches.\nIn 2008, the Federal Highway Administration (FHWA) approved the selected alternative and allowed for right-of-way acquisition to begin. On May 2, 2011, AASHTO approved the realignment of US&nbsp;301 onto the new toll road once it was completed. Right-of-way acquisition, completing the final design of the freeway, construction contracts, and utility relocations for the project occurred. Bids for construction of the US&nbsp;301 toll road were issued in 2015.\nIn 2016, construction began on the US&nbsp;301 toll road. A groundbreaking ceremony was held on February 5, 2016, near the Maryland state line, with Governor Jack Markell, FHWA administrator Gregory G. Nadeau, and DelDOT secretary Jennifer Cohan in attendance. The expected cost of the project was $600 million, and DelDOT sought a federal loan to pay for a third of the costs, which was approved in August 2015. The toll road, which cost $636 million to build, was originally planned to open to traffic on January 1, 2019, but inclement weather delayed the opening date. The US&nbsp;301 toll road opened to traffic on January 10, 2019. With the opening of the US&nbsp;301 toll road, restrictions on non-local truck traffic were put into place on the former alignment of US&nbsp;301. On March 1, 2019, a ribbon-cutting ceremony marking the completion of the project was held, with Governor John Carney, Lieutenant Governor Bethany Hall-Long, DelDOT secretary Cohan, U.S. Senators Tom Carper and Chris Coons, and Middletown Mayor Ken Branner in attendance.\nThe project replaced the surface alignment of US&nbsp;301 in Delaware with a four-lane controlled-access toll road connecting US&nbsp;301 at the Maryland state line near Warwick, Maryland to the DE&nbsp;1 toll road in Biddles Corner. The road serves as a high-speed bypass around the cities of Middletown and Newark. The main highway has interchanges with DE&nbsp;299 west of Middletown, a proposed northbound exit and southbound entrance for a future spur to the Summit Bridge, DE&nbsp;71 north of Middletown, and Jamison Corner Road before merging into northbound DE&nbsp;1 between the Biddles Corner toll plaza and the Senator William V. Roth Jr. Bridge. A mainline toll gantry was located near the state line along with ramp tolls on the southbound exits and northbound entrances at DE&nbsp;299, DE&nbsp;71, and Jamison Corner Road. Upon opening, tolls were planned to be $4 for cars and $11 for trucks, with toll rates to rise about 3.5 percent annually. The US&nbsp;301 toll road was built with all-electronic tolling, using E-ZPass or toll-by-plate. Motorists without E-ZPass would be billed at a higher rate. US&nbsp;301 is the first toll road in Delaware to use all-electronic tolling and serves as a pilot project for the concept; if successful, all-electronic tolling will be expanded to other toll roads in Delaware. On September 13, 2019, Governor Carney signed a bill passed by the Delaware General Assembly that designated the section of US&nbsp;301 in Delaware as the First Responders Memorial Highway.\nA two-lane freeway spur will branch from the main highway northwest of Middletown at a northbound exit and southbound entrance and head north to an interchange with DE&nbsp;71/DE&nbsp;896 and the northern terminus of DE&nbsp;15 near Summit Bridge. At the northern terminus of the spur, the spur will merge into northbound DE&nbsp;71/DE&nbsp;896 onto the Summit Bridge while a southbound exit and northbound entrance just south of the terminus will serve the northern terminus of DE 15. The spur road connecting the US&nbsp;301 toll road to DE&nbsp;71/DE&nbsp;896 in Summit Bridge is planned to be constructed when traffic conditions warrant the need for the road. DelDOT has been monitoring traffic levels on the former surface alignment of US&nbsp;301 and DE&nbsp;896 annually to determine when the spur road will be needed.\nExit list\n|notes=Continuation into Maryland\n}}\n|notes=Tolled southbound exit and northbound entrance\n}}\n|notes=Tolled southbound exit and northbound entrance; access via Connector Road\n}}\n|notes=Northern terminus of US&nbsp;301; exit&nbsp;147 on DE 1\n}}\nSee also\n*\nReferences\nExternal links\n* [https://www.aaroads.com/guides/us-301-de/ US&nbsp;301 at AARoads.com]\n* [https://www.alpsroads.net/roads/de/us_301/ Delaware Roads - US&nbsp;301]\n* [http://www.deldot.gov/information/projects/us301/ DelDOT's US&nbsp;301 Project page]\n* [http://www.phillyroads.com/roads/US-301_DE The Roads of Metro Philadelphia: US&nbsp;301 Freeway-Delaware (unbuilt)]"
    }
  ]
}