{
  "content": [
    {
      "type": "text",
      "text": "# U.S. Catholic Historian\n\nThe U.S. Catholic Historian is a peer-reviewed quarterly journal published by Catholic University of America Press.\nIt is devoted exclusively to the history of the Catholic Church in the United States. Each issue contains articles on a theme selected by the editor and the journal's editorial board.\nHistory\nThe first issue was published in the fall of 1980. At its founding, the U.S. Catholic Historian was the official publication of the United States Catholic Historical Society (now inactive).\nBeginning in 1984, each issue of U.S. Catholic Historian was dedicated to a particular theme. Themes have included urbanism, gender, anti-Catholicism, modernism, black Catholics, Hispanic heritage, and social activism, among many others.\nIn noting the journal's distinctive approach, historian James T. Fisher wrote, “[T]he journal has presented diverse voices, topics, and approaches as a fundamental organizing principle….USCH quickly grew from a modest format to an indispensable outlet for new scholarship that defined an emerging field and gave its scholars ‘a journal of one’s own.’”\nContributors include specialists in the field of American Catholic history, but also journalists, archivists, theologians, and sociologists. Notable contributors have included\nAndrew Greeley, Michael Novak, Martin E. Marty, Robert A. Orsi, Bishop Ricardo Ramírez, Bishop John S. Cummins, Mark A. Noll, Albert J. Raboteau, and M. Shawn Copeland.\nPublishers\nThe U.S. Catholic Historian is published by Catholic University of America Press. It was previously published by Our Sunday Visitor Press (1993-2000) and University of Notre Dame Press (2001-2006).\nEditors\nThe U.S. Catholic Historian's founding editor was James J. Mahoney. He was succeeded in 1983 by [https://catholicreview.org/christopher-kauffman-prolific-church-historian-dies-81/ Christopher J. Kauffman] who edited the journal until 2013. The current editor is David J. Endres.\nAbstracting and indexing\nThe journal is published in print form, but also forms part of electronic collections, including Project MUSE, JSTOR, and EBSCO Humanities Abstracts.\nReferences\nFurther reading\nDavid J. Endres, ed., Remapping the History of Catholicism in the United States: Essays from the U.S. Catholic Historian (Catholic University of America Press, 2017).\nExternal links\n*"
    }
  ]
}