{
  "content": [
    {
      "type": "text",
      "text": "# U.S. Route 40 in Delaware\n\n}}\n|map_custom=yes\n|map_notes=US 40 highlighted in red\n|alternate_name=\n|length_mi=17.18\n|length_round=2\n|length_ref=\n|maint=DelDOT and DRBA\n|established=1926\n|direction_a=West\n|terminus_a= at Maryland border in Glasgow\n|junction= in Glasgow\n* near Glasgow\n* in Bear\n* in Bear\n* in State Road\n* in Hares Corner\n* in Wilmington Manor\n* in Wilmington Manor\n* in Holloway Terrace\n}}\n|direction_b=East\n|terminus_b= at New Jersey border in Holloway Terrace\n|counties=New Castle\n|previous_type=DE\n|previous_route=37\n|next_type=DE\n|next_route=41\n}}\nU.S. Route&nbsp;40 (US&nbsp;40) is a US highway running from Silver Summit, Utah, east to Atlantic City, New Jersey. In the US state of Delaware, it serves as a major east&ndash;west highway in northern New Castle County, just south of Wilmington. It runs from the Maryland state line west of Glasgow east to the Delaware Memorial Bridge over the Delaware River to New Jersey, at which point it is concurrent with Interstate&nbsp;295 (I-295). Along the way, US&nbsp;40 passes through suburban areas in Glasgow and Bear before running concurrent with US&nbsp;13 and I-295 around New Castle. US&nbsp;40 is a multilane divided highway the entire length across Delaware, with the section concurrent with I-295 a freeway.\nUS&nbsp;40 was originally built as a state highway during the 1920s, comprising Elkton Road and a part of the Dupont Highway. When first designated, the route followed these two roads from the Maryland state line to Wilmington, where it crossed the Delaware River on a ferry to Penns Grove, New Jersey. In 1928, the route was rerouted at Hares Corner to head east into New Castle and cross the river on a ferry to Pennsville, New Jersey. The entire length of US&nbsp;40 west of Hares Corner was widened to a divided highway during the 1930s. The Delaware Memorial Bridge opened in 1951, and US&nbsp;40 was rerouted north along US&nbsp;13 before heading east along the bridge approach, with Delaware Route&nbsp;273 (DE&nbsp;273) extended east along the former route into New Castle. In 1959, the Delaware Memorial Bridge approach became a part of I-295. Between the 1960s and 1990s, US&nbsp;301 ran along the US&nbsp;13/US&nbsp;40 concurrency and US&nbsp;301N followed US&nbsp;40 between Glasgow and State Road from the 1970s to the 1980s.\nRoute description\nUS&nbsp;40 enters Delaware from Maryland west of Glasgow, heading east on four-lane divided Pulaski Highway (which originates in Baltimore). From the state line, the route passes near residential subdivisions.  Upon reaching Glasgow, the road continues into commercial areas and the median of the road widens to include businesses in it. US&nbsp;40 passes north of the Peoples Plaza shopping center and comes to an intersection with DE&nbsp;896 Bus. in the center of the community. The median of the road narrows as it reaches a junction with DE&nbsp;896 on the eastern edge of Glasgow. Past this junction, the route runs between Glasgow Park to the north and a mix of development and woods to the south, crossing Belltown Run. US&nbsp;40 passes through residential and business areas and comes to an intersection with DE&nbsp;72. Past this intersection, the road curves to the northeast, crossing Norfolk Southern's Delmarva Secondary railroad line at-grade. The route heads through a mix of wooded areas and businesses as it enters Bear, intersecting Salem Church Road/Porter Road. US&nbsp;40 continues through suburban development with some farm fields, passing to the south of the Wilmington University Athletic Complex. The road widens to six lanes at the Walther Road/Glendale Boulevard junction before reaching an intersection with DE&nbsp;7 in a business area.\nPast this intersection, US&nbsp;40 comes to a partial cloverleaf interchange with the DE&nbsp;1 freeway. After this interchange, the route narrows to four lanes and passes more development and some farm fields, reaching a westbound right-in/right-out with Appleby Road. Farther east, US&nbsp;40 heads through business areas immediately to the north of Norfolk Southern's New Castle Secondary railroad line as it reaches a directional intersection with US&nbsp;13 in State Road; this intersection has no access from northbound US&nbsp;13 to westbound US&nbsp;40.\nAt this point, US&nbsp;40 heads northeast for a concurrency with US&nbsp;13 on South Dupont Highway, an eight-lane divided highway. DE&nbsp;9 Truck also runs concurrent with US&nbsp;13/US&nbsp;40 at this point. The road runs through commercial areas, coming to an intersection with DE&nbsp;273 in Hares Corner. At this point, DE&nbsp;9 Truck splits from US&nbsp;13/US&nbsp;40 by heading east along DE&nbsp;273. Past this intersection, US&nbsp;13/US&nbsp;40 becomes North Dupont Highway and passes between Wilmington Airport to the northwest and businesses to the southeast as it runs along the western border of the city of New Castle for a short distance, reaching a partial cloverleaf interchange with the southern terminus of US&nbsp;202 and DE&nbsp;141 at the end of the airport property. Following this, the two routes narrow to six lanes, heading to the northwest of the Main Campus of Wilmington University and running through more commercial areas in Wilmington Manor. Along this stretch, the route gains an eastbound combined right turn, bus, and bicycle lane. The road loses the eastbound combined right turn, bus, and bicycle lane before passing over the Jack A. Markell Trail and reaching an interchange with I-295 in Farnhurst.\nHere, US&nbsp;40 splits from US&nbsp;13 by heading east concurrent with I-295 on an eight-lane freeway maintained by the Delaware River and Bay Authority (DRBA). The road has an eastbound ramp to Landers Lane before it passes between residential neighborhoods and comes to a cloverleaf interchange with DE&nbsp;9 north of New Castle. This interchange provides access to Veterans Memorial Park, where a war memorial honoring veterans from Delaware and New Jersey is located. Past DE&nbsp;9, the median of the freeway widens to include the DRBA headquarters, with direct access to and from the westbound lanes while eastbound access is provided by way of DE&nbsp;9. After this, the westbound direction has a toll plaza for the Delaware Memorial Bridge. I-295/US&nbsp;40 continues east and passes over Norfolk Southern's New Castle Secondary before crossing the Delaware River on the twin-span Delaware Memorial Bridge, at which point both routes head into New Jersey.\nUS&nbsp;40 in Delaware has an annual average daily traffic count ranging from a high of 107,176&nbsp;vehicles at the DE&nbsp;9 interchange along the I-295 concurrency to a low of 25,863&nbsp;vehicles at the Appleby Road intersection between Bear and New Castle. The entire length of US&nbsp;40 in Delaware is part of the National Highway System.\nHistory\nBy 1920, what would become the Delaware portion of US&nbsp;40 was a county road, with the portion along US&nbsp;13 under contract to become a state highway. The section of US&nbsp;40 along the Dupont Highway was completed by 1923. The Pulaski Highway portion of the road was built as a state highway by 1924. When the US Highway System was created on November 11, 1926, US&nbsp;40 was designated to pass through Delaware along Elkton Road (Pulaski Highway) between the Maryland state line and State Road, a concurrency with US&nbsp;13 from State Road to Wilmington, and Christina Avenue from US&nbsp;13 to a ferry across the Delaware River which carried the route to Penns Grove, New Jersey. In 1926, the Delaware State Highway Department suggested that the portion of US&nbsp;40 that followed US&nbsp;13 along the DuPont Highway be widened. This widening was completed a year later. In 1928, US&nbsp;40 was rerouted at Hares Corner to head east through New Castle and cross the Delaware River on a ferry to Pennsville, New Jersey. All of the route was a state highway by 1931 except the portion from Hares Corner to the Basin Road intersection in New Castle.\nIn 1931, work began on widening US&nbsp;40 along the US&nbsp;13 concurrency to a divided highway. The completion of the divided highway between State Road and Wilmington was slated for summer 1933. US&nbsp;202 was designated concurrent with US&nbsp;13/US&nbsp;40 north of State Road in 1934. Recommendations were made in 1932 to widen US&nbsp;40 into a divided highway between the Maryland state line and State Road. A year later, the divided highway portion of US&nbsp;40 had been graded between the Maryland state line and Glasgow while paving of the divided highway was in progress between Bear and State Road. Grading of the divided highway between the Maryland state line and State Road had been completed in 1934 with construction of the remainder of the road underway. Work on widening US&nbsp;40 to a divided highway between the Maryland state line and US&nbsp;13 was finished in 1936. In 1934, recommendations were made to upgrade US&nbsp;40 to a state highway between Hares Corner and New Castle. The portion of US&nbsp;40 between Hares Corner and New Castle was taken over by the state on July 1, 1935. Construction on upgrading this section began in 1936, with the project completed later that year. The same year, a bridge was constructed over a Pennsylvania Railroad line (now the Jack A. Markell Trail) in New Castle.\nConstruction on the Delaware Memorial Bridge began in 1949. At the same time, work was underway on the Delaware Memorial Bridge approach, a divided highway which would begin at a directional T interchange with US&nbsp;13/US&nbsp;202 in Farnhurst and head east to a cloverleaf interchange at New Castle Avenue (present DE&nbsp;9) before leading to the bridge. Construction on the US&nbsp;13/US&nbsp;202 interchange at Farnhurst began on July 12, 1950. On August 16, 1951, the Delaware Memorial Bridge opened to traffic. US&nbsp;40 was rerouted to use the Delaware Memorial Bridge to cross the Delaware River, being realigned to follow US&nbsp;13/US&nbsp;202 north from Hares Corner to Farnhurst and the bridge approach road between Farnhurst and the bridge. The ferry connecting New Castle to Pennsville was discontinued and DE&nbsp;273 was extended east along the former alignment of US&nbsp;40 into New Castle.\nIn 1954, plans were made to replace the intersection with DE&nbsp;41/DE&nbsp;141 in Basin Corner with a modified cloverleaf interchange in an effort to reduce traffic congestion. Construction on the interchange began in September of that year. The interchange between US&nbsp;13/US&nbsp;40/US&nbsp;202 and DE&nbsp;41/DE&nbsp;141 was completed in 1956. In 1958, construction began for a bridge at the Farnhurst interchange that would link the US&nbsp;40 approach to the Delaware Memorial Bridge to the Delaware Turnpike that was proposed to run west to the Maryland state line. A year later, the Farnhurst interchange and the bridge approach were upgraded to Interstate Highway standards, and it was designated as part of I-295. Construction at the interchange connecting to the Delaware Turnpike at Farnhurst was completed in July 1961. On November 14, 1963, the Delaware Turnpike opened to traffic, with I-295 extended west (south) to I-95 at the northern terminus of the turnpike. In the middle of 1964, work began on a second span at the Delaware Memorial Bridge due to increasing traffic volumes. The second span of the bridge was opened to traffic in the later part of 1968.\nThe US&nbsp;202 designation was removed from US&nbsp;13/US&nbsp;40 between State Road and Farnhurst in 1964, with US&nbsp;301 extended north to follow US&nbsp;13/US&nbsp;40 from State Road to Farnhurst. US&nbsp;301N was designated to follow US&nbsp;40 between DE&nbsp;896 and US&nbsp;13 in 1971. US&nbsp;301N was removed from US&nbsp;40 in 1985. By 1994, US&nbsp;301 was removed from the US&nbsp;13/US&nbsp;40 concurrency, having been rerouted to follow DE&nbsp;896 to end at US&nbsp;40 in Glasgow. Despite this, the American Association of State Highway and Transportation Officials (AASHTO) still had US&nbsp;301 follow US&nbsp;40 between DE&nbsp;896 in Glasgow and I-295/US&nbsp;13 in Farnhurst.\nThere are plans to widen the portion of US&nbsp;40 from Salem Church Road/Porter Road east to Walther Road/Glendale Boulevard in Bear from four lanes to six lanes. The widening project is planned to begin in 2024 and be finished in 2027.\nMajor intersections\n|notes=Maryland state line\n}}\n|notes=\n}}\n|notes=\n}}\n|notes=\n}}\n|notes=\n}}\n|notes=DE&nbsp;1 exit&nbsp;160\n}}\n|to2=to|DE|1|US|301|city1=Dover|city2=Beaches}}\n|notes=No access from northbound US&nbsp;13 to westbound US&nbsp;40; west end of US&nbsp;13/DE&nbsp;9 Truck overlap\n}}\n|notes=East end of DE&nbsp;9 Truck overlap\n}}\n|notes=US&nbsp;202/DE&nbsp;141 exit&nbsp;1; southern terminus of US&nbsp;202\n}}\n|notes=East end of US&nbsp;13 overlap; west end of I-295 overlap\n}}\n|notes=Access to Veterans Memorial Park, Delaware River and Bay Authority Headquarters, and Historic New Castle\n}}\n|notes=New Jersey state line\n}}\nSee also\n*\nReferences\nExternal links\n* [https://www.aaroads.com/guides/us-040-de/ US&nbsp;40 at AARoads.com]\n* [https://www.alpsroads.net/roads/de/us_40/ Delaware Roads - US&nbsp;40]"
    }
  ]
}