{
  "content": [
    {
      "type": "text",
      "text": "# Uday Singh (Sikh warrior)\n\nUday Singh (died December 1704 or 1705) was a Sikh warrior during the period of Guru Gobind Singh.\nEarly life\nHe was the third-born son of Bhai Mani Singh and brother of Bachittar Singh. He was born into a Parmar Rajput family of Alipur in the Multan district. He underwent the Pahul on 30 March 1699 during the festival of Vaisakhi.\nMilitary career\nBy 1698, he had already earned a reputation of being a talented musketeer. He is said to have once killed a tiger during a chase with a musket.\nHe participated in many battles against the Mughals and Hill Rajas. He was part of a group of 25 Sikhs whom accompanied Guru Gobind Singh to Anandpur shortly after the formalization and officialization of the Khalsa order and participated in many of the following military conflict in the area as a result. One time while the Guru was partaking in hunting in the Anandpur Valley of the Shivalik Hills, two Hill Rajas, named Balia Chand and Alam Chand, attempted to attack the Guru. Uday Singh is said to have fought them off, inflicting a serious wound on Balia Chand in the process.\nWhen faced with a petition by Ajit Singh to allow him to partake in a battle, Guru Gobind Singh instructed Uday Singh to accompany his elder son, alongside 100 warriors. During an operation during the first siege of Anandpur in 1700, he recovered the fort of Taragarh alongside Sahibzada Ajit Singh. He was responsible for the improvement of the Sikh defences that year in Anandpur and commanded the reserves. He was responsible for personally killing Raja Kesri Chand of Jaswan State in battle. He would further participate in the battles of Nimohgarh, Basoli, and Kalmot.\nDeath\nDuring the evacuation of Anandpur by the retinue of Guru Gobind Singh, he was assigned a group of 50 men to confront and slow-down the pursuing enemy forces. He took over the responsibility of the rear-guard from Ajit Singh. He died in battle in December 1704 or 1705 during the Battle of Shahi Tibbi as a result against an enemy which vastly outnumbered his small force.\nLegacy\nA small gurdwara has since been constructed on the place of his death atop the hill of Shahi Tibbi.\nNotes\nReferences"
    }
  ]
}