{
  "content": [
    {
      "type": "text",
      "text": "# Ukrainian Republican Party\n\n}}\nNational conservatism\n| position         = Right-wing or far-right.}}\n| international    =\n| colours          =\n| colorcode        =\n| headquarters     = Kyiv\n| website          = http://urp1990.com.ua/\n| footnotes        =\n}}\nThe Ukrainian Republican Party () is a political party in Ukraine. Created on 5 November 1990 by the Ministry of Justice of the Ukrainian SSR, it was the first formal political party besides the Communist Party of the Soviet Union to be officially registered, though it had been founded in April 1990 on the basis of the Ukrainian Helsinki Union. In April 2002 the party merged with the Ukrainian People's Party \"Sobor\" as the Ukrainian Republican Party \"Sobor\". It then reformed in 2006.\nHistory\nIn November 1976, Ukrainian community groups was established to promote the implementation of the Helsinki agreements. Almost all members of this Ukrainian Helsinki Group where subsequently repressed, four of them (Vasyl Stus, Yuriy Lytvyn, Oleksa Tykhy and Valeriy Marchenko) died in Soviet camps (Gulag).\nIn March 1988, the Ukrainian Helsinki Union (UHU) was formed. Since 1989, UHU has moved to open propaganda activity of promoting Ukrainian independence.\nBetwen 29–30 April 1990, Ukrainian Republican Party (URP) was established in the place of the UHU. The party was registered on 5 November 1990 by the Ministry of Justice of the Ukrainian SSR as the first political party in Ukraine.\nA 1992 split in the party resulted in the creation of the rival Ukrainian Conservative Republican Party (UKRP) led by Stepan Khmara.\nIn the 1994 Ukrainian parliamentary election the URP core party obtained nine seats initially adding three more by the end of the year.\nDuring the 1998 Ukrainian parliamentary election the party was part (together with Congress of Ukrainian Nationalists & Ukrainian Conservative Republican Party) of the Election Bloc \"National Front\" () which won 2.71% of the national votes and six (constituency) seats. In January 2001 the \"National Front\" parliamentary faction had grown to 17 deputies.\nAfter being part of the National Salvation Committee the party became part of the Yulia Tymoshenko Electoral Bloc alliance during the Ukrainian 2002 parliamentary elections. On 21 April 2002 the party merged with the Ukrainian People's Party \"Sobor\" as the Ukrainian Republican Party \"Sobor\".\nIn May 2006 Levko Lukianenko tried to reestablish URP after URP Sobor switched to Our Ukraine–People's Self-Defense Bloc from the Yulia Tymoshenko Bloc; the new party became known as the URP of Lukyanenko and registered in 2006. [http://www.kyivpost.com/news/politics/detail/91233/ Lukyanenko was elected leader of Ukrainian Republican Party], Kyiv Post (25 November 2010).\nReformation\nThe Ukrainian Republican Party (; Ukrajinska Respublikanska Partija) reregistered in December 2006 as Ukrainian Republican Party Lukyanenko (). The party was led by political veteran Levko Lukyanenko(1928–2018). The party did not participate in the 2007 parliamentary election as well as the 2012 Ukrainian parliamentary election nationwide proportional party-list system; instead three members of the party tried to win a seat in three of the 225 local single-member districts.  None of the parties candidates did win.\nThe party did participate in the 2014 Ukrainian parliamentary election in five single-member districts; but again did not win seats. The party has not taken part in national elections since 2012.\nThe party occupies a few seats in local and oblast councils. [http://www.pravda.com.ua/articles/2010/11/8/5552584/ Results of the 2010 local elections preliminary data on interactive maps] by Ukrayinska Pravda (8 November 2010) [http://www.pravda.com.ua/news/2013/01/28/6982356/ На довиборах в Івано-Франківську облраду перемогли \"Батьківщина\" і \"Свобода\"], Ukrayinska Pravda (28 January 2013) In the 2020 Ukrainian local elections the party gained four deputies (0.01% of all available mandates).\nReferences"
    }
  ]
}