{
  "content": [
    {
      "type": "text",
      "text": "# Ukrainian People's Revolutionary Army\n\n|\n*World War II\n**\n**\n***Shepetivka Operation\n*Polish–Ukrainian conflict (1939–1947)\n**Battle of Vilya\n}}\n| image            = Логотип газети «Гайдамака».svg\n| caption          = Logo of the Haidamaka newspaper, the UPRA's official press organ\n| active           = July 1941 – 5 October 1943\n| ideology         = Anti-communismUkrainian nationalism\n| leaders          = Taras Bulba-Borovets\n| area             = Polesia\n| allies           =  Government of the Ukrainian People's Republic in exile\n*  Ukrainian Insurgent Army (–1943)\n}}\n| opponents        =\n*\n*\n*  Ukrainian Insurgent Army (1943–)\n}}\n}}\n'''Ukrainian People's Revolutionary Army (), also known as the Polissian Sich () or the Ukrainian Insurgent Army''', was a paramilitary formation of Ukrainian nationalists, nominally proclaimed in the Olevsk region in December 1941 by Taras Bulba-Borovets, by renaming an existing military unit known from July 1941 as the UPA-Polissian Sich. It was a warlord-type military formation without a strict central command. From spring 1942 until the autumn of 1943, it acted against and worked with the German rural civil administration and warehouses, from spring 1943 it also fought against Soviet Partisans and some units against Poles; from July–August 1943, it clashed with OUN-B Bandera's UPA and UB units.\nTo distinguish itself from Stepan Bandera's Ukrainian Insurgent Army, it was renamed the Ukrainian People's Revolutionary Army on 20 July 1943. Among the local population and Soviet partisans, members of Bulba's formation were always known as bulbovtsy (Russian) / bulbivtsi or bulbashi (Ukrainian).\nUPA and Polissian Sich\nBy the end of June 1941 Taras Borovets, with support from German occupation forces officials, decided to create his own military formation. At the beginning of July 1941 he was nominated by the Germans to the post of Ukrainian militia commander at Sarny district. By the beginning of August 1941 he obtained German permission to create an armed military formation which he named the Polissian Sich. The main tasks of this newly created formation was \" by the order of German military command … establishing a self defense against Bolshevik regular and partisan units.\" Borovets' military formation obtained high praise from the Germans; they especially noted the cruel massacre of retreating Soviet Army soldiers which this formation had conducted earlier.\nAt the beginning of August, Borovets made an attempts to obtain military support from the two rival factions of the Organization of Ukrainian Nationalists. Stepan Bandera's OUN-B rejected his proposal while the OUN-M under Andriy Melnyk faction agreed to provide support. Several military officials affiliated to the OUN-M joined the UPA-Polissian Sich. The Sich's chief of staff was Petro Smorodsky, formerly a lieutenant colonel of the UNR Army. After defeating a Soviet force at Olevsk on 21 August, Borovets established his headquarters there. From this time till the middle of November 1941, the Bulba formation controlled a large territory of northwest Ukraine which lay away from central roads. By the autumn of 1941, it had 2,000-3,000 armed personnel and published the official newspaper Haidamaka. Arms and ammunition were supplied by the Germans with which Borovets maintained friendly relations. In November 1941, the German administration began to disband nationalist military formations, some of which were reformed into Ukrainian auxiliary police under direct German command. On 16 November 1941, UPA/The Polissian Sich was formally demobilized.\nRule in Olevsk\nBy August 1941, Taras Bulba-Borovets had appointed Petro Smorodskyi as commander of the garrison in Olevsk and commanded up to 600 men; later, Boris Simonovich followed as the leader of the raion-council. Around 3,000 Jews lived in the Olevsk, which was around 42% of its population. The Jews of Olevsk were subjected to pogroms and were assigned to forced labor tasks, mainly to humiliate them. In addition to the physical abuse, the Polissian Sich imposed a collective tax of 100,000 rubles on the Jewish population. In November 1941, the rule of the Polissian Sich ended with the taking over of German civil and military administration. Still, the Polissian Sich were integrated in the implementation of German administration, especially in the ghettoization of the Jews. Also around 50 Sich-members and two Sich-commanders participated in liquidations of Jews in mid-November 1941. Additionally on 20 November 1941 Sich-members took part at the liquidations of 535 Jews in the village of Varvarovka, where they were brought from Olevsk.\nUkrainian Insurgent Army\nIn December 1941, Bulba removed \"The Polissian Sich\" from his formation name (numbering by this time only 300 persons), calling his formation the \"Ukrainian Insurgent Army\". In February 1942, he made an unsuccessful attempt to negotiate with the Germans for the renewal of his formation. The winter of 1941/42 was spent by Taras Bulba-Borovets at the General Government, while his formation was inactive.\nIn March 1942, the Germans activated their program of the brutal exploitation of Ukraine. As a reaction to such measures, military units controlled by Borovets rapidly expanded with volunteers. These included Soviet POWs, local peasants, different type of nationalists from the OUN which had not adopted official line. At this time, Borovets' force became an anti-German force; its activities were limited to actions that interfered with the economical exploitation of selective regions by local German administrations. In general, its activities were limited to passive self-defense of several rural areas and attacks on German food warehouses. On 19 August 1942, Bulba's detachments at Shepetivka captured 4 railway coaches with military equipment. Throughout the summer and autumn Taras Bulba-Borovets tried to find a compromise with German administration and even Nazi security police and SIPO representatives met several time with Borovets' UPA to negotiate future cooperation; such meetings did not have any known results. During the autumn and winter of 1942, Borovets also conducted negotiations with Soviet partisans and reached tricky \"non-aggression\" agreement, which lasted until February 1943.\nBorovets' UPA refused to conduct military operations against Poles. Borovets tried to negotiate with Polish leaders, but did not succeed - the Poles agreed to recognize an independent Ukraine only within the borders of 1939, and for Western Ukraine they promised only autonomy. In the spring of 1943 skirmishes between Ukrainians and Poles began, and often the murders were the results of conflicts between neighbors. Borovets was unable to stop interethnic conflict and a third front, the Polish one, was opened for the UPA.\nBy the end of February 1943, the Bandera wing of the Organization of Ukrainian Nationalists(OUN-B) decided to create its own military formation. While conducting negotiations with Borovets about cooperative actions (in fact demanding that Borovets' units be placed under direct OUN-B control) on March 20, 1943 OUN (Bandera wing) issued an order about own military formation creation \"using Bulba's military personnel\". Such \"formation\" often involved forcible acquiring of Bulba units. Because Bulbas UPA was well known and popular amongst the local population, the commander of the OUN-B military formation Dmytro Klyachkivsky issued an order renaming the OUN-B military detachments as UPA.\nThus, from May 1943 two Ukrainian nationalistic forces shared a common name, the Ukrainian Insurgent Army (Ukrayins'ka Povstans'ka Armiya,\" or \"UPA\"), without merging into one army.\nUkrainian People's Revolutionary Army\nTo separate his own military formations from such actions on the 20th (or 27th) of July 1943 Bulba issued an order renaming his own UPA into the Ukrainian People's Revolutionary Army (the name which OUN-B had adopted in 1941 for a future Ukrainian army in Bandera's Ukraine).\nAt the end of June 1943 the OUN-B issued an order according to which all Ukrainian nationalist formations were to follow the command of the OUN-B. That order lead to military actions by the UPA against UPRA. In August, many of Bulba's units were absorbed, disarmed or disbanded, and many commanders were killed by the UPA Security Service – SB.\nOn 18 August 1943, Borovets and the UPRA headquarters was surrounded and ambushed by several UPA battalions. Some of UPRA command were captured, some killed – including Borovet's wife. Borovets and a few of his staff escaped.\nOn 5 October 1943, Borovets issued an order which declared the start of \"new tactics of UPRA warfare\" and a move deep underground; in reality, this was the actual disbandment of Borovets' peasants army. The steady loss of men to the rival UPA and the decline in peasant support prompted Borovets to rename his force the Ukrainian People's Revolutionary Army, although some UPRA detachments were active even later. In December 1943, they captured and released a senior OUN-B officer. Later, some Soviet sources reported about clashes with UPRA units. In autumn 1944 Soviet authorities reported that an UPRA unit prevented wood-cutting activities in one Polissya county.\n2019 official veteran status\nIn late March 2019, former members of Polissian Sich and the Ukrainian People's Revolutionary Army were officially granted the status of veterans. This meant that for the first time they could receive veteran benefits, including free public transport, subsidized medical services, annual monetary aid, and public utilities discounts and would enjoy the same social benefits as former Ukrainian Red Army soldiers of the Soviet Union.[https://www.kyivpost.com/ukraine-politics/former-wwii-nationalist-guerrillas-granted-veteran-status-in-ukraine.html Former WWII nationalist guerrillas granted veteran status in Ukraine], Kyiv Post (26 March 2019)[https://112.international/ukraine-top-news/law-recognizing-ukrainian-insurgent-army-fighters-as-veterans-enforced-38171.html Law recognizing Ukrainian Insurgent Army fighters as veterans enforced], 112 Ukraine (26 March 2019) There had been several previous attempts to provide former Ukrainian nationalist fighters with official veteran status, especially during the 2005–2009 administration President Viktor Yushchenko, but all failed.\nReferences\nSources\n*\n*http://history.org.ua/oun_upa/upa/  Організація українських націоналістів і Українська повстанська армія Chapter 3 p.&nbsp;104-154\n* Borovets', T. Armiia bez derzhavy: slava i trahediia ukraïns'koho povstans'koho rukhu (Winnipeg 1981)\n*[https://web.archive.org/web/20071218011500/http://oun-upa.org.ua/personalities/borovets.html Son of Polissia]\n*[https://web.archive.org/web/20010419081113/http://www.geocities.com/uno_montreal/bulba_table.htm Army without country]\n*[https://web.archive.org/web/20071217231129/http://forum.ottawa-litopys.org/documents/doc0303_u.htm Taras Borovetz History of the UIA]\n*[https://web.archive.org/web/20071217231134/http://forum.ottawa-litopys.org/documents/doc0304_u.htm Taras Borovetz - Our opinion of Russia and General Vlasov]\n*Володимир Дзьобак. [https://web.archive.org/web/20110724155005/http://www.ssu.gov.ua/sbu/control/en/publish/article;jsessionid=27653130DBA2F6D57540DF0ABC9CEB02?art_id=43288&cat_id=42967  Тарас Боровець і “Поліська Січ”], \"З архівів ВУЧК-ГПУ-НКВД-КГБ\", No.1/2(2/3), 1995."
    }
  ]
}