{
  "content": [
    {
      "type": "text",
      "text": "# Ukraine – Forward!\n\n}}\n| logo             =\n| leader           = Natalia Korolevska\n| foundation       =  (as the Ukrainian Social Democratic Party)\n| split            = Social Democratic Party of Ukraine (united)\n| predecessor      = Ukrainian Social Democratic Party\n| ideology         = Social democracy\n| position         = Centre-left\n| national         = Yulia Tymoshenko Bloc (2001–2012)Opposition Bloc (2014–2018)Opposition Platform — For Life (2018–2022)\n| colours          =  Blue| Yellow| Red}}\n| colorcode        = #1D8BCB\n| headquarters     = Kyiv\n| membership_year  = 2010\n| membership       = About 86,000\n}}\nUkraine – Forward! (, Ukrajina – Vpered!, Russian: ) is a social democratic political party in Ukraine. From its registration in December 1998 until March 2012 it was named Ukrainian Social Democratic Party. The party has, according to official figures, about 86,000 party members. The official name of the party is:  Party of Natalia Korolevska \"Ukraine – Forward!\" (, )\nUkrainian Social Democratic Party was from its first election in 2002 a long-time member of Bloc Yulia Tymoshenko (BYuT) but its leader Korolevska fell out with the BYuT's new leaders and they expelled her party from the bloc in March 2012. As a part of BYuT the party was always represented in the Ukrainian Parliament. But after running independently in 2012 it failed to win parliamentary representation.\nParty leader Korolevska did become Minister of Social Policy of Ukraine in the second Azarov Government on 24 December 2012. In the 2014 Ukrainian parliamentary election members of the party took part in the elections on the party list of Opposition Bloc; Opposition Bloc won 29 seats.[http://www.ukrinform.ua/eng/news/poroshenko_bloc_to_have_greatest_number_of_seats_in_parliament_327072 Poroshenko Bloc to have greatest number of seats in parliament], Ukrinform (8 November 2014)[http://en.interfax.com.ua/news/general/233404.html People's Front 0.33% ahead of Poroshenko Bloc with all ballots counted in Ukraine elections - CEC], Interfax-Ukraine (8 November 2014)[http://en.interfax.com.ua/news/general/233426.html Poroshenko Bloc to get 132 seats in parliament - CEC], Interfax-Ukraine (8 November 2014)[http://www.kyivpost.com/content/kyiv-post-plus/opposition-bloc-boosts-rating-by-distancing-itself-from-yanukovych-era-369312.html Opposition Bloc boosts rating by distancing itself from Yanukovych era], Kyiv Post (24 October 2014)[http://www.kyivpost.com/content/ukraine/development-party-of-ukraine-ukraine-forward-and-four-more-political-forces-team-up-in-opposition-bloc-364731.html Development party of Ukraine, 'Ukraine - Forward!' and four more political forces team up in Opposition Bloc], Kyiv Post (15 September 2014)[http://www.thedailybeast.com/articles/2014/10/25/ukraine-s-elections-the-battle-of-the-billionaires.html Ukraine's Elections: The Battle of the Billionaires], The Daily Beast (10.25.14) [http://www.radiosvoboda.org/content/article/26583382.html Non-Maidan parties united into the Opposition Bloc]. Radio Liberty. 14 September 2014 From 2018, the party became a member of the Opposition Platform — For Life bloc, a pro-Russian political alliance, though the party no longer exists as a result of it being banned.\nUkraine – Forward! is commonly seen in Ukraine as a pro-business party and as representing corporate interests, although during the presidency of Viktor Yanukovych and throughout Euromaidan, the party also campaigned for Yulia Tymoshenko's release from jail.\nHistory\nParty of Human Rights\nThe party traces its history back to 1994 when the Minister of Justice of Ukraine Vasyl Onopenko created his party, Party of Human Rights, which in January 1995 has united with the Social Democratic Party of Ukraine and the Ukrainian Party of Justice, later named as the Social Democratic Party of Ukraine (united). Onopenko became famous for leaving the office of Minister of Justice in protest to the events of 1995 connected with the burial of the Patriarch Volodymyr and became known as the Black Tuesday. A major break up of the party took place in 1998, after which Onopenko once again created a new party.\nUkrainian Social Democratic Party\nThe Ukrainian Social Democratic Party (, Russian: Украинская социал-демократическая партия, УСДП) was founded in 1998 by former members of the Social Democratic Party of Ukraine (united). The first leader of the party was Vasyl Onopenko who in the Presidential elections in 1999 got 0,47% of the votes.\nAt the parliamentary elections on 30 March 2002, the party was part of the Yulia Tymoshenko Electoral Bloc alliance.  Three members of the party were included to the parliamentary faction of the Yulia Tymoshenko Electoral Bloc: Vasyl Onopenko (MP), Volodymyr Levtsun (MP), Anatoliy Semynoha (director of \"Agro-Ros\").\nDuring the parliamentary elections on 26 March 2006 the party also took part in the Yulia Tymoshenko Bloc. Out of 129 seats won by the bloc only eight were given to members of the Ukrainian Social Democratic Party.\n;Top 10 members\n{|\n|-\n|\n* Vasyl Onopenko (MP)\n* Volodymyr Levtsun (MP)\n* Ihor Vorotnyuk (chairman of the Kyiv Oblast party organization)\n* Mykola Kovzel (director of Intertrans)\n* Petro Kravchuk (director of Volyn-Trans)\n|\n* Yevhen Korniychuk (senior instructor at the Diplomatic Academy (MFA of Ukraine))\n* Oleh Lukashuk (MP)\n* Oleksandr Klyus (Head of the party secretariat)\n* Olena Shustik (MP assistant)\n* Nataliya Romanova (MP assistant)\n|}\nIn November 2006 Yevhen Korniychuk became the chairman of the party. He served as the First Deputy Justice Minister in the Second Tymoshenko Government.\nIn the parliamentary elections on 30 September 2007, the party was again part of the Yulia Tymoshenko Bloc., that won 156 out of 450 seats. Again the party only received eight seats in parliament.\n;Top 10 members\n{|\n|-\n|\n* Yevhen Korniychuk (Law firm \"Magister and Partners CIS\")\n* Volodymyr Levtsun (unemployed)\n* Ihor Vorotnyuk (unemployed)\n* Mykola Kovzel (unemployed)\n* Petro Kravchuk (unemployed)\n|\n* Olena Shustik (director of Ukrainian law consulting company)\n* Oleh Lukashuk (unemployed)\n* Oleh Malich (Kyiv mobile mechanized column-2)\n* Serhiy Vlasenko (State Tax Administration of Ukraine)\n* Valeriy Dubil (Rynok-1 (Kyiv))\n|}\nIn August 2011  Korniychuk voluntarily resigned from his post in connection with criminal investigations against him. The leadership of Yulia Tymoshenko Bloc had accused him of working together with their arch-rivals Party of Regions. Former member of All-Ukrainian Union \"Fatherland\" (that party was also a member of the Yulia Tymoshenko Bloc) Natalia Korolevska was elected party leader on 23 December 2011.\nUkraine – Forward!\nParty leader Korolevska was expelled from the “Bloc Yulia Tymoshenko-Batkivshchyna”-faction (formerly BYuT faction) in the Verkhovna Rada (Ukrainian parliament) on 14 March 2012. The same day the party stated on its official website \"We are deeply shocked and outraged by the betrayal of the leadership of the faction \"Bloc Yulia Tymoshenko-Batkivschyna\". These events also made the party leave the Dictatorship Resistance Committee. But it assured it was still \"in opposition to the current regime, the Yanukovych regime\". On 15 March 2012 the Ukrainian Social Democratic Party was expelled from the Yulia Tymoshenko Bloc for alleged \"cooperation with the presidential administration and the ruling regime\".\n;Top 10 members\n{|\n|-\n|\n* Natalia Korolevska (MP)\n* Andriy Shevchenko (footballer)\n* Ostap Stupka (actor)\n* Roman Vasko\n* Elijah Yemets\n|\n* Serhiy Nikulin (MP)\n* Yevhen Suslov\n* Olexiy Kocherov\n* Olexandr Shevtsov\n* Stanislav Zinchenko\n|}\nOn 22 March 2012 party congress the party was renamed Party of Natalia Korolevska \"Ukraine – Forward!\" (, ), known in short as Ukraine – Forward!. Former members of Korolevska's old party All-Ukrainian Union \"Fatherland\" have joined the renamed party since. In June 2012 the party stated it would not cooperate with the Party of Regions in a new parliament.\nThe party did participate in the October 2012 parliamentary elections. In March 2012 the parties popularity in opinion polls had reached a level far below above the election threshold (which was raised to 5% in November 2011) with about 1% of the votes predicted to go to the party but in May 2012 the prediction had increased from 1% to 3.8%. Experts believed the party was gaining potential voters from former supporters of Sergiy Tigipko and his Strong Ukraine. Famed Ukrainian footballer Andriy Shevchenko joined the party immediately after his retirement in July 2012; he took second place on the party list for the October 2012 parliamentary elections. During the campaign for this election the party was one of the biggest spenders. The party official reported it had spent US$7.6 million on the election campaign in multi-member constituencies. Political scientist Artem Bidenko estimated that the party had spent some US$150 million on the campaign. In June 2012 the party was advertising on 320 billboards in Kyiv alone and on 900 across Ukraine. One of their election billboards claimed that “an average wage of 1,000 euros and a pension of 500 euros” was realistic for Ukraine (the monthly average wage was €300 at the time).  An elaborate pre-election campaign for the 2012 Ukrainian parliamentary elections was carried out with massive use of television  , in particular promotional videos  , external media  , press  and even polls  .\nThe election campaign of the \"Ukraine — Forward!\" party, according to experts' estimates as a result of monitoring outdoor and television advertising, cost 150-200 million US dollars. The party filed a lawsuit against the Kyiv International Institute of Sociology (KIIS) and the \"Democratic Initiatives\" foundation for publishing the results of a joint sociological survey, which specifically indicated that 2.1% of voters in 2012 were ready to vote for the party, arguing the number was much higher. In an interview conducted in Russian (the party’s primary language until 2014) with Kommersant’s Ukraine correspondent, Party leader Natalia Korolevska stated:\n{| class=\"wikitable\"\n|«— »\n|}\n''(\"- Sociological wars are conducted before every election, but there has never been anything like this before. That is why after having received the data of the internal opinion polls, which confirmed our 7% of the votes, we decided to take legal action. We think this will help us avoid manipulation. Sociology manipulates people's opinion and is one of the elements of election fraud - people are foisted a fabricated result on them in advance.\n- If the elections show that your rating is much lower than 7%, will you withdraw your lawsuit against KMIS and the Democratic Initiatives Fund?\n- We will not withdraw the lawsuit because we know for a fact that their study was not conducted. And the election will show that our rating is 10%!\")\n-Natalia Korolevska''\nHowever, in the election, despite its vast and widely criticised spending on promotion, the party won 1.58% of the national votes and no constituencies (it had competed in 105 constituencies) and thus failed to win parliamentary representation. On 11 October 2012 the party had filed a lawsuit at Kyiv's economic court against the Democratic Initiatives Foundation and Kyiv International Institute of Sociology with a demand that they retract their reports about the low rating of the party; on 29 November 2012 the party revoked this lawsuit.\nDespite that in June 2012 the party had stated it would not cooperate with the Party of Regions in a new parliament and in October 2012 had threatened Ukrainian President Viktor Yanukovych with impeachment Korolevska became Minister of Social Policy of Ukraine in the Party of Regions lead and appointed by Yanukovych second Azarov Government on 24 December 2012.\nFor the 2014 Ukrainian parliamentary election, the party joined the Opposition Bloc along with other five parties; in these elections Opposition Bloc won 29 seats.\n2012 Manifesto\nDuring the campaign for the 2012 Ukrainian parliamentary election the party promised to relieve small and medium business to the maximum possible extent, “an active part of a fair and efficient state”, “securing social justice and high social standards”, “more welfare” and counteraction against “societal rifts along cultural, linguistic, religious and national lines” and they committed to introduce “total citizen control on all government levels”.\nElections\n{| class=\"wikitable\" style=\"float:right\"\n|- style=\"background-color:#C9C9C9\"\n! colspan=\"9\"|Presidential since 1999(year links to election page)\n|-\n! style=\"width: 20px\"|Year\n! style=\"width: 20px\"|Candidate\n! style=\"width: 60px\"|Votes\n! style=\"width: 20px\"|%\n|-\n! 1999\n|\n|\n|\n|}\n{| class=\"wikitable\" style=\"float:right\"\n|- style=\"background-color:#C9C9C9\"\n! colspan=\"9\"|Parliamentary since 2002(year links to election page)\n|-\n! style=\"width: 20px\"|Year\n! style=\"width: 60px\"|Votes\n! style=\"width: 20px\"|%\n! style=\"width: 20px\"|Mandates\n! style=\"width: 60px\"|Notes\n|-\n! 2002\n|\n|\n|\n| part of Yulia Tymoshenko Bloc\n|-\n! 2006\n|\n|\n|\n| part of Yulia Tymoshenko Bloc\n|-\n! 2007\n|\n|\n|\n| part of Yulia Tymoshenko Bloc\n|-\n! 2012\n|\n|\n|\n| independently\n|-\n!2014\n|\n|\n|\n|part of the Opposition Bloc\n|-\n!2019\n|\n|\n|\n|part of the Opposition Platform — For Life\n|}\nReferences\nExternal links\n*[http://www.ukraina-vpered.com/ Official website]\n*[http://www.facebook.com/pages/%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B0-%D0%92%D0%BF%D0%B5%D1%80%D0%B5%D0%B4/196995357078634 Parties Facebook page (founded on 23 December 2011)]"
    }
  ]
}