{
  "content": [
    {
      "type": "text",
      "text": "# Ulmus of King & Co\n\n' Ulmus of King & Co' nursery, Rayne, are elms grown from cuttings taken in the early 1990s from two to four old trees (accounts vary) surviving in north Essex, England, amidst others afflicted by Dutch elm disease (DED). Photographs of the first source tree, near Braintree, appeared in the press in 2010. The second source tree is known locally as the Lynfields Elm, near Witham. Released in 2010, the saplings are described by the nursery that marketed them as \"English elm\". A 2010 genetic test referred to them as \"English Elm (U. procera)\", an identification presumably supplied by the nursery itself. At Kew, however, three King & Co elms are listed as U. minor Mill., without a cultivar name. The 2010 genetic test found the source trees sampled to be of different genotypes.\nThe Braintree area falls within what R. H. Richens called the Essex hybridization zone, in which, as well as the English Elm clone, variable field elm is present, as well as Ulmus x hollandica (elms of mixed origin).\nThe proprietor of the nursery, who in collaboration with the local tree officer took cuttings, bred 2000 trees via micropropagation. The elms have been sold as forms of \"English elm\" with a \"high resistance\" to DED, covered in the national press and BBC, exhibited by the Royal Horticultural Society, and donated to and accessioned by Kew Gardens.\nDescription\nNo nursery description of the source trees is available. BBC Essex described them as \"smooth-leaved elm\", formerly a common name for Ulmus minor subsp. minor now sunk as simply Ulmus minor, the field elm. The Lynfields elm, Witham, the second of the source trees, has shallow-toothed, elliptical short-shoot leaves (without prominent drip-tip), 2 to 2.5 in long and 1.5 to 2 in wide, on quarter-inch petioles, and vertically-fissured overlapping bark unlike that of old U. procera. It is late into leaf (unlike U. procera) and suckers heavily. The seed is close to the notch (or apex) of the samara.\nPests and diseases\nA degree of 'field resistance' has been noted in a small number of old field elms in areas of high infectivity. The King & Co source trees were reported still in full leaf in 2016, with one of them, the Lynfields elm, still healthy in 2023. However, all eleven King & Co specimens inoculated with the DED pathogen by Dr Jelle Hiemstra, Wageningen University, in the 2015 Noordplant trials in the Netherlands, died rapidly. The six planted in Great Horwood, Buckinghamshire, and near Thame, Oxfordshire, succumbed to DED by 2021.\nCultivation\nUlmus'' of King & Co is only sold in the United Kingdom. Leicestershire County Council had planted 12 saplings by 2010, \"with a view to distributing more to schools\". Three specimens donated in 2010 by King and Co to Kew Gardens were thriving in 2023. Specimens were exhibited by the Royal Horticultural Society in 2011. The original batch of two thousand saplings was reported sold by 2017.\nReferences"
    }
  ]
}