{
  "content": [
    {
      "type": "text",
      "text": "# Ultraman: Towards the Future (video game)\n\n}}\n| genre = Fighting\n| modes = Single-player\n| platforms = SNES\n| series = Ultraman\n}}\nUltraman: Towards the Future, released in Japan as  is a fighting video game developed by Nova and published by Bandai for the Super Nintendo Entertainment System. It is based on the TV series Ultraman, with the Japanese version being based on the 1966 series and the North American version being based on the contemporary Ultraman: Towards the Future series. This game has received mostly negative reviews due to its high difficulty and sub-par graphics.\nPlot\nUltraman Great is the ultimate warrior and protector of peace in the entire universe. For eons he's been fighting an intergalactic battle against Gudis, an evil virus that attempts to wipe out all competing life forms. Now the Gudis virus has infected Earth, producing a horrifying group of giant mutant monsters to carry out its goal of the complete obliteration of every organism on Planet Earth. Ultraman must now battle Gudis and his mutant monsters on Earth. But the Earth's polluted atmosphere poses a threat to Ultraman and he has to become part of a human's molecular structure. Jack Shindo has the ability to transform into Ultraman Great by using his Delta Plasma Pendant (which holds Ultraman within his molecular profile) to transfer his molecules into that of the interstellar hero.\n}}\nEntertainment Weekly gave the game a C− and wrote that \"For those not up-to-date on their superhero merchandisers, Ultraman is the chrome-domed crusader featured in a syndicated TV show and countless product tie-ins. In this game he's pitted against second- and third-string, non-marquee-value Tokyo bashers (Degola, Gudis, a giant mosquito named Majaba) in three-minute rounds. Talk about being faithful to the original — the action here is so stiff you half expect those three silhouettes from Mystery Science Theater 3000 to pop up in the corner of the screen and start making snide comments.\"\nNotes\nReferences"
    }
  ]
}