{
  "content": [
    {
      "type": "text",
      "text": "# UN Working Group on Enforced or Involuntary Disappearances\n\nThe Working Group on Enforced or Involuntary Disappearances has been set up to investigate cases in which persons are detained or killed by states in secret prisons and the corpses are disposed of so that nothing can be proven to them.\nThe UN mandate\nThe UN Human Rights Commission created this body on February 29, 1980 by means of a resolution, which also defined the mandate. This UN mandate is limited to three years and is regularly renewed. After the UN Human Rights Commission was replaced in 2006 by the UN Human Rights Council, it is now in charge and exercising oversight. The last extension of the mandate took place on October 6, 2020.[http://www.undocs.org/A/HRC/RES/45/3]\nThe members of the working group are not United Nations staff but are mandated by the UN  and the UN Human Rights Council has adopted a code of conduct. The independent status of elected representatives is crucial for the impartial performance of their duties. The term of office of a mandate is limited to a maximum of six years.\nThe working group prepares thematic studies and develops guidelines for the improvement of human rights. She makes country visits and can make recommendations in an advisory capacity. Its tasks include examining communications and proposing to States how to remedy any abuses. It also makes follow-up procedures, in which it reviews the implementation of the recommendations. To this end, it draws up annual reports to the attention of the UN Human Rights Council and the UN General Assembly.\nMembers of the WEIGD\n{| class=\"wikitable\" style=\"width:450px;\"\n|-\n! Name !! Country !! Since\n|-\n| Mr. Bernard Duhaime ||  || 2014\n|-\n| Mr. Tae-Ung Baik ||  || 2015\n|-\n| Ms Houria Es-Slami ||  || 2014\n|-\n| Mr. Henrikas Mickevičius ||  || 2015\n|-\n| Mr. Luciano A. Hazan ||  || 2017\n|}\nRelevant international human rights instruments\nRefer to the International Convention for the Protection of All Persons from Enforced Disappearance.\nReferences\nExternal links\n* [https://www.ohchr.org/EN/Issues/Disappearances/Pages/DisappearancesIndex.aspx Working Group on Enforced or Involuntary Disappearances]"
    }
  ]
}