{
  "content": [
    {
      "type": "text",
      "text": "# Una, Republic of Dagestan\n\n| subdivision_type1  = Federal subject\n| subdivision_name1  = Republic of Dagestan\n| subdivision_type2  = District\n| subdivision_name2  = Rutulsky District\n| subdivision_type3  = Rural settlement\n| subdivision_name3  = Shinazsky Selsoviet\n| population_total   = 14\n| population_as_of   = 2021\n| postal_code        = 368700\n| coordinates        =\n| pushpin_map        = Russia Dagestan#Russia\n| pushpin_map_caption= Location in Dagestan\n}}\nUna (Rutulian: Una) was a rural locality (a selo) in Rutulsky District of the Republic of Dagestan, Russia.\nAccording to the charter of the municipal district \"Rutulsky District,\" it was part of Shinazsky Selsoviet.\nGeography\nThe village was located in the valley of the Shinazchay River, on the southern slope of the Samur Ridge, 15 km northwest of the district center Rutul.\nPopulation\nThe village was abandoned in the 1990s. It was formerly a Rutulian village.\nHistory\nIn 2013, specialists from the Institute of Archaeology of the Dagestan Scientific Center of the Russian Academy of Sciences carried out a survey of the abandoned settlement of Una in the Shinaz Valley.\nThe main goal of the survey was to confirm the presence of a mine (locally known as the \"Una cave\") where copper-bearing ore had been extracted during the Bronze Age.\nChemical analysis of ore samples showed high concentrations of copper, as well as iron, chromium, and nickel.\nDuring the study, researchers also documented the ruins of the settlement, a fortress on a hilltop, defensive structures, a spiral stone stairway leading to the fortress, old cemeteries with various types of tombs, and sacred sites with different constructions.\nBased on the collected archaeological material, the age of the settlement was estimated at over 7,000 years.\nThis is currently the only known mine in Dagestan where copper ore was extracted. Until its discovery, archaeologists had found Bronze Age artifacts, furnaces used for smelting, and fragments of metallurgical equipment in Dagestan, but the actual source of the ore had remained unknown.\nReferences"
    }
  ]
}