{
  "content": [
    {
      "type": "text",
      "text": "# Undeclared war__disambig_1\n\nAn undeclared war is a military conflict between two or more nations without either side issuing a formal declaration of war. The term is sometimes used to include any disagreement or conflict fought about without an official declaration. Since the United Nations' police action in the Korean War, some governments have pursued disciplinary actions and limited warfare by characterizing them as something else such as a military action or armed response.\nUnder customary international law, it is not necessary to declare war—simply beginning hostilities is sufficient to make belligerent intentions clear.\nUnited States\nThere is no specific format required under United States law for the way an official war declaration will be structured or delivered. The United States Constitution states: \"The Congress shall have Power […] To declare War, grant Letters of Marque and Reprisal, and make Rules concerning Captures on Land and Water\".\nAs of September 2024, the United States Congress has formally declared war 11 times, and has not done so since 1942; 6 of these were WWII declarations. The United States did not declare war during its involvement in Vietnam, although the Gulf of Tonkin Resolution authorized the escalation and use of military force in the Vietnam War without a formal declaration of war. On at least 125 occasions a US president has employed military forces without authorization from Congress. One of the most significant of these occasions was the Korean War, where the United States led a peacekeeping United Nations force to stop North Korea's invasion against South Korea. The conflict resulted in over 142,000 American casualties (about 40,000 deaths and over 100,000 injuries).\nRusso-Ukrainian war\nNo formal declaration of war has been issued in the ongoing Russo-Ukrainian war. When the Russian president, Vladimir Putin, launched the full-scale invasion of Ukraine in 2022, he used the euphemistic phrase 'special military operation.' Ukraine did not declare war on Russia either, though it has been fighting Russia in some capacity since Russia invaded eastern provinces in 2014.\nOther examples\nThe Falklands War between Argentina and the United Kingdom (April–June 1982) was never formally declared as a war.\nSee also\n* Proxy war\n* Police action\nReferences"
    }
  ]
}