{
  "content": [
    {
      "type": "text",
      "text": "# UNESCO/Bilbao Prize for the Promotion of a Culture of Human Rights\n\nThe UNESCO/Bilbao Prize for the Promotion of a Culture of Human Rights, created in 1978 as the UNESCO Prize for Human Rights Education to mark the 30th anniversary of the adoption of the Universal Declaration of Human Rights, serves to honour the efforts of organizations or individuals that have made an exemplary contribution to the advancement of knowledge on human rights and building a universal culture of human rights. It was renamed on 5 May 2008 under the terms of a memorandum of understanding with Mayor of Bilbao Iñaki Azkuna whereby the municipality of Bilbao agreed to fund the prize for a period of three years.\nThe prize winner and the other candidates selected for honourable mention are chosen by the UNESCO Director General from a short-list chosen by an international jury composed of six public figures representing the different regions of the world.\nNow awarded every second year, the prize is worth US$25,000 and is accompanied by a trophy created by Japanese artist Toshimi Ishii. Winners are announced on 10 December, United Nations Human Rights Day.\nPast winners\n*2019: Romina Knightsdale, Brazil.\n*2018: Gonzalo Franco, Spain.\n*2012: Archbishop Desmond Tutu, South Africa.\n*2010: Asma Jahangir, Pakistan.\n:Honourable mentions: Corporación Parque por la Paz Villa Grimaldi, Chile; Fundación Cultura de Paz, Spain; France terre d’asile & Fédération internationale Musique Espérance, France\n*2008: Stéphane Hessel, France.\n:Honourable mention: ATD Fourth World, France.\n*2006:[https://web.archive.org/web/20061221152217/http://portal.unesco.org/shs/en/ev.php-URL_ID%3D10445%26URL_DO%3DDO_TOPIC%26URL_SECTION%3D201.html] Centre for Human Rights, University of Pretoria, South Africa.\n:Honourable mentions: European Master's Programme in Human Rights and Democratisation, European Inter-University Centre for Human Rights and Democratisation, Venice, Italy; One World International Human Rights Documentary Film Festival, Czech Republic.\n*2004:[http://portal.unesco.org/shs/en/ev.php-URL_ID=6997&URL_DO=DO_TOPIC&URL_SECTION=201.html]  Professor Vitit Muntarbhorn, Chulalongkorn University, Bangkok, Thailand; United Nations Special Rapporteur.\n:Honourable mentions: Anatoly Azarov, Russian Federation; David Jan McQuoid-Mason, South Africa; Oslo Coalition on Freedom of Religion or Belief, Norway; Peruvian Institute of Education in Human Rights and Peace, Peru.\n*2002:[http://www.unesco.org/bpi/eng/unescopress/2002/02-92e.shtml] Academia Mexicana de Derechos Humanos, Mexico City, Mexico.\n:Honourable mentions: Institut des droits de l'homme et de promotion de la démocratie (IDH), Benin; İonna Kuçuradi, Hacettepe University, Ankara, Turkey; Nyameko Barney Pityana, President of South Africa's Human Rights Commission.\n*2000:[http://www.unesco.org/bpi/eng/unescopress/2000/00-136e.shtml] City of Nuremberg, Germany.\n:Honourable mentions: Flor Alba Romero, Colombia;  Associated Schools Project, Pakistan; Hurights Osaka, Japan.\n*1998:[http://www.unesco.org/bpi/eng/unescopress/98-273e.htm] Justice Michael Kirby, High Court, Australia.\n:Honourable mentions: Jaime Castillo Velasco, Chile; Raoul Wallenberg Institute of Human Rights and Humanitarian Law, Sweden.\n*1996:[http://www.unesco.org/op/eng/unescopress/97-02e.htm] Former President Jean Bertrand Aristide, Republic of Haiti.\n:Honourable mention: Gloria Ramírez, Academia Mexicana de Derechos Humanos, Mexico.\n*1994: José Zalaquett Daher of Chile, and the Philippine Commission of Human Rights.\n*1992: Arab Institute of Human Rights, Tunis, Tunisia.\n*1990: Václav Havel, Czech Republic.\n*1988: Asamblea Permanente de los Derechos Humanos, Bolivia.\n*1986: Héctor Fix Zamudio, Mexico.\n*1983: Felix Ermacora, Austria.\n*1981: Ali Sadek Abou-Heif, Egypt.\n*1979: Paul Morren, Belgium.\n*1978: Mümtaz Soysal, Turkey.\nReferences\nExternal links\n*[http://www.unesco.org/shs/human_rights_prize UNESCO/Bilbao Prize for the Promotion of a Culture of Human Rights]"
    }
  ]
}