{
  "content": [
    {
      "type": "text",
      "text": "# Union Monument, Iași__disambig_1\n\nUnion Monument (), a monument of white marble in the Romanian city of Iaşi, was designed by Princess Olga Sturdza and unveiled in 1927 at the base of Carol Boulevard. It consists of a central piece (the Motherland) and four smaller ones representing the historic provinces of Transylvania, Bessarabia and Bukovina (incorporated into Romania at the end of World War I) and the Romanian diaspora. Demolished in 1947 as the Romanian Communist Party was tightening its grip on the country, it was rebuilt in 1999, this time being placed in Piaţa Naţiunii, in front of the Grigore T. Popa University of Medicine and Pharmacy.\nHistory\nOn 1 August 1924, Princess Olga Sturdza sent a letter to the Iaşi mayor's office, expressing her intention to donate to the city a marble monument symbolizing the Great Union of 1918:\nThe monument was to be placed at the entrance to the palace of the great logofăt Dumitrache Cantacuzino-Paşcanu, at the end of Carol I (later Copou) Boulevard, where Queen Marie lived when the Romanian government moved to Iaşi (1916–1918), but as it was too bulky, it was agreed to place it elsewhere. Installation work began in 1925, at the Foundation intersection (at the base of Carol Boulevard). The components of the work were executed in the Copou neighbourhood, some parts being kept in Copou Garden until they were assembled.\nThe pedestal was of stone brought from Corbăul Clujului quarry and had four sides, its execution being entrusted to the Bucharest entrepreneur Leonardo Martinez. The following words were inscribed into the left side: \"The greatest desire, the most general, that which has nourished all past generations, that which is the soul of the present generation, that which, fulfilled, will gladden future generations is union! Ad hoc divan of Moldavia, 7 October 1858\".\nOn the right side were words spoken by Alexandru Ioan Cuza on 29 January 1859: \"The union of the crowns of Stephen the Great and Michael the Brave is the triumph of a great principle, which lives with vigour in the hearts of Romanians: the principle of Romanian brotherhood. It has saved us from perdition in the past, it revives us at the present time, it shall lead us to good things and greatness in the future. Long live Romanian brotherhood! Long live the Romanian Principalities!\"\nOn the front side were inscribed the words of King Ferdinand, spoken on 5 December 1918: \"I declare that all lands inhabited by Romanians, from the Tisa to the Nistru, to be united for the ages in the Kingdom of Romania. Through fights and sacrifices, God has granted us to realise today our most holy aspirations. Let us consecrate the union of thoughts, of souls, but also the union in fruitful labour by shouting: Long live Greater Romania, strong and united!\"\nFinally, on the back side were carved Olga Sturdza's words: \"To the united people of Romania and to Iaşi &ndash; the cradle of unions &ndash; I offer this work of my heart and my hands. Olga I. Sturza. 29 May 1927\".\nThe central piece \"represents the Motherland, an image for which Queen Marie accepted that her face be reproduced\". Each province is shown as a daughter being embraced by their mother. Beside the daughters, near the bottom of a statue, there is a kneeling child who wishes to return to Mother Romania. He represents all Romanians left outside the borders decided in 1919.\nFor the four children, Sturdza had found representative faces among the schoolgirls of the Mihail Sturdza Normal School of Iaşi. However, newspapers of the day claimed that the feminine figures in fact depicted the queen's daughters, the princesses Elisabeth, Maria and Ileana, and that the little boy was based on Prince Mircea, who had died at the age of three in 1916, at the beginning of the war, and remained buried in Bucharest.\nThe Union Monument was unveiled on Sunday, 29 May 1927, at 10:15 am, before Queen Marie, Princess Ileana (King Ferdinand's daughter), Princess Helen (wife of prince Carol) and the young crown prince Michael. Ferdinand, who would die that 20 July, was gravely ill and thus did not attend. After this monument was unveiled, the royal delegation took part in the unveiling of the Attacking Cavalryman Statue at 11:30.\nSome reactions were negative at the time. For instance, one journalist wrote: \"...a culinary work of whipped cream. One can tell a woman's hand in this. A group of five backsides is depicted.\"\nIn 1947, the year the Paris Peace Treaties confirmed Romania's loss of Bessarabia and northern Bukovina to the Soviet Union, the Armistice Committee ordered the monument's demolition.\nReconstruction\nThe Nation Square. Union Monument in the foreground; behind it the University of Medicine and Pharmacy.\nOn 8 February 1994, in the great hall of Iaşi city hall, a committee met and decided to rebuild the monument, among the initiators of the project being mayor Constantin Simirad. The project was financed by Olga Sturdza's direct descendant Prince Dimitrie Sturdza, a Swiss businessman, who together with his family helped finance the new group of statues.\nBetween 1995 and 1999, the sculptor Constantin Crengăniş paid by the Iaşi mayoralty, reconstructed the monument based on photographs. The pedestal was made from the same piece of marble as the statues, unlike the original, which had a stone base.\nThe monument was placed on a circular base made of slabs of white and gray marble. It was placed in Piaţa Naţiunii, in front of the Grigore T. Popa University of Medicine and Pharmacy in Iaşi, because in 1957 a statue of Mihai Eminescu was installed in the previous location. On 1 December 1999, the monument was blessed in the presence of Daniel Ciobotea, Metropolitan of Moldavia and Bukovina; Simirad and Dimitrie Sturdza were also in attendance.\nOn the back side, beneath the words of Olga Sturdza carved into the pedestal, the following words were inscribed: \"We have rebuilt this monument as a sign of homage and recognition toward those who fought, are fighting and will fight for the joining together and the unity of the Romanian people. Mayoralty of the Municipality of Iaşi. Redone by Constantin Crengăniş, 1995-1999.\"\nGallery\nFile:Monumentul Unirii din Iaşi3 2.jpg|Monument in front of the University\nFile:Monumentul Unirii din Iaşi4.jpg|Closer view\nFile:Monumentul Unirii din 1918.jpg|Close-up\nFile:Monumentul Unirii din Iaşi5.jpg|Back view\nNotes\nReferences\n* Mitican, Ion. Urcînd Copoul cu gîndul la Podul Verde. Ed. Tehnopress, Iaşi, 2006.\nExternal links\n*  [https://web.archive.org/web/20071007125359/http://www.itcnet.ro/history/archive/mi2000/current3/mi47.htm Constantin Ostap, “Minunea albă revine în Iaşi” (“The White Marvel Returns to Iaşi”)], \"Magazin Istoric\", nr. 3/2000."
    }
  ]
}