{
  "content": [
    {
      "type": "text",
      "text": "# Union of South Africa Queen's Medal for Bravery, Silver\n\nSouth Africa\n| type             = Civil decoration for bravery\n| eligibility      = South African citizens and others\n| awarded_for              = Acts of conspicuous bravery\n| campaign         =\n| status           = Discontinued in 1961\n| description      =\n| clasps           =\n| established      = 1952\n| firstawarded      = 1953\n| lastawarded       = 1953\n| total_awarded            = 1\n| total_awarded_posthumously       =\n| total_recipients       = Mr Lauritz Richard Nilsen\n| individual       =\n| precedence_label = British & South African orders of wear\n| higher           =\n| same             =  Union of South Africa King's Medal for Bravery, Silver Woltemade Decoration for Bravery, Silver\n| lower            =\n| image2       =\n| caption2     = Ribbon bar\n}}\nThe '''Union of South Africa Queen's Medal for Bravery, Silver''' is the lesser of two classes of a South African civil decoration for acts of bravery that was in use from 1952 to 1961, while the country was still a constitutional monarchy in the British Commonwealth. The decoration was instituted by Queen Elizabeth II on 15 December 1952.\nInstitution\nThe Union of South Africa Queen's Medal for Bravery, Silver, the lesser of two classes of South Africa's highest civilian decoration for bravery, was instituted by Royal Warrant of 15 December 1952, published in Government Gazette no. 5013 dated 27 February 1953. The medal replaced the Union of South Africa King's Medal for Bravery, Silver, after the accession to the British Throne of Queen Elizabeth II on 6 February 1952.\nAward criteria\nThe earlier King's Medal for Bravery, Silver was awarded to recognise acts of gallantry performed in the face of imminent and obvious peril by those residents of the Union of South Africa or its dependent territories who endangered their lives in the act of saving, or endeavouring to save, the lives of others. Upon the institution of the Queen's Medal for Bravery, Silver, the conditions of eligibility that had applied to the King's Medal were expanded to include non-citizens of the Union for acts of gallantry within the Union or while saving or endeavouring to save the lives of citizens of the Union elsewhere.\nOrder of wear\nIn the British order of precedence, the Union of South Africa Queen's Medal for Bravery, Silver ranks as a third level decoration, equivalent to the Queen's Gallantry Medal. It is preceded in order of wear by the Indian Distinguished Service Medal and succeeded by the Distinguished Service Medal.\nIn South Africa, the medal is ranked as a second level decoration and, despite its status, it has no post-nominal letters. It is preceded by the Louw Wepener Decoration and succeeded by the South African Police Cross for Bravery.\nThe medal ranks on par with the earlier Union of South Africa King's Medal for Bravery, Silver and the subsequent Woltemade Decoration for Bravery, Silver.\nDescription\n;Obverse\n:The decoration is struck in silver and is a disk, 38 millimetres in diameter with a raised rim and a large ring suspender. The obverse depicts the crowned effigy of Queen Elizabeth II, facing right and surrounded by the inscription \"ELIZABETH II DEI GRATIA REGINA F. D.\" around the perimeter.\n;Reverse\n:The reverse is identical to that of the King's Medal for Bravery, Silver and depicts the 18th-century Cape hero Wolraad Woltemade on his horse, rescuing shipwreck survivors from a stormy sea. The image is circumscribed around the top in English and Afrikaans with the words \"FOR BRAVERY • VIR DAPPERHEID\".\n;Ribbon\n:The ribbon is also identical to that of the King's Medal for Bravery, Silver, 44 millimetres wide and dark blue with 4½ millimetres wide orange edges.\nDiscontinuation\nThe Union of South Africa Queen's Medal for Bravery, Silver was discontinued upon the establishment of the Republic of South Africa on 31 May 1961. It was succeeded by the Woltemade Decoration for Bravery, Silver that was instituted on 20 May 1970.\nRecipient\nOnly one award of the Union of South Africa Queen's Medal for Bravery, Silver was made, gazetted on 27 March 1953, to Mr Lauritz Richard Nilsen, who saved a friend who had been swimming and whose leg had been bitten off by a shark at Winklespruit in Natal.\nReferences"
    }
  ]
}