{
  "content": [
    {
      "type": "text",
      "text": "# Union Böckingen__disambig_1\n\nUnion Böckingen is a German sports club from the district of Böckingen in the city of Heilbronn, Baden-Württemberg. Founded in 1908 out of the merger of Fussball Klub Germania 08 Böcking and Viktoria Böcking, the club today has 1,200 members in departments for canoeing, handball, and skiing. The footballers made up the largest section in the club with nearly 600 members. The most successful department is the canoe section which has won medals at the national and world championships.\nIn 2012 the football department of the club left to merge with FC Heilbronn to form a new club, the FC Union Heilbronn.\n__TOC__\nHistory\nAfter having played in the tier-one Kreisliga Württemberg (1920–22) and then the Bezirksliga Württemberg-Baden (since 1926) and winning the title there in 1931, Union's most significant football achievement was their 1933 championship in the Gauliga Württemberg, one of 16 top-flight divisions formed that year in the reorganization of German football under the Third Reich. That title put the team into the opening round of the national finals in a qualifying group that included SV Waldhof Mannheim, Mühlheimer SV, and Kickers Offenbach where they won only two of six matches. The next year the Böckingen side crashed to a ninth place finish and were relegated. They immediately bounced back and earned a string of upper table finishes before again being sent down for a single season in 1941–42. After two more seasons in the Gauliga the team withdrew from competition in November 1944 as World War II overtook the country. In 1938, Böckingen took part in the opening round of the Tschammerpokal, predecessor of today's German Cup, where they were put out by Bayern Munich (0:7).\nFollowing the conflict, Böckingen played in the Amateurliga Württemberg (II). A second place finish there in 1950 was followed by a failed promotion attempt, and a poor campaign in the subsequent season saw the club fall from the 2. Liga Süd to the now third tier Amateurliga Württemberg. They returned to second division play for a two-year turn before slipping into lower level competition for most of the 50s. They reemerged in the Amateurliga Nordwürttemberg in 1963 and spent all but one of the next 14 seasons there. Second place results in 1966 and 1970 earned the team a place in the opening rounds of the national amateur championship. They also made their second appearance in the German Cup, again bowing out in the first round, this time to Bayer Uerdingen (2:8). Following the 1977–78 season Union descended to lower level play.\nIn recent years, the club has been a steady member of the tier eight Bezirksliga Unterland, spending a year in the Landesliga in 2004–05 and briefly dropping down to the Kreisliga in 2010–11, but each time returning to the Bezirksliga straight away. The 2010–11 season saw the team earnining promotion back to this league by winning 25 out of its 28-season games and only being defeated once.\nIn 2012 the football department of the club left to merge with FC Heilbronn to form a new club, the FC Union Heilbronn. Both clubs voted on the merger on 27 March 2012 and achieved the necessary 75 percent majority to carry out the merger, ending the history of the football department of Union Böckingen.\nHonours\n*Gauliga Württemberg (I)\n** Champions: 1933\n*Bezirksliga Württemberg-Baden (I)\n** Champions: 1931\n*Amateurliga Württemberg (III)\n** Champions: 1952, 1958\n* Bezirksliga Unterland (VII)\n** Champions: 2004\n* Kreisliga Unterland A3 (IX)\n** Champions: 2011\nRecent seasons\nThe recent season-by-season performance of the club:\n{| class=\"wikitable\"\n! Season\n! Division\n! Tier\n! Position\n|- align=\"center\"\n| 2003–04\n| align=\"left\"| Bezirksliga Unterland\n| VII\n| style=\"background:#ddffdd\"| 1st ↑\n|- align=\"center\"\n| 2004–05\n| align=\"left\"| Landesliga Württemberg I\n| VI\n| style=\"background:#ffcccc\"| 15th ↓\n|- align=\"center\"\n| 2005–06\n| align=\"left\"| Bezirksliga Unterland\n| rowspan=3| VII\n| 5th\n|- align=\"center\"\n| 2006–07\n| align=\"left\"| Bezirksliga Unterland\n| 2nd\n|- align=\"center\"\n| 2007–08\n| align=\"left\"| Bezirksliga Unterland\n| 11th\n|- align=\"center\"\n| 2008–09\n| align=\"left\"| Bezirksliga Unterland\n| rowspan=2| VIII\n| 11th\n|- align=\"center\"\n| 2009–10\n| align=\"left\"| Bezirksliga Unterland\n| style=\"background:#ffcccc\"| 15th ↓\n|- align=\"center\"\n| 2010–11\n| align=\"left\"| Kreisliga Unterland A3\n| IX\n| style=\"background:#ddffdd\"| 1st ↑\n|- align=\"center\"\n| 2011–12\n| align=\"left\"| Bezirksliga Unterland\n| VIII\n| 2nd\n|}\n* With the introduction of the Regionalligas in 1994 and the 3. Liga in 2008 as the new third tier, below the 2. Bundesliga, all leagues below dropped one tier.\n{|class=\"wikitable\" align=\"center\"\n| style=\"background:#ddffdd\"| ↑ Promoted\n| style=\"background:#ffcccc\"| ↓ Relegated\n|}\nReferences\nExternal links\n*[http://www.union-boeckingen.de Official team site]\n*\n*[http://www.f-archiv.de/ Das deutsche Fußball-Archiv] historical German domestic league tables"
    }
  ]
}