{
  "content": [
    {
      "type": "text",
      "text": "# United Kingdom Pavilion at Epcot__disambig_1\n\n| type                = Themed pavilion\n| manufacturer        =\n| designer            =\n| model               =\n| theme               = English village\n| music               =\n| custom_label_1      = Sponsor\n| custom_value_1      =  Bass Brewery\n| custom_label_2      =\n| custom_value_2      =\n| custom_label_3      =\n| custom_value_3      =\n| custom_label_4      =\n| custom_value_4      =\n| custom_label_5      =\n| custom_value_5      =\n| custom_label_6      =\n| custom_value_6      =\n| custom_label_7      =\n| custom_value_7      =\n| custom_label_8      =\n| custom_value_8      =\n| accessible          =\n| transfer_accessible =\n| assistive_listening =\n| cc                  =\n}}\nUnited Kingdom is a cultural pavilion representing the four countries within the island country of the same name (England, Scotland, Wales and Northern Ireland) as part of the World Showcase area of EPCOT at the Walt Disney World Resort near Orlando, Florida. It is located between the France and Canada pavilions along the World Showcase Lagoon.\nLayout\ncottage]]\nThe buildings in the United Kingdom Pavilion represent the architectural history of the United Kingdom, ranging from a building inspired by Hampton Court Palace to another inspired by Anne Hathaway's Cottage. There are also Tudor, Georgian and Victorian styles present. There are English Gardens which include a hedge maze and a band stand.\nThe shops sell British items such as tea, biscuits, toys, clothing, sports apparel and Beatles merchandise.\nGilbert-Scott telephone boxes line a rose garden near the pavilion's restrooms and there is often a direct connection on these phones to a similar box in the Canada pavilion nearby.\nA band called the British Revolution performs British rock music covers from acts such as the Police, the Rolling Stones, the Beatles, Blur and Led Zeppelin.\nAt the 2019 D23 Expo, an expansion to the Pavilion based on the Disney Mary Poppins films was announced with a new neighborhood based on Cherry Tree Lane, serving as the façade for a Mary Poppins attraction. But the project was postponed indefinitely due to the COVID-19 pandemic. In 2023, the concept art and plans for the attraction were leaked on a former Imagineer's portfolio indicating the attraction would be an indoor teacups experience taking design cues from Mary Poppins Returns.\nAttractions and services\nCurrent attractions\n* DuckTales World Showcase Adventure (2022 – present)\nUpcoming attractions\n* Unnamed Mary Poppins attraction (TBD)\nFormer attractions\n* Kim Possible World Showcase Adventure (2009 – 2012)\n* Agent P's World Showcase Adventure (2012 – 2020)\nDining\n*Rose & Crown Pub and Dining Room: houses both a British-style pub, serving British (and some European and domestic) brews and a dining room that is both indoor and outdoor. There is a piano player indoors, and outdoors, the nightly fireworks spectacular on the World Showcase Lagoon can be viewed. Dishes offered include scotch egg, shepherd's pie, fish and chips. For dessert the Rose & Crown offers Jaffa Cakes, banoffee pie, and rhubarb tart. The pub offers beers and ciders from Britain and Ireland. The pub also offers a number of cocktails and blends.\n* Yorkshire County Fish Shop: quick-service fish and chip counter restaurant serving only fish, chips and shortbread. Drinks, including Bass Ale and Harp Lager are available. Seating is outdoors only.\nShopping\n* The Toy Soldier: toys and memorabilia usually associated with the UK, such as Noddy, the Beatles, Paddington Bear, Doctor Who, Sherlock, Thomas the Tank Engine, Winnie the Pooh, Peppa Pig, the Rolling Stones, Jive Bunny and the Mastermixers, Wallace & Gromit and BabyTV. There are also traditional wooden toys as well as Disney merchandise.\n* The Crown and Crest: Keep Calm and Carry On merchandise, including, books, shirts, cups and mugs.\n* Historic Research Center (HRC): coats-of-arms, swords, other merchandise and lets you look at the history of your last name.\n* '''Sportsman's Shoppe: football team apparel from various teams and books. This shop also sells Guinness merchandise.\n* The Tea Caddy: Twinings tea, teacups, teapots and British confectionery.\n* UK Cart: Walt Disney World trading pins, lanyards, Minnie and Mickey Mouse plush toys, shot glasses and UK shirts.\nEntertainment\n* British Revolution: band playing British rock music from the 1960s through the 1990s.\n* Disney characters': throughout the day, characters from British-based Disney features (Mary Poppins, Alice in Wonderland, Peter Pan, Brave, and The Many Adventures of Winnie the Pooh'') appear to meet with guests.\nFormer\n* The Hat Lady: piano player in the Rose & Crown\n* World Showcase Players: roving comedy show (closed in 2014)\nGallery\nFile:Epcotuk.jpg|Miniature replica of Hampton Court Palace in Greater London\nFile:Epcotuk3.jpg|Replica of streets in a traditional English village\nFile:Epcotuk4.jpg|Replica of streets in a traditional English village\nFile:Epcotuk2.jpg|Replica of gardens in a traditional English town\nFile:EpcotUKBuliding.JPG\nReferences\nExternal links\n* [http://disneyworld.disney.go.com/parks/epcot/attractions/united-kingdom-pavilion/ Walt Disney World Resort - United Kingdom Pavilion]\n* [http://disneyworld.disney.go.com/parks/epcot/dining/rose-and-crown-dining-room/ Walt Disney World Resort - Rose & Crown Pub & Dining Room]\n* [http://disneyworld.disney.go.com/parks/epcot/entertainment/the-british-revolution/ Walt Disney World Resort - British Revolution]"
    }
  ]
}