{
  "content": [
    {
      "type": "text",
      "text": "# United Kingdom National Nuclear Laboratory\n\n| key_people       = Prof. Paul Howarth (chief executive officer)\n| industry         = Nuclear services and technology\n| products         =\n| revenue          =\n| operating_income =\n| net_income       =\n| aum              =\n| assets           =\n| equity           =\n| owner            = Department for Energy Security and Net Zero\n| num_employees    = approx 800\n| parent           = NNL Holdings Limited\n| divisions        =\n| subsid           =\n| homepage         =\n| footnotes        =\n| intl             =\n}}\nThe United Kingdom National Nuclear Laboratory (UKNNL, formerly National Nuclear Laboratory and earlier Nexia Solutions) is a UK government owned and operated nuclear services technology provider covering the whole of the nuclear fuel cycle. It is fully customer-funded and operates at six locations in the United Kingdom. Its customers have included the Nuclear Decommissioning Authority, Sellafield Ltd, Westinghouse, the Health and Safety Executive, the Ministry of Defence, the UK Atomic Energy Authority, VT Nuclear and British Energy. It also has links with academia, including collaborative agreements on waste immobilisation and disposal with the University of Sheffield and on nuclear materials research with the University of Manchester.\nHistory\nThe organisation began to come together in 1996 when a number of separate research and development facilities began to coalesce into a single unit within British Nuclear Fuels (BNFL). In 2003, this research and technology business was re-launched as Nuclear Sciences and Technology Services (NSTS) to ready the business for transformation into a fully commercial entity. In 2005, following the restructuring of the wider nuclear industry, Nexia Solutions was formed out of NSTS, as a wholly owned subsidiary of BNFL.\nIn July 2006, the UK Government stated its intention to preserve and develop key research and development capabilities potentially as part of a National Nuclear Laboratory (NNL). In October 2006, Secretary of State for Trade and Industry, Alistair Darling, announced the establishment of the NNL, to be based on Nexia Solutions and the British Technology Centre at the Sellafield facility.\nNNL was formally announced by John Hutton, Secretary of State for Business, Enterprise and Regulatory Reform in an announcement at the Sellafield Visitors Centre on 23 July 2008.\nOn 23 March 2009 it was announced by the Department of Energy and Climate Change (DECC) that a consortium made up of Serco, Battelle and the University of Manchester had been selected as the new management contractors for the NNL. The contract was for an initial three-year period with options to be extended by up to two years. DECC had been engaged in competitive dialogue with the winning consortium as well as QQEST, a joint venture between QinetiQ and EnergySolutions, since October 2008.\nThe management contract commenced on 1 April 2009, when ownership of the NNL transferred from BNFL directly to DECC with shareholder responsibilities delegated to the Shareholder Executive. Mike Lawrence of Battelle was appointed to lead the new NNL management team as managing director. He had more than 40 years of experience in the nuclear profession, including management of the United States Hanford Reservation and its massive site clean-up program, and his former role as the US representative on nuclear matters to the International Atomic Energy Agency. Mike Lawrence retired in December 2010 and was replaced by Professor Paul Howarth, formerly NNL's Director of Science, Technology and Project Delivery. On 1 October 2013, the management contract expired, and the NNL became operated directly by the UK Government.\nIn December 2024 the organisation was renamed United Kingdom National Nuclear Laboratory, and began using the royal coat of arms.\nOther information\n* Nexia Solutions won Royal Society for the Prevention of Accidents's (RoSPA) Sector Award five times between 2004 and 2008.\n* The NNL won the IChemE HFL Excellence in Health and Safety Award in 2008.\n* The NNL is responsible for the development of the RadBall technology.\nSee also\n* China National Nuclear Corporation\nReferences\nExternal links\n*"
    }
  ]
}