{
  "content": [
    {
      "type": "text",
      "text": "# United Packinghouse Workers of America\n\nThe United Packinghouse Workers of America (UPWA), later the United Packinghouse, Food and Allied Workers, was a labor union that represented workers in the meatpacking industry.\nOrigin as the PWOC\nBackground\nBetween the mid-1800s and mid-1900s, the Midwestern United States supplied nearly all the nation's beef and pork. The companies supplying this meat were known as the \"Big Four\" of meatpacking. The companies that made up the \"Big Four\" were Armour, Swift, Wilson, and Cudahy. Butchers at \"Big Four\" stockyard plants in Chicago, Kansas City, and Omaha formed the backbone of the Amalgamated Meat Cutters and Butcher Workmen (AMCBW). The AMCBW was chartered by the  American Federation of Labor in 1897, and was the original labor union to represent retail butchers and packinghouse workers. In the early years of the twentieth century the AMCBW experienced some success, however the union was very divided and unorganized, and lost two major strikes in 1904 and 1921–1922. After experiencing failure in the nationwide strike of 1921–1922, the AMCBW lost many members. After the passage of the National Industrial Recovery Act in 1933, the AMCBW started gaining back more members, however it was not as successful as new packinghouse unions of the Congress of Industrial Organizations (CIO).\nPWOC\nThe Packinghouse Workers Organizing Committee (PWOC) was chartered by the CIO, and established on October 24, 1937. The PWOC organized locals throughout the nation with the greatest concentrations in the Midwestern and Great Plains states. Like many unions in the CIO, the PWOC tried to organize all workers in a given plant regardless of skill or trade (see industrial unionism). Unlike the AMCBW, the PWOC recruited not only butchers, but also masses of unskilled packinghouse laborers. The formation of the PWOC gave direction and coherence to a previously fragmented movement. The PWOC provided more organization and structure, thus allowing union activists from different plants and different cities to coordinate movements. The PWOC was very successful in recruiting African American workers, who dominated the packinghouses in Chicago and Kansas City. It was also successful in recruiting rural white workers, and succeeded in overcoming ethnic and racial antagonisms that had plagued similar, previous efforts. Active in both black and white neighborhoods, the PWOC functioned as an important social and cultural institution in addition to its primary role as a union. In 1943 the PWOC was officially chartered as the UPWA.\nUPWA\nEarly Years of the UPWA\nIn October 1943, the PWOC officially became the UPWA.  Its headquarters was located in Chicago. The UPWA's rival union was the Amalgamated Meat Cutters and Butcher Workmen, an older AFL craft union. The Amalgamated Meat Cutters and Butcher Workmen was a conservative union, whereas the UPWA was a more radical, left wing union. In the 1940s, the UPWA won nationwide contracts with companies including all members of the \"Big Four\" of meatpacking: Armour, Swift, Wilson, and Cudahy. Contracts for members of the UPWA were generally more stable than those of the AMCBW. They also offered better working conditions. Outside of labor rights, the Chicago local of the UPWA was a major driving force behind the Back of the Yards Neighborhood Council founded in Chicago in 1939, the first example of Saul Alinsky's method of community organizing.\nAnti-Discrimination Efforts\nRace\nThe UPWA was committed to interracial cooperation, and starting in 1949 the union began pursuing anti-discrimination activities. In 1950, the UPWA created an Anti-Discrimination Department, dedicated to ending racial discrimination in meat packing plants and working against segregation in local communities. The three goals of this department were: to break down all-white plants, to end discriminatory practice in communities, and to facilitate work with other civil-rights community organizations, such as the NAACP. In the 1950s and 1960s, the UPWA was at the forefront of union support for the Civil Rights Movement and was a strong ally of Martin Luther King Jr. Historians regard the UPWA's civil rights activity as a prime example of social unionism.\nGender\nDuring the 1950s, the UPWA made workplace equality for women a central goal. Though the idea never gained as much prominence as the fight for racial equality, the UPWA was still able to make a difference for women in the workplace. Ending men's and women's wage differentials was the focus of the UPWA. Ending discrimination against pregnant women workers was another important focus. As a result of the UPWA's work, pregnant women were able to receive up to one full year of unpaid leave and up to eight weeks of half-paid leave, under the union's sick-leave provisions.\nEnd of the UPWA\nThe meatpacking industry restructured in the post World War II years. The \"Big Four\" lost their dominance, and a new \"Big Three\" took power. IBP, ConAgra, and Cargill were the companies that made up the \"Big Three.\" By establishing plants in areas closer to animal populations, and by introducing new technologies that required less skill, the \"Big Three\" drove many older companies out of business. Packing plants represented by the UPWA closed in large numbers. In 1968, the UPWA and AMCBW joined forces, and UPWA dissolved into the Amalgamated Meat Cutters.\nPresidents\n* 1943: Lewis J. Clark\n* 1946: Ralph Helstein\nFootnotes\nExternal links\n* [http://www.encyclopedia.chicagohistory.org/pages/943.html History of packinghouse unions in Chicago]"
    }
  ]
}