{
  "content": [
    {
      "type": "text",
      "text": "# United States Navy in World War II\n\nto Allied forces on the  on September 2, 1945]]\nThe United States Navy grew rapidly during its involvement in World War II from 1941–45, and played a central role in the Pacific War against Imperial Japan. It also assisted the British Royal Navy in the naval war against Nazi Germany and Fascist Italy. The U.S. Navy grew slowly in the years prior to World War II, due in part to international limitations on naval construction in the 1920s. Battleship production restarted in 1937, commencing with the . The US Navy was able to add to its fleets during the early years of the war while the US was still neutral, increasing production of vessels both large and small, deploying a navy of nearly 350 major combatant ships by December 1941 and having an equal number under construction.\nThe Imperial Japanese Navy (IJN) sought naval superiority in the Pacific by sinking the main American battle fleet at Pearl Harbor, which was tactically centered around its battleships. The December 1941 surprise attack on Pearl Harbor did knock out the battle fleet, but it did not affect the three U.S. aircraft carriers, which were at sea at the time of the attack. These became the mainstay of the rebuilt fleet. Naval doctrine had to be changed quickly. The United States Navy (like the IJN) had followed Alfred Thayer Mahan's emphasis on concentrated groups of battleships as the main offensive naval weapons. The loss of the battleships at Pearl Harbor forced Admiral Ernest J. King, the head of the Navy, to place a primary emphasis on the small number of aircraft carriers.\nThe U.S. Navy grew tremendously as the United States was faced with a two-front war on the seas. It achieved notable acclaim in the Pacific Theater, where it was instrumental to the Americans' successful \"island hopping\" campaign. The U.S. Navy fought six great battles with the Imperial Japanese Navy (IJN): the Attack on Pearl Harbor, Battle of the Coral Sea, the Battle of Midway, the Battle of the Philippine Sea, the Battle of Leyte Gulf, and the Battle of Okinawa. By war's end in 1945, the United States Navy had added nearly 1,200 major combatant ships, including ninety-nine TO VERIFY aircraft carriers, eight \"fast\" battleships, and ten prewar \"old\" battleships totaling over 70% of the world's total numbers and total tonnage of naval vessels of 1,000 tons or greater.\n1941–1942\nIceland\nOn 16 June 1941, after negotiation with Churchill, Roosevelt ordered the United States occupation of Iceland, to replace the British occupation force in the Allied occupation of the island. On 22 June 1941, the U.S. Navy sent Task Force 19 (TF 19) from Charleston, South Carolina, to assemble at Argentia, Newfoundland. TF 19 included 25 warships and the 1st Provisional Marine Brigade of 194 officers and 3,714 men from San Diego, California under the command of Brigadier General John Marston. Task Force 19 (TF 19) sailed from Argentia on 1 July. On 7 July, Britain persuaded the Althing to approve an American occupation force under a U.S.–Icelandic defense agreement, and TF 19 anchored off Reykjavík that evening. U.S. Marines commenced landing on 8 July, and disembarkation was completed by 12 July. On 6 August, the U.S. Navy established an air base at Reykjavík with the arrival of Patrol Squadron VP-73 PBY Catalinas and VP-74 PBM Mariners. U.S. Army personnel began arriving in Iceland in August, and the Marines were transferred to the Pacific by March 1942. Up to 40,000 U.S. military personnel were stationed on the island, outnumbering adult Icelandic men (at the time, Iceland had a population of about 120,000). The agreement was for the U.S. military to remain until the end of the war, although the U.S. military presence in Iceland remained until 2006.\nPearl Harbor\nThe United States Navy's Pacific Fleet was caught off guard on the morning of December 7, 1941, when 353 Imperial Japanese Navy aircraft heavily bombed Pearl Harbor in a surprise airstrike. At the time of the attack, the United States and Japan were not at war. The first Japanese wave of 183 aircraft arrived at Pearl Harbor at 7:48 am, targeting ships in Battleship Row in addition to attacking airfields in other places within Honolulu. Most of the damage to the battleships was inflicted in the first 30 minutes of the assault. The battleship  blew up with a tremendous explosion. Riddled with bombs and torpedoes, the  settled on an even keel on the bottom of the harbor. The  was hit by four torpedoes and rolled completely over within five minutes, with its bottom and propeller rising above the waters of the harbor. The  was torpedoed and ordered abandoned as it slowly sank in shallow water. The target ship  also was sunk.\nAt 8:50 am, the second Japanese wave of the attack began with 171 planes. Less successful than the first, it nonetheless inflicted heavy damage. The battleship  had sustained a torpedo hit during the first wave, but its position at the end of Battleship Row allowed it greater freedom of action than the other moored capital ships. It was attempting to get underway when the second wave hit. It was struck by seven or eight bombs and was grounded at the head of the channel. The battleship  was set ablaze by bombs, and the two destroyers moored near it were reduced to wrecks. The destroyer  was split in two by a great explosion. Shortly after 9:30 am, the Japanese withdrew back to their carriers.\nThe damage to Pearl Harbor was great. The USS Arizona, USS Utah, and USS Oklahoma were completely sunk and were out of service for the remainder of the war. A further 16 ships were sunk or written off as losses during the war. Of the 402 American aircraft in Hawaii, 188 were destroyed and 159 were damaged, 155 of them on the ground. The Navy suffered 2,008 deaths, along with 327 deaths from other U.S. military branches as well as 68 civilians. The Japanese lost 29 planes (nine in the first attack wave, 20 in the second), five midget submarines, and 64 sailors.\nIn spite of this, the attack failed to damage any American aircraft carriers, which had been providentially absent from the harbor. The Japanese focused on ships and planes yet spared fuel tank farms, naval yard repair facilities, and the submarine base, all of which proved vital for the tactical operations that originated at Pearl Harbor in the ensuing months. American technological skill raised and repaired all but three of the ships sunk or damaged at Pearl Harbor. Most importantly, the shock and anger that Americans felt in the wake of the attack on Pearl Harbor united the nation and was translated into a collective commitment to destroy the Japanese Empire and Nazi Germany.\nAftermath\nAfter Pearl Harbor, the Japanese Navy seemed unstoppable because it outnumbered and outgunned the disorganized  Allies—U.S., Britain, Netherlands, Australia, and China. London and Washington both believed in Mahanian doctrine, which stressed the need for a unified fleet.  However, in contrast to the cooperation achieved by the armies, the Allied navies failed to combine or even coordinate their activities until mid-1942.  Tokyo also believed in Mahan, who said command of the seas—achieved by great fleet battles—was the key to sea power. Therefore, the IJN kept its main strike force together under Admiral Yamamoto and won a series of stunning victories over the Americans and British in the 90 days after Pearl Harbor. Outgunned at sea, the American strategy for victory required a holding action against the IJN until the much greater industrial potential of the U.S. could be mobilized to build a fleet capable of projecting American power to the enemy heartland.\nMidway\nThe Battle of Midway, together with the Guadalcanal campaign, marked the turning point in the Pacific. Between June 4–7, 1942, the United States Navy decisively defeated a Japanese naval force that had sought to lure the U.S. carrier fleet into a trap at Midway Atoll. The Japanese fleet lost four aircraft carriers and a heavy cruiser to the U.S. Navy's one American carrier and a destroyer. After Midway, and the exhausting attrition of the Solomon Islands campaign, Japan's shipbuilding and pilot training programs were unable to keep pace in replacing their losses while the U.S. steadily increased its output in both areas. Military historian John Keegan called the Battle of Midway \"the most stunning and decisive blow in the history of naval warfare.\"\nGuadalcanal\nGuadalcanal, fought from August 1942 to February 1943, was the first major Allied offensive of the war in the Pacific Theater. This campaign saw American air, naval and ground forces augmented by Australian and New Zealander forces in a six-month campaign slowly overwhelm determined Japanese resistance. Guadalcanal was the key to controlling the Solomon Islands, which both sides saw as strategically essential.  Both sides won some battles but both sides were overextended in terms of supply lines.\nThe rival navies fought seven battles, with the two sides dividing the victories. They were: Battle of Savo Island, Battle of the Eastern Solomons, Battle of Cape Esperance, Battle of the Santa Cruz Islands, Naval Battle of Guadalcanal, Battle of Tassafaronga and Battle of Rennell Island.  Each of the sides pulled out its aircraft carriers, as they were too vulnerable to land-based aviation.\n1943\nIn preparation of the recapture of the Philippines, the Allies started the Gilbert and Marshall Islands campaign to retake those islands from the Japanese in summer 1943.  Enormous effort went into recruiting and training sailors and Marines, and building warships, warplanes and support ships in preparation for a thrust across the Pacific, and to support Army operations in the Southwest Pacific, as well as in Europe and North Africa.\n1944\nThe Navy utilized \"island-hopping\" to continue its long movement west across the Pacific, seizing one island base after another. Not every Japanese stronghold had to be captured; some, like the big bases at Truk, Rabaul and Formosa, were neutralized by air attack and then simply isolated and leapfrogged. The ultimate goal was to get close to Japan itself, then launch massive strategic air attacks and finally an invasion. The U.S. Navy did not seek out the Japanese fleet for a decisive battle, as Mahanian doctrine would suggest; the enemy had to attack to stop the inexorable advance.\nNormandy: June 1944\nThe invasion of Normandy, France, was the largest and most complex amphibious operation of all time. Casualties were remarkably light, with the Germans having hardly any airpower or seapower to combat it.  In the first 30 days, the armada landed 850,000 men, 148,000 vehicles, and 570,000 tons of supplies on the beaches and makeshift ports, for the Germans were holed up in control of all the regular ports.  The operation involved 195,000 men from the various navies and merchant marine.  The navies used 113,000 British, 53,000 American, and 5,000 men from other allies. In addition there were 25,000 sailors from the Allied merchant navies. Of the combat warships, 17 percent were provided by the United States Navy, and 79 percent by the British or Canadians. Since the preponderance of naval forces were British, the Royal Navy named Vice Admiral Bertram Ramsay as the overall Allied naval commander under Eisenhower.\nBattle of the Philippine Sea\n(center) and two destroyers under attack June 20, 1944]]\nThe climax of the carrier war came at the Battle of the Philippine Sea.\nTaking control of islands that could support airfields within B-29 range of Tokyo was the objective. 535 ships began landing 128,000 Army soldiers and Marines on June 15, 1944 in the Mariana and Palau Islands. The achievement in planning such a complex logistical operation in just ninety days, and staging it  from Pearl Harbor was indicative of American logistic superiority. (The previous week an even bigger landing force hit the beaches of Normandy—by 1944 the Allies had resources to spare.)\nThe Japanese launched an ill-coordinated attack on the larger American fleet; Japanese planes operated at extreme ranges and could not keep together, allowing them to be easily shot down in what Americans jokingly called the \"Great Marianas Turkey Shoot.\"\nJapan had now lost all its offensive capabilities, and the U.S. had control of Guam, Saipan and Tinian islands that provided air bases within range of B-29 bombers targeted at Japan's home islands. It was entirely an air battle, in which Americans had all the technological advantages. It was the largest naval battle in history to date, surpassed only by the Battle of Leyte Gulf in October 1944.\nJapanese strategy\nThe American 5th Fleet covering the landing comprised 15 big carriers and 956 planes, plus 28 battleships and cruisers, and 69 destroyers. Tokyo sent Vice Admiral Jisaburo Ozawa with nine-tenths of Japan's fighting fleet—it was about half the size of the American force, and included nine carriers with 473 planes, 18 battleships and cruisers, and 28 destroyers. Ozawa's pilots boasted of their fiery determination, but they had only a fourth as much training and experience as the Americans. They were outnumbered 2–1 and used inferior equipment. Ozawa had anti-aircraft guns but lacked proximity fuzes and good radar.\nOzawa gambled on surprise, luck and a trick strategy, but his battle plan was so complex and so dependent on good communications that it quickly broke down. His planes carried more gasoline because they were not weighted down with protective armor; they could attack at , and could search a radius of 560 miles. The heavier American Hellcats could only attack to , and only search to 325. Ozawa's plan therefore was to use his advantage in range by positioning his fleet  out, forcing the Americans to search over  of ocean just to find him. The Japanese ships would stay beyond American range, but their planes would have enough range to strike the American fleet. They would hit the carriers, land at Guam to refuel, then hit the Americans en route back to their carriers. Ozawa counted heavily on the 500 or so ground-based planes that had been flown ahead to Guam and other islands in the area.\n1945\nOkinawa\nOkinawa was the last great battle of the entire war. The goal was to make the island into a staging area for the invasion of Japan scheduled for fall 1945. It was just 350 miles (550&nbsp;km) south of the Japanese home islands. Marines and soldiers landed on 1 April 1945, to begin an 82-day campaign which became the largest land-sea-air battle in history and was noted for the ferocity of the fighting and the high civilian casualties with over 150,000 Okinawans losing their lives.  Japanese kamikaze pilots exacted the largest loss of ships in U.S. naval history with the sinking of 38 and the damaging of another 368.  Total U.S. casualties were over 12,500 dead and 38,000 wounded, while the Japanese lost over 110,000 men.  The fierce combat and high American losses led the Navy to oppose an invasion of the main islands. The eventual bombings of Hiroshima and Nagasaki, along with the Soviet invasion of Manchukuo, led to the Japanese surrender in August 1945.\nNaval technology\nTechnology and industrial power proved decisive.  Japan failed to exploit its early successes before the immense potential power of the Allies could be brought to bear. In 1941, the Japanese Zero fighter had a longer range and better performance than rival American warplanes, and the pilots had more experience in the air.  But Japan never improved the Zero and by 1944 the Allied navies were far ahead of Japan in both quantity and quality, and ahead of Germany in quantity and in putting advanced technology to practical use.  High tech innovations arrived with dizzying rapidity.  Entirely new weapons systems were invented—like the landing ships,  such as the 3,000 ton LST (\"Landing Ship Tank\") that carried 25 tanks thousands of miles and landed them right on the assault beaches.  Furthermore, older weapons systems were constantly upgraded and improved. Obsolete airplanes, for example, received more powerful engines and more sensitive radar sets.  One impediment to progress was that admirals who had grown up with great battleships and fast cruisers had a hard time adjusting their war-fighting doctrines to incorporate the capability and flexibility of the rapidly evolving new weapons systems.\nShips\nThe ships of the American and Japanese forces were closely matched at the beginning of the war. By 1943 the American qualitative edge was winning battles; by 1944 the American quantitative advantage made the Japanese position hopeless. The Kriegsmarine, distrusting its Japanese ally, ignored Hitler's orders to cooperate and failed to share its expertise in radar and radio. Thus the Imperial Navy was further handicapped in the technological race with the Allies (who did cooperate with each other). The United States economic base was ten times larger than Japan's, and its technological capabilities also significantly greater, and it mobilized engineering skills much more effectively than Japan, so that technological advances came faster and were applied more effectively to weapons. Above all, American admirals adjusted their doctrines of naval warfare to exploit the advantages.\nThe Americans were supremely, and perhaps overly, confident in 1941. Pacific commander Admiral Chester W. Nimitz boasted he could beat a bigger fleet because of \"...our superior personnel in resourcefulness and initiative, and the undoubted superiority of much of our equipment.\" As Willmott notes, it was a dangerous and ill-founded assumption.\n{| class=\"wikitable\"\n|+Size of fleet\n|-\n! Type\n!30 June 1939\n! 7 December 1941\n! 14 May 1945\n! Note\n|-\n|Battleships\n|15\n|17\n|23\n|(all types)\n|-\n|Fleet carrier\n|5\n|7\n|28\n|\n|-\n|Escort carrier\n|0\n|1\n|71\n|\n|-\n|Cruiser\n|36\n|37\n|72\n|(all types)\n|-\n|Destroyer\n|127\n|171\n|377\n|(all types)\n|-\n|Frigate\n|0\n|0\n|361\n|\n|-\n|Submarine\n|58\n|112\n|232\n|\n|-\n|Amphibious warfare\n|0\n|0\n|2,547\n|(including small craft)\n|-\n|Total active\n|394\n|790\n|6,768\n|\n|}\nBattleships\nThe three s were the epitome of the standard super dreadnought battleships that were in service prior to the attack on Pearl Harbor. Ships of the Colorado class could fire salvos of eight 2,100-pound armor-piercing shells every 30 seconds to a range of 35,000 yards (19 miles). This was on par with the other major known capital ships of the time, the British  and the Japanese . Prior to the outbreak of the war, the London Naval Treaty had fallen apart as major powers began restarting capital ship production. This led to development of the , originally envisioned to be armed with 14-inch guns. Both were rearmed with 16-inch guns while under construction as the first escalator clause was triggered in the London Naval Treaty after Japan refused to sign.\nThe North Carolina class was only sufficiently protected against 14-inch guns, so the  was quickly designed with protection from 16-inch weapons in mind. The four South Dakotas sacrificed some size to attain this extra protection as both classes were still trying to adhere to the 35,000-ton displacement treaty limit. Only  and  would be commissioned by the time of the Pearl Harbor attack. When the second escalation clause was activated, this allowed displacement to rise to 45,000 tons and the  began development. For the Iowa class, the Navy envisioned a fast capital ship to hunt down Japanese s while also filling the role of a carrier escort that would form a fast carrier task force. The Iowa class was effectively a South Dakota class with the same level of protection and armament but with a much longer hull and larger machinery to achieve a 33-knot top speed.\nThe \"big-gun\" admirals on both sides dreamed of a great shootout at twenty-mile (32&nbsp;km) range, in which carrier planes would be used only for spotting the mighty guns. Their doctrine was utterly out of date.  A plane like the Grumman TBF Avenger could drop a 2,000-pound bomb on a battleship at a range of hundreds of miles. During the war the battleships found new missions: they were platforms holding all together dozens of anti-aircraft guns and eight or nine 14-inch or 16-inch long-range guns used to blast land targets before amphibious landings.  Their smaller 5-inch guns, and the 4,800 3-inch to 8-inch guns on cruisers and destroyers also proved effective at bombarding landing zones. After a short bombardment of Tarawa in November 1943, Marines discovered that the Japanese defenders were surviving in underground shelters.  It then became routine doctrine to thoroughly work over beaches with thousands of high-explosive and armor-piercing shells. The bombardment would destroy some fixed emplacements and kill some troops.  More important, it severed communication lines, stunned and demoralized the defenders, and gave the landing parties fresh confidence.  The sinking of the battleships at Pearl Harbor proved a blessing in deep disguise, for after they were resurrected and assigned their new mission they performed well.  Absent Pearl Harbor, big-gun admirals like Raymond Spruance might have followed prewar doctrine and sought a surface battle in which the Japanese would have been very hard to defeat.  However, USN warships did enjoy a significant advantage over the IJN in terms of fire control, with even ships as small as destroyers being fitted with radar and ballistics computers.  This advantage would prove decisive during the Battle of Leyte Gulf.\nNaval aviation\nIn World War I the Navy explored aviation, both land-based and carrier based. However the Navy nearly abolished aviation in 1919 when Admiral William S. Benson, the reactionary Chief of Naval Operations, could not \"conceive of any use the fleet will ever have for aviation\", and he secretly tried to abolish the Navy's Aviation Division. Assistant Secretary of the Navy Franklin D. Roosevelt reversed the decision because he believed aviation might someday be \"the principal factor\" at sea with missions to bomb enemy warships, scout enemy fleets, map mine fields, and escort convoys. Even Roosevelt, however, considered Billy Mitchell's warnings of bombers capable of sinking battleships under wartime conditions to be \"pernicious\". Having failed in its attempt to rig a demonstration attack against the decommissioned , the Navy was forced by Congressional resolutions to conduct more honest assessments. Despite rules of engagement again designed to enhance the survivability of the ships, the tests went so badly against the ships that the Navy grudgingly continued to build up its aviation wing. In 1929, it had one carrier (), 500 pilots and 900 planes; by 1937 it had 5 carriers (the , , ,  and ), 2000 pilots and 1000 much better planes.  With Roosevelt now in the White House, the tempo soon quickened. One of the main relief agencies, the PWA, made building warships a priority.  In 1941 the U.S. Navy with 8 carriers, 4,500 pilots and 3,400 planes had more airpower than the Japanese Navy.\nWomen in the Navy\nWorld War II brought the need for additional personnel. The Navy organized to recruit women into a separate women's auxiliary, labeled Women Appointed for Voluntary Emergency Service (WAVES). WAVES served in varied positions around the continental U.S. and in Hawaii.\nTwo groups of Navy nurses (Navy nurses were all women then) were held prisoner by the Japanese in World War II. Chief Nurse Marion Olds and nurses Leona Jackson, Lorraine Christiansen, Virginia Fogerty and Doris Yetter were taken prisoner on Guam shortly after Pearl Harbor and transported to Japan.  They were repatriated in August 1942, although the newspaper did not identify them as Navy nurses. Chief Nurse Laura Cobb and her nurses, Mary Chapman, Bertha Evans, Helen Gorzelanski, Mary Harrington, Margaret Nash, Goldie O'Haver, Eldene Paige, Susie Pitcher, Dorothy Still and C. Edwina Todd (some of the \"Angels of Bataan\") were captured in 1942 in the Philippines and imprisoned in the Los Baños internment camp there, where they continued to function as a nursing unit, until they were rescued by American forces in 1945. Other Los Baños prisoners later said: \"We are absolutely certain that had it not been for these nurses many of us who are alive and well would have died.\" Navy nurse Ann Agnes Bernatitus, one of the “Angels of Bataan”, nearly became another POW; she was one of the last to escape Corregidor Island in the Philippines, via the .  Upon her return to the United States she became the first American to receive the Legion of Merit.\nIn 1943, Thelma Bendler Stern, an engineering draftsman, became the first woman assigned to perform duties aboard a United States Navy ship as part of her official responsibilities.\nSee also\n*List of U.S. Navy ships sunk or damaged in action during World War II\nNotes\nFurther reading\n* Costello, John. The Pacific War: 1941-1945 (1982)\n* Dunnigan, James F.,  and Albert A. Nofi. The Pacific War Encyclopedia (2 vol. 1998)\n* Howarth, Stephen. To Shining Sea: a History of the United States Navy, 1775–1998 (University of Oklahoma Press, 1999)\n* Love, Robert W., Jr. History of the U.S. Navy (1992) vol 2 ch 1-13\n* Sandler, Stanley. World War II in the Pacific: An Encyclopedia (2000)\n* Spector, Ronald. Eagle Against the Sun: The American War With Japan (1985)\n*\nBattles\n* Bennett, Geoffrey. Naval Battles of World War Two (Pen & Sword Military Classics) (2003)\n* Blair, Clay Silent Victory: The U.S. Submarine War Against Japan. (Annapolis: Naval Institute Press, 2001). .\n* Lundstrom, John B. The First Team: Pacific Naval Air Combat from Pearl Harbor to Midway (Naval Institute Press, 1984)\n* Morison, Samuel Eliot. The Two-Ocean War: A Short History of the United States Navy in the Second World War (1963)\n** Morison, History of United States Naval Operations in World War II. Vol. 3, The Rising Sun in the Pacific. Boston: Little, Brown, 1961; Vol. 4, Coral Sea, Midway and Submarine Actions. 1949; Vol. 5, The Struggle for Guadalcanal. 1949; Vol. 6, Breaking the Bismarcks Barrier. 1950; Vol. 7, Aleutians, Gilberts, and Marshalls. 1951; Vol. 8, New Guinea and the Marianas. 1962; Vol. 12, Leyte. 1958; vol. 13, The Liberation of the Philippines: Luzon, Mindanao, the Visayas. 1959; Vol. 14, Victory in the Pacific. 1961.\n*Prange, Gordon. At Dawn We Slept (Penguin Books, 1982).  on Pearl Harbor\n* Smith, Peter C. ''Midway, Dauntless Victory: Fresh Perspectives on America's Seminal Naval Victory of World War II (2007)\n* Smith, Steven. Wolf Pack: The American Submarine Strategy That Helped Defeat Japan (2003)\n* Tillman, Barrett. Clash of the Carriers: The True Story of the Marianas Turkey Shoot of World War II'' (2005).\n* Y'Blood William T. The Little Giants: U.S. Escort Carriers Against Japan (1999)\nShips and technology\n* Campbell, N. J. M. Naval Weapons of World War Two (2002), covers major navies of the world\n* Friedman, Norman. U.S. Naval Weapons: Every Gun, Missile, Mine and Torpedo Used by the U.S. Navy from 1883 to the Present Day (1983)\n* ''Jane's Fighting Ships of World War II (1972); covers major navies of the world\nAdmirals and strategies\n* Buell, Thomas. The Quiet Warrior: A Biography of Admiral Raymond Spruance. (1974).\n* Buell, Thomas B. Master of Sea Power: A Biography of Fleet Admiral Ernest J. King (Naval Institute Press, 1995).\n* Miller, Edward S. War Plan Orange: The U.S. Strategy to Defeat Japan, 1897-1945 (1991)\n* Larrabee, Eric. Commander in Chief: Franklin Delano Roosevelt, His Lieutenants, and Their War (2004), chapters on all the key American war leaders [https://www.amazon.com/dp/1591144558/  excerpt and text search]\n* Potter, E. B.  Bull Halsey  (1985).\n* Potter, E. B.  Nimitz.  (1976).\n*\nSailors and personal viewpoints\n* Hands to action stations!: Naval poetry and verse from World War Two (Bluejacket Books,  1980)\n* Haberstroh, Jack, ed. SWABBY: World War II Enlisted Sailors Tell It Like It Was (2003) recollections* Hoyt, Edwin. Now Hear This: The Story of American Sailors in World War II (1993)\n* Sowinski, Larry. Action in the Pacific: As Seen by US Navy Photographers During World War 2 (1982)\n* Wukovits, John F. Black Sheep: The Life of Pappy Boyington (2011)\nExternal links\n*  (Includes The Official Chronology of the U.S. Navy in World War II''.)\n* Hosted by the [https://digital.library.unt.edu/ UNT Libraries Digital Collections]\n* [http://www.ussnautilus.org/ Submarine Force Library & Museum]"
    }
  ]
}