{
  "content": [
    {
      "type": "text",
      "text": "# United States military casualties in the War in Afghanistan__disambig_1\n\nBetween 7 October 2001 and 30 August 2021, the United States lost a total of 2,459 military personnel in Afghanistan, which is very low compared to Taliban losses. Of this figure, 1,922 had been killed in action. An additional 20,769 were wounded in action. 18 operatives of the Central Intelligence Agency were also killed during the conflict. Further, there were 1,822 civilian contractor fatalities.\nThe number of American fatalities reached 1,000 on February 19, 2010, when Reconnaissance Corporal Gregory Stultz of the U.S. Marines was killed by Taliban insurgents during the Battle of Marjah. By April 11, 2011, this figure stood at 1,515, and had surpassed 2,000 by September 2012.\nOn August 6, 2011, the highest number of American fatalities in a single incident occurred in Wardak Province: 30 Americans (incl. 22 Navy SEALs), seven Afghan soldiers, and a civilian interpreter were all killed when their CH-47 Chinook was shot down; the attack was later claimed by the Taliban.\nOn August 5, 2014, the highest-ranking American fatality occurred in Kabul: Major General Harold J. Greene of the United States Army was shot dead by 22-year-old Private Rafiqullah of the Afghan National Army; Rafiqullah had carried out the fragging after he was denied leave for Eid al-Fitr.\nNumbers of fatalities\nThe United States Department of Defense lists 2,465 servicemembers as having died in Operation Enduring Freedom and Operation Freedom's Sentinel. Of these, 1,926 were due to hostile action and 538 non-hostile, and 1 status pending.\nOf those killed, 60 were confirmed to have died in Africa, Southeast Asia or Cuba in support of OEF – Horn of Africa, OEF – Philippines, OEF – Trans Sahara, and in the detainment of prisoners in Guantanamo Bay, Cuba. Five were killed due to hostile action. Thus, a total of 2,402 United States servicemen were killed in the war in Afghanistan.\nThe website iCasualties.org lists 2,455 servicemembers and 10 CIA operatives as having died in Operation Enduring Freedom and Operation Freedom's Sentinel, including 49 who died in support of other OEF operations. This gives a total of 2,406 deaths of servicemen in support of operations in Afghanistan.\nThe iCasualties.org figure of 2,406 is higher than the Department of Defense's officially stated figure, although according to the website all of the names listed at iCasualties.org have been confirmed by the Department of Defense.\nMany veterans have committed suicide as a result of psychological problems developed during their service.\nFatalities by month and year\nAll fatalities\n{| class=\"wikitable sortable\" style=\"text-align: right\"\n|+ U.S. fatalities by month in all OEF/OFS theaters according to the US DoD\n|- style=\"background:#B0C4DE\"\n! Year\n! J\n! F\n! M\n! A\n! M\n! J\n! J\n! A\n! S\n! O\n! N\n! D\n! Total\n|-\n|align=left|2001 || – || – || – || – || – || – || – || – || – || 3 || 4 || 4 || 11\n|-\n|align=left|2002 || 10 || 12 || 9 || 5 || 1 || 3 || 0 || 1 || 1 || 5 || 1 || 1 || 49\n|-\n|align=left|2003|| 4 || 6 || 11 || 2 || 1 || 3 || 2 || 4 || 1 || 2 || 6 || 1 || 43\n|-\n|align=left|2004|| 9 || 2 || 3 || 3 || 8 || 5 || 2 || 3 || 4 || 5 || 7 || 1 || 52\n|-\n|align=left|2005 || 2 || 1 || 6 || 18 || 4 || 27 || 2 || 15 || 12 || 6 || 3 || 3 || 99\n|-\n|align=left|2006 || 1 || 17 || 7 || 1 || 11 || 18 || 9 || 10 || 6 || 10 || 7 || 1 || 98\n|-\n|align=left|2007 || 0 || 14 || 5 || 8 || 11 || 12 || 14 || 18 || 9 || 10 || 11 || 6 || 118\n|-\n|align=left|2008 || 7 || 1 || 8 || 5 || 17 || 28 || 20 || 22 || 28 || 16 || 1 || 3 || 156\n|-\n|align=left|2009 || 15 || 15 || 13 || 6 || 12 || 24 || 45 || 51 || 40 || 59 || 18 || 13 || 311\n|-\n|align=left|2010 || 30 || 31 || 25 || 20 || 34 || 60 || 65 || 55 || 42 || 50 || 53 || 33 || 498\n|-\n|align=left|2011 || 24 || 20 || 30 || 47 || 34 || 47 || 36 || 71 || 39 || 30 || 17 || 16 || 411\n|-\n|align=left|2012 || 26 || 17 || 19 || 35 || 41 || 29 || 42 || 41 || 20 || 17 || 15 || 12 || 314\n|-\n|align=left|2013 || 3 || 1 || 16 || 13 || 22 || 19 || 13 || 12 || 11 || 9 || 3 || 10 || 132\n|-\n|align=left|2014 || 7 || 7 || 0 || 4 || 5 || 12 || 3 || 5 || 5 || 1 || 3 || 3 || 55\n|-\n|align=left|2015 || 0 || 0 || 0 || 1 || 1 || 2 || 0 || 3 || 1 || 8 || 0 || 6 || 21\n|-\n|align=left|2016 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 0 || 3 || 3 || 0 || 10\n|-\n|align=left|2017 || 0 || 0 || 1 || 3 || 1 || 3 || 1 || 3 || 0 || 1 || 1 || 1 || 15\n|-\n|align=left|2018 || 1 || 0 || 0 || 1 || 0 || 1 || 2 || 1 || 2 || 1 || 5 || 1 || 16\n|-\n|align=left|2019 || 1 || 0 || 2 || 3 || 1 || 3 || 3 || 3 || 2 || 0 || 2 || 1 || 23\n|-\n|align=left|2020 || 4 || 3 || 0 || 0 || 1 || 0 || 2 || 0 || 0 || 0 || 1 || 0 || 11\n|-\n|align=left|2021 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 13 || – || – || – || – || 13\n|}\nGrand Total: 2,456\nSource:\nNote: Table omits the deaths of six Department of Defense civilian employees killed in support of operations in Afghanistan and other countries.\nKilled in action only\n{| class=\"wikitable sortable\" style=\"text-align: right\"\n|+ U.S. KIA (hostile) in all OEF/OFS theaters according to the US DoD\n|- style=\"background:#B0C4DE\"\n! Year\n! J\n! F\n! M\n! A\n! M\n! J\n! J\n! A\n! S\n! O\n! N\n! D\n! Total\n|-\n|align=left|2001 || – || – || – || – || – || – || – || – || – || 0 || 0 || 3 || 3\n|-\n|align=left|2002 || 1 || 0 || 8 || 4 || 1 || 0 || 0 || 1 || 0 || 2 || 0 || 1 || 18\n|-\n|align=left|2003|| 0 || 0 || 2 || 2 || 0 || 1 || 0 || 4 || 1 || 1 || 6 || 0 || 17\n|-\n|align=left|2004|| 0 || 1 || 2 || 1 || 6 || 3 || 0 || 2 || 3 || 4 || 3 || 0 || 25\n|-\n|align=left|2005 || 2 || 0 || 5 || 1 || 3 || 25 || 2 || 12 || 9 || 3 || 2 || 2 || 66\n|-\n|align=left|2006 || 1 || 6 || 6 || 1 || 1 || 14 || 7 || 9 || 5 || 9 || 5 || 1 || 65\n|-\n|align=left|2007 || 0 || 2 || 1 || 5 || 10 || 11 || 13 || 13 || 7 || 7 || 10 || 4 || 83\n|-\n|align=left|2008 || 7 || 1 || 6 || 5 || 14 || 23 || 16 || 17 || 26 || 14 || 1 || 2 || 133\n|-\n|align=left|2009 || 12 || 15 || 11 || 3 || 9 || 20 || 39 || 47 || 35 || 53 || 17 || 10 || 271\n|-\n|align=left|2010 || 25 || 29 || 22 || 14 || 31 || 49 || 58 || 54 || 30 || 47 || 47 || 31 || 437\n|-\n|align=left|2011 || 20 || 16 || 24 || 43 || 31 || 41 || 32 || 64 || 34 || 26 || 16 || 13 || 360\n|-\n|align=left|2012 || 14 || 6 || 11 || 26 || 34 || 23 || 35 || 37 || 17 || 13 || 12 || 9 || 237\n|-\n|align=left|2013 || 3 || 1 || 6 || 6 || 16 || 14 || 9 || 11 || 6 || 7 || 3 || 9 || 91\n|-\n|align=left|2014 || 3 || 5 || 0 || 3 || 1 || 11 || 2 || 3 || 5 || 0 || 3 || 3 || 39\n|-\n|align=left|2015 || 0 || 0 || 0 || 1 || 0 || 0 || 0 || 3 || 0 || 0 || 0 || 6 || 10\n|-\n|align=left|2016 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 2 || 4 || 1 || 9\n|-\n|align=left|2017 || 0 || 0 || 0 || 3 || 1 || 3 || 1 || 3 || 0 || 0 || 1 || 0 || 12\n|-\n|align=left|2018 || 1 || 0 || 0 || 1 || 0 || 0 || 2 || 1 || 1 || 1 || 5 || 1 || 13\n|-\n|align=left|2019 || 2 || 0 || 2 || 3 || 0 || 2 || 3 || 2 || 2 || 0 || 0 || 1 || 17\n|-\n|align=left|2020 || 2 || 2 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 4\n|-\n|align=left|2021 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 13 || – || – || – || – || 13\n|}\nGrand Total: 1,928\nSource:\nNote: Table omits the deaths of four Department of Defense civilian employees killed in action in support of operations in Afghanistan and other countries.\nPublicized incidents of multiple deaths of U.S. service members in the war\n*March 1–18, 2002 – Eight U.S. soldiers were killed and another 72 were wounded in Operation Anaconda. Most of the casualties were sustained during the Battle of Takur Ghar when a U.S. transport helicopter was shot down and another one was so badly damaged that it had to land or risk crashing also. All of those killed were members of various special operations units.\n*June 28, 2005 – 19 U.S. special operations troops were killed in Operation Red Wings. Three of them, Navy SEALs, were killed when their four-man team was ambushed in the mountains of Kunar province. The fourth team member was missing in action for four days before being rescued. After the initial ambush the team called for reinforcements and a quick reaction force dispatched. As they approached the ambush site, insurgents fired an RPG at the helicopter carrying the QRF, shooting it down. All 16 on board were killed. Eight of them were Navy Seals while the other eight were members of the Nightstalkers regiment.\n*November 9, 2007 – Five US Army soldiers and one Marine were killed when their footpatrol was attacked by direct fire from enemy forces in Aranas, Afghanistan. The soldiers were assigned to 2nd Battalion, 503rd Airborne Infantry Regiment, 173rd Airborne Brigade Combat Team, Vicenza, Italy. The Marine was assigned to Marine Corps Mountain Warfare Training Center, Bridgeport, California.\n*July 13, 2008 – Nine U.S. soldiers were killed and another 27 wounded during the Battle of Wanat. A force of 200 Taliban fighters had attacked a remote U.S. outpost at the town of Wanat in an attempt to overrun the base. The base's observation post, positioned on a tiny hill about 50 to 75 meters from the main base, was overrun during the battle and most of the casualties were sustained there. Eventually, U.S. forces managed to repulse the attack but had to evacuate the base a few days later. The battle is considered a U.S. tactical victory, but also a Taliban strategic victory. The soldiers involved in the battle were part of 2nd Battalion, 503rd Airborne Infantry Regiment, 173rd Airborne Brigade Combat Team, Vicenza, Italy.\n*October 3, 2009 – Eight U.S. soldiers were killed and another 24 wounded during the Battle of Kamdesh. A force of 300 Taliban fighters had attacked a U.S. outpost at the town of Kamdesh in an attempt to overrun the base. The Afghan part of the base was overrun during the battle which left four Afghan security forces members dead, 10 wounded and 20 captured. The soldiers involved in the battle were part of 3rd Squadron, 61st Cavalry Regiment, 4th Brigade Combat Team, 4th Infantry Division, Fort Carson, Colorado.\n*December 30, 2009 – Five U.S. CIA employees and 2 Xe PMCs were killed and another six wounded in a suicide bomb attack on a military base in Khost province. The Afghan PMC chief of security for the base and a Jordanian military officer from the Jordanian spy agency Dairat al-Mukhabarat al-Ammah were also killed in the attack.\n*On May 28, 2010, the 1,000th American fatality in Afghanistan was a Marine from Camp Pendleton killed by a roadside bomb while on a foot patrol in Helmand province.\n*On August 22, 2010, two U.S. soldiers from the Vermont Army National Guard, 3rd Company, 172nd Infantry, 86th Infantry Brigade Combat Team were killed during an attack in Paktya province.\n*On September 21, 2010 a Black Hawk helicopter crashed in Qalat killing five soldiers of the 101st Airborne, three Navy Seals, and one Naval Special Warfare support technician.\n*October 2010 – 4 Marines with 3rd Battalion 5th Marines were killed in the Sangin district when an IED destroyed the MATV they were riding in. The 3/5 Sangin deployment was the deadliest deployment for the whole of the Marine Corps.\n*April 27, 2011 – Eight United States Air Force Airmen and one American contractor were killed at the Kabul Airport. An Afghan Air Corps pilot became angry during an argument in the operations room at the airfield, then suddenly drew his gun and began shooting. The shooter was fatally wounded at the end of the incident.\n*August 6, 2011 – 30 American servicemembers, including 22 Navy SEALs, were killed along with seven Afghan special forces members and an Afghan civilian interpreter when their transport helicopter was shot down in Wardak province. A U.S. military dog also died.\n*February 2012 – Four soldiers were killed in the 2012 Afghanistan Quran burning protests.\n*August 2012 – Afghan security forces kill twelve US soldiers in so-called \"green on blue\" attacks.\n*October 2012 – Three American soldiers killed as a result of a suicide strike against a joint U.S.-Afghan combat team in Eastern Afghanistan that left a total of 14 dead.\n*March 11, 2013 – Seven Americans died this day when a helicopter crashed in southern Afghanistan that killed five American service members and earlier two U.S. special operations forces were gunned down in an insider attack by an Afghan policeman in eastern Afghanistan.\n*April 6, 2013 – Three U.S. service members in Southern Afghanistan were killed when a suicide bomber detonated a car full of explosives just as a convoy with the international military coalition drove past another convoy of vehicles carrying the governor of Zabul province in that province.\n*May 3, 2013 – Three US Air Force crew members were killed when their KC-135R crashed in Kyrgyzstan while on a combat air refueling mission to Afghanistan.\n*May 4, 2013 – Seven U.S. service members were killed by a roadside bomb in southern Afghanistan.\n*November 27, 2018 - Three U.S. service members killed in Afghanistan blast.\n*April 9, 2019 - Car bomb kills three US servicemembers outside Bagram Air Field.\n*January 11, 2020 – Two U.S. service members were killed by a roadside bomb in Afghanistan.\n*January 27, 2020 – Two US Air Force crew members were killed when an E-11A aircraft crashed\n*February 8, 2020 – Two U.S. Special Operations Soldiers were killed and six service members wounded from an insider \"Green on Blue\" attack in Nangarhar.\n*August 26, 2021 – Thirteen U.S. service members from the US Marine Corps, US Navy and US Army were killed in a suicide bombing attack during evacuations at the Kabul airport.\nSee also\n*Coalition casualties in Afghanistan\n*Civilian casualties in the war in Afghanistan (2001–2021)\n*Harold J. Greene, the highest-ranking American to die in the war in Afghanistan\nReferences\nExternal links\n* [https://opencrs.com/document/R41084/ Afghanistan Casualties: Military Forces and Civilians] Congressional Research Service.\n*[https://web.archive.org/web/20111120212817/http://icasualties.org/oef/ Operation Enduring Freedom Coalition Casualties]"
    }
  ]
}