{
  "content": [
    {
      "type": "text",
      "text": "# United Kingdom football sexual abuse scandal\n\nA child sexual abuse scandal involving the abuse of young players at football clubs in the United Kingdom began in mid-November 2016. The revelations began when former professional footballers waived their rights to anonymity and talked publicly about being abused by former coaches and scouts in the 1970s, 1980s and 1990s. This led to a surge of further allegations, as well as allegations that some clubs had covered them up.\nEchoing similar revelations in the 1990s, the initial 2016 allegations centred on abuse of young players at Crewe Alexandra and Manchester City due to the clubs' associations with Barry Bennell (previously convicted of sexual abuse offences in the US, in 1995, and in the UK, in 1998) who, on 29 November 2016, was charged with new offences. Allegations were also made against George Ormond, a former Newcastle United youth coach and scout (who also had previous convictions), former Chelsea scout Eddie Heath, and former Southampton and Peterborough coach Bob Higgins. In early December 2016, allegations about former youth coaches and scouts in Northern Ireland and Scotland also started to emerge.\nWithin a month of the initial reporting, the Football Association (FA), the Scottish Football Association (SFA), several football clubs and over 20 UK police forces had established various inquiries and investigations and over 350 alleged victims had come forward. By July 2018, 300 suspects were reported to have been identified by 849 alleged victims, with 2,807 incidents involving 340 different clubs. By the end of 2021, 16 men had been charged with historical sexual abuse offences, 15 of whom were tried. Fourteen – Bennell, Ormond, Higgins, William Toner, Michael Coleman, Jim McCafferty, Robert Smith, James Torbett, Gerald King, Frank Cairney, Norman Shaw, David Daniel Hayes, Dylan Lamb and Geoff Broome – were convicted; all, except King (given a three-year probation order) were jailed. Paul McCann was cleared. Michael Carson died by suicide before his trial opened. Other allegations involved individuals who had died prior to the revelations, who had died before charges could be brought or who were unfit to stand trial. In addition to criminal prosecutions, civil actions for damages were also instigated against clubs including Celtic, Crewe Alexandra, Manchester City and Newcastle United.\nIn July 2018, the FA's independent inquiry was said to have found no evidence of an institutional cover-up or of a paedophile ring operating within football, but intended publication of its report in September 2018 was delayed, potentially by up to a year, pending Higgins' retrial and further charges against Bennell (tried in 2020). The SFA's enquiry report, making 97 recommendations for improvement, was published in February 2021, and the FA's Sheldon report was published on 17 March 2021. While awareness of child abuse had previously been low, Sheldon said the FA was culpable of \"institutional failure\" in delaying the introduction of safeguards after 1995. Sheldon also criticised failures at eight professional clubs: Aston Villa, Chelsea, Crewe Alexandra, Manchester City, Newcastle United, Peterborough, Southampton and Stoke City. The FA undertook to implement all 13 of the report's recommendations about improving safeguarding measures at clubs.\nImplicated individuals\nThe sexual abuse allegations related to several publicly identified individuals, listed below in the order in which they were named as the scandal developed from late 2016 through to 2019 (some individuals, including Bennell, Ormond, Langford and Torbett, had previously been named and convicted for earlier offences of sexual abuse).\nBarry Bennell\nOn 16 November 2016, former Crewe defender Andy Woodward alleged in an interview with Daniel Taylor of The Guardian newspaper that he had been the victim of child sexual abuse by former football coach Barry Bennell at the club in the 1980s (Woodward later claimed \"People should know I suffered more than one abuser\"). By 21 November, it was reported that six other people had contacted the police.\nOn 22 November, The Guardian alleged that Crewe teammate Steve Walters had been another of Bennell's victims, while Woodward criticised Crewe for failing to apologise. On 24 November, Dario Gradi, manager at Crewe during the early 1980s, released a statement saying he knew nothing of Bennell's crimes until Bennell was arrested in the United States in 1994.\nOn 23 November, former Manchester City players David White and Paul Stewart made similar sex abuse allegations about Bennell, and about another coach (later named as Frank Roper) at the Nova feeder club. Cheshire police said they had been contacted by 11 people (including Walters, but excluding White and Stewart) regarding the Bennell case. On 25 November, two further youth players, Jason Dunford and Chris Unsworth, also alleged sexual abuse by Bennell, initially at a Manchester City nursery team; Dunford also later spoke of abuse by Frank Roper. (In February 2018, it was revealed that three former Manchester City players had lodged civil cases against the club in March 2016 after allegedly becoming victims of Bennell.)\nOn 27 November, another former Crewe player, Anthony Hughes, said that he too had been abused by Bennell. Wales and Manchester United youth player Matthew Monaghan, former Preston North End reserve team player David Lean, and Wimbledon and ex Northern Ireland international Mark Williams also alleged abuse by Bennell.\nDoubt regarding Crewe's claims of ignorance began to emerge on 25 November. First, Hamilton Smith, a director at Crewe Alexandra from 1986 to 1990, told The Guardian that the club heard an allegation that Bennell had sexually abused a junior footballer. However, Bennell was allowed to stay at the club – despite the then chairman, Norman Rowlinson, recommending that the club \"get him out\" and raising concerns with Manchester City – so long as Bennell was not left alone with boys and was stopped from arranging overnight stays. In February 2018, it was reported that Rowlinson had sought police advice about Bennell and had been advised to \"move him on\". Smith said fellow directors did not want to rely on hearsay evidence and local gossip. In 2001, Smith met Tony Pickerin, the Football Association's head of education and child protection (formerly head of the FA's national school at Lilleshall), and requested an FA investigation into the care of children at Gresty Road. He said he later received a three-line letter from Pickerin saying the FA had \"investigated the issues and is satisfied that there is no case to answer\".\nSecondly, on 7 December 2016, the BBC reported that the mother of a former Crewe youth team player wrote an anonymous letter to Dario Gradi in 1989–90, asking him to investigate \"inappropriate\" behaviour involving a member of staff, who \"took lots of boys into his room overnight\" during a weekend away in Blackpool.\nBennell history\nOnce a youth player at Chelsea, Bennell had worked for at least four English professional clubs: Manchester City, Crewe (from around 1984 until he was sacked in 1992 for reasons that were then not made public),}} Stoke City and Leeds United, and from 1992 to 1994 was head coach of the Staffordshire side Stone Dominoes. During a 1994 Dominoes tour to the United States, a 13-year-old club player claimed that Bennell had sexually abused him. Bennell was arrested in Jacksonville, Florida, and eventually charged on six counts of sexual battery and lewd and lascivious behavior. He pleaded guilty and was sentenced to four years' imprisonment.\nIn the meantime, in 1996, a Channel 4 Dispatches programme highlighted child abuse allegations involving Bennell (also other coaches: Keith Ketley in Ipswich, Bob Higgins in Hampshire). The documentary featured Ian Ackley, a former player at Derbyshire youth side White Knowl, who was one of four boys who had come forward to British police after Bennell's US arrest. As a result, although Bennell did not serve the full term of imprisonment in America, he was arrested again on his return to England.\nIn February 1998, Bennell appeared at Mold Crown Court in north Wales and pleaded not guilty to charges of indecent assault, buggery and attempted buggery dating back to the 1970s and 1980s through to 1992, against children aged between nine and 15, with offences alleged to have taken place in Derbyshire, in the Crewe area and at Butlin's in Pwllheli, north Wales. Bennell was remanded in custody to appear at Chester Crown Court in June 1998. At Chester, Bennell was found guilty of 23 offences against six boys (including Ian Ackley), and received a nine-year jail sentence (a further 22 offences were left on file because the Crown Prosecution Service decided it was better not to put young boys through the trauma of a trial). In May 2015, Bennell (then calling himself 'Richard Jones' and living in Milton Keynes) received a further sentence of two years after pleading guilty to sexually abusing David Lean at a camp in Macclesfield in 1980. (In January 2022, David Lean received a compensation payment from Butlin's current owner, Hard Rock Cafe, for the abuse he suffered by Bennell.)\nAt the inquest in 2012 into the death of Gary Speed, it was alleged that Speed and former Manchester United player Alan Davies had been \"favourites\" of Bennell, though there was no suggestion they had been abused by Bennell. Both players later died by suicide, as did Mark Hazeldine, coached by Bennell at Manchester City in the early 1980s.\n2016 and 2017 charges\nIn November 2016, Thames Valley Police visited Bennell's Milton Keynes address, though they said this was \"in response to a safeguarding concern\" and it was not investigating any offences. Bennell was taken to hospital in Stevenage after being found unconscious in Knebworth Park on Friday 25 November; Thames Valley police said officers had been called to a \"fear for welfare\" incident. It was believed Bennell was staying at a hotel after leaving his Milton Keynes home as the scandal broke. On 29 November 2016, then 62-year-old Bennell was charged with eight counts of sexual assault against a boy aged under 14, alleged to have taken place between 1981 and 1985. Bennell appeared by videolink at South Cheshire magistrates' court in Crewe on 14 December, and was remanded in custody to appear at Chester Crown Court in January 2017. On 16 January 2017, speaking via videolink from HM Prison Woodhill, Bennell pleaded not guilty to the charges, and was remanded in custody until 20 March 2017.\nOn 7 March 2017, Bennell was charged with eight further counts of child sexual abuse. He appeared at South Cheshire magistrates' court via video-link on 13 March, when an additional four charges were also made, and was remanded in custody to appear at Chester Crown Court on 22 March, when all 20 charges against him were dealt with together. At that hearing, Bennell pleaded not guilty to 14 counts of indecent assault, five counts of buggery and one count of attempted buggery. The case was adjourned to 3 July 2017 at Liverpool Crown Court with a trial listed for January 2018 in Liverpool.\nIn May 2017, Bennell appeared in court having been charged with a further 21 offences: 18 counts of indecent assault, two of serious sexual assault and one of attempted sexual assault, relating to four boys aged between 14 and 16, and alleged to have taken place between 1983 and 1991.\nIn June 2017, Bennell appeared in court charged with a further 14 offences (bringing the total to 55); ten of these charges related to indecent assaults on four 11- to 14-year-olds, four for alleged buggery. He made court appearances on 28 June and 17 July, when he was remanded in custody ahead of a trial due to start on 8 January 2018.\n2018 trial and conviction\nAs Bennell had previously changed his name to Richard Jones, in court he was referred to as 'Mr Jones'. At the start of his trial on 8 January 2018, he pleaded guilty to seven offences of indecent assault committed between 1981 and 1991 against three boys. As the prosecution presented evidence relating to the remaining 48 charges, he appeared via video-link due to an illness that required him to be fed through a tube. The jury was sent out to consider its verdict on 8 February 2018, having been directed to return not guilty verdicts in respect of three indecent assault charges where no evidence had been offered. On 13 February 2018, Bennell was found guilty of 36 sex offences; after the jury were given more time to consider other counts, on 15 February he was convicted of seven further offences. Following the earlier seven guilty pleas, he was sentenced on Monday 19 February for a total of 50 offences against 12 boys, and was jailed for 31 years (being expected to serve half in custody, with the rest on licence).\nAfter the guilty verdicts, victims Andy Woodward, Micky Fallon, Chris Unsworth and Steve Walters read statements outside Liverpool Crown Court; another victim, Gary Cliffe (a serving police officer investigating child abuse) waived his anonymity to speak about the abuse he had experienced, aged 11 to 15, from Bennell while at Manchester City. The club offered its \"heartfelt sympathy to all victims for the unimaginably traumatic experiences they have endured\", and said an internal review had identified serious allegations of child sex abuse in respect of a second man, John Broome (now dead), with \"potential historic connections to the club\". Crewe Alexandra expressed its \"deepest sympathies\" to Bennell's victims, saying it was not aware of any sexual abuse by Bennell nor had it received any complaint about sexual abuse by him before or during his employment with the club. This claim was disputed: the Guardian alleged Bennell had to leave Crewe following a complaint against him, having been identified as a risk long before joining Crewe, amid a cover-up at Manchester City. Barrister Lord Carlile, who prosecuted Bennell in 1998, accused Crewe of 'brushing the scandal under the carpet'.\nFollowing complaints from other former players (the Guardian said there had been allegations from another 86 [February 2018], later \"at least 97\" [February 2019]), mostly from Manchester City and Crewe, Bennell was reported to be likely to face a further trial, though the judge (Clement Goldstone QC) said the Crown Prosecution Service would have to think carefully as Bennell \"may well die in prison.\" In September 2018, it was reported that the police and Crown Prosecution Service regarded some of allegations, particularly the rape of minors, as serious enough to warrant criminal action, potentially in 2019.\nIn April 2018, it was reported that Bennell was appealing against his 30-year sentence. In June 2018, his appeal was rejected and the sentence was upheld by three judges at the Court of Appeal in London.\nAdditional background revealed in 2019\nOn 25 February 2019, The Guardian reported on a nine-page statement from Crewe manager Dario Gradi about what he knew regarding Bennell. Gradi admitted to encouraging a close player-coach culture and to not making detailed background checks about Bennell because Crewe was trying to poach him from Manchester City \"on the quiet\". Club chairman John Bowler said Crewe had not appreciated the dangers of football being used as a means for an abuser to prey on young boys (\"documented procedures that are now in place for the protection of minors were not in place at that time\"), while Gradi had not made detailed inquiries into Bennell's background (\"He did not have any specific coaching qualifications but none were required and at the time the FA did not publish any guidance on child protection”). However, former club secretary Gill Palin had been uncomfortable about Bennell. Three days later, Steve Walters accused Crewe of showing \"no humanity\" and \"victim blaming\" in a bid to avoid compensation payouts, and of claiming Walters had waited too long to report abuse. The club said Walters's claims included (unspecified) \"fundamental inaccuracies\". Walters and at least one other former Crewe player have each launched High Court damages claims of upwards of £200,000 against the club.\nOn 19 March 2019, the Guardian reported Crewe Alexandra planned to contest victims' claims, using specialist lawyers – appointed for the club by Football League insurers – with experience of defending child sex abuse allegations involving the Catholic church. The lawyers argued the club should not be liable for alleged incidents from the 1980s and 1990s that were not committed as part of Bennell's official club duties (Bennell allegedly also ran a feeder team, Railway Juniors, set up by parents) and also argued that, under the Limitation Act 1980, the incidents should be disregarded as victims had not reported them years earlier. However, on 27 March 2019, the Guardian reported an apparent U-turn in Crewe's approach; it had agreed an out-of-court financial settlement with one of Bennell's victims.\nIn June 2019, shortly before publication of Andy Woodward's biography, The Guardian reported that Barry Bennell's cousin, Ronald Bennell, had been jailed in 1971 for the murder of his aunt, Lynda Stewart, and that Barry Bennell had married Woodward's older sister, also named Lynda, in 1991. The Guardian also said Woodward unsuccessfully sued Crewe for damages in 2004.\n2020 charges\nOn 18 May 2020, Bennell, 66, appeared at Warrington magistrates' court via video link from HM Prison Littlehey in Cambridgeshire, charged with nine non-recent sexual offences in relation to two complainants. On 31 July 2020 at Chester Crown Court, Bennell pleaded guilty to the nine offences, carried out between 1979 and 1988; the hearing was then adjourned to October. On 8 October 2020, Bennell was sentenced to an additional four years in prison after being convicted for a fifth time. The term made his total prison sentence 34 years with a further two years on licence.\nDamages claims against Bennell's former clubs\nIn May 2020, it was reported that eight men sexually abused by Barry Bennell were pursuing damages claims against Manchester City (two were also bringing claims against Crewe Alexandra); all eight claims would be heard together at an eight-week trial starting in October 2021, with Manchester City lawyers proposing to call Bennell to give evidence. When the High Court case began in October 2021, the court heard Bennell had operated as a Manchester City scout, carrying a card describing him as City's \"north-west representative\", and that Bennell had been involved in City schoolboy trials. Bennell gave evidence by video-link from prison on 30 November 2021, denying a connection with Manchester City. On 10 January 2022, the High Court said the connection between the abuse and Bennell's relationship with City was \"insufficient to give rise to vicarious liability\" and ruled that City could not be held legally responsible for Bennell's acts of abuse; claimants planned to appeal against the judgement.\nDeath\nBennell died on 16 September 2023 whilst serving his sentence at HMP Littlehey. He was 69. He died of natural causes after being treated for cancer of the tonsils.\nFrank Roper\nFrank Roper (who died in 2005), head of Stockport-based feeder club, Nova, was associated with Blackpool F.C. and Barry Bennell. Youth coach Roper abused Paul Stewart, and was the subject of abuse complaints by Jason Dunford, plus groping allegations by former Leeds United player Jamie Forrester. On 23 November 2016, former Manchester City players David White and Paul Stewart made similar sex abuse allegations about Bennell, and about another coach, later named as Frank Roper, at the Nova feeder club.\nIn March 2021, the Sheldon Report said Roper had four convictions for indecent assault of children in the 1960s and 1980s, and used his \"close links\" to Blackpool to give himself a credibility and authority that he would otherwise not have had. Sheldon was \"satisfied\" that club officials knew about Roper giving gifts and money to young players and taking them on trips abroad. In July 2021, Blackpool appealed after being ordered to pay £19,000 in damages to a man, then aged 13, abused by Roper during a football tour to New Zealand in 1987; in September 2021, the Court of Appeal concluded Blackpool was not responsible for Roper's abuse, but the victim planned an appeal to the Supreme Court.\nGeorge Ormond\nOn 24 November 2016, The Guardian reported that an anonymous ex-footballer had contacted police to say he was a victim of George Ormond, a former Newcastle United youth coach who was jailed in December 2002 for offences against young footballers in the area. On 29 November 2016, The Guardian reported allegations by Derek Bell that he had been abused by George Ormond at the Montagu and North Fenham boys football club in the 1970s. Bell later played for Newcastle United (1980–1984) and on 1 December accused Newcastle of a cover-up over the abuse allegations. Bell claimed he alerted the club in 1998 but although Ormond's employment ended, his conduct was not investigated or reported to the police until 2001. The Guardian also reported allegations about Ormond from David Eatock, who signed for Newcastle as an 18-year-old in 1995.\nOrmond was described by a judge in 2002 as a \"predatory abuser\" after he was convicted of 12 indecent assaults and one attempted indecent assault on seven boys which had taken place between 1975 and 1999.\n2017 charges\nIn May 2017, Ormond, aged 61 and from Newton Abbot in Devon, was charged with 29 offences (27 of indecent assault, one charge of indecency with a child and one of buggery, relating to 17 male complainants and alleged to have taken place from 1973 to 1998). He appeared by videolink at Newcastle magistrates' court on 9 June, and was bailed to appear on 7 July 2017 at Newcastle Crown Court. In that appearance, he denied 35 historic sexual offences (33 of indecent assault, one of gross indecency with a child and a serious sexual offence with a 15-year-old) said to relate to 18 complainants, and was bailed to reappear in May 2018.\n2018 trial and conviction\nOrmond's trial at Newcastle Crown Court started on 24 May 2018. He was charged with 38 sexual offences against 19 victims over a 25-year period from 1973 to 1998. This includes the time he worked at Newcastle United, at a north-east boys’ football club, and as a helper on the Duke of Edinburgh's Award scheme at a Newcastle school. The prosecution case concluded on 25 June; Ormond elected not to give evidence in the trial, and, after the judge's summing up, the jury retired to consider its verdicts on 29 June. On 3 July 2018, the jury returned guilty verdicts on 36 counts of sexual abuse against 18 victims over a 24-year period between 1973 and 1997 (he was acquitted of two other offences); the following day, Ormond was sentenced to 20 years in prison.\nNewcastle United made no comment apart from saying it had cooperated with the police and FA inquiries. Two victims of Ormond, Paul Chilton and Gary Weymes (and who both gave evidence against him), waived their right to anonymity and said Ormond's 20-year sentence was \"not enough\" while suggesting other victims had yet to come forward. In March 2021, Newcastle United was reported to be facing multiple civil claims relating to Ormond's abuse; the club's insurers denied responsibility insisting Ormond's crimes were unrelated to his work at Newcastle and that a legal timeframe had expired.\nEddie Heath\nOn 29 November 2016, Chelsea announced it was investigating allegations of historical sexual abuse in the 1970s, including a secret payment to a former player who had accused the club’s ex-chief scout Eddie Heath of child sexual abuse. On 2 December, the former player was named as Gary Johnson, who said he was paid £50,000 not to go public with allegations that he was sexually abused by Heath; the following day, Chelsea apologised \"profusely\" to Johnson, who later demanded further financial compensation from the club. Also on 3 December, The Independent reported an allegation from another Chelsea youth player that Dario Gradi, then Chelsea's assistant manager, visited the player's family's home to \"smooth over\" a complaint of sexual assault against Heath in 1974; Gradi was among the first to be targeted by the FA's enquiry, and, in connection with these allegations, on 11 December 2016, the FA announced that it had suspended Gradi (Gradi subsequently said he had been notified by the FA of his interim suspension from football on 25 November, and reiterated \"that I will do everything within my power to assist all investigatory authorities\"). Former Chelsea youth goalkeeper Derek Richardson became the third player to allege abuse by Heath.\nOn 4 December 2016, Heath was the subject of allegations of early 1980s abuse made by former youth player Russell Davy, at another London club, Charlton Athletic; Davy also wrote to the FA about Heath but his letter was not even acknowledged. Later the same month, another Charlton youth player Paul Collins also alleged abuse by Heath.\nIn the 1950s and 1960s, Heath was employed at Leyton Orient (former goalkeeper Peter Chapman described him as \"the dark eminence of Orient's youth outfit\"), where his sexual abuse was common knowledge among players including former captain Jimmy Scott, before joining Chelsea. In 1979, he contested his dismissal from Chelsea by then manager Geoff Hurst at an industrial tribunal. After leaving Chelsea, he worked at Millwall and then Charlton Athletic, before dying of a heart attack in the early 1980s.\nIn August 2019, Chelsea's board apologised \"unreservedly\" for allowing Heath, a \"prolific and manipulative sexual abuser\", to operate \"unchallenged\". The apology followed an inquiry led by barrister Charles Geekie QC, who was also critical of former assistant manager Gradi. He was accused of failing to tell senior club staff about a sexual conduct allegation concerning Heath made by the parent of a young player.\nBob Higgins\nAt Southampton, former trainees Dean Radford, Jamie Webb and, later, Billy Seymour told the BBC about incidents they said happened when they were in their teens. Matt Le Tissier, who joined Southampton as a trainee in the mid-1980s, recalled being given a naked massage by Higgins. Le Tissier reiterated that he does not feel that he was abused, but thought this incident and other behaviour he witnessed was \"very wrong\". By 4 December 2016, six players had alleged abuse by an ex-Southampton employee, and various media named him as Bob Higgins, until recently a first team coach (said not to be  involved with youth players) at non-league side Fleet Town.\nBob Higgins was dismissed by Southampton in 1989 after several allegations were made against him, and after he set up the \"Bob Higgins Soccer Academy\", the Football League wrote to all clubs in April 1989 warning them against any involvement with it. He then joined the Malta Football Association.\nIn 1991 he was charged with six counts of indecent assault against young boys he had been coaching; at the trial at Southampton Crown Court, he was acquitted on the direction of the judge when the prosecution offered no evidence. Higgins was suspended by the Malta FA between 1990 and 1992 when the original allegations were made, reinstated on a year's probation after being cleared, and then left in 1994. While working in Malta, Higgins was said to have 'showered naked' with young players; one youth said it was common for Higgins to drive him in his car and touch him around his neck and his legs.\nHiggins then worked as a youth coach at Peterborough United from May 1995 to April 1996, and was investigated as part of the 1997 Channel 4 Dispatches investigation, and denied allegations of abuse, claiming he was a faith healer and born again Christian. One former youth player alleged Higgins provided \"soapy massages\"; another, 'Jon' (not his real name), said he was left emotionally scarred and needing treatment for mental health issues, and that complaints made in 2013 to Peterborough resulted in no action.\nIn 1997, letters were sent to clubs and youth groups warning them that Higgins posed a risk to children. Higgins was then appointed manager of non-league Bashley, until he was sacked in 2001. The BBC reported that Higgins then worked at Winchester City for a few months; \"At a meeting with Hampshire County Council and the local FA, Winchester representatives were shown the TV documentary that had aired a few years earlier and it was made clear it was inappropriate for Mr Higgins to stay at the club.\"\n2017 charges\nOn 5 July 2017, Higgins was charged with 65 counts of indecent assault. The offences were alleged to have taken place in the 1980s and 1990s and to have involved 23 alleged victims. He appeared at West Hampshire (Southampton) Magistrates' Court on 20 July, when he indicated he would plead not guilty to the alleged offences and was given unconditional bail until a hearing at Winchester Crown Court on 16 August 2017. At a pre-trial hearing in January 2018, Higgins denied 50 charges of abusing 24 boys between 1970 and 1996; he was set to stand trial at Salisbury Crown Court on 29 May 2018.\n2018 trial and 2019 retrial\nThe trial at Salisbury Crown Court started on 29 May 2018, with Higgins, 65, denying 50 counts of indecent assault between 1971 and 1996 in relation to 24 boys. The prosecution case started on 30 May, with the trial scheduled to last six to eight weeks. The jury retired to consider their verdicts on 17 July 2018. On 23 July, Higgins was found guilty of one charge of indecent assault, and not guilty of another count of the same offence, while the jury failed to reach verdicts on 48 other counts of the same charge. The retrial, on 51 counts of indecent assault, commenced on 26 March 2019 at Bournemouth Crown Court. On 23 May 2019, Higgins was found guilty of 45 charges of indecent assault against teenage boys, not guilty of five counts of indecent assault, with the jury unable to reach a verdict on one final count. On 12 June 2019, Higgins was sentenced to 24 years and three months in prison.\n2021 Barnardo's report\nIn November 2021, a report by the children's charity Barnardo's criticised Southampton F.C. for missing opportunities to prevent Higgins from abusing schoolboy footballers: \"adults in Southampton Football Club during the time Higgins worked for them or on their behalf did not consider the welfare and wellbeing of the boys involved with the club as their prime consideration.\" It said the damage caused was \"incalculable\" and \"devastating\". The report also highlighted that Higgins knew Bennell and Carson, saying \"it is highly probable that these individuals would have had some awareness of each other’s proclivities.\" Southampton issued a deep apology, admitting it had \"completely failed to protect so many young people from suffering abuse over a long period of time\".\nHugh Stevenson\nOn 5 December 2016, allegations spread to Scotland when a former youth football coach and assistant referee, Hugh Stevenson (who died in 2004), was accused by Peter Haynes of child sex offences over a three to four-year period said to have begun on the day of the 1979 Scottish Cup Final between Rangers and Hibernian at Hampden Park. Stevenson was assistant referee in at least four international matches, including the England v Wales home international at Wembley in 1977, and was a club official at Eastercraigs Boys Club between the late 1970s and mid 1980s, before being asked to leave after attempting inappropriate contact with a boy at another club. He then moved to the Glasgow-based Chelsea Boys Club, which had an affiliation to the London club, and later was involved with the Paisley-based Ferguslie United and Cowdenbeath. Police Scotland confirmed that a then 55-year-old man had been investigated by Strathclyde Police in 1993 and 1996, with reports submitted to the Crown Office and Procurator Fiscal Service each time.\nAlso on 5 December 2016, Mitch Agnew, part of Ferguslie United's coaching set-up in the 1990s and a senior figure in the Scottish Youth Football Association, was suspended pending an investigation. In February 2017, he was cleared to return to work after an SYFA investigation was \"unable to identify any substantive proof\".\nJim McCafferty\nIn Belfast, on 7 December 2016, former Celtic youth coach Jim McCafferty was charged with offences relating to sexual activity with a child, allegedly committed in Northern Ireland. On 5 January 2017, he appeared via video-link from Maghaberry jail in County Antrim at Belfast Laganside court, charged with engaging in sexual activity with a child aged between 13 and 16 in Northern Ireland between December 2011 and December 2014. At this and a further court hearing, he was remanded in custody. McCafferty was due to appear at Laganside on Friday 1 September, but proceedings were delayed pending medical reports. At a further court hearing on 27 September 2017, McCafferty's intention to plead guilty to at least two of eight sex charges was considered, but the arraignment hearing was adjourned until November 2017 to allow psychiatric reports. In February 2018 at Belfast Crown Court, McCafferty was formally arraigned on eight charges, with a trial date set for 21 May 2018.\nMcCafferty, former kitman for Celtic, Hibernian and Falkirk, admitted abusing teenagers in the 1980s and 1990s while coaching boys’ and junior teams in West Lothian, Scotland, and at Celtic between 1990 and 1996.\n2018 and 2019 trials and convictions\nOn 21 May 2018, McCafferty, aged 71, pleaded guilty to all eight charges at Laganside Courts in Belfast. McCafferty was remanded to Maghaberry Prison pending a sentencing hearing to take place on 22 June 2018. Sentencing was later adjourned to 13 August 2018 when McCafferty was sentenced to three years and nine months in prison.\nIn a further trial in May 2019, at Edinburgh High Court, McCafferty was jailed for six years and nine months after pleading guilty to 11 charges of abusing teenagers between 1972 and 1996. The victims abused by McCafferty were at Celtic Boys Club, Celtic's youth team, and at youth teams he ran in North Lanarkshire. McCafferty was reported to have connections to Barry Bennell, taking youth players to Manchester and Crewe.\nMcCafferty, 76, died in HM Prison Glenochil on 19 November 2022.\nPaul McCann\nOn 5 January 2017, the FA suspended former youth coach Paul McCann, who worked for Crewe in a voluntary capacity in the 1980s and 90s and was assistant coach of the club's under-16s youth team for a time, and later a volunteer youth coach at Merseyside non-league club AFC Bebington in 2014–15.\n2018 charges, trial and acquittal\nAlmost a year later, on 3 January 2018, McCann, 57, appeared at South Cheshire magistrates' court charged with six non-recent sexual offences, including indecent assault on a boy under the age of 16 years and indecent assault on the same victim when aged 16 or over, dating back to 1987–1989. McCann, from Great Sutton in Cheshire, appeared at Chester Crown Court on 31 January when he denied the charges and was released on unconditional bail. He again denied the charges when his trial at Chester Crown Court began on 8 October, and on 18 October 2018 was acquitted of all charges.\nMichael Carson\nOn 27 January 2017, it was reported that (after Higgins) a second former Peterborough United coach had been arrested during investigations into historical sexual abuse. Michael Sean \"Kit\" Carson, 73, was held in Cambridge on suspicion of indecency with children and indecent assault; the following day, he was released on bail until 6 March.\nCarson worked at Norwich City from 1983 until 1993, and was academy director at Peterborough from 1993 to 2001 (overlapping with Bob Higgins for almost a year; one child abuse victim was reportedly assaulted by both men), before leaving to become head of talent development at Cambridge United from 2001 to 2005.\n2018 charges\nOn 2 March 2018 it was announced that Carson had been charged with 11 counts of indecent assault and one of inciting a child to engage in sexual activity. The alleged offences all involved boys under 16, and were said to have occurred from 1978 to 2009. He appeared at Cambridge magistrates' court on 17 April, pleading not guilty to the 12 charges, then appeared at Peterborough Crown Court on 15 May 2018 when he was released on bail.\nDeath\nCarson, 75, was killed when the car he was driving crashed into a tree near Bottisham in Cambridgeshire on 7 January 2019, the day his trial was due to start at Peterborough Crown Court; no other vehicle was involved. An inquest into his death was opened on 22 January, when it was confirmed Carson died from a traumatic brain injury; in September 2019, the inquest concluded Carson had taken his own life.\nTed Langford\nOn 30 January 2017, former Leicester City trainee Tony Brien told the BBC that he had been abused from the age of 12 by club scout Ted Langford (d.2012) in the 1980s while at local youth team Dunlop Terriers (Langford had been named in allegations which surfaced in December 2016). Brien said he had been assaulted on the pretext that the scout needed the player's sperm to establish whether he had a \"footballer's gene\". When Langford moved to Aston Villa, Brien says he had \"two or three\" conversations with the club's former assistant manager Dave Richardson and another senior figure, but was put off from going public with the allegations. In September 2017, it was reported that Graham Taylor (then manager of Aston Villa, and later manager of England) had discouraged Brien from reporting what had happened, telling him that he should \"move on\".\nLangford was sacked by Aston Villa in 1988. He later admitted sex offences, dating from 1976 until after he left the club in 1989; he was sentenced to three years in prison in 2007 for the sexual abuse of four young players (excluding Brien) in the 1970s and 80s. He died in 2012.\nHarry Dunn\nOn 24 March 2017, it was reported that 84-year-old former youth football scout Harry Dunn, who had worked at Liverpool, Rangers and Chelsea, had been arrested by Scottish police investigating allegations of historical sex abuse. In February 2017, Dunn had been the subject of allegations by a former Rangers youth player, Darren Mixon, concerning an incident in 1984. In November 2017, it was reported that Dunn had died awaiting trial.\nJames Torbett\nJames Torbett, a former Celtic Boys Club manager, was found guilty in 1998 of shameless and indecent conduct with three juvenile players between October 1967 and March 1974, and given a prison sentence of 30 months. In April 2017, a BBC Scotland programme Football Abuse: The Ugly Side of the Beautiful Game, alleged that the reasons for Torbett leaving Celtic Boys' Club in 1974 were covered up, that Torbett was allowed to return to the Boys' Club, and that two youth players (one named as Kenny Campbell) were abused by Torbett in his second spell at the Boys' Club during the 1980s and 1990s – claims which Torbett has \"vehemently\" denied. Tracked down in America, Torbett was confronted by a BBC Scotland reporter about the Campbell allegations; he said: \"I have a lot to say. I'll see him in court,\" and denied being a paedophile.\n2017 charges\nIn early May 2017, following a visit from US Homeland Security, he returned to the UK; he was subsequently arrested and charged with six offences (three of indecent assault and three of lewd, indecent and libidinous practices), and on 5 May 2017 appeared at Glasgow Sheriff Court where he was released on bail. In April 2018, Torbett appeared at the High Court in Glasgow where he faced 12 historical sexual abuse charges dating from January 1970 to August 1994; a June 2018 trial date was set.\n2018 and 2023 trials and convictions\nThe trial, expected to last ten days, started on 25 June 2018, with Torbett denying all charges. On 4 July 2018, a contempt of court order was issued regarding the case. On 22 October 2018, Torbett went on trial again at the Justiciary Buildings in Glasgow, charged with nine offences of sexual assault on six children between 1970 and 1990. On 5 November 2018, he was found guilty of five offences against three boys and was sentenced to six years in prison.\nIn April 2023 at the High Court in Inverness, Torbett was found guilty of four charges of sexually abusing a 13-year-old player in 1967. Previously potentially eligible for early release in May 2024, he was jailed for a further three years.\nGordon Neely\nThe same BBC Scotland programme also made new allegations against Gordon Neely (who died in 2014), a youth coach at Rangers in the 1980s who, after abuse allegations were made, had been \"dismissed immediately,\" the Glasgow club said. Neely had also been accused by former youth player Colin Anderson of abuse at Edinburgh youth club Hutchison Vale. According to the BBC, youth player Jon Cleland was repeatedly raped by Neely while at Hutchison Vale and at Hibernian (Neely took up a youth development position with Hibs in around 1983). After abuse allegations were made against Neely in 1986, he was sacked by Hibs who did not inform the police or his new employer Rangers FC. After he was accused of abuse at Rangers he was sacked. Rangers claim to have informed the police, however Neely’s accuser denies this. After he left Rangers in about 1990, he allegedly continued to abuse young players when offering one-to-one training and activity weekends in Dunkeld and Dalguise, Perthshire, for young footballers.\nGerald King\nIn mid April 2017, Gerald King, a former chairman of Celtic Boys Club, was charged by police with non-recent sexual offences. In February 2018, he pleaded not guilty to seven offences, and was bailed. His bail was extended at hearings at Glasgow Sheriff Court on 17 April and 23 May 2018. King's trial began on 26 November 2018 at Glasgow Sheriff Court. King, 66, was accused of lewd and libidinous practices towards five boys and two girls while he was a teacher at a Glasgow school, between August 1983 and June 1989; he was also charged with taking or permitting to be taken indecent images of children between January 1987 and December 1988 at Barrowfield football park in Glasgow. On 5 December 2018, King was convicted of five charges of using lewd and libidinous practises towards five victims between August 1984 and April 1989, and found guilty of taking indecent pictures of children in February 1987. Sentencing was deferred until 7 January 2019 when King was given a three-year probation order, ordered to do community service and put on the sex offenders register for five years.\nFrank Cairney\nIn late April 2017, Frank Cairney, a former Celtic Boys Club coach and manager (who, in November 1998, had been acquitted of charges of shameless indecency towards young football players due to lack of evidence), was charged in connection with six alleged historical sexual offences. He appeared at Hamilton Sheriff Court on 11 May 2018, facing ten charges of alleged abuse between 1965 and 1986, including indecent assault, gross indecency and lewd, indecent and libidinous practices and behaviour. After Cairney's defence team requested a delay to investigate witness statements, the trial at Hamilton began in early December 2018 with Cairney, 82, denying all ten charges. On 14 December, Cairney was found guilty of nine charges of sexually abusing young footballers, placed on the sex offenders register and was granted bail before being sentenced. On 7 February 2019, Cairney was jailed for four years.\nFurther allegations against Cairney emerged after other victims contacted police in 2018 and 2019 (in July 2019, Cairney was reported to be of interest to police in Kearny, New Jersey over allegations of sexual assault of a 16-year-old player during a 1991 Celtic Boys Club tour to the US), and, in January 2023, Cairney was due to stand trial on three indecent assaults at Glasgow Sheriff Court. However, while a judge accepted the allegations, Cairney, 87, was found to be unfit to stand trial, suffering from health problems including dementia.\nRobert Smith\nRobert Smith was jailed for 27 months in 2016 for sexually abusing three boys aged between nine and 12 who played for a football team he was coaching in the Easterhouse area of Glasgow in the 1980s. In June 2018, he pleaded guilty to six further charges: four charges of using lewd and libidinous practices and two charges of indecent assault. On 13 July 2018, Smith, 69, was sentenced to 20 months in prison.\nWilliam Toner\nOn 20 July 2018, William Toner, 74, was jailed for three years and two months on four counts of indecent assault against a teenage boy in the 1990s. A trial heard he preyed on a junior footballer after claiming to work for Manchester City and having links to clubs in Bury, Rochdale, Oldham and Cambridgeshire.\nMichael Coleman\nAlso on 20 July 2018, Michael Coleman, 75, was jailed for seven years on three counts of indecent assault at Bolton Crown Court.  He was unconnected to any senior club when he committed his crimes in the 1980s while he was manager of Westhoughton Sports Centre.\nNorman Shaw\nOn 15 January 2019 at the High Court in Edinburgh, former football coach Norman Shaw, 84, was jailed for nine years for sexual abuse against boys between August 1979 and December 1989 when he was involved with a children's team called Perth Rovers.\nDavid Daniel Hayes\nIn February 2019, David Daniel Hayes, 40, former press officer at Bangor City, went on trial at Mold Crown Court, accused of 13 child sex offences. Charged with offences in 2015, he became a fugitive from justice before being re-arrested in Spain in July 2018. On 20 February 2019, Hayes was found guilty of 12 sexual offences, including rape, against a girl and boy who were aged 10 or under at the time they were subject to his abuse. Ahead of a sentencing hearing, Hayes was told to expect a \"lengthy custodial sentence\", and on 26 March 2019 was jailed for 23 years.\nPhil Edwards\nPhil Edwards, once a physiotherapist at Watford, was arrested in early 2019 on suspicion of sexual activity with a teenage boy in the 1990s, and died while an inquiry into the alleged offence was under way. Further allegations of sexual abuse were made by more than 20 people, and the club, while launching its own investigation, compiled a file for submission to the FA's Sheldon inquiry.\nDylan Lamb\nLamb (also known as Johnathan Haythorne and Jonathan Haythorne Price), a football and hockey coach, sexually abused five teenage boys, targeting victims in Rotherham, Doncaster and Brigg from the 1970s through to early 2000. Reported after publicity by the Football Association, Lamb, 72, was arrested, and later tried, convicted and sentenced to 30 years imprisonment at Sheffield Crown Court in December 2019.\nGeoff Broome\nBroome worked as youth football coach at Scunthorpe United, Grimsby Town and other Lincolnshire youth teams in the 1980s and 1990s. In 1987, he received a caution for indecent assault on two 11-year-old boys. In 1996, Scunthorpe United's chief executive was notified about the caution, but Broome was allowed to continue coaching activities. Later the same year, Scunthorpe United met with Humberside Social Services, and it was decided Broome should not supervise footballers under the age of 16. However, he was allowed on an under-16 trip to Ayr in 1997, where he slept in a dormitory with under 16s. Broome was dismissed in 1997, but re-employed in 1998. Then, after receiving confirmation of Broome's caution from Humberside Police, Scunthorpe United dismissed him again in 1999. In 2000, the FA confirmed that Broome could not have contact with children through football, but he was spotted talking to under-14 footballers in 2001 and later became involved with children's football in a Lincolnshire league. In 2005, the Lincolnshire FA removed the children's teams from the league. Humberside Police launched an investigation into Broome in 2016. In 2017 he was caught by a paedophile vigilante group in Hull after arranging a meeting with what he thought was a young boy. Broome was later arrested and charged with eight counts of indecent assault on underage boys. At Doncaster Crown Court in April 2021, he was found guilty of all eight charges and sentenced to four years in prison. Further, unproven, allegations were made against Broome in October 2021.\nOther alleged abusers\nAlleged abusers also included (in alphabetical order):\n* Former Hampshire FA chief Ray Barnes, involved in inquiries into Bob Higgins's conduct, was later convicted of indecently assaulting three boys.\n* John Broome (now dead) was named by Manchester City as someone allegedly engaged in sexual abuse at a Levenshulme-based feeder team Whitehill FC (now defunct), with an ex-player claiming damages from City.\n* Chris Gieler (who died in 2004), youth development manager and chief scout during a 32-year career at Queens Park Rangers, was also named in historical child abuse allegations.\n* John Hart (died in 1995), physiotherapist at Partick Thistle, was dismissed in 1992 over sex abuse allegations. Motherwell also launched an investigation into alleged historical sexual abuse as Hart had also worked at the Fir Park club.\n* Keith Ketley was a convicted sex offender who was still able to set up a Football Association-affiliated team, Ipswich Saracens. At the time of the 1999 Channel 4 Dispatches programme, he was serving five years in prison after being found guilty on four counts of indecent assault.\n* David King, convicted in 1997 of sexual offences against a 10-year-old pupil at the school where he was the headteacher, was an associate of George Ormond at Newcastle's Montagu and North Fenham boys football club.\n* Billy Watts (who died in 2009) was a caretaker at Manchester United, subject to disciplinary action in 1989 while working at the club’s former training ground, The Cliff, and moved to another position away from the club's youth team.\nResponse and investigations\nFootball bodies\nFootball Association\nOn 21 November 2016, the Football Association said it was setting up a helpline; this was established with the NSPCC and opened on 24 November, reportedly receiving over 50 calls within the first two hours, over 100 by 27 November, and 860 (\"more than three times as many referrals as in the first three days of the Jimmy Savile scandal\") by 1 December with 350 individuals alleging abuse. After three weeks, the call total had reached 1700. The FA and NSPCC also collaborated to produce a film about how to keep children safe in the sport, featuring the captains of England's men's, women's and cerebral palsy football teams (Wayne Rooney, Steph Houghton and Jack Rutter).\nAfter the Hamilton Smith interview suggesting the FA failed to thoroughly investigate Crewe's system, on 27 November, the FA announced it was to set up an internal review, led by independent counsel Kate Gallafent QC, into what Crewe and Manchester City knew about Barry Bennell and allegations of child sexual abuse in football, and investigate what information it was aware of at the time of the alleged offences.\nThe FA was criticised by Conservative MP Damian Collins, chair of the House of Commons' Culture, Media and Sport Committee, for being too slow in reacting and not instigating a wider review. Former sport minister Gerry Sutcliffe talked of previous concern about how the FA dealt with governance of the sport and with youth development (in the 1990s, the FA was said to have reacted \"dismissively\" to worries about sexual abuse in the game, and too slow to implement criminal record checks; in 2003, the FA had scrapped a project meant to ensure children were being protected from sexual abuse; and FA officials had been uncooperative with the review project, with ten of 14 FA staff not replying to interview requests and a report by the researchers of others being \"prevented/bullied\" from talking). Sutcliffe said an independent body, such as the Department for Culture, Media and Sport, should look at the issue rather than the FA investigating itself: \"What I've seen in football over the years is that they're very narrow, very insular, and may not do a proper job even though with the right intentions.\"\nOn 6 December 2016, the FA announced that, due to \"the increased scope of the review since it was announced\" and Gallafent's other professional commitments, the review would be conducted by Clive Sheldon QC. On the same day, it was announced that former Chelsea assistant manager Dario Gradi would be among the first to be targeted by the FA's enquiry over the \"smoothing over\" allegation, and five days later the FA announced Gradi had been suspended. Almost three months later, in February 2017, it was reported that Gradi planned to appeal against his FA suspension from football, feeling he had been left \"in limbo\".\nOn 5 January 2017, it was reported that the FA had suspended former Crewe youth coach Paul McCann (later cleared).\nThe FA collaborated with other UK sports bodies to support the NSPCC's Child Protection in Sport Unit (CPSU), founded in 2001 following various 1990s revelations of abuse, most notably in swimming. Brunel University's Daniel Rhind said the FA is today seen as a leading sports governing body for child protection with the system put in place since the CPSU was formed regarded as a \"gold standard\" model other countries can follow. In December 2016, the FA said that 99% of its 7,814 grassroots clubs, covering 62,238 teams, had responded to a deadline to renew their safeguarding policies and commitment. On 6 January 2017, the FA said 99.7% of clubs' coaches had valid criminal records checks but more than 2,500 coaches were without an in-date CRC, and so these clubs were facing potential suspension and removal of their FA affiliation.\nOn 11 January 2017, it was reported that the FA's review, led by Clive Sheldon, had made its first call for evidence, writing to all football clubs in England and Wales, amateur and professional, asking for information about allegations of child sexual abuse between 1970 and 2005. Clubs had until 15 March 2017 to respond. The FA's inquiry was expected to last around a year to 18 months. In May 2017, eight (unnamed) professional clubs were reported to have failed to respond to the FA's call for evidence, despite a deadline extension to the end of April, as investigators started to search 5,000 boxes of FA archives – each containing up to 1,000 pages. Sheldon issued a fresh appeal for victims of sexual abuse in football to come forward in July 2017. In October 2017, it was reported that six county Football Associations had not responded to requests for information five months after being asked to do so, while the volume of material involved would delay the final report until after Easter 2018. Ongoing criminal proceedings against Bennell, Higgins and others were also likely to limit what could be covered in the report. Sheldon and other members of the enquiry team were reported to be receiving counselling after hearing some victims' abuse accounts. In March 2018, it was reported that the scale of evidence provided, plus the \"chaotic nature of the archiving\", had delayed the inquiry team's sift through the FA's legal files; around 500,000 pages of material from 6,000 files were uploaded to a digital platform, and 353 documents were identified as highly relevant. All 46 county FAs had responded to the inquiry. Sheldon expected to start writing his final report in August 2018.\nIn October 2017, FA chairman Greg Clarke was criticised by Andy Woodward for 'humiliating' remarks Clarke made to a Digital, Culture, Media and Sport select committee hearing, while the Professional Footballers' Association's chief executive Gordon Taylor said the PFA might sue Clarke over suggestions Taylor had not supported Woodward with further counselling.\nIn July 2018, it was reported that the FA's independent inquiry had found no evidence of an institutional cover-up or of a paedophile ring operating within football. Sheldon's report, likely to be highly critical of several clubs, was initially expected to be delivered to the FA in September 2018, but its publication was delayed, potentially by up to a year, pending the retrial of Bob Higgins and possible further charges against Barry Bennell.\nThe 700-page report was published on 17 March 2021, suggesting there had been at least 240 suspects and 692 survivors. It identified failures to act adequately on complaints or rumours of sexual abuse at eight professional clubs: Aston Villa, Chelsea, Crewe Alexandra, Manchester City, Newcastle United, Peterborough, Southampton and Stoke City. While awareness of child abuse had previously been low, Sheldon said the FA was culpable of \"institutional failure\" in delaying the introduction of safeguards after 1995. Crewe Alexandra \"should have done more to check on the well-being of the boys\", Sheldon said, and similarly criticised Manchester City and Stoke City (other clubs associated with Bennell). Chelsea failed to protect a young player who reported abuse by Heath in 1975; Aston Villa should have reported sexual abuse by Langford to the police in July 1989; Newcastle United delayed acting on reports of abuse by Ormond; and Peterborough and Southampton failed to take steps to monitor Higgins. The report said clubs, including Blackpool, had also failed to undertake criminal background checks on adults working with young children.\nThe Sheldon report also made 13 recommendations for further improvements, including clubs employing qualified safeguarding officers, an FA board member to be the designated \"children’s safeguarding champion\", spot checks of amateur clubs, a \"national day of safeguarding in football\" and an annual safeguarding report. However, the measures were criticised for being too late and lacking ambition. The FA issued a \"heartfelt apology\" to survivors and said it would be implementing all of Sheldon’s recommendations.\nScottish Football Association\nAfter the Hugh Stevenson allegations emerged, Scottish Football Association chief executive Stewart Regan apologised \"deeply\" to Peter Haynes. Former SFA chief executive Gordon Smith, civil rights lawyer Raju Bhatt and Deputy First Minister John Swinney all called for an independent inquiry after Scottish First Minister Nicola Sturgeon rejected calls for an existing inquiry to be widened. On 13 December 2016, the SFA said it would set up an \"independent review\" of child abuse allegations in football; on the same date, of 15,385 coaches registered with the Scottish Youth Football Association, 2,500 had not had Protecting Vulnerable Groups (PVG) clearance, though this backlog was largely cleared ahead of a 31 August 2017 deadline. In February 2017, it was reported that the SFA's enquiry would be headed by Martin Henry, formerly a police protection chief and national manager of child sexual abuse prevention charity Stop it Now! Scotland.\nThe 192-page final report of the SFA enquiry was published in February 2021. Among 97 recommendations, it said clubs and organisations involved should \"make a clear, unreserved, and public acknowledgment and apology\" to all those directly affected. Clubs included Celtic Boys Club, Celtic, Falkirk, Forres Mechanics, Hamilton, Hibernian, Hutchison Vale, Motherwell, Rangers and Partick Thistle. SFA chief executive Ian Maxwell issued a \"sincerest apology on behalf of Scottish football to all who have experienced abuse in our national game\".\nOther bodies\nEight days after Woodward's initial revelations, the PFA said on 24 November 2016 that the number of players who had contacted it with similar stories had reached double figures, later (27 November) revising this to \"more than 20\" and adding Blackpool and Leeds United to the list of clubs implicated. In January 2017, it was reported that Steve Walters had been on a course of counselling at the Priory provided by the PFA.\nOn 7 December 2016, Premier League boss Richard Scudamore wrote to the parents of more than 3,000 players in the league's youth system to reassure them regarding child protection. On 23 December 2016, it was reported that Chelsea had not broken Premier League rules in failing to report 2014 allegations of historical sexual abuse made by Gary Johnson, but would undergo a safeguarding audit.\nIn Manchester on 5 December 2016, abuse victims Andy Woodward, Steve Walters, Chris Unsworth, Matthew Monaghan and Mark Williams launched a support organisation, the Offside Trust, to support player victims of abuse and their families (though it is unclear if this body is to become a registered charity). At the launch, the Trust's lawyer Ed Smethurst talked of alleged abusers still working \"in the senior echelons\" of football, of \"grave misgivings about the FA's independent inquiry\", and of new claims that clubs had paid 'hush money'. On 3 February 2017, it was announced that Woodward was stepping away from the Trust, having resigned as a director. On 20 August 2017, a celebrity football match was played at Curzon Ashton F.C. in Manchester to raise funds for the Trust.\nFootball clubs\nDario Gradi's 24 November statement mentioned Crewe Alexandra had established an internal review, and the club subsequently announced it would be holding an independent review into how they dealt with historical child sex abuse allegations: \"an independent review, to be conducted via the appointment of external legal counsel, is the correct way forward\". In February 2018, the club had not started this review, claiming an unnamed authority told them to hold off until the criminal case was over. On 2 March 2018, the club issued a statement saying that, as it had fully supported and co-operated with the police's detailed and comprehensive investigations, it did \"not intend to commission a further independent investigation to duplicate the thorough enquiries that have already been undertaken,\" and said the police's report had also been supplied to the FA's Sheldon review. Crewe's decision to shelve its own investigation was criticised by local MP Laura Smith (daughter of former club director Hamilton Smith) who said victims deserved nothing less than a thorough investigation which \"should be transparent and leave no stone unturned.\" The club was also excluded from the NorthWest Football Awards, was criticised by Damian Collins, chair of the DCMS select committee, and by Crewe Town Council, and was called to reconsider its decision by the PFA's Gordon Taylor. In his March 2021 report, Sheldon said he \"liaised with the Club and its lawyers with a view to suggesting other lines of enquiry that could usefully be followed up by the Club. Ultimately, the Club agreed to conduct those further enquiries, and provided me with a report setting out its conclusions.\" Crewe chairman John Bowler resigned following the report's publication. Under new chairman Charles Grant, the club then publicly apologised to abuse victims, and a number of victims (\"in 'double figures'\") subsequently met with directors and staff. Awarded an MBE in 1998, Gradi was stripped of the award in August 2023 following a professional disbarment for failing to protect children from sexual abuse.\nManchester City said it had opened an investigation regarding Bennell's association with the club in the 1980s; in May 2017, it was reported this was being led by Jane Mulcahy QC. In March 2019, a year after Bennell was convicted and jailed, and with the Mulcahy review still ongoing, Manchester City announced it had created a compensation fund for victims of historical child sexual abuse at the club. It was aware of 40 potential claimants (with more expected to come forward), and regarded the civil redress scheme as a preferable alternative to victims pursuing civil claims through the courts, as victims were doing in relation to Crewe.\nStoke said they were ready to launch an investigation into any allegation raised. On 25 November, Northumbria Police said their inquiries were \"ongoing\", while Newcastle United said it would cooperate with the police and relevant authorities. On 29 November, Chelsea announced it had appointed a law firm to carry out an investigation connected to allegations of historical sexual abuse in the 1970s; Chelsea's review was chaired by Charles Geekie QC, a specialist in child abuse cases, and its report into Eddie Heath's conduct was concluded in August 2019.\nThe FA's enquiry also linked to club enquiries. In May 2017, FA letters were sent to almost 20 clubs linked to the scandal to establish if they are holding their own reviews and, if not, why not. Clubs including Chelsea, Manchester City, Newcastle United, Southampton, Aston Villa, Blackpool and Crewe Alexandra were asked to submit evidence to Sheldon's own review. In March 2018, Clive Sheldon warned up to a dozen clubs they must hold their own investigations into abuse claims or he will do it, putting pressure on Crewe to reconsider its decision not to hold an inquiry.\nAction against Celtic FC\nFollowing the convictions of Jim McCafferty, Jim Torbett, Gerald King and Frank Cairney, Celtic FC were contacted by local MSPs Adam Tomkins and James Dornan (the latter a Celtic supporter whose son had once played for their youth teams and for Celtic Boys Club, giving him some insight into the close relationship between the organisations) due to what they perceived as an inadequate response and victim apology  from the club, and then published their letters via Twitter when no reply was forthcoming. The eventual reply from Peter Lawwell, Celtic's CEO, refuting \"unfair misconceptions\" and claiming to have been conducting their own investigation for some time, was also published. Tomkins subsequently criticised Celtic for obscuring the relationship between the football club and Celtic Boys Club, and for conducting a secret internal inquiry which could not \"help and support victims, which much surely be the paramount consideration.\"\nIn October 2020, the Guardian reported that 21 sexual abuse survivors were bringing a civil case against Celtic in 2021; in October 2021, 25 men claiming to be victims of historical sexual abuse at Celtic Boys Club launched group proceedings against Celtic. Following publication of the SFA's report in February 2021, Celtic issued a fresh apology over historic sexual abuse at their feeder team. In March 2022, a judge gave the go-ahead for 22 former Celtic Boys Club players and abuse survivors to launch a US-style 'class action' group claim against Celtic FC after agreeing the two clubs were \"intimately connected\". A hearing was expected to start in December 2022, but was postponed to allow lawyers more time to study new documents. Ahead of a scheduled June 2023 hearing, Celtic lawyers reportedly tried to get the action discontinued arguing that too much time has passed to allow a fair trial. In September 2023, ahead of a court hearing scheduled for October, Celtic FC began negotiations to settle legal claims of historical abuse brought by more than 20 former players.\nIn April 2025, following a lawsuit over claims of historical sexual abuse, Thompsons Solicitors said about 70% of cases relating to former Celtic Boys Club players had been settled by Celtic plc, resulting in a seven-figure payout. Further settlements were expected.\nPolice\nInitially, Cheshire police were reported to be liaising with Greater Manchester Police over the allegations, with the Manchester force later confirming it was launching an investigation and co-operating with Operation Hydrant, the national co-ordination hub for historical child abuse investigations concerning persons of public prominence. On 26 November Hampshire Police said it was looking into claims of \"non-recent child abuse within the football community\", while the Metropolitan Police also opened investigations. By 1 December, Staffordshire Police, Police Scotland, Essex Police, Norfolk Police and North Wales Police were reported to be among 17 forces examining claims of historical sex abuse in football. On 6 December 2016, the Police Service of Northern Ireland became the 21st UK police force to confirm it was investigating claims. On 13 December 2016, the Metropolitan Police said it was investigating 106 allegations of historical sexual abuse at 32 London football clubs (including four in the Premier League, two in the Championship, three against clubs in Leagues One and Two and 21 other clubs including non-league or non-professional or amateur teams). Some six weeks later (30 January 2017), the Met were reported to be investigating 255 separate allegations against individuals at 77 clubs, including all five London Premiership teams.\nBy 3 December 2016, 55 professional and non-league clubs had been cited by people claiming they were abused. On 9 December 2016, the National Police Chiefs' Council (NPCC) said 83 potential suspects and 98 clubs were involved in the inquiry into child abuse; on 21 December 2016, the NPCC's figures were updated to 155 suspects and 148 clubs, with detectives said to be examining possible attacks on 429 people. The \"higher than usual\" volume of calls was said to be delaying police interviews and investigations, with some respondents waiting more than a month; the first wave of victims waited an average of six weeks to be interviewed. The increase in allegations of child sexual abuse linked to football led Cheshire Police to ask the Home Office for extra funding.\nOn 18 January 2017, the NPCC said the number of affected clubs had grown to 248, up 100 since its December 2016 update. It said Operation Hydrant had received 1,016 referrals from the NSPCC and from police forces (up from 819), and had identified 184 suspects and 526 potential victims, of whom 97% are male, with ages ranging from four to 20 when the alleged abuse took place. In April 2017, Operation Hydrant was reported to have received over 400 new referrals since January, bringing the total to 1,432 referrals, and was investigating complaints involving 311 clubs, 23% of them professional. The NPCC said the number of victims at 31 March 2017 stood at 560 (96% of them male), with 252 suspects identified. Up to 30 June 2017, Police Scotland said over 150 people had reported being sexually abused as a child within a football club setting, 295 crimes had been recorded, and 11 people had been arrested. According to NPCC figures, a total of 741 alleged victims had come forward by 30 June 2017, with 276 suspects named, 1,886 incidents reported and 328 clubs at every level of football affected. The figures were updated on 28 September 2017, and 31 December 2017, recording 839 alleged victims, 294 alleged suspects, arising from 2094 referrals, impacting 334 clubs. In July 2018, police figures were reported to have identified 300 suspects, 849 alleged victims, and 2,807 incidents involving 340 different clubs.\nAs well as football, 27 referrals of victims were made from other sports including basketball, rugby, gymnastics, martial arts, tennis, wrestling, golf, sailing, athletics, cricket, and swimming.\nIn April 2017, it was reported that Operation Hydrant had received reports of incidents within football after 2005 (the FA inquiry's cut-off date), with 46 alleged attacks said to have occurred from 2005 to 2016, including 23 since 2011.\nPolice have speculated that the football revelations since 2016 \"may\" have contributed to an increase in the number of men and boys coming forward to make allegations of rape.\nGovernment\nOn 16 November 2017, almost exactly a year after the scandal first emerged, the sports minister Tracey Crouch announced that the Ministry of Justice had agreed changes to the law to make it illegal for sport coaches to have sex with 16- and 17-year-old children in their care, bringing the sport industry into line with sectors such as education and social care. However, this restriction had still not been enacted in January 2020. In July 2020, after a BBC investigation found over 160 cases of sports coaches engaging in sexual activity with a 16- or 17-year-old in their care since 2016, a lengthy judicial review continued, and the Sexual Offences Act remained unchanged.\nMedia\nIn addition to its news coverage of the scandal, the BBC produced a three-part television documentary, ''Football's Darkest Secret, first broadcast in March 2021, and Floodlights'', a film about Andy Woodward first broadcast on BBC Two on 17 May 2022.\nSee also\n* Penn State child sex abuse scandal, similar case in the U.S. where assistant American football coach Jerry Sandusky was convicted of molesting boys\n* Child abuse in football\nNotes\nReferences\nFurther reading\n*Jim Reed & Louis Lee Ray, (15 February 2018), \"[https://www.bbc.co.uk/news/resources/idt-sh/my_football_dreams_were_shattered_by_barry_bennell My football dreams were shattered by Barry Bennell]\", BBC News\nExternal links\n* [https://the-fa.com/7ZFDqu Clive Sheldon QC's independent report]\n*[https://www.chelseafc.com/en/news/2021/03/18/club-statement-on-sheldon-review Chelsea F.C. Statement on Sheldon Review]"
    }
  ]
}