{
  "content": [
    {
      "type": "text",
      "text": "# United States presidential inaugural balls\n\n}}\nand First Lady Jacqueline Kennedy, wearing a gown designed by Ethel Franken of Bergdorf Goodman, arrive at the D.C. Armory in Washington D.C. for an inaugural ball held on the evening of Inauguration Day, January 20, 1961]]\nUnited States presidential inaugural balls are large social gatherings, both white tie and black tie, held to celebrate the commencement of a new term of the president of the United States. Planned and sanctioned by the Presidential Inaugural Committee, the official inaugural balls occur throughout the evening of Inauguration Day in the Washington D.C. area and are invitation-only, attended by guests who are issued pre-paid tickets. The president, first lady, vice president, and second lady or gentleman all make personal appearances at each of the inaugural balls held in their honor. Catered food, beverages, and live entertainment performed by national and globally acclaimed musicians are provided at the inaugural balls.\nOther inaugural balls, unofficial and often less formal, also occur before and on Inauguration Day, being given by state societies, businesses, and private organizations.\nHistory\non March 4, 1897]]\nThe tradition of presidential inaugural balls in the United States has evolved over time. The first inaugural ball was held by sponsors on May 7, 1789, in New York City, one week after the first inauguration of George Washington.\nIn 1809, Dolley Madison hosted a gala at Long's Hotel in Washington D.C. after the first inauguration of James Madison was held earlier in the day at the United States Capitol, where a total of 400 tickets were sold for $4 a piece. In 1833, two balls were held for the second inauguration of Andrew Jackson, and in 1841, a third ball was added for the inauguration of William Henry Harrison.\nFor the inaugurations of Zachary Taylor in 1849, James Buchanan in 1857, and the second inauguration of Ulysses S. Grant in 1873, temporary buildings were constructed at Judiciary Square.\nIn 1865, a ball was held for Abraham Lincoln's second inauguration in the Model Room at the United States Patent Office, the first ball held in a government building, while in 1869, Grant, during his first inauguration, was honored with an inaugural ball held at the Treasury Building.\nBetween 1885 and 1909, inaugural balls were held at the National Museum Building (now the Smithsonian Arts and Industries Building) and the Pension Building (now the National Building Museum).\nThree presidents have cancelled inaugural balls for various reasons: Franklin Pierce did so in 1853 as he was mourning the recent death of his son, while Woodrow Wilson in 1913 felt that inaugural balls were too expensive; after Warren G. Harding, who wanted to set an example of simplicity, cancelled his in 1921, he temporarily ended the custom of inaugural balls.\nPrivate parties known as \"charity balls\" were held during the second inauguration of Calvin Coolidge in 1925, for the inauguration of Herbert Hoover in 1929, and most notably during the Great Depression and World War II-era inaugurations of Franklin D. Roosevelt in 1933, 1937, 1941, and 1945.\nOfficial inaugural balls were not reinstated until the Second inauguration of Harry S. Truman in 1949. Due to their growing popularity, the number of inaugural balls grew starting in the 1950s: during the 1953 inauguration of Dwight D. Eisenhower, there were two, and by 1957, there were a total of four balls held for Eisenhower's second inauguration. A fifth was added for the Inauguration of John F. Kennedy in 1961.\nReflecting the mood of previous presidents in the early 20th century, Jimmy Carter stripped his 1977 inaugural balls of their frivolity and glamor, and charged no more than $25 per ticket.\nBy 1997, the number of inaugural balls reached a peak of fourteen during the second inauguration of Bill Clinton, being reduced to eight for the first inauguration of George W. Bush in 2001 and nine for his second inauguration in 2005.\nFor the 2009 inauguration of Barack Obama, 10 official and 121 unofficial inaugural balls were held.\nNo inaugural balls were held in 2021 after the inauguration of Joe Biden due to COVID-19 pandemic.\nGallery\nFile:Photograph of the presidential party at the Inaugural Ball, held at the National Guard Armory in Washington, (from... - NARA - 200073.jpg|First Lady Bess Truman, Perle Mesta, President Harry S. Truman, Margaret Truman, Edgar Morris, and Arthur Bergman at an inaugural ball held at the National Guard Armory on January 20, 1949.\nFile:Photograph of President Dwight D. Eisenhower and his wife Mamie with other guests at the Inaugural ball. - NARA - 200426.tif|President Dwight D. Eisenhower and First Lady Mamie Eisenhower with other guests at an inaugural ball held on January 20, 1953.\nFile:Nixons at 1973 inaugural ball.jpg|President Richard Nixon with First Lady Pat Nixon and daughters Julie and Tricia speaking at his inaugural ball in the Museum of History and Technology, now the National Museum of American History, January 20, 1973.\nFile:President Jimmy Carter and Rosalynn Carter dancing at Inaugural Ball. - NARA - 173398 (Restored).tif|President Jimmy Carter and First Lady Rosalynn Carter dancing at an inaugural ball held on January 20, 1977.\nFile:1985 Inaugural Ball President and Mrs. Reagan in National Air and Space Museum (3198957823).jpg|President Ronald Reagan with First Lady Nancy Reagan at his side, waves at party-goers assembled in the National Air and Space Museum, January 20, 1985.\nFile:1997 Clinton Inaugural Ball- Vice President and Mrs. Gore Dancing.jpg|Vice President Al Gore and his wife, Tipper Gore, dancing during a Clinton inaugural ball held on January 15, 1997.\nFile:Jenna, Barbara, George W, Laura Bush Jan 19, 2005.jpg|President George W. Bush points out members of the audience to First Lady Laura Bush during the \"Black Tie and Boots Inaugural Ball\" in Washington, D.C held on January 19, 2005.\nFile:Obamas dance at Neighborhood Ball 1-20-09 090120-F-9629D-686.JPG|President Barack Obama and First Lady Michelle Obama are serenaded by Beyoncé at their first inaugural dance at the \"Neighborhood Ball\" on  January 20, 2009.\nFile:Donald Trump and Melania Trump at Liberty Ball Inauguration 2017.jpg|President Donald Trump and First Lady Melania Trump at their inaugural dance at the \"Liberty Ball\" on January 20, 2017.\nFile:Donald and Melania Trump Commander in Chief inaugural ball (2).jpg|President Donald Trump and First Lady Melania Trump at their inaugural dance at the \"Commander in Chief Inaugural Ball \" on January 20, 2025.\nSee also\n* Alfred E. Smith Memorial Foundation Dinner\n* Gridiron Club Dinner\n* International Debutante Ball\n* United States presidential inauguration\n* Viennese Opera Ball in New York\n* White House Correspondents' Dinner\nReferences"
    }
  ]
}