{
  "content": [
    {
      "type": "text",
      "text": "# United Kingdom Council for Psychotherapy\n\nUnited Kingdom\n| type                     = Professional body\n| leader_title             =\n| leader_name              =\n| key_people               = Jon Levett (CEO)\n| website                  = [https://www.psychotherapy.org.uk www.psychotherapy.org.uk]\n}}\nThe United Kingdom Council for Psychotherapy (UKCP) is a professional association of psychotherapy organisations and practitioners in the United Kingdom.\nHistory\nThe UKCP exists to \"promote and maintain the profession of psychotherapy and the highest standards in the practice of psychotherapy throughout the United Kingdom, for the benefit of the public.\" Only psychotherapists or psycho-therapeutic counselors who meet UKCP's training requirements and abide by its ethical guidelines are included in its online \"Register of Psychotherapists\".\nThe UKCP was initially founded in the 1980s as the United Kingdom Standing Conference for Psychotherapy following the Foster Report (1971) and the Sieghart Report (1978), which recommended regulation of the psychotherapy field. It was formally inaugurated as a council in 1993.\nUKCP also represents the United Kingdom in the European Association for Psychotherapy (EAP) – a Vienna-based umbrella organisation which sets standards for equivalence of training and practice throughout Europe.\nChair\nUKCP elects its chair among its members.\n{| class=\"wikitable\"\n|-\n! Term of office !! Office holder\n|-\n|2024–present\n|Pippa Donovan (interim chair)\n|-\n|2023–2024 ||Christian Buckland\n|-\n|2022–2023 || Jo Lucas (acting chair)\n|-\n|2022–2022 || Syed Azmatullah\n|-\n|2016–2022 || Martin Pollecoff\n|-\n|2012–2016 || Janet Weisz\n|-\n| 2009–2012 || Andrew Samuels\n|-\n| 2007–2009 || James Gray Antrican\n|-\n| 2005–2007 || Lisa Wake (now de Rijk)\n|-\n| 2002–2004 || James Pollard\n|-\n| 2001–2002 || Alan Thomson\n|-\n| 1998–2001 || Ann Casement\n|-\n| 1995–1998 || Digby Tantam\n|-\n| 1993–1995 || Emmy van Deurzen\n|-\n| 1989–1993 || Michael R. Pokorny (Chair of the UK Standing Conference for Psychotherapy)\n|}\nControversy\nIn October 2024 reports in the UK press alleged that self-regulation of therapists was ineffective. There were references to practitioners, including a GP, who were still able to set up in practice after having been struck off for misconduct by their member organisations, such as the BACP and UKCP. Misconduct was reported to include drug and sexual abuse. Campaigners and MPs have called for stronger measures to protect the public.\nHowever Professor Andrew Samuels, a long time psychotherapist and academic put forward the case that statutory regulation would not help the public nor the profession in the current ferment over abusive practitioners.\nTransgender youth\nSee also\n*British Association for Counselling and Psychotherapy\n*British Psychoanalytic Council\n*Association for Cognitive Analytic Therapy\nGeneral:\n*Mental health in the United Kingdom\nReferences\nExternal links\n* [http://www.psychotherapy.org.uk/ UKCP official website]"
    }
  ]
}