{
  "content": [
    {
      "type": "text",
      "text": "# United Cannery, Agricultural, Packing, and Allied Workers of America\n\nThe United Cannery, Agricultural, Packing, and Allied Workers of America (UCAPAWA) was a labor union formed in 1937 under the Congress of Industrial Organizations (CIO). Established in Denver, Colorado, the union sought to address the concerns of those working in the agricultural industry during the Great Depression. Membership consisted of Mexican, black, Asian, and white food processing workers. It was one of the first unions to allow women to hold high-ranking positions. The intention was to build a national, decentralized labor organization with power flowing from the bottom up. Although it was short-lived, the UCAPAWA influenced the lives of many workers and had a major impact for both women and minority workers in the union.\nIn 1944, the UCAPAWA changed its name to Food, Tobacco, Agricultural, and Allied Workers (FTA) and moved its headquarters to Philadelphia, Pennsylvania.\nHistory\nThe UCAPAWA was the result of a revolt in the American Federation of Labor (AFL). UCAPAWA was organized by Donald Henderson, an economics professor at Columbia University and Communist party member. Henderson, who was also one of the founders of the People’s Congress, noted the importance this union placed on popularizing the conditions of black and Mexican American workers and organizing them as a way to improve their social and economic situation. Henderson declared that the “International Office was sufficiently concerned with the conditions facing . . . the Negro people and the Mexican and Spanish American peoples.” Henderson observed that both minority groups were deprived of civil rights, exploited to the point of starvation, kept in decayed housing, denied educational opportunities, and in Henderson’s view, “blocked from their own cultural development.” Henderson eventually, as President of the union, established it as the agricultural arm of CIO in 1937 after having been abandoned by the AFL.\nUnable to persuade the AFL to charter an international union of agricultural workers and increasingly drawn to the CIO industrial union structure, Henderson and representatives from locals throughout the country met in Denver in July 1937 to form UCAPAWA, which promptly received a charter from the CIO. Part of the reason behind its founding was to address the concerns of agricultural laborers and their counterparts in packing and canning during the Great Depression.\nThe UCAPAWA represented multi-cultural workers from Mexicans working on sugar beet farms to black sharecroppers in Arkansas and Missouri. They were also very involved in Asian-American workers, such as Filipino, Chinese, and Japanese cannery workers in Washington. UCAPAWA was particularly strong among Mexican and Mexican-American workers. In 1940, the San Francisco News called UCAPAWA the \"fastest growing agricultural union in California\" and attributed its success to its appeal to Mexican and Mexican-American workers. The union was also supported by outside organizations such as the John Steinbeck Committee to Aid Agricultural Organization, the J. Lubin Society, the Spanish-Speaking People's Congress, and, on occasion, local clergy.\nA commitment to labor union democracy, shared by both national leaders and regular members, provided the underlying philosophy for union endeavors. Some leaders of the UCAPAWA saw themselves as participants of a radical culture and political projects. When the UCAPAWA entered an affiliation the Arkansas-based Southern Tenant Farmers Union (STFU), there was controversy regarding political associations. Infighting between Communist party leaders and the local Socialists, who served as the organization’s principal administrators, as well as personality and ideological conflicts, marred the alliance from the start. STFU and UCAPAWA differed over a fundamental issue: Whether agricultural workers could best be served by a protest organization or a labor union. STFU thought that sharecroppers and tenant farmers could not be organized because they were uneducated and too poor.\nThe UCAPAWA disagreed and argued that agricultural workers could be taught the rudimentary procedures for running the locals and that union members had to support their own organization. Another difference between STFU and UCAPAWA was that STFU wanted a centralized government while UCAPAWA believed in a more decentralized system. After STFU departed, UCAPAWA’s constitution guaranteed local autonomy and provided for local control of at least half of all dues collected. The STFU dispute was a turning point for UCAPAWA. Agricultural unions did not have collective bargaining rights and often faced local hostility. As a result, UCAPAWA shifted its focus from the fields to processing plants.\nUCAPAWA distanced themselves farther from conventional unions and organizations by representing working classes generally ignored by traditional craft affiliates. Union officers deliberately enlisted black, Mexican, Asian, and female labor organizers, in order to launch campaigns aimed at minorities and women.  UCAPAWA was increasing its scope from fields to fisheries, canneries, processing plants, and even tobacco manufacturing workers.\nRole of women\nOne of the most prominent roles that UCAPAWA played was in the workplace for women, especially Mexican women. Forming half of UCAPAWA’s total membership, women were not silent partners. On the contrary, they performed various services ranging from negotiating contracts to calling numbers at bingo. Women organizing women became a union hallmark. Women enthusiastically joined a labor organization that actively encouraged their involvement and offered them genuine opportunities for leadership. UCAPAWA food and tobacco locals proved successful in securing higher wages and benefits that were particularly important to women. In fact, one of the most important positions, Vice President, was filled by Dorothy Ray Healey.  Left-wing labor activists like Healey were successful because they embraced the Popular Front viewpoint and represented themselves as links to ethnic communities and as advocates of racial equality. Healey was assisted by a core group of college students and Young Communist League members who worked in the plant during the summer and were actively involved in organizing.\nIn the beginning, UCAPAWA had the financial support of the CIO, but there were hard times ahead for the newly-formed organization. UCAPAWA was one of the few labor unions that allowed women to hold positions of authority. There, they pushed for such benefits as maternity leave and equal pay, and they were on the forefront in the struggle for women's equality. By 1937, Henderson could report a membership of over 120,000 workers in more than 300 locals.\nBy 1946, nearly nine of ten cannery contracts set the minimum wage at sixty-five cents an hour. Two thirds contained \"equal pay for equal work\" clauses. More importantly, three fourths provided leave of absence for pregnancy or other reasons without losing seniority. Four fifths of the agreements also included benefits as paid vacations as well as bonuses for night or swing shift work. More than half had stipulations concerning paid holidays, union input in setting piece rates, and overtime pay after forty hours per week.\nDuring the 1938 pecan-sheller's strike led by Emma Tenayuca in San Antonio, UCAPAWA president Henderson dispatched organizer Luisa Moreno to turn the local, El Nogal, into an efficient bargaining organization.  Tenayuca had by then already established the Texas Pecan Shelling Workers Union, UCAPAWA Local 172. Their primary grievances put forth against the Seligmann Company were a 15% pay cut, deploring plant conditions, and unpaid homework. The strike, which also became violent when strikers were teargassed, ended with the recognition of the UCAPAWA local and a minimum wage for workers. Local San Antonio Police responded by attacking Tenyuaca and the UCAPAWA local leadership, arresting them and charging them with \"Communist Agitation.\"\nIn 1939, UCAPAWA Vice-President Dorothy Ray Healey played an important role in unionizing workers at California Sanitary Canning Company (Cal San) in Los Angeles, who struck in August of the same year. Union members picketed the cannery, grocery stores that sold Cal San goods, and the houses of the Shapiro brothers, the plant's owners. Faced with children holding signs bearing slogans such as \"I'm underfed because Mama is underpaid,\" the Shapiro brothers met with negotiators and soon reached a settlement. The Cal San local became UCAPAWA's second largest, and the union's ranks grew to include the workers at several California canneries.\nStrikes\nOne of the early strikes of UCAPAWA was the 1939 Madera Cotton Strike, which, despite provoking a violent reaction from the Associated Farmers, succeeded in winning a minimum wage for union members. It also served as an example of inter-ethnic solidarity, with African American, Mexican American, and White American workers all participating in the strike.\nIn Texas, UCAPAWA helped unionize workers from feed, flour, and cotton mills. At a 1938 wildcat strike of shrimp-processing plant workers, a UCAPAWA organizer was murdered on the picket line.\nAt post-strike meetings, Dorothy Healey outlined election procedures and general union bylaws. The cannery workers who had led the strike were elected to every major post. UCAPAWA organizers Luke Hinman and Ted Rasmussen, who began an organizing drive at the California Walnut Growers' Association plant, replaced Healey.\nDemise\nSTFU, which Communist UCAPAWA President Donald Henderson regarded as \"a utopian agrarian movement,\" became affiliated with the union. A power struggle between the groups erupted soon after the affiliation and culminated with a 1939 protest against the eviction of sharecroppers in Missouri, which was not supported by the national organization. As a result, the STFU left the union.\nAnticommunism was not the sole thread in the fabric of responses to UCAPAWA's organization. There were communists in UCAPAWA, however it was not a \"communist union.\"\nIn 1944, UCAPAWA became the Food, Tobacco, Agricultural, and Allied Workers (FTA).\nIn 1946, the Los Angeles local chapter \"collapsed under the weight of Red Scare witchhunts.\"\nBy 1950, the FTA had only 1,000 workers as members, and joined with other locals from the United Office and Professional Workers of America and Retail, Wholesale, and Department Store Union to form the Distributive and Processing Workers of America. This union lasted until 1954 when its members joined the Retail Workers as District 65.\nReferences"
    }
  ]
}