{
  "content": [
    {
      "type": "text",
      "text": "# University of Queensland R.D. Milns Antiquities Museum\n\nThe University of Queensland R.D. Milns Antiquities Museum is a collection housed on the St Lucia campus of the university. It was built to further the study of the classical civilisations of Greece, Rome, Egypt, and the Near East by secondary students, tertiary students and researchers as well as the general public.\nLocation\nThe museum is located in the Michie Building (Building 9), off the Great Court at St Lucia.\nHistory\nThe museum was established after the purchase of a 5th century BC 'red-figure Attic' amphora in 1963, to supplement teaching within the School of Classics and Ancient History. Within 50 years it had moved into its own rooms and contains over 6000 items. It was renamed the R.D. Milns Antiquities Museum in 2007, honouring Emeritus Professor Bob Milns AM (1938-2020), a long term benefactor and spokesperson for the classics department. It is part of the School of Historical and Philosophical Inquiry at the University of Queensland.\nIt celebrated its 50th anniversary at the University of Queensland with a major exhibition entitled 'Then and Now: 50 Years of Antiquities.' A number of significant acquisitions helped to mark this anniversary event.\nSignificant items\nThe museum contains over 6000 items dating from 4000 BC to AD 600. The collection includes stone, pottery, terracotta, metalware, jewellery and glass items from modern Iran, Wales, Germany and Egypt.\n* A Greek South Italian Bronze Helmet (300-200 BC)\n* An Attic Marble Funerary Stele for Theophile (400-350 BC)\n* An Egyptian Cartonnage Mummy Mask (390-340 BC)\n* A Roman Marble Portrait Head of Aphrodite (AD 100-200)\n* A Roman Marble Memorial Tablet for Secundio (AD 1-100)\n* An Attic Marble Funerary Loutrophoros for Phanodemos (400-375 BC)\n* An Attic Terracotta Column Krater (c. 450 BC)\nA searchable database for the collection exists. Several items have been scanned using 3D technology to assist in their preservation and to be used in teaching and discovery.\nReferences"
    }
  ]
}