{
  "content": [
    {
      "type": "text",
      "text": "# University of Toronto President's Estate__disambig_1\n\nThe '''University of Toronto President's Estate''' is a  property with a 32-room residence for the president of the University of Toronto. It is located at 93 Highland Avenue in the Rosedale neighbourhood of Toronto, Ontario, Canada. The property overlooks the Park Drive Reservation Ravine formed by Yellow Creek and goes from Highland Avenue halfway down to the floor of the ravine.\nThe house was built between 1908 and 1910 by Toronto architects Wickson and Gregg. It was the home of gold-mining magnate David Dunlap and his philanthropist wife, Jessie (who donated the David Dunlap Observatory to the University of Toronto in 1935 in honour of her late husband). After Mrs. Dunlap's death in 1946, the house went through one owner before being purchased in 1956 by U of T as a suitable residence for its president.\nGardens and natural history\nThe upper lawn is bounded by mature oak (Quercus) and sugar maple (Acer saccharum) on the north with a single mature specimen of Acer saccharinum and Ailanthus altissima next to the thirty two room estate house and a Robinia pseudoacacia on the eastern edge of the half acre lawn.\nA steep grassed slope flows south to the second terrace where the greenhouses, sheds and cold frames are located on the west side and a large gazebo situated beneath two large Salix babylonica which have since, blown down in a windstorm in the early 2000s. Beneath a stone step lies the remains of a family pet whose name (Billy, 1947) is inscribed upon the stone. From here the second slope; peppered with Syringa vulgaris and stumps of trees and shrubs long gone, flows onto the third terrace where several varieties of Malus grow, along with Euonymus europaeus, Sorbus aucuparea and Robinia pseudoacacia.\nThe greenhouses and grounds had been abandoned for six months except for some grass cutting by the University of Toronto Grounds Department in 1981, as the Estate Gardener had died that spring. It took the next Estate Gardener two weeks to get the two growing greenhouses and sheds up to working condition, and it wasn't until September that the plants in the conservatory were transplanted, divided, cleaned and rejuvenated.\nAfter the fall season, it was discovered that the lower of three tiers was in reality a half acre terraced rock garden with two large concrete ponds and a 300-foot artificial stream running to it from the east side of the upper lawn. The forest is composed primarily of Fagus sylvatica, Quercus rubra, Betula papirifera, Acer rubrum, A. saccharum, Ostria and Robinia pseudoacacia. The half acre rock garden encompasses the entire lower western section of the estate covering three smaller slopes and two smaller terraces.\nIn the rock garden proper, including trees and shrubs, were found Tradiscantia virginiana, Achillea lanulosa, Pinus mugho, Viburnum trilobum, Acer palmatum, Hieracium canadense, Ulmus pumila, Spirea vanhoutii, Malus coronaria, Asparagus filicina, Robinia pseudoacacia, Pteris spp., Potentilla recta, Ranunculus acris, Taxus cuspidata`Hicksii', Chelidonium majus and Muscari botrides.\nBy 1982, many plants had germinated or been grown from cuttings and different species of plants. Only about 90 different species made it to adulthood from the greenhouse and cold frames. Nearly half of these new plants were being grown for the conservatory and the flowerbeds around the house. They included species of Begonia, Fuchsia, Pilea, Euphorbia, Peperomia, Impatiens, Hosta and other indoor plants. The University Administration was not overly interested in returning the President's Estate to its earlier glory and especially not the rock garden as very few guests went to see it during university functions. By the end of 1983 the following wild flowers were successfully introduced the into the gardens; Aguiligia brevistilla, Ranunculus abortius, Lychnis chalcedonica, Saxifraga aizoides, Siline cotripacta, Sedum anacampceros, S. kamtshaticum, S. kamtshaticum Oreo marginatum, Malva sylvestris, M. verticillata, Potentilla tridentata, Potentilla intermedia, P. pentandra, Polemonium corveleum, Atriplex lentiformis, Agastace foenicleum, Campanula carpatica and Plantago lanceolata. The President's Estate is now looked after directly from the U of T's Grounds Department and no longer maintains its own Estate Gardener.\nFile:93 Highland conservatory.jpg|The house and conservatory\nFile:93highland.jpg|Conservatory\nFile:Quercus rubra3 WPC.jpg|Quercus rubra, upper lawn\nFile:93 Highland steps.jpg|Second tier steps\nFile:93 Highland upper lawn beds.jpg|Upper lawn beds\nFile:93 Highland rock garden.jpg|Rock garden with Mugho\nReferences\n*1.\n*York University Archives, Scott Library"
    }
  ]
}