{
  "content": [
    {
      "type": "text",
      "text": "# Universal Church of the Kingdom of God\n\n|theology=Neo-charismatic theology|governance =\n|leader = Edir Macedo\n|founder = Edir Macedo\n|founded_date =\n|founded_place =\n|separated_from =\n|parent =\n|merger =\n|separations =\n|associations =\n|area = 128 countries in 2019\n|headquarters = Temple of Solomon, São Paulo, Brazil\n|members = 1.8–7 million (in Brazil), 3–8.2 million (worldwide)\n|website =\n|footnotes =\n}}\nThe Universal Church of the Kingdom of God (UCKG; ; , IURD) is an international cult with its headquarters at the Temple of Solomon in São Paulo, Brazil. The cult was founded in 1977 in Rio de Janeiro by Bishop Edir Macedo, who is the owner (since 1989) of the multi-billion television company RecordTV.\nIn 1999 the cult claimed to have 8 million members in Brazil and was already considered a \"commercial church\". The church supported Jair Bolsonaro for president in the 2018 Brazilian general election, which he won.\nThe denomination had established temples in the United Kingdom, Caribbean, Africa and India, claiming a total of more than 12 million members worldwide that year. By 2013, the UCKG had congregations in New York City, and, according to the UCKG's website in the United States,  had congregations in over 35 U.S. states.\nThe UCKG has been accused of cult-like illegal activities and corruption, including money laundering, charlatanism, and witchcraft, as well as intolerance towards other religions. There have also been accusations that the church extracts money from poor members for the benefit of its leaders. In 2000, a London-based UCKG pastor arranged an exorcism which resulted in the death of a child and the conviction of her guardians for murder. The UCKG has been subject to bans in several African countries. In 2017 it was alleged to have been adopting children in Portugal and taking them abroad illegally.\nIn 2022 complaints by ex-UCKG members in the U.K. led to criticism, an investigation interviewing more than 30 former members published in The Guardian, and the opening of an investigation by the Charity Commission into the UCKG's registration as a charity. The BBC reported in 2023 that it recorded London-based UCKG Bishop James Marques claiming mental health conditions could be helped by casting out demons and that epilepsy is a \"spiritual problem\". They also reported that a member underwent \"strong prayers\" at age 13 to make him heterosexual. The BBC broadcast a 30-minute documentary titled \"The Billionaire Bishop and the Global Megachurch\" as part of the BBC's Panorama series.\nHistory\nBeginning and split with R. R. Soares\nIn the late 1960s, Edir Macedo converted to evangelical Christianity at the Igreja Cristã de Nova Vida (\"Christian Church of New Life\"), a Pentecostal church founded by the Canadian bishop Walter Robert McAlister. Macedo wanted to become a minister for McAlister's church, but since he was not accepted by its leaders, he and his brother-in-law, R. R. Soares, decided to change to another denomination. Macedo and Soares joined another church called Casa da Bênção (\"House of Blessing\"), where they claim to have seen possession by and deliverance from demons for the first time, but only Soares was consecrated as a pastor.\nIn 1975, Soares and another pastor invited Macedo, who still wanted to start his ministry, to inaugurate the Cruzada do Caminho Eterno (\"Crusade of the Eternal Way\"), a precursor of the Universal Church of the Kingdom of God. The services were held in some cinemas they rented for a few hours. In order to increase the number of members, Macedo began to preach in a gazebo at the main square of the Méier neighborhood of Rio de Janeiro. In 1977, the UCKG was officially founded when Macedo and Soares rented a former funeral home, which became their church's first temple.\n, United States]]\nBy the time that the UCKG was founded tensions had begun to build between Macedo and Soares, with Soares thinking the rent to their temple building was too high. In 1980, Macedo went to New York State to start a ministry in the U.S., but soon returned to Brazil to solve administrative problems with Soares. Some of Macedo's principles clashed with those of Soares such as, according to Macedo, financial management, the hiring of pastors from other denominations while Macedo was planning a completely fresh denomination, and the centralization of the image of the \"Missionary R. R. Soares\". Macedo and Soares decided to call a vote for the leadership among the fifteen pastors the UCKG had at the time; Macedo won by twelve votes to three. Soares resigned from the UCKG and founded the International Grace of God Church, using the copyright of the books of T. L. Osborn.\nFrom 1989\nat Cathedral of Faith in Rio de Janeiro, Brazil]]\nIn 1989, the UCKG expanded to Portugal. The church's style of proselytism was aggressive, and they were accused of charlatanism and commercial interests that put into question their claims to be a religious organisation. During the 1990s, the UCKG were very visible and energetic, attacked the Catholic Church, and amassed contributions sufficient to build a \"gigantic\" temple in Porto. In 1995, a scandal ensued after the attempted purchase of the well-known theatre Coliseu do Porto to transform it into a UCKG temple. The church then began expanding into eastern Europe.\nIn 1989, the UCKG purchased TV Record, which by 2013 was Brazil's second-largest television network. In 2009, the Workers' Party (PT) government in Brazil bought advertising from RecordTV, which it had formerly limited to Catholic publications, in new venues, and paid for public service messages in UCKG media outlets.\nThe UCKG preached prosperity theology, which asserts that faith and commitment to God are rewarded with salvation first, but also monetary wealth. In the late 1990s, the church started trying to change its image of being associated with only the poorest people. In 1998, Macedo appointed his nephew, Marcelo Crivella, as a bishop. Crivella said, \"We want to win the middle class.\" In 1992, Crivella began a mission in Africa, resulting in the creation of multiple UCKG temples. He returned to Brazil in 1998, where he lived in a four-bedroom condominium in an exclusive development. Crivella is married to Sylvia Jane, with three children who attend a Methodist school in Río de Janeiro.\nSome observers at the time thought that Crivella was being promoted as a competitor to the popular Catholic priest-singer, Marcelo Rossi, who had sold over 4 million albums. In 1999, Crivella was reported to have signed a contract with Sony Music to make three albums, one in Spanish. The first CD, The Messenger of Solidarity, reportedly sold 1.3 million copies that year.\nCrivella was the only pastor whom Macedo authorized to hold large events in stadiums. He has been effective at attracting crowds: the first time appearing at the Nilson Nelson gymnasium in Brasília, with a capacity for 25,000 people, and also in the Estádio Fonte Nova in Salvador and the Mineiro in Belo Horizonte. In October 1999, Crivella packed the Maracanã football stadium in Río de Janeiro. By the end of that year, he planned to have sung \"in the largest football stadiums in the country\" according to weekly news magazine Veja.\nIn July 2014, the Temple of Solomon, with 10,000 seats, was inaugurated in the Brás district in São Paulo.\nActivities\nHumanitarian and charitable\nBy the 2010s, the UCKG was reportedly encouraging blood donation by its members; in various regions, hundreds of donations were made, with numbers 28% higher than before the church's involvement.\nThe UCKG said that in 2018 its American branch opened a church inside a jail in Houston, Texas, U.S.\nThe UCKG says that its British HelpCentres \"operate a weekly Food Bank and Soup Kitchen for those who may need support ... providing, hot beverages, tin food, fresh fruit, vegetables and much more\".\nPolitical\nMacedo has said he wants to \"create a theocratic state\" by participating in elections. In 2002, Crivella was elected a member of the Federal Senate as a candidate for the Liberal Party. In 2005, he switched his affiliation to the Brazilian Republican Party, a social conservative party he had co-founded. The party has been described as a vehicle to run candidates for the UCKG.  Marcos Pereira was head of the party. Other prominent members are Bishop Marcelo Crivella of the UCKG, former vice-president José Alencar, and journalist Celso Russomanno. Crivella also ran for mayor of Rio de Janeiro in 2004 and 2008, both times unsuccessfully, before finally winning election in 2016; and for governor of the state of Rio de Janeiro in 2006 and 2014.\nFinances\nReports in 2009 from a Brazilian governmental investigation of money laundering estimated that the UCKG received R$1.4 billion per year in tithes, collected in 4,500 temples in 1,500 cities in Brazil. From 2003 to 2008, deposits for the church reached R$3.9 billion. The church once again was cleared of wrongdoing.  UCKG's founder Edir Macedo had a personal fortune estimated at US$1.1 billion.\nA 2011 investigation by The Times into the UCKG's British accounts found that donations declared for the financial year 2009–10 were £9,700,000, of which more than £7m was used to purchase fixed assets. Over the previous sixteen years it had built up £33,700,000 in fixed assets and had claimed almost £8 million in taxpayer subsidies since 2003. This investigation was not able to prove any wrongdoing by the church or its leaders, and The Times had to issue a retraction and public apology for running the misleading report.\nUCKG reports and financial statements give a picture of the organisation. The accounts from 28 February 2014 of the UK UCKG HelpCentre (registered charity 1043985) give an overview of the organisation's aims, and detailed accounts as submitted to Companies House. The report says that \"the charity exists to advance the Christian faith and for such charitable purposes as the Trustees shall from time to time decide. ... It is committed to helping people to discover their potential and live life to the full as well as working to expand and reach out to as many people as possible with the message of the Gospel. This is done through evangelism, advertising campaigns and the opening of new branches. The charity also provides financial support to its sister churches in developing nations via the issue of loans presented as programme related investments in the balance sheet.\"\nA complete list of charitable activities stated is:\n* Provision of church services: the charity's primary activity.\n* Support for overseas churches: loans and donations to \"sister churches\".\n* Vocational training\n* Children's Biblical Centre\n* Bookshop: run by the charity\n* Delight Cafe: with proceeds going to the work of the HelpCentre.\n* Pilgrimage to Israel\n* One-off events.\nIncome: Total voluntary income £14,139,298, of which £12,073,881 from donations from church services, plus £1,646,936 from the government as gift aid reclaim (taxpayer subsidy). From fundraising and investment about £850,000. Support costs (staff, electricity, etc.) £1,304,695.\nCharitable expenditure: total £10,661,372, of which £9,607,636 on provision of church services.\nBook value of tangible fixed assets (mainly land and buildings): £40,846,703, similar to the previous year.\nInfluence\nAccording to Forbes magazine,  Macedo had a personal fortune estimated at US$1.1 billion, largely from his ownership of RecordTV, the second largest broadcaster in Brazil. The UCKG's continuing growth, and controversies since Macedo purchased RecordTV, attracted frequent media attention. In addition, claims against the church, together with government efforts related to other investigations, have caused a review of its operations. In 2013, Macedo acquired a 49% stake in the privately held bank Banco Renner, which charges some of the highest interest rates in Brazil. The source of funding to buy the bank is unclear; some reports alleged that Macedo used church funds, but he refused to comment.\nBeliefs\nThe UCKG has a charismatic confession of faith.\n* That the baptism of the Holy Spirit empowers believers for service and endows them with supernatural gifts.\n* That ministries of apostle, prophet, evangelist, pastor, and teacher are divinely ordained.\n* That Jesus Christ appointed two ordinances to be observed as acts of obedience:\n**immersion of the believer in water (baptism)\n**the Lord's Supper, symbolic of consuming the body and blood of Jesus, in remembrance of his sacrifice and in the expectation that he will return.\n* In divine healing as described in the Christian Bible. The translation recommended by the UCKG is the 1982 New King James Version (NKJV), which, according to the Church, \"is the most true to the original we've found so far\". The UCKG also urges its followers not to read the New World Translation (NWT), which is used by Jehovah's Witnesses.\n* That people can be sanctified (become holy) during their lifetime.\n*The UCKG does not believe that the sacrifice of Jesus Christ is sufficient to work in the congregant's life today; it teaches that a member of the church has to make a \"total and complete\" sacrifice of what they depend on to God through the church (for example, a month's pay, or savings) twice a year without telling anybody; they commonly refer this as the \"Campaign of Israel\".\nThe UCKG also considers that \"hard work, perseverance and faithfulness to God\" will produce earnings for people, a doctrine called prosperity theology, and that a tithe (10%) of earnings should be given to God through the church. They offer the \"promise of the psalm\" (Psalm 23, The Lord is my shepherd): peace, healing, protection, prosperity and favour.\nA 2015 academic paper by Ilana van Wyk, author of the 2014 book The Universal Church of the Kingdom of God in South Africa analyses the UCKG's prosperity teachings in South Africa, where the church has a very significant presence. She found, based on long-term fieldwork, that the traditional Protestant doctrine of frugality and hard work had been largely replaced by the prosperity gospel, with the pursuit of \"blessings\" superseding older concerns over secular vocations and hard work. She found that in churches such as the UCKG, members were urged to demand \"miracle jobs\" and reject humble vocations and low pay, regardless of qualifications, skills or experience. Complementing her book, the paper examines the role of good and bad luck in the lives of believers, how the UCKG attempts to regulate the flow of money, and its relationship to older notions of prosperity, fate and good fortune.\nThe UCKG has been accused of intolerance and demonisation of African-Brazilian religions such as Candomblé and Umbanda, with aggressive speech and attacks on temples. In 2005, a Brazilian court ordered that Macedo's book Orixás, Caboclos e Guias: Deuses ou Demônios? be removed from stores as prejudiced and attacking the religious freedom of members of religions of African origin; the judgement was reversed on freedom of expression grounds after a year of litigation.\nTithing and offerings\nThe UCKG considers that the first ten percent of all of a person's gross income before deductions \"belongs to God\" as a tithe, quoting the Bible as the ultimate, divine authority (Malachi 3:10). The first tithe should include 10% of everything owned at the time. The church gives very detailed instructions on what is to be paid, when, and to whom, distinguishing between rules for salaried workers, business owners, the self-employed, pensioners, and the unemployed, including beggars. Guidance is given for money received as a loan, gifts, benefits, and the sale of property. The tithe is to be paid to the Church as soon as possible; it is not acceptable to defer payment in time of need—this is compared with being unfaithful to your wife now, but being faithful later. If payment is deferred for any reason, then it must be increased by a fifth, on supposed Biblical authority. The UCKG says \"the Biblical way of tithing is to bring the tithe onto the altar of the church (see Deuteronomy 14:25)\", but accept payment by debit order, \"if you must\".\nThe UCKG is clear that, \"You must tithe everything that comes to your hands ... wages [gross, not after deductions], overtime pay, bonuses, unemployment benefit, child support, business profits/profit from business, pensions, allowances, interest earned on an account, inheritance, prizes, commission, sales, gifts, etc.\" The church's position is that failure to give tithes is, according to the Bible, robbing God: \"Will a man rob God? Yet you rob me. But you ask, 'How do we rob you?' In tithes and offerings. You are under a curse—the whole nation of you—because you are robbing me.\" (Malachi 3:8,9)..\nThe church says that tithe has a direct impact on salvation. The question is posed, \"How can tithe benefit my finances if after giving I am left with less than before?\"; the answer is described as \"the miracle of tithe\": \"when you tithe you can count on God's protection upon your money ... He promised to bless you with more than you can have room for ... When you tithe, you remove yourself from under the curse of those who rob God.\" A clear distinction is made between tithe, which is an obligation, and an offering. Tithe is to be paid before an offering, without deducting the offering from the 10% tithe. Tithe is said to mean faithfulness, submission and obedience; and offering to mean love, faith, thanksgiving, and sacrifice.\nThe UCKG offers a financial seminar \"for people who are in pursuit of financial growth, independence, stability and as well opportunities in the financial world (Jobs, Promotions, Recognition and the like), people who do not accept failure, poverty, misery,  and want a turn over in their life because they believe that they are worthy of much more.\"\nTithes are stated to be used so \"the Church can pay its existing expenses and plan to expand the work of God\", quoting, \"That there may be food in My House.\" (Malachi 3:10). This also means that tithes must not be paid to a charity for the needy instead of the Church, because their primary purpose is to maintain the house of God. \"The responsibility rests with the church authorities to decide whether after the needs of God's House have been met to use the remainder in aid of the poor.\"\nDr. Devaka Premawardhana of Emory University studied the tithing practice of members of the Boston, MA branch of the UCKG church. These members were primary recent immigrants from Cape Verde to the United States. Many struggled financially and faced anxiety from being separated from their children and families. Premawardhana found that tithing gave the members of the church a sense of empowerment. The church taught that if members tithed, then God was then indebted to them and hence obligated to provide blessings that they could forcefully ask for. In particular, Premawardhana found that from the standpoint of an individual member of the church, tithing was not \"an escapist substitute for, but a vital supplement to, his daily struggle for a better life\". Premawardhana further stated that \"This sense of oneself as a creditor and not a debtor is not an illusion of empowerment, it is empowerment.\"\nRelations with other religions\nA United Nations report published in 2009 by Brazil's Committee Against Religious Intolerance (CCIR) stated that Pentecostal churches in general, and the UCKG in particular, were harassing and attacking, sometimes violently, members of other faiths and spreading religious intolerance. The UCKG was \"demonizing\" especially Afro-Brazilian syncretic religions such as Umbanda and Candomblé; \"Jews are portrayed as 'the killers of Christ', Catholics as 'devil worshippers', traditional Protestants as 'false Christians' and Muslims as 'demonic'\", the report said. Spiritists were also reported to have been the subject of attacks. The UN Committee is made up of the leaders of eighteen religious and human rights groups. The committee's chairman said, \"Fascism and Nazism started this way, from demonizing other groups\".\nViolent public protests against UCKG temples followed a 12 October 1995 incident in which UCKG-owned Rede Record broadcast a video of UCKG Bishop Sérgio Von Helder kicking and insulting a Catholic figure of Our Lady Aparecida, whose feast day is 12 October. Facing legal charges, Von Helde fled the country but was later tried and convicted of religious discrimination and desecration of a national sacred treasure; he was sentenced to two years in prison. Macedo apologized for Von Helder's actions, but accused Rede Globo, Brazil's largest television network, of \"manipulating public sentiment\" by repeatedly showing a video of the incident.\nA researcher who participated in many UCKG church services in various parts of Rio de Janeiro published a dissertation finding that the church promoted a language of war, giving moral justification for worshippers' battles with non-believers, and that it also claimed to be the victim, discriminated against for spreading hate and demanding that its intolerance be tolerated. The UCKG was highly competitive for territory and denounced Afro-Brazilian religions.\nControversies\nThe UCKG has frequently been accused of illegal activities, including money laundering, charlatanism, and witchcraft.\nA book by ex-pastor Mario Justino published in 1995 reported a system of goals for the pastors, with those who collect more money receiving awards such as bigger houses, better cars, and holidays. Published in 1995:  Republished 2021:  The book was withdrawn from sale at the time by judicial order, but remained freely downloadable. The book contains the main allegations, which are repeated by Natan Silva and Alfredo Paulo. The book was republished in 2021.\nThe UCKG has also been accused of extracting money from its often poor congregants to enrich church leaders, rather than assisting the needy. Accusations of charlatanism are the most frequent. The church has been under formal investigation in Belgium. Newspapers in the United States, the United Kingdom, Brazil and Zambia have reported on charges of abuses by the church.\nIn August 2012, a man had an epileptic seizure during a UCKG service in São Paulo. When he went to the back of the temple to take his medicine, UCKG pastors allegedly attacked and punched him, saying he was \"possessed by the spirits of darkness\". The church was ordered to pay R$10,000 compensation; it appealed, but the ruling was confirmed by the São Paulo Court of Justice.\nIn December 2012, the UCKG was ordered by a court in Lajeado to pay R$20,000, confirmed on appeal, in compensation for coercing a businesswoman and her partner to make donations they could not afford. The couple were in financial difficulties and had been led to believe that UCKG blessings would help them. The judge determined that the donations (car, jewellery, home appliances, a mobile phone and a printer) were induced to prove faith and subject to the threat of withholding the blessings needed. The inducement, to the couple and the rest of the congregation, was that the more money was donated, the more Jesus would give in return.\nCharges of fraud and money laundering\nIn August 2009, a judge accepted prosecution charges against Macedo and nine other UCKG leaders, who were charged with fraud against the church and its followers. According to The Guardian, government prosecutors accused the men of laundering more than US$2&nbsp;billion in donations from 2001 to 2009, and using much of it to purchase property, jewelry and cars; the newspaper also reported, \"A $45m (£27m) executive jet, reportedly owned by Bishop Macedo, has become the most visible symbol of the scandal. Macedo was cleared of all charges and was issued a public apology following the dismissal of the case.\"\nFollowing a ten-year investigation, the São Paulo prosecutor reported the operation works as follows: donations were gathered from followers, and placed in private banks in both New York City (via Invest Holding, a private lending bank) and London. The money is sent through Cable Invest, a private bank located in the Cayman Islands. Finally, it is sent to Brazil though domestic lending companies \"Cremo\" and \"Unimetro\", lender banks that divide the funds among Rede Record executives, who in turn supply more money to UCKG officials.\nOn October 19, 2010, the São Paulo Justice Court (TJ-SP) annulled, by a majority vote, all charges made by the São Paulo Public Ministry against the UCKG and its principal representatives. The judges ruled that the São Paulo prosecutors did not have jurisdiction to investigate the case, as the accusations were of a type that fell into the federal jurisdiction.\nVictoria Climbié's death (UK)\nVictoria Climbié was an eight-year-old child whose murder in the UK led to major changes in child protection policies. She died from abuse and neglect while living with her great-aunt Marie-Therese Kouao and the aunt's boyfriend. Victoria was seen by dozens of social workers, nurses, doctors and police officers before she died, and by a pastor of the UCKG, but all failed to spot or stop the abuse. Kouao and her boyfriend were charged with child cruelty and murder. During police interviews, both claimed that Victoria was possessed by evil spirits. They were both convicted of murder and sentenced to life imprisonment. Victoria's murder led to a public inquiry which investigated the role of social services, the National Health Service, the Universal Church of the Kingdom of God, and the police in her death.\nIn February 2000 UCKG Pastor Álvaro Lima, later promoted to a UCKG bishop (and Led the UK headquarters from 2016 to 2021), saw the girl and expressed the view that she was possessed by an evil spirit, saying in a written statement to the inquiry that Victoria had told him \"that Satan controlled her life, that Satan had told her to burn her body\". He advised Kouao to bring Victoria back to the church a week later, saying later he suspected she was being abused, but he did not notify any officials. He prayed for her with an assistant. He saw her again several days later with her great-aunt (pretending to be Climbié's mother), and advised Kouao to take the girl to the hospital, where she died of her abuse. The UCKG had been planning to hold a service to \"cast out the devil\" from her on the day she died.\nFollowing Climbié's death, the UCKG stated that they had placed safeguarding measures in place to prevent the use of \"strong prayers\" on children. In 2023, the BBC reported that \"strong prayers\" had been used on a 16 year old boy in the UK, prompting questions as to the effectiveness of these measures.\nMurder of Lucas Terra\nThe Lucas Terra case refers to the rape and murder of 14-year-old Lucas Vargas Terra. The crime took place on March 21, 2001, in Salvador, within the Brazilian state of Bahia, and was committed by two pastors of the Universal Church of the Kingdom of God.\nBelgian parliamentary inquiry\nIn 1997 the Belgian Parliament Inquiry Committee on Cults described the UCKG as a dangerous cult, and recommended its formal proscription. The report said that \"[The church] claims that the Kingdom of God is down here [on Earth] and that it [the church] can offer a solution to every possible problem, depression, unemployment, family and financial problems. In fact, [the UCKG] is apparently a truly criminal association, whose only purpose is enrichment.\" The Belgian report generated controversy for varied reasons, and the Parliament ultimately rejected most of it.\nBanned from African countries\nIn 1998, UCKG was banned from Zambia under the accusation of \"unchristian practices\". The ban was lifted after the church appealed to the Supreme Court. In November 2005, it was again banned from Zambia under the accusation of promoting Satanic rituals, and the work permits for its pastors were revoked. The ban was again lifted after appeal to Justice. Zambia is officially a Christian country by its 1996 constitution.\nAlso in 2005, UCKG was banned from Madagascar, after members were arrested for burning a Bible and other religious objects in public. The church was banned with the argument that it had been licensed in 1998 as a \"foreign society\" and not a \"cult society\". In later years the UCKG (in Malagasy, Fiangonan'ny Vondrona Kristian'ny Fanahy Masina (FVKFM)) encouraged blood donation by its members; in one campaign 300 donors were recruited, far more than before the involvement of UCKG.\nProblems in Angola\nUCKG was suspended for 60 days in Angola in February 2013 after an incident at the Citadela Desportiva in December 2012, which resulted in the death of several people. The Aid Organs of the Presidency of the Republic also recommended that similar churches which have not been recognised by the state be banned, including \"Igrejas Mundial do Poder de Deus\", \"Mundial do Reino de Deus\", \"Mundial Internacional\", \"Mundial da Promessa de Deus\", \"Mundial Renovada\" and \"Igreja Evangélica Pentecostal Nova Jerusalém\" be suspended. In Brazil this news was published with a response from local religious leaders.\nAfter a \"systematic violation of the rights of members\", such as \"racial discrimination and violation of statutory rules\"; an \"imposition and cooperation on castration or vasectomy for pastors\", the Angolan government in June 2020 ordered the dissolution of its board of directors and the removal of Bishop Honorilton Gonçalves from his leadership. The act was interpreted by local religious as the official loss of control by Brazilian bishop Edir Macedo over Universal in the country.\nUCKG and film promotion\nThe Ten Commandments is a film released in 2016 by UCKG-controlled Rede Record in association with Paris Filmes. It is an adaptation of the eponymous television series presented by Rede Record in 2015. The adaptation was written by Vivian de Oliveira and directed by Alexandre Avancini, with the same cast as the soap opera.\nDuring pre-order the film broke several records. In two weeks, more than 2 million tickets were sold, and it was also shown at more screens in Brazil, over 1,000, than any previous film. However, it was poorly received by critics.\nThe UCKG was criticised for heavily promoting the film at their services, and asking those attending for money to buy tickets for those who could not afford them; pastors at church services distributed envelopes with the Ten Commandments logo, and asked for them to be filled with money and returned to help the \"cause\", interspersed with stressing the importance of tithing 10% of salary, plus extra donations, every month.\nThe film was widely released, but a news report in São Paulo showed empty screening rooms at the premiere of the film, despite the tickets sold at the box office. It was reported that in Recife a single  buyer associated with the UCKG bought all the tickets for all showings of the film in its first two weeks, more than 20,700 tickets. The UCKG officially denied the negative reports about the film.\nIn 2018, the film Nada a Perder (Nothing to Lose), which depicts the story of Edir Macedo, part-funded and promoted by Macedo's Record channel, was similarly reported to be the biggest-selling Brazilian film, but to be playing to rows of empty seats night after night; in one case two sold-out performances played to a totally empty cinema, and to a woman and her two children. A UCKG spokesman said that it was a lie and fake news propagated by media with \"a long history of attacks against Universal and the Christian faith\" that the film was showing to empty cinemas. He said that the church had \"never\" bought tickets for the film, but there had been \"an initiative so that the biggest number of people possible could see the film—taking needy populations and residents of poor neighbourhoods, the excluded and those who never had access to a cinema where they live\".\nIllegal child adoption scheme in Portugal\nIn December 2017, the Portuguese UCKG was accused of running an illegal child adoption network.  Children were allegedly taken from their biological mothers and illegally taken to  foreign countries for adoption. The investigation continued ; the Portuguese judicial authorities had by then ruled that children were not taken illegally from their parents, but that there were indications of crime in the subsequent process of adoption.\nIn May 2019, the Public Prosecutor's Office determined the termination of investigative procedures, deeming the absence of grounds for any prosecution. The Prosecutors' Office stated that the foster care homes belonging to the UCKG were legally constituted and operated, further confirming the legality of the institutionalization proceedings carried out before the national legal entities. No criminal proceedings were carried out by the Prosecutors' Office regarding the adoption of institutionalized children.\nFollowing the termination, the Public Prosecutor's Office has since carried out criminal proceedings for false testimony against two mothers of some of the adopted children. Both mothers issued statements in a public television report, as well as before a court, under oath. One claimed that she had not signed any court documents to authorize any adoption proceedings, while the other stated that she was never notified by the court, or by any other means, of her children's adoption, saying that she had never signed any notification of said adoptions - both claimed that their signatures had been forged and wrongfully submitted in court, in order for the adoptions to proceed. However, subsequent forensic inspections, carried out by the Prosecutors' Office, then indicated that the mothers had indeed signed the court documents regarding their children's adoptions, deeming the respective procedures as lawful. Both women currently await trial for false testimony.\nOne mother has since confessed that she had indeed received and signed a court notification regarding her sons' adoption, claiming, before the court, that her false allegations of signature forgery were instigated by a journalist from Portuguese broadcast channel \"TVI\", whilst further stating the falsehood of her previous accusations to the UCKG.\nAccording to the mother's allegations, journalist Alexandra Borges instigated her to state that she had not signed any adoption papers or notifications, in exchange for reuniting her with her estranged sons.\nOpposing women's higher education\nBishop Macedo stated in a 2019 sermon that daughters should not be allowed to seek out higher education, because if they do they will be \"smarter than their husbands\", and that he personally would not allow his daughters to go to college because he believes that an educated woman cannot have a happy marriage: \"When they [my daughters] went out, I said they would just go to high school and they wouldn't go to college. My wife supported me, but the relatives found it absurd. Why don't you go to college? Because if you graduate from a particular profession, you will serve yourself, you will work for yourself. But I don't want that, you came to serve God. Because if ... she was a doctor and had a high degree of knowledge and found a boy who had a low degree of knowledge, he would not be the head, she would be the head. And if it were the head, it would not serve God's will. I want my daughters to marry a male. A man who has to be head. They have to be head. Because if they are not head their marriage is doomed to failure.\"\nSurviving Universal UK\nSurviving Universal UK was created in 2022 by ex-member Rachael Reign who said \"I wanted to bring it out into the open and encourage others to tell their story.\"\nIn 2022 hundreds of former members in the United Kingdom through Surviving Universal UK spoke out publicly about the abuse they had endured within the church, including sexual, physical, and financial abuse and coercion. Following this the general issue of faith abuse was widely discussed in the UK news media. Surviving Universal UK was widely viewed on TikTok, generating attention, and leading to an investigation by The Guardian and continuing reports.\nAfter the allegations become public the UCKG replied to several newspapers that they did not agree with the allegations, and remained critical of the many survivors who told their stories, as in a response to a Guardian article and podcast telling ex-followers' stories.\nAs the UCKG is a registered charity in the UK, survivors called on the Charity Commission to launch a statutory inquiry into the UCKG's conduct and finances with a view to stripping the church of its charity status. In the UK, the UCKG's income averaged £12 million a year in 2023, according to their annual report submitted to the Charity Commission, and about £15 million for the year ending 29 February 2024. UCKG survivor say members fund all UCKG activities, including expensive uniforms that all volunteers must wear, food banks and outreach programs, and question where the millions actually go.\nIn response to the criticism, the Charity Commission opened a regulatory compliance case into the UCKG over potential safeguarding concerns.\nMembers of Surviving Universal UK appeared in a 2023 BBC Panorama production exposing alleged conversion therapy and exorcism. The UCKG says that it does not perform conversion therapy.\nExorcism (\"deliverance\")\nThe UCKG practices prayers to cast out presumed evil spirits, usually described as exorcism but under the name \"deliverance\", citing the bible: I sought the Lord, and He heard me, and delivered me from all my fears. () The UCKG lists \"seven spirits of the devil that  the Spirit of God\": evil spirits, the spirit of thoughtlessness, the spirit of error, the spirit of confusion, the spirit of weakness, the spirit that blocks one's understanding, and the spirit of disregarding the Lord. The BBC reported on exorcism to rid a gay 13-year-old of a demon. The UCKG says that people under 18 are not allowed into such \"strong prayers\" services. The BBC Panorama investigation found that the church tells its congregations it can help with mental health conditions by casting out evil spirits, and that the leader of the church in the UK describes epilepsy as a \"spiritual problem\".\nReferences\nBibliography\n*\n*  The first English-language book on the, UCKG outside of Brazil. An endorsement by David Lehmann, University of Cambridge, written at the time of publication, reads as follows: \"In what is by far the most profound and wide-ranging study of one of the world's most challenging and disconcerting religious phenomena, Ilana van Wyk has produced a truly engrossing work of ethnography. In its triumphant march out of Brazil and across the globe, the Universal Church of the Kingdom of God attracts millions of followers, but also puzzlement, indignation and shock for its success with methods which seem at first sight to be utterly out of keeping with contemporary cultures. This book covers the controversial aspects one by one: money, demonic possession and exorcism; unbearable family tensions amidst poverty and AIDS; and the mysteries of the church's internal dynamics. Some of the case material is deeply distressing, but the analytical fruits will be with us for a long time to come.\" The UCKG said in a press release that it did \"not condone the seemingly one-sided, biased report which is fraught with factually incorrect statements and sweeping generalisations which are contained both in the book and in Van Wyk's interviews\".\n**\n*  This is a 2nd, paperback, edition of van Wyk's book, with title and subtitle swapped; there are excerpts from reviews on the publisher's website.\nExternal links\n* [http://www.uckg.org/ UCKG official English language website (United Kingdom)]\n* [http://universal.org/ Official US website (Portuguese and English languages)]\n*  Article about difficulties leaving the UCKG, and the organisation Surviving Universal UK."
    }
  ]
}