{
  "content": [
    {
      "type": "text",
      "text": "# University of Nanking\n\nThe University of Nanking (金陵大學) was a private university in Nanjing, Jiangsu, China. It was sponsored by a consortium of American churches, including the Methodist Episcopal Church, the Disciples of Christ, and the Presbyterian Church. The university effectively become defunct in 1952, following the 1952 reorganization of Chinese higher education by the central government of the newly established People's Republic of China.\nHistory\nNanking University (匯文書院, Huiwen Shuyuan) was founded in 1888 by C.H. Fowler. Initially there were three faculties: liberal arts, divinity and medicine. In 1910, The Nanking University merged The Union Christian College (宏育書院, Hongyu Shuyuan, formed in 1900 by the merger of The Christian College (基督書院, Jidu Shuyuan, founded in 1891) and The Presbyterian College (益智書院, Yizhi Shuyuan, founded in 1894) and changed the name to Private University of Nanking (金陵大學).\nOn April 19, 1911, the University was granted a charter by the Regents of the University of the State of New York. The following year, the university graduated its first class with a bachelors of arts degree.\nDuring the Nanking incident of 1927, the university was damaged by looters and Dr. John Elias Williams, the University's vice president was shot and killed. Many faculty members fled for their safety.\nIn 1951, Ginling College (former Ginling Women University, established in 1913) merged into the University of Nanking. In 1952, the University of Nanking was merged with Nanjing University (南京大學).\nPresidents\n* John Calvin Ferguson\n* G.A. Stuart (師圖爾)\n* Arthur J. Bowen ()\n* Chen Yuguang (陳裕光)\n* Fangxun Li (李方訓; Fang-Hsuin Lee)\nNotable alumni\n* Ching Chun Li, geneticist, Chairman of American Society of Human Genetics.\n* Choh Hao Li, biologist, biochemist. His achievements include isolating and synthesizing the human pituitary growth hormone. He received many honors including Lasker Award.\n* Choh-Ming Li, educationist, economist.\n* Francois Cheng, writer, poet. A \"Bridge Between Eastern and Western Culture\".\n* T. C. Tso, agriculturalist, tobacco scientist.\n* Te-Tzu Chang, agriculturalist. Member of Academia Sinica. He receives Tyler Prize in 1999.\n* Thome H. Fang, philosopher.\n* W. B. Pettus, educator.\n* Wang Yinglai, biochemist who achieved the synthesis of insulin\n* Wu Teh Yao, educationist, politics scholar.\n* Zhang Zhiwen, agriculturist, Vice Director General of FAO of United Nations.\nNotable faculty\n* Tsou Pingwen, agriculturist, Vice Chairman of the Preparatory Committee of Food and Agriculture Organization of the United Nations.\n* Albin Bro, fourth president of Shimer College.\n* John Lossing Buck, agricultural economist\n* Pearl S. Buck, writer.\n* Charles W. Woodworth, Professor Emeritus and founder of the Entomology Division U.C. Berkeley (1891-1930) was a lecturer in Entomology during his sabbatical in 1918.  He was there then again between 1921-4. (See the C. W. Woodworth Award.)\nReferences\nExternal links\n* [http://ricci.rt.usfca.edu/institution/view.aspx?institutionID=130 University of Nanking 金陵大學]"
    }
  ]
}