{
  "content": [
    {
      "type": "text",
      "text": "# University of Queensland Seismology Station\n\nThe University of Queensland Seismology Station was established in 1938 at the University of Queensland, Brisbane, Australia.\nHistory\nThe University of Queensland Seismology Station is a long term research project of the University, second only to the Pitch Drop experiment. The station was established following the Gayndah earthquake of 12 April 1935. W.H. Bryan, who was a lecturer in Geology at the University of Queensland, undertook an investigation into the earthquake, distributing a questionnaire to those affected by it, and undertook field investigations. This was done to establish the epicentre of the earthquake, and its cause and effects. Newspaper coverage of the event was extensive in 1935, and following on from an interview with W.H. Bryan, a donor presented a Milne-Shaw Seismograph to the University to aid their continuing research. A second seismograph was loaned to the University by the Commonwealth Council for Scientific and Industrial Research (CSIR) and the University purchased several more. An official station was set up in the basement of a building at the University of Queensland, then in George Street, Brisbane. It was designed to monitor tremors.\nThe Geology department of the University of Queensland, was led by Professor H.C. Richards from 1911-1947. Both Richards and Bryan made use of the public's interest in the 1935 earthquake to push for further research into earthquakes in Queensland and overseas. They also had a role to play in cyclone prediction. After the University moved to it new location in St Lucia, Brisbane in 1951, the existing seismographs, and in time new models, were re-housed in the basement levels of the new Richards Building, but the near constant construction of new buildings at St Lucia, played havoc with the readings. Eventually the seismographs were removed to new observatories at Mt Nebo in 1956 and Charters Towers in 1960.\nCollaboration with other bodies\nThe University of Queensland continues to monitor the seismograph network established with the original seismographs in 1935 and informs national and international networks of the results it retrieves. In 1970, the Queensland government Department of Mines and Energy became involved with the monitoring of seismic activity. Their participation ended in 1994, and the Advanced Centre for Earthquake Studies (now Earth Systems Science Computational Centre) at UQ was formed to continue to analyse the impact of earthquakes in Queensland. The United States Geological Survey's Global Seismographic Network have a collection of seismograms from Queensland. The International Seismological Centre in the U.K. also collects data from Queensland. Geoscience Australia maintains a national network of observatories collecting seismic data.\nReferences"
    }
  ]
}