{
  "content": [
    {
      "type": "text",
      "text": "# University of Warwick Science Park\n\n| num_employees    = 25\n| homepage         =\n}}\nThe University of Warwick Science Park (also known as UWSP and Warwick Science Park) was one of the first university based science parks in the United Kingdom when it was opened by Margaret Thatcher in 1984. It was a joint venture between the University of Warwick, Coventry City Council, Warwickshire County Council and Barclays. The latter are no longer shareholders having been replaced by WM Enterprise. The University of Warwick agreed in 2011 to purchase the shareholding of Coventry City Council. The acquisition was completed in 2012 and today the Science Park is wholly owned by the University of Warwick. UWSP currently covers four sites; the main campus abutting the University of Warwick, the Business Innovation Centre in Binley, Warwick Innovation Centre on Warwick Technology Park and Blythe Valley Innovation Centre near Solihull.\nUWSP typically provides office, workshop and lab space for up to 150 businesses.\nHistory\nThe University of Warwick Science Park was established in 1982 by the then Vice Chancellor of the University of Warwick, Lord Butterworth. The first building, the Barclay's Venture Centre (now the Venture Centre) was formally opened by UK Prime Minister Margaret Thatcher on 24 February 1984. In 2004, UWSP was awarded the 'Incubator of the Year' award by UKBI. The founding Director of UWSP, David Rowe, was awarded the Queen's Award for Enterprise Promotion in 2006.\nIn 2012 the University of Warwick acquired sole ownership of the Science Park.\nFacilities\nUniversity of Warwick\nThe University of Warwick Science Park’s main 42-acre campus is centred on the Venture Centre. It includes a further twenty buildings, some of which are owner occupied whilst others are leased. Many of the buildings on UWSP's campus are named after old British car models.\nThe main buildings include:\nThe Venture Centre\nHerald Court\nSovereign Court\nRiley Court\nVanguard Centre\nViscount Centres\nWarwick Innovation Centre\nWarwick Innovation Centre opened at Warwick Technology Park in 1997 as a joint venture between UWSP and Warwickshire County Council. Further developments followed in 1999 & 2001 providing  of lettable space.\nBusiness Innovation Centre\nThe  Business Innovation Centre at Binley, Coventry opened in April 2000 as a joint venture between UWSP and Coventry City Council.\nBlythe Valley Innovation Centre\nUWSP manages the  Innovation Centre at Blythe Valley Business Park on behalf of Solihull Metropolitan Borough Council, Prologis and British Land.\nActivities\nIn addition to property services, UWSP offers a range of business support activities targeted at innovation led SMEs.\nMinerva\nUWSP hosts and manages the Business Angel Network, Minerva. Minerva is actually an acronym for Midlands Network of Entrepreneurs, Venturers and Angels. In addition to supporting a community of high-net-worth individuals.\nTechnical Marketing (Techmark)\nTechmark has provided marketing services to established, start-up and pre-start technology businesses since 1996. Services include market exploration, market development, strategic planning, marketing execution and overseas market access.\nIncubation (Ignite)\nIgnite provides mentoring and subsidised incubator space for tech based start-ups with high growth potential. This is spread across three sites, the main campus, Warwick Innovation Centre and the Business Innovation Centre.\nIncubation (UK Market Access Programme)\nThe UK Market Access Programme provides a blend of subsidised office space and professional service support for foreign owned companies seeking to establish UK trading arms. Warwick Science Park is one of the founding members of the UK Market Access Program.\nAccess to Finance\nAccess to Finance services provided by UWSP enables businesses to raise external funding covering debt fiance, equity finance or grant funding. UWSP has also managed a number of seed investment funds including the fully invested UWSP Concepts Fund and the £7m Advantage Proof of Concept Fund.\nAccess to Skills and Knowledge\nHelp to connect companies to University research to access related specialist knowledge resources and expertise and help to up-skill business owners.\nSee also\n*List of science parks in the United Kingdom\nReferences"
    }
  ]
}