{
  "content": [
    {
      "type": "text",
      "text": "# University of Sri Jayewardenepura\n\nVijja Uppattam Setta\n| mottoeng               = \"Among all that arise, knowledge is the greatest\"\n| established            =  (as Vidyodaya Pirivena)| (as Vidyodaya University)}}\n| undergrad              = 14,750\n| postgrad               = 3560\n| administrative_staff   = 3950\n| city                   = Nugegoda\n| country                = Sri Lanka\n| campus                 = Main premises at Gangodawila\n| chancellor             = Ittapana Dhammalankara Anu Nayake Maha Thero\n| vice_chancellor        = Pathmalal M. Manage\n| coordinates            =\n| academic_affiliation   = University Grants Commission, Association of Commonwealth Universities, International Association of Universities\n| accreditation          = University Grants Commission\n| sporting_affiliations  = Sri Lanka University Games\n| website                =\n| logo                   = University of Sri Jayewardenepura logo.png\n| logo_upright           =\n| logo_size              =\n}}\nThe University of Sri Jayewardenepura (also known as Jayawardhanapura University or USJ; , ) is a public university in Sri Lanka. It is in Gangodawila, Nugegoda, near Sri Jayewardenepura Kotte, the country's administrative capital. It was formed in 1958 from the Vidyodaya Pirivena, a Buddhist educational centre which was founded in 1873 by Hikkaduwe Sri Sumangala Thera.\nHistory\nThe university dates back to 1873, when the Vidyodaya Pirivena was established by the Buddhist monk Hikkaduwe Sri Sumangala Thero, who established the pirivena as a centre of Oriental learning.\nIn 1956, the new prime minister Solomon West Ridgeway Dias Bandaranaike wanted to promote national languages and culture; it was decided to confer university status on the Vidyodaya and Vidyalankara pirivenas. The Vidyodaya University and Vidyalankara University Act No. 45 of 1958 established universities at the Vidyodyaya Pirivena at Maligakanda and the Vidyalankara Pirivena at Kelaniya; the former was renamed the Vidyodaya University of Ceylon.\nA new location was selected in 1961 at Gangodawila,  southeast of central Colombo and within walking distance of the High-Level Road (A4) trunk road connecting Colombo and Ratnapura. Part of the land belonged to the nearby Sunethradevi Pirivena, associated with King Parakramabahu VI (1412–1467). The university moved to the new site on 22 November 1961, under the direction of Sri Soratha Thero. The vice-chancellor invited the Department of Government Archives to establish its archives on the campus, near the university library, to encourage research. The Higher Education Act (No. 20 of 1966) opened Sri Lanka's universities to women.\nThe university expanded during the tenure of Walpola Rahula Thero as vice-chancellor. Rahula Thero was succeeded in 1969 by linguist D. E. Hettiarachchi. At the time, future President of Sri Lanka Mahinda Rajapaksa chaired the campus' United Corporations and Mercantile Union local.\nThe university's revitalization continued until the 1971 JVP insurrection, when the political atmosphere heavily affected its students' education. After the insurrection, the university was converted into a detention camp for suspected insurgents in 1971 and 1972; lectures were delivered at other locations.\nThe following year, all universities became campuses of the University of Ceylon under the University of Ceylon Act (No. 1 of 1972). In 1978, their university status was restored.\nThe university's full-time student population is over 18,000, enrolled in the faculties of applied sciences, engineering, graduate studies, humanities and social sciences, management studies and commerce, medical sciences, and technology.\n{| class=\"wikitable\"\n|+Chancellors and vice-chancellors\n!Chancellor\n!Period\n!Vice-chancellor\n!Period\n|-\n|Sir Oliver Goonetilleka, governor-general (ex-officio)\n|1959 – 1962\n|Ven. Welivitiye Soratha Nayaka Thero\n|January 1959 – July 1963\n|-\n| rowspan=\"9\" |Hon. William Gopallawa, governor-general (ex-officio)\n| rowspan=\"9\" |1962 – 1977\n|Ven. Palannoruwe Sri Wimaladhamma Nayake Thero\n|August 1963 – September 1966\n|-\n|Ven. Parawahera Vajiragnana Nayake Thero\n|March 1966 – September 1966\n|-\n|Ven. Balangoda Ananda Maithriya Nayake Thero\n|October 1966 – November 1966\n|-\n|Ven. Dr. Walpola Rahula Thero\n|November 1966 – July 1969\n|-\n|Prof. D. E. Hattiarachchi\n|August 1969 – August 1970\n|-\n|Prof. Hema Ellawala (vice-chancellor/campus president)\n|September 1970 – September 1972\n|-\n|Prof. V. K. Samaranayake (campus president)\n|October 1972 – September 1973\n|-\n|Prof. M. D. C. Dharmawardena\n|March 1974 – January 1975\n|-\n|Prof. W. M. K. Wijayathunge\n|February 1975 – May 1977\n|-\n|H. E. J. R. Jayawardana, president (ex-officio)\n|1978 – 1979\n|Prof. K. Tuley de Silva\n|June 1977 – July 1978\n|-\n| rowspan=\"2\" |Dr. E. W. Adhikaram\n| rowspan=\"2\" |1979 – 1983\n|Prof. K. Jinadasa Perera (campus president/vice-chancellor)\n|January 1979 – December 1981\n|-\n|Prof. T. B. Kangahaarachchi\n|January 1982 – January 1983\n|-\n| rowspan=\"7\" |Dr. Wimala de Silva\n| rowspan=\"7\" |1984 – 2002\n|Dr. Karunasena Kodituwakku (competent authority)\n|February 1983 – March 1984\n|-\n|Dr. Karunasena Kodituwakku\n|March 1984 – April 1988\n|-\n|Prof. L. P. N. Perera\n|April 1988 – September 1990\n|-\n|Prof. S. B. Hettiarachchi\n|October 1990 – October 1992\n|-\n|Mr. W. B. Dorakumbura\n|November 1992 – October 1995\n|-\n|Prof. P. Wilson\n|November 1995 – April 1999\n|-\n|Prof. Tissa Kariyawasam (acting vice-chancellor)\n|May 1999\n|-\n| rowspan=\"3\" |Ven. Medagoda Sumanatissa Thero\n| rowspan=\"3\" |2002 – 2007\n|Prof. J. W. Wickremasinghe\n|June 1999 – May 2002\n|-\n|Prof. Tissa Kariyawasam (acting vice-chancellor)\n|June 2002 – October 2002\n|-\n|Dr. D. S. Epitawatta\n|October 2002 – December 2003\n|-\n| rowspan=\"5\" |Ven. Prof. Bellanwila Wimalarathana Thero\n| rowspan=\"5\" |2005 – 2018\n|Prof. Chandima Wijebandara\n|27 July 2004 – October 2005\n|-\n|Prof. Narada Warnasuriya\n|November – September 2008\n|-\n|Dr. N. L. A. Karunaratne (acting vice-chancellor)\n|October 2008 – November 2008\n|-\n|Dr. N. L. A. Karunaratne\n|November 2008 – November 2014\n|-\n| rowspan=\"2\" |Prof. Sampath Amaratunge\n| rowspan=\"2\" |November 2014 – November 2020\n|-\n| rowspan=\"3\" |Ven. Dr. Ittapana Dhammalankara Thero\n| style=\"white-space: nowrap;\" rowspan=\"3\" |2018 –&nbsp;present\n|-\n|Prof. Sudantha Liyanage (acting vice-chancellor)\n|January 2020 – September 2020\n|-\n|Prof. Sudantha Liyanage\n|style=\"white-space: nowrap;\"|September 2020 – present\n|}\nFaculties\nThe university originally had five faculties: Buddhist Studies, Philosophy, Languages, Arts, Ayurveda, and Science. The faculties had 22 departments.\nSJU currently has eleven faculties: Applied Sciences, Engineering, Graduate Studies, Humanities and Social Sciences, Management Studies and Commerce, Medical Sciences, Allied Health Sciences, Dental Sciences, Computing, Urban and Aquatic Bioresources, and Technology.\nThe Department of Science was elevated to a faculty of Applied Sciences in 1962, with G. C. N. Jayasuriya as its first dean. Its current dean is Upul Subasinghe of the Department of Forestry and Environmental Science.\nThe Department of Medical Education and Health Sciences (DME&HS) was established to improve and sustain the quality of the Faculty of Medical Sciences and to present certificate and diploma courses in the health sciences.\nInternational links\nWorld Class University Project\nThe University Grants Commission (UGC) defines the World Class University Project (WCUP) as \"The implementation of a series of activities on par with international standards and to formulate and implement specific strategies to move up in the internal ranking indexes and become 'world-class' in order to achieve global excellence\". The project focuses on encouraging local fields which support innovation leading to national development by prioritizing interdisciplinary studies which combine the basic sciences and the humanities.\nThe WCUP is designed to develop a research culture at the university. The project, directed by Ranil De Silva, was established to encourage world-class scholars and researchers to develop academic programmes and departments at the university. It has signed six international memoranda of understanding since 2013 and has initiated twelve since that year.\nForeign Student Affairs\nThe Foreign Student Affairs Office, chaired by Lalith Ananda, provides students with an opportunity to gain international experience with split programmes, student exchange programmes, and study visits. The office also provides an opportunity for the international community to participate in the university's academic and research activities.\nResearch Council\nUSJ's Research Council was established in 2016 to facilitate high-quality research. The council has 18 research centres to facilitate research projects about pressing issues in Sri Lanka. Research awards and editing, foreign travel and publishing-cost schemes have been implemented to encourage research by the university.\nInstitutes, units and faculties\nPostgraduate Institute of Management\nThe Postgraduate Institute of Management (PIM), a semi-autonomous, self-financed institute affiliated with the university under director Senaka Kelum Gamage, was established in 1986 under the Universities Act (No. 16 of 1978). One of Sri Lanka's eight postgraduate institutes, it is the only public higher-education body which is ISO 9000:2008 and is a member of the Association of Advanced Collegiate Schools of Business (AACSB).\nExternal Degrees and Extension Course Unit\nWhen the university was Vidyodaya Pirivena, female students were not admitted. The unit was first established to register women for the Bachelor of Arts External Degree Programme.\nEnglish Language Teaching Department\nThe English Language Teaching Department (ELTD), part of the Faculty of Humanities and Social Sciences and renamed in 2017 by the University Grants Commission, aims to improve student proficiency in English and introduced a credit course in 2013 for first-year students.\nPhysical Education Division\nThe Physical Education Division, established in 1968, has facilities for 38 sports. Facilities include an outdoor volleyball court, basketball courts, tennis courts, a swimming pool complex, and a cricket ground.\nStaff Development Centre\nThe Staff Development Centre of the University of Sri Jayewardenepura (SDC-USJP) focuses on increasing the quality of employees with professional development programmes. The centre serves all seven faculties and their units, over 560 academics, 35 academic-support staff, 37 executive staff and 20 non-academic staff.\nCentre for IT Services\nThe centre manages the campus IT infrastructure.\nCareer Guidance Unit\nEstablished in 1998, the unit provides graduates with professional guidance. It has established a Gavel Club, which hosts an annual Speech Master contest. The unit has also established a career-skills-development society which hosts an annual job fair, J’pura employability awards ceremony, OBT Camp, a Donate Happiness cancer-hospital project and an Arunella career-guidance seminar for schoolchildren.\nSports\nUSJ won two consecutive Sri Lanka University Games, in 2016 and 2019. The university has produced the first undergraduate to participate in the Olympic Games: Sumedha Ranasinghe, in 2016.\nRelated institution\nVidyalankara University, created at the same time as Vidyodaya University, is presently known as the University of Kelaniya.\nReferences\nExternal links\n*"
    }
  ]
}