{
  "content": [
    {
      "type": "text",
      "text": "# University of Reading War Memorial\n\n|location       = London Road Campus, University of Reading, Reading, Berkshire\n|nearest_town   =\n|designer =    Herbert Maryon\n|inscription =\n| embedded=}}\nThe University of Reading War Memorial is a clock tower, designed by Herbert Maryon and situated on the London Road Campus of the University of Reading. Initially designed as a First World War memorial and dedicated in June 1924, it was later expanded in scope to also serve as a memorial of later wars.\nHistory and design\nMemorials to servicemen who died in the First World War were erected soon after the end of the conflict. Plans to build a permanent memorial at the University of Reading unfolded in 1919, when William Macbride Childs, the principal of the college, printed a pamphlet suggesting several ideas. The final design was ultimately made by Herbert Maryon, a teacher of sculpture at the university; he would later gain broad recognition in a second career at the British Museum, where he conserved many of the finds from the Sutton Hoo ship-burial, termed \"the most important single discovery in British archaeology.\" His initial proposal, made in 1919, was for a tower of  that would have cost between £5,000 and £10,000. The funds could not be raised, and in 1923 Maryon proposed a structure of half that height. Construction began that November, and the memorial was dedicated the following June. The finished memorial, which cost £2,750, is a  brick tower with a clock, a bell, and a bronze roll of honour listing the names of more than 140 people who died in the war.\nThe scope of the memorial was expanded following the Second World War, and in May 1953 a panel with more than 70 names of the dead from that conflict was unveiled. It now also commemorates those who died in the war in Afghanistan; in 2012 a plaque was unveiled honouring Lieutenant Colonel Rupert Thorneloe, , a 1991 graduate of the University whose 2009 death made him the highest-ranking officer of the British Army killed in action since the Falklands War.\nOn 12 February 1987, the memorial was designated a grade II listed building, a status given for its special architectural or historic interest.\nOn 9 November 2018, the University of Reading announced plans to add nine additional names of servicemen who died in the First World War to the memorial.\n}}"
    }
  ]
}