{
  "content": [
    {
      "type": "text",
      "text": "# University College of Science, Technology and Agriculture\n\n| type                   = Public\n| founder                = Ashutosh Mukherjee\n| chancellor             = Governor of West Bengal\n| vice_chancellor        = Asis Kumar Chattopadhyay\n| location               = 92, Acharya Prafulla Chandra Road, Rajabazar, Kolkata - 700009, West Bengal Annex : JD-2, Sector-III, Salt Lake City, Kolkata-700106, West Bengal.\n35, Ballygunge Circular Road, Ballygunge, Kolkata - 700026, West Bengal\n| nickname               = Science College,Calcutta College of Science,University College of Science\n| campus                 = Urban\n| affiliations           = UGC, NAAC, AIU, AICTE\n| free_label             = Acronym\n| website                =\n| free                   = UCSTA\n}}\nThe University College of Science, Technology and Agriculture or UCSTA (formerly known as Rajabazar Science College) are two of five main campuses of the University of Calcutta (CU). The college served as the cradle of Indian sciences, where Raman won the Nobel Prize in Physics in 1930, with many fellowships of the Royal Society London.\nHistory\n, Jagadish Chandra Bose, Jnan Chandra Ghosh.\nStanding (L to R): Snehamoy Dutt, Satyendranath Bose, Debendra Mohan Bose, NR Sen, Jnanendra Nath Mukherjee, N C Nag]]\nDespite the fact that the Presidency College at Calcutta witnessed great scientific research by Jagadish Chandra Bose and Prafulla Chandra Ray in the last decade of the 19th and the first decade of the 20th century, first organised scientific research at Calcutta University began with the establishment of its University College of Science and Technology in March 1914. A galaxy of Indian scientists joined the Chairs set up with the income of the endowments of nearly thirty seven and half lakhs rupees' donated by Sir Taraknath Palit and Sir Rashbehari Ghosh who were associated with the National Education Movement in Bengal since the Indian Universities Act of 1904-5 and the partition of Bengal in 1905. Babu Mahendranath Roy was given the responsibility of supervising the project by Sir Ashutosh Mukherjee, the then VC of Calcutta University.\nThe first group of faculties included Acharya Prafulla Chandra Ray, Chandrasekhara Venkata Raman, Ganesh Prasad, Sisir Kumar Mitra and the legendary 1915 M.Sc. batch comprising Satyendranath Bose, Meghnad Saha, Jnan Chandra Ghosh, Jnanendra Nath Mukherjee among others. The holders of the Chairs often worked under great financial constraints and with whatever apparatus was locally available in Calcutta. Yet their scientific research was soon to put Calcutta University on the map of world recognition. The science that developed at Calcutta University in colonial India was not a colonial science, as it was hardly supported by any large scale imperial funds and was solely meant for \"The promotion and diffusion of scientific and technical education for the cultivation and advancement of science, both pure and applied among Indians\".''\nScience in Calcutta University before 1914\nOne reason why Calcutta University could not develop a research programme in science earlier than 1914 was partly because of a great handicap inherent in its constitution and partly because of the paucity of funds needed for the development of such an institute at the post-graduation level. Till the end of 19th century Calcutta University remained mainly an examination body fed by a number of affiliated colleges which actually did teaching and which were dispersed from Shimla and Mussorie to Indore and Jaipur, and from Jaffna and Batticaloa to Sylhet and Chittagong. In these colleges there was hardly any provision for teaching of science courses with the exception of three colleges each in Civil Engineering and Medicine, all the 85 colleges in British India by 1882 were teaching courses in liberal arts leading to matriculation, F.A., B.A., Honours and M.A. Career in India was never virtually open to talents, through the principle had been asserted time and again in the Charter Act of 1883 and the Queen's Proclamation of 1858 after the Mutiny to allay fear, suspicion and distrust. In those days agriculture, manufacturing and commerce offered little to no incentives and was almost impossible to initiate without proper skills, capital and equality of terms with which it could compete with the European industry. Such discontentment among the educated unemployed gave rise to militant nationalism threatening the existence of very British Raj in India. Higher education in India was singled out as the root for all evils. So to curb this growing distress, Lord Curzon (then Viceroy of India) passed the Indian University Act in 1904 based on the recommendation of the Indian University Commission in 1902. While the various recommendations of the Commission to enable the Raj to control higher education in India were not strictly relevant here, some at least relating to the creation of new courses in science became important. The commission for the first time suggested the creation of the Faculty of Science and Technology in addition to the faculties of Arts, Law, Medicine and Civil Engineering previously offered by Calcutta University. Thus Bachelor of Science (B.Sc.) and Master of Science (M.Sc.) courses were introduced for first time in India. The commission also recommended the award of Doctor of Science (D.Sc.) degree which is to be given to a M.Sc. after some years spent in original investigations.\nWhen Sir Asutosh Mookerjee became the Vice Chancellor of Calcutta University in 1906, he used the Indian University Act of 1904-5 and converted the university from an examination body to a teaching university which will not only start post graduate degrees in humanities, English, Sanskrit, Pali, Arabic, Persian, Mental & Moral Philosophy, History, Economics and Mathematics but also establish chairs in some of them with financial support from the government by 1912. But for seven years, Mookerjee struggled hard to establish postgraduate teaching and research in Science and Technology despite his best intentions. The paucity of funds and accommodations were deplorable which meant that even if there were men, there was no accommodation laboratories, workshops, museums, equipment, etc. In Presidency College a small room measuring 35'6\" by 25'6\" was available to be used as a laboratory room, preparation room and as well as a practical room for biology and physiology classes, whereas a large number of B.A. students did not get the opportunity of having a regular course of practical training.\nEstablishment of the University College of Science and Technology\nIn these circumstances, Calcutta University was pleasantly surprised to receive the princely gifts of Sir Taraknath Palit, an eminent barrister and advocate of national education during the Anti-Partition movement(1905). In June and October 1912, he donated total assets of fourteen and a half lakh rupees which included his own dwelling house. His donations were made over to the university for the advancement of Science and Technology and were used to maintain the income of endowment of Physics and Chemistry Chair and also to institute scholarships to distinguished graduates of Calcutta University for higher studies. The university had to provide \"from its own funds\" suitable lecture rooms, libraries, museums, laboratories, workshops and other facilities for teaching and research. As the funds provided by the university was not fully adequate, Mookerjee approached the Government of India for financial support, which was rejected by Henry Sharp who was the joint secretary in department of education. The opposition of Sharp mainly emanated from his dislike of Calcutta University which he considered will become a non-political body with strong prejudice against the white men and the Europeans. He said, \"To give this money to this place is to give money to the cause which will embarrass ourselves. The money will go to political ends rather than to truly educational ends.\"\nIn August 1913, Sir Rashbehari Ghosh, an eminent jurist and scholar, in a letter to Asutosh Mookerjee placed in the hands of the university \"a sum of ten lakh rupees\" as per the conditions of his gift, there were to be established four chairs - one each for Applied Mathematics, Physics, Chemistry and Botany, with special reference to Agriculture, and eight studentships to be awarded to the distinguished graduates of this university \"to carry on investigation\" under the guidance of a professor. Both Palit and Ghosh wanted promotion and diffusion of scientific and technical education among their countrymen by indigenous agency and with the money now available through their endowments, Mookerjee could now launch his projected dream. Sir Ashutosh Mukherjee delegated the responsibility of managing the funds, and of disbursing them proportionally and judiciously to, Babu Mahendranath Roy, his friend and an emninent educationist of the time.\nThus four days before the expiry of the fourth term of his Vice-Chancellorship, Mookerjee laid the founding stone of the University College of Science and Technology on 27 March 1914 hoping fervently that \"although the College of Science and Technology is an integral part of the University of Calcutta, it will be regarded not as a provincial but as an all-India college of Science and Technology to which students will flock from every corner of the Indian Empire, attracted by the excellence of the instruction imparted and of the facilities  provided for research.\"\nThe influence of the teachings of Raja Rammohan Roy on the importance of education broadly based on science and technology impressed a group of newly graduated scientists S.N. Bose, Jnan Chandra Ghosh, M.N. Saha, N.R. Sen, P.C. Mahalanobis, S.K. Mitra and Jnanendranath Mukherjee. Sir Asutosh Mukherjee believed in young talents, selected promising young men and appointed them straightaway as lecturers in post graduate classes of newly formed Sc. College and provided them research facilities also. He was the first and perhaps the last to establish a centre of academic studies at the university stage with distinct atmosphere of learning and scholarships and appointed some of the best men available in the country as University Professor or Lecturers.\nThe establishment of the Calcutta University College of Science and Technology signals the beginning of outstanding research in some branches of science and applied science, which put India on the map of world recognition. A galaxy of Indian scientists joined the departments set up with the income of endowments donated by Palit and Ghosh and began their work in science with whatever apparatus available in India and soon made their mark in their chosen fields. Palit Chairs in Physics and Chemistry and Ghosh Chairs in Applied Physics, Chemistry, Mathematics and Botany were soon filled up after the formal establishment of the University College of Science and Technology in March 1914.\nKeys to the start of outstanding research in \"non-colonial\" science in colonial India\nThe establishment of Chairs in chemistry, physics, mathematics, zoology and Botany was the start of outstanding research and teaching by dedicated Indian scientists. Sir Asutosh Mookerjee who became the first president of the first session of the Indian Science Congress at Calcutta, where nearly a hundred scientists met on 26 January 1914, took great care to identify the right talent for the right post from different parts of India in science as in humanities and was able to attribute to the \"University College of Science and Technology\" as a true national character. No nation could live solely upon the achievements of its past or upon its borrowing from others, and at the same time hoped to retain its place among the great people of the Earth. Besides advancing the frontiers of knowledge, the work by the Indian scientists at the University College of Science and Technology not only helped in increasing the wealth of the country but also succeeded in drawing attention of the scientific world. The dedication and devotion with which the Indian scientists at the University College of Science and Technology began their work to explain the many unknown phenomena can only remind us of the zeal and enthusiasm with which William Jones and his choice band of thirty elite Englishmen in 1783-84 had begun their investigations into \"the history and antiquities, arts, sciences and literature of Asia.\"\nDespite the fact that the University College of Science and Technology was a department of Calcutta University set up as a part of the colonial educational despatch of 1854. there had been no substantial financial support from the British Raj to encourage the Indian scientists in their works presumably under the idea that Indian brains were not suitable for scientific research despite great promise shown by Jagadish Chandra Bose and Prafulla Chandra Ray at the Presidency College years before the foundation of the University College of Science and Technology. Of the total expenditure of rupees 1,813,959 of the University College of Science and Technology between March 1914 and March 1922, the Government of India's contributions from public funds was a meagre rupees 1,20,000 only. Yet in spite of these financial constraints and difficulties none of the scientists left for better position in imperial organisations. Instead classic example was provided by Prafulla Chandra Ray who when re-appointed Palit Professor for five years after reaching the age of superannuation donated his full monthly salary for the entire period for the special benefit of his department which was \"proud to acknowledge him as its leader\". During this difficult time, there had been \"a steady output of original work rapidly increasing in volume and improving in quality which emanated not from one or two extraordinarily isolated or exceptionally gifted workers blessed with special advantages and facilities, but from a large body of able and devoted scholars\". No doubt, the scientists at the University College of Science and Technology sowed the seeds of many a promising project which were to bear fruits in the post-independence years. The University College of Science and Technology was indeed an oasis of scientific research in India since 1914.\nSir C.V. Raman, A Palit Professor of Sc. College made this revolutionary discovery on the \"Scattering of Light\" which is known as The Raman Effect. He announced his discovery on 28 February 1928 and was awarded the Nobel Prize in Physics, the day widely celebrated as the National Science Day in India. Sir Jnan Chandra Ghosh became the first director of the newly created IIT in 1951 (Indian Institute of Technology Kharagpur). Sir J.C. Ghosh also was the second person to be associated with Sc. College (after Sir CV Raman) who became the director of IISc (Indian Institute of Science). Prof. A.P.C Ray founded the Bengal Chemicals and Pharmaceutical Work and he along with prof. Hemendra Kumar Sen established the department of Applied Chemistry in Sc. College in 1920. Prof. S.K. Mitra, the pioneer of Radio Science in India founded the department of Radio Physics and Electronics which Dr. Bidhan Chandra Roy (then chief minister of Bengal) laid the founding stone of, on 21 April 1949.\nNotable scholars associated with Science college include one Nobel Laureate in Physics, two National Award winning \"Film Directors\", at least twenty-five Shanti Swarup Bhatnagar Laureates, six Royal Society of London Fellows and several British Knighthood title holders and Padma Awardees.\nAcademics\nRankings\n451-500\n| THE_W_2021 = 601-800\n| NIRF_U_2021 = 4\n| NIRF_O_2021 = 11\n| WEEK_U_2021 = 6\n| OUTLOOK_U_2020 = 6\n}}\nDepartments\nScience college campus houses few of country's oldest applied science departments like applied physics, applied chemistry and Institute of Radio-Physics and Electronics. The college is also responsible for introducing degrees like M.Sc. and D.Sc. for first time in India. The Faculty of Engineering and Technology arm of Science college is the second oldest in West Bengal after IIEST Shibpur(Formerly B.E. College affiliated to Calcutta University).\nThe departments are as follows:\n* Radio Physics & Electronics (Electronics and Communication Engineering)\n* Applied Physics (Electrical Engineering, Instrumentation Engineering and Department of Applied Optics and Photonics)\n* Faculty of Agriculture, comprising six departments\n* Applied Optics and Photonics (Optics and Opto Electronics Engineering)-----a derivative of Department of Applied Physics .\n* Pure Mathematics\n* Applied Chemistry (Polymer Science & Technology, Chemical Engineering and Chemical Technology)\n* Applied Mathematics\n* Physics\n* Marine Science\n* Zoology\n* Chemistry\n* Geography\n* Atmospheric Science\n* Electronic Science\n* Psychology & Applied Psychology\n* Physiology\n* Geology\n* Neuroscience\n* Genetics\n* Environmental Science\n* Botany\n* Statistics\n* Biophysics, Molecular Biology & Bioinformatics.\nFrom 2015 onwards, the department of CSE (Computer Science and Engineering), A.K. Chowdhury School of IT (Information Technology) and OOE (Optics and Opto Electronics Engineering) has been shifted to the annex at Technology Campus in Salt Lake, (Address : JD-2, Sector-III, Salt Lake City, Kolkata-700106).\nDegrees being offered are:\n* D.Sc.\n* Ph.D.(Tech)\n* M.Tech.\n* B.Tech.\n* M.Sc.\n* M.Phil.\nResearch\nThe University College of Science and Technology has 172 principal investigators and around 1,500 research students.\nOn average, 250 PhDs are awarded every year and around 750 research papers were published in 2011. Fifteen national and international patents have been filed so far by science and technology departments of chemical engineering, polymer science, radio-physics and electronics, applied physics, physiology, biotechnology and biochemistry. The  proportion of teaching activity and research at the university is “50:50”. The university has signed high number of MoU with different institutes across the globe.\nThe university is currently linked with over 50 institutions of higher learning across the globe and the UK-India Education Research Initiative awarded £30,000 to CU's department of radio physics and the University of Sheffield for collaborative research on photonics and biomedical applications. The track record of Calcutta University science graduates at all-India competitive exams such as UGC-CSIR NET (Centre for Science and Industrial Research National Eligibility Test) and Jest (Joint Entrance Screening Test) for admission to premier research institutes in India has also been commendable. And CU alumni are at the helm in several Indian research organisations.\nThe Technology Faculty of this university is supported by TEQIP Phase 3 project of MHRD and has been working as the mentoring institute for Indira Gandhi Institute of Technology, Sarang, Odisha and Jorhat Engineering College, Assam. The university also received fund of INR 5 Crore from Rashtriya Uchchatar Shiksha Abhiyan (RUSA) for Infrastructure development. After successful completion the university received another fund of INR 50 Crore from RUSA 2.0 for project (INR 35 Crore) and Manpower & Entrepreneurship Development for project (INR 15 Crore). Different department of the university have received many funds from India and abroad for conducting research, manpower development etc. The university has many collaborations with industrial bodies for conducting joint research.\nBased on research publication output in SCOPUS International Data for a period of 10-years University of Calcutta/ Rajabazar Sc. College along with CRNN(Centre for Research in Nanoscience and Nanotechnology) has been granted funds by several government agencies under R&D Infrastructure Division of Ministry of Science and Technology like DST-PURSE (Promotion of University Research and Scientific Excellence) and FIST (Fund for Improvement of Science and Technology).\nNotable alumni\n* Bibha Chowdhuri (Alumni of Physics Department and she was the only woman to complete an M.Sc. degree in the year 1936. She worked on particle physics and cosmic rays.)\n* Asima Chatterjee (Alumni and later Khaira Professor of Chemistry Department. She was the first woman to receive a Doctorate of Science from an Indian university. She held office as a member of Rajya Sabha,  president of Indian Science Congress Association and was appointed for the Padma Bhushan, Shanti Swarup Bhatnagar Prize for Science and Technology and  D.Sc. (honoris causa) degree by Calcutta University.)\n* Purnima Sinha (Alumni of Physics department and was one of the first Bengali Women to receive a doctorate in physics from an Indian University.)\n* Satyendra Nath Bose (Alumni and later Professor of the physics department. Fellow of Royal Society known for Bose-Einstein Condensate and Bosons)\n* Meghnad Saha (Alumni and later Khaira Professor of Physics department, fellow of Royal Society known for Saha Ionisation Equation and is regarded as father of Modern Astrophysics.)\n* Prasanta Chandra Mahalanobis (Alumni, fellow of Royal Society and founder of Indian Statistical Institute Kolkata)\n* Anadi Sankar Gupta (Alumni and Professor of Applied Mathematics Department, an Indian Mathematician, S.S. Bhatnagar Awardee, INSA Senior Scientist and Emeritus Professor of IIT Kharagpur.)\n* Sisir Kumar Mitra (Alumni of Physics Department, fellow of Royal Society, founder/ HOD of radio physics department and father of radio science in India)\n* Jnanchandra Ghosh (Alumni and later Professor of Chemistry, founder of IIT Model and first director of IIT Kharagpur.)\n* Jnanendranath Mukherjee (Alumni and later Professor of Chemistry department, Padma Bhusan Awardee, Commander of Order of British Empire, fellow of Royal Society and Ex-General President of ISA, 1952)\n* Mrinal Sen (Alumni of Physics department, Indian film director. He has won National Film Awards 18 times along with French Ordre des Arts et des Lettres 1985, the Padma Bhushan in 2008 and the Order of Friendship in 2005 and the Dadasaheb Phalke Award 2005 for his contribution to Indian cinema.)\n* Amal Kumar Raychaudhuri (Alumni of Physics Department, An Indian Physicist known for his most significant contribution Raychaudhuri equation Raychaudhuri equation.)\n* Chanchal Kumar Majumdar (Alumni of Physics Department, A Condensed matter physicist and Founder Director of S. N. Bose National Centre for Basic Sciences Kolkata. He is an elected fellow of the Indian National Science Academy, the National Academy of Sciences, India and the Indian Academy of Sciences – as well a member of the New York Academy of Sciences and the American Physical Society.)\n* Mihir Chowdhury (Alumni of chemistry department and elected follow of the Indian National Science Academy, the Indian Academy of Sciences and recipient of Shanti Swarup Bhatnagar Prize for Science and Technology.)\n* Tapan Sinha (Alumni of physics department. He was one of the most prominent Indian film directors of his time along with Satyajit Ray and Mrinal Sen. He have won numerous national and international awards.)\n* Mani Lal Bhaumik (Alumni of physics department, founder of immensely popular LASIK eye surgery. He is a bestselling author, celebrated  physicist, entrepreneur and philanthropist.)\n* Bidyut Baran Chaudhuri (Alumni of radio physics department, A senior computer scientist at ISI Kolkata, A J.C. Bose Fellow, Life Fellow of IEEE \"for contributions to pattern recognition, especially Indian language script OCR, document processing and natural language processing\".)\n* Bikas Chakrabarti (Alumni of Physics department, An Indian Physicist and emeritus professor of physics at Saha Institute of Nuclear Physics.)\n* Sankar Kumar Pal (Alumni of radio physics and electronics department, Computer Scientist and AI Researcher, Ex-Director of Indian Statistical Institute Kolkata and Padma Shri Awardee of 2013. He is also a recipient of Shanti Swarup Bhatnagar Prize for Science and Technology.)\n* Biswarup Mukhopadhyaya (Alumni of Physics department, An India theoretical High energy physicist and a senior professor at Harish-Chandra Research Institute. He is an elected fellow of National Academy of Sciences and Shanti Swarup Bhatnagar Prize for Science and Technology Awardee 2003.)\n* Biman Bagchi (Alumni of Chemistry Department, A theoretical chemist and an Amrut Mody Professor at the Solid State and Structural Chemistry Unit of the Indian Institute of Science.)\n* Sanghamitra Bandyopadhyay (Alumni of computer science engineering department and present Director of Indian Statistical Institute Kolkata. She is also Shanti Swarup Bhatnagar Prize for Science and Technology, Infosys Awardee 2017 and TWAS Prize in 2018)\n* Kankan Bhattacharyya (Alumni of chemistry department, a modern non-linear laser spectroscopy scientist. He is the Ex-director and chair professor of Indian Association for the Cultivation of Science, Kolkata, the oldest centre for scientific research in Asia.)\n* Santanu Bhattacharya (Alumni of chemistry department, and elected follow of The World Academy of Sciences, Indian National Science Academy, and Indian Academy of Science, an Indian bio-organic chemist, a professor at the Indian Institute of Science, Bangalore and former Director of the Indian Association for the Cultivation of Science, Kolkata. He is N-Bios laureate and recipient of Shanti Swarup Bhatnagar prize and TWAS prize in Chemistry.)\n* Anuradha Lohia (Alumni of physiology department, an Indian molecular parasitologist and present Vice Chancellor of Presidency University. She is also a fellow of Indian Academy of Sciences and an Ex-Chairperson of Bose Institute in Kolkata.)\n* Phoolan Prasad (Alumni of Applied Mathematics Department, 1983 Shanti Swarup Bhatnagar Prize for Science and Technology Awardee and Fellow of INSA. He is currently a professor at Department of Mathematics at Indian Institute of Science Bangalore.)\n* Indrani Bose (Alumni of Physics department and fellow of the Indian Academy of Sciences, Bangalore, the National Academy of Sciences, Allahabad and was the first recipient of the Stree Shakthi Science Samman award (2000). She is currently a senior professor at Bose Institute, Kolkata.)\n* Deb Shankar Ray (Alumni of Chemistry Department and fellow of INSA, Indian Academy of Sciences, West Bengal Academy of Science and Technology and recipient of Shanti Swarup Bhatnagar Prize for Science and Technology. He is currently a professor at department of physical chemistry at Indian Association for the Cultivation of Science, Kolkata.)\n* Bidyendu Mohan Deb (Alumni of chemistry department and elected follow of the International Union of Pure and Applied Chemistry, The World Academy of Sciences, Indian National Science Academy, the Indian Academy of Sciences and recipient of Shanti Swarup Bhatnagar Prize for Science and Technology. He is currently a professor at IISER Kolkata.)\n* Debashis Mukherjee (Alumni of chemistry department. He is a recipient of Humboldt Prize, Chemical Pioneer Award, Indian Academy of Sciences, Indian National Science Academy and Shanti Swarup Bhatnagar Prize for Science and Technology. He is currently professor emeritus at the Indian Association for the Cultivation of Science.)\n* Rahul Banerjee (Alumni of chemistry department and currently professor at IISER Kolkata. Banerjee is a fellow of Royal Society of Chemistry and Shanti Swarup Bhatnagar Prize for Science and Technology among many others.)\n* Anil Kumar Gain (Alumni of Applied Mathematics Department. He was an Indian Mathematician who worked closely with Ronald Fisher on Applied Statistics under the guidance of Henry Ellis Daniels, who was then President of the Royal Statistical Society.)\n* Animesh Chakravorty (Alumni of chemistry department and Ex-HOD of chemistry department of IIT Kanpur and IACS Kolkata and visiting professor at Texas A&M University. He is a recipient of Shanti Swarup Bhatnagar Prize for Science and Technology 1975 and TWAS Prize among other fellowships.)\n* Siva Brata Bhattacherjee (Alumni of Physics department and an X-ray crystallographer who worked with Physicist Satyendra Nath Bose. Since 1945 he was a Khaira Professor at Science College and was also a faculty member at University of Manchester)\n* Lilabati Bhattacharjee (Alumni of Physics Department and an Indian crystallographer who worked with Physicist Satyendra Nath Bose and known from contributions in fields like structural crystallography, optical transform methods, computer programming, phase transformations, crystal growth, topography and instrumentation.\n* Usha Ranjan Ghatak (Alumni of chemistry department, Ex-Director of Indian Association for the Cultivation of Science and elected fellow of Indian Academy of Sciences, Indian National Science Academy and the Shanti Swarup Bhatnagar Prize for Science and Technology.)\n* Partha Ghose (Alumni of Physics department and one of the last doctoral students of the then National Professor of Physics Satyendra Nath Bose. He is an Indian Physicist, Author, Philosopher, Musician and former professor at the S.N. Bose National Centre for Basic Sciences.\n* Asok Kumar Barua (Alumni of Physics department and Honorary Professor Emeritus at IIEST Shibpur. He is an Indian Condensed matter physicist whose main focus on research is in Optoelectronics.\n* Debatosh Guha (Alumni of Radio Physics and Electronics Department, an Indian Antenna Researcher and currently a professor of the same Institute.)\n* Sushmita Mitra (Alumni of Computer Science Engineering Department and currently Head INAE Chair Professor at the Machine Intelligence Unit at Indian Statistical Institute, Kolkata.)\n* Aditi Sen De (Alumni of Applied mathematics department, An Indian Physicist and currently associate professor in quantum information and computation group at Harish-Chandra Research Institute, Allahabad.)\n* Kalobaran Maiti (Alumni of Physics department and recipient of Shanti Swarup Bhatnagar Prize for Science and Technology. He is currently a professor of condensed matter Physics at Tata Institute of Fundamental Research \"TIFR\".)\n* Ujjwal Maulik (Alumni of Computer Science Engineering Department, an IEEE and INAE Fellow and Professor and former Head, Computer Science Engineering Department, Jadavpur University.)\n* Akhil Ranjan Chakravarty (Alumni of Chemistry department, an Indian organic chemist and currently professor at Indian Institute of Science Bangalore.)\n* Rabindranath Mukherjee (Alumni of Chemistry department, an Indian chemistry chair professor of IIT Kanpur and Director of Indian Institute of Science Education and Research, Kolkata.)\n* Palash Baran Pal (Alumni of Physics department, An Indian Theoritical Physicist, Writer, Linguist, Poet and currently emeritus Professor at Calcutta University.)\n* Sudhansu Datta Majumdar (Alumni of Physics Department and Faculty member at IIT Kharagpur. He was president of Calcutta Mathematical Society.)\n* Amar Nath Bhaduri (Alumni of chemistry department and an Indian Chemical Biologist known for his work on UDP-glucose 4-epimerase and Leishmania donovani. He was the director of Indian Institute of Chemical Biology \"IICB\".)\n* Samarendra Nath Roy (Alumni of Applied Mathematics Department, an Indian born American Mathematician and Applied Statistician well known for his pioneering contribution to multivariate statistical analysis.)\n* Sandipta Sen ( Alumni of  master's degree in Applied psychology)\n* Rupamanjari Ghosh (Alumni of Physics Department, a professor of Physics Department at Jawaharlal Nehru University and present Vice Chancellor at Shiv Nadar University, Uttar Pradesh.)\n* Chitra Dutta (Alumni of Physics Department, an Indian Physicist who is also a Chief Scientist and Head of Structural Biology and Bioinformatics Division at Indian Institute of Chemical Biology.)\n* Maitree Bhattacharyya (Alumni of Physics Department, an Indian Physicist and currently professor of department of Biochemistry at University of Calcutta and worked as visiting scientist at University of California, San Diego.)\n* Moumita Dutta (Alumni of Applied Physics department, an Indian Physicist currently working at the Space Applications Centre \"SAC\", Indian Space Research Organisation \"ISRO\" - Ahmedabad as a scientist/engineer.)\n* Ashesh Prosad Mitra (Alumni of Physics Department, An Indian Physicist who headed the National Physics Laboratory in Delhi, India and was the Director-General of the Council of Scientific and Industrial Research (CSIR).)\n* Samarendra Kumar Mitra (Alumni of both Chemistry and Applied Mathematics Department, He was an Indian Scientist who planned, designed and developed, in 1953, India's first computer (an electron-analog computer).\n* Raj Chandra Bose (Alumni of both pure and applied mathematics department, He was a well-known Mathematician and Statistician.)\n* Anish Deb (Alumni and later professor of Applied Physics Department, He was also a well-known science fiction Bengali writer.)\n* Asim Duttaroy (Alumni of the Biochemistry Department, and currently serving as a professor in the Faculty of Medicine at the University of Oslo, Norway. He has been invited five times by the Nobel committee for accessing nominees for this prestigious award in the field of Physiology or in Medicine.)\n* P. P. Vaidyanathan (Alumni of radio-physics and electronics, he is a renowned electrical engineering professor at Caltech, known for his groundbreaking work in digital signal processing, filter banks, image processing, and more. He has authored four books and hundreds of papers, and holds degrees from Kolkata and UC Santa Barbara.)\nNotable faculty\n* Chandrasekhar Venkata Raman (Palit Professor of Physics Department, fellow of Royal Society and India's only Nobel laureate in Physics.)\n* Acharya Prafulla Chandra Ray (Professor, fellow of Royal Society and founder of Bengal Chemicals and Pharmaceuticals)\n* Ganesh Prasad (Rashbehari Ghosh Professor of Applied Mathematics department and considered by mathematical community as Father of Mathematical Research in India.)\n* Debendra Mohan Bose (Rashbehary Ghose Professor of Physics 1919 and succeeded C.V. Raman as the Palit Professor of Physics)\n* Amitava Raychaudhuri (Professor Emeritus at the Physics Department and an Indian theoretical particle physicist. He is also an S.S. Bhatnagar Awardee, J.C. Bose, INSA & IAS fellow.)\nReferences\nExternal links\n* [https://www.caluniv.ac.in/campuses/campus2.htm Rajabazar Science College]"
    }
  ]
}