{
  "content": [
    {
      "type": "text",
      "text": "# Unmanned: America's Drone Wars\n\nor  -->\n| director = Robert Greenwald\n| producer =\n| writer =\n| screenplay =\n| story =\n| based_on =\n| starring =\n| narrator =\n| music = Rob Himbaugh\n| cinematography =\n| editing =\n| studio = Brave New Films\n| distributor =\n| released =\n| runtime =\n| country = United States\n| language =\n| budget =\n| gross =\n}}\n'Unmanned: America's Drone Wars' is a feature-length documentary film released by Robert Greenwald and Brave New Films in October, 2013, investigating the impact of U.S. drone strikes in Pakistan and elsewhere.\nSynopsis\nThe film highlights the stories of 16-year-old Tariq Aziz, killed by a drone in 2011; and school teacher, Rafiq ur Rehman, whose mother was killed and children hospitalized due to a drone strike in 2012.\nUnmanned includes more than seventy interviews. Prominent among these are a former American drone operator; Pakistani families of drone victims who are seeking legal redress; high ranking politicians and some of the military’s top brass, warning against blowback from the loss of innocent life.\nWith the intent of humanizing those who have been impacted by US drone policy, Unmanned intersperses these interviews with never-before-seen footage from tribal regions in Pakistan.\nThe film claims that covert military drone strikes are often imprecise, and result in creating more enemies for the American people, who have little knowledge of how drone victims are targeted and killed.\nRelease\nUnmanned premiered theatrically in New York City on October 30, 2013. In keeping with Brave New Films' unique distribution model, it was also made available online for free.\nCongressional briefing\nIn anticipation of the release, and for the first time ever, Brave New Films and Reprieve brought survivors of US drone strikes to Capitol Hill to testify at a Congressional briefing.\nReception\nThe initial response to Unmanned was positive. Michael Moore's website said, \"It should be required viewing in all schools and homes in the United States.\"  The Front Page Online calls it \"ardently compelling.\"\nInterviewees\nInterviewees include:\n*Lawrence Wilkerson, former chief of staff to Secretary of State Colin Powell\n*David Kilcullen, former advisor to NATO and to General David Petraeus\n*Medea Benjamin, co-founder, Code Pink\n*Jemima Khan, associate editor, New Statesman\n*Imran Khan, chair of the Pakistan Tehreek-e-Insaf\n*Clive Stafford Smith, founder of Reprieve\n*Pratap Chatterjee, investigative journalist\n*Andrew Bacevich, professor of international relations and history at Boston University\n*Mark Mazzetti, national security correspondent, The New York Times and author, The Way of the Knife\n*Scott Shane, national security reporter, The New York Times\n*Glenn Greenwald, national security columnist, The Guardian\n*Karen DeYoung, senior national security correspondent, The Washington Post\n*USAF Col. Morris Davis (Ret.), former lead prosecutor For Guantanamo Bay\n*David D. Cole, professor, Georgetown University Law\n*Angelo Cardona, founder of Youth Against NATO\n*James Cavallaro, Stanford Law professor\n*Akbar Ahmed, former Pakistani ambassador to the UK, and chair of Islamic studies at American University\n*Pir Zubair Shah, Council on Foreign Relations (Former)\n*Philip Alston, United Nations, former special rapporteur on extrajudicial executions\n*23 more scholars, journalists, lawyers, public figures and activists\n*Dozens of Pakistani survivors of drone strikes, and family members of those who did not survive\nSee also\n* List of films featuring drones\nReferences\nExternal links\n*\n*"
    }
  ]
}