{
  "content": [
    {
      "type": "text",
      "text": "# UNOH Battle at the Beach__disambig_1\n\n| Laps                   = 150\n| Surface                = Asphalt\n|Length mi = .400\n| Turns                  = 4\n}}\n| Laps                   = 150\n| Previous names         =\n|Length mi               = .400\n}}\n| Laps                   = 150\n|Length mi = .400\n}}\nThe University of Northwestern Ohio Battle at the Beach was a nonpoints, all-star race that brought together the top drivers in NASCAR's lower-level series and club racing. A successor to the Toyota All-Star Showdown, held from 2003 to 2011 at Irwindale Speedway in California, the inaugural event was held at a newly built short track that was located on the backstretch of Daytona International Speedway on February 18–19, 2013.\nHistory\nNASCAR announced on February 17, 2012, that its annual all-star event for its regional touring series, formerly held at Irwindale Speedway as the Toyota All-Star Showdown from 2003 to 2011, would return for 2013 at Daytona International Speedway, using a new temporary .400-mile oval utilising Turn 8 of the motorcycle course, the skid pad off Turn 2, and the backstretch for February 18–19, 2013, the Monday and Tuesday of Speedweeks after Daytona 500 qualifying.  The race also adopted a new name with a new sponsor and venue, the University of Northwestern Ohio Battle at the Beach.\nThe K&N Pro Series East and West cars would return with their own race, along with Late Models (although it will feature only one class, based on NASCAR-established rules used at NASCAR-sanctioned tracks), and new for 2013, the Whelen Modified Tours (North and South tours will participate in one combined race.\nThe Battle at the Beach was canceled for 2015 due to the Daytona Rising renovation project; the name was reused when UNOH announced its sponsorship of the Myrtle Beach 400 late model stock car race at Myrtle Beach Speedway.\nFormat\nThe formats were similar for the two NASCAR touring races in the Toyota All-Star Showdown, with automatic lock-in slots for winning races and the championship during the 2012 season.  All race winners and series champions in each touring division qualified for their respective division's race.  For the K&N Pro Series, all East and West Series race winners qualified for the feature, along with the respective series champion.  For the Modified division, all Whelen Modified and Whelen Southern Modified Tour race winners qualified for the feature, along with the respective series champions.\nThe Late Model race automatically qualified the national champion in the NASCAR Whelen All-American Series and the other nine drivers in NASCAR's top ten in the Whelen All-American Series standings.\nSeries champions in NASCAR's three international series (Canada, Mexico, Europe) had the option of racing in any of the three races.  They could choose which of the three races to participate and would automatically qualify.\nTime trials and heat races determined the balance of the starting field for the two races.\nWinners\n{| class=\"wikitable\"\n!Year!!K&N Pro Series!!Whelen Modified Tours!!Whelen All-American Series\n|-\n|2013 || Cameron Hayley || Steve Park || Kyle Larson\n|-\n|2014 || Daniel Suárez || Doug Coby || Not held\n|}\nReferences\nExternal links\n*[http://hometracks.nascar.com/NASCAR_Short-Track_Stars_To_Light_Up_Daytona Official announcement of 2013 University of Northwestern Ohio Battle at the Beach]\n*"
    }
  ]
}