{
  "content": [
    {
      "type": "text",
      "text": "# Unterwart\n\n| subdivision_type         = Country\n| subdivision_name         = Austria\n| subdivision_type1        = State\n| subdivision_name1        = Burgenland\n| subdivision_type2        = District\n| subdivision_name2        = Oberwart\n| parts_type               =\n| parts_style              = para\n| p1                       =\n| leader_title             = Mayor\n| leader_name              = Josef Horvath\n| leader_party             =\n| leader_title1            =\n| leader_name1             =\n| area_footnotes           =\n| area_total_km2           =\n| area_metro_km2           =\n| elevation_m              = 306\n| elevation_max_m          =\n| elevation_min_m          =\n| population_as_of         =\n| population_footnotes     =\n| population_total         =\n| population_urban         =\n| population_metro         =\n| population_note          =\n| population_density_km2   = auto\n| established_title        =\n| established_date         =\n| timezone                 = CET\n| timezone_DST             = CEST\n| utc_offset               = +1\n| utc_offset_DST           = +2\n| registration_plate       =\n| postal_code_type         = Postal code\n| postal_code              = 7501\n| area_code_type           = Area code\n| area_code                =\n| website                  = [http://www.unterwart.at www.unterwart.at]\n| footnotes                =\n}}\nUnterwart or Alsóőr (; ; Croatian: Dolnja Borta) is a village in Burgenland, Austria, in the district of Oberwart (Hun: Felsőőr). The village lies on the banks of the Pinka river, and it had a population of 964 in 2001 (without Eisenzicken only 724). Unterwart is one of only two settlements in Austria with an ethnic Hungarian majority. It is part of the Upper Őrség microregion, a small Hungarian language island together with Oberwart and Siget in der Wart (Őrisziget).\nHistory\nThe village was established together with Felsőőr (today Oberwart) in the early Middle Ages. As the name of the villages indicates they were part of the border-zone of the Kingdom of Hungary (gyepű). The population was made up of Hungarian frontier guards (őr), probably related to the Székelys of Transylvania. The guards constituted a free, privileged community. Alsóőr belonged to the old county of Vas until 1921.\nIn 1327 King Charles I of Hungary confirmed the rights of the villagers and ranked them among the nobles. Although later they lost their military significance, the noble őrs kept their privileges and defended them resolutely against the intentions of big landowners. The Hungarian Parliament confirmed their rights several times (1478, 1498, 1547).\nThe society of Alsóőr in the 18-19th centuries was made up of two class, the nobles (nobilis) and the non-nobles (agilis). The lands of village were the property of Community of the Nobles. The agilis only used some parts of it or made their living from handicrafts like boot-making, book-binding, turnering etc. In the middle of the 19th century 47 different crafts were practiced in the village, and the taylors even established their own guilde.\nIn the Age of Reformation the people of Alsóőr converted to Lutheranism but - contrary to the neighbouring Felsőőr - later they returned to the Roman Catholic faith. The village became an independent parish in 1808.\nIn 1921 the village became part of the Republic of Austria after the Treaty of Trianon although the Hungarians of the Felső-Őrség opposed the change. Unterwart remained a poor agricultural community well until the 1970s. In the first part of the 20th century a lot of people emigrated to the United States.\nAfter World War II Unterwart/Alsóőr underwent a thorough modernization and industrialization with the building of roads, civic buildings, sewage canals and the regulation of the Pinka. In the recent past a new club house, fitness centre, doctor's office and two-storey houses were built giving a modern appearance to the village.\nIn 1971 the neighbouring small Austrian village of Eisenzicken was merged into Unterwart.\nPopulation\nSights\n*Roman Catholic Church of Saint Catherine of Alexandria\nAccording to the visitation report of dean István Kazó in 1697 the village of Alsóőr had a little church built of wood with a painted ceiling. In 1769 the Community of Nobles erected the present-day stone church with a tower. It was enlarged in 1833. The main altar is decorated with the wooden statues of St. Stephen, King of Hungary and his son, St. Emericus. The baroque Column of the Virgin Mary was erected in the first half of the 18th century in front of the church.\n* Village Museum (Falumúzeum, Heimathaus)\nThe village museum was established in 1973 by Mayor Ernő Szabó. Two old peasant houses (No. 208 and 209) were bought to accommodate the largest Hungarian ethnographic collection in Burgenland. The two houses with a complete furniture give an interesting insight into the life of the peasants of Alsóőr in the 19-20th centuries. In 1995 the museum was visited by Hungarian President Árpád Göncz and his Austrian colleague, Thomas Klestil.\n* Peasant Houses\nThere are approximately 30 old peasant houses in Unterwart/Alsóőr. They are typical examples of the architecture of the Felső-Őrség with varied porches and stuccoed gables.\nCoat-of-arms\nThe coat-of-arms of Unterwart/Alsóőr (1994) are similar to the arms of Oberwart and refer to the origin of the two villages as Hungarian border-guard communities. The arms depict an old frontier guard (őr) on a silver shield wearing a red uniform and a blue jacket holding up a sword in his raised right hand.\nHungarians\nAlsóőr/Unterwart is one of 2 settlements in Austria with an ethnic Hungarian majority. Today the local primary school (Népiskola, Volksschule) is bilingual (German-Hungarian). The village school was first mentioned in 1697 in the visitation report of Dean István Kazó. The new school building with a kindergarten was built in 1989. There are several Hungarian cultural associations in the village. Magyar teenagers are able to continue their education in the bilingual secondary school of Oberwart/Felsőőr. The Hungarian village library with more than 5000 books was established in 1975 by Reverend Galambos Ferenc Iréneusz teacher, parish priest, librarian and editor. The Hungarian Folk-Song Association was founded in 1919.\nReferences\nExternal links\n*[http://www.unterwart.at village homepage]\n*[http://www.umiz.at cultural institute in Unterwart]"
    }
  ]
}