{
  "content": [
    {
      "type": "text",
      "text": "# Upland, Queensland\n\n| pop                 = 12\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            =\n| area                = 1482.6\n| dist1               = 65.5\n| dir1                = NW\n| location1           = Aramac\n| dist2               = 133\n| dir2                = NNW\n| location2           = Barcaldine\n| dist3               = 239\n| dir3                = NW\n| location3           = Longreach\n| dist4               = 1205\n| dir4                = NW\n| location4           = Brisbane\n| lga                 = Barcaldine Region\n| stategov            = Gregory\n| fedgov              = Maranoa\n| near-n              = Galilee\n| near-ne             = Galilee\n| near-e              = Dunrobin\n| near-se             = Dunrobin\n| near-s              = Pelican Creek\n| near-sw             = Pelican Creek\n| near-w              = Upper Cornish Creek\n| near-nw             = Galilee\n}}\nUpland is a former rural locality in the Barcaldine Region, Queensland, Australia. In the , Upland had a population of 12 people.\nOn 22 November 2019 the Queensland Government decided to amalgamate the localities in the Barcaldine Region, resulting in five expanded localities based on the larger towns: Alpha, Aramac, Barcaldine, Jericho and Muttaburra. Upland was incorporated into Aramac.\nGeography\nUpland is within the Desert Uplands area of Central West Queensland. In the centre of the locality is Lake Dunn, a small freshwater lake. The principal land use is cattle grazing.\nThe locality is bounded to the north-west by Lake Galilee, a large salt lake.\nEducation\nThere are no schools in Upland. The nearest school is in Aramac which offers prep to Year 10 education. There is no Year 11 and 12 education available near Upland, except via distance education.\nAttractions\nThere are cabin and camping facilities at Lake Dunn. Popular activities are bird watching, fishing, swimming, water skiing, windsurfing, sailing and picnicking.\nThere is a sculpture trail alongside the road from Aramac to Lake Dunn and Rangers Valley. There are over 30 sculptures by local artist Milynda Roberts of animals and outback living.\nReferences"
    }
  ]
}