{
  "content": [
    {
      "type": "text",
      "text": "# Upper Delaware Scenic and Recreational River\n\n| area = -only about  are federally owned\n| established = 1978 added to Wild and Scenic Rivers System\n| visitation_num = 251,083\n| visitation_year = 2005\n| governing_body = National Park Service\n| website = [https://www.nps.gov/upde/index.htm Upper Delaware Scenic and Recreational River]\n}}\nThe Upper Delaware Scenic and Recreational River is a unit of the National Park Service designated under the National Wild and Scenic Rivers System. It stretches along  of the Delaware River between Hancock, New York, and Sparrowbush, New York. It includes parts of Delaware County, Orange County, and Sullivan County in New York, as well as Pike County and Wayne County in Pennsylvania. Most of the land in this unit is privately owned; the federal government only owns about .\nThe site includes and protects Roebling's Delaware Aqueduct and the Zane Grey Museum. Within the park are the remains of the Delaware and Hudson Canal. This canal operated from 1828 to 1898 carrying anthracite coal and other regional products to the Hudson River where the products were shipped to various markets including New York City.  The Delaware and Hudson Canal Company is considered one of the first private million dollar companies in the United States.  Some of the remains of the canal are a National Historic Landmark.\nLand Protection\nMore than 14,000 acres within the watershed of the Upper Delaware Scenic and Recreational River are protected by conservation easements enacted by willing private property owners and held by the Delaware Highlands Conservancy land trust, which was founded by Barbara Yeaman in 1994.\nActivities\n*Recreation on the Delaware River – The shoreline of the river is mostly privately owned, but the waterway is open to public use, from numerous public access sites.  Recreational opportunities include boating, fishing, and wildlife watching.  While swimming is available, the river is swift and the rocks are slippery making it dangerous.\n*Delaware and Hudson Canal – Between 1825 and 1829, the Delaware and Hudson Canal was a  water route from the anthracite coal mines of Pennsylvania to the markets on the Hudson River. The U.S. Department of the Interior has designated the Delaware and Hudson Canal a National Historic Landmark and an NHL bronze plaque has been placed on the aqueduct.\n*Roebling's Delaware Aqueduct -  Believed to be the oldest suspension bridge in the United States, retaining its original elements.\n*Zane Grey Museum – Zane Grey (1872–1939) moved to Lackawaxen in 1905.  From his home on the Upper Delaware, Zane began his writing career, becoming known as the “Father of the Western Novel”.\n*Bird Watching – The Upper Delaware is a good location for Eagle watching.  The clean running water provides food and the tall trees along the shoreline, offer perching and nesting sites.  The river way is the largest wintering site of Bald Eagles in the northeast. East of Pond Eddy a wheelchair accessible bird blind, Eagle Observation Area, along New York 97.\n*Hawk’s Nest - The Hawk's Nest is a scenic location outside Port Jervis, New York, high above the Delaware River on New York State Route 97. Its name is derived from the birds of prey that nest in the area. The location is also known for its winding roads and scenic overlooks in the Delaware River Valley.\nSee also\n* Middle Delaware National Scenic River\n* Lower Delaware National Wild and Scenic River\nReferences\nExternal links\n* [https://www.nps.gov/upde/index.htm National Park Service: Upper Delaware Scenic & Recreational River]"
    }
  ]
}