{
  "content": [
    {
      "type": "text",
      "text": "# Upper Caboolture, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 5087\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4510\n| area                = 12.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 5.9\n| dir1                = SW\n| location1           = Caboolture\n| dist2               = 47.5\n| dir2                = N\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Moreton Bay\n| stategov            = Glass House\n| stategov2           = Morayfield\n| fedgov              = Longman\n| near-n              = Lilywood\n| near-ne             = Bellmere\n| near-e              = Morayfield\n| near-se             = Morayfield\n| near-s              = Morayfield\n| near-sw             = Moorina\n| near-w              = GreenstoneRocksberg\n| near-nw             = Wagtail Grove\n}}\nUpper Caboolture is a rural locality in the City of Moreton Bay, Queensland, Australia. Formerly a rural area on the fringe of the town of Caboolture, since the 1990s the suburb has become increasingly urbanised.\nIn the , Upper Caboolture had a population of 5,087 people.\nIn April 2023, the Queensland Government decided to reflect the growing population of the region by creating five new localities named Corymbia, Greenstone, Lilywood, Wagtail Grove, and Waraba by excising parts of the existing localities of Bellmere, Rocksberg, Upper Caboolture, and Wamuran. Prior to land redistribution, parts of Lilywood and Wagtail Grove were part of Upper Caboolture.\nGeography\nPart of the northern boundary of the suburb is marked by the Caboolture River.\nThe proposed Bruce Highway Western Alternative will pass through Upper Caboolture from south to north.\nHistory\nCamp Flat Provisional School opened on 28 January 1878 with 22 girls and 29 boys enrolled. The school was on Caboolture River Road, approx ). On 19 January 1880 it became Camp Flat State School. It was renamed Caboolture Upper State School in 1916 and closed in 1918.\nFormerly a rural area on the fringe of the town of Caboolture, since the 1990s the suburb has become increasingly urbanised.\nIn April 2023, the Queensland Government decided to reflect the growing population of the region by creating five new localities named Corymbia, Greenstone, Lilywood, Wagtail Grove, and Waraba by excising parts of the existing localities of Bellmere, Rocksberg, Upper Caboolture, and Wamuran. Upper Caboolture lost land to Lilywood and Wagtail Grove.\nDemographics\nIn the , Upper Caboolture recorded a population of 3,752 people, 51.7% female and 48.3% male.  The median age of the Upper Caboolture population was 34 years, 3 years below the national median of 37.  80.1% of people living in Upper Caboolture were born in Australia. The other top responses for country of birth were England 4.3%, New Zealand 4.1%, Philippines 0.7%, Scotland 0.6%, Papua New Guinea 0.5%.  92.3% of people spoke only English at home; the next most common languages were 0.5% Tagalog, 0.3% Hindi, 0.2% Dutch, 0.2% Spanish, 0.2% Tok Pisin (Neomelanesian).\nIn the , Upper Caboolture had a population of 4214 people.\nIn the , Upper Caboolture had a population of 5,087 people.\nEducation\nThere are no schools in Upper Caboolture. The nearest government primary school is Minimbah State School in neighbouring Morayfield. The nearest government secondary school is Morayfield State High School, also in Morayfield.\nReferences\nExternal links\n*"
    }
  ]
}