{
  "content": [
    {
      "type": "text",
      "text": "# Upware\n\n| post_town=             Ely\n| postcode_area=         CB\n| postcode_district=     CB7\n| dial_code=             01223\n| shire_county=          Cambridgeshire\n|shire_district=          East Cambridgeshire\n|population=\n|hide_services=\n|static_image=\n|static_image_caption=\n}}\nUpware is a village in Wicken  civil parish, part of East Cambridgeshire, England, lying on the east bank of the River Cam.\nHistory\nSituated in the isolated south-west corner of the parish of Wicken, the hamlet of Upware is believed to have existed, and indeed been known by its present name, since at least the 10th century. Its situation on a navigable stretch of the River Cam would have been essential to its survival, and its name probably derives from a fishing weir on the river at the time. It was recorded as inhabited in both the 13th and 15th centuries, and there were 10 houses in the 19th and early 20th centuries.\nAnalysis of an earthwork near the river found a brick base surrounded by a 40-foot moat and linked to a former wharf on the Cam. It is believed to be a Civil War fortification from the 1640s.\nA chain ferry that carried people across the river at Upware was still in use in 1910.\nVillage life\nUpware had its own public house to serve river traffic by the 1760s. Originally named the Black Swan, it became the Lord Nelson in 1806, and from around 1850 was popularly known as the \"Five Miles from Anywhere: No Hurry\". The white thatched building was rebuilt in 1811, but closed by the 1950s and demolished following a fire of 1955/6. The present building dates from around 1980 and opened again as a pub in 1995 as the Five Miles from Anywhere Inn, largely serving passing leisure boats.\nIn the 1850s the pub was the meeting place of the Upware Republic, a society of up to 300 undergraduates of the University of Cambridge, who would meet to fish, boat, shoot and skate. In the 1860s the pub was the residence of R. R. Fielder, known as the \"King of Upware\", who occupied himself with drinking and fighting boatworkers.\nUpware has a branch of the Cambridgeshire Environmental Education Service housed in the former primary school.\nThe hamlet is served by the church in Wicken. Services were formerly held in Upware in a wooden mission hall, built in 1883.\nReferences"
    }
  ]
}