{
  "content": [
    {
      "type": "text",
      "text": "# Upward Sports\n\nUpward Sports is a non-profit 501(c)(3) organization with the mission of \"promoting the discovery of Jesus through sports\". Upward Sports partners with churches in the US and Canada to bring youth sports ministry in their local communities. Upwards Sports was founded in 1995 by Caz McCaslin.\nStructure\nOver 2,800 Upward Sports programs across the US serve hundreds of thousands of young athletes playing recreational basketball, baseball, softball, soccer, cheerleading, flag football, pickleball, and volleyball. Upward Sports equips local churches representing various evangelical denominations with training, playbooks, sports apparel, ministry resources, and online player registration systems to run their leagues.\nThe main Upward offices are in Spartanburg, South Carolina.\nHistory\nTimeline\n1986 – Caz McCaslin developed a basketball program that incorporated athletic skills and Biblical values\n1995 – Launched first nationwide season of Upward Sports; seven churches hosted Upward basketball leagues with several hundred players\n2000 – Expanded to include soccer and basketball cheerleading\n2003 – The 1,000th church hosted an Upward Sports League\n2005 – Added flag football and flag football cheerleading. Launched first Upward Sports international league in Cape Town, South Africa\n2006 – More than 400,000 children participated in Upward Sports for the first time. Launched the first Upward Sports League in Canada\n2007 – International expansion continued as a league launched in Ukraine\n2007 – Military scholarship instituted for children of military men and women deployed overseas\n2008 – First South American league launched in Brazil\n2009 – Approximately 2,600 churches worldwide host Upward Sports leagues with 520,000 children and 480,000 volunteers, coaches and referees in 46 states and four countries (Brazil, Canada, South Africa, Ukraine)\n2015 - LeBron James endorses the organization via Instagram\n2020 - Kevin Drake named Executive Director of Upward Sports\n2021 - Expanded to include volleyball\n2025 - Expanded to include pickleball\nSee also\n*Athletes in Action\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* [http://savannahnow.com/west-chatham/2010-03-03/upward-basketball-and-cheerleading-every-child-winner Savannah Morning News] - At Upward Basketball and Cheerleading every child is a winner\n* [http://www.lancastereaglegazette.com/article/20100925/LIFESTYLE/9250311/Upward-and-onward-Christian-based-sports-program-promotes-positive-reinforcement Lancaster Eagle Gazette] - Upward and onward: Christian-based sports program promotes positive reinforcement\n* [http://www.charlotteobserver.com/848/story/1141705.html Cabarrus News] - Christian League Leads Kids Upward\nExternal links\n*"
    }
  ]
}