{
  "content": [
    {
      "type": "text",
      "text": "# Ürümqi Revolutionary Martyrs Cemetery__disambig_1\n\nThe Ürümqi Revolutionary Martyrs Cemetery (, ), alternatively referred to as the Martyrs' Mausoleum of Yan'erwu (), serves as a commemorative garden for martyrs situated in the Tianshan District, Urumqi City within the Xinjiang Uyghur Autonomous Region, People's Republic of China. The memorial commemorates martyrs including Chen Tanqiu, Mao Zemin, Lin Jilu, and Burhan Shahidi, who were former Red Army soldiers and officials, as well as those who perished during the Three Regions Revolution and in the Sino-Indian and Sino-Vietnamese Self-Defense Counterattacks. The Urumqi Revolutionary Martyrs' Mausoleum has been designated as the Xinjiang Uygur Autonomous Region Cultural Relics Protection Unit, the National Patriotism Education Demonstration Base, and included in the National Anti-War Memorial Facilities and Sites List.\nGeography\nThe Ürümqi Revolutionary Martyrs Cemetery is situated at 54 Yan'erwu Road, Tianshan District. The location was selected in Yan'erwu, bordered by Yan'er Cliff to the east and the Urumqi River to the west. North of the mausoleum lies the Urumqi Funeral Hall, southward is the planning brigade of the Xinjiang Uygur Autonomous Region Department of Animal Husbandry, to the southeast is the Urumqi Waterworks, and to the west is the Urumqi Riverbank Expressway. The Martyrs' Mausoleum encompasses more than 850 acres. The tomb is adorned with thousands of trees, including peach, pine, and cypress trees, among others.\nHistory\nFollowing the Coup d'état of 12 April, Sheng Shicai commenced his governance of Xinjiang Province. During the initial years of his governance, he embraced an \"anti-imperialist and pro-Soviet\" stance, during which members of the Chinese Communist Party (CCP), including Chen Tanqiu, Mao Zemin, and Lin Jilu, journeyed to Xinjiang to execute their tasks. In 1942, Sheng Shicai progressively adopted an anti-Soviet and anti-Communist stance due to the cessation of aid from the Soviet Union to China, among other factors. In September 1942, Sheng besieged the CCP in Xinjiang, confining over 100 party members and their families. On February 27, 1943, they were apprehended, and in September 1943, Chen Tanqiu, Mao Zemin, Lin Jilu, and Du Chongyuan were clandestinely executed near Liudawan in Dihua (now Urumqi), while the remaining individuals were liberated in June 1946.\nFollowing the incorporation of Xinjiang into the People's Republic of China, the CCP Xinjiang Provincial Committee and the Xinjiang Provincial People's Government convened the inaugural session of the first Xinjiang Provincial People's Congress in 1954. In 1955, the Xinjiang Branch of the CCP Central Committee sanctioned the formation of the Committee for the Removal of Chen Tanqiu and other Martyrs, and the building of the Revolutionary Martyrs' Mausoleum in Urumqi commenced formally. The construction of the Martyrs' Mausoleum commenced in June 1956. On the 25th, the Committee for the Removal of Martyrs' Remains commenced the search for the remains of martyrs in the Liudawan area, subsequently exhuming Chen Tanqiu in early July. Mao Zemin, Lin Jilu, Qiao Guozhen, and Wu Maolin were interred at the Urumqi Revolutionary Martyrs Mausoleum on July 25. Upon the mausoleum's completion, prominent figures, including Zhu De, Chen Yi, He Long, Deng Yingchao, Burhan Shahidi, Wang Enmao, Xi Zhongxun, Jiang Zemin, Yu Zhengsheng, among others, visited the mausoleum of the revolution's martyrs in Urumqi City.\nIn 1965, to commemorate the 10th anniversary of the establishment of the Xinjiang Uygur Autonomous Region, the Urumqi Revolutionary Martyrs' Mausoleum added amenities including a rest room and a pavilion, and established a belt of fruit trees. Following the commencement of the Cultural Revolution, the gravestones of Qiao Guozhen and Wu Maolin were obliterated due to unfounded allegations against them. In 1974, Dong Biwu, then vice president and acting president of China, engraved the name of the Urumqi Revolutionary Martyrs' Mausoleum. The subsequent year, the Urumqi Revolutionary Martyrs' Cemetery was renovated. Subsequent to the Third Plenary Session of the Eleventh Central Committee of the Communist Party, the CCP Committee of the Xinjiang Uygur Autonomous Region reinstated the honor of Qiao Guozhen and Wu Maolin, and reconstructed the mausoleums of the two martyrs in 1980. The administration of the Urumqi Revolutionary Martyrs' Mausoleum was properly aligned. Post-1980s, structures such as the Chen Pavilion, the statue of Chen Tanqiu, and an urn room were constructed. Following 2010, the Urumqi Revolutionary Martyrs Cemetery experienced significant development, with the State Council of China, the People's Government of the Xinjiang Uygur Autonomous Region, and the People's Government of the Municipality of Urumqi collectively investing nearly 100 million yuan in a new exhibition hall, the Xinjiang Public Security Museum, the Xinjiang Public Security Police Museum, and an additional memorial hall.\nIn 1962, it was designated as part of the second cohort of Xinjiang Uygur Autonomous Region Cultural Relics Protection Units, and in October 1986, it was recognized as one of the National Key Martyrs' Memorial Buildings Protection Units. In June 1997, the Urumqi Revolutionary Martyrs' Mausoleum was designated as a National Patriotism Education Demonstration Base, and in December 2011, it was recognized as a national AAA-level tourist attraction. In August 2015, the Urumqi Revolutionary Martyrs Mausoleum was included in the second cohort of the . In 2021, the Martyrs' Mausoleum was included in the initial cohort of the .\nReferences"
    }
  ]
}