{
  "content": [
    {
      "type": "text",
      "text": "# Us and Them − Cold War\n\n| genre      = Turn-based strategy\n| modes      = Single-player\n| platforms  =\n}}\nUs and Them - Cold War is a turn-based strategy video game developed and published by Greek game developer Icehole Games in 2010. The game is set during the Cold War period, where players control either the American CIA or the Soviet KGB organization, and attempt to achieve territorial, ideological and influence expansion for their side, while simultaneously trying to destabilize the opposition by orchestrating espionage activities around the world.\nGameplay\nThe player can select between two campaigns, either the Communist campaign, where the player takes control of the Soviet KGB, or the Capitalist campaign, in which the player takes command of the American CIA. Each campaign starts at January 1, 1960, and the player's goal is to develop networks of spies and special agents to the various countries around the world and, through various acts of subterfuge, sway their governments to the chosen superpower's particular political ideology.\nApart from managing their network of spies and agents, players are also tasked with managing a variety of resources to gain prestige points. These resources include space program achievements, nuclear arms development, technology and spy gadget research, money and energy. Further, players may deploy a series of special strategies based on real-life concepts from the Cold War, such as Domino theory, the Iron Curtain and the “Communist sandwich”, while random, in-game events based on actual Cold War events will occur, and require the player's response.\nEach campaign features a number of heroes, each one corresponding to a prominent figure in the years of the Cold War, allowing players to use their influence towards swaying governments to their side. The Communist campaign begins with the player gaining access to Ernesto “Che” Guevara, Mao Ze Dong and Fidel Castro, while the Capitalist campaign starts with J. Edgar Hoover, Henry Kissinger and the Pope. Additional heroes are introduced for each side as the game progresses.\nRelease\nUs and Them was released in digital form by Icehole on March 17, 2010, with a limited physical release being planned for Greece, Cyprus, Bulgaria and Romania by Audio Visual Enterprises. Icehole made a five hour limited demo available for players to try out the game prior to its purchase. A free expansion pack titled “Heroes Bonanza” was made available by Icehole in November 2010, adding several new heroes to the game.\nIn 2011, the game was made available on Avanquest's GSP Click & Play label, while a German version was distributed by United Independent Entertainment GmbH in 2013.\nReferences\nExternal links\n*[http://www.iceholegames.com/usandthem.com/index.html Official website]\n*"
    }
  ]
}