{
  "content": [
    {
      "type": "text",
      "text": "# USAT Warren\n\n{|\n|Ship name=*Scandia (1889-1899)\n*Warren (1899—1922)\n*Unknown (1922—1924)\n|Ship namesake=\n|Ship owner=*Hamburg America Line (1889-1898)\n*United States Army (Quartermaster Department) (1898—1922)\n*Le Seug Giap and Company (1922—1924)\n|Ship operator=\n|Ship registry=\n|Ship route=\n|Ship ordered=\n|Ship awarded=\n|Ship builder=*AG Vulcan Stettin\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=\n|Ship launched=24 August 1889 as Scandia\n|Ship sponsor=\n|Ship christened=\n|Ship completed=\n|Ship acquired=by U.S.A.QM: 5 July 1898\n|Ship commissioned=\n|Ship recommissioned=\n|Ship struck=\n|Ship decommissioned=\n|Ship maiden voyage=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=*Warren (1912)\n*Signal: GWCD\n*Radio call: ATW\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship honors=\n|Ship captured=\n|Ship fate=Destroyed by fire at dock in 1924 and was scrapped.\n|Ship notes=\n|Ship badge=\n}}\n|Ship class=\n|Ship type=\n|Ship tonnage=*Liner:\n*Army: ,\n|Ship displacement=Army 4,243 tons\n|Ship length= *registry\n|Ship beam=\n|Ship height=\n|Ship draught=\n|Ship draft=*Army\n|Ship depth=\n|Ship hold depth=\n|Ship decks=\n|Ship deck clearance=\n|Ship ramps=\n|Ship ice class=\n|Ship power=\n|Ship propulsion=Triple expansion steam engine\n|Ship sail plan=\n|Ship speed= * mean trials\n*Army 11 knots\n|Ship range=\n|Ship endurance=\n|Ship test depth=\n|Ship boats=\n|Ship capacity=\n|Ship troops=\n|Ship complement=148\n|Ship crew=\n|Ship time to activate=\n|Ship sensors=\n|Ship EW=\n|Ship armament=\n|Ship armour=\n|Ship armor=\n|Ship aircraft=\n|Ship aircraft facilities=\n|Ship notes=Major overhaul fiscal year 1916.\n}}\n|}\n'USAT Warren was the former Hamburg America Line liner Scandia, laid down as the Scandiinavia' at AG Vulcan Stettin, launched on 24th Aug 1889. The liner was purchased by the U.S. Army Quartermaster Department 5 July 1898.  In March 1899 Scandia was renamed Warren for Maj. Gen. Gouverneur K. Warren. Serving the Army Transport Service as United States Army Transport (USAT) Warren the ship was assigned to the Philippine Inter-Island Service based in Manila as one of the interisland transports. Along with routine voyages transporting troops and supplies among the islands the ship made routine trips to China with the Chinese port of Chingwangtao a routine part of service. Warren underwent major overhaul and was \"practically reconstructed\" during fiscal year 1916 (1 July 1915—30 June 1916) including boiler replacement.\nIn 1912 ''Warren's signal was GWCD with radio call letters ATW.\nScandia\nOn 28 August 1892 the Scandia left Hamburg with a crew of 77 and 1009 passengers that included 981 steerage and 28 in cabins. The ship arrived in New York on 10 September 1892 with reports that thirty-two had died at sea. There were seven sick passengers that were removed and taken to Swinburne Island where two of those died. The ship was among ten that were quarantined during the 5th Cholera outbreak that included the SS Moravia SS Wyoming, SS Normannia (2), SS Rugia (1), and the SS Stubbenhuk\nUSAT Warren\nService history\nOn 17 July 1899 troops from Colorado boarded the transport in Manila for return to the United States as a typhoon was building in the South China Sea forcing overnight suspension of boarding. On the 18th boarding was completed and the ship sailed, and with a period taking shelter in the lee of Formosa, reached Nagasaki 25 July 1899. After coaling the ship sailed on 27 July reaching Yokohama on 30 July and departing on 2 August to reach San Francisco on 16 August. The ship docked the next day after clearing quarantine.\nOn 30 December 1900 Warren while getting underway at Manila for a voyage to the United States ran into the British ship Mogul. Warren was found to be at fault with the first assistant engineer, in charge, turning control over to the second assistant engineer who did not follow engine orders. Both engineers were dismissed from the transport service. Claims were disputed in particulars but referred to Congress for final payment.\nIn the summer of 1902 the ship transported Dr. Sheldon Jackson from Seattle to Nome in connection with his work with introducing reindeer into Alaska. Forty-three Filipino political prisoners had been deported to Guam by General Arthur MacArthur Jr. for their loyalty to the Philippine Revolution during the Philippine–American War. On 21 September 1902 Warren embarked most of the political prisoners exiled to Guam for return to the Philippines.\nWarren, on the way from Manila to San Francisco, entered Honolulu on 10 July 1905 with a missing propeller blade. Honolulu was the normal coaling stop and the ship had entered the port four years earlier with two missing blades. In that case the ship had left Honolulu for Manila and returned after several days for repairs. Those were done by piling coal and pig iron on the forward decks and removing heavy material from aft so that the stern was raised out of the water enough for the repairs. The same was planned in this case, though the ship might be able to make San Francisco at reduced speed without the repair.\nDuring August 1914 the Insular Government of the Philippine Islands dealt with stabilizing the market for staple goods in a crisis related to shipping at the start of war with Germany. With regard to rice the government obtained the cooperation of the Army command in using Warren to transport rice from Indo-China for government sale to dealers.\nThe general commanding U.S. Army forces in the Philippines was directed on 3 August 1918 to send the 27th and 31st Infantry Regiments, a field hospital, ambulance company and a telegraph company to Vladivostok with Warren,  and Merritt designated as transports. Elements of the 27th Infantry Regiment were embarked aboard Warren sailing 7 August 1918 arriving 15 August. Other trips involved transport of ambulance and field hospital elements in September. In 1920 Warren made voyages to Vladivostok to evacuate elements of the Czech Legion disembarking them at Trieste, Italy.\nOn 28 December 1922, at Manila, the ship was sold to the Le Seug Giap and Company.\nSinking\nIn May 1924 Warren sank for unknown reasons on the Huangpu River in the harbor of Shanghai, next to the pier, and was finally scrapped in 1929.\nFootnotes\nReferences\nExternal links\n*[http://www.norwayheritage.com/p_ship.asp?sh=skad1 S/S Scandia, Hamburg America Line]\n*[https://localhistory.boulderlibrary.org/islandora/object/islandora%253A33034 Photos, Spanish American War: U.S. army transport ship Warren, Carnegie Library for Local History]\n*[https://www.loc.gov/item/2018647389/ The United States Army transport \"Warren\" coaling at Honolulu, Hawaiian Islands (ca. 1902)]\n*[https://calisphere.org/item/ark:/13030/kt2m3nc03p/ The U.S. Army Transport \"Warren\" at Dock. Honolulu, Hawaii]"
    }
  ]
}