{
  "content": [
    {
      "type": "text",
      "text": "# Usatove culture\n\nThe Usatove culture (Usatove in Ukrainian, Usatovo in Russian) is an Eneolithic group of the northwest and west Pontic region (ca. 3650-2740 BCE), with influences from the Cucuteni–Trypillia culture as well as the Eneolithic steppe cultures of the North Pontic. Usatove culture flourished west and northwest of the Black Sea in eastern Romania, Moldova and southern Ukraine, in more than 50 sites.\nThe culture got its name from the village of Usatove in the Odesa Oblast of Ukraine.\nThe Usatove culture appears to be a mixture of the Eneolithic agrarian cultures of Southeast Europe, with influences from the steppe cultures from the Pontic–Caspian steppe. The Eneolithic farming culture influences on Usatove include clay figurines and painted ceramics, while it shares tumulus (kurgan) burials and shell-tempered coarse wares with steppe cultures. It also displays items made of metal, such as arsenical bronze and silver, which suggests contacts with the North Caucasus as well as Anatolia.\nIn Ukraine, Usatove culture sites are predominantly located in the Dniester-Danube interfluve. The two largest Usatove archaeological sites in Ukraine, Usatove-Velykyj Kuyalnik and Mayaky, contain kurgan and ground cemeteries (necropoli).\nWithin the Kurgan hypothesis, the Usatove culture represents the domination of native Cucuteni–Trypillia agriculturalists by Indo-European peoples from the steppe. According to Anthony, the roots of the pre-Germanic languages lay in the Usatove culture.\nWhile the generally accepted chronological placement of Usatove is in the second half of the 4th millennium BCE, radiocarbon dates on human remains identified as Usatove are consistently older. Most of these dates cluster around the last quarter of the 5th - first quarter of the 4th millennium BCE. It is likely that the dates on human remains are influenced by aquatic reservoir effect, the precise quantification of which is not possible at the moment due the lack of radiocarbon and stable isotope data from contextual faunal remains.\nChronology\nRadiocarbon dates on pottery are between 3400 and 2900 BCE, around 600 years later than analyses in human bones, which indicate Usatove culture would have lasted (c. 4000-3500 BCE).\nGallery\nFile:Usatove artefacts 1.png|Metal, bone and ceramic artefacts\nFile:Hoard with copper axe and five swords or long daggers from Ivan'ky, Mankivka District, Ukraine.png|Arsenical bronze swords and copper axe, Ukraine\nFile:Usatove ceramic and copper artefacts.png|Ceramic and metal artefacts\nFile:Usatove culture ceramic vessels, metal artefacts and burial.png|Ceramic vessels, metal tools and burial\nFile:Usatove culture metal, bone and ceramic artefacts.png|Metal, bone and ceramic artefacts\nFile:Usatove culture ceramaic figurines and metal dagger.png|Ceramic figurines and metal dagger\nFile:Usatove burial mounds with stone constructions.png|Burial mounds with stone constructions\nFile:Nevsha tombstone miii 1 archmus varna.jpg|Nevsha stele, c. 3000 BC\nFile:Coțofeni culture stelae Odessa.jpg|Stele, 3500-3000 BC\nLong distance trade\nA number of Usatove artifacts come from rather remote territories, most likely testifying in favor of a multi-stage exchange. In the kurgan near the village of Sadove, on the western bank of the Dniester Estuary, beads made of white faience, jet, Mediterranean horn corals (gorgonians) and an amulet pendant made of typical Egyptian \"alabaster\" were identified. Bone labrysoid beads from the same burial mound come from the area of the post-Mariupol culture. It is difficult to judge where the bead of red amber known in Usatove came from. Glass beads found in the second burial mound of the Usatove-Velykyi Kuialnyk archaeological complex (along with finds in the Sofievsky burial mound near Kyiv and beads from a hoard near the village of Ketroshika in Moldova, in the Middle Dniester region) are the oldest glass known in the Old World. They were likely made in the Circum-Pontic area (indicated by the presence of arsenic in the glass). These are believed to be of local origin - as a product associated with bronze metallurgy, and imported - from Anatolia or South Transcaucasia.\nGenetics\nHaplogroups\nAccording to genetic studies, males of the Usatove culture carried such Y haplogroups as E1b1b1a1, J1 (J-FT265222), R1a, and R1b1a2a2. Mitochondrial DNA lineages of Usatove are represented by H5, I5, U4, U4b1b2, U4d3, U5a1a1, U5a1f1, T2h2, W1, X2, and X2d.\nWhole genome analysis\nRecent studies indicate that Usatove ancestry consists of equal parts of the ancestry of the Lower Volga-Caucasus (CLV, PVgroup) and Trypillia.\n( EHG), Caucasian Hunter-Gatherer ( CHG), Anatolian Neolithic () and Western Hunter Gatherer ( WHG)]]\nSee also\n* Suvorovo culture\n* Novodanilovka group\nReferences\nSources\n*\n*\n* Manzura, Igor'; Petrenko, Vladislav (2022). [https://ibn.idsi.md/sites/default/files/imag_file/4_Manzura_Petrenko_compressed.pdf Cemetery II of Usatovsky (based on 1984 excavations).] Tyragetia, s.n., vol. XVI [XXXI], nr. 1, 2022, pp. 83-101, (in Russian).\n*\n*\n*\n*\n* Patokova, E.F. (1979) Усатовское поселение и могильники. Киев: Наукова Думка.\n* Petrenko, VG; Káiser, E. (2011). Комплексный памятник Маяки: новые изотопные даты и некоторые вопросы хронологии наличных культур. Материалы по археологии Северного Причерноморья 12, 31-61.\nExternal links\n*[https://www.nature.com/articles/s41586-023-06334-8/figures/4 Photos of Usatove culture metal and ceramic artefacts]\n*[https://www.researchgate.net/publication/365805692_Long-distance_exchanges_along_the_Black_Sea_coast_in_the_Eneolithic_and_the_steppe_genetic_ancestry_problem Long-distance exchanges along the Black Sea coast in the Eneolithic and the steppe genetic ancestry problem (2022)]"
    }
  ]
}