{
  "content": [
    {
      "type": "text",
      "text": "# USCGC Yamacraw (WARC-333)\n\n{|\n|Ship name=Maj. Gen. Arthur Murray\n|Ship namesake=Major General Arthur Murray, first Chief of the Coast Artillery Corps\n|Ship ordered=\n|Ship builder=Marietta Manufacturing Company, Point Pleasant, West Virginia\n|Ship laid down= 1941 as USAMP Maj. Gen. Arthur Murray for the U.S. Army\n|Ship launched= 1942\n|Ship acquired=\n|Ship commissioned=\n|Ship decommissioned=\n|Ship in service=1942\n|Ship out of service=2 January 1945\n|Ship struck=\n|Ship reinstated=\n|Ship renamed=\n|Ship reclassified=\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate=Transfer to Navy\n}}\n|Ship name=Trapper\n|Ship namesake=\n|Ship ordered=\n|Ship builder=\n|Ship laid down=\n|Ship launched=\n|Ship acquired= 2 January 1945\n|Ship commissioned=15 March 1945\n|Ship decommissioned= 20 June 1946\n|Ship in service=\n|Ship out of service=\n|Ship struck= 19 July 1946\n|Ship reinstated=\n|Ship renamed=\n|Ship reclassified=\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate= Transferred to the Coast Guard, 20 June 1946\n|Ship notes=\n}}\n|Ship name=Yamacraw\n|Ship namesake=Native American tribe that settled near Savannah, Georgia\n|Ship acquired= 20 June 1946\n|Ship commissioned=\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship struck=\n|Ship reinstated=\n|Ship renamed=\n|Ship reclassified=\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate= Transferred to the US Navy, 17 April 1959\n|Ship notes=\n}}\n|Ship name=Yamacraw\n|Ship acquired= 17 April 1959\n|Ship commissioned= 30 April 1959\n|Ship decommissioned= 2 July 1965\n|Ship in service=\n|Ship out of service=\n|Ship struck= 2 July 1965\n|Ship reinstated=\n|Ship renamed=\n|Ship reclassified=\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate=Sold for scrap 18 October 1967, withdrawn for scrapping 2 November 1967\n|Ship notes=\n}}\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship draft=\n|Ship hold depth=\n|Ship propulsion=\n|Ship speed=\n|Ship range=\n|Ship complement=69\n|Ship armament=1 × 40 mm gun\n|Ship armor=\n|Ship notes=\n}}\n|}\n'USCGC Yamacraw (WARC-333) was a United States Coast Guard Cable Repair Ship. The ship was built for the Army Mine Planter Service as U. S. Army Mine Planter Maj. Gen. Arthur Murray (MP-9) delivered December 1942. On 2 January 1945 the ship was acquired by the Navy, converted to an Auxiliary Minelayer and commissioned USS Trapper (ACM-9)' on 15 March 1945. Trapper was headed to the Pacific when Japan surrendered. After work in Japanese waters the ship headed for San Francisco arriving there 2 May 1946 for transfer to the Coast Guard.\nOn 20 June 1946 the ship was renamed Yamacraw with the number WARC-333 serving as a cable ship with the Coast Guard with a loan to the Woods Hole Oceanographic Institution 1957-1958 before re acquisition by the Navy 17 April 1959. The Navy retained the name commissioning Yamacraw on 30 April 1959 with the designation of cable repair ship ARC-5. The ship supported acoustical, geophysical and other oceanographic projects of the Office of Naval Research and for the Bell Telephone Laboratories. Yamacraw was decommissioned 2 July 1965 and transferred to the Maritime Administration for disposal the same day. The ship was purchased by North American Smelting for scrap.\nMaj. Gen. Arthur Murray (1942–1945)\nU.S. Army Mine Planter (USAMP) Maj. Gen. Arthur Murray (MP-9), keel laid in 1941 as hull 482, was launched in 1942 by the Marietta Manufacturing Company at Point Pleasant, West Virginia. The ship was assigned to the United States Army Coast Artillery Corps planting and tending controlled mine fields connected by cable to the coastal forts. The ship was named for Major General Arthur Murray, USA, (1 July 1908 – 14 March 1911) who was the first Chief of the Coast Artillery Corps.\nThe M 1 Mine Planter was designed by the Marine Design and Construction Division of the Office of the U.S. Army Quartermaster General. Its specifications were  length overall,  beam, with a mean draft of . The pilot house was sized to allow large decks fore and aft for mine storage. Propulsion was two 600 h.p. Skinner Uniflow Marine Engines fed by two water tube boilers and driving twin screws. A removable, vertical, steam operated reel capable of carrying fifty tons of mine control cable was located on the forecastle. Two full mine groups could be carried on deck with room in the main hold for another full group if necessary.\nBy 1944 the threat of attack on the U.S. coast had faded and the Coast Artillery began releasing mine planters for other uses.\nUSS Trapper (1945–1946)\nOn 2 January 1945 the mine planter was acquired by the Navy and converted into a Chimo class auxiliary minelayer by the Charleston Navy Yard, Charleston, South Carolina. The ship was commissioned USS Trapper, designated ACM-9, on 5 March 1945, with Lt. Richard E. Lewis, USNR, in command.\nTrapper began shakedown training in the Chesapeake Bay during April and got underway the Pacific Ocean war zone for on 11 June 1945. The ship proceeded to Manzanillo, Cuba then through the Panama Canal to San Diego. In mid-August Japan capitulated while the ship was en route to Hawaii. Trapper arrived at Pearl Harbor on 21 August and was routed westward, via Eniwetok, Saipan, and Okinawa, to Japan.\nTrapper arrived at Kobe on 25 November 1945 and operated out of that port repairing minesweeping gear until 1 February 1946 when she shifted her base of operations to Wakayama for a month. On 11 March, the ship got underway for the United States. En route, she called at Saipan, Eniwetok, Kwajalein, Johnston Island, and Hawaii before arriving at San Francisco, on 2 May 1946.\nUSCGC Yamacraw (1946–1959)\nUSS Trapper was decommissioned and transferred to the United States Coast Guard in San Francisco on 20 June 1946 and struck from the Navy List on 19 July 1946. The former auxiliary minelayer served with the Coast Guard as a cable layer until early 1959 as Yamacraw (WARC-333). Up until 1946 the Coast Guard was responsible for Navy cable laying operations as well as its own. In 1922 the Coast Guard had obtained the 1909 Army Mine Planter Gen. Samuel M. Mills which it renamed Pequot, second USCG cable ship with the name, for service until replaced by Yamacraw in 1946.\nWoods Hole Oceanographic Institution Work\nDuring 1957–1958 the ship was leased by Woods Hole Oceanographic Institution making voyages in the Atlantic and Mediterranean largely for acoustic and geophysical work.\nDuring 1957 a  long thermistor chain with twenty-three thermistors at intervals of  and towing winch were installed on the ship. The sensor system had been designed to allow continuous collection of temperatures at depth, particularly useful in study of ocean acoustics. The ship collected data in the western Atlantic coast from Nova Scotia to Charleston, South Carolina and into the Sargasso Sea. Yamacraw was in the Mediterranean during the summer of 1958 collecting data on sound transmission. The ship was again equipped with the towed thermistor chain. Included was a study of the Strait of Gibraltar in which the ship departed Cadiz 8 August to observe the thermal structure at the sill where Mediterranean water and Atlantic waters meet.\nOnionhead\nBefore being transferred back to the U.S. Navy the Yamacraw was the buoy tender in the 1958 film Onionhead, which starred Andy Griffith and Walter Matthau.\nUSS Yamacraw (1959–1965)\nThe ship was reacquired by the U.S. Navy on 17 April 1959 and commissioned in New York on 30 April 1959 as the Cable Repair Ship USS Yamacraw (ARC-5), 30 April 1959. Yamacraw was assigned to the 3rd Naval District for the next six years. She operated from Portsmouth, New Hampshire, to Bermuda and spent much of her at-sea time conducting research projects for the Office of Naval Research (ONR) and for the Bell Telephone Laboratories. The ship, operated by Bell Telephone Laboratories, was identified as one of nine military research and development oceanographic ships in a 1959 National Academy of Sciences report.\nOne of the operations for ONR involved a test of a cable towed oceanographic instrumentation system. The test tow, conducted 13 to 17 April 1962, proved the feasibility of towing the system to a depth of  at speeds up to .\nDecommissioning and disposal\nYamacraw was decommissioned 2 July 1965 and transferred to the Maritime Administration for disposal the same day. The ship was purchased for $20,850 by North American Smelting for scrap on 18 October 1967 and withdrawn from the Hudson River Reserve Fleet on 2 November 1967 for scrapping. Yamacraw was scrapped in 1969.\nFootnotes\nReferences\nExternal links\n* [https://web.archive.org/web/20080514115403/http://patriot.net/~eastlnd2/army-amps.htm Coast Artillery Corps—Army Mine Planter Service]\n* [http://www.ibiblio.org/hyperwar/USN/ships/ACM/ACM-9_Trapper.html Ships of the U.S. Navy, 1940–1945 ACM-9 USS Trapper]\n*\n* [http://dlaweb.whoi.edu/ships/yama.html Woods Hole Oceanographic Institution – Yamacraw]\n*[http://api.ning.com/files/QyjARA5zQKe660t6YZesZRGbZZZ2G8hPML-cKPR6TRXigaU4YWuJCJCNglycTCU9GGze7ajai-M*iqCfkZoVzLGo5I2OdwRi/OnionheadYAMACRAW.jpg Onionhead capture: At 42 minutes into the movie the YAMACRAW WAGL-333 is clearly identifiable.]\n* [https://web.archive.org/web/20080509091732/http://patriot.net/~eastlnd2/o_arc.htm ARC-1, Yamacraw (ARC-5) & Nashawena (AG-142)]\n* [https://www.history.navy.mil/our-collections/photography/numerical-list-of-images/nhhc-series/naval-subjects-collection/l45--us-navy-ships/301-320/l45-314-01-01-uss-yamacraw--arc-5-.html Photo: USS Yamacraw (ARC-5)]\n* [https://www.history.navy.mil/content/history/nhhc/research/histories/ship-histories/danfs/y/yamacraw.html Photo: Yamacraw Dictionary of American Naval Fighting Ships (DANFS)]"
    }
  ]
}