{
  "content": [
    {
      "type": "text",
      "text": "# USCGC Robert Ward\n\n{|\n| Ship name = Robert Ward\n| Ship namesake = Robert Ward\n| Ship operator = United States Coast Guard\n| Ship ordered =\n| Ship awarded =\n| Ship builder = Bollinger Shipyards, Lockport, Louisiana\n| Ship original cost =\n| Ship yard number =\n| Ship way number =\n| Ship laid down =\n| Ship launched = 21 August 2018\n| Ship sponsor =\n| Ship christened =\n| Ship completed =\n| Ship acquired = 21 August 2018\n| Ship commissioned = 2 March 2019\n| Ship decommissioned =\n| Ship in service =\n| Ship out of service =\n| Ship renamed =\n| Ship reclassified =\n| Ship refit =\n| Ship struck =\n| Ship reinstated =\n| Ship homeport = San Pedro, California\n| Ship identification = Hull number: WPC-1130\n| Ship motto = Heroism under fire\n| Ship nickname =\n| Ship honors =\n| Ship fate =\n| Ship status =\n| Ship notes =\n| Ship badge =\n}}\ncutter\n| Ship displacement =\n| Ship length =\n| Ship beam =\n| Ship height =\n| Ship draft =\n| Ship depth =\n| Ship power =\n| Ship propulsion = *2 ×\n*1 ×  bow thruster\n| Ship speed =\n| Ship range =\n| Ship endurance = * 5 days\n| Ship boats = 1 × Cutter Boat - Over the Horizon Interceptor\n| Ship complement = 4 officers, 20 crew\n| Ship time to activate =\n| Ship sensors = L-3 C4ISR suite\n| Ship EW =\n| Ship armament = * 1 × Mk 38 Mod 2 25 mm automatic gun\n* 4 × crew-served Browning M2 machine guns\n| Ship notes =\n}}\n|}\n'USCGC Robert Ward (WPC-1130)' is the 30th  cutter, and the second of four assigned to the U.S. Coast Guard Base Los Angeles / Long Beach, in Los Angeles, California.\nDesign\nLike her sister ships, Robert Ward is designed to perform search and rescue missions, port security, and the interception of smugglers.  She is armed with a remote-controlled, gyro-stabilized 25 mm autocannon, four crew served M2 Browning machine guns, and light arms. She is equipped with a stern launching ramp, that allows her to launch or retrieve a water-jet propelled high-speed auxiliary boat, without first coming to a stop. Her high-speed boat has over-the-horizon capability, and is used for inspecting other vessels, and deploying boarding parties.\nOperational history\nRobert Ward was damaged by Hurricane Michael as she proceeded from the Caribbean Sea to Los Angeles, California. She arrived at Los Angeles on 31 October 2018. After completing her sea trials, Robert Ward was commissioned at San Francisco, California on 2 March 2019.\nOn 10 February 2019, during Robert Wards first operational patrol the crew responded to an Emergency Position Indicating Radio Beacon distress call near Torrey Pines, California. Robert Ward arrived on scene within minutes and located three hypothermic people (two adults and one child) clinging to the hull of an overturned sail boat. The crew of Robert Ward rescued all three individuals, provided emergency medical services and transported survivors to San Diego, California.\nOn 29 August 2019, Robert Ward returned to Coast Guard Base Los Angeles Long Beach from her first Eastern Pacific Patrol with  of seized cocaine. The cocaine was estimated to be worth $38.5 million. Robert Ward was credited with the second largest cocaine seizure and disruption of any Coast Guard Fast Response Cutter in the fleet.\nOn 13 November 2019, Robert Ward assisted a mariner in distress on board a homemade sailing vessel after a five-month journey across Pacific Ocean from Japan. The crew of Robert Ward provided food, water and various essential supplies. Robert Ward towed the vessel to waters offshore Port Hueneme, California. The vessel was subsequently towed to the nearest safe haven by another Coast Guard vessel.\nOn 28 July 2020, Robert Ward was conducting a pursuit of a non-compliant vessel that had traveled across the U.S.-Mexico Maritime Boundary line into U.S. Territorial Waters. During the pursuit, persons on board the vessel were seen throwing bags overboard. Soon after, the vessel completely capsized sending all 14 people into the water. All 14 people were immediately recovered from the water and apprehended by Robert Ward. The crew of Robert Ward were also able to recover backpack style packages containing 82 pounds of methamphetamine.\nNamesake\nIn 2010, Charles \"Skip\" W. Bowen, who was then the United States Coast Guard's most senior non-commissioned officer, proposed that all 58 cutters in the Sentinel class should be named after enlisted sailors in the Coast Guard, or one of its precursor services, who were recognized for their heroism.  In 2015 the Coast Guard announced that Robert G. Ward would be the namesake of the 29th cutter. Ward was the coxswain in charge of a landing craft on 6 June 1944, during the Invasion of Normandy.  He distinguished himself while rescuing two injured members of his crew.\n}}"
    }
  ]
}