{
  "content": [
    {
      "type": "text",
      "text": "# Use of human faeces in traditional medicine\n\nHuman faeces has been used in traditional medicine, namely in traditional Chinese medicine and in traditional Tibetan medicine. The practice also existed in Japan. From China, the practice also spread to Korea, although there, the practice was rare in the past and has since virtually ceased.\nHistory\nIn Chinese medicine\nConsuming human faeces is reportedly mentioned as a way of treating diarrhea and food poisoning in a 4th-century Chinese medicine book by Ge Hong.\nLi Shizhen, a pharmacologist of the Ming dynasty, mentioned a medical use of human faeces in his 1596 book Bencao Gangmu (or Compendium of Materia Medica):}}This book also mentions other healing and beneficial properties attributed to animal and human faeces as a solution to various diseases. One writer for the Disgusting Food Museum argued that, since Eastern medicine has drawn much of its foundation from Li Shizhen, the Korean practice was possibly derived from Li's work.\nIn Japanese medicine\nOuryuuto(黄竜湯) appears in a book called Wamiyouruijushou(和名類聚抄), compiled during the Heian period. It is written in the scientific name list compiled during the Heian period, and is a medicine to be taken by drying poop, turning it into powder, and then decocting it.\nAlso, It appears in volume 3 of the sequel to Yoyakusuchi(用薬須知続編) compiled during the Edo period.\nThe name for this is jinchuuoh(人中黄). It means roasted poop.\nIt emptied the bamboo and filled it with licorice, sealed the entrance with wood, placed it in the toilet, allowed the feces to see into the licorice, and then ate the contents.\nIn a book called Kyūmin myōyaku (窮民妙薬), compiled by order of Tokugawa Mitsukuni, it is written that medicines were made from cow poops, cat poops, horse poops, rabbit poops, and child poops.\nIn the 21st century, not only as a medicinal herb but also as a simple liquor, elephant poop liquor became so popular that it sold out.\nIn Korean medicine\nThe practice existed in pre-modern Korea, although it was reportedly rare. The Joseon-era medical manual Donguibogam reportedly has a claim that human faeces can cure food poisoning from animal flesh or mushrooms. A folk medicine during the Joseon period was the consumption of faeces-infused water to ease the throats of singers.\nIn Tomo Imamura's book Chōsen Fūzoku-shū, a collection of Korean customs and traditions, written during the Japanese occupation of Korea, it is stated that some people wrapped their faeces in black rags, exposing them for three days under the moonlight, to fight off fever. Furthermore, human faeces were reportedly mixed with salt and applied as bandages to wounds, while they were \"cooled, put in water and left in a hole, then strained and drunk some time later\" to fight typhoid fever.\nTtongsul\nTtongsul is a premodern traditional Korean medical wine made from the faeces of children. The faeces is soaked, crushed, and made into a paste that is then fermented. It is strained, mixed with rice, and then left to rest. The mixture is then distilled to produce a wine.\nIn modern South Korea, the use of ttongsul is considered extremely rare, to the extent that most South Koreans have never heard of it. In recent years, a Vice Japan video on ttongsul drew criticism in South Korea, with some South Koreans arguing the rare practice was being disproportionately magnified by the Japanese right wing to mock Korean people.\nIn Tibetan medicine\nThe Four Tantras identify faeces (and the excrements of other animals) to treat various diseases, but reportedly do not explain how they should be administered. Human faeces was reportedly recommended for curing gallstones, poisoning, and swelling.\nNotes\nReferences"
    }
  ]
}