{
  "content": [
    {
      "type": "text",
      "text": "# Ushikubi Sue Ware Kiln Site\n\n| map_dot_label  =\n| location       = Ōnojō, Fukuoka, Japan\n| region         = Kyushu\n| type           =\n| part_of        =\n| length         =\n| width          =\n| area           =\n| volume         =\n| diameter       =\n| circumference  =\n| height         =\n| built          =\n| abandoned      =\n| epochs         = Kofun – Heian period\n| cultures       =\n| discovered     =\n| excavations    =\n| archaeologists =\n| condition      =\n| ownership      =\n| management     =\n| public_access  = Yes (no public facilities)\n| other_designation =\n| website        =\n| architectural_styles =\n| architectural_details =\n|notes               =\n}}}}\nThe  is an archaeological site containing a group of Nara period kilns located in the Ushikubi and Kamidairi  neighborhoods of the city of Ōnojō, Fukuoka Prefecture, Japan, extending across the border into parts of Dazaifu and Kasuga. The site was designated a National Historic Site of Japan in 2009.\nOverview\nUshikubi Sue Ware Kilns were located in the southeastern part of the Fukuoka Plain, and operated from the mid-6th century to the mid-9th century. It is the largest group of Sue ware kilns in western Japan outside of the Kinki region. As a result of archaeological excavations, it was estimated that the kiln ruins were distributed in an area of about four kilometers from east-to-west and about 4.8 km from north-to-south, and there were originally about 500 kilns. The kilns were anagama-style underground kilns;  they became larger from the middle to the end of the 6th century, with many having a total length of over ten meters from the end of the 6th century to the first half of the 7th century, and from then on they became smaller. During the period when kilns were larger, many were perforated flue kilns, which were unique to the Ushikubi site and had multiple flues deep inside the firing section. Sue ware shards bearing the inscription Wadō 6 (713) were excavated from the remains of a pit dwelling and a building with buried pillar foundations, suggesting that there was also a village for craftsmen. The types of fired vessels from the Kofun period to the first half of the Nara period were diverse, including small saucers, bottles, and jars, but by the middle of the Nara period, it seems that the kilns specialized in small ware such as saucers and plates. The distribution range of pottery from this site was limited to the area around the Fukuoka Plain during the Kofun period, but in the Nara period and early Heian period it spread across the entire northern Kyushu region.\nMore than 300 kiln traces have been excavated to date. The site is approximately 2.2 kilometers by car from Mizuki Station on the JR Kyushu Kagoshima Main Line, or 4.6 kilometers west of the Dazaifu ruins.\nSee also\n*List of Historic Sites of Japan (Fukuoka)\nReferences\nExternal links\n*[https://www.city.onojo.fukuoka.jp/s077/030/010/030/180/20190829104211.html Ōnojō city home page]\n*[https://www.crossroadfukuoka.jp/spot/14749 Fukuoka Tourism Web]\n*[https://www.fukuoka-bunkazai.jp/frmDetail.aspx?db=1&id=111 Cultural Properties in Fukuoka Prefecture]"
    }
  ]
}