{
  "content": [
    {
      "type": "text",
      "text": "# USS J. Richard Ward\n\n{|\n|Ship name=\n|Ship namesake=James Richard Ward\n|Ship ordered=\n|Ship builder=Brown Shipbuilding Houston, Texas\n|Ship laid down=30 September 1942\n|Ship launched=6 January 1943\n|Ship acquired=\n|Ship commissioned=5 July 1943\n|Ship decommissioned=13 June 1946\n|Ship in service=\n|Ship out of service=\n|Ship struck=2 January 1971\n|Ship reinstated=\n|Ship honours=\n|Ship fate=Sold for scrapping 10 April 1972\n|Ship notes=\n}}\n|Ship displacement=*1,253&nbsp;tons standard\n*1,590&nbsp;tons full load\n|Ship length=306&nbsp;feet (93.27&nbsp;m)\n|Ship beam=36.58&nbsp;feet (11.15&nbsp;m)\n|Ship draft=10.42 full load&nbsp;feet (3.18&nbsp;m)\n|Ship propulsion=*4&nbsp;FM&nbsp;diesel engines,\n*4&nbsp;diesel-generators,\n*6,000&nbsp;shp (4.5&nbsp;MW),\n*2&nbsp;screws\n|Ship speed=21&nbsp;knots (39&nbsp;km/h)\n|Ship range=*9,100&nbsp;nmi. at 12&nbsp;knots\n*(17,000&nbsp;km at 22&nbsp;km/h)\n|Ship complement=8 officers, 201 enlisted\n|Ship sensors=\n|Ship EW=\n|Ship armament=\n|Ship armour=\n|Ship armor=\n|Ship aircraft=\n|Ship aircraft facilities=\n|Ship notes=\n}}\n|}\nUSS J. Richard Ward (DE-243) was an Edsall-class destroyer escort built for the U.S. Navy during World War II. She served in the Atlantic Ocean the Pacific Ocean and provided destroyer escort protection against submarine and air attack for Navy vessels and convoys. She was named in honor of James Richard Ward who was awarded the Medal of Honor posthumously for his heroic efforts under fire on the . She was launched by Brown Shipbuilding Co., Houston, Texas, 6 January 1943; sponsored by Miss Marjorie Ward, sister of Seaman First Class Ward; and commissioned 5 July 1943.\nWorld War II North Atlantic operations\nFollowing shakedown training in waters off Bermuda, J. Richard Ward reached Charleston, South Carolina, 1 September 1943 where she joined Atlantic convoy escort forces. Steaming between Norfolk, Virginia, and Gibraltar in the months that followed, the ship made three complete convoy voyages in support of the Allied effort in Europe. After training in March 1944, the ship was assigned to a hunter-killer group built around . Departing New York 15 March, the ships patrolled the Atlantic between the Brazilian coast and the Cape Verde Islands. No German submarines were encountered; and they returned to New York 18 June 1944. J. Richard Ward was assigned school ship duties at Norfolk during July 1944, and in August was assigned to another hunter-killer group. This unit, headed by , a veteran of the Battle of the Atlantic, sailed 8 August. After a short training period off Bermuda, the ships began scouring the Atlantic for submarines, making attacks on several sound contacts during August. After replenishing at Argentia, Newfoundland, the task group continued operations against German submarines, now greatly reduced in numbers, before returning to New York 9 October. American antisubmarine tactics and skill had once again made the sea-lanes safe. From October 1944 to January 1945, J. Richard Ward performed her tactical mission during pilot qualifications. She sailed again 24 January for antisubmarine patrol in the heavy weather of the north Atlantic, returning 28 March. She was at sea on her final Atlantic cruise when the German surrender came, and returned to New York 11 May 1945.\nTransfer to the Pacific Fleet\nJ. Richard Ward underwent modernization at Boston Navy Yard preparatory to transfer to the Pacific Fleet. She sailed 28 June 1945, for refresher training in the Caribbean, then sailed via the Panama Canal for Hawaii. En route, she received word of the Japanese surrender. After her arrival Pearl Harbor 1 September, the ship screened flight operations with Tripoli.\nPostwar decommissioning\nThe veteran destroyer escort returned to San Diego 17 October 1945. After transiting the Canal and stopping at Norfolk, she arrived Green Cove Springs, Florida, 13 December 1945. There she decommissioned 13 June 1946, and entered the Reserve Fleet in Texas.  She was struck from the Navy list 2 January 1971, and she was sold for scrapping on 10 April 1972.\nSee also\n* , for ships with a similar name\nReferences\n*\nExternal links\n* [https://web.archive.org/web/20011005083318/http://www.history.navy.mil/danfs/#Anchor-Editoria-14954 Dictionary of American Naval Fighting Ships]\n*"
    }
  ]
}