{
  "content": [
    {
      "type": "text",
      "text": "# USS Charles R. Ware (DD-865)\n\n{|\n|Ship name=Charles R. Ware\n|Ship namesake=Charles R. Ware\n|Ship ordered=\n|Ship awarded=\n|Ship builder=Bethlehem Mariners Harbor, Staten Island, New York\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=1 November 1944\n|Ship launched=12 April 1945\n|Ship sponsor=\n|Ship christened=\n|Ship completed=\n|Ship acquired=\n|Ship commissioned=21 July 1945\n|Ship recommissioned=\n|Ship decommissioned=12 December 1974\n|Ship maiden voyage=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=*Callsign: NBGE\n*\n*Hull number: DD-865\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship honors=\n|Ship captured=\n|Ship fate=Sunk as target 15 November 1981\n|Ship notes=\n|Ship badge=\n}}\n|Ship displacement=2,425&nbsp;tons\n|Ship length=\n|Ship beam=\n|Ship height=\n|Ship draft=\n|Ship power=\n|Ship propulsion=\n|Ship speed=\n|Ship range=\n|Ship endurance=\n|Ship complement=367 officers and enlisted\n|Ship sensors=\n|Ship EW=\n|Ship armament=6 /38 guns, 5 21\" tt., 6 dcp., 2 dct.\n|Ship armor=\n|Ship aircraft=\n|Ship aircraft facilities=\n|Ship notes=\n}}\n|}\n'USS Charles R. Ware (DD-865)', was a  of the United States Navy in service from 1945 to 1974. After her decommissioning, she was sunk as a target in 1981.\nNamesake\nCharles Rollins Ware was born on 11 March 1911 in Knoxville, Tennessee. He enlisted in the United States Navy on 14 June 1929, and in 1930 was appointed to the United States Naval Academy. After graduation in 1934, Ware served on the battleship  and the destroyer  until February 1940, when he entered flight training at Naval Air Station Pensacola, Florida.\nServing as a Douglas SBD Dauntless dive bomber pilot with Scouting Squadron 6 (VS-6) based on the aircraft carrier , Lieutenant Ware and his division of six SBDs attacked the carrier Kaga on 4 June 1942, one of four Japanese carriers sunk in the Battle of Midway. During their return to the Enterprise they successfully fought off attacks by Japanese fighters, but ran out of fuel and were forced to ditch. One crew was rescued and another crew was picked up by a Japanese destroyer and later executed. Ware and the other SBD crewmen were reported missing in action. He was posthumously awarded the Navy Cross.\nThe planned destroyer escort USS Charles R. Ware (DE-547) was named for him, but its construction was cancelled in 1944 before construction could begin.\nConstruction\nCharles R. Ware was laid down by the Bethlehem Steel Corporation at Staten Island in New York on 1 November 1944, launched on 12 April 1945 by Mrs. Z. Ware and commissioned on 21 July 1945.\nOperational history\nFrom her home ports at Norfolk, Virginia, and after December 1950, Newport, Rhode Island, Charles R. Ware operated through 1960 with the Atlantic Fleet. Along with many deployments to the Mediterranean Sea and northern Europe, she carried out training and overhaul necessary. Her first major cruise, between 1 March and 9 April 1946, was to northern waters, where she aided in developing techniques for cold weather operations, crossing the Arctic Circle.\nShortly thereafter, she served as target ship for submarines training off New London, Connecticut. On 10 November 1947 the ship got underway for the Mediterranean, and her first tour of duty with the 6th Fleet. After exercising with this force, and calling at ports of northern Europe, she returned to Norfolk 11 March 1948. Her next tour of duty in the Mediterranean came in 1949, during which for 2 weeks she patrolled off the Levant Coast under the direction of the United Nations' Palestine Truce Commission.\nThrough two cruises to the Caribbean in the summer of 1949, Charles R. Ware aided in the training of members of the Naval Reserve, then took part in a large-scale Arctic operation before preparing for a 1950 tour with the 6th Fleet in the Mediterranean. Her 1951 tour was highlighted by operations with ships of the Royal Hellenic Navy. Following her 1953 tour, she conducted antisubmarine warfare exercises with British ships off Northern Ireland, calling then at ports in Ireland, Germany, Norway, Denmark, and Belgium. Later that year she took part in exercises with the aircraft carrier  off Narragansett Bay.\nEarly in 1954, she returned to the Mediterranean once more, for a tour of duty which included participation in a North Atlantic Treaty Organization (NATO) operation. Her 1955 deployment began with antisubmarine warfare exercises with the Royal Navy off Northern Ireland, and was followed by her 6th Fleet duty. In summer 1956, she carried midshipmen on a summer training cruise to Northern Europe.\nThe year 1957 was marked by assignment to escort the ship carrying King Saud of Saudi Arabia into New York harbor for his state visit, and a European cruise during which she exercised with Spanish destroyers. That fall, she put to sea for North Atlantic Treaty Organization exercises and on 20 January 1958, she rescued a downed pilot from the aircraft carrier  while conducting air operations off the east coast. Shortly thereafter she cleared for the Mediterranean once more.\nDuring the summer of 1959, Charles R. Ware took part in the historic Operation Inland Seas, the first passage of a naval force through the Saint Lawrence Seaway into the Great Lakes. She took part in the Naval Review in Lake Saint Louis on 26 June, which was taken by Queen Elizabeth II and President Dwight D. Eisenhower, and sailed on to call at a number of United States and Canadian ports. During her 1960 Mediterranean tour, she carried German naval observers during an exercise in the Ionian Sea.\nCharles R. Ware was decommissioned on 12 December 1974 and was sunk as a target in the Caribbean on 15 November 1981.\nReferences\nExternal links\n*"
    }
  ]
}