{
  "content": [
    {
      "type": "text",
      "text": "# USS Stewart (DE-238)\n\n{|\n|Ship name=Stewart\n|Ship namesake=Charles Stewart\n|Ship ordered=\n|Ship builder=Brown Shipbuilding, Houston, Texas\n|Ship laid down=15 July 1942\n|Ship launched=22 November 1942\n|Ship acquired=\n|Ship commissioned=31 May 1943\n|Ship decommissioned=January 1947\n|Ship in service=\n|Ship out of service=\n|Ship struck=1 October 1972\n|Ship reinstated=\n|Ship honours=\n|Ship fate=Donated as a museum ship to Galveston, Texas on 25 June 1974\n|Ship status=\n|Ship notes=\n}}\n|Ship displacement=*  standard\n*  full load\n|Ship length=\n|Ship beam=\n|Ship draft=  full load\n|Ship propulsion=*4&nbsp;FM&nbsp;diesel engines,\n*4&nbsp;diesel-generators,\n*\n*2&nbsp;screws\n|Ship speed=\n|Ship range=*  at\n|Ship complement=8 officers, 201 enlisted\n|Ship sensors=\n|Ship EW=\n|Ship armament=\n|Ship notes=\n}}\n| locmapin = Texas#USA\n| map_label = USS Stewart\n| locmap_relief = yes\n| added = 12 July 2007\n| area =\n| refnum = 07000689\n}}\n|}\n'USS Stewart (DE–238)' is an , the third United States Navy ship so named. This ship was named for Rear Admiral Charles Stewart (28 July 1778 – 6 November 1869), who commanded  during the War of 1812. Stewart is one of only two preserved destroyer escorts in the U.S. and is the only Edsall-class vessel to be preserved. She is on display in Galveston, Texas as a museum ship and is open to the public.\nConstruction and career\nThe third Stewart (DE-238) was laid down at Houston, Texas, by Brown Shipbuilding on 15 July 1942; launched on 22 November; sponsored by Mrs. William A. Porteos, Jr.; and commissioned on 31 May 1943.\nStewart remained at Houston until 10 June, when she shifted to Galveston. She entered the drydock there on the 14th and exited on the 16th. The following day, she got underway for New Orleans, Louisiana, where she reported for duty to the Commandant of the 8th Naval District and to the Commander, Operational Training Command, Atlantic Fleet (COTCLANT). The destroyer escort departed New Orleans on 22 June to conduct shakedown training in the vicinity of Bermuda; completed it a month later; and sailed for Philadelphia. After six days at the Philadelphia Navy Yard, Stewart headed south to Miami, Florida, from whence she operated, conducting patrols and exercises, until 29 October. She put to sea; headed north; and, on the 31st, arrived at Norfolk, Virginia.\nConvoy duty\nAfter a cruise up the Potomac River, during which she visited Quantico, Virginia and the Washington Navy Yard, Stewart commenced a tour of duty training prospective destroyer-escort crews out of Norfolk. That assignment continued for the next three and one-half months, broken only by two temporary assignments escorting convoys from Tompkinsville, New York, to the Virginia Capes area. On 17 March 1944, she sailed from Norfolk for Tompkinsville; arrived there the next day; and put to sea, on the 19th, in the screen of a convoy bound—via NS Argentia, Newfoundland—for Reykjavík, Iceland. She returned to Tompkinsville on 10 April and sailed for Norfolk on the 12th. She arrived there on the 13th, drydocked from the 14th to the 16th, and joined the screen of convoy Task Unit (TU) 29.6.1 on 25 April.\nStewart sailed with her convoy via Aruba in the Netherlands West Indies and made Cristobal in the Panama Canal Zone on 3 May. The following day, she put to sea with the convoy and escorted it as far as Guantanamo Bay, Cuba. There, she parted company with the other ships and steamed independently to Bermuda.\nThe destroyer escort arrived at Port Royal on 10 May and, for the next week, made experimental attacks on a captured Italian submarine. From the 18th to the 23rd, Stewart participated in a search off Bermuda for an unidentified radio direction finder contact. She made one depth charge attack on the 18th, but the results were inconclusive. On the 23rd, she put back into Port Royal and remained there four days.\nStewart departed Port Royal again on the 27th, this time in a hunter-killer group composed of USS Rhind and USS Wainwright, in addition to herself. On 3 June, the three warships rendezvoused with convoy UC 24, and the group sailed north. Stewart was detached on the 8th and, on the 9th, put into Boston, Massachusetts. On the 25th, she shifted to Casco Bay, Maine, and the following day, conducted antisubmarine warfare (ASW) exercises with the . On the 27th, she sailed south to Norfolk. Stewart arrived on the 29th and put to sea again on 1 July in the escort of convoy UGF 12. The destroyer escort screened the convoy to Naples, Italy, where it arrived on 15 July. She departed Naples on 21 July in the screen of the return convoy, GUF 12, and moored at the Brooklyn Navy Yard on 3 August.\nIn mid-August, she returned to Casco Bay for two days of training; then she entered drydock at Boston on the 17th. She left drydock on the 21st and soon got underway to join another convoy at Norfolk. Stewart arrived at Norfolk on 22 August. On the 24th, she began another voyage to Naples, returning to the United States at New York City on 26 September. When she shifted to Casco Bay on 9 October, she took up ASW training again with Vortice. On 20 October, she returned to Boston, from whence she sailed two days later in the screen of convoy CU 44. On that same day, Stewart dropped four depth charges at a sound contact but had to abandon the search and rejoin the convoy. She entered the River Clyde and moored there on 2 November. Eight days later, the destroyer escort sailed for the United States and arrived in New York on 22 November.\nFollowing another round of ASW training off Nantucket Island, this time with the , she departed Boston on 10 December in the screen of another convoy. Ten days later, she entered Plymouth Sound. On the night of 23/24 December, she shifted to the Isle of Wight where she joined another convoy getting underway for America. Between January and June 1945, Stewart, escorted three more convoys to England, one to Falmouth and two to Liverpool. Between each round-trip voyage, she trained off the New England coast. On the return voyage from the second of these missions, Stewart was called-upon to assist SS Saint Mihiel in fighting fires caused by a collision with SS Nashbulk. Following her final voyage to England, Stewart put into the New York Navy Yard for 18 days of availability. On 24 June 1945, she departed New York for Norfolk, arriving there on the 26th. After a brief stop, she continued on to Guantanamo Bay, Cuba, where she conducted training exercises from 30 June until 12 July.\nTransfer to the Pacific\nShe cleared the area on the 12th in company with USS Edsall and USS Moore. The three warships transited the Panama Canal on 16 July and made San Diego on the 24th. Four days at the Naval Repair Base followed; then USS Wilhoite joined Stewart and the other two destroyer escorts as they headed for Pearl Harbor on the 28th. The formation reached Pearl Harbor on 4 August, and Stewart conducted training, first with USS Spearfish, then with USS Baltimore until 5 September when she departed for the west coast. She stopped at San Diego from 11 to 13 September; then continued on to the Canal Zone.\nReserve status and decommissioning\nShe retransited the canal on 22 September and made Philadelphia on the 27th. One month later, Stewart reported for duty to the Atlantic Reserve Fleet at Philadelphia. Stewart was placed out of commission, in reserve, in January 1947 at Green Cove Springs, Florida. Stewart changed berthing areas three times between 1947 and 1969—first to Charleston in 1958, then to Norfolk in 1959, and finally to Orange, Texas in 1969. In 1972, the destroyer escort underwent inspection and survey and was found to be unfit for further naval service. Consequently, her name was struck from the Navy list on 1 October 1972.\nMuseum ship\nOn 25 June 1974, Stewart and the   were donated by the U.S. Navy to the city of Galveston for use as part of the American Undersea Warfare Center at Seawolf Park. The municipal park is a memorial to the loss of USS Seawolf, SS-197 and Texans who died in World War II.  The park is located on Pelican Island. Both vessels were placed, in their entirety, on land overlooking the city. In April 2024, Stewart underwent new painting to show her as the USS Samuel B. Roberts would have appeared during WW2.\nNeglect\nOver the years, a lack of maintenance, the elements, and vandalism had left Stewart and Cavalla in extremely poor material condition with corrosion and missing equipment being the obvious issues. In 1996, the U.S. Navy was considering reclaiming Stewart and placing her in the care of the Carnegie Institute with the intention of moving the ship to Pittsburgh, Pennsylvania, on the condition that a metallurgical analysis found that the hull was in sufficient condition for her to be re-floated. In October 1998, the Galveston Parks Board announced its intention to scrap both vessels and turn Seawolf Park into an RV park. After a protracted public battle, the Parks Board allowed the Cavalla Historical Foundation to raise funds for the restoration and preservation of the vessels.\n.]]\nInduction into the National Register of Historic Places\nOn 11 November 2007, Stewart was officially inducted into the National Register of Historic Places in a formal ceremony held in conjunction with regular annual Veterans Day activities. Captain C.W. \"Swede\" Andersen, President of the Texas Navy Association, Dwayne Jones, Executive Director of the Galveston Historical Foundation, Lyda Ann Thomas, Mayor of Galveston, and a host of other dignitaries were present for the ceremony.\nHurricane Ike\nOn 13 September 2008, Stewart suffered extensive flooding and wind damage as a result of Hurricane Ike. While Hurricane Ike hit Galveston as a strong Category 2 storm, most of the damage resulted from the category 5-equivalent storm surge. Damage to both Cavalla and Stewart was extensive but restoration activities have brought both vessels back to daily maintenance level condition.\nSee also\n*National Register of Historic Places listings in Galveston County, Texas\n*Effects of Hurricane Ike in Texas\n*USS Slater - the last destroyer escort afloat in America, now a museum ship in Albany, NY.\nReferences\n*\nExternal links\n*[http://www.taskforce1.org/stewart.htm ''Stewart's condition in 2003]\n*[http://www.cavalla.org/ USS Cavalla Historical Foundation]\n*[http://www.hnsa.org/hnsa-ships HNSA Ship Page: USS Stewart'']"
    }
  ]
}