{
  "content": [
    {
      "type": "text",
      "text": "# USS Newark (SP-266)\n\n{|\n|Ship name=USS Newark\n|Ship namesake=Newark, New Jersey; Newark, Delaware; Newark, New York; and Newark, Ohio (previous name retained)\n|Ship owner=\n|Ship operator=\n|Ship ordered=\n|Ship awarded=\n|Ship builder=Skinner Shipbuilding Company, Baltimore, Maryland\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=\n|Ship launched=\n|Ship sponsor=\n|Ship christened=\n|Ship completed=1913\n|Ship acquired=18 August 1917\n|Ship commissioned=23 September 1917\n|Ship decommissioned=15 May 1919\n|Ship recommissioned=\n|Ship maiden voyage=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship struck=\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honors=\n|Ship fate=Sold 19 May 1919\n|Ship notes=Operated as civilian tug Newark 1913-1917\n|Ship badge=\n}}\n|Ship length=\n|Ship beam=\n|Ship draft=\n|Ship power=\n|Ship propulsion=\n|Ship speed=\n|Ship range=\n|Ship capacity=\n|Ship complement=\n|Ship armament=1 × 1-pounder gun\n|Ship notes=\n}}\n|}\nThe second 'USS Newark (SP-266)' was a United States Navy minesweeper and tug in commission from 1917 to 1919.\nNewark was built as a commercial tug of the same name in 1913 by the Skinner Shipbuilding Company at Baltimore, Maryland. The U.S. Navy acquired her from her owner, the Delaware, Lackawanna and Western Railroad Company, on 18 August 1917 for World War I service as a minesweeper and tug. She was commissioned on 23 September 1917 as USS Newark (SP-266).\nOperating in the 3rd Naval District (headquartered at New York City) during World War I, Newark got under way on 26 September 1917 as a minesweeper in and around New York City, berthing at Marine Basin. She steamed on patrol to Whitestone, Long Island, New York on 4 January 1918. In February, she operated as a tug, breaking ice in Marine Basin, helping six submarine chasers out of the harbor, and towing ships from docks to coal barges. In May, she resumed minesweeping activities, operating in Ambrose Channel.\nAfter the war, on 22 January 1919, Newark steamed up to Fort Lafayette in New York Harbor, towing barges and ships such as  to the Lackawanna Terminal coal docks in Hoboken, New Jersey.\nNewark was decommissioned on 15 May and was sold on 19 May.\nReferences\n*\nExternal links\n*"
    }
  ]
}