{
  "content": [
    {
      "type": "text",
      "text": "# USS President Polk\n\nUSS James K. Polk}}\n{|\n|+USS President Polk (AP-103)\n|Ship name=*SS President Polk (1941 – 4 October 1943)\n*USS President Polk AP-103 (4 October 1943 – 26 January 1946)\n*SS President Polk (26 January 1946 – 15 July 1965)\n*Gaucho Martin Fierro (15 July 1965)\n*Minotauros 1966\n|Ship namesake=US President James Polk\n|Ship yard number=\n|Ship ordered=\n|Ship sponsor=Miss Patricia Kennedy\n|Ship builder=Newport News Shipbuilding\n|Ship christened=\n|Ship renamed=\n|Ship laid down=7 October 1940\n|Ship identification=MCV Hull Type C3-P&C, MCV Hull No. 110\n|Ship launched=28 June 1941\n|Ship acquired=(by the Navy): 6 September 1943\n|Ship commissioned=4 October 1943\n|Ship decommissioned=26 January 1946\n|Ship reclassified=\n|Ship in service=\n|Ship out of service=\n|Ship struck=25 February 1946\n|Ship reinstated=\n|Ship honours=Six battle stars for World War II service\n|Ship fate=Scrapped at Kaohsiung, Taiwan 1970\n|Ship notes=\n}}\n|Ship displacement=9,000 tons (lt), 11,760 t. (fl)\n|Ship tonnage=\n|Ship length=\n|Ship beam=\n|Ship draught=\n|Ship draft=\n|Ship propulsion=*1 × geared drive turbine\n*2 × Babcock & Wilcox header-type boilers\n*1 × propeller\n*designed shaft horsepower:\n|Ship speed=\n|Ship range=\n|Ship capacity=Unknown\n|Ship complement=354\n|Ship boats=\n|Ship sensors=\n|Ship EW=\n|Ship armament=*1 × 5\"/38 caliber gun\n*4 × 3\"/50 caliber dual-purpose gun mounts\n*4 × Bofors 40mm gun mounts\n|Ship armour=\n|Ship armor=\n|Ship aircraft=\n|Ship notes=\n}}\n|}\n'USS President Polk (AP-103)' was a  in the service of the United States Navy during World War II.\nPresident Polk was laid down by the Newport News Shipbuilding and Drydock Company of Newport News, Virginia (MC hull 110) 7 October 1940; launched 28 June 1941; sponsored by Miss Patricia Kennedy. The ship was delivered to American President Lines (APL) in 1941 when she began operating as of 5 December as 'SS President Polk', a transport under government charter in the Pacific reinforcing Pacific bases, until 6 September 1943 when the ship was requisitioned and acquired by the Navy for conversion to a troop ship. The ship commissioned as  at San Diego 4 October 1943. After the war she was returned to APL for commercial operations.\nWorld War II\nWar Shipping Administration transport\nShortly after delivery in 1941 the SS President Polk began operating under government charter to supply and reinforce Pacific bases. The ship was then acquired by the War Shipping Administration (WSA) on 5 December 1941 with American President Lines operating the ship as WSA's agent.\nIn a particularly critical delivery the ship was diverted from a planned shipment to Hawaii and departed San Francisco on 19 December 1941 along with a tanker and two freighters with arrival in Brisbane, Australia on 12 January 1942. There she delivered 55 P-40E and 4 C-53 aircraft including 55 pilots, 20&nbsp;million .30 caliber, 447,000 .50 caliber, 30,000 three-inch AA and 5,000 75&nbsp;mm rounds of ammunition along with five carloads of torpedoes, over 615,000 pounds of rations and 178 officers and men in addition to the pilots. From Brisbane Polk, making a stop at Townsville, sailed to Soerabaja arriving on 30 January with ammunition, bombs, airplanes, and rations for forces in Java. Of eight vessels planned for relief of Java, and indirectly the Philippines, only Polk and the chartered Dutch vessel Bloemfontein, one of the Pensacola convoy vessels, arrived before that island fell on 9 March.\nPolk transported 7 officers and 433 enlisted men of the 7th Naval Construction Battalion from American Samoa to Espiritu Santo, New Hebrides from 6 to 11 August 1942. The remaining 15 officers and 465 enlisted men of the battalion were embarked aboard .\nUnited States Navy\nAfter acquisition 6 September 1943 and conversion by the Navy the ship was assigned to the Naval Transportation Service. USS President Polk loaded construction battalion men and cargo at Port Hueneme, California and sailed 12 October 1943 for Pearl Harbor.\nInvasions of Tarawa and Kwajalein\nOn 16 November 1943 she got underway for the invasion of Tarawa, Gilbert Islands, where she unloaded her troops and cargo and then stood by as casualty receiving ship. Returning to Pearl Harbor 11 December, she weighed anchor again 22 January 1944 to carry troops to Kwajalein in the Marshall Islands. Again used as an emergency hospital ship, she carried casualties to San Francisco, 24 February, then got underway with troops and cargo for New Caledonia, in the Solomon Islands, and the Admiralty Islands.\nInvasion of Leyte\nIn July she carried reinforcements to Guam and again sailed east with wounded personnel, arriving at Pearl Harbor 11 August and continuing on to California where she took on personnel and cargo for New Guinea. Arriving at Milne Bay 6 November, she loaded passengers and cargo, then proceeded to Bougainville Island to prepare for the invasion of Luzon. Disembarking troops on the Lingayen assault beaches, 11 January 1945, she ferried reinforcements from Leyte, then sailed to Ulithi to take on Marines at Iwo Jima and return them to Hawaii. Thence she steamed to San Francisco, took on fresh troops, and headed west to Okinawa 24 July.\nAfter hostilities\nV-J Day found her in Apra Harbor, Guam, whence she returned to San Francisco. Next, she transported troops from Seattle to Tinian, reported for Operation Magic Carpet 13 October, and completed runs from Espiritu Santo and Manila to San Francisco before the end of the year. USS President Polk, with six battle stars for her World War II service, decommissioned and was transferred to the War Shipping Administration for return to her owner 26 January 1946, President Polk was struck from the Navy List 25 February 1946.\nPost-war commercial service\nAmerican President Lines placed SS President Polk in its round-the-world trade until 15 July 1965, when the ship was sold to Ganaderos del Mar, renamed Gaucho Martin Fierro, and in 1966 under the same owner again renamed Minotauros. In 1970 the ship was scrapped at Kaohsiung, Taiwan.\n}}\nReferences\n*\n*\n*\nExternal links\n*"
    }
  ]
}