{
  "content": [
    {
      "type": "text",
      "text": "# USS Kingfisher (1861)\n\n{|\n|Ship name= USS Kingfisher\n|Ship namesake=\n|Ship ordered=\n|Ship builder=\n|Ship laid down=\n|Ship launched=\n|Ship acquired= by purchase, 2 August 1861\n|Ship commissioned= 3 October 1861\n|Ship decommissioned=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate=*Grounded, 28 March 1864\n*Abandoned, 5 April 1864\n|Ship notes=\n}}\n|Ship beam=\n|Ship draft=\n|Ship hold depth=\n|Ship propulsion=\n|Ship sail plan=\n|Ship complement= 97\n|Ship armament=4 ×  smoothbore Dahlgren guns\n|Ship notes=\n}}\n|}\nThe first 'USS Kingfisher' was purchased by the Navy at Boston, Massachusetts, 2 August 1861; and commissioned at Boston Navy Yard 3 October 1861, Acting Lt. Joseph P. Couthouy in command.\nThat day she was ordered to Key West, Florida, for duty in the Gulf Blockading Squadron. On 21 January 1862, she joined  in capturing the Olive Branch bound from Cedar Keys to Nassau, Bahamas, with a cargo of turpentine. She again cooperated with Ethan Allen on 26 January 1862 in manning and equipping a boat expedition to the mouth of the Manatee River which captured the sloop Mary Nevis and burned Confederate cavalry barracks. Three days later, she took Spanish brig Terisita of Havana bound for Matamoros, Tamaulipas with a contraband cargo. On 25 February 1862, Kingfisher overtook blockade runner Lion in the Gulf of Mexico after a three-day chase.\nThe great risks involved in blockade duty during the Civil War have not been generally recognized. The need for water, food, or timber often forced parties from the Union Navy ships to venture ashore in hostile territory. On 2 June 1862, two boats from Kingfisher rowed up Aucilla River, Florida, to obtain fresh water. A Southern raiding party surprised the expedition killing two men and capturing the remaining nine.\nOther landing parties from the bark fared better. An expedition destroyed salt works at St. Joseph Bay, Florida, which had produced some 200 bushels a day.\nBut the hardships of blockade duty in the Gulf were unabated. Early scurvy became a serious problem for the crew prompting Rear Admiral Lardner to order Kingfisher to Boston, Massachusetts. When the ship had been repaired and her crew reinvigorated, Kingfisher was assigned to the South Atlantic Blockading Squadron and ordered to Port Royal, South Carolina, where she arrived on 21 December 1862.\nThe bark was stationed in St. Helena Sound, South Carolina, where she distinguished herself for efficiency in reconnaissance work and operations against small parties of Confederates ashore. On 9 April 1863, a party from Kingfisher landed at Middleton's estate, Edisto Island, South Carolina, and captured a group of Southern cavalrymen stationed there to observe and report activity of Union ships in the area. From time to time during the ensuing year, she shelled Confederate troops ashore and sent small landing parties inland to gather information and capture food for her crew and for refugees who had flocked to her for protection.\nKingfisher grounded on Combahee Bank in St. Helena Sound on 28 March 1864 and filled with water. After efforts to save the stranded ship proved fruitless, she was abandoned on 5 April 1864.\nReferences\n*"
    }
  ]
}