{
  "content": [
    {
      "type": "text",
      "text": "# USS Aaron Ward (DD-132)\n\n{|\n|Ship name=USS Aaron Ward\n|Ship namesake=Aaron Ward\n|Ship ordered=\n|Ship builder=Bath Iron Works\n|Ship laid down=11 August 1918\n|Ship launched=10 April 1919\n|Ship acquired=\n|Ship commissioned=21 April 1919\n|Ship decommissioned=17 June 1922\n}}\n|Ship name=HMS Castleton\n|Ship namesake=\n|Ship acquired=9 September 1940\n|Ship commissioned=September 1940\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=Paid off in March 1945\n|Ship struck=\n|Ship honours=\n|Ship fate=Scrapped, 1947\n|Ship notes=\n}}\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship draft=\n|Ship propulsion=*2 × geared steam turbines\n* 2 × shafts\n|Ship speed=\n|Ship range=\n|Ship complement=159 officers and enlisted\n|Ship sensors=\n|Ship armament=*4 × /50 guns (4x1)\n* 1 × /23 gun\n* 12 × 21 inch (533 mm) torpedo tubes (4x3)\n|Ship notes=\n}}\n|}\nThe first ship named in honor of Rear Admiral Aaron Ward, 'USS Aaron Ward (DD-132) was a  in service with the United States Navy. In 1940, she was transferred to the Royal Navy and renamed HMS Castleton'.\nService history\nAs USS Aaron Ward\nShe was laid down on 1 August 1918 at Bath, Maine by the Bath Iron Works, launched on 10 April 1919, sponsored by Mrs. Washington Lee Capps, the daughter of Admiral Ward and the wife of Rear Admiral Capps. The ship was commissioned on 21 April 1919 with Lieutenant Commander Raymond A. Spruance in command.  Spruance would later rise to the rank of admiral and commanded the United States Fifth Fleet in the Pacific Theater during World War II.\nUpon commissioning, the destroyer reported for duty with Destroyer Division 13 (DesDiv&nbsp;13), Destroyer Squadron 2 (DesRon&nbsp;2), Atlantic Fleet. She performed her first significant service for the Navy at Trepassey Bay in May 1919 when she served as one of the pickets for the transatlantic flight attempt by three Curtiss NC flying boats. One of the boats—NC-4—completed the flight successfully. Aaron Ward continued to serve with Atlantic Fleet until September, at which time she was transferred to the Pacific. Her first assignment there consisted of a month of salvage operations in Angeles Bay, Baja California, Mexico, to recover a downed Army DH.4B observation plane and the bodies of its crew who had been murdered by Mexican fishermen. At the conclusion of that mission, she began training operations with the Battle Fleet. On 17 July 1920, the Navy adopted the alphanumeric system of hull designations, and Aaron Ward became DD-132 (before this, she had been Destroyer No. 132). Her work with Battle Fleet was interrupted early in 1921 by two rescue missions near the Panama Canal Zone. Between January and March of that year, she cruised the waters along the coast of the Canal Zone searching for the flying boat NC-6, which had crashed in the vicinity. In February, she turned from that mission to pursue another errand of mercy, the rescue of survivors from the destroyer  which had sunk after a collision with the merchant vessel  on 26 February. Aaron Ward resumed normal duty with the Battle Fleet in March 1921, and continued that duty until she was decommissioned on 17 June 1922 and berthed with the Reserve Fleet at San Diego.\nThe destroyer remained inactive for almost eight years, and then was recommissioned at San Diego on 24 May 1930. After active service until mid-1932, she entered the Rotating Reserve in which she alternated active periods at sea with intervals of inactivity at pierside with a minimal crew embarked. The ship continued in that status until December 1934, when she returned to full activity. On 1 April 1937, the destroyer once more was placed out of commission and returned to the Reserve Fleet. On 30 September 1939, Aaron Ward came out of reserve for the final time. Recommissioned on that day (in response to President Franklin D. Roosevelt's establishment of the Neutrality Patrol following the outbreak of war in Europe at the beginning of the month), she became flagship of DesDiv 65, Pacific Fleet. In December, she was transferred to the Atlantic Fleet and, on the 11th, arrived at Key West, Florida. For the rest of her U.S. Navy career, she conducted neutrality patrols in the Gulf of Mexico and in the West Indies.\nright\nAs HMS Castleton\nOn 9 September 1940, Aaron Ward was decommissioned at Halifax, Nova Scotia. Transferred to Britain as one of the 50 old destroyers leased to that nation in return for the right to establish American bases on British possessions in the Western Hemisphere by the destroyers-for-bases deal, she was commissioned in the Royal Navy that same day as 'HMS Castleton'. Castleton was modified for trade convoy escort service by removal of three of the original /50 caliber guns and one of the triple torpedo tube mounts to reduce topside weight for additional depth charge stowage and installation of a Hedgehog anti-submarine mortar system.\nCastleton served as convoy escort and as an escort for mine-laying operations for the remainder of the Atlantic campaign. In August 1942 Castleton and sister ship  apprehended the survivors of , who had taken refuge on an Icelandic trawler after their vessel was sunk by aircraft.\nIn October 1944 Castleton was relegated to duty as an Air Target ship. She was paid off in March 1945 and sold for scrap in January 1948.\nNotes\nReferences\n*\n*\nExternal links\n*[https://uboat.net/allies/warships/ship/2120.html Uboat.net]\n*"
    }
  ]
}