{
  "content": [
    {
      "type": "text",
      "text": "# Uwari\n\nUwari is a monotypic genus of Camponotine ant distributed in East Asia, mainly Japan. It was established by Ward et al. 2025, its sole valid species Uwari keihitoi being previously classified under Camponotus subgenus Myrmentoma.\nTaxonomy\nThe genus was described in 2025 by Ward et al. The type species is Uwari keihitoi, originally named Camponotus keihitoi by Auguste Forel in 1913. The generic name is derived from the Japanese words uwa (\"wow\") and ari (\"ant\").\nDistribution\nThe genus is distributed in East Asia. Uwari occurs mainly in Japan, with records also from China and Korea. Colonies are arboreal, typically nesting in twigs and dead wood within forest and forest-edge habitats. It was first reported in India in 2023, in the state of Uttarakhand.\nDescription\nWorkers show limited size variation and are characterized by mandibles with five teeth, a broadly convex clypeal margin without indentation, and a clypeus that is wider than long and lacks a median carina. The frontal carinae expand posteriorly, and the antennal scapes are relatively short. The mesosoma is somewhat flattened, with a weakly raised metanotum and a rounded junction to the propodeum. The petiole is slender and scale-like, tapering to a point at the top. Standing hairs are sparse, absent from the mesosoma and petiole, and present only in small numbers on the head and gaster. The body is lightly sculptured, shiny, and blackish brown with lighter appendages. Uwari keihitoi is morphologically close to Camponotus quarinotatus, but has a more distinct metanotal depression, has the absence of pilosity on the mesosoma and petiole, and the anterior clypeal margin is straight. It is regarded as a truly arboreal species. Workers show limited polymorphism, with major workers having a relatively broad head and minors being smaller and more oval-headed. Queen ants resemble workers but possess ocelli and a more robust mesosoma adapted for flight. Males are slender, with 13-segmented antennae, large eyes, and distinctive genitalia. The body is generally blackish with reddish-brown mandibles and darker brown antennae and legs. The integument is glossy with weak sculpturing. Appressed hairs cover the body, with long erect hairs present on the gaster, clypeus, and mandibles.\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*"
    }
  ]
}