{
  "content": [
    {
      "type": "text",
      "text": "# V. Eshwaraiah\n\n| party              =\n| relatives          =\n| signature          =\n}}\nVangala Eshwaraiah, also spelt as V. Eswaraiah is a former chairperson of the National Commission for Backward Classes (September 2013 to September 2016), and previously a Chief Justice of the High Court of Andhra Pradesh in India. He was named as an additional judge of Andhra Pradesh High Court in 1999 and as permanent judge in 2000. Government of India appointed Justice Vangala Eswaraiah, former Acting Chief Justice of Andhra Pradesh High Court as the Chairperson of the National Commission for Backward Classes (NCBC) on 23 September 2013. He was succeeded by Justice M. N. Rao, a retired Chief Justice of Himachal Pradesh High Court.\nHe says in an interview to a journal as, we can only minimize but never eradicate crime no matter how many new laws are enacted unless people and the society mindset changes to respect the laws. The laws are not able to be effective as value for obedience, honesty and principles are getting diminished.\nHe is influenced by Lekhraj Kripalani, the founder of Brahma Kumaris World Spiritual University. During his visit to Institute of Sindhology in Sindh of Pakistan, he called upon India and Pakistan to focus on universal peace, harmony and development of their people by curtailing defence budget on border tensions.\nHe was influenced by Jagan Mohan Reddy government in 2020, complained on current high court and was involved in allegations as audio leaked in ABN news channel.\nProfessional career\nHe got married when he was in final year of Bachelor of Science which he did from City College in Hyderabad.  After marriage, his uncle encouraged him to do medicine which he could not write entrance exam due to the death of his family member.\nHe did his L.L.B from Law College of Osmania University in Hyderabad. He enrolled as an advocate in 1978 and started working under his senior Talluri Dasharatha Ramaiah to handle cases related to excise. Right from 1980, he started his own practise to handle civil, criminal, service and constitutional matters in both high courts and civil courts in Hyderabad.\nHe worked as government pleader from January 1990 till December 1994 for five years. He also worked as standing counsel for Andhra Pradesh Dairy Development Corporation Limited (A.P.D.D.C.L) and Nalgonda District Cooperative Central Bank. He was also advisor to Mother Teresa's Charity Secunderabad.\nOn 17 May 1999, he was appointed as additional judge of Andhra Pradesh high court. Later, he was appointed as judge of Andhra Pradesh high court on 20 April 2000 and still working as honourable judge.\nFrom the date of his appointment he turned as a vegetarian and practicing continuously for spiritual elevation to keep up the oath taken at the time of the swearing as a Judge. He is the follower of Prajapitha Bramha Kumaris Ishwariya Vishwavidyala.\nJudgements\nThrough interim order, he stopped skyscraper project being constructed by Emaar Properties and Lanco Group owned by Rajagopal Lagadapati in plots belonging to Muslims Wakf Boards erroneously and illegally allocated by YSR government to his party Member of Parliament Rajagopal Lagadapati.\nHe prevented the exploitation of laws for political harassment on opposition political parties by ruling political parties by preventing police authorities from taking any coercive\nsteps.\nHe directed the state government ruled by Indian National Congress (INC) to act in a fair and non-discriminatory manner by framing a uniform procedure when differential treatment biased on caste or religion towards employees caught by Anti Corruption Bureau (ACB) sleuths.\nHe decided that the writ petitions are maintainable on the letters addressed by the siting MLA Mr.Shankar Rao, about the fraud and corrupt activities committed by the EMMAR properties, its sister companies in view of the involvement of the larger public interest and also about the alleged ill-gotten money and illegal gratification invested in the companies floated by YS Jagan Mohan Reddy former MP and son of former Chief Minister YS Rajshekar Reddy, as a quid pro quo for the benefit confirmed on the invested companies by taking advantage of his father's position.\nReferences\nExternal links\n* [https://web.archive.org/web/20110710061801/http://www.unilawonline.com/judges_court/andhra.asp Unilawonline.com]\n* [http://www.lawyersclubindia.com/files/quash-supplementary%20cahrge%20sheet.doc Lawyersclubindia.com]\n* [https://web.archive.org/web/20100925194904/http://www.aponline.gov.in/Quick%20Links/Departments/Law/Govt-Gos-Acts/2000/GO.Ms.64.2000.html Aponline.gov.in]\n* [http://www.rediff.com/news/2007/jul/30ap.htm Rediff.com]\n*"
    }
  ]
}