{
  "content": [
    {
      "type": "text",
      "text": "# Valour (software)\n\nValour is a copy/backup/restore program for IBM's VM environment.\nThe product\nValour, also called DiskWorks as well as strategic marketing brands chosen by vendors, grew out of a plan to rewrite the aging Westinghouse Disc Utility (WDU) and target the full range of IBM operating systems.\nValour runs as a highly privileged CMS task, designed to accommodate any model disc drive or tape drive. The product incorporated a number of unique concepts and technologies. It was one of the earliest products to use a primitive form of windowing, including dialogue boxes capable of real-time updates.\nThe product offered a wide variety of hierarchical backups, data streaming, alternating tape drives, and an ability to defragment minidisks.\nDevelopment\nValour, also called DiskWorks, grew out of a joint effort between Westinghouse and III of Orlando, Florida. Original plans called for both VM/CMS and VSE versions led by Dr. Ray Ferguson of Westinghouse and Leigh Lundin of III. John Gaston was selected to lead the VSE team. Part way into development, Westinghouse began to break up the division during the outsourcing thrust of the Reaganomics era. Through badly managed negotiations, Westinghouse ended up with neither developers or outsourcing partners, which spelled the end for one of the industries foremost software groups.\nThe VM product was developed by III (Independent Intelligence Incorporated) of Orlando, Florida. The software designer was Leigh Lundin. Other core developers included Dr. Ray Ferguson, Kevin Beauregard, Mark Woodruff, and Jean-François Groff.\nProduct development occurred at III offices within Westinghouse Automation Intelligence division,  Orlando, Florida. Broad range in-depth testing was conducted at IBM's data center in Tampa, Florida and the IBM lab in Böblingen, Germany.\nThe team first built an OOPS environment using a combination of procedural Rexx and assembler language. Valour may have been one of the first commercial products that looked to object-oriented programming to underpin its development platform.\nDevelopment brought new techniques and concepts, including its own hi-speed access method, network hierarchical data structures, windowing, and a buffer block concept referred to as granularity.\nMarketing\nThe product had a feature unique for its time. By changing a table and a splash screen, the product could be re-labeled or re-branded for any distributor in any Roman language. As such, the product was localized for France, Germany, Switzerland, and Netherlands, each with local marketing companies. III contracted with distributors using a non-exclusive license.\nFor example, the distributor in the US branded it USR/Backup, while a German company, SysCon, labeled it SysCon/I.\nWestinghouse Electric Management Systems, SA (WEMSSA), Paris, London, Geneva, Zürich, Munich, and Amsterdam, acquired the marketing rights, initially for Europe, Africa, and the Far East. Westinghouse Electric, Pittsburgh, subsequently acquired rights for the Americas.\nThrough legal agreements, III then contracted with other companies and distributors.\nOver time, Valour (DiskWorks) replaced competing products  acquired by Dowling Associates of Dublin, Ohio.\nReferences"
    }
  ]
}