{
  "content": [
    {
      "type": "text",
      "text": "# Vance Warner\n\n| birth_place = Leeds, England\n| height = 5 ft 11 in\n| position = Central defender\n| youthyears1 = 1991–1994\n| youthclubs1 = Nottingham Forest\n| years1 = 1994–1997\n| years2 = 1996\n| years3 = 1997\n| years4 = 1997–2000\n| clubs1 = Nottingham Forest\n| clubs2 = → Grimsby Town (loan)\n| clubs3 = → Rotherham United (loan)\n| clubs4 = Rotherham United\n| caps1 = 5\n| caps2 = 3\n| caps3 = 9\n| caps4 = 54\n| totalcaps = 71\n| goals1 = 0\n| goals2 = 0\n| goals3 = 0\n| goals4 = 1\n| totalgoals = 1\n| nationalyears1 = 1992\n| nationalteam1 = England U18\n| nationalcaps1 = 1\n| nationalgoals1 = 0\n| club-update =\n| ntupdate =\n}}\nVance Warner (born 3 September 1974) is an English former professional footballer who played as a defender from 1994 until 2000 notably for Nottingham Forest, as well as appearing for Grimsby Town and Rotherham United.\nCareer\nNottingham Forest\nWarner came through the youth ranks at Nottingham Forest under Frank Clark. Despite being touted as \"the new Des Walker\", Warner struggled to break into the first team and spent time on loan with Grimsby Town during the 1995–1996 season who were managed by Warner's former teammate Brian Laws. He played 3 times for Grimsby before returning to the City Ground in April 1996.\nRotherham United\nFollowing a two-month loan spell with Rotherham United at the start of the 1997–1998 season, Ronnie Moore convinced Warner to sign for the club on a free transfer in November 1997. Warner played 63 times in league and cup competitions during his time with United, scoring 1 goal on 8 August 1998 in a 3–1 home win over Hull City. He had a memorable chant of 'Ooh Vancey Warner' & was noted for his quick pace & uncompromising tackling style. Warner was released by United in the summer of 2000 after spending three seasons with The Millers.\nInternational career\nIn October 1992, Warner made one appearance for England U18, starting in a 2–0 defeat in a friendly against France.\nPersonal life\nWarner although not officially retiring didn't return to football following his release from Rotherham and since then he has worked for BT.\nSince retiring from professional football, he has been working as a level 7 referee for the Sheffield & Hallamshire County Football Association & was named Sheffield & Hallamshire County FA Team Official of the Year in the England Football Grassroots Football Awards 2023.\nAn active charity fundraiser, Warner ran 3,244 miles over 2 years (2018–2020) to raise money for Teenage Cancer Trust and in memory of the Nottingham Forest youth team coach, John Perkins, who died in 2016.\nHe completed the '1 Million Steps in March for Clare' challenge in March 2022, walking 1,014,692 steps over 550 miles in 31 days, to raise money for Nottingham University Hospitals Charity and in memory of a friend, Clare Doran, who died in 2021.\nReferences\nExternal links\n*\n* [https://www.allfootballers.com Since 1888... The Searchable Premiership and Football League Player Database] (subscription required)"
    }
  ]
}