{
  "content": [
    {
      "type": "text",
      "text": "# Vanity award\n\nA vanity award is an award in which the recipient purchases the award to give the false appearance of a legitimate honor and achievement. In some countries, those conferring awards may seek \"sponsorship fees,\" \"dinner fees,\" charity donations, and other financial \"contributions\" to avoid the perception that the award has not been \"bought.\" Some organizations also provide marketing and advertising services in exchange for these fees, in addition to receiving the award. Similarly, some organizations may grant awards to prominent personalities \"for free\" to enhance the award's perceived legitimacy, regardless of whether the individuals personally accept the award. To further enhance the image of validity and prestige, they notably incorporate superlatives such as \"World,\" \"Asia,\" \"Best,\" \"Excellence,\" \"Top,\" \"Global\", \"Star\", and similar terms in the name of their award-giving body.\nCompared to legitimate award-giving bodies, where nominated candidates are screened by a panel of reputable and relevant adjudicators, the awardees in these cases are often selected either personally by the body's leaders, through surveys or similar research methodologies that are insufficient and questionable, or based on the amount of their financial contributions.\nWhile many of these awards operate legally in their respective countries and do not violate specific laws, many in business circles and experts deem these schemes to be scams.\nVanity business awards\nThe number of vanity awards for businesses is considerable, since 2008 the Better Business Bureau has been issuing warnings about schemes found across the United States and Canada. \"Phony vanity awards prey on small businesses who are trying to make their companies stand out in their industry.\"\nFor instance, The Best of Business Award by the Small Business Commerce Association is available for $57 to $157 depending if the applicant would like a plaque or a trophy. The Better Business Bureau reports the same scheme under multiple variants of a common name in multiple cities, targeting businesses in hundreds of categories, so \"Peoria Award Program\", \"Memphis Award Program\", and \"Lafayette Awards Program\" are the same operation. The solicitation, which claims to be an award from \"Kelly McCartney,\nAward Committee\", is a message in which only the year, town and line of business change:\n:I am pleased to announce that (Company) has been selected as a winner of the  Best of (Town) Awards in the (line of business) category by the (Town) Award Program committee.\n:Our selection of your company is a reflection of the hard work of not only yourself, but of many people that have supported your business and contributed to the subsequent success of your organization. Congratulations on joining such an elite group of small businesses.\n:In recognition of your achievement, we offer a variety of ways for you to help promote your business. You automatically receive the complimentary digital award image from this email and a copy of the press release publicizing the selection of (Company) which is posted on our website. The (Town) Award Program hereby grants (Company) a nonexclusive, royalty-free license to use, reproduce, distribute, and display this press release and the digital award image in any media formats and through any media channels.\n:Additionally, as a winner of the  Best of (Town) Awards selection, you may select a customized award which has been designed for display at your place of business by following the simple steps on the  Best of (Town) Awards order form.\nThe associated website (which offers the mark an opportunity to purchase a plaque, a crystal award or both at a cost ranging from $80 to $200) is alleged to contain malware.\nNonetheless, businesses continue to issue press releases boasting of having received these awards despite their questionable provenance and meaninglessly broad selection of large numbers of cities and categories.\nList of vanity business awards by country\nThe following are various awarding schemes, as reported by various businesses on the internet:\nAustralia\n* The Globals\nPhilippines\n* Asia's Man & Woman of the Year Award\n* Asia Pacific Luminare Awards\n* Asian Pillars Award\n* Best Choice Awards\n* Golden Globe Annual Awards for Business Excellence\n* People's Choice Excellence Awards\n* Philippines Distinct Men & Women of Excellence\n* The World Class Global Awards\nSingapore\n* Vision Media - Prestige 100 Singapore Awards\n* Vision Media - Top Business Service & Quality Awards\n* SME Excellence Business Award\n* Singapore Excellence Award.\nUkraine\n* The International Socrates Award\nUnited Kingdom\n* Acquisition International (owned by AI Global Media\n* Build News (owned by AI Global Media)\n* Corporate Vision (owned by AI Global Media\n* TMT News (owned by AI Global Media)\n* Wealth & Finance International  (owned by AI Global Media)\nUnited States and Canada\n* Better Business Bureau A+ Ratings, United States and Canada\nList of vanity business awards (from the OCCRP reports)\nThere are studies on vanity business awards showing that a significant wealth has been acquired by the companies organizing lucrative ceremonies and giving out well-decorated trophies not based on merit, but rather to whoever pays the cost. The Organized Crime and Corruption Reporting Project (OCCRP) and other news organizations have reported the following as trophy-for-sale organizations:\n* Actualidad Magazine, Madrid, Spain\n* Global Trade Leaders' Club (GTLC)\n* Otherways Management Association Club (OMAC)\n* The Europe Business Assembly (EBA), Oxford, United Kingdom\n* The Business Initiative Directions (BID), Madrid, Spain\n* The European Society for Quality Research (ESQR), Lausanne, Switzerland\nVanity book awards\nThe vanity award phenomenon among book awards was noted in a Salon article by Laura Miller in 2009. Vanity book awards are characterized by dozens (or more) of categories to ensure that most applicants are winners or finalists. Other characteristics include high entry fees, or fees for other services such as trophies, prominent display on the award websites or promises of marketing. Self-published authors seeking promotions and recognitions are common customers of vanity award services. Pitches for ''Who's Who-type publications (see vanity press), biographies or nominations for awards or special memberships can have a catch to them in which the honoree is required to pay for recognition.\nList of vanity book awards\nThe following have been called vanity awards.\n* The 2009 National \"Best Books\" Awards given by USA Book News — In the Salon'' article \"Vanity book awards\" by Laura Miller. The 2009 National \"Best Books\" Awards is identified as a Los Angeles contest run by the marketing company JPX Media. According to Miller, every winner or finalist (i.e. everyone who enters and pays the $69 fee) receives stickers to put on their book covers and \"aggressive marketing\" from JPX Media.\n* The 2010 Creative Spirit Awards were made available to film makers, musicians, and writers for an entry fee of $50 in hundreds of categories.\nOther awards target self-published authors with high entry fees, with for-profit business models and numerous categories and promises of marketing include the Readers Favorite Awards, and the IndieReader Discovery Awards.\nAnthology schemes\nThe anthology scheme is when a writing contest is announced with the winners to be published in an anthology and a cash prize is awarded. There may be no entry fee, but in some cases there is little selectivity, and successful entries may be offered publication, with a request for money. Furthermore, the anthology is often not sold to the public but only in limited runs to the contributors themselves. The International Library of Poetry, known online as Poetry.com, is an example of this kinds of scheme. Another version of the scheme is called \"pay to play\" in which the writer must pay to be included in the anthology.\nFee for review\nA \"fee for review\" is when money, merchandise or a service is exchanged in return for a review. Since an exchange is involved, the neutrality and accuracy of the review could be in question. Reviews could be written by marketers/retailers about their own work, by customers with some incentive such as a friend or family or receiving free merchandise or money, or the reviewer was simply hired as a third-party service specializing in providing reviews for a fee. An example of a hired service is Foreword Reviews' Clarion Reviews, which was launched in 2001 and claims to be \"the industry's first and most trusted fee-for-review service for indie and self-publishers.\" Other fee-for review programs include Kirkus Reviews Indie Review program and City Book Review, publisher of the San Francisco Book Review, Manhattan Book Review, Seattle Book Review and ''Kids' BookBuzz.\nIn popular culture\nTV Shows\n* The Montgomery Burns Award for Outstanding Achievement in the Field of Excellence''\nSee also\n*Académie Parisienne des Inventeurs\nReferences"
    }
  ]
}