{
  "content": [
    {
      "type": "text",
      "text": "# Varnika Kundu stalking case__disambig_1\n\nThe Varnika Kundu stalking case refers to an incident on 4 August 2017, in Chandigarh, India, where Varnika Kundu, a disc jockey, was allegedly stalked and harassed by Vikas Barala, son of a Haryana politician, and his friend Ashish Kumar. The case gained national attention due to its implications for women’s safety, allegations of political influence, and a subsequent controversy in 2025 over Barala’s brief appointment as an Assistant Advocate General (AAG). Kundu’s viral social media post and the #AintNoCinderella hashtag sparked widespread public discourse, highlighting issues of gender-based violence and judicial delays. As of August 2025, the trial remains ongoing, with no final verdict.\nIncident\nOn the night of 4 August 2017, Varnika Kundu, then 29, was driving home in Chandigarh around midnight when she noticed a white Ford Endeavour SUV following her for approximately five kilometers.\nAccording to her First Information Report (FIR), the occupants, Vikas Barala, son of BJP leader Subhash Barala and his friend Ashish Kumar, attempted to block her path, tailgated her vehicle, and made gestures suggesting an intent to approach or enter her car.\nKundu, daughter of former Haryana IAS officer VS Kundu, contacted the Chandigarh Police via the emergency helpline, leading to the apprehension of the accused near Sector 26.\nIn a detailed Facebook post, Kundu described the incident as terrifying, alleging the accused were intoxicated and attempted to intimidate her.\nCCTV footage from Sector 9 confirmed the accused purchasing alcohol earlier that evening, supporting claims of intoxication.\nLegal proceedings\nOn 5 August 2017, the Chandigarh Police registered an FIR against Vikas Barala and Ashish Kumar under Sections 354D (stalking) and 341 (wrongful restraint) of the Indian Penal Code (IPC), and Section 185 of the Motor Vehicles Act (drunk driving).\nThese were initially bailable offenses, and the accused were released within a few hours after arrest.\nFollowing public outcry and accusations of lenient handling, non-bailable charges under IPC Sections 365 (attempted abduction) and 511 (attempt to commit offences) were added on 9 August 2017. The accused were rearrested after failing to appear for a police summons.\nOn 22 September 2017, a 300-page chargesheet was filed, supported by 48 pieces of evidence, including CCTV footage, Kundu’s testimony, her father’s statement, and accounts from PCR personnel and a friend on the phone during the incident.\nThe trial began on 13 October 2017, in a Chandigarh judicial magistrate court.\nVikas Barala, lodged in Burail Jail for five months, was granted bail on 11 January 2018, by the Punjab and Haryana High Court, with conditions not to influence the trial or contact Kundu.\nAs of August 2025, the trial remains ongoing, with over 100 hearings completed, prosecution evidence presented, and defense witness examination underway.\nPublic and political reaction\nThe case sparked widespread outrage across India, fueled by Kundu’s viral Facebook post and the #AintNoCinderella hashtag, where women shared photos of being out at night to challenge victim-blaming.\nThe incident, compared to the Bollywood film Pink (2016) for its depiction of stalking, raised concerns about women’s safety and privilege in India.\nOpposition parties, including Congress and the Indian National Lok Dal, criticised the BJP for alleged leniency.\nVikas Barala’s father, Subhash Barala, then-president of the Haryana Bharatiya Janata Party (BJP), faced accusations of influencing the police to initially file bailable charges, which he and Chandigarh DGP Tejinder Singh Luthra denied.\nIn July 2025, the case regained attention when Vikas Barala was appointed an Assistant Advocate General by the Haryana government, prompting backlash.\nVarnika Kundu condemned the decision on Instagram, stating it reflected poorly on the government’s values.\nForty-seven retired IAS officers wrote to Haryana Chief minister Nayab Singh Saini, arguing the appointment undermined the \"Beti Bachao, Beti Padhao\" initiative.\nSocietal impact\nThe case highlighted systemic issues in India, including judicial delays, with Kundu noting her \"wavering faith\" in the legal system due to the trial’s eight-year duration.\nIt fueled discussions on women’s safety, particularly for those traveling alone at night, and the influence of political connections in legal processes.\nThe #AintNoCinderella movement inspired women to assert their right to public spaces, gaining traction across social media platforms.\nThe 2025 AAG controversy further underscored tensions between political privilege and accountability, with media framing the case as a test of India’s commitment to gender justice.\nReferences"
    }
  ]
}