{
  "content": [
    {
      "type": "text",
      "text": "# Vasant Bunwaree\n\n| birth_place = Rivière du Rempart, Mauritius\n| party = MSM, Mauritius Labour Party\n| website = [http://www.gov.mu/portal/site/AssemblySite/menuitem.3bef52ce598560451251701065c521ca/?content_id=deb8c0307fc8c010VgnVCM1000000a04a8c0RCRD]\n| occupation = Physician - Cardiology\n}}\nVasant Kumar Bunwaree (born वसन्त कुमर बुन्वरी on 7 April 1947) is a former Cabinet Minister of Mauritius. He is more commonly known as Vasant Bunwaree.\nEarly life, education & medical career\nAfter completing his secondary education at Royal College Port Louis he worked as principal and teacher of private secondary school Collège Idéal in Rivière du Rempart for two years. He then studied medicine in France at the University of Bordeaux II and was appointed \"Docteur en Medicine\" in 1977. He later specialised and obtained the \"Certificat d'Edudes spéciales en maladies cardiovasculaires\" in 1981. He also hold diplomas in Tropical Medicine as well as Human Cytogenetics. In 1982 he joined the government service as the first Specialist in Cardiology with the Ministry of Health and was posted to Victoria Hospital, Mauritius. As Cardiologist, Dr. Bunwaree was responsible for the setting up of a full-fledged ICU and Diagnostic Cardiac Unit at the Sir Seewoosagur Ramgoolam National Hospital in view of starting permanent cardiac surgery centre in Mauritius.\nPolitical career\nVasant Bunwaree's political career started in April 1987 when the Prime Minister Anerood Jugnauth announced by-elections in Constituencies 12 (Mahébourg-Plaine-Magnien) and 13 (Rivière-des-Anguilles-Souillac). Jugnauth presented Vasant Bunwaree and socio-cultural activist Dhandeo Bahadoor of the Human Service Trust as candidates of the Militant Socialist Movement (MSM). However these by-elections were not held as General Elections were held in August 1987, as a result of which Bunwaree was elected in Constituency No.12.\nHe later joined the Mauritian Labour Party where he served as the Vice President and Secretary General. Dr. Bunwaree was also elected as a Member of Parliament in 1991, 1995, 2005 and 2010 in Constituency No 12, Mahebourg and Plaine Magnien.\nHe was Minister of Education from 13 September 2008 to December 2014. He had previously held the office of Finance Minister from November 1996 to September 2000 and also Minister of Labour from 2005 to 2008.\nReferences"
    }
  ]
}