{
  "content": [
    {
      "type": "text",
      "text": "# Vedapureeswarar Temple, Cheyyar\n\n| other_names        =\n| proper_name        =\n| country            = India\n| state     = Tamil Nadu\n| district           = Tiruvannamalai\n| locale             = Tamil Nadu, India\n| elevation_m        =\n| deity      = Vedapureeswarar(Shiva)\n| festivals=\n| architecture       = Dravidian architecture\n| temple_quantity  =\n| monument_quantity=\n| inscriptions       =\n| year_completed         =\n| creator            =\n| website            =\n}}\nVedapureeswarar temple is a sacred place on the northern banks of the Cheyyar River in the  Tiruvannamalai District near Kanchipuram in the state of Tamil Nadu in South India.   This sacred place is now known as Cheyyar but was previously called Thiruvothur. This is one of the important towns in Thiruvanamalai district. It includes a sub-collector office, taluk office, two courts and a special prison.\nHistory\nIt is one of the shrines of the 275 Paadal Petra Sthalams. The temple is devoted to  Lord Vedapuresswarar who came here and imparted his spiritual knowledge regarding the Vedas. According to legend, it is in this sacred place that Saint Thirugnanasambanthar used his holy miraculous powers and transformed a male palm tree into a female palm tree. Arunagirinathar, a devotee of Lord Muruga worshipped the Lord in this temple. According to popular legend, when the Saivite saint Sambandhar visited Therazhundur, he could not distinguish the temple from the neighbouring Sri Devaadi Raja Perumal Temple dedicated to Vishnu. At that instant, Ganesha is believed to have manifested before Sampandhar and pointed out the Shiva temple to him.\nUnique Features\nThis temple has a few unique distinctions. The Nandi, which usually faces the Shiva Lingam, is facing the opposite direction. One can also worship all the Pancha Bootha (lingams) in this temple.\nFestivals\nThe devotees of the temple and the natives of the town celebrate a festival every year with street processions which spans 10 days, called Brahmmotsavam. The 6th, 7th and 10th days of the festival are celebrated in a grand manner.\n7th day function is celebrated in grand manner called Thiruther vaibhavam. It is the main day of festival. The 10th day function is celebrated at night.\nSee also\n*Cheyyar\nReferences"
    }
  ]
}