{
  "content": [
    {
      "type": "text",
      "text": "# Vertue Rewarded\n\nVirtue Rewarded}}\nVertue Rewarded; or, The Irish Princess is a 1693 novel. Published in London, it is one of the earliest examples of Irish prose fiction in the English language.\nTwo original copies survive; one in the Bodleian Library and one in the British Museum.\nPlot summary\nThe novel opens with a quote from William D'Avenant's Gondibert (1651).\nSet in Clonmel, Ireland in August 1690, the young Irish Protestant woman Marinda is romanced by a European prince in the army of William of Orange.\nThere are two interpolated tales: one about the Irish princess Cluaneesha (set in pre-Norman Ireland) and one about Faniaca, an indigenous American living through the Spanish conquest of the Inca Empire.\nLiterary significance and criticism\nProf Hubert McDermott has suggested the work as a possible inspiration for Samuel Richardson's Pamela; or, Virtue Rewarded (1740), considered the first major English novel – the two books have similar plots: \"a beautiful and virtuous young woman of little or no social status falls in love with a prince or libertine who is equally besotted but whose wealth, rank and ambition make him desire only to seduce and debauch the chaste heroine, without having to marry her.\" Also, the title \"virtue rewarded\" is not found in any other work of the period.\nIan Campbell Ross has noted similarities with Oroonoko, both books mixing romance, history and folklore.\nJohn Wilson Foster wrote on how Vertue Rewarded excludes the \"wild Irish\" from its world (Marinda is an English-speaking Protestant, and presumably of English ancestry), and notes how the Peru story \"reinforces the impression of dislocated exotica.\" Vertue Rewarded is assumed to have been written by one of the British planters who settled in Ireland after the Williamite conquest, and has been described as anti-Irish propaganda.\nReferences\nExternal links\n*[https://quod.lib.umich.edu/e/eebo/A65126.0001.001?rgn=main;view=fulltext Full text] on the University of Michigan website"
    }
  ]
}