{
  "content": [
    {
      "type": "text",
      "text": "# Veterans of Foreign Wars Parkway\n\n| length_notes            =\n| width                   =\n| area                    =\n| addresses               =\n| location                = Boston, Massachusetts\n| postal_code             =\n| metro                   =\n| coordinates             =\n| direction_a             = South\n| terminus_a              = Boston-Providence Highway in West Roxbury\n| direction_b             = North\n| terminus_b              = Centre Street in West Roxbury\n| junction                =  in West Roxbury\n| north                   =\n| east                    =\n| south                   =\n| west                    =\n| cost                    =\n| references              =\n| commissioning_date      =\n| construction_start_date =\n| completion_date         =\n| inauguration_date       =\n| demolition_date         =\n| designer                =\n| known_for               =\n| status                  =\n| website                 =\n| embedded =\n| locmapin = Massachusetts#USA\n| area =\n| built = 1931\n| architect = Charles Eliot, Olmsted Brothers\n| architecture =\n| added = January 5, 2005\n| mpsub = Metropolitan Park System of Greater Boston MPS\n| refnum = 04001432\n}}\n}}\nThe Veterans of Foreign Wars Parkway (referred to locally as the VFW Parkway) is a historic parkway in Boston, Massachusetts.  The southern terminus of the parkway is at Washington Street at the Dedham-West Roxbury border, from where it travels north and then east, ending at a junction with Centre Street, near the Arnold Arboretum.  The highway is almost entirely contained within the West Roxbury neighborhood, although it passes through part of the Chestnut Hill neighborhood near its junction with the West Roxbury Parkway.  Most of its length, from Spring Street in West Roxbury to its eastern end, is administered by the Massachusetts Department of Conservation and Recreation (DCR), a successor to the Metropolitan District Commission (MDC) which oversaw the road's construction.  The parkway was built in stages between 1930 and 1942, and was designed to provide a parkway connection from the Upper Charles River Reservation to other MDC parks via the West Roxbury Parkway.  The DCR portion of the road was listed on the National Register of Historic Places in 2005.  The road formerly carried the designation for U.S. Route 1.\nRoute description\nThe parkway begins at an intersection with Washington Street and Boston-Providence Highway in Dedham, essentially as a northward continuation of Providence Highway.  It soon crosses into Boston, reaching a major junction near the Charles River with Bridge Street (the eastern terminus of Massachusetts Route 109) and Spring Street, where it takes on a more noticeably landscaped setting. It continues generally northward, flanking parkland adjacent to the river on its left.  It crosses the Needham Line of the MBTA Commuter Rail before turning more generally eastward near the junction with Baker Street.  It intersects with LaGrange Street and Corey Street before turning eastward, forming the border between the West Roxbury and Chestnut Hill areas for the remainder of the route. It passes by the Hancock Village development on its left, before meeting the West Roxbury Parkway at the Frank R. Kelly Memorial Rotary in Chestnut Hill.  It then passes the Allandale Woods on its left before reaching its eastern end at Centre Street, a short way west of the Arnold Arboretum.\nHistory\nThe parkway was constructed in three stages.  The first section, built between 1931 and 1938, connected Spring Street to the West Roxbury Parkway.  In 1941 the southern extension to Washington Street was added, and the eastern connection to Centre Street was built in 1942.  The initial construction phase resulted in a two-lane road separated by a median and lined with trees.  Many of these trees are still standing, providing a canopy over the roadway.  A drainage system was installed in the Baker Street area in 1939, and the southbound lanes south of West Roxbury Parkway were reconstructed in 1941.  The eastern section of the parkway was built the following year on the right-of-way of an existing city street.  Changes to the parkway have been minimal since its construction; repairs have been made with similar materials.\nMajor intersections\nThe entire route is in Boston, Suffolk County.\n|notes=Eastern terminus of Route 109\n}}\nSee also\n*\n*\n* National Register of Historic Places listings in Norfolk County, Massachusetts\n* National Register of Historic Places listings in southern Boston, Massachusetts\n* National Register of Historic Places listings in Brookline, Massachusetts\nReferences"
    }
  ]
}