{
  "content": [
    {
      "type": "text",
      "text": "# Vicksburg: The War for the West\n\n| illustrator =\n| publisher =  Rand Game Associates\n| date =  1975\n| genre =  American Civil War}}\nVicksburg: The War for the West is a board wargame published by Rand Game Associates in 1975 that simulates the Western theater of the American Civil War from late 1861 to the Siege of Vicksburg.\nBackground\nThe Union strategy in the Western theater of the American Civil War was to eliminate Confederate forts on major rivers, and then use the undefended rivers to move men and supplies further into the Confederacy. This culminated in Ulysses S. Grant’s siege of Vicksburg, the last Confederate strongpoint on the Mississippi River.\nDescription\nVicksburg is a two-player board wargame in which one player controls Union forces and the other player controls Confederate forces. The hex grid map covers the Mississippi from Commerce, Illinois to Baton Rouge.\nThe game comes with four shorter scenarios covering various periods of the Western Campaign from late 1861 until the fall of Vicksburg in mid-1863, and a long 44-turn campaign game that combines all of the shorter scenarios.\nStrategy\nCritic Richard Berg found supply was the focus of the game, and found that “the game becomes a series of forays against possible weak links in the opponent’s supply network, while attempting to extend and strengthen one’s own.” Berg suggested that “The ability of the extensive Union naval and riverine contingent is of inestimable value here, and the Northern Player who can best use these invaluable and fast-moving units to bottle up the South will be a victorious Player.”\nPublication history\nVicksburg was designed by the team of John Prados, Albert Nofi and Jim Cumbo, and was published by Rand Game Associates in 1975.\nReception\nIn Issue 25 of Moves, Richard Berg found the game \"well-produced and physically attractive ... Essentially, the game is nothing out of the ordinary; there are no blazing innovations or startling new concepts. There is just a lot of good, solid research and a desire to produce a playable game that provides a maximum of historical output, within the given framework.\" Berg liked the short scenarios, calling them \"convenient\"; conversely he found the campaign game \"a rather long affair\" that simply reiterated the problems and strategies of the shorter scenarios. Berg suggested that because of the emphasis on supply, \"the ability of the Player to plan ahead, to create diversions and then to strike where least expected is magnified.\" Berg concluded, \"It is certainly well worth the (relatively) inexpensive price tag.\"\nIn a 1976 poll conducted by Simulations Publications Inc. to determine the most popular board wargames in North America, Vicksburgplaced 109th out of 202 games.\nIn the 1977 book The Comprehensive Guide to Board Wargaming, Charles Vasey pointed that the \"Special importance of river flotillas, fortresses and supply depots is brought out.\" Vasey liked the Union strategy of building outflanking canals, and noted that the game has a \"Moderate complexity.\"\nOther reviews and commentary\n* Battle Plan #3\n* Campaign #77\n* Fire & Movement #82\n* Strategy & Tactics #43\nReferences"
    }
  ]
}