{
  "content": [
    {
      "type": "text",
      "text": "# Victorious Boxers: Revolution\n\n| series = Hajime no Ippo\n| released = }}\n| genre = Sports, fighting\n| modes = Single-player, multiplayer\n| platforms = Wii\n}}\nVictorious Boxers: Revolution, known as  in Japan and Victorious Boxers: Challenge in PAL regions, is a boxing video game developed by Grandprix and Cavia and published by AQ Interactive for the Wii. The game is based on George Morikawa's manga series Hajime no Ippo. Players are able to use the Wii controller to mimic boxing moves and knock out the opponent. The game was released in Japan on June 21, 2007 and in North America on October 23, 2007.\nGameplay\nThe gameplay in Victorious Boxers: Revolution features arcade style boxing with 3D character models fighting each other within a boxing ring. The player controls the character via a third person view with the camera behind the transparent character. Players are able to execute offensive moves like jabs, straights, hooks, and uppercuts. Defensive moves ducking and swaying are also available. In between rounds, the game displays the number of punches that have landed. Unlike the previous Victorious Boxers games, Revolutions features a head ups display for the time and damage. The damage meter is also used to charge up special attacks. The game has three different modes of gameplay; a story mode, a sparring mode, and a tutorial mode. Revolutions also features three difficulty settings.\nPlayer input\nThe game has three distinct methods for the player to control characters, two of which feature motion control. The first is similar to the Wii Sports' boxing in that the player holds the remote and nunchuk in their hands and throw punches. The player is able to control the characters' upper body movement as well as the lower body movement. The second is a point and click method which involves the player using the remote to draw patterns in the air while holding down the \"A\" button. The third allows the player to use either a Wii Classic Controller or a GameCube controller to control the characters.\nPlot and setting\nRevolutions is set in Tokyo, Japan. The gameplay takes place in various boxing arenas and is different from its predecessors in that it features boxing venues around the world including Sydney City Arena, Las Vegas Palace and Korakuen Hall.\nCharacters\nLike previous Victorious Boxers video games, there is a wide selection of characters from the manga series. The game's main protagonist is Ippo Makunouchi and features a total of 25 playable characters, many with special moves that their character in the manga series utilized in fights. Initially, there are only five available characters; the remaining characters are unlocked through the story mode. Many of the main characters from the series are included.\nStory\nRevolutions story mode follows the boxing career of the main character, Ippo Makunouchi, which unfolds via cutscenes. Ippo is a shy high school student who begins boxing at the Kamogawa Gym after being bullied.\nDevelopment\nThe motion control system was tested on people with no boxing experience as well as professional boxers. On July 31, 2007, Xseed announced that it had acquired the rights to publish the game in North American and planned to release it Fall 2007.\nReception\n| GSpot = 6/10\n| GameZone = 6.5/10\n}}\nPrior to Revolutions overseas release, it received an initial positive reception in North America. GameSpot has stated that the story should be pleasing to fans of the manga series. They have also stated that the controls are the \"real hook in the game\". 1UP.com stated that the \"fluid hand-drawn anime style is a welcome addition.\" Prior to the announcement of its North American release, they stated that it was a fun game that \"might deserve a place in your Japanese Wii import library.\"\nAfter hands on previews and its release, it received mixed reviews. A common complaint was the game forcing a loss in the story mode to progress the plot. 1UP.com stated that the controls are not that accurate at emulating real punches. GameSpot praised the unique blend of a story and career mode, and commented how closely the game matched the style of the anime. They criticized the motion controls and the voice acting. Game Informer commented that the difficulty was erratic and the story had been poorly trimmed down. They complimented the motion controls, but stated that players would need to \"warm up to them\". GameZone referred to Revolutions as a \"soap opera-heavy anime game.\" They stated the gameplay was better than the story and rated it 7/10. They also praised the number of control options and commented that it's not the next big thing, but it is a solid title.\nReferences\nExternal links\n*[http://www.victoriousboxersrevolution.com Official English website]"
    }
  ]
}