{
  "content": [
    {
      "type": "text",
      "text": "# Victoria Square, Woking\n\n| status           = complete\n| start_date       = June 2017\n| completion_date  = August 2022\n| opening_date     =\n| building_type    = ResidentialHotelRetail\n| antenna_spire    =\n| roof             =\n| top_floor        =\n| floor_count      = 34\n| elevator_count   =\n| cost             = £700&nbsp;million\n| floor_area       =\n| architect        = Benoy\n| structural_engineer =\n| main_contractor  = Sir Robert McAlpine\n| developer        = Woking Borough CouncilMoyallen Group\n| owner            =\n| management       =\n}}\nVictoria Square is a residential skyscraper complex and wider town centre redevelopment project in Woking, Surrey, England. Upon topping out in September&nbsp;2019, Tower 1 of the complex became the tallest building in Woking, overtaking Export House. Construction commenced in June&nbsp;2017 and, following delays related to the COVID-19 pandemic, completed in August&nbsp;2022. The total construction cost of the project was £700&nbsp;million.\nConstruction\nVictoria Square was constructed on the site of a seven-storey office building known as Circle 7, on a site bounded by Victoria Way to the west, the railway line leading to Woking railway station to the south, and Woking town centre to the east and north. Three towers were constructed as part of the development. The tallest two skyscrapers, Tower 1 and Tower 2, are both residential in nature and consist of 34 and 32 storeys, rising to a height of  and  respectively. The third building, Tower 3, contains a Hilton Hotel rising to 23 storeys and a height of . The two buildings taller than  make Woking the smallest settlement in the United Kingdom to have a skyscraper. tall. Any building from  tall is generally considered to be a high-rise building.}}\nAdditional construction as part of the Victoria Square development included a plant-covered multistorey car park containing the tallest spiral ramps in the United Kingdom, a ground-level shopping centre extension named Victoria Place (formerly The Peacocks) linked to the nearby High Street, a flagship Marks & Spencer food hall on the ground floor of Tower 1, new bus stops at the western end of the High Street Link Road, and public spaces including a square.\nHistory\nDuring Storm Aurore on 20&nbsp;October&nbsp;2021, three cladding panels from the under construction Hilton Hotel blew away from the façade of the building and fell to the street; there were no injuries. Victoria Way was closed as a precaution until February&nbsp;2022 while more than 2,000 cladding panels on the hotel received additional reinforcement, further delaying construction of Victoria Square.\nNotes\nReferences"
    }
  ]
}