{
  "content": [
    {
      "type": "text",
      "text": "# Victorian Community History Awards\n\nThe Victorian Community History Awards are held annually to recognise the contributions made by Victorians in the preservation of the State's history, and to recognise excellence in historical research. The effect of the VCHA over the period from 1998 to the present has been the stimulation of community history, the lifting of standards and the fostering of diversity and originality.\nHistory\nThe Victorian Community History Awards were established and sponsored in 1997 by  Information Victoria. The judges have always been appointed by the Royal Historical Society of Victoria, and among the first were Professor Weston Bate, Professor A. G. L. Shaw, and senior journalist at The Age, John Lahey.\nFunding was suspended in 2006 to provide additional funds for the Commonwealth Games in Melbourne.  After 2010 Information Victoria Bookshop withdrew support for the program, but after a vigorous campaign by the RHSV for the continuance of the Awards, the Baillieu government accepted a submission from the Public Record Office Victoria (PROV) to continue the program for a further four-year period.\nFrom 2011 the Awards were administered by the RHSV in partnership with PROV.\nIn 2012, following consultation between the Public Record Office Victoria and the Royal Historical Society of Victoria, award categories were slightly altered and renamed, as below:\nVictorian Community History Awards winners, from 2012\nVictorian Premier's History Award\n* 2023: Carmel McKenzie for St Kilda 1841-1900: movers and shakers and money-makers\n* 2022: Janet McCalman for Vandemonians: The Repressed History of Colonial Victoria\n* 2021: Alec Morgan, Tiriki Onus and Tom Zubrycki for Ablaze – A Feature Documentary\n*2020: Amanda Scardamaglia for  Printed on Stone: The lithographs of Charles Troedel\n*2019: Phil Roberts for Avenue of Memories\n* 2018: Jill Giese for The Maddest Place on Earth\n* 2017: John Burch for Returning the Kulkyne\n* 2016: Pam Baragwanath and Ken James for ''These Walls Speak Volumes. A History of Mechanics' Institutes in Victoria\n* 2015: Meredith Fletcher for Jean Galbraith: writer in a valley\n* 2014: Anne Vale for Exceptional Australian Garden Makers\n* 2013: Robin A Vowels for Victoria’s Iron Lacework The Founders, Part A\n* 2012: Maree Coote for The Art of being Melbourne\nHistory Publication Award\n* 2023: Kath Kenny for Staging a revolution: when Betty rocked the pram\n* 2022: Barbara Minchinton for The women of Little Lon\n* 2021: Michael McCarthy for In the Shadow of the Prom\n*2020: Brian Rhule for Maldon: A New History 1853-1928\n*2019: Carolyn Rasmussen for The Blackburns: Private lives, public ambition\n* 2018: Gregory C. Eccleston for Granville Stapylton: Australia Felix 1836, Second in Command to Major Mitchell\n* 2017: John Barnes for La Trobe. Traveller, Writer, Governor\n* 2016: Rozzi Bazzani for Hector: the story of Hector Crawford and Crawford Productions\n* 2015: Lucy Sussex for Blockbuster! Fergus Hume & the mystery of the hansom cab\n* 2014: Robert Kenny for Gardens of Fire: an investigative memoir\n* 2013: Olwen Ford for Harvester City: the making of multicultural Sunshine 1939–1975\n* 2012: Paul Strangio for Neither Power Nor Glory: 100 Years of political Labor in Victoria, 1856–1956''\nSpecial awards\n* 2023: Judges' Special Prize - John Cary for Frontier Magistrate: the enigmatic Foster Fyans\n* 2022: Judges' Special Prize - Dr David Rowe for About Corayo: a thematic history of Greater Geelong\n* 2021: Paul Paffen for For the Fallen: The 1921-1922 Melbourne Public Library Mural Competition within the setting of Decorative Painting in Australian Art\n*2021: Richard Broinowski for Under the Rainbow: The Life and Times of EW Cole\n*2020: Nick Anchen for Visions of Victoria: The Magic of Kodachrome Film 1950–1975\n*2019: Chloe Hooper for The Arsonist: A Mind on Fire and David Sornig for Blue Lake: Finding Dudley Flats and the West Melbourne swamp\n* 2018: Jennifer Bantow and Ros Lewis for Barro-abil Our Beautiful Barrabool Stone: History and Use of Barrabool Sandstone\n* 2017: Michael Morrison and Lisa Clausen for Cruden Farm Garden Diaries\n* 2016: Magda Szubanski for Reckoning: A Memoir\n* 2015: Graeme Davison for ''Lost Relations: fortunes of my family in Australia's Golden Age\n* 2014: Mornington Peninsula Local History Network and Lavender Hill Multimedia for Postcards: Stories from the Mornington Peninsula'' (DVD)\n* 2013: Judges' Special Prize for Excellence - Rod Charles for A Whirr of Many Wheels. Cycling in Geelong: A chronicle from 1869 to 1980 Volume 1: 1869 to 1914\n* 2012: Judges' Special Prize for Excellence - Lorne Historical Society & Lorne Aireys Inlet P-12 College VCAL Students for Construction of The Great Ocean Road DVD\nOral History Award (from 2019)\n* 2023: Richard Lowenstein and Martie Lowenstein for ''Don't Be Too Polite Girls\n* 2022: Nat Grant for the Prima Donna Podcast\n* 2021: Lynda Mitchelson-Twigg, representing the Gippsland Lakes Commercial Fishing Community, assisted by Nikki Henningham, Leigh Henningham, Tanya King, Donna Squire and Geoff Stanton for End of an Era: The Last Gippsland Lakes Fishermen\n*2020: Sandy Jeffs and Margaret Leggatt for Out of the Madhouse: From Asylums to Caring Community?\n* 2019: Peg Fraser for Black Saturday\nLocal History – Small Publication / Small History Publication Award\n* 2023: Flinders District Historical Society for Flinders Cargo Shed: heritage and environs\n* 2022: Dr James Lesh for Report on the place name: Moreland\n* 2021: Sarah Pinto for Places of Reconciliation: Commemorating Indigenous History in the Heart of Melbourne\n*2020: Benjamin Wilkie for Gariwerd: An Environmental History of the Grampians\n*2019: Beris Campbell et al. for More Than Just Housing: The South Port Community Housing Group Story 1983–2018\n* 2018: Hans-Wolter von Gruenewaldt and Kay Ball for Art Captured: Hans-Wolter von Gruenewaldt, Prisoner of War Camp 13 Murchison: His Story and His Art\n* 2017: Robyn Lewis for Building Castlemaine: The Red Brick Legacy of H.D. McBean\n* 2016: Judith Buckrich for The Village of Ripponlea\n* 2015: Fiona Poulton and Katherine Sheedy for Boroondara Remembers: stories of World War 1\n* 2014: Margaret Bowman for Cultured Colonists: George Alexander Gilbert and His Family, Settlers in Port Phillip\n* 2013: Coleen Bower for Water Races and Tin Mines of the Toora District: A Short History of the Tin Mines at Granite Bar and Toora\n* 2012: Ken McKimmie for Chewton Then and Now: A series of studies investigating change over time in the former Mount Alexander Goldfield town of Forest Creek later known as Chewton\nSmall Organisation History Project Award\n* 2023: Willaura Modern Incorporated at Historic Railway Station Gallery in association with Willaura Historical Society for Precious objects: shared memories of our collective past\n* 2022: Helen Petschel, Christine Cook and Matthew Cook for Red Cliffs recollections: a century of soldier settlement 1921-2021\nLocal History Project Award\n* 2023: Elio Sarpi for Houses of North and West Melbourne\n* 2022: Luciano and Georgia Keats, supported by the Australian Queer Archives, for [https://www.queerways.au/ Queer-ways]\n* 2021: Chinese Australian Family Historians of Victoria for Victorian CEDT Index\n*2020: Patrick Ferry with Wally Nye for Blood, Toil, Tears & Sweat: Remembering the Pakenham District’s WW2 Service Personnel, 1939–1945''\n*2019: Jill A'Vard and Armin Richter for When Roads Were Tracks: A history of the roads of Monbulk, Kallista, the Patch and Sherbrooke\n* 2018: Elizabeth O’Callaghan for Silent Lives: Women of Warrnambool and District 1840-1910\n* 2017: Collingwood Historical Society for Notable People of Collingwood\n* 2016: Ian D. Clark (historian) for We Are All of One Blood: a History of the Djabwurrung Aboriginal People of Western Victoria, 1836-1901\n* 2015: Gillian and John Francis for Strewth! An insight into local involvement in World War One, 2 volumes\n* 2014: Marguerita Stephens (et al. for Vol 4) for The Journal of William Thomas, Assistant Protector of the Aborigines of Port Phillip & Guardian of the Aborigines of Victoria, 1839-1867, 4 volumes\n* 2013: Kevin O’Reilly for Flyers of Time: Pioneer Aviation in Country Victoria, The First Fifty Years. A Collection\n* 2012: Mick Woiwod for Coranderrk Database\nCollaborative Community History Award\n* 2023: Lisa Byrne and Dr Jane Eckett for On Bunurong country: art and design in Frankston\n* 2022: Melbourne Women's Walking Club for ''Still on track: 100 years of the Melbourne Women's Walking Club\n* 2021: Graham Willett, Angela Bailey, Timothy W Jones & Sarah Rood for A History of LGBTIQ+ Victoria in 100 Places and Objects\n*2020:  Cheryl Threadgold for In the Name of Theatre: The History, Culture and Voices of Amateur Theatre in Victoria\n*2019: The Springthorpe Heritage Group for Mont Park to Springthorpe heritage project\n* 2018: John Andrews and Deborah Towns for \"A Secondary Education for All?\" A History of State Secondary Schooling in Victoria\n* 2017: Julie Eagles (project coordinator) for Fletcher Jones: Stories from our Community\n* 2016: Susan Blackburn (ed) for Breaking Out: Memories of Melbourne in the 1970s\n* 2015: Craig Cormick (ed) for Ned Kelly Under the Microscope: solving the forensic mystery of Ned Kelly's remains\n* 2014: Gerry Robinson and friends for From Apples....to Coffee, the first 90 years of the Heathmont shopping centre, 1923-2013\n* 2013: Maree Hanlon and Pam Herbert (editors) for Through Their Eyes: A Glimpse into the Lives of Women from Benalla & District\n* 2012: Lyn Skillern and others for From Inkwell to Internet: a century of State Secondary Education in Leongatha''\nMultimedia History Award / Digital Storytelling Award\n* 2023: Julian O'Shea for [https://youtube.com/playlist?list=PLB0QHkByZcAhZxo6LEokuOl4DRN5kqZ2m&si=Ijd-QaSFMKCE2OXz Unknown Melbourne]\n* 2022: Way Back When and the City of Melton for City of Melton 150th Anniversary online exhibition\n* 2021: Atalanti Dionysus / Atalanti Films for A Miscarriage of Justice\n*2020: Rachel Fensham and Andrew Fuhrmann for the Digital Studio at University of Melbourne and Digital Heritage Australia for La Mama: The Biggest Little Theatre in Australia\n*2018: Mallacoota and District Historical Society for Secrets from the Mallacoota Bunker\n* 2017: Ros Stirling and Heritage Films for Joseph Reed and the Making of Marvellous Melbourne\n* 2016: Rural City of Wangaratta for We Remember: honouring the service and sacrifice of local veterans and the Wangaratta community during WW1 (website & DVD)\n* 2015: Port Melbourne Historical and Preservation Society for Postcards from Port: an audiovisual retrospective of Port Melbourne (DVD)\n* 2014: Lilydale & District Historical Society Inc for ''Gun Alley: the forgotten story of Lilydale's back streets 1880 to today (website)\n* 2013: Valerie Wilson for A Guide to Pioneer Graves in the Mornington Cemetery  Website: [http://www.morningtoncemetery.com]\n* 2012: Friends of Wyperfeld for Wyperfeld 100: A traverse in time DVD\nHistorical / History Interpretation Award\n* 2023: Gus Berger, Gusto Films for The Lost City of Melbourne\n* 2022: Benjamin Gray for Extinct: artistic impressions of our lost wildlife\n* 2021: Commonplace Productions (Bill Garner and Sue Gore) with Kacey Sinclair, Alice Garner, Pat Furze and the Band Friends of Wendy Cotton for Finding Fanny Finch\n*2020: Lucy Bracey and Gregory Mackay for Annie’s War: The Story of One Boroondara Family’s Wartime Experience\n*2018: A collaborative exhibition by the Wangaratta Historical Society, Wangaratta Art Gallery and Museums Australia (Victoria) Roving Curator Program for Wangaratta Stories\n* 2017: Discover Historic Kyneton for Discover Historic Kyneton: A Guide to Discovering Kyneton’s Historic Places and People\n* 2016: Eva de Jong-Duldig and filmmaker David Smith for Duldig Studio Documentaries. Volume 1: 4 documentaries\n* 2015: Meyer Eidelson for Melbourne Dreaming: a guide to important places of the past and present''\n* 2014: Friends of La Trobe's Cottage for ''The garden at la Trobe's Cottage, Kings Domain, Melbourne\n* 2013: Chewton Domain Society for The Monster Meeting, The Great Meeting of Diggers 4 pm, 15 December 1851\n* 2012: Gib Wettenhall for Goldfields Track Walking Guide\nHistory Article (Peer Reviewed) Award\n* 2023: Sylvia Morrissey for No mention of the Great Famine: interpreting a gap in Dr John Sington's autobiographical narrative\n* 2022: Adrien McCrory for Policing gender nonconformity in Victoria 1900-1940, in Provenance\n* 2021: Barbara Minchinton for The Rise and Fall of Lady Gillott in Melbourne’s Turn-of-the-Century Society\n*2020: Ruby Ekkel for \"Woman’s Sphere Remodelled: A Spatial History of the Victorian Woman’s Christian Temperance Union 1887–1914\" in the Victorian Historical Journal\n*2018: Nikita Vanderby for \"The Happiest Time of My Life\": Emotive Visitor Books and Early Mission Tourism to Victoria's Aboriginal Reserves''\n* 2017: Miranda Francis for 'One Woman's Crèche is a Bureaucrat's Child-Minding Centre, \"The Flat\" at Footscray High School 1976-1986' in Provenance Journal.\n* 2016: James Kirby for 'Beyond Failure and Success: the Soldier Settlement on Ercildoune Road' in Provenance Journal\n* 2015: Alistair Thomson for 'Anzac Memories Revisited: trauma, memory and oral history' in Oral History Review, Vol 42 Issue 1, 2015\nCultural / Community Diversity Award\n* 2023: Charlton Neighbourhood House for Nyernila\n* 2022: Alexandra Dellios for Heritate making and migrant subjects in the deindustrialising region of the Latrobe Valley\n* 2021: Roy Henry Patterson and Jennifer Jones for On Taungurung Land: Sharing History and Culture\n*2020: Jen Rose, Well Chosen Words in partnership with The Boite for The Boite: History Through Music, Song and Story\n*2019: Jan McGuiness for La Nostra Storia: The story of Italians in Ballarat\n* 2018: Stella Dimadis, Medea Films for Migrant Stories\n* 2017: Adam Ricco, Lella Cariddi and Multicultural Arts Victoria for two documentary films, Reading the Wind and Afterwards\n* 2016: Anne Doyle for Wadaddi Nabadda. Paths to Peace: voices of the Somali speaking community\nCentenary of World War 1 Award (2015–2018)\n* 2018: Grahame Thom and the Kilmore Historical Society for Lest We Forget: Southern Mitchell Shire Volunteers Who Served in World War One\n* 2017: Richard Travers for To Paint a War: The Lives of the Australian Artists Who Painted the Great War 1914-1918\n* 2016: Ballarat & District Genealogical Society Inc for Home Front Ballarat WW1 (website)\n* 2015: Helen Doyle for Suburbs at War: the Cities of Malvern and Prahran during the Great War\nYoung Historians Award (15–18 years)\n* 2015: Discontinued\n* 2014: Not awarded\n* 2013: Not awarded\n* 2012: Chelsea Way for New Horizons: Post-War Migration to Australia\nVictorian Community History Awards winners, 1998 to 2011\nVictorian Community History Awards - Overall Winner\n* 2011: Gunditjmara people with Gib Wettenhall for The People of Budj Bim\n* 2010: Jenny Davies for Behind the Facade: Flinders Street more than just a Railway Station\n* 2009: Ken Oldis for The Chinawoman\n* 2008: Annette O'Donohue & Bev Hanson for Eaglehawk & District Pioneer Register Volume 6 - T-Z\n* 2007: Jillian Durance for Still Going Strong: The story of the Moyarra Honor Roll\n* 2005: Justin Corfield, Dorothy Wickham and Clare Gervasoni for The Eureka Encyclopaedia\n* 2004: Wandiligong Preservation Society Co-ordinated by Coral Bennett and Joy Kit for Oriental Crossing\n* 2003: Ann Synan for We Came With Nothing: Story of the West Sale Migrant Holding Centre\n* 2002: Gillian Upton for The George: St Kilda Life and Times\n* 2001: Warik Lawrance for 1864 (CD ROM)\n* 2000: Daryl Tonkin and Carolyn Landon for ''Jackson's Track - A Memoir of a Dreamtime Place\n* 1999: Dr. Andrew Brown-May for Melbourne Street Life\n* 1998: Patrick Morgan for The Settling of Gippsland, A Regional History\nBest Community Research, Registers and Records\n* 2011: Marie Hansen Fels for  'I succeeded Once': The Aboriginal Protectorate on the Mornington Peninsula, 1839-1840.\n* 2010: Susie Zada and Pam Jennings for Scots in Geelong and District to 1860\n* 2009: Karen T Collins, Collingwood Historical Society for  Bitter Roots, Sweet Fruit: A history of schools in Collingwood, Abbotsford and Clifton Hill\n* 2008: John McKay and Hamilton History Centre Inc for The Streets of Hamilton, Western Victoria Australia: a History of the People behind the Names\n* 2007: Port Melbourne Historical & Preservation Society for History of a Street Precinct\n* 2005: Graeme Massey for Gallipoli Heroes: A tribute to the men from Western Victoria who gave their lives for their country\n* 2004: Arthur Yong, North Eastern Melbourne Chinese Association for Chinese Settlement in Darebin\n* 2003: Graeme Massey (Warracknabeal Secondary College – History Department) for Fallen Heroes. Warracknabeal War Memorial\n* 2002: Dianne Carroll for Carroll Heritage Collection\n* 2001: Allan Willingham for Camperdown: A Heritage Study\n* 2000: Keith Clarke for Convicts of the Port Phillip District\n* 1999: Brendan Fitzgerald and Bayside Library Services for Sin on Disc\nBest Collaborative / Community Work\n* 2011: Michael Collins and others for Our Boys at the Front: The Mornington Peninsula at War 1914-18 from the pages of the Peninsula Post.  (Book and DVD)\n* 2010: Yarra Valley Italian Cultural Group for Dreams from a Suitcase ('Sogni Dalla Valigia'): Recollections of Italian Settlers in the Yarra Valley\n* 2009: Christine Grayden, Phillip Island Conservation Society for An Island Worth Conserving: A History of the Phillip Island Conservation Society\n* 2008: Collingwood Historical Society Inc for Collingwood Plaques Project\n* 2007: Andrew Brown-May and Shurlee Swain (eds) for The Encyclopedia of Melbourne\n* 2005: Peter Yule (ed.) and the Carlton Residents Association Inc. for Carlton: A History\n* 2004: Elizabeth Huf for Courage, Patience and Persistence: 150 Years of German Settlement in Western Victoria\n* 2003: Jewish Museum of Australia (in association with Shalom Association) for From Russia with Hope: Australian Jews from Russia 1870-2002 (Exhibition)\n* 2002: South Port Day Links and Port Melbourne Historical Society for Linking Us Together\n* 2001: Sigrid Borke for In and Out of Port. Voices from the Port of Melbourne. An Oral History\n* 2000: City of Whittlesea for Oral History and Poster Exhibition Project\n* 1999: Jan Critchett for Untold Stories - Memories and Lives of Victorian Koories\n*  1998: Linda Barraclough for historical research and community work in Gippsland\nBest Print / Publication - Commercial\n* 2011: Ron Hateley for The Victorian Bush: its 'original and natural' condition.\nBest Print / Publication - Self or Community Publication\n* 2011 Anne Longmire for The Catalysts: Change and Continuity 1910-2010.\nBest Print / Publication\nIn 2011 the Best Print / Publication category was divided into Best Commercial Publication and Best Self or Community Publication. See above.\n* 2010: Robin Grow for Melbourne Art Deco\n* 2009: Gary Presland for The Place for a Village: How nature has shaped the City of Melbourne\n* 2008: Barry Heard for The View from Connor's Hill\n* 2007: Richard Broome for Aboriginal Victorians: A History Since 1800\n* 2005: Barry Hill and the Borough of Queenscliffe for The Enduring Rip: A History of Queenscliffe\n* 2004: John Poynter for Mr Felton's Bequests\n* 2003: Vicki Fairfax for A Place Across the River. They Aspired to Create the Victorian Arts Centre\n* 2002: Carolyn Rasmussen for A Museum for the People\n* 2001: Adrian Jones for Follow the Gleam: A History of Essendon Primary School 1850-2000\n* 2000: Peter Yule for The Royal Children's Hospital A History of Faith, Science and Love\n* 1999: Janet McCalman for Sex and Suffering - Women's Health and a Women's Hospital\n* 1998: Phil Taylor for Karkarook: a Mallee Shire History\nBest Walk / Tour\n* 2011: Peter Cuffley, Helen McBurney, Geoff Palmer & Janey Runci for Henry Handel Richardson in Maldon.\n* 2010: Karen McIntyre for Lake Bolac Heritage Walk\n* 2009: Wangaratta Regional Tourist Development Inc for Heritage Walk, Wangaratta\n* 2008: Bayside City Council for Bayside Architectural Trail\n* 2007: Ruth Gallant, Footscray Reference Group & Maribyrnong City Council for Footscray Trail: a guided walk through the historic central business district\n* 2005: Margaret Gardner and Val Heffernan, The Hamilton History Centre for Exploring Hamilton Walks\n* 2004: Don Chambers for Melbourne General Cemetery\n* 2003: Carmel Taig for Yarraville in 1901\n* 2002: Ross Bastiaan for The Kokoda Walk in the Dandenong Ranges National Park\n* 2001: Bayside City Council for Bayside Coastal Art Trail. Stage 3\n* 2000: Richard Peterson for Brimstone to Bunyip Churches of Collingwood, Clifton Hill and Abbotsford 1852-1999\n* 1999: Angela Taylor, Ron Hateley, Tarnya Kruger for The La Gerche Walking Track\n* 1998: Mary Ryllis Clark for Discover Historic Victoria\nBest Exhibit or Multimedia\n* 2011: The Jewish Museum of Australia for  Mameloshn: How Yiddish made a home in Melbourne.\nBest Audio-Visual / Multimedia\nIn 2011 Best Exhibit and Best Audio-Visual / Multimedia were combined as a category. See above.\n* 2010: Keith White & Will Twycross for Visions of Port Phillip: The Burrells of Arthur's Seat 1851-1925\n* 2009: Bendigo Chinese Association Museum Inc trading as Golden Dragon Museum for Creating a Community Museum\n* 2008: Malcolm McKinnon and The Victorian Country Football League for Football Stories from Country Victoria\n* 2007: Landsborough Festivals Inc for From Gold to Grapes: The Story of Landborough\n* 2005: The Euston/Robinvale Historical Society Inc for Happy Birthday Robinvale\n* 2004: James McCaughey, Red Finch Films for The First Eleven: The First Australian Cricket Tour of England (Video)\n* 2003: Lakes Entrance Family History Resource Centre for Casting the Net – Pioneer Fishing Families of the Gippsland Coast\n* 2002: Geoff Russell for Sir John Quick and Bendigo's ANA\n* 2001: Lilydale & District Historical Society for Melba - Australia's Greatest Daughter\n* 2000: Bronwyn Hughes (Author), Laki Sideris (Developer) and Tim Dolby (Producer) for Lights of our Past: Australian Stained Glass\n* 1999: Timothy Lee for Wally's Weddings/The Bush Smithy\nBest Exhibit / Display\nIn 2011 Best Exhibit and Best Audio-Visual / Multimedia were combined as a category. See above.\n* 2010: Janine Rizzetti (Heidelberg Historical Society) for  An Invitation to the Ball\n* 2009: Port Melbourne Historical and Preservation Society for The Navy in Port Exhibition: A month of celebration for the centenary of the Great White Fleet visit\n* 2008: Robinvale Network House for Migration Memories - Robinvale\n* 2007: Victorian Jazz Archive Inc. for Jazz Spans the Decades – A History of Jazz in Victoria\n* 2005: David Williams for Harvests, Headlands & Halcyon Heritage''\n* 2004: Jointly organised by the Warrnambool Art Gallery and the Warrnambool and District Historical Vehicle Club. Curated by Brenda O'Connor for Early Motoring in Warrnambool\n* 2003: Melbourne's Living Museum of the West for A Stone Upon A Stone: A Touring Exhibition about the History and Heritage of Dry Stone Walls\n* 2002: Laharum Hall Committee for Federation Mural: History of Laharum\n* 2001: Golden Dragon Museum, Bendigo for Showing Face\n* 2000: Tatura and District Australia Day 2000 Committee for Tatura Collage Columns\n* 1999: Jan Mitchell for Baywalk Bollards Project\n* 1998: Mr Russell Jack - Bendigo Golden Dragon Museum\nSpecial awards\n* 2011: Judges' Special Prize for Excellence - Gregory Eccleston and others for Early Navigators of Bass Strait, 1770-1803. (Map)\n* 2010: Award to Celebrate 175th Melbourne Anniversary -  Bain Attwood for ''Possession: Batman's Treaty and the matter of history''\n* 2009: Judges' Special Prize for Excellence  - Paul R Mullaly for Crime in the Port Phillip District 1835-51\nSee also\n*List of Australian literary awards\n*Australian History Awards\n* New South Wales Premier's History Awards\n*Northern Territory History Awards\n*Prime Minister's Prize for Australian History\n* List of history awards\nNotes\nReferences\n*  [http://www.historyvictoria.org.au/programs/victorian-community-history-awards/past-vcha-winners Victorian Community History Awards from 1998]  Royal Historical Society of Victoria (Retrieved 21 January 2013)\n*  [http://www.historyvictoria.org.au/wp-content/uploads/2012/10/VCHA-2012-Awards-Booklet.pdf VCHA 2012 Awards Booklet] Royal Historical Society of Victoria (Retrieved 21 January 2013)\n*  [http://www.historyvictoria.org.au/wp-content/uploads/2013/10/VCHA-2013-Winners-Booklet.pdf VCHA 2013 Awards Booklet] Royal Historical Society of Victoria (Retrieved 11 Jul 2014)\n* [http://www.historyvictoria.org.au/victorian-community-history-awards-2014-winners VCHA 2014 Awards] Royal Historical Society of Victoria (Retrieved 30 Oct 2014)\n* [http://www.historyvictoria.org.au/wp-content/uploads/2015/10/Winners-booklet-2015.pdf VCHA 2015 Awards] Royal Historical Society of Victoria (Retrieved 23 Dec 2015)\n* [http://www.historyvictoria.org.au/wp-content/uploads/2011/06/2016-VCHA-Booklet-entry-alphabetical-order-FINAL-for-Web.pdf VCHA 2016 Awards] Royal Historical Society of Victoria (Retrieved 5 Nov 2016]"
    }
  ]
}