{
  "content": [
    {
      "type": "text",
      "text": "# Victor L. King\n\n| birth_place        = Nashville, Tennessee, U.S.\n| death_date         =\n| death_place        = Bound Brook, New Jersey, U.S.\n| resting_place      = Bound Brook Cemetery\n| other_names        =\n| education          = Dartmouth CollegeColumbia School of MinesUniversity of Zurich (PhD)Swiss Polytechnic Institute (PhD)\n| occupation         = Chemist\n| years_active       = 1906–1958\n| known_for          =\n| notable_works      =\n| thesis_title       = On cleavage methods and their application to complex metal-ammonia compounds\n| thesis_year        = 1912\n| spouse             =\n| children           = 4\n| relatives          =\n}}\nVictor Louis King (March 14, 1886 – October 12, 1958) was an American chemist. He studied under Alfred Werner and his experiments assisted Werner in attaining the 1913 Nobel Prize in Chemistry. His work in chemical and dye production led King to become chairman of the dye section of the War Industries Board during World War I.\nEarly life\nVictor Louis King was born on March 14, 1886, in Nashville, Tennessee, to Christina Hartman King. He studied at Dartmouth College from 1903 to 1906 and for a short time in 1906 at the Columbia School of Mines. In late 1906 and in 1907, King was a smelter superintendent at Elizabeth Copper Company (later the Vermont Copper Company). In 1908, he was a consulting chemist at Peter D. Austien in New York. He developed silicon carbide filaments at Columbia University under Professor Parker. He made filaments in a plant in Newark.\nKing studied under Albert Einstein and Alfred Werner at the University of Zurich. He conducted 2,000 or so crystallization experiments in 1910 and 1911. In June 1911, as Werner's graduate student, he helped prove Werner's theories on 6–coordinate complexes and their geometry. His experiments helped Werner gain the Nobel Prize in Chemistry in 1913. His 1912 dissertation at the University of Zurich was titled \"On cleavage methods and their application to complex metal-ammonia compounds\". He graduated with his PhD in 1912 and then he conducted research with Richard Willstätter at Swiss Polytechnic Institute in Zurich. He also received a PhD from that institution. He was a member of Phi Gamma Delta.\nCareer\nIn 1912, King worked for less than a year at Parke–Davis & Co. in Detroit. He then worked as a works manager at Hoffman LaRoche in Grenzach-Wyhlen, Germany. He also was in charge of phenol production at Ladenburg until the end of his contract on January 1, 1915. He then returned to the United States and worked with Thomas Edison in 1914 and 1915 as a consulting engineer in Edison's venture to design phenol and aniline plants in Newark. In May 1917, he joined American Synthetic Dyes in association with Butterworth–Judson to build a phenol and picric acid plant. He hired only black workers from the South, stating that he wished to \"prevent the entrance into the organization of any enemy aliens\" who he felt might sabotage the works. He later resigned after a dispute with the vice president of the company. He built, staffed, and operated chemical plants, throughout Europe, Asia and the United States. In 1918, along with Eugene C. King and Charles R. Ruegger, King incorporated Liberty Chemical Company in Wood-Ridge, New Jersey.\nIn September 1918, King succeeded Jacob F. Schoellkopf Jr. as chairman of the dye section of the War Industries Board in Washington, D.C. He remained in the role until January 1, 1919. He was involved in the development of the dye industry. He was a pioneer in process improvement with chemicals, including the manufacture of sulfa drugs and aureomycin. He also worked with August Heckscher in cooper smelting and August Belmont. He was operating manager of Charles Pfizer & Co. He was technical director of the Calco Chemical Company in Bound Brook, New Jersey, from 1918 to 1929. He was involved in designing a nigrosin plant in Bound Brook and the manufacturing of tylosin, dinitrobenzene and Beta-Naphthol.\nFollowing World War II, King led a team of chemical manufacturers for the United States Department of Commerce in Europe. In 1946, he visited Germany with members of the American Cyanamid. He became interested in air pollution and effluent treatment. He was executive of American Cyanamid until his retirement in 1957. He then served as vice president of Rhodia Inc., a chemical firm in New Brunswick. He was a consulting engineer with Lederle Laboratories. He had patents in the field of antibiotics.\nKing was a founding member and officer of the American Institute of Chemical Engineers. In 1923, he became chairman of a troop committee for the Boy Scouts in Bound Brook. He later received the Silver Beaver Award from the scouts for his support.\nPersonal life\nKing married Eugenia \"Eugenie\" Katherine Ruegger, daughter of Charles R. Ruegger, of Wood-Ridge on September 7, 1907. Following their marriage, they lived in Strafford, Vermont. They had four sons, Victor R., Jamie H., Gene G., and Thomas A.\nKing died from a heart attack on October 12, 1958, at his home on Middlebrook Road in Bound Brook. He was buried in Bound Brook Cemetery.\nAwards\nKing received the Gay Lussac Medal.\nPublications\nPapers\n* Baudisch, Oskar; King, Victor L. (1912) Cupferron: Its Use in Quantitative Analysis. Chemical News.\n* Willstätter, Richard; King, Victor L. (1913) Hydrogenation of Aromatic Compounds by Means of Platinum and Hydrogen. Journal of the Chemical Society.\nPatents\n* Dean, Russell Tattershall; King, Victor L. (1946) Nicotinic Acid Prepared from Nicotine Nitrate. U.S. Patent Number 2,409,345.\n* King, Victor L. (1949) Rocket Propulsion by Reacting Alkyl-Substituted Mononuclear Aromatic Amines and Nitric Acid. U.S. Patent Number 2,474,183.\nReferences\nExternal links\n*"
    }
  ]
}