{
  "content": [
    {
      "type": "text",
      "text": "# Victoria Hill, Queensland\n\n| pop                 = 48\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4361\n| area                = 34.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 21.6\n| dir1                = W\n| location1           = Allora\n| dist2               = 21.7\n| dir2                = SW\n| location2           = Clifton\n| dist3               = 45.9\n| dir3                = NW\n| location3           = Warwick\n| dist4               = 65.7\n| dir4                = SSW\n| location4           = Toowoomba\n| dist5               = 180\n| dir5                = SW\n| location5           = Brisbane\n| lga                 = Southern Downs Region\n| lga2                = Toowoomba Region\n| region              = Darling Downs\n| stategov            = Southern Downs\n| stategov2           = Condamine\n| fedgov              = Maranoa\n| near-n              = Sandy Camp\n| near-ne             = Sandy Camp\n| near-e              = Talgai\n| near-se             = Bony Mountain\n| near-s              = Bony Mountain\n| near-sw             = Pratten\n| near-w              = Old Talgai\n| near-nw             = Ellangowan\n}}\nVictoria Hill is a rural locality spit between the Southern Downs Region and the Toowoomba Region, both in Queensland, Australia. In the , Victoria Hill had a population of 48 people.\nGeography\nThe locality is bounded to the west by the Condamine River and partially to the north by Dalrymple Creek.\nThe terrain varies from . The land use is predominantly crop growing with some grazing on native vegetation.\nDalrymple Creek Road enters the locality from the east (Talgai) and terminates in the north-east of the locality.\nHistory\nVictoria Hill State School opened in July 1911. It closed on 31 December 1963. It was on a  site at 2223 Dalrymple Creek Road ().\nThe Victoria Hill Hall was officially opened on Saturday 13 September 1930 by William Deacon, the Member of the Queensland Legislative Assembly for Cunningham. A sports afternoon and ball were held to celebrate the opening.\nDemographics\nIn the , Victoria Hill had a population of 30 people.\nIn the , Victoria Hill had a population of 48 people.\nAmenities\nVictoria Hill Hall is on a  site on Dalrymple Creek Road (). The Victoria Hill branch of the Queensland Country Women's Association meets at the hall.\nEducation\nThere are no schools in Victoria Hill. The nearest government primary schools are in Allora, Clifton, Back Plains and Wheatvale. The nearest government secondary schools are in Allora (but only to Year 10) and Clifton (to Year 12).\nReferences"
    }
  ]
}