{
  "content": [
    {
      "type": "text",
      "text": "# Vietnamese Civil War of 1789–1802\n\n| date              = 1787 – 20 July 1802\n| place             = Vietnam, Laos, Cambodia, South China Sea\n| result            = Nguyễn loyalists victory\n* Collapse of the Tây Sơn dynasty and their regime\n*Nguyễn Phúc Ánh united Đại Việt and established the Nguyễn dynasty\n| combatant1        = Tây Sơn dynasty Chinese pirates mercenaries\n| combatant2        = Nguyen loyalists Hoa Loyalists  Kingdom of Cambodia Siam  Kingdom of Vientiane\nSupported by:\nKingdom of France (until 1790, later French mercenaries)\n| commander1        =  Nguyễn Nhạc   Nguyễn Huệ\nCảnh Thịnh Trần Quang Diệu   Ngô Văn Sở  Vũ Văn Dũng    Bùi Thị Xuân   Po Tisuntiraidapuran Chen Tianbao Zheng Yi Mo Guanfu Zheng Qi\n| commander2        = Nguyễn Phúc Ánh  Nguyễn Phúc Cảnh  Lê Văn Duyệt Pierre Pigneau de Behaine  Nguyễn Văn Thành   Trịnh Hoài Đức   Trương Tấn Bửu  Nguyễn Huỳnh Đức  Po Ladhuanpuguh Jean-Baptiste Chaigneau  Jean-Marie Dayot Olivier de Puymanel   Rama I   Ang Eng  Nanthasen\n| strength1         =\n| strength2         =\n| casualties1       = 300,000–500,000 deaths (including civilian)\n}}\nThe Vietnamese Civil War of 1787–1802, or the Tây Sơn–Nguyễn Civil War of 1787–1802, was a conflict fought between two Vietnamese factions, the Tayson in the north, and the Nguyen loyalists in the south, both intended to unify the realm. Following the Tây Sơn rebellion (1771–1789), the kingdom of Dai Viet was partitioned into three regions ruled by the Tây Sơn brothers Nguyen Nhac, Nguyen Hue and Nguyen Lu. Nguyen Phuc Anh, last of the slaughtered Nguyen lord family that had been overthrown by the Tây Sơn in the 1770s, returned to Vietnam in 1787 after spending years of exile in Siam to rally support for his fight against the Tây Sơn. Nguyen Anh and his allies effectively defeated the Tây Sơn, dismantled the Tây Sơn regime, reunited the country, and established a unified Vietnamese state in 1802.\nBackground\nkingdom: Đàng Ngoài (Tonkin) & Đàng Trong (Cochinchina)]]\nFrom the 16th to 18th century, the Vietnamese realm of Dai Viet after had been loomed by a series of civil wars and social unrest, was effectively partitioned into two semi-autonomous entities, Đàng Ngoài and Đàng Trong, ruled by the rivalry Trinh and Nguyen Phuc families on behalf of the Le Duy dynasty. The Tayson rebellion led by three Tayson brothers Nguyen Nhac, Nguyen Hue and Nguyen Lu broke out at the Nguyen-controlling town of An Khe in 1771 eventually became a massive blow and brought the three ruling families to a comma. A Nguyen Prince who was the only one who survived a Tây Sơn massacre in 1777, Nguyen Phuc Anh, was able to escape to Siam with assistance from Pierre Pigneau de Behaine, a prominent French Catholic bishop. Nguyen Nhac established himself as a monarch in 1778. In 1781 Nguyen Anh returned and attacked Nguyen Nhac with six Portuguese mercenary galleons, but was defeated and was forced to depart to Siam. The Siamese king Rama I showed his clemency to restore Nguyen Anh as he allied with the Nguyen prince and married Nguyen Anh's niece. In January 1785 the Siamese and Nguyen loyalists again were annihilated by Tayson fleet while they were trying to retake Saigon, this time was Nguyen Hue commanding the Tây Sơn. In 1786, after having destroyed the Trinh family in the north and brought the Le Duy dynasty behind their heels, the Tayson brothers divided the kingdom into three parts: north to Nguyen Hue, central to Nhac and south to Lữ. Two years later Nguyen Phuc Anh and his comrade Pigneau de Behaine, had signed the alliance treaty of Versailles with French monarch Louis XVI in November 1787, and then returned to Bangkok in 1788, then reached Saigon with 14 French officers, 360 soldiers, and 125 sailors. Cochinchinese (southern Vietnam) landlords, aristocracy class, and Chinese merchants, immediately revolted and joined the Nguyen loyalists. They were able to force the Tayson king of Saigon, Nguyễn Lữ, to flee to the north. The Nguyen Prince sought to establish his rule over the Mekong Delta, strengthen his military and prepare new campaigns against the Taysons. He dispensed the peasants lands, exchanging rice for weapons, and recruited mercenaries from his allies in India, Thailand, Cambodia, Java, to the Philippines. At the same time, Tayson senior leader Nguyen Hue, now known as Quang Trung, has just liquidated a Chinese intervention in northern Vietnam, consolidated Taysons control over Tonkin and upper Cochinchina (encompass modern-day North and Central Vietnam).\nQuang Trung's offensives, 1790–1791\nor Nguyen Van Hue, younger brother of Nguyen Nhac]]\nAfter accomplished his victory over Tet 1789 against the Chinese interventionists, Quang Trung made peace with them in 1790. In later the same year he decided to strike and dislodge the Nguyen loyalists first. Quang Trung launched an invasion of Vientiane, which was a Siamese tributary kingdom. 50,000 Tayson troops sacked Vientiane while they were trying to outflank Nguyen Anh from the northwest. In autumn next year, the Tayson ruler with 10,000 troops led a further attack on Luang Phrabang and series of incursions of the Thai-Lao border before withdraw. His invasions of Laos made King Nanthasen seek an alliance with Nguyen Anh in 1792. Seemed fruitless due to defeats in Laos, Quang Trung turned his strategy into a war of attrition while conscripting all available men from 18 to 61 into the army and preparing for a new massive offensive against the Nguyen that would be determined in 1793. Even so, he was believed planning another massive invasion of Southern China, assisted by the Chinese pirates. Unexpectedly, the Tayson leader died on 16 September 1792, left his 10-year-old heir Nguyen Quang Toan and the Tayson regime in a turbulent setting. The death of Quang Trung also was the turning tide of the civil war that the Tayson never launched any further major attack on their enemies. The next year, his older brother and the senior leader of the Tayson, Nguyễn Nhạc, died at the age of fifty.\nNguyen Anh's offensives, 1792–1795\nin Vietnam, 1805]]\nThe military campaigns of the 1790s paralleled those of the 1770s and early 1780s, in that they were dictated by the monsoon seasons which winds could ferry both sides' fleets and were sometimes referred to as the \"monsoon wars.\" The rugged, high terrains of Central Vietnam are unsuitable for marching, and it seemed only sea transportation and powerful navy played the most significant role in the conflict.\nThe first target of the Nguyen loyalists was the strategic southern Tayson capital of Qui Nhơn and that city's coastal port of . In summer 1792, the Nguyen launched their own attack, which succeeded in encircling Nguyễn Nhạc at Qui Nhơn. Joined with Nguyen Anh were French captains and officers: Jean Marie Dayot (1759–1809), Jean-Baptiste Chaigneau (1769–1832), Philippe Vannier (1762–1842), and Godefroy de Forsans. Dayot led a contingent of Nguyen vessels, opening the way to the Nguyen fleet which then defeated the Tây Sơn fleet.\nCaught off guard, Nhạc's commanders were forced to abandon their substantial navy, and its vessels were all either captured or destroyed by the Nguyen loyalists. The following year, a second Nguyen siege was only lifted after a desperate plea from Nhạc to his nephew, Quang Trung's successor, brought sufficient reinforcements. From Huế, Tayson ruler Cảnh Thịnh sent Nhạc reinforcements: 18,000 troops, 80 elephants, and thirty war junks. The 1792 destruction of Nhạc's fleet at Thị Nại, followed by his death in 1793, represented major setbacks to the Tayson efforts to challenge the Nguyen loyalists for control over the south. Thereafter the Tayson increasingly relied on Chinese pirates to supplement their now limited naval strength. The Vietnamese water has been becoming hotbeds for pirates and raiders, and they were protected and funded by the Tayson monarch.\nFollowing the Nguyen northward offensive, the Nguyen reoccupied Bình Thuận and led to the defection from the Tây Sơn cause of several Cham leaders there and, in 1794, to their betrayal and assassination of the Tayson's leading Cham ally, the king of Panduranga, Po Tisuntiraidapuran (r. 1780–1793) (Chưởng Cơ Tá). Nguyen Anh abolished the title \"king of Champa\" and put the pro-Nguyen Po Ladhuanpuguh (r. 1793–1799) as chưởng cơ lĩnh chánh (primary leading captain).\nIn May 1794, the Tayson king Cảnh Thịnh launched a counterattack on Qui Nhơn. They unexpectedly advanced deep south, regained Nha Trang, Khánh Hòa, Bình Thuận and far away as Nguyen Anh's territories of Bà Rịa by early 1795, southeast of Saigon. This was, however, the last major Tayson military campaign toward the deep south, and the Tayson assault was briefly. 1,500 Khmer troops, combined with Saigon militia and other Nguyen loyalist reserve units were thrown into the front and successfully paused the Tayson counteroffensive, forced them to turn back. As the Tayson retreating north in summer, Nguyen Anh's forces pursued them while his navy sailed to Nha Trang, intended to encircle the withdrawing Tayson army. Fighting continued to ravage these provinces in an attrition war. The Tayson sent reinforcement to besiege the Nguyen loyalists at Nha Trang. Meanwhile, political intrigue in the Tayson court arose when Tayson Marshal Vũ Văn Dũng murdered (Thái sư) Minister Bùi Đắc Tuyên and major general Ngô Văn Sở, prompted Tayson general Trần Quang Diệu to retreat to join the power struggle game while he was holding against the Nguyen foes in Nha Trang. Internal strife and factionalism remained to inflame the Tayson court's instability until the end of the war, deteriorated the Tayson unify and their war effort. By the end of 1795, Nguyen Anh had withdrawn his army back to Saigon to relax.\nAttrition in Qui Nhon (1799–1801)\n, during his mission to the Tayson court in May 1793]]\nWar in 1797\nIn May 1797, several Nguyen vessels sailed north, bypassed the Tayson stronghold of Qui Nhơn and landed on Da Nang, while Nguyễn Văn Thành raided Hoi An. Nguyen Anh was trying to cross the Hải Vân Pass, tend to threaten the Tayson court at Huế. No significant gain was accomplished, as the Nguyen loyalists withdrew back to the south by August due to typhoon season and logistic problems. The 1797 campaign was considered to preclude to Anh's major campaigns in the future. Nguyen Anh put down a Cham revolt in September by using Siamese troops of Rama I. He also informed and discussed the plan with Rama I his next offensive, in which Siamese and Laotian army would attack the Tayson from the west to coordinate the offensive.\nFirst battle of Qui Nhơn (1799)\nNguyen Anh spent the whole the year of 1798 to prepare and rebuild his army, navy, supplies for the 1799 offensive, that time to seize Qui Nhơn and Huế. In April 1799, the operation began, consisting of three divisions:\n* Nguyễn Ánh led the major fleet, composed of three sloops-of-war, 100 galleys, 40 war junks, 200 smaller ships, 800 transport and supplies boats, from Saigon sailing north to Qui Nhơn.\n* Prince Nguyễn Phúc Cảnh commanded land forces advanced from Nha Trang to Qui Nhơn and Chà Bàn.\n* General Lê Văn Duyệt advanced further north of Bình Định Province, with Rade troops, blocking Nhong Pass.\nAt the Bay of Thị Nại, Nguyễn Ánh's fleet defeated the Tây Sơn fleet as his land forces advanced and took Tayson's old capital, Chà Bàn, near the modern city of An Nhơn. In June of that year, Qui Nhơn was finally captured by the Nguyen. Ánh changed the city's name to Bình Định (\"Pacification Established\"). Worried about the loss of Qui Nhơn, the Tayson leader, Cảnh Thịnh, sent two generals Vũ Văn Dũng and Trần Quang Diệu to recapture the city. They were ambushed by Lê Văn Duyệt at the Nhong Pass. Nguyen Anh's comrade bishop Pigneu died in October, his body and Anh sailed to Saigon for the funeral ceremony, left the Qui Nhon citadel to Võ Tánh, one of his generals. By spring 1800, the Tayson renewed their attack with more troops, marching to Qui Nhơn. Cảnh Thịnh ordered to launch the siege of Qui Nhơn while evacuating himself to the Tayson court to the north, rallied his supporters and was preparing for imminent Nguyen invasion.\nSiege of Qui Nhơn (1800)\nAlthough having superior in number, the Tayson were unable to retake Qui Nhơn from the Nguyen loyalists for the whole year 1800. The two Tayson generals, Vũ Văn Dũng and Trần Quang Diệu, both commanded the siege were feuding on each other because of their power struggle, were uncooperative while troops from both sides suffered losses from combating, sickness and desert.\nHearing the news of the Tayson attack, Ánh eventually decided to himself led reinforcement to lift the Tayson siege. In June (rain season), his forces arrived at Nha Trang and embarked the land forces to Qui Nhơn. Another 5,000 Cambodian troops and elephants were sent by king Ang Eng, Nguyen Anh's ally, grouped in Nha Trang. Anh handled prince Cảnh to led the Cambodian army northward. In July, Laotian troops began assaulting Nghệ An and Thanh Hóa to harass the Tayson supply routes. On the sea, the Nguyen captured a Tayson supply fleet and their Chinese pirates. Still, the Nguyen loyalists and their allies were unable to lift the siege. Nguyen Anh decided to stay and camp down near Qui Nhơn during the winter monsoon, unlike previous occasions and ordered troops, supplies from Saigon to be transported to him through lands and coastal sea. Rama I also sent grain supplies to Nguyen Anh by sea.\nSecond battle of Qui Nhơn (1801)\n]]\nAttrition over the control Qui Nhơn soon changed. Lê Văn Duyệt, guided by highland troops, marched behind the Tayson besiegers. He took the fortress of Thị Nại, seized and disabled Tayson cannons. On 21 Feb 1801, the second naval battle of Qui Nhơn began on the Bay of Thị Nại. Smaller Nguyen fleet obliterated the entire Tayson fleet of 1,800 boats and vessels and 600 guns. More than 13,700 Tayson soldiers were captured. The Chinese pirates also were decimated, three leaders of the pirates were captured. Nguyen general Chaigneau described the battle in a letter to his friend Barizy:\n}}\nThe victory dramatically changed the battlefield situation in Nguyễn Ánh's favour, significantly strengthening his position. He skipped the Qui Nhơn citadel on 5 June and arrived in Huế ten days later. Cảnh Thịnh and the Tayson court fled to north. But the main Tayson army still was trapped in Qui Nhơn. They finally brought the citadel down on 7 July, and the Nguyen commander Võ Tánh committed suicide. The Tayson victory nevertheless was meaningless, as the Nguyen loyalists had already reached Quảng Bình and the Gianh River. The Nguyen retook Qui Nhơn in April 1802. Three thousand men of Tayson remnants escaped to the mountain and attempted to return north.\nFinal phase\nHuế (1801)\nNguyễn Ánh seized Hue on 17 July as Cảnh Thịnh and the Tayson court evacuated north to Hanoi. His forces reached far away as the Gianh River. He determined Huế as the new capital after it had been the traditional estate of his family for 200 years before. He repaired tombs of previous Nguyen lords that had been despoiled by Nguyễn Huệ. He retaliated Huệ by digging up the Tayson former leader's grave and vandalising Huệ's remains, executed 31 descendants and generals of Huệ. He then spent time recreating a petty monarchy, government, reconstructing the royal palace and citadel.\nĐồng Hới (March 1802)\nThe Tayson leader Cảnh Thịnh set out a counterattack against the menacing Nguyen loyalists in March 1802. He mobilised 30,000 reserve troops and 100 Chinese pirates vessels and engaged the Nguyen fleet on the Gianh River, near Đồng Hới. The Nguyen loyalists inflicted heavy losses on the Taysons, forcing them to retreat. At the same time, 5,000 Siamese troops and 10,000 Laotian troops advanced from Laos to Nghe An, intended to intercept the Tayson leader on his flight back to Hanoi. Notable Tayson generals, Trần Quang Diệu and Bùi Thị Xuân, were beheaded.\nHanoi (July 1802)\nOn 1 June, Nguyen Phuc Anh was officially crowned as Emperor Gia Long of Vietnam. After the ceremony, Gia Long stormed his army to Tonkin. The Nguyen army encountered Zheng Qi and his 40 pirate junks. The Nguyen took Sơn Nam (lower Red River Delta) on 16 July, began assaulting Hanoi by 13 July, and entered the city on 20 July. The Tayson leader, king Cảnh Thịnh, was captured, jailed, and paraded through the streets of Hanoi in a cage of the Nguyen victors. Marching and parading in Hanoi along with Vietnamese Nguyen troops of Gia Long were thousands of Cham troops, 20,000 Siamese troops, 5,000 Cambodian troops, and French, English, and Irish mercenaries. The Chinese pirates fled back to Chinese territories after the fall of the Tayson. Gia Long finally unified the whole Vietnamese under his dynasty by forces, with landmass stretches more than 2,200 miles from borders of the Chinese Empire to the Gulf of Thailand.\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}