{
  "content": [
    {
      "type": "text",
      "text": "# Vijayalaya Choleeswaram\n\n| country            = India\n| state              = Tamil Nadu\n| district           = Pudukottai\n| location           = Narthamalai\n| elevation_m        =\n| architecture       = Nagara architecture, Rock cut\n}}\nVijayalaya Choleeswaram in Narthamalai, a panchayat town in Pudukottai district in the South Indian state of Tamil Nadu, India, is a temple dedicated to the Hindu god Shiva, Vishnu and houses the 8th century Jaina Abode. The temple is considered one of the oldest stone temples in South India. The other portions of Narthamalai houses the 8th century Jaina Abode, the Aluruttimalai Jain Caves. The Temple is Constructed in the Dravida style and rock cut architecture, the temple is believed to have been built during the 9th century by Mutharaiyar dynasty kings, the cardinals of Pallavas, with later expansion from the Cholas. The rock-cut architecture is an early example of Cholan Art, continuing the tradition of the Pallavas.\nThe temple is maintained and administered by Department of Archaeological Survey of India as a protected monument.\nHistory\nNarthamalai was originally called Nagaratharmalai on account of the business men (called Nagarathar in Tamil) who were active in business in the Trichy – Pudukottai – Madurai regions. The Nagarathars are attributed to the major contributions in terms of the canals, temples, and religious establishments in the region. Narthamalai was ruled from the 7th to 9th&nbsp;centuries by the Mutharaiyars who were feudatories of the Pallavas. The region was later captured by Medieval Cholas.\nThough the temple is called Vijayalaya Choleeswaram, the temple was originally built by Muttaraiyar lieutenant, Sattan Paliyili, during the seventh regnal year of Pallava king Nripatungavarman during 862&nbsp;CE. As per some accounts, the temple is believed to have been built by the first king of Medieval Cholas, Vijayalaya Chola (848–891&nbsp;CE), but the view is highly debated. As per the inscriptions, immediately after the construction, the temple was damaged by rains and lightning. The restoration work was carried out by Tennavan Tamiladirayan, aka Pallan Anantan.\nIn modern times, the temple is maintained and administered by archaeological department of India as a protected monument.\nArchitecture\nThe temple is located in Narthamalai, a rockyhill in Pudukottai district in southern Tamil Nadu. There are 3 main structures present in the Vijayalaya Choleeswaram. There is a temple, A rock-cut cave Temple and other Rock cut cave for Jains. The First cave is dedicated to Lord Vishnu which houses twelve life-size sculptures of Maha Vishnu. The structure dedicated to Lord Vishnu is the oldest among the other complexes present in and around the temple. The 12 Vishnus are considered as the first 12 names of the Chaturvimshatimurti also commonly used by the Yajurvedis during Achamana. The 12 names are Keshava, Narayana, Madhava, Govinda, Vishnu, Madhusudana, Trivikram, Vamana, Shridhara, Hrishikesha, Padmanabha, Damodhara. The sanctum is guarded by Dvarapalas carved on the either sides of the pillars of the rock - cut temple. There are 12 Vishnu Sculptures present on the rock surface and a base of lingam with 24 pits is present inside the Garbhagriha. Archeologist and Historians say that the 24 pits in the base could have represented that the 12 structures of Vishnu present outside are part of the 24 Names of Vishnu and are the most important ones. The complete 24 forms together is the Supreme god Vishnu in the main chamber in the form of a pedestal (Representing Vishnu who also has a form of formlessness). There is a huge Granite foundation carved with steps to reach the  Shrine dedicated to Maha Vishnu, the Foundation consists of several carvings of the mystical animal Yali in different form with non- mystical animal like elephants together.  The other portions of Narthamalai houses the 8th&nbsp;century Jaina Abode, the Aluruttimalai Jain Caves dedicated for people who believe in Jainism. Shrine for Shiva was surrounded by eight shrines, out of which six are present today. The main shrine faces west and the sanctum houses the image of Lingam, the aniconic representation of Shiva. The walls of the sanctum are plain, unlike later Chola temples that have niches to house different images. The sanctum is approached through an Arthamandapa – a hall supported by pillars. The pillars are ornamental, rectangular shaped on the bottom and the top, and octagonal shaped in the middle. The vimana, the shrine over the sanctum has a semi-spherical shape, having four storeys. The sanctum is guarded by Dvarapalas on either sides. The inscriptions are made on the base of the Dvarapalas.\nThere are also two rock-cut caves, one of which houses twelve life size sculptures of Vishnu. The two circular pilasters with circular shafts on four sides of the vimana indicates the antiquity of the temple. The feature is possibly termed Vrittasputitas in silpa texts like Shilparatna. Such a feature is otherwise found only in few other temples like Neyyadiappar Temple, Tillaistanam, Tiruttalinathar Temple in Thiruputhur, central shrine in Moovar Koil in Kodumbalur, Anantheswara temple in Udayarkudi and Kampaheswarar Temple, Thirubuvanam.\nGallery\nFile:Vijayalaya Choleeswaram Nandhi.jpg|Nandhi at Narthamalai temple\nFile:Vijayalaya Choleeswaram.jpg|Full view of Vijayalaya Choleeswaram\nFile:N-TN-C150 Rockcut Vishnu temple.jpg|12 live sized images of Lord Vishnu\nFile:Sculpture at narthamalai,india.jpg|Sculpture of the Dvarapalaka\nFile:Shiva Lingam At Narthamalai.jpg|Shiva Lingam At Narthamalai\nFile:Jain cave facing the Vijalaya Choleeswara temple.jpg|Aluruttimalai Jain Caves\nSignificance\nThe temple in a combined rock-cut and Dravidan architecture is an early example of Cholan Art, continuing the tradition of the Pallavas. It is believed that the temple was the inspiration for the Gangaikonda Cholesvarar Temple built by Rajendra Chola I (1014-44 CE).  There were originally eight subsidiary shrines around the temple, out of which six still exist. Each of them is identical, with a semi-spherical top, and a four pillared Madapa at the front.\nThe Vimana, the shrine over the sanctum has sculptures of Uma, Shiva, Dakshinamurthy, and Saptamatrikas. The individual images retrieved from the place are maintained in the Pudukottia Government Museum. The temple is the foremost structural of the Chola kings, who would later on go on to make Great Living Chola Temples in the next 300&nbsp;years, declared as UNESCO as a World Heritage Sites. The temple is first among South Indian temples to incorporate dravida and Vasara styles to be incorporated in the vimana.\nReferences\nFurther reading\n*\nExternal links"
    }
  ]
}