{
  "content": [
    {
      "type": "text",
      "text": "# Vikingdom\n\n| runtime        = 114 minutes\n| country        = MalaysiaUnited States\n| language       = English\n| budget         = $15.6 million (est.)\n| gross          = $550,796\n}}\nVikingdom is an English-speaking fantasy action film directed by Yusry Abdul Halim, produced by Shireen M. Hashim, written by Abdul Halim, and starring Dominic Purcell, Conan Stevens, Craig Fairbrass, Natassia Malthe, and Jon Foo.\nThe film was released in Malaysia and the United States on 12 September 2013 and 4 October 2013 respectively. Upon its release, Vikingdom was a major box office bomb with grossing only $550,000 against an estimated production budget of $15 million and it received general poor critical reaction from critics.\nPlot\nBased on Viking folklore and the poems they left, Vikingdom is a fantasy, action adventure film about a forgotten king named Eirick. Tasked with the impossible odds to defeat Thor, the Norse god of thunder, who is on a mission to gather key ancient relics: the Mjölnir, his hammer from Valhalla; the Necklace of Mary Magdalene from Midgard; and the Horn from Helheim. This needs to be accomplished before the sinister event of the Blood Eclipse, or else dire consequences will be faced by all in the realm.\nCast\n* Dominic Purcell as Eirick, a Viking warrior\n* Natassia Malthe as Brynna\n* Conan Stevens as Thor, the powerful Norse God of Thunder\n* Jon Foo as Yang\n* Craig Fairbrass as Sven\n* Bruce Blain as Bernard\n* Jesse Moss as Frey, a powerful sorcerer bent on wiping out humanity and destroying Christianity.\n* Tegan Moss as Freyja, Frey's sister.\n* Patrick Murray as Alcuin\n* Creighton Mark Johnson as Raider Captain\n* Michael Hagerty-Roach as Yorick\n* Byron Gibson\n* Trevor Coppola\n* Tim B. Doughty\n* Matt William Knowles as Viking Warrior\nReception\nCritical reception for Vikingdom was predominantly negative and the film holds a rating of 39 on Metacritic (based on 6 reviews) and 43% on Rotten Tomatoes (based on 7 reviews).\nDennis Harvey of Variety remarks of the film being \"lively and colorful, albeit in ways that will often seem cheesy to audiences accustomed to more sophisticated and expensive fare.\" He also noted of the screenplay being \"a near-nonsensical string of action setpieces [...] not without humor\" though the dialogue presented \"often amuses unintentionally.\"\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}