{
  "content": [
    {
      "type": "text",
      "text": "# Vikings season 6\n\n| num_episodes  = 20\n| network       =\n| first_aired    =\n| last_aired     =\n| first_aired2   =\n| last_aired2    =\n| episode_list   = List of Vikings episodes\n}}\nThe sixth and final season of the historical drama television series Vikings premiered on December 4, 2019, on History in Canada.  The series broadly follows the exploits of the legendary Viking chieftain Ragnar Lothbrok and his crew, and later those of his sons.\nThe sixth season consists of a double-season order of twenty episodes, split into two parts of ten episodes; the second half was released in its entirety on December 30, 2020, on Amazon Prime Video in Ireland, the United States, the United Kingdom, Germany, and Austria, ahead of its broadcast on History in Canada from January 1 to March 3, 2021. The season focuses on King Bjorn's reign over Kattegat, Ivar's adventures in Rus' and Wessex, and Ubbe's expeditions to Iceland and North America (Greenland and Mi'kma'ki/Canada).\nCast\nMain\n* Katheryn Winnick as Lagertha, a shield-maiden, Ragnar's first wife and former queen of Kattegat (part 1)\n* Alexander Ludwig as King Bjorn Ironside, Ragnar and Lagertha's son, king of Kattegat, and husband to Gunnhild and Ingrid.\n** Nathan O'Toole portrays a young Bjorn Ironside, appearing in a flashback\n* Alex Høgh Andersen as King Ivar the Boneless, fourth son of Ragnar and Aslaug and former king of Kattegat. After fleeing Kattegat, he finds refuge in Rus'.\n* Marco Ilsø as Hvitserk, second son of Ragnar and Aslaug. After the death of Thora, he becomes a drunkard.\n* Jordan Patrick Smith as Ubbe, eldest son of Ragnar and Aslaug and Torvi's husband\n* Danila Kozlovsky as Prince Oleg the Prophet, the Varangian grand prince of Kiev who welcomes Ivar at his court\n* John Kavanagh as The Seer, the former seiðrmann of Kattegat, appearing in visions\n* Peter Franzén as King Harald Finehair, a Viking warlord intended to become the first King of All Norway\n* Eric Johnson as Erik, an outlaw who helps Bjorn.\n* Georgia Hirst as Torvi, Ubbe's wife and a shield-maiden. She was once Bjorn's spouse.\n* Ragga Ragnars as Queen Gunnhild, Bjorn's wife, queen of Kattegat and a shield-maiden\n* Ray Stevenson as Othere, a mysterious wanderer\n* Gustaf Skarsgård as Floki, a gifted shipbuilder (part 2)\n* Jasper Pääkkönen as Halfdan the Black, Harald's violent younger brother, appearing in a vision (part 2)\nRecurring\n* Lucy Martin as Queen Ingrid, a slave serving Gunnhild and Bjorn in Kattegat and, later, Bjorn's second wife.\n* Kieran O'Reilly as White Hair, Ivar's former bodyguard and an outlaw (part 1)\n* Kristy Dawn Dinsmore as Amma, a shield-maiden in Kattegat who is fond of Hvitserk\n* Andrei Claude as Ganbaatar, Oleg's captain\n* Elodie Curry as Asa, Bjorn and Torvi's daughter\n* Ryan Henson as Hali, Bjorn and Torvi's son\n* Adam Copeland as Kjetill Flatnose (/ʃjetil/), the chief of the Icelandic settlement\n* Lenn Kudrjawizki as Prince Dir of Novgorod, Oleg's brother\n* Oran Glynn O'Donovan as Prince Igor, the preadolescent heir of Kiev and Oleg's ward\n* Serena Kennedy (part 1) and Isabelle Connolly (part 2) as Anna, Dir's wife\n* Steven Berkoff as King Olaf the Stout\n* Conn Rogers as Canute, a member of King Olaf's court\n* Eve Connolly as Thora, Hvitserk's murdered love interest, appearing in his delusions\n* Gina Costigan as Runa, a former shield-maiden at Lagertha's village\n* David Sterne as Gudmund, an old man at Lagertha's village\n* Kathy Monahan as Eira, a former shield-maiden at Lagertha's village\n* Oisin Murray as Tarben, a young boy at Lagertha's village\n* Aoibheann McCann as Skadi, a shield-maiden under Gunnhild's command\n* Alicia Agneson as Princess Katia, Oleg's wife\n* Fredrik Hiller as Jarl Thorkell the Tall, one of the jarls of Norway and a rival to Bjorn\n* Amy De Bhrún as Jarl Hrolf, one the jarls of Norway\n* Mishaël Lopes Cardozo as King Hakon, one of the kings of Norway and a rival to Bjorn\n* Kelly Campbell as Ingvild, Kjetill's wife\n* Scott Graham as Frodi, Kjetill's son\n* Brent Burns as Skane, one of Harald's ambitious followers\n* Ivo Alexandre as Bishop Leon, who visits Kiev for Easter\n* Noella Brennan as Gudrid, a settler in Ubbe's party\n* Ian Lloyd Anderson as Naad, a settler in Ubbe's party\n* Ferdia Walsh-Peelo as King Alfred, the ruler of Wessex\n* Róisín Murphy as Queen Elsewith, King Alfred's wife\n* Wesley French as Peminuit, a Miꞌkmaq warrior\n* Phillip Lewitski as We'jitu, Peminuit's younger brother\n* Russell Balogh as Bishop Aldulf, a warrior priest in King Alfred's army\n* Breffni Holahan as Sister Annis, a nun who assists Queen Elsewith\n* Brendan McCormack as Leof, a soldier in King Alfred's army\n* Oliver Price as Galan, a soldier in King Alfred's army\n* Dafhyd Flynn as Adam, a soldier in King Alfred's army\n* Tim Creed as Orlyg, a slave in the service of King Erik in Kattegat\n* Carmen Moore as Pekitaulet, Peminuit and We'jitu's mother and the Sagamaw of her tribe\n* Ellyn Jade as Nikani, Peminuit's wife\n* Acahkos Johnson as Na'pa'tes, a Miꞌkmaq child\n* Victoire Dauxerre as Nissa, a slave in the service of Queen Ingrid in Kattegat\n* Sean McGillicuddy as Osric, Bishop Aldulf's second-in-command\nGuest\n* Martin Maloney as Vigrid, Ivar's travel companion (part 1)\n* Blake Kubena as Prince Askold of Novgorod, Oleg's brother\n* Sandy Kennedy as Sylvi, a former shield-maiden at Lagertha's village\n* Neil Keery as Alexei, a guard in Kiev\n* Jinny Lofthouse as Hild, a shield-maiden under Gunnhild's command\n* Emma Willis as Gyda, a shield maiden that volunteers as a sacrifice\n* Karen Connell as the Angel of Death, a völva\n* Adam Winnick as Rangvald, Harald's captain\n* Emma Eliza Regan as Aoife, a villager from Istrehågan\n* Ronan Summers as Herigar, one of Erik's warriors\n* Katherine Devlin as Natasha, at Oleg's court\n* Noah Syndergaard as Thorbjorn, a Viking warrior in Kattegat\n* Jerry-Jane Pears as Iðunn, the goddess of youth, who appears to Hvitserk\n* Bryan Larkin as Wiglaf, a Saxon commander\nNorwegian actor and YouTuber Per Fredrik Åsly (better known as PelleK) appears in \"All the Prisoners\", \"The Key\" and \"Resurrection\" as an envoy from Ubbe's trade expedition. Polish singer Anna Maria Jopek appears in \"Death and the Serpent\", performing the song \"Lagertha's Lament\" alongside musician Maciej Rychly. She returns in \"The Ice Maiden\" to dub Georgia Hirst as Torvi when she sings at Lagertha's funeral.\nEpisodes\n|c=#83A4AE}}\n| ShortSummary    = Ivar and his bodyguard Vigrid travel the Silk Road. As they enter Kievan Rus', they are captured by men loyal to Prince Oleg the Prophet. After torturing and dismembering Vigrid, Oleg finds out Ivar's full story and takes an interest in the exiled king. The pair form an uneasy friendship after Oleg reveals how he murdered his wife. Oleg discloses to Ivar that he plans to reclaim the Rus' people's ancestral lands in Scandinavia and invites Ivar to join him. In Kattegat, Bjorn outlaws White Hair and Ivar's remaining retainers. Lagertha announces her plan to retire and rebuild her old farm, and live out the rest of her life in obscurity. Messengers arrive and inform Bjorn that King Olaf has occupied King Harald's kingdom and holds him captive. Having saved Bjorn's life twice, Harald asks for his aid in reclaiming his freedom and lands.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = Against Lagertha's advice, Bjorn decides to go to Harald's aid. Kjetill returns to Kattegat in search of new settlers to help build Iceland. Ubbe is interested in following him as Kjetill claims that one of the settlers is the fabled Othere, who has sighted a new land west of Iceland. Torvi reveals that she is pregnant. Kjetill says Floki has vanished, raising the suspicion of Bjorn. Bjorn browbeats Kjetill into joining his war party. In Kievan Rus' Oleg and Ivar travel to Novgorod to meet Oleg's brother Askold and retrieve Oleg's nephew Igor, the heir to the kingdom. Oleg has Askold poisoned, while Ivar forms a connection with Igor. Oleg's other brother Dir soon arrives to arrest Oleg, but when Oleg shows apparent prophetic power by producing Dir's secret wife Anna, Dir is forced to let them go.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = After returning to Kiev with Igor and Ivar, Oleg has Dir attacked and imprisoned. While Ivar teaches Igor Old Norse, they discover Dir mutilated and bound like a dog. The sight amuses Igor but troubles Ivar. In Kattegat, Bjorn is seduced by Gunnhild's servant Ingrid. As he leaves to rescue Harald he places Ubbe in command while leaving his children Hali and Asa with Lagertha. Ubbe announces plans to send Hvitserk on a trade expedition along the Silk Road. Hvitserk is tormented by visions of his murdered lover Thora and Aslaug's murder. Gunnhild reveals to Hvitserk that she is pregnant. Lagertha's neighbors are attacked and raped by White Hair and the other bandits, so they seek Lagertha's help. In Vestfold, Harald has befriended Olaf's steward Canute and attempts to convince him to release him. Canute says that Bjorn has arrived to liberate him. Bjorn and his warriors attempt to swim into the harbor of the Tamdrup, the capital, but Olaf has put oil in the water to set the bay ablaze. Bjorn is forced to retreat.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = Bjorn's army is surrounded by Olaf's. Kjetill confesses to Bjorn that he murdered Eyvind and his family but had nothing to do with Floki's disappearance, but Bjorn is unconvinced. In Kiev, Ivar secretly undermines Oleg: he reminds Igor that everything in Rus' is his, and promises Dir that he will help him escape in return for his support against Oleg. Oleg informs Ivar that he is gathering an army to invade Scandinavia, and Ivar accuses him of using him as a puppet king. White Hair's band attacks Lagertha's village; the farmers fight off the bandits, but many are killed, including Hali. In Kattegat, Gunnhild has a vision of the attack and leaves the city to return to Lagertha. Ubbe names Hvitserk as leader of a trading party to the Silk Road, but Hvitserk misses the boat, causing Ubbe to disown him. Olaf summons Bjorn and Harald and informs them he wants to gather the kings and earls of Norway to vote for a single king to rule; Olaf intends this to be Bjorn.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = Jarl Thorkell arrives in Vestfold and is welcomed by Olaf. Gunnhild finds Lagertha and learns of Hali's death; she decides to stay and defend the village with her shield-maidens. Hvitserk has another vision of Thora; he swears on his arm ring that he will avenge her death by killing Ivar. Thorkell proposes that any of the leaders be allowed to contest the election; everyone agrees. Bjorn is introduced to Jarl Hrolf and King Hakon. Ivar and Igor free Dir; they are then introduced to Oleg's intended, Princess Katia. Ivar is shocked at her resemblance to Freydis. Hvitserk gives up his arm ring to pay for hallucinogenic mushrooms and beer; while high, he has a cryptic vision of the seer. King Olaf presents Thorkell, Hakon, Bjorn, and Harald as the four election candidates; he then publicly votes for Bjorn. Torvi tells Ingrid that there is no point in waiting for Bjorn's return. Harald votes for Bjorn. An envoy from the trading party to the Silk Road returns and informs Ubbe that Ivar is in Kiev. Ubbe asks Amma to tell Hvitserk, who has a monstrous vision of Ivar.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = White Hair and his bandits attack the village again. The villagers win after a hard battle, which culminates with Lagertha killing White Hair in single combat. Seriously wounded, Lagertha rides back to Kattegat to meet Bjorn. In Kiev, Oleg and Katia are married; later, they torment Ivar by having sex in front of him. In Vestfold, Harald wins the election and is crowned King of All Norway; Harald and Kjetill campaigned for Harald's victory with promises to the various kings and earls, Kjetill being promised kingship of Iceland. Kjetill realizes Harald, distrustful, will have Bjorn killed, so he tells Bjorn. Bjorn and Kjetill are cornered by Harald's men but are saved by the outlaw Erik, who takes them to his ship. Lagertha arrives in Kattegat; while dragging herself toward the great hall, she has a vision of the Seer. Hvitserk, in a state of delirium, hallucinates Ivar as a serpent and attacks it. As he comes to his senses, he realizes he has actually stabbed Lagertha to death.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = In Kattegat, Lagertha's body is found and Hvitserk is missing. Worried about her children, Torvi travels to Lagertha's farmstead and Asa tells her of Hali's death. In Vestfold, King Hakon pledges allegiance to Harald; when Olaf refuses to do the same, Harald has him imprisoned. Amma locates Hvitserk in the forest and brings him back to Kattegat; Ubbe asks him if he knew of Lagertha's death, but Hvitserk refuses to answer. In Kiev, Ivar is told by a messenger that Dir is in hiding and will help Ivar overthrow Oleg when the time comes. Torvi and Gunnhild arrange Lagertha's funeral; a girl named Gyda is sacrificed to follow her to Valhalla. At the pyre, Ubbe, Gunnhild, and Torvi say goodbye; Bjorn returns, says goodbye to his mother, and swears to seek vengeance for her murder.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = Bjorn puts Hvitserk on trial for the murder of Lagertha; Hvitserk confesses and Bjorn sentences him to be burned alive. Ubbe attempts to convince Hvitserk to ask for mercy, but Hvitserk believes he was guided by the gods to avenge Aslaug. When Hvitserk is about to be burned, Ubbe saves his life; then, Bjorn banishes Hvitserk. Later, Gunnhild discovers Bjorn having sex with Ingrid; she suggests that Bjorn take Ingrid as a second wife. Ubbe, Torvi, and Asa travel to Iceland with Kjetill. In Kiev, Oleg sends raiding parties to Scandinavia in preparation for a larger invasion. Igor openly challenges Oleg, who threatens to have him killed if he should try again. Igor runs away crying and is comforted by Ivar. One of the Rus's raiding parties sacks Istrehågan and the survivors report to Harald. Olaf warns Harald that an invasion is coming.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = In Iceland, Ubbe is introduced to Othere, a wanderer who glimpsed the coasts of a golden land to the west. Torvi has difficult labor and almost dies, but survives and gives birth to a boy whom she and Ubbe call Ragnar. Othere is revealed to be a former Christian monk named Athelstan, who has adopted the identity of a dying wanderer. Ubbe wants to sacrifice Othere to the gods, but he is reminded by Torvi that he himself was once baptized. Othere gives Ubbe Floki's wedding ring, saying that he met him before he disappeared; Ubbe is skeptical. In Kattegat, Bjorn takes Ingrid as his second wife, with Gunnhild's blessing. He asks Erik to patrol his borders; Erik's party is attacked by Ganbaatar and his Rus' soldiers. Bjorn sends Erik to Vestfold to ask Harald to join forces against the Rus', but Harald instead arrests Erik for being an outlaw. After Olaf's plea, Harald listens to Erik and agrees to join with Bjorn. Hvitserk is found by the Rus' and Ivar takes him to Kiev; Hvitserk tells Ivar he killed Lagertha, and is received by Oleg and Katia. An informer tells Ivar that Dir expects him to help overthrow Oleg after the invasion. Oleg parades his army outside the city walls, declaring this to be the end of paganism.\n| LineColor       = 83A4AE\n}}\n| ShortSummary    = In Vestfold, Bjorn and Harald prepare for the incoming Rus' attack by fortifying Tamdrump's fjord, the river to the north, and the beach in between; during the preparations, Gunnhild loses her unborn child. Frustrated with Bjorn having taken a second wife, Harald rapes Ingrid. Of the many kings and earls of Norway, only Thorkell and his men have joined Harald's army. In Kiev, Katia offers herself to Ivar, but he refuses; she later tells him that she is not satisfied with her marriage to Oleg. Ivar helps Oleg plan the invasion and suggests the Rus' attack both the beach and the river, despite the mountain between the river and the capital. The majority of the Rus' fleet attacks the beach and Harald, Bjorn and Erik lead the defense. Ivar, Hvitserk, Oleg, and their men manage to breach the block at the river mouth, defended by Gunnhild. The Rus' climb the mountain and surround the Viking army at the beach. Thorkell is killed and Harald is seriously wounded; when Erik tries to help him, Harald orders him to retreat. Bjorn continues to fight as his army is overwhelmed; suddenly, Ivar appears and stabs Bjorn with a sword. The Rus' celebrate the victory.\n| LineColor       = 83A4AE\n}}\n|c=#241819|r= }}\n| ShortSummary    = After the defeat of Harald's and Bjorn's forces, the Rus have occupied Tamdrup and prepare to attack Kattegat. Harald is revealed to still be alive and captured by the Rus as well as King Olaf. At Oleg's behest, Igor burns King Olaf alive. Meanwhile Harald, intent on not being a pawn for Oleg, escapes. In Kattegat King Hakon and Jarl Hrolf have arrived with their armies. Bjorn is revealed to still be alive, but slowly dying from his wound. In Iceland, Ubbe prepares for their expedition. Othere reveals how Kjetill and Frodi murdered Eyvind's family. Bjorn realizes that Ingrid is pregnant and believes the child to be his. Hakon travels to the Rus camp providing news of Bjorn's passing and surrenders to him, only to be killed by Oleg's captain Ganbaatar. As the Rus hold mass, Bjorn suddenly appears, confusing and scaring them. Ganbaatar shoots Bjorn with arrows, but Bjorn manages to order an attack before passing, giving the impression of being immortal. The Norwegian coalition attacks the panicking Rus from multiple directions. Ganbaatar kills Amma with his bow but is decapitated by Gunnhild. Defeated, the Rus flee Norway while Bjorn is buried in a mound.\n| LineColor       = 241819\n}}\n| ShortSummary    = Oleg's army returns in defeat to Kiev. Oleg has Igor and Ivar separated and destroys Igor's chamber, claiming to want to make a man out of him. In Kattegat, Gunnhild mourns the death of Bjorn. Erik approaches her, suggesting she summon an Althing to elect her as queen of Kattegat. Secretly, he makes a similar offer to Ingrid. They accept since Gunnhild wants to uphold Bjorn's legacy and Ingrid believes she is carrying Bjorn's child. Oleg forces the officers of his army to dig their own grave and then has them killed, forcing Igor to kill one of them. Soon afterward Ivar and Igor are approached by Dir who informs them that many of Oleg's soldiers have switched sides to him, enabling him to challenge Oleg. Dir asks Ivar to spirit away Igor when given a signal. Oleg attempts to recruit Hvitserk as his bodyguard. In Iceland, Kjetill expresses regret over the murder of Eyvind's family to his wife Ingvild and feels joining Ubbe's expedition will give him redemption. After discussing Freydis with Katia, Ivar is seduced by her. Afterward, Katia asks if Ivar knows of Dir's whereabouts, causing Ivar to disclose the plan.\n| LineColor       = 241819\n}}\n| ShortSummary    = In Kattegat, Ingrid and Gunnhild are running to be the Queen of Kattegat but King Harald returns, invoking his right to the kingship as Norway's elected king. After seeing Ingrid performing a ritual in Bjorn's mound, Erik thinks that she is a witch. On the Atlantic Ocean Ubbe's expedition is hit by a storm. Torvi's daughter Asa is washed overboard after seeing Jörmungandr and is lost. In Kiev, Ivar is prevented from seeing Igor by Oleg's guards, including Hvitserk. Hvitserk claims Oleg treats him well and is the future ruler of the world. The brothers end up in a fight with Ivar on the receiving end of Hvitserk’s beating. Oleg later offers Ivar to have Hvitserk killed. Katia and Ivar meet secretly: she gives him a blade and tells him that Prince Dir is ready. Ivar then approaches his brother Hvitserk and tells him Oleg offered to kill him; he wants him to join Prince Dir’s plan. As Oleg is busy with the Good Friday ceremonies, Katia sneaks Igor out of the palace. Ivar, Katia, Hvitserk, and Igor attempt to leave the gates in a horse and carriage. Suddenly, Prince Oleg realizes that Igor is not present at the ceremony.\n| LineColor       = 241819\n}}\n| ShortSummary    = Ivar's and Igor's cart passes through a passion play where Oleg is playing the role of Jesus. Bishop Leon stops the cart but then allows the cart to pass after seemingly recognizing Igor. Ivar successfully delivers Igor to Novgorod and Dir who has gathered substantial support against Oleg. In Kattegat, Harald is crowned as king by Erik who in turn is made the head of his bodyguard. Harald proposes to marry both Gunnhild and Ingrid, convinced that the child the latter is carrying is his and not Bjorn's. Ingrid later admits to Gunnhild that she is not sure who the father of her child is. Gunnhild is conflicted and confides in Bjorn's mound that the golden age of the Vikings might be over. Ubbe's expedition eventually finds land, but it's far from the \"golden land\" Othere described. As a joke, Kjetill names the new land \"Greenland\". The land is divided up between the settlers but tension rises as there is no food. In the morning, Frodi discovers that a whale has been beached on his and Kjetill's land.\n| LineColor       = 241819\n}}\n| ShortSummary    = Dir's forces march on Kiev, with the garrison surrendering peacefully to him. Oleg, who is losing his grip on reality, appears on a balcony and pleads for forgiveness by Igor. Encouraged by Ivar, Igor shoots him to death with an arrow. During the celebrations, Katia tells Ivar that she is carrying his child, but Ivar states he has other ambitions. As Ivar prepares to leave Kiev he is confronted by Igor who does not want him to leave. After telling Igor that he has to stand on his own legs to be king, Ivar and Hvitserk leave. Despite Ivar's refusal, Hvitserk maintains that Ivar has changed. In Kattegat, Ingrid reveals to Erik that she was sold into slavery by him. Harald later marries Ingrid, but Gunnhild drowns herself to join Bjorn in Valhalla. In Greenland, tensions reach a fever pitch as Kjetill refuses to share the whale with the rest of the settlers. A fight breaks out over the whale, and Ubbe is forced to kill Frodi in self-defense when he tries to break it up. Othere drags Ubbe out of the fight and they flee to their ship with Torvi and the more levelheaded settlers. An insane Kjetill is left standing atop the whale declaring himself King of Greenland.\n| LineColor       = 241819\n}}\n| ShortSummary    = Ubbe's expedition is lost at sea with their meager supply of food and water quickly dwindling; a boy drinks seawater and later dies. Torvi is unable to produce milk to feed baby Ragnar. Ivar and Hvitserk return to Kattegat, but are seen as traitors by the public. At a feast, Harald makes a charismatic speech to the people convincing them to forgive Ivar and Hvitserk for fighting with the Rus. Hvitserk mourns at Bjorn's mound where he is visited by Iðunn who spends the night with him. Ivar confides in Hvitserk in feeling lost. Remembering a game of chess with King Alfred, Ivar decides to raid Wessex. Harald, disillusioned with ruling, decides to join Ivar.\n| LineColor       = 241819\n}}\n| ShortSummary    = Harald assembles a fleet. Harald appoints Erik the acting king in his place, with Erik having the last say over Ingrid. As the fleet leaves, Erik makes it clear that he wants to take Harald's place as King for life and claim Ingrid as his. Ingrid starts an affair with Erik but secretly curses him using her witchcraft which makes Erik eventually blind. In England, Ivar suggests the Norwegian fleet take position at Eddington. The Norwegians then start to ravage the countryside to lure Alfred to them. A raiding party led by Ivar is attacked by English forces, but they are saved by Hvitserk. The raids eventually force Alfred to evacuate the capital while gathering his forces. On the Atlantic, the dwindling expedition led by Ubbe finally spots land.\n| LineColor       = 241819\n}}\n| ShortSummary    = The new land found by Ubbe's expedition is found to be rich in berries and wildlife, saving them from starvation. As they build and explore, Othere discovers signs of previous Norse settlement. Ubbe leaves gifts close to some carvings and later finds the gifts taken and replaced by new gifts. In England, Ivar plans to ambush the English in a nearby forest. Ivar states his wish to Hvitserk to be the most famous Viking who ever lived and his child by Katia will make sure his bloodline lives on. Hvitserk is alarmed by the white of Ivar's eyes being unusually blue which they take as a sign of Ivar being at risk of breaking a bone. Meanwhile, Alfred has gathered his army. In Kattegat, Erik has become dependent on Ingrid's authority as the wife of Harald in order to rule. Ingrid orders the assassination of a Danish king that has converted to christianity. Erik blames Ingrid for his blindness and orders the slave Orlyg to murder Ingrid in exchange for his freedom. Ubbe and the settlers continue to explore the new land and come across another settlement. They are quickly surrounded by native warriors.\n| LineColor       = 241819\n}}\n| ShortSummary    = In the new land, the native warriors make peace gestures. The tribe, introducing themself as the Miꞌkmaq, invite the settlers to eat with them. Orlyg confides to his fellow slave Nissa about Erik's request for him to kill Ingrid. Othere, and later Ubbe, recognizes that the sagamaw of the tribe, Pekitaulet, knows some Old Norse.  Ubbe is told of another Nordic explorer who appeared in their land before their arrival. The settler Naad has discovered gold among the gifts the natives left for the settlers and tries to inquire about its origin. Erik is seduced by Nissa in a hut and is killed by her while Ingrid's men kill Orlyg when he attempts to assassinate her. In England, Alfred's forces march through the woods and are decimated by traps set by the Vikings. The Norwegians ambush them and the English are forced to retreat. In the chaos, Alfred sees a vision of Jesus and is convinced the English will eventually triumph. Harald is separated from his forces in the mist and is fatally stabbed by bishop Aldulf. An apparition of Harald's brother Halfdan appears to him, claiming to have been sent to retrieve Harald to Valhalla. Before passing, Harald stabs Aldulf to death. The natives lead Ubbe to the man they learned Norse from: Floki.\n| LineColor       = 241819\n}}\n| ShortSummary    = Floki tells Ubbe and Torvi of how he traveled to the new land from Iceland after being disillusioned with the Icelandic settlement. In England, Ivar and Alfred negotiate but Alfred refuses to agree to Ivar's conditions. Naad goes looking for gold in a hut and kills Pekitaulet's son We'jitu when he tries to stop him. The natives capture Naad and Ubbe promises to punish him. After initially preparing to carve a blood eagle, Ubbe opts at the last minute to quickly slit Naad's throat instead. The Norwegian army, now under Ivar's control, attack the English in a ferocious battle. Ivar's condition is increasingly worsened. When Hvitserk is wounded, Ivar orders him to stand down, proclaiming his whole life has led to this moment. Ivar – accepting that he now belongs in Valhalla – willingly lets an English soldier stab him to death and the battle stops. The Norwegians go home as Hvitserk mourns and buries Ivar. Alfred offers Hvitserk to come with him to the royal villa; he is subsequently baptized with Alfred as his godfather and assumes the Christian name Athelstan. In Kattegat, after hearing of the deaths of Ivar and Harald, Ingrid assumes full power over Norway as Queen. The series ends with Ubbe and Floki conversing on a beach, with Floki advising Ubbe to let go of the past. After Floki says he will die soon, Ubbe asks: \"Is that the end?\", with both of them remaining silent as they watch the sunset.\n| LineColor       = 241819\n}}\nProduction\nDevelopment\nAn Irish-Canadian co-production presented by Metro-Goldwyn-Mayer, the sixth and final season of Vikings was developed and produced by TM Productions and Take 5 Productions. Morgan O'Sullivan, Sheila Hockin, Sherry Marsh, Alan Gasmer, James Flynn, John Weber, and Michael Hirst are credited as executive producers. This season was produced by Keith Thompson for the first eleven episodes, and Liz Gill for the remaining nine episodes. Bill Goddard and Séamus McInerney are co-producers.\nThe production team for this season includes casting directors Frank and Nuala Moiselle, costume designer Susan O'Connor Cave, visual effects supervisor Dominic Remane, stunt action designer Richard Ryan, composer Trevor Morris, production designer Mark Geraghty, editors Aaron Marshall for the first, fourth, eighth, tenth, twelfth, fifteenth, seventeenth and twentieth episodes, Tad Seaborn for the second, fifth, seventh, ninth, thirteenth, sixteenth and nineteenth episodes, and Dan Briceno for the third, sixth, eleventh, fourteenth and eighteenth episodes and cinematographers Peter Robertson for the first to third, seventh to thirteenth, and sixteenth to twentieth episodes, Owen McPolin for the fourth to sixth episodes, and PJ Dillon for the fourteenth and fifteenth episodes.\nThe eighth episode of the season, \"Valhalla Can Wait\", was directed by actress Katheryn Winnick, who portrays Lagertha in the series.\nWriting\nAccording to the series's creator and writer Michael Hirst, the idea to explore Oleg the Prophet came to him due to the influence Vikings played in Russian history: \"I didn't know that Russia is called Russia because it was founded by the Rus Vikings. I learned so much myself and I always do learn when we go different places and explore new cultures and forgotten languages. [...] I was reading books about the Silk Road and about the Rus Vikings and then I read about Prince Oleg, the prophet. He was this extraordinary ruler of Russia and it all kind of fit into place. It seemed the most obvious. It’s also one of the most exciting things to do because we'd been traveling west so much and it seemed logical to go east again. It was an idea that slowly fermented in my mind.\"\nCasting\nIn September 2017, it was announced that Russian actor Danila Kozlovsky would join the cast for the sixth season as Oleg of Novgorod, the 10th century Varangian ruler of the Kievan Rus.\nFilming\n, County Wicklow]]\nThis season is set in areas corresponding to modern Ukraine and Norway, but filming locations included Vik, Norway, standing in for the home of the Rus' Vikings of Kiev, and County Wicklow, Ireland. Some scenes were also shot outside Dublin, at the River Boyne (County Meath), Blessington lakes and Powerscourt Waterfall, Powerscourt Estate (County Wicklow) and at Nuns Beach at Ballybunion (County Kerry) standing in for the Icelandic coast. Scenes that take place in Kattegat were shot in Lough Tay (County Wicklow). Ashford Studios (County Wicklow) were again used as the base for  production, where those scenes requiring the use of green screens for CGI were shot.\nMusic\n| recorded   =\n| venue      =\n| studio     =\n| genre      = Soundtrack\n| length     =\n| label      = Sony Classical Records\n| producer   =\n| prev_title =\n| prev_year  =\n| next_title =\n| next_year  =\n}}\nThe musical score for the sixth and final season was composed by Trevor Morris. Einar Selvik did not return to collaborate with Morris on new original music for the final season. The opening sequence is again accompanied by the song \"If I Had a Heart\" by Fever Ray, with the final ten episodes featuring a remix of the song by Tim Hecker in place of the original.\nThe soundtrack album was released on December 6, 2019, by Sony Classical Records. Two original songs not included in the album are \"Lament for Lagertha\" and \"Lagertha's Funeral Music\", both written by Maciej Rychly & Alicja Bral and performed by Anna Maria Jopek and the Goat Theater Performers, featured in \"Death and the Serpent\" and \"The Ice Maiden\", respectively. The Skaldic version of \"Snake Pit Poetry\", an original song by Einar Selvik which was first included in \"All His Angels\", is featured in \"The Best Laid Plans\".\nAdditional non-original music by Norwegian music group Wardruna is featured in the episodes \"Ghosts, Gods and Running Dogs\", \"The Key\", \"The Ice Maiden\" and \"The Last Act\". The featured tracks are \"Tyr\", \"Helvegen\", \"Isa\" and \"Vindavla\".\nMusic by Danish folk project Danheim is also featured in this season's soundtrack in the episodes \"Resurrection\", \"The Best Laid Plans\", \"The Signal\" and \"The Raft of Medusa\". The featured tracks are \"Vanheimr\", \"Tyrfing\", \"Floki's Last Journey\", \"Gripir\", \"Munarvagr\" and \"Hefja Blót\".\nAdditional music by folk band Heilung is featured in the episode \"The Best Laid Plans\". The featured tracks are \"Fylgija Ear\", \"Hamrer Hippyer\" and \"Alfadhirhaiti\". \"Fra Stjerner till Jorda\" by Norwegian artist Runahild is also featured in \"The Best Laid Plans\". \"Hlidskjalf\" by Osi and the Jupiter is featured in \"The Raft of the Medusa\". The pieces \"Babel\" and \"Grigori\" from the album The Word as Power by Lustmord appear in \"The Best Laid Plans\" and \"All at Sea\".\nReception\nThe review aggregator website Rotten Tomatoes reported a perfect 100% approval rating, with an average rating of 7.8/10 based on 12 reviews.\nHistorical inaccuracies\nThe depiction of Kievan Rus during Prince Oleg's rule (879–912) has been noted as substantially inaccurate by fans and the media. Most notably, in the series Christianity is introduced in Kievan Rus too early, as are Mongol clothing and armor and hot air balloons.\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}