{
  "content": [
    {
      "type": "text",
      "text": "# Viking (barque)__disambig_1\n\n|section2=\n|name= Viking\n|owner=A/S Den Danske Handelsflaadens Skoleskib for Befalningsmænd, Copenhagen\n|builder=Burmeister & Wain, Copenhagen, Denmark\n|original_cost=DKK 591,000\n|launched=1 December 1906\n|maiden_voyage= 19 July 1907\n|in_service=1907\n|out_of_service=1915\n|identification=\n|status=\n}}\n|section3=\n|name= Viking\n|owner=Det Forenede Dampskibs-Selskab A/S, Copenhagen\n|in_service=1915\n|out_of_service=1929\n}}\n|section4=\n|name= Viking\n|owner=Gustaf Erikson, Mariehamn, Finland (1929-1950)\n|in_service=1929\n|out_of_service=1950\n}}\n|section5=\n|name= Viking\n|owner=City of Gothenburg, Sweden (1951-present)\n|in_service=1950-\n|status= Floating hotel / museum\n}}\n|section6=\n*\n|displacement= ~\n|length=*  (o/a with bowsprit)\n*  (deck)\n*  (p/p)\n|beam=\n|height=  (foremast above deck)\n|draught=\n|depth=\n|hold_depth=\n|sail_plan=*4 masted barque\n*Sail area\n|speed=\n|capacity=* Cargo hold:\n*Cargo capacity:\n*Ballast:\n|notes=Anchor weight :  each\n}}\n}}\n|location=Gothenburg, Sweden\n|website=\n}}\nViking, (Barken Viking in Swedish (\"the barque Viking\")), is a four-masted steel barque, built in 1906 by Burmeister & Wain in Copenhagen, Denmark. She is reported to be the biggest sailing ship ever built in the Nordic countries. In the 21st century her sailing days have drawn to a close, and she is now moored as a floating hotel in Gothenburg, Sweden.\nShip history\nBy the turn of the 20th century, ship production had almost completely switched to steamships. However, sailing ships were still preferred for crew training. Viking was originally built as a sail training ship for the rapidly growing Danish merchant fleet. At that time, seaworthiness and cargo capacity were given top priority. The ship was launched on December 1, 1906 and was christened Viking in the traditional manner by the Crown Princess, later Queen Alexandrine, of Denmark.\nIn July 1909, Captain Niels Clausen logged the ship's top speed of  at the Roaring Forties, i.e. latitude 40°-50°, with daily distances of 250-275 nautical miles. She was then on her way home fully loaded with wheat from Port Pirie on Spencer Gulf in South Australia.\nOn 25 February 1917, she was sighted and boarded by the German commerce raider . Unusually, the Germans then allowed her to proceed because being Danish, she was a neutral ship. This was something of a lucky escape, because within weeks Germany would return to unrestricted marine warfare, a policy that would have meant the ship's definite sinking.\nFor Gustaf Erikson\nIn 1929, the Åland shipowner Gustaf Erikson bought the ship for £6,500, which then sailed under the Finnish flag. She was now part of his Åland fleet of tall ships. Erikson had a worldwide reputation as a great sailor. In 1931, Viking was fitted out for passengers, who could join the voyages for 25 shillings per person per day.\nAfter several circumnavigations, Viking unloaded her cargo of wheat in Cardiff in the summer of 1939 and then sailed to her home port of Mariehamn, which she entered on July 14. She was then fitted out for her next long voyage, but World War II meant that she remained in port for several years. Viking was towed, along with Passat and Pommern, to Stockholm in July 1944 to be used as a grain silo for the Swedish State Food Commission. In December the following year they were returned to Åland.\nShe participated in several of the Great Grain Races from Port Victoria, South Australia to Falmouth, Cornwall. Viking won the Grain Race of 1948. David James was an apprentice on her voyage around the world in 1937-38, which is described in his biography. David Robb Muirhead  (1921–78) wrote a diary and took photos of his voyage on the Viking as a working passenger in 1948, which records are held in the State Library of South Australia.\nShe was part of Erikson's fleet until 1950. Viking was about to be scrapped in the late 1940s, but was eventually saved by the Swedish government in 1950 and moored in Gothenburg.\nSeamen's school in Gothenburg\nA suspension bridge, Älvsborg Bridge, built in 1966, has effectively locked the ship in, since the masts are taller than the bridge. It is unlikely she ever will sail the open seas again.\nIn January 2021 she was partially demasted to be able to pass under Älvsborg Bridge. Early on January 24, 2021 she was towed to Falkenberg by tug boats Svitzer Thor and Svitzer Bob.\nThere are only ten four-masted barques and one four-masted full-rigged ship (the Falls of Clyde) in existence, and only five of these still sail (Sedov, Kruzenshtern, Sea Cloud I, Nippon Maru II, Kaiwo Maru II). A few more are still afloat and berthed in various harbors (Peking (Hamburg), Moshulu (Philadelphia), Passat (Lübeck, Germany), Pommern (Mariehamn, Finland), Nippon Maru (Yokohama, Japan), and Viking).\nViking came to Gothenburg in Sweden permanently in 1950, as a home for various shipping organizations, and later became a school of seamanship. Today it is moored at Lilla Bommen as hotel \"Barken Viking\". The owner of the hotel  is ESS Hotell AB.\nFinnish artist Lena Ringbom-Lindén, one of a few females on board a ship at that time, sailed on Viking on one of its voyages to Australia. She wrote of her experience in two books, Flicka på skepp (\"Girl on Ship\") and Skeppet och Lena (\"Lena and The Ship\").\nAnother Finn, Gunnar Eklund, the founder of the Viking Line, worked as an apprentice onboard Viking. He earned his master's certificate onboard Pamir.\nCargoes\nViking's cargos:\n* Cement – Denmark\n* Coal – Europe\n* Guano – South America\n* Salt – Germany (Hamburg)\n* Soya beans – Russia (Vladivostok)\n* Stone – Norway\n* Timber – Sweden (Sundsvall)\n* Wheat – Australia\nSee also\n*Grain race\n*Moshulu\n*Pommern\n*Tall ship\n*Windjammer\n*Gustaf Erikson\n*Botel\nReferences\nBibliography\n*\n*\nExternal links\n*[http://www.barkenviking.com/ Official site of Barken Viking]\n*[http://www.bruzelius.info/Nautica/Ships/Fourmast_ships/Viking%281907%29.html/ Ship data of Barken Viking]\n*[https://www.higab.se/vara-hus/barken-viking/ Ship's history]"
    }
  ]
}