{
  "content": [
    {
      "type": "text",
      "text": "# Viking Age in the Faroe Islands\n\nThe Viking Age in the Faroe Islands lasted from Grímur Kamban's conquest of the country around 825 until the death of Tróndur í Gøtu, the last Viking chieftain on the Faroe Islands in 1035, and the rise to power of Leivur Øssursson in the same year. While the Norse settlement in the Faroe Islands can be definitively traced back to sometime between the 9th and 10th centuries, with the first Norsemen on the islands arguably around the late 8th century, accounts from Irish priests such as Dicuil claim monks were there for \"nearly a hundred years\" (in centum ferme annis) beforehand.\nThe biggest historical break in this period was the Christianization of the Faroe Islands by Sigmundur Brestisson in 999, which heralded the end of the Viking Age and at the same time the end of the Faroe Islands as a free settler republic.\nUnfortunately for historians, many sources from this period have been lost in the various devastations of libraries and archives. The most important source we have today is therefore the Færeyinga saga and statements in other external sources that can support the stories there and allow us to date them.\nAlthough the dates and events mentioned in this article are generally regarded as indisputable in the Faroe Islands and form part of the national founding myth, they should always be viewed with a certain degree of caution, as the Faroese saga is not a chronicle in the true sense of the word, but a historical novel. Very clear myths that appear completely unrealistic are labeled as such (usually in the further articles on individual episodes of the saga).\nThere have been numerous archaeological investigations on the Faroe Islands in recent decades so our picture of that time is becoming increasingly clear. Most of the archaeological finds from this period can be found in the National Museum of the Faroe Islands.\nEvidence\nExcavation of a Viking Age farm found in the village of Kvívík on the island Streymoy, shows substantial evidence of farming done in a style common to the Faroe Islands. A longhouse was unearthed during an excavation alongside a byre (smaller dwelling intended to house livestock during winter). This find furthers the validity of the sagas by providing an aspect of the agricultural lifestyle being brought from Norway to the Faroe Islands.\nA more complete example of the agricultural Norse lifestyle on the Faroe Islands can be found at Toftanes, where a preserved longhouse was unearthed with its walls intact. The structure was made of stones and earth and measured 20 meters by 5 meters. A byre was attached to the eastern wall of the longhouse and both what has been determined to be an outhouse. Also on the north end was a house layered in old embers and charcoal, this room was determined to be for making fires.\nThe Sandavágur stone is a runestone discovered in 1917 in Sandvágur. The inscription tells of Torkil Onandarson from Rogaland who first settled that area. The 13th century relic is on display at Sandavágur Church.\nSettlement\nFaroese stamp commemorating the poem \"Grímur Kamban\" by Janus Djurhuus\nWhen the Vikings first visited the Faroe Islands in 795, they found monks from Ireland living as hermits. They, in turn, had found no native population to convert, so they bred sheep and planted oats, among other things, which now allows them to date their arrival to around 625.\nThe history of Viking Age settlement of the Faroe Islands comes from the Færeyinga saga, a manuscript that is now lost. Portions of the tale were inscribed in three other sagas, such as Flateyjarbók and Saga of Óláfr Tryggvason. Similar to other sagas, the historical credibility of the Færeyinga saga is often questioned.\nBoth the Saga of Ólafr Tryggvason and Flateyjarbók claim a man named Grímur Kamban was the first man to discover the Faroe Islands. However, the two sources disagree on the year in which he left and the cause of his departure. Flateyjarbók details the emigration of Grímur Kamban as sometime during the reign of King Harald Hårfagre, between 872 and 930. The Saga of Óláfr Tryggvason indicates that Kamban was residing in the Faroes long before the rule of Harald Hårfagre, and that other Norse were driven to the Faroe Islands due to his chaotic rule.\nThis mass migration to the Faroe Islands shows a prior knowledge of the location of Norse settlements, furthering the claim of Grímur Kamban's settlement much earlier. While Kamban is recognized as the first Norse settler of the Faroe Islands (although his surname is of Gaelic origin), he actually re-settled the island. Writings from the Papar, an order of Irish monks, indicate their settling of the Faroes long before the Norse set foot there, only leaving due to ongoing Viking raids.\nFirst settlement wave\nIt is not entirely clear whether the often-claimed expulsion of the Irish monks by the Vikings around 795 took place, or whether only some of them went to Iceland. In any case, they are considered to be the first settlers there. At this time, the Faroe Islands may have been uninhabited for 30 years, as Scandinavians had not yet settled on the Faroe Islands.Arge, S. V. (1991). The Landnám in the Faroes. Arctic Anthropology, 28(2), 101-120. University of Wisconsin Press. Retrieved from  According to this hypothesis, which is based on the account in the book Liber de Mensura Orbis Terræ by the Irish chronicler Dicuil (825), Grímur Kamban entered a land around 825 where there were only the sheep and seabirds left by the monks.\nThe name Kamban itself suggests a Celtic origin. Grímur Kamban may have come from the British Isles, where the Scandinavians had already established their rule, or he may have been a baptized Norwegian given the nickname by Irish missionaries. In any case, the first people to settle the Faroe Islands around this time were people from the surrounding Scandinavian dominions to the south and east - mostly Scandinavians themselves, but certainly with Celtic slaves and women in their luggage.\nGrímur's settlement is said to have been in Funningur on Eysturoy. Excavations have revealed other Viking settlements in the neighborhood and on the other islands.\nThe Norwegian emigrant Naddoddur also arrived in the Faroe Islands during this period. According to tradition, he discovered Iceland around 850 and named it Snowland. According to a more recent theory, his (presumed) daughter Ann Naddodsdóttir is the mother of Brestir and Beinir, who will be discussed below.\nSecond settlement wave\nThe great immigration to the Faroe Islands took place around 880–900. This wave of land occupation is precisely dated to 885–890. It was the time of Harald Fairhair of Norway (r. 870–933). The Faroese saga tells us that many people fled from his rule. One of the reasons is the tax burden. As in the first land conquest, the immigrants came from Norway and probably also from the parts of the British Isles controlled by Norway.\nThe fact that the majority of these Vikings on the Faroe Islands came from Norway can be determined by a linguistic peculiarity (in addition to other similarities with the dialects of western Norway): In Faroese, northeast is called landnyrðingur (\"land north\"), southeast landsynningur (\"land south\"), northwest útnyrðingur (\"out north\") and southwest útsynningur (\"out south\"). These terms can only be coined by people who live on a continental west coast, such as Bergen. From a Faroese perspective, such a neologism would make no sense, as there is land to the northwest in the form of Iceland and Shetland to the southeast, while the shores of Spitsbergen and Newfoundland are located to the northeast and southwest - terra incognita (unknown land) at the time. And: from a Faroese point of view, every direction is out to sea.\nIt is said that people from the Faroe Islands and Bergen can still communicate in their respective local dialects without much difficulty. The relationship between this Norwegian trading metropolis and later Hanseatic League and the Faroe Islands has always played a special role throughout the centuries. See also: Monopoly trade via the Faroe Islands (period 1529–1856)\nFirst Thing\n, the ancient seat of the Faroe Islands, is still the political center of the country today.]]\nAround 900, the Faroese already had their Thing on the peninsula named after him, Tinganes. Tórshavn thus became the capital of the islands early on. The thing at that time was called the Althing (as is still the case in Iceland today). Since around 1400, it has borne its current name Løgting. It is one of the oldest parliaments in the world (see there). In addition to the central Thing, there were local Thing sites called Várting.\nEven if it is not entirely clear what the political order of the Faroe Islands was like at this time, it is no exaggeration to speak of a Republic, as the king in Norway, 500 kilometers away, had no power on the archipelago during the Viking Age, and the thing was an assembly of the local free men, i.e. the large farmers. This was also where jurisdiction was exercised.\nSettlement and population development\nAt that time, all the islands of the Faroe Islands were already inhabited, except for Lítla Dímun. This has not changed until today. The population of the Faroe Islands after the second wave of land grabbing was perhaps 3000 people. This number remained almost stable until the end of the 18th century and did not exceed 4000. Agriculture in this very limited area did not allow for more.\nThe descendants of the two waves of settlements effectively formed the population for the next 450 years. It was not until the Black Death in 1349 and 1350, with the loss of a third of the population, that dramatic changes occurred, creating space and demand for new immigrants.\nEveryday life\nDiet and acquisition\nin 1957. Stamp by Bárður Jákupsson 1989.]]\nThe Vikings on the Faroe Islands were an agricultural people. They grew barley, which was ground with slate millstones imported from Norway. The most important domestic animals were sheep, and Faroese wool was already an important export at that time. There were also cows and, unlike today, many pigs. The name of the island, Svínoy, testifies to this. Hay was produced for animal feed. Over time, the Faroese horses developed into a separate breed, the Faroe pony, of which only a few individuals remain today.\nin 1955. It is 24.7 cm long and carved from a piece of driftwood. Today it is on display at the National Museum of the Faroe Islands. Stamp by Bárður Jákupsson 1989.]]\nFishing and grindadráp served as an important food supplement and were practiced near the coast in the fjords. The typical Faroese boat still stands as a reminder of these times. It is still built in the style of the Viking ship.\nThe Faroese bird life also provided an abundance of food. Seabird hunting was much more important here than in other countries - and still is. Of the dozens of species, three were preferred.\nEconomy\nMost of the evidence uncovered suggests that Norse communities residing on the Faroe Islands in the pre-Christian period were based heavily on crop cultivation and raising livestock. Bones of the livestock excavated show they raised sheep, goats, pigs and cows. Reliance on the land is indicated in certain names of settlements. The town of Akraberg (the name akur means cereal field) and Hoyvík (which means hay bay). At Toftanes, materials Norse used for fishing, such as spindle whirls and lineor netsinkers suggesting a utilization of the islands natural resources for goods. Numerous wooden bowls and spoons made from local trees were uncovered as well as basalt and tufa. The Norse were masters of adapting to their surrounding environment and utilizing every resource possible. The settlers at Junkarinsfløttur had a diet heavy with native birds, particularly puffin. Although the Norse did rely heavily on the land of the Faroe Islands, they did not completely sever ties with their native Norway.\nEven though many of the Norse settlements on the Faroe Islands were due to the tyrannical reign Harald Hårfagre, the Norse still maintained contact with Scandinavia via trade. At Toftanes, a large quantity of steatite was unearthed in the form of fragments of bowls and saucepans. Steatite is not a material local to the Faroe Islands, but rather from Norway. In addition, due to difficulties with barley production, a community in Sandur is shown to have imported barley from Scandinavia. The Norse communities were not only in contact with Scandinavia. Two Hiberno-Norse ring pins and a Jewish bracelet identified as being from the Irish Sea region were discovered at Toftanes. The Norse who settled at the Faroe Islands appeared to have maintained the tradition of mercantilism throughout the Atlantic.\nHousehold goods\n. In the background the inscription on the Kirkjubøur stone. Stamp from 1981]]\nThere was relatively little local ceramic. Faroese clay does not have particularly good properties, and the lack of trees meant that fuel was always in short supply. Soapstone vessels, probably imported from Norway, predominated. However, soapstone is also found on the neighboring Shetland Islands, so perhaps they came from there. The local tuff, a relatively soft volcanic rock, was used to carve oil lamps. Baskets and the like were woven from the local juniper. Juniper has almost disappeared from the Faroe Islands today, partly due to climate change.\nValuable items\nMetal had to be imported. Iron and bronze were used. Silver was used as currency, but later foreign coins were also used, as the coin found in Sandur Hoard shows. Jewelry was made not only from the metals mentioned but also from bone, pearls, and amber. Clothing was probably similar to that of Norway or the British Isles.\nHousing\nwas 21 m long and 5.75 m wide. The walls were 1.5 m thick. Stamp from 1982]]\nPeople lived in typical longhouses made of stone. They had only one room with a fireplace in the middle and benches along the walls. Foundations of such houses were excavated in many places on the Faroe Islands from 1941, first in Kvívík and later also in Fuglafjørður, Gøta and Sandavágur.\nLanguage\nThe language of the first Faroese was Old Norse, from which the modern Faroese language evolved. It was written in runes. Three rune stones have been found in the Faroe Islands: The Kirkjubøur stone, the Sandavágur stone, and the Fámjin stone. The latter, however, dates from the 16th century, proving that runes were used in addition to the Latin script well into the Catholic era. The Faroese Sigurd songs and other Faroese ballads are most likely based on old oral traditions from the Viking Age.\nNordic religion\nThe Vikings were members of the Norse religion. The most powerful of their gods was Thor, and not only is the Faroese capital Tórshavn (Thor's Harbor) named after him, but so is Hósvík (hós- comes from tórs-, and -vík means bay). Accordingly, Thursday (Thor is the god of thunder) is called hósdagur on the Faroe Islands, or tósdagur in the Suðuroy dialect. His symbol is the hammer, which still adorns the capital's coat of arms.\nSacrificial sites\non Suðuroy]]\nin Hov. The one from Havgrímur stands upright because it fell in battle.]]\nIt is not known whether there were sacrificial sites in places like Tórshavn and Hósvík. The Faroese saga does not reveal any details about the Norse beliefs practiced at that time. It is assumed that the sacrificial cult (blót) was practiced in the open air. However, there was also a kind of temple in the form of the hof, as is assumed in Hov.\nFood and drink were primarily sacrificed to the gods, but animals and people were also offered less frequently.\nBurial sites\nThe Viking graves on the Faroe Islands deserve special attention, as they allow conclusions to be drawn about burial rites and the cult of the dead. The Vikings buried their dead above ground and aligned the bodies facing west-southwest-east-northeast, with the head pointing in that direction. The menhirs of Hov on Suðuroy (see photo on the right) commemorate great personalities. Those who fell in battle received an upright stone, and those who grew old peacefully received a recumbent one.\nIn 1834, the tomb of the high priest (blótsmaður mikil) Havgrímur in Hov was opened on the initiative of the Danish governor Christian Pløyen. According to Pløyen, it was 24 feet long and 4 feet wide. Iron objects and human bones were found there. It is said that a grinding stone was also found. This excavation was considered unprofessional and unofficial. It was abandoned and never resumed.\nThe first professional excavation of a burial site took place in 1956 in Tjørnuvík in northern Streymoy. In 1955, children playing there found bones that turned out to be human bones. The following year, systematic archaeological excavations began and it soon became clear that the remains of a Viking woman had been found here. She was about 1.55 m tall and, as was common at the time, was buried with her head facing east-northeast. A clasp of Celtic-Scottish origin was found on her body. The historian Sverri Dahl dated the grave to the 10th century.\nThe British-led excavations in Sandur in 2006 prove that the third or fourth generation of Vikings were already living there around 900.\nSigmundur and Tróndur\nThe two protagonists of the Faroese saga are Sigmundur Brestisson and Tróndur í Gøtu, who each represented the opposing camps in a feud that lasted 65 years on the Faroe Islands. This story begins around 970 and forms the main plot line of the saga.\nDespite reservations about the objectivity and accuracy of the Faroese saga, the following picture emerges, which is generally accepted as the chronicle of the time.\nMurder of Brestir and Beinir\nAround 969 the situation on the Faroe Islands was as follows: There were two Norwegian fiefdoms, one belonging to Havgrímur of Hov, the other to the brothers Brestir and Beinir of Skúvoy. There were simmering conflicts between these two parties, which came to light with the dispute between Einar and Eldjarn (one of Brestir and Beinir's followers, the other of Havgrímur). Havgrímur refused Brestir's attempt at mediation, and so there was a trial before the Althing on Tinganes, where Havgrímur's party lost. He vowed revenge and sought the support of his father-in-law Snæúlvur of Sandoy, but he would not play along, unlike Tróndur í Gøtu and his uncle Svínoyar-Bjarni, who plotted with Havgrímur to kill the brothers.\nThe murder of Brestir and Beinir on Stóra Dímun in 970 did not end with the death of the two brothers. They also managed to kill Havgrímur and five of his men in battle. Sigmundur Brestisson was 9 years old when he witnessed the death of his father Brestir, in which Tróndur í Gøtu was not actively involved, but was in the background. After the bloody deed, Tróndur suggested killing Sigmundur and his cousin Tóri Beinirsson (Beinir's then 11-year-old son), but Svínoyar-Bjarni refused. Instead, Sigmundur and Tóri came under the guardianship of Tróndur, who had no children of his own and was unmarried.\nTróndur was 25 years old at the time. He tried to get rid of the two young boys quickly by offering them as slaves to the Norwegian merchant Ravnur Hólmgarðsfari that summer. However, he knew the background and demanded money to take them to Norway. Incidentally, the trade routes from the Faroe Islands to Novgorod in Kievan Rus' at that time are testimony to this episode. In any case, Ravnur brought the two to Norway and thus to safety (not only from Trónd's point of view, who had to fear revenge for the murder).\nTróndur took another boy into his care: Øssur Havgrímsson, the then 10-year-old son of Havgrím (i.e. the possible heir to Sigmundur and Tóri). This made him the sole ruler of the Faroe Islands: Sigmundur and Tóri were in Norway, and Øssur was his foster child. The Faroese saga tells us that Tróndur gave him the estates of Brestir and Beinir when he was growing up, as well as the part of the Faroe Islands that his father had ruled. This could have been from 980. However, Tróndur was probably the real and only lord of the archipelago.\nSigmund's return\ndating to 860–970, indicating that Christianity existed in the Faroes before official Christianization]]\nSigmundur Brestisson and his cousin Tóri Beinirsson returned to the Faroes for the first time in 983. They were traveling on behalf of King Håkon Jarl of Norway. They wanted their stolen property back and were now old enough to avenge the death of their fathers. According to the Faroese saga, they first encountered Svínoyar-Bjarni, who was surprised at home. Bjarni was able to explain that it was he who had fought for the lives of the young men in 970, and so he came to an agreement with Sigmundur by revealing the whereabouts of Øssur Havgrímsson on Skúvoy. Sigmundur is said to have gone there with 50 of Bjarni's men and killed Øssur in a duel, probably after he requested mercy and a settlement. After this battle, there was a truce between Sigmundur's and Tróndur's parties. However, while Tróndur wanted the matter to be settled before the Althing in Tinganes, Sigmundur demanded a verdict from Håkon Jarl in Norway. Around 984 Sigmundur and Tóri traveled back to Norway, where the king found Tróndur guilty of all four charges - the murder of Brestir and Beinir, the attempt to kill Sigmundur and Tóri, and the enslavement of the two boys - and ordered him to pay man-money to Sigmundur and Tóri. In addition, the king allowed Tróndur í Gøtu to remain on the Faroe Islands as long as he submitted to Norwegian rule, which in turn was to be represented by Sigmundur, who was thus - theoretically - promised the entire Faroe Islands as a fiefdom.\nAt the Althing in 985, Tróndur reluctantly accepted these terms and demanded payment in installments over three years. In the same year, Tróndur took Leivur Øssurson (Øssur Havgrímsson's son) for himself - probably also to take revenge on Sigmundur by repeatedly demanding man-money from Sigmundur.\nIt was probably around 986 that Sigmundur brought his family (wife Turið Torkilsdóttir and daughter Tóra Sigmundsdóttir) from Norway to the Faroe Islands, where they would remain for the rest of their lives. The two are considered the first great women in Faroese history. defends himself with the Mjölnir against the arrival of Christianity. Allegorical depiction on a Faroese stamp by Anker Eli Petersen 2000.]]\nChristianization of the Faroe Islands\nAfter Olav I Tryggvason converted to Christianity in 994 and became King of Norway in 995, he invited Sigmundur Brestisson to join him in 997. The two became friends, Sigmundur was baptized and sailed back to the Faroe Islands in 998 to announce at the Althing on Tinganes not only that Olav had appointed him sole ruler of the Faroe Islands, but also that all inhabitants should now convert to Christianity. This was met with violent protests led by Tróndur í Gøtu, forcing Sigmundur to retreat to Skúvoy until he attacked Tróndur at his home in 999 and forced him to convert to Christianity by force. However, this baptism was more formal and powerful politically, and Tróndur subsequently prepared the murder of Sigmundur Brestisson, which took place in 1005.\nReferences\n*\nBibliography\n* George V. Young: From the Vikings to the Reformation. A Chronicle of the Faroe Islands up to 1538. Shearwater Press, Isle of Man 1979,\n* George V. Young: Færøerne. Fra vikingetiden til reformationen („From the Vikings to the Reformation“). Rosenkilde og Bakker, Kopenhagen 1982 (Danish translation, basis of this article)\n* Klaus R. Schroeter: Entstehung einer Gesellschaft. Fehde und Bündnis bei den Wikingern. Reimer, Berlin 1994,  (PhD dissertation, University of Kiel 1993).\nExternal links\n*  (very extensive, most of it in English, much also in German, for example, a summary of the Faroese saga, etc.)\n*  (German descriptive text for the stamp issue of Postverk Føroya dated March 14, 1982)\n* [http://www.stamps.fo/default.asp?catalog%5Fname=Frim%E6rker&category%5Fname=Europaudgivelser&product%5Fid=176 Färöische Briefmarken – Wikinger-Kinderspielzeug] (German descriptive text for the stamp issue of Postverk Føroya from April 10, 1989 - Artist: Bárður Jákupsson)"
    }
  ]
}