{
  "content": [
    {
      "type": "text",
      "text": "# Viking Age in Estonia\n\nThe Viking Age in Estonia was a period in the history of Estonia, part of the Viking Age (793–1066 AD). It was not a unified country at the time, and the area of Ancient Estonia was divided among loosely allied regions. It was preceded by the Bronze and Early Iron Ages in Estonia, during which an agrarian society had developed, the Migration Period (450–550 AD), and Pre-Viking Age (550–800 AD) with the Viking Age itself lasting between 800 and 1050 AD. It is often considered to be part of the Iron Age period which started around 400 AD and ended around 1200 AD. Some 16th-century Swedish chronicles attribute the Pillage of Sigtuna in 1187 to Estonian raiders.\nThe society, economy, settlement and culture of the territory of what is in the present-day the country of Estonia is studied mainly through archaeological sources. The era is seen to have been a period of rapid change. The Estonian peasant culture came into existence by the end of the Viking Age. The overall understanding of the Viking Age in Estonia is deemed to be fragmentary and superficial, because of the limited amount of surviving source material. The main sources for understanding the period are remains of the farms and fortresses of the era, cemeteries and a large amount of excavated objects.\nThe landscape of Ancient Estonia featured numerous hillforts, some later hillforts on Saaremaa heavily fortified during the Viking Age and on to the 12th century.  The areas of Northern and Western Estonia belonged in the Scandinavian cultural sphere during the Viking Age. There were a number of late prehistoric or medieval harbour sites on the coast of Saaremaa, but none have been found that are large enough to be international trade centres. The Estonian islands also have a number of graves from the Viking Age, both individual and collective, with weapons and jewellery. Weapons found in Estonian Viking Age graves are common to types found throughout Northern Europe and Scandinavia.\nWritten sources\n]]\nSaxo Grammaticus describes the inhabitants of Estonia and the Curonians as participating in the Battle of Bråvalla on the side of the Swedes against the Danes, who were aided by the Livonians and the Wends of Pomerania.  Baltic tribes — i.e., the Letts and Lithuanians — are not mentioned by Saxo as participating in the fight.\nSnorri Sturluson relates in his Ynglinga saga how the Swedish king Ingvar Harra (7th century), the son of Östen and a great warrior, who was forced to patrol the shores of his kingdom fighting pirates from Estonia. The saga speaks of his invasion of Estonia where he fell in a battle against the men of Estland who had come down with a great army. After the battle, King Ingvar was buried close to the seashore in Estonia and the Swedes returned home.\nAccording to Heimskringla sagas, in the year 967 the Norwegian Queen Astrid escaped with her son, later king of Norway Olaf Tryggvason, from her homeland to Novgorod where her brother Sigurd held an honoured position at the court of Prince Vladimir. On their journey, \"vikings from Estonia\" raided the ship, killing some of the crew and taking others into slavery. Six years later, when Sigurd Eirikson traveled to Estonia to collect taxes on behalf of Valdemar, he spotted Olaf in a market on Saaremaa and paid for his freedom.\nA battle between Estonian and Icelandic Vikings off Saaremaa is described in Njál's saga as occurring in 972 AD.\nAbout 1008, Olaf II Haraldsson, later king of Norway, landed on Saaremaa. The local inhabitants, taken by surprise, had at first tried to negotiate the demands made by the king and his men, but then gathered an army and confronted them. Nevertheless, Olaf (who was 12 or 13 years old at the time) won the battle.\nAround the year 1030, a Swedish Viking chief called Freygeirr may have been killed in a battle on Saaremaa.\nIn the winter of 1219, Saaremaa was invaded by Old Lithuanians who raided and pillaged its inhabitants for loot, cattle and slaves. According to historical rhymed sources:\"Deluded by their bravery / They went through all the land [...] / All paths, and also tracks / Were covered rich in blood [...] / They taught folk how to die / Both men and women / If only they have failed to flee.\"The Livonian Chronicle describes the inhabitants of Estonia as using two kinds of ships, the piratica and the liburna. The former was a warship, the latter mainly a merchant ship. A piratica could carry approximately 30 men and had a high prow shaped like a dragon or a snakehead as well as a quadrangular sail.\nEconomy\nIn the Viking Age, the most definitive export from the area of Estonia was iron. In Estonia the raw material of iron in the form of bog iron is found in several places. It has been estimated that the export of iron from Estonia started before the Final Iron Age.\nAs with other locations in Northern Europe during the Viking Age, swords and spears were manufactured in Estonia. Petersen’s K type blades were the most numerous in Estonia during the 10th century, and Petersen’s M-type spearheads have also been found.\nArchaeology\n.]]\nViking-Age treasures from Estonia mostly contain silver coins and bars. Compared to its close neighbors, Saaremaa has the richest finds of Viking treasures after Gotland in Sweden. This strongly suggests that Estonia was an important transit country during the Viking era.\nEstonia constitutes one of the richest territories in Northern-Europe for hoards from the 11th and the 12th centuries. The earliest coin hoards found in Estonia are Arabic Dirhams from the 8th century. The largest Viking-Age hoards found in Estonia have been at Maidla and Kose. Out of the 1500 coins published in catalogues, 1000 are Anglo-Saxon.\nIn 2008 and 2010, two clinker-built ships of Scandinavian origin were discovered near the village of Salme on Saaremaa. Called the Salme ships, both vessels were used for ship burials around AD 700–750 in the Nordic Iron Age and contained the remains of more than 40 warriors killed in battle, as well as numerous weapons and other artifacts.\nDuring the Viking Age in Estonia, the area of Estonia was divided between two distinct cultural areas – Northern and Western Estonia, and Southeastern Estonia. Northern and Western Estonia which constituted 2/3 of Estonia and was densely populated, including Ösel, were deemed to be in the Scandinavian cultural area.\nThe ship burials at Salme that were excavated in 2011 and 2013, and have been dated to circa 750 AD, have been interpreted as being of men who had travelled to Saaremaa from Sweden, based on all weapons and other artefacts being of typically Swedish types, but excavations of a cult site at Viidumäe on Saaremaa (20&nbsp;km from Salme), beginning in 2014, a site dated to the 7th and 8th centuries, that is before and slightly after the Salme ship burials, have shed new light on that, since a large number of weapons and other items of the same types as those found at Salme have been found at the cult site, in a clearly local context with a large number of dress pins of local type but with typical Scandinavian decorations, showing the same types of weapons were in local use. It has long been known that in the 10th century the weapons and other attributes used by warriors on Saaremaa were indistinguishable from those used in Sweden, but the finds at Viidumäe, along with the appearance around 650 AD of a new type of graves on Saaremaa, a type otherwise found only in Sweden, are said to indicate a considerable Swedish impact on Saaremaa’s culture already before the 10th century.\nPopulation\nThe population of Ancient Estonia in the late Iron Age, circa 1100 AD, is estimated to have been 150,000, with upper estimates around 180,000. This is a five-fold increase from the approximately 30,000 inhabitants of the same area during the Roman Iron Age, circa 400 AD. For comparison, the population of Norway between 1000AD and 1100AD is estimated to have been around 200,000 people.\nFinnic tribes have been thought to have lived in both Northern, Western and Southeastern Estonia at around AD 1000. There are also mentions of a possible Norse settlement in Harjumaa on the 11th century.\nThe inhabitants of Viking Age Estonia are seen as the direct ancestors of modern-day Estonians. Archaeologist Andres Tvauri has commented on the question of ethnicities:\n}}\nCulture\nDuring the Viking Age, the area of Estonia was divided between two distinct cultural areas – Northern and Western Estonia, and Southeastern Estonia. The areas of Northern and Western Estonia are seen to have belonged to the Scandinavian cultural area at that time. Northern and Western Estonia matched, in general, the areas of the historical provinces Saaremaa, Läänemaa, Harjumaa and Virumaa. The Scandinavian written sources suggest that the four areas were clearly distinguished in the eyes of the Scandinavians, who used separate names for each: Eysysla for Saaremaa, Adalsysla for Läänemaa, Refaland for Harjumaa and Virland for Virumaa. The historic term of Saaremaa included all islands in Western Estonia, not just the single island of Saaremaa which the term is used for today.\nArchitecture\nThere are 41 known forts in Estonia from the second half of the first millennium. 37 of those were built and/or were in use during the Pre-Viking and the Viking Ages. In north-western Estonia, the fort which has been most thoroughly investigated which was used during the Viking Age is the fort at Iru. The beginning of the Viking Age in Estonia can be considered the most active period of the fort. The fortifications were initially built out of wood and sand, but had later been upgraded with large stone ramparts in both ends.\nThe forts in Viking Age Estonia were mostly situated in settlement centres. There is also a clearly visible connection between the placement of forts and rivers. This can be explained by the fact that rivers were used as transport mechanisms and also that the slopes of the river banks made for a good placement for forts in the otherwise quite flat Estonian landscape.\nAreas with forts in Viking Age Estonia\n{| class=\"wikitable\"\n|-\n| Ahisilla || Hinniala || Iru || Kärla || Rõuge || Tilleoru\n|-\n| Kassinurme || Keava || Kurista || Lihula || Saadjärve || Tõrva\n|-\n| Mõrgi || Joaorg || Otepää || Pada || Soontagana || Unipiha\n|-\n| Padise || Peatskivi || Purtse || Rakvere || Tartu || Kuusalu\n|}\nList of Viking Age sites\n}}\n* Iru hillfort.\n* Kõivuküla Aagemägi Hill Fort.\n* Märdi Hill Fort.\n* Truuta Nahaliin Hill Fort.\n* Aakre Kivivare settlement.\n* Kõrista linnamägi, Põlva.\n* Lake Valgjärv settlement, Koorküla.\n* Lahepera Burial Site, Eastern Estonia.\n* Keava hill fort.\n* Jägala-Joa IV.\nTransition\nThe end of the Viking Age in Estonia is defined in the archaeological record by the following events:\n* The abandonment of centres with a fort and a settlement\n* The emergence of village settlements\n* The appearance of new burial places\n* The emergence of larger cemeteries\n* The emergence of wheel-thrown pottery\n* The emergence of Winter Rye in cultivation\nWith the rise of centralized authority along with a bolstering of coastal defense in the areas exposed to Vikings, Viking raids became more risky and less profitable. With the growing presence of Christianity and the rise of kings and a quasi-feudal system in Scandinavia, these raids ceased entirely. By the 11th century, the Scandinavians are frequently chronicled as clashing with Estonian Vikings (Víkingr frá Esthland), which would ultimately lead to German, Danish and Swedish participation in the Northern crusades and the Scandinavian conquest of Estonia.\nThe local tribes were eventually overwhelmed and underwent baptism, military occupation and sometimes extermination by German, Danish and Swedish forces.\nNotes\nCitations\n*\n*\n*\n*\n*\n*\n*  |title=Palverännak – The Iru hill fort |url=http://www.palverand.ee/the-iru-hill-fort/ |website=www.palverand.ee |access-date=8 October 2018 |archive-date=14 September 2019 |archive-url=https://web.archive.org/web/20190914124653/http://www.palverand.ee/the-iru-hill-fort/ |url-status=dead }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*  |last1=Oll |first1=M. |title=Intriguing Viking Age underwater structure draws international interest |url=https://news.err.ee/116225/intriguing-viking-age-underwater-structure-draws-international-interest |website=ERR |publisher=Eesti Rahvusringhääling |access-date=10 October 2018 |language=en |date=2 July 2015}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}