{
  "content": [
    {
      "type": "text",
      "text": "# Viking Society for Northern Research\n\nThe Viking Society for Northern Research is a group dedicated to the study and promotion of the ancient culture of Scandinavia. Founded in London in 1892 as the Orkney, Shetland and Northern Society or the Viking Club, its name was changed in 1902 to the Viking Club or Society for Northern Research, and in 1912 to its present name. Its journal, Saga-Book, publication of editions, translations, and scholarly studies, and since 1964 the Dorothea Coke Memorial Lectures, have been influential in the field of Old Norse and Scandinavian-British Studies.\nHistory\nThe club was initially founded as a social and literary society for those from Orkney and Shetland. After some debate, this was broadened to include all those interested in the Norsemen and the history of the North, and an inaugural session of the reconstituted Viking Club or Orkney, Shetland and Northern Society was held at the King's Weigh House Rooms on 12 January 1894. It was mocked in the Pall Mall Gazette under the headline \"Vikings Drink Tea\", whereupon a member retorted in a letter that \"The fiercest warriors, even savages, drink tea and coffee nowadays\". Punch made fun of the Nordic titles of its officers with a satirical \"Saga of the Shield-Maiden\":\nThe society did at that time call its officers \"jarl, jarla-man, Viking-jarl, umboths-jarl and the rest\", and its by-laws are still called the Law-Book. Initially they had used names specifically related to the Isles: \"Udaller, Udal-Book and Udal-Right for Member, List of Members and Membership respectively [and also] Huss-Thing, Schynd-Bill, Great Foud and Stem-Rod\". Both  publications also made fun of the \"weaking\" pronunciation of viking and of the ambitious statement of intent in the prospectus: \"It behoves every one who is directly or indirectly connected with or interested in the North to give the Viking Club such support as will enable it to take its proper place among the foremost societies in Europe\". In the words of Punch:\nW. Watson Cheyne\", then a professor of surgery at King's College Hospital, University of London.}}\nThe mockery touched off vehement exchanges of letters in the Orkney Herald and the Shetland News in which St. Magnus was used as a pen name and reference was made to effeminacy and nithings.\nThe society soon became better known for scholarship than for the conviviality that had been half its intended purpose. The \"foys\", or concerts, gave way starting in 1901 to an annual dinner, which has continued to the present with few interruptions. In 1902 its name changed to the Viking Club or Society for Northern Research and in 1912 to the Viking Society for Northern Research.\nThe Dorothea Coke Memorial Lectures at University College London, endowed in 1962 by Colonel B. E. Coke in memory of his wife, began in 1963 with G. N. Garmonsway lecturing on \"Canute and His Empire\"; these are published. The Society has also assisted in publishing the proceedings of the Viking Congress since the sixth Congress in 1969, and in making foreign publications available to members.\nThe Viking Society both resulted from and encouraged the Victorian Viking revival. Collingwood, an art professor who became a philologist and translator as well as illustrator of Old Norse texts, presented his oil painting The Parliament of Ancient Iceland to the society and it hung in their meeting room. From its earliest days the Society brought together the prominent scholars in the field: William Morris, Eiríkr Magnússon, Guðbrandur Vigfússon and Frederick York Powell were among the active members in its early days, and its publications, lectures, and symposia have continued in the same vein, featuring Gabriel Turville-Petre, J. R. R. Tolkien, and Ursula Dronke, for example.\nIn 1917 the Viking Society was asked to help with the effort to establish Scandinavian Studies at the University of London, where it was by then holding its meetings, and it became traditional for the head of what is now the Department of Scandinavian Studies at University College London to be joint Honorary Secretary of the Society. The Society's extensive library became part of University College's library in 1931 in exchange for permanent access to a meeting room; however, in 1940 the collection was almost entirely destroyed in a fire caused by wartime bombing and it had to be laboriously replaced.\nWorld War I had little effect on the Society's meetings but interrupted its publications, which resumed only slowly; there had been financial problems early in its history (a Treasurer destroyed the year's financial records rather than take them with him in a move, and the printers sued to recover the cost of an overrun), and again in 1916 a large sum had to be promised to the printers to avert a lawsuit, but in the 1920s serious financial problems arose.  Meetings were suspended during World War II but publications struggled on.\nPublications\nThe first volume of the society's  journal, Saga-Book, appeared in 1895; the first volume of Old Lore Miscellany is dated 1907–08; in welcoming that, the Pall Mall Gazette praised the society for \"fresh and meritorious work\". In 1908, a correspondent reported approvingly in the American Journal of Philology on the Society's \"very large\" membership including \"many names prominent in the literary life and the scientific world of England, Scotland and the North\" and on its publications and expenditure of \"large sums of money\" on expeditions as far afield as Denmark. From 1920, Saga-Book occasionally published monographs as separate numbers, but there is also a short Extra Series of monographs which began in 1893. A translation series began in 1902 with W. G. Collingwood and Jón Stefánsson's The Life and Death of Kormac the Skald. A text series began with an edition of Gunnlaugs saga ormstungu in 1935, and later broadened to include further monographs.\nPrizes\nThe society provides three annual prizes for student research. The Townsend Viking Society Prize is awarded to a student of the Department of Scandinavian Studies at UCL. The  Turville-Petre Prize is awarded to a student of Oxford University. Two Margaret Orme Prizes (one for an undergraduate, one for a first year graduate), are awarded to individuals not associated with either of the previous institutions.\nScottish Society for Northern Studies\nAfter the idea was raised at the fifth Viking Congress in Tórshavn in 1965, a Scottish offshoot of the Viking Society, the Scottish Society for Northern Studies, came into being in 1968. It publishes a journal called Northern Studies and holds an annual conference.\nReferences\nExternal links\n* [http://www.vsnr.org/ Viking Society for Northern Research website]\n* [http://vsnrweb-publications.org.uk/ Viking Society Web Publications]\n* [https://ssns.org.uk/ Scottish Society for Northern Studies website]"
    }
  ]
}