{
  "content": [
    {
      "type": "text",
      "text": "# Vikingfjord\n\nVikingfjord Vodka is a brand of vodka, distilled from potatoes and bottled by the Norwegian company Arcus. It is distilled through a five-column process, using only glacial water from the Jostedalsbreen glacier in South-Western Norway.\nVikingfjord Vodka is sold in Norway, Sweden, Denmark, Finland, Estonia, Germany, Canada and the United States. Vikingfjord won the Gold Medal in the 2006 San Francisco World Spirits Competition in the Unflavored Vodka, 40% category and has also won best Vodka in International Wine and Spirit Competition in London and in the International Spirits Challenge.\nHistory\nVikingfjord Vodka was launched in 1985 by a partnership between the Norwegian state-owned wine and spirits monopoly Vinmonopolet and the US supplier Heublein. Initial sales were not good, and in 1986 Heublein was acquired by Grand Metropolitan, which already distributed a number of well-known, established vodka brands. A few months later, Heublein stopped marketing Vikingfjord.\nVinmonopolet decided to go for its domestic market and, in 1986, initially launched as Viking Fjord, its premium vodka made with Norwegian glacial water.\nFour years after the Norwegian launch, the Norwegian design agency Grid was commissioned to redesign the bottle. At the same time the product name is changed from Viking Fjord to Vikingfjord Vodka. The relaunched Vikingfjord Vodka sold well. In the same year, Arcus AS, a privately owned company independent of Vinmonopolet which had taken over production and distribution, decided to work the export market to a greater extent. In 2001, Vikingfjord Vodka was relaunched in the USA, this time more successfully.\nVikingfjord Vodka has since won several prizes in international wine and spirits competitions and is a bestseller in Norway. Its sales success has justified continued development of products and flavors. At the start of 2007, three flavored vodkas were added to the range: blueberry, apple and citrus. In the following year, all flavors won prizes in The International Wine & Spirit Competition and The International Spirit Challenge.\nSee also\n*List of vodkas\nReferences\nExternal links\n*[http://www.vikingfjord.com Vikingfjord official site]"
    }
  ]
}