{
  "content": [
    {
      "type": "text",
      "text": "# Viking Coastal Trail\n\nReculver Towers\nMargate\nBroadstairs\nRamsgate\nPegwell Bay\nMinster\n|use=Cycling and Hiking,\n|elev_change=\n|highest=42 m (135 ft)\n|lowest=\n|difficulty=\n|season=\n|months=All year\n|sights=\n|hazards=\n}}\nThe Viking Coastal Trail is a 25-mile multi-user route around the Isle of Thanet, keeping as close as is possible to the coast. It is also Regional Route 15 of the National Cycle Network. From Reculver (going clock-wise), the trail passes through Margate, Broadstairs and Ramsgate to reach Pegwell Bay, where Vikings first landed in Kent.  The Trail then, uses an inland route on quiet lanes (except the short section beside the A299), passing through a couple of villages with ancient churches including Minster-in-Thanet Abbey and St Nicholas at Wade, to return to Reculver.\nHistory\nThe trail was devised  by a collaboration of Douglas Bush (the Thanet representative for cycling tour club Right To Cycle, the local secretary of the Thanet Cycle Forum and a member of the East Kent cycle campaign group Spokes), Sustrans (British charity to promote sustainable transport) and Thanet District Council.\nOlympic athlete Kelly Holmes MBE opened the Trail, on Sunday 10 June 2001. Total cost of the trail (including design, construction and marketing) is about £500,000 divided roughly equally between Kent County Council and Thanet District Council.\nRoute\nIt is largely traffic free (especially along the coast).  On-road 46% - Off-road 54% . The coastal route also follows (in most sections) the route of the Saxon Shore Way (long distance footpath). But the inland section of the trail is still being upgraded and improved, such as the section between the A299 Thanet Way and Reculver.\nAt Sandwich it connects to National Cycle Route 1 to head to Canterbury.\nAt Reculver, the trail links to Wantsum Walk to Upstreet (following an old river route) and Oyster Bay Trail (leading to Whitstable, along the coastline).\nThe Trail forms the route for many charity local cycle rides, including Thanet Road Runner mountain bike duathlon, which starts as a short 2.4-mile road run from Minnis Bay and continues with nine miles of cycling before another run of 4.5 miles.  It is also used by the British Heart Foundation for its annual Viking Bike Ride.\nUsage\nCanterbury Christ Church University College studied the economic impact of the Viking Coastal Trail in 2003. 364 cyclists were interviewed between May and August.\nThey concluded that the overall economic impact of the Trail equates to around £293,297 per year.\nThe Trail is Kent’s No. 1 cycle route. Used by at Ramsgate – 27,965, Westgate – 39,616 cyclists in 2003 during June and August.\nReferences\nExternal links\n* [https://www.flickr.com/photos/gregorywilliams/sets/72157594424782957/ Flickr Gallery of photos]\n* [http://www.ldwa.org.uk/ldp/members/show_path.php?path_name=Viking+Coastal+Trail Walkers Association page (also includes height profile of the route)]\n* [https://web.archive.org/web/20081121023514/http://www.spokeseastkent.org.uk/cycle-kent.pdf Kent Cycle Trails]"
    }
  ]
}