{
  "content": [
    {
      "type": "text",
      "text": "# Viktor Kingissepp\n\n|birth_place = , Saaremaa, Estonia\n|death_date  =\n|death_place = Tallinn, Estonia\n|resting_place =\n|nationality = Estonian\n|occupation  = Communist revolutionary\n|awards      =\n| spouse     =\n| father     =\n| children   =\n| relatives  =\n}}\nViktor Eduard Kingissepp (;  – 4 May 1922) was a professional revolutionary, after the 1917 Russian Revolution a communist politician and secret police operative in Soviet Russia, and in 1920–1922 a founder and leader of the underground Estonian Communist Party.\nKingissepp was born at the former manor in , now part of Kuressaare. Son of a factory worker, he joined a Marxist circle as a schoolboy in Kuressaare (Arensburg). He later organised the Estonian section of the Russian Social Democratic Labour Party in Saint Petersburg.\nDuring World War I, he was put in charge of a medical train.\nAfter the 1917 February revolution, he returned to Petrograd (Saint Petersburg), and joined the Russian Bolshevik party of Vladimir Lenin. After the 1917 Bolshevik coup, he became deputy chairman of the Revolutionary Soviet in the Estonian capital Tallinn (Reval). He was forced to flee back to Petrograd when Estonia was entirely occupied by the Imperial German army in February 1918.\nIn 1918, the new Russian Bolshevik regime promoted Kingissepp to a leading position in the All-Russian Extraordinary Commission (Cheka) — the first Soviet secret police organisation. In that capacity, in August 1918, he carried out the arrest and interrogation of Fanny Kaplan, after she had shot and wounded Lenin in an unsuccessful assassination attempt.\nKingissepp returned clandestinely to the newly independent Estonia in November 1918 in order to help the underground launch of the Communist Party of Estonia. He presided over the first (secret) congress of the banned Estonian communist organisation in November 1920. Kingissepp remained in hiding until arrested on 3 May 1922 in Tallinn by agents of the Estonian Internal Security Service, after they had obtained a tip-off about his location from a fellow communist arrested during the International Workers' Day (1 May) demonstration. After the arrest, in a trial that lasted just a few hours, the court-martial sentenced Kingissepp to death and he was executed that same night.\nLegacy\nThe Soviet Russian government renamed the town of Yamburg Kingisepp in his honour. After the Soviet Union had occupied and annexed Estonia during World War II, the town of Kuressaare in Saaremaa island was also renamed Kingissepa after him in 1952. The original Estonian name was restored to Kuressaare in 1988.\nDuring the 1944–1991 Soviet occupation of Estonia, the Estonian Drama Theatre in Tallinn was named Viktor Kingisepp Tallinn National Drama Theatre and many Estonian towns had their own  'Viktor Kingissepp Street' at the time.\nReferences\nExternal links\n*"
    }
  ]
}