{
  "content": [
    {
      "type": "text",
      "text": "# Villa Lewaro\n\n| nearest_city =\n| area =\n| built = 1916–1918\n| architect = Vertner Tandy\n| architecture = Italian Renaissance\n| designated_nrhp_type = May 11, 1976\n| added = May 11, 1976\n| visitation_num =\n| visitation_year =\n| mpsub =\n| refnum = 76001289\n| designated_other1 = New York State Register of Historic Places\n| designated_other1_num_position = bottom\n| designated_other1_number = 11956.000158\n| designated_other1_abbr = NYSRHP\n| designated_other1_date = June 23, 1980\n}}\nVilla Lewaro, also known as the Madam C.J. Walker estate, is a 34-room  mansion located at Fargo Lane and North Broadway (US 9) in Irvington, New York, 30 miles north of New York City. Entrepreneur Madam C.J. Walker commissioned architect Vertner Tandy to build Villa Lewaro from 1916 to 1918. It was designed in the Italianate style and named for Walker's daughter, Lelia Walker Robinson (later known as A'Lelia Walker). An additional site, the Dark Tower Walker residence with business occupancy, was established in New York City's Harlem neighborhood, thus completing the Walker property portfolio.\nHistory\nEarly history\nFrom 1918 to 1919, Villa Lewaro was the home of Madam C. J. Walker, an African-American entrepreneur, philanthropist, and a political and social activist who was the first female self-made millionaire in the United States. She became one of the wealthiest self-made women in America and one of the most successful women and African-American business owners ever. Walker's fortune was founded on her developing and marketing a line of beauty and hair products for black women.\nThe mansion is an Italianate villa house designed for Walker by Vertner Tandy, the first African-American architect registered in New York, and has been considered to be one of his greatest works. It was constructed during 1916–1918 at an estimated cost of $250,000 and was furnished lavishly. The name Villa Lewaro was coined by a distinguished visitor, Enrico Caruso, from the first two letters of each word in Lelia Walker Robinson, the name of Walker's daughter, who later went by the name of A'Lelia Walker.\nThe home was used as a conference center on race relations issues, and as a meeting place for people involved in the Harlem Renaissance, including W. E. B. Dubois and Langston Hughes. Madam C. J. Walker died there in 1919, and the house was inherited by her daughter A'Lelia, who owned it until she died in 1931. She left it to the NAACP, but because of the challenges of paying the taxes and general home maintenance during the Great Depression, the estate and the NAACP agreed to sell the property and split the proceeds.\nThe estate was bought by the Companions of the Forest in America and became the Anne E. Poth Home for Convalescent and Aged Members of that group. The house became a National Historic Landmark in 1976, and has been a private residence since the mid-1980s.\nPurchase by Harold Doley\nIn 1993, Villa Lewaro was purchased by Harold Doley, founder of Doley Securities, LLC, the oldest African-American-owned and operated investment banking firm in the United States. According to the New York Post:\nThe Doleys upgraded the house's mechanical, electrical, heating, and plumbing systems. They reconstructed the terra cotta roof with materials from the original manufacturer and restored the wall paintings in the dining and music rooms.\nDoley has hoped to attract investors to help turn the residence into a museum. During 1998 it was a designer show house benefiting the United Negro College Fund.\nIn 2004, it was added to the African American Heritage Trail of Westchester County, a group of 13 sites which include the Rye African-American Cemetery, Saint Paul's Church National Historic Site and the Jay Estate.\nIn May 2014, the National Trust for Historic Preservation, which has designated the mansion as a \"National Treasure\", began a project with the active support of Doley, which it called \"Envisioning Villa Lewaro's Future\", to determine the appropriate re-use of the mansion, which was becoming available for purchase. A workshop organized by the Trust selected three scenarios: a spa and salon, a \"Center for Innovation in Technology\", and a corporate events venue, while a fourth – continued residential use – was suggested by the Trust afterward; the workshop rejected other scenarios, although the Trust recommended that one – a cultural arts performance venue – be reconsidered. Others have suggested that the mansion be used as a center for information about Madame Walker and Vertner Tandy, the architect. In 2017, a representative of the National Trust reported that despite the mansion's status as a National Historic Landmark \"there’s no oversight or review to stop an external agency to propose changes to the building...\" The Trust's concern is that significantly changing the mansion, or, worse, demolishing it, would be a slight to Walker's life achievements.\nIn May 2017, Westchester County certified an easement under the auspices of the National Trust, a significant step in the house becoming a museum. The Doleys are exploring ways to continue to live in the house if and when it achieves that status. On December 22 of that year, the National Trust's African-American Cultural Heritage Action Fund confirmed the preservation easement, which would protect the historic and architectural qualities of the mansion and its property.\nPurchase by New Voices Foundation\nOn December 20, 2018, the National Trust for Historic Preservation announced that the estate had been sold in mid-September to the New Voices Foundation, which Richelieu Dennis founded. An emigrant from Liberia, Dennis is the owner of Essence magazine and the 1992 founder of Sundial Brands, a skin and hair care products company which is now a division of Unilever. He purchased Madam Walker's brands in 2013 and relaunched them. The purchase price paid by the New Voices Foundation &ndash; which helps women entrepreneurs of color &ndash; was not released. The foundation plans on renovating the estate and will operate it, possibly as a think tank, training center or retreat to support the foundation's mission. A change would aid them in the village of Irvington's zoning laws, which provide tax relief for registered historical buildings adaptively re-used for non-residential purposes, such as schools, tours, and specific types of events.\nOn August 3, 2021, the New Voices Foundation presented preliminary plans for the use of the property to the Irvington Board of Trustees. The three-part plan calls for the creation of the Madam C. J. Walker Institute for Women of Color Entrepreneurs dedicated to \"educating, empowering and uplifting women of color entrepreneurs\" through workshops and seminars, special events related to that charitable purpose, which could attract up to 400 people, and private tours of the house limited to 50 people, fulfilling a requirement of the National Trust for Historic Places that the house be open to the public periodically. The plan for special events and the associated parking problems received the most attention from the board, as the property has only 12 parking spaces, and valet parking would increase that to 21 spaces. With an event of 400 people, a considerably larger number of cars would be expected, and talks were underway with the three nearby churches to use their parking lots, with shuttle buses bringing people to Villa Lewaro. It was pointed out that there was in place a stipulation for the Armour-Stiner Octagon House &ndash; the only other application of \"adaptive re-use\" in the village &ndash; for a sizable event to be pre-approved by the board. New Voices' formal application was expected to be filed on August 30.\nEvents\nOn July 10, 2021, fashion designer Kerby Jean-Raymond showed his first couture collection at Villa Lewaro, two days after it was forced to be rescheduled due to torrential rain and lightning &ndash; although the downpour on Thursday the 8th did not stop the audience from partying while they waited to see if the show would go on. When the show, entitled \"Wat U Iz\", was finally presented in its entirety on Saturday the 10th, the clothing for the designer's Pyer Moss label included a dress shaped like a jar of peanut butter, a cape made out of hair rollers, and clothing that looked variously like a kitchen mop, an ice cream cone with chaps, an air conditioner, and an old mobile phone.\nJean-Raymond was the first African-American designer to be asked by France's Chambre Syndicale de la Couture to show a collection during Paris Couture Week; the show was live-streamed to Paris. In the notes for the show, the designer said about Madame Walker that \"[her] wealth was more than money. ... Black prosperity begins in the mind, in the spirit and in each other. She knew that no dollar amount could ever satisfy the price tag of freedom — that green sheets of paper & copper coins could never mend souls, heal hearts or undo the evil we’ve endured.\"\nParking problems caused by the event, which was attended by 700 people, were discussed by the Irvington Board of Trustees at their meeting on August 3, 2021. On July 17, 2023, the Board of Trustees issued a special one-year permit for Villa Lewaro to be used as \"a historical, educational and cultural facility, specifically, as home to the Madam C.J. Walker Institute for Women of Color Entrepreneurs.\" The permit specified limits on the number and nature of events, parking, and the allowed amount of noise. The permit would become active once structural repairs were completed, and the village issued a Temporary Certificate of Occupancy.\nSee also\n*List of National Historic Landmarks in New York\n*National Register of Historic Places listings in southern Westchester County, New York\nReferences\nNotes\nBibliography\n*Bundles, A'Lelia P. On Her Own Ground: the Life and Times of Madam C.J. Walker. 2001\nExternal links\n*"
    }
  ]
}