{
  "content": [
    {
      "type": "text",
      "text": "# Vinay Shankar Tiwari\n\n| birth_place         = Tada, Gorakhpur, Uttar Pradesh, India\n| restingplace        =\n| restingplacecoordinates =\n| birthname           =\n| spouse              =\n| children            = 2\n| father              = Hari Shankar Tiwari\n| relatives           = Bhishma Shankar Tiwari (brother)\n| nationality         =\n| party               = Bahujan Samaj Party(2007-2021), Samajwadi Party (since 2021 to now)\n| residence           = A4, Park Road, Vidayak Awash, Lucknow\n| alma_mater          = Lucknow University\n| occupation          =\n| profession          =\n| order               =\n| education           = Bachelor of Laws\n| relations           =\n}}\nVinay Shankar Tiwari (born 15 February 1966) is an Indian politician and was a member of 17th Legislative Assembly of Uttar Pradesh representing Chillupar. He was a member of the Bahujan Samaj Party. In December 2021, he joined Samajwadi Party.\nPersonal life\nTiwari was born 15 February 1966 in Tada village in Gorakhpur district of Uttar Pradesh to politician Hari Shankar Tiwari. He received a LLB degree from Lucknow University, Lucknow in 1987. He married Rita Tiwari on 21 February 1992. They have two children, a son and a daughter.\nPolitical career\nTiwari belongs to a political family. His father Hari Shankar Tiwari was six times MLA from Chillupar and his brother Bhishma Shankar Tiwari was MP of Sant Kabir Nagar (2009-2014). He  started his political career in 2008 bypoll elections, he got ticket by Bahujan Samaj Party from Ballia (Lok Sabha constituency), but lost to SP's Neeraj Shekhar by a margin of 1,31,286 votes.\nIn 2009 General elections, he got ticket by Bahujan Samaj Party from Gorakhpur (Lok Sabha Constituency). He contested against Yogi Adityanath but lost by a margin of 2,20,271 votes.\nIn 2017, he represented the Chillupar (Assembly constituency). In 17th Legislative Assembly of Uttar Pradesh (2017) elections, he contested elections from Chillupar and was elected MLA by defeating Bhartiya Janata Party candidate Rajesh Tripathi by a margin of 3,359 votes.\nIn 2022, Uttar Pradesh Legislative Assembly Elections, he again contested elections from Chillupar constituency but lost to Rajesh Tripathi of Bhartiya Janta Party by a huge margin of 14,243 votes.\nPosts held\n{| class=\"wikitable sortable\"\n|-\n! # !! From !! To !! Position !! Comments\n|-\n| 01 || March 2017 || March 2022 || Member, 17th Legislative Assembly of Uttar Pradesh ||\n|-\n|}\nReferences"
    }
  ]
}