{
  "content": [
    {
      "type": "text",
      "text": "# Vince McMahon sex trafficking scandal\n\nIn January 2024, Vince McMahon, long-time owner of World Wrestling Entertainment (WWE), was alleged by Janel Grant, a former WWE employee, to have sexually trafficked and assaulted her at WWE's corporate headquarters in Stamford, Connecticut. The scandal–one of many sexual misconduct allegations surrounding McMahon–resulted in McMahon's removal as executive chairman of TKO Group Holdings.\nBackground\nVince McMahon is a professional wrestling promoter who bought his father Vincent J. McMahon's promotion —then called the World Wrestling Federation (WWF)— in 1982. Under McMahon's ownership, WWF underwent an aggressive national expansion during the 1980s professional wrestling boom which effectively made the WWF the leading professional wrestling promotion in the United States and, later, the world. WWF was later renamed to World Wrestling Entertainment, and later still, simply referred to as WWE. In June 2022, WWE's board of directors started investigating a $3 million hush money payment, and the board found that McMahon had made $12 million in payments to four women, two of whom alleged sexual misconduct against McMahon. This was not the first time McMahon had been publicly accused of sexual misconduct: in 1992, former WWF referee Rita Chatterton alleged McMahon raped her in 1986; and in 2006, a tanning salon employee in Boca Raton, Florida, alleged that McMahon had sexually harassed and groped her.\nAs a result of the investigation, McMahon retired in July 2022 as CEO of WWE, but still remained its largest shareholder. McMahon was succeeded as CEO by his daughter Stephanie McMahon and company president Nick Khan. In November 2022, WWE's internal investigation into the hush money payments was completed, but the company did not publicly disclose its results. In January 2023, McMahon exited retirement and returned as executive chairman of WWE amid rumours that the company would be sold; McMahon's public statement also referred to WWE's ongoing negotiations regarding its media rights. In September 2023, WWE officially merged with mixed martial arts promotion Ultimate Fighting Championship (UFC) to create TKO Group Holdings, of which McMahon was appointed executive chairman.\nInitial complaint\nOn January 25, 2024, former WWE employee Janel Grant filed a lawsuit in the United States District Court for the District of Connecticut against WWE, McMahon, and former WWE head of talent relations John Laurinaitis alleging that McMahon had sexually assaulted and trafficked her, and sought to have a non-disclosure agreement (NDA) relating to the conduct voided, both under the auspices of the Speak Out Act, which makes such NDAs illegal and unenforceable, and nullified by McMahon's refusal to follow the contracted obligations within the NDA. Grant, a former paralegal who lived in the same apartment block as McMahon, was offered employment with WWE in 2019 after the death of her parents. During the course of her employment, Grant alleged that McMahon recruited individuals, most notably Laurinaitis, for the purpose of sexual relations with her. Of the alleged conduct, Grant made several noteworthy allegations, including:\n* In May 2020, Grant, McMahon, and a personal friend of McMahon engaged in a threesome and at one point, McMahon allegedly defecated upon Grant. McMahon temporarily retired to the restroom to clean himself, at which point the threesome continued for an hour and a half with Grant still covered in McMahon's feces.\n* In June 2021, Laurinaitis and McMahon \"cornered her and pulled her in between them, forcibly touched her, before ultimately putting her on top of a table in between them\", and that \"she begged them to stop, but they forced themselves on her, each taking turns restraining her for the other\".\n* During the course of her employment, McMahon shared sexually explicit media with a \"world-famous athlete\" and former UFC Heavyweight Champion – identified by The Wall Street Journal as Brock Lesnar – to entice him to sign a new WWE contract, which the talent eventually did sign.\nGrant alleged that the misconduct continued until 2022, at which point McMahon's wife Linda–a former WWE executive and politician–discovered the affair and threatened to divorce him. After several months of negotiations, WWE, McMahon, and Grant signed an NDA in which Grant would be awarded $3 million for her silence; after signing the contract, Grant alleged that McMahon attempted to assault her again. Grant also alleged that key figures in WWE were fully aware of the conduct, and actively sought to conceal McMahon's wrongdoing.\nReactions\nGrant's lawsuit was filed during a prolific week for WWE: just two days prior, WWE had closed a 10-year deal with Netflix worth $5 billion in which the domestic media rights to its flagship television show WWE Raw and the international media rights to its wider content library would be provided to the streaming service; on the same day, former WWE wrestler Dwayne \"The Rock\" Johnson was appointed to the TKO board. Upon the filing of the lawsuit, the TKO board issued a statement that, whilst the allegation predated their control of WWE, they \"took the allegations very seriously\", while McMahon denied the allegations and vowed to \"vigorously defend himself\".\nOn January 26, 2024, snack food brand Slim Jim – a longtime sponsor of WWE, and sponsor of the Royal Rumble premium live event that was due to take part on January 27 – announced that it was withdrawing its sponsorship of the event. That evening, TKO executives Ari Emanuel and Mark Shapiro met with McMahon to convince him to resign. At  that evening, McMahon publicly announced his resignation as TKO executive chairman. McMahon’s profile on WWE.com was also removed from the Superstars page. Slim Jim announced the next day that it was resuming its sponsorship of the Royal Rumble.\nLater developments\nBrock Lesnar was due to make his in-ring return at the Royal Rumble event in the eponymous match; after the scandal broke, he was replaced by Bron Breakker. After the Royal Rumble, Lesnar was due to enter into a feud with Dominik Mysterio that would culminate at Elimination Chamber: Perth a month later, and then wrestle Gunther at WrestleMania XL. He was also removed as a playable character in 2K's video games WWE SuperCard and WWE 2K24, and from the introductory \"signature\" of all WWE programming.\nOn February 1, 2024, co-defendant John Laurinaitis' lawyer Edward Brennan told Vice News that Laurinaitis was also a victim of McMahon's coercive control, and said that Laurinaitis would defend himself on that basis. On February 7, Laurinaitis alleged that WWE's executives were fully aware of allegations that former WWE wrestler Ashley Massaro was raped by someone posing as a US military doctor during a WWE tour of Kuwait, which contradicted earlier statements by WWE that they were unaware of them, but denied that the company had engaged in a cover up. Two days later, Vice published a previously unseen statement by Massaro which accused McMahon of preying upon other female wrestlers.\nOn March 11, 2024, Front Office Sports published an article which revealed the identities of four unnamed corporate figures referenced in the lawsuit, which Grant's attorney Ann Callis confirmed was correct:\n* Corporate Officers #1 and #2, who were described in the lawsuit as McMahon's \"fixers\", were identified as WWE president Nick Khan and WWE COO Brad Blum;\n* Corporate Officer #3, who was \"mentioned once [in the lawsuit] in an ambiguous context\", was identified as former WWE CEO, and Vince's daughter, Stephanie McMahon;\n* Corporate Officer #4, who was alleged to have treated Grant with hostility within WWE's legal department, was identified as WWE's former general counsel Brian Nurse.\nOn April 1, 2024, the New York Post published a purported \"love letter\" from Grant to McMahon which was dated to December 24, 2021, which was taken from Grant's work laptop during the course of the internal investigation. Callis alleged that the love letter was written under duress, whereas McMahon's attorney Jessica Taub Rosenberg said that the letter was proof that Grant was not coerced into writing it, or that she was assaulted by McMahon.\nOn April 23, 2024, McMahon's lawyers filed a motion to compel arbitration in the case under the terms of the NDA, and stated that McMahon withheld payments as he believed that Grant had broken the terms of the agreement. A day later, Grant's attorneys filed a motion to strike McMahon's motion, alleging that he had used the motion and his preliminary statement to further intimidate Grant. On May 30, 2024, Grant agreed to “stay her case\" against McMahon for six months at the request of the Department of Justice, which was launching a criminal investigation into the allegations. On December 24, 2024, both Vince McMahon and the WWE filed motions seeking to transition the lawsuit to arbitration.\nOn January 10, 2025, the U.S. Securities and Exchange Commission (SEC) announced that McMahon had agreed to pay a $400,000 fine to the SEC and to reimburse  to WWE in exchange for charges of false accounting being dropped. In the agreement, the SEC stated that they found McMahon had failed to disclose two non-disclosure agreements – a 2019 agreement with an unidentified woman for  and a 2022 agreement, presumably with Grant, for  – which caused discrepancies in WWE's financial filings that covered those years. Despite McMahon alleging that the SEC fine had closed the case, Callis confirmed that both the criminal investigation and civil lawsuit were still ongoing.\nOn January 31, 2025 – one day before that year's Royal Rumble event – Grant filed an amended complaint that expanded on her grievances against McMahon and WWE. Many individuals mentioned in the original complaint and later identified by third-party sources – including Khan, Lesnar, and celebrity doctor Carlon Colker, who was accused of supplying Grant with unidentified medication at McMahon's request – were de-anonymised and explicitly named. Grant also alleged that:\n* In September 2020, McMahon directed Grant to create customised pornographic content for longtime WWE producer Michael Hayes and his crew;\n* After Grant was transferred from the legal department to talent relations, Khan and Blum were directly involved in the construction of new office space that included an internal connection between Grant's office and Laurinaitis's, which also shared a wall with the office of former headline wrestler, then-talent relations executive, and future head booker, Paul \"Triple H\" Levesque;\n* McMahon attempted to arrange multiple sexual encounters between Lesnar and Grant between July 2021 and January 2022, with the encounters not happening only due to external circumstances;\n* At one point, McMahon viewed pornographic content of Grant during a production meeting that was filmed for, and aired in, the 2024 Netflix documentary Mr. McMahon;\n* Grant ultimately signed the NDA under intense pressure from McMahon so that he could avoid scrutiny of the relationship by the WWE board and its auditors, which were due to meet in the following days.\nOn May 28, 2025, Laurinaitis settled with Grant and agreed to provide evidence in her favor in future proceedings.\nIn July 2025, retired UFC fighter Daniel Cormier claimed that Lesnar remained on a TKO-maintained \"ban list\" that precluded him from appearing on UFC or WWE programming. Despite Cormier's claims and the lawsuit still being active, Lesnar would make his return to WWE at their SummerSlam event in August 2025 at the end of a WWE Championship match between John Cena and Cody Rhodes. After the event, Grant's legal team released a statement claiming that WWE had failed to hold anybody accountable for a supposed culture of abuse under McMahon and that any \"attempt to sweep misconduct under the rug\" would backfire.\nSee also\n* MeToo movement, a social movement against sexual assault harassment, especially in the entertainment industry.\n* Speaking Out movement, a social movement against sexual assault and harassment within the professional wrestling industry.\n* Weinstein effect, a scandal in which famous or powerful figures are accused of sexual misconduct.\nReferences\nExternal links\n* [https://s.wsj.net/public/resources/documents/WWE_complaint.pdf Grant's initial complaint], as provided to The Wall Street Journal\n* [https://storage.courtlistener.com/recap/gov.uscourts.ctd.157647/gov.uscourts.ctd.157647.96.0.pdf Grant's amended complaint]"
    }
  ]
}