{
  "content": [
    {
      "type": "text",
      "text": "# Vincent Stewart\n\n|birth_place  = Kingston, Jamaica\n|death_date   =\n|death_place  = Aldie, Virginia, U.S.\n|resting_place= Arlington National Cemetery\n|education    = Western Illinois University (BA)\n|allegiance   =\n|branch       =\n|serviceyears = 1981–2019\n|rank         =  Lieutenant General\n|commands     = Defense Intelligence AgencyJoint Functional Component Command for Intelligence, Surveillance and ReconnaissanceHeadquarters Battalion, 2nd Marine Division\n|mawards      = Defense Distinguished Service MedalDistinguished Service Medal (United States Navy)Defense Superior Service MedalLegion of Merit (2)Bronze Star MedalMeritorious Service Medal (2)Navy and Marine Corps Commendation Medal (3)Navy and Marine Corps Achievement MedalNational Intelligence Distinguished Service Medal\n}}\nVincent Raymond Stewart (May 11, 1958 – April 28, 2023) was a Jamaican-born American lieutenant general in the United States Marine Corps who served as Deputy Commander at United States Cyber Command. He previously served as the 20th Director of the Defense Intelligence Agency (DIA). LtGen Stewart, who held that post from January 23, 2015 through October 3, 2017, was the first African American, first Jamaican American and first Marine to hold the position of Director of the DIA. LtGen Stewart was the 2023 William Oliver Baker Award Recipient presented by the Intelligence and National Security Alliance.\nEarly life and education\nStewart was born in Kingston, Jamaica, on May 11, 1958. He attended Kingston College before immigrating to the United States in 1971 at age 13. He received his undergraduate degree in history in 1981 from Western Illinois University and was commissioned into the United States Marine Corps that same year.\nCareer\nAfter earning his commission, he attended The Basic School (TBS) in Quantico, Virginia, from 1981 to 1982 and was selected to become an Armor Officer. Upon graduation from this training, he was sent to the Armor Officer School in Fort Knox. He then received orders as a Platoon Leader to 1st Tank Battalion at Las Flores, 41 Area, Camp Pendleton, California. In 1984, he became the Executive Officer of Headquarters Company, 1st Tank Battalion.\nStewart earned master's degrees in National Security and Strategic Studies from the Naval War College in 1995 and in National Resource Strategy from the Industrial College of the Armed Forces, National Defense University in 2002. On 23 January 2015, he left his position as the head of the Marine Force's Cyber Command to become the director of the US Defense Intelligence Agency, shortly before which he was promoted to the rank of lieutenant general.\nLtGen Stewart retired from the U.S. Marine Corps at the Marine Barracks Washington on April 5, 2019.\nMarine Corps assignments\n* Platoon Leader, A Company, 1st Tank Battalion (1982–1983).\n* Project Officer, Light Armored Vehicle, Anti-Tank, Twenty-Nine Palms, CA, (1983–1984).\n* Executive Officer, Headquarters and Service Company, 1st Tank Battalion (1984–1985).\n* Company Commander, I Company, Marine Support Battalion, Adak, Alaska, (1986–1988).\n* Company Commander, Headquarters and Service Company, 2d Radio Battalion (1989–1990).\n* Assistant Signals Intelligence Officer, 4th Marine Expeditionary Brigade, (1990–1991).\n* Assistant Operations Officer, 2d Radio Battalion, Camp Lejeune, NC, (1991–1992).\n* Company Commander, E Company, Marine Support Battalion, Misawa Japan (1992– 1994).\n* Chief, Command, Control, Communications and Intelligence Officer, Special Purpose Marine Air-Ground Task Force, Experimental, Quantico, VA, (1996–1999).\n* Commanding Officer, 1st Intelligence Battalion, Camp Pendleton, CA, (1999–2001).\n* Deputy G-2, Marine Forces Central Command (2002).\n* Assistant Chief of Staff, Intelligence, Marine Corps Forces Command, Norfolk, VA, (2005–2006).\n* Commanding Officer, Headquarters Battalion, 2d Marine Division, Camp Lejeune, NC, (2006–2008).\n* Assistant Chief of Staff, Intelligence, II Marine Expeditionary Force, Camp Lejeune, NC, (2008–2009).\n* Director of Intelligence, Marine Corps Intelligence, HQMC, Washington, DC, (2009–2013).\n* Commanding General, U.S. Marine Corps Forces Cyberspace Command, Fort Meade, MD, (2013–2015)\nDepartment of Defense assignments\n* Deputy Director, Intelligence Policy, Office of the Assistant Secretary of Defense, C3I (2001–2002).\n* Senior Intelligence Planner, Office of the Under Secretary of Defense for Intelligence (2002–2005)\n* Commander, Joint Functional Component Command for Intelligence, Surveillance and Reconnaissance, (2015–2017).\n* Director, Defense Intelligence Agency, (2015–2017).\n* Deputy Commander, United States Cyber Command, (2017–2019).\nPersonal life and death\nStewart was married with five children. He died on April 28, 2023, at the age of 64.\nAwards, legacy and decorations\nIn 2020, Stewart was named by Carnegie Corporation of New York as an honoree of the Great Immigrants Award\nOn June 23, 2023, the DIA renamed its Museum in remembrance of Lieutenant General Stewart. Initiated in 2016 under Stewart's leadership, the museum was originally completed in 2020. The museum is closed to the general public, but open to the DIA workforce and cleared visitors.\nLieutenant General Stewart's decorations and medals include:\n{| style=\"margin:1em auto; text-align:center;\"\n|colspan=\"16\"|\n|-\n|colspan=\"16\"|&nbsp;\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|colspan=\"2\"|\n|colspan=\"2\"|\n|-\n|colspan=\"4\"|\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n|-\n| colspan=\"16\"|Navy and Marine Corps Parachutist Insignia\n|-\n|colspan=\"8\"|Defense Distinguished Service Medal\n|colspan=\"8\"|Distinguished Service Medal (United States Navy)\n|-\n|colspan=\"4\"|Defense Superior Service Medal\n|colspan=\"4\"|Legion of Merit with one gold award star\n|colspan=\"4\"|Bronze Star Medal\n|colspan=\"4\"|Meritorious Service Medal with award star\n|-\n|colspan=\"4\"|Navy Commendation Medal with two award stars\n|colspan=\"4\"|Navy Achievement Medal\n|colspan=\"4\"|Combat Action Ribbon\n|colspan=\"4\"|Joint Meritorious Unit Award with one bronze oak leaf cluster\n|-\n|colspan=\"4\"|Navy Unit Commendation with one bronze service star\n|colspan=\"4\"|Navy Meritorious Unit Commendation with one service star\n|colspan=\"4\"|National Intelligence Distinguished Service Medal\n|colspan=\"4\"|National Defense Service Medal with service star\n|-\n|colspan=\"4\"|Southwest Asia Service Medal with three service stars\n|colspan=\"4\"|Afghanistan Campaign Medal with two service stars\n|colspan=\"4\"|Global War on Terrorism Expeditionary Medal\n|colspan=\"4\"|Global War on Terrorism Service Medal\n|-\n|colspan=\"4\"|Navy Sea Service Deployment Ribbon with three service stars\n|colspan=\"4\"|Navy and Marine Corps Overseas Service Ribbon with three service stars\n|colspan=\"4\"|Kuwait Liberation Medal (Saudi Arabia)\n|colspan=\"4\"|Kuwait Liberation Medal (Kuwait)\n|-\n|colspan=\"8\"|Rifle Sharpshooter Badge\n|colspan=\"8\"|Pistol Expert Badge\n|-\n|colspan=\"16\"|United States Cyber Command Badge\n|}\nInternational Awards and Decorations\nLieutenant General Stewart's international decorations and awards include:\n* Japan Defense Cooperation Award\n* Emblem of Honor of the Romanian Army\n* Saudi Arabia Order of King Abdul Aziz\nReferences\nExternal links\n*"
    }
  ]
}