{
  "content": [
    {
      "type": "text",
      "text": "# Vinegar Hill, Queensland\n\n| pop                 = 57\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            =\n| area                = 64.6\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.8\n| dir1                = NNW\n| location1           = Gatton\n| dist2               = 42.1\n| dir2                = ENE\n| location2           = Toowoomba CBD\n| dist3               = 63.4\n| dir3                = W\n| location3           = Ipswich CBD\n| dist4               = 101\n| dir4                = W\n| location4           = Brisbane\n| lga                 = Lockyer Valley Region\n| stategov            = Lockyer\n| fedgov              = Wright\n| near-n              = Buaraba South\n| near-ne             = Buaraba\n| near-e              = Spring Creek\n| near-se             = Adare\n| near-s              = Ringwood\n| near-sw             = Ringwood\n| near-w              = Seventeen Mile\n| near-nw             = Buaraba South\n}}\nVinegar Hill is a rural locality in the Lockyer Valley Region, Queensland, Australia. In the , Vinegar Hill had a population of 57 people.\nGeography\nThe locality presumably takes its name from the hill Vinegar Hill  in the south-west of the locality () which rises to  above sea level.\nMost of the locality is within the Lockyer National Park which extends into neighbouring Seventeen Mile and Ringwood. There are two sections of the locality in the south and south-east not within the national park; the land use within these is predominantly grazing on native vegetation.\nDemographics\nIn the , Vinegar Hill had a population of 57 people.\nIn the , Vinegar Hill had a population of 57 people.\nEducation\nThere are no schools in Vinegar Hill. The nearest government primary schools are Lake Claredon State School in Lake Claredon to the south-east, Gatton State School in Gatton to the south, and Helidon State School in Helidon to the south-west. The nearest government secondary school is Lockyer District State High School, also in Gatton.\nVinegar Hill virus\nThe locality gives its name to the Vinegar Hill orthonairovirus, which is a tick-bourne. In 1981, the virus was isolated on the Australian mainland from a pool of five female Argasidae robertsi ticks collected from a rookery of the cattle egret (Bulbulcus ibis) in the Gatton area in December 1981.\nReferences"
    }
  ]
}