{
  "content": [
    {
      "type": "text",
      "text": "# Violin making and maintenance\n\nMaking an instrument of the violin family, also called lutherie, may be done in different ways, many of which have changed very little in nearly 500 years since the first violins were made. Some violins, called \"bench-made\" instruments, are made by a single individual, either a master maker or an advanced amateur, working alone. Several people may participate in the making of a \"shop-made\" instrument, working under the supervision of a master.  This was the preferred method of old violin makers who always put their names on violins crafted by their apprentices.  Various levels of \"trade violin\" exist, often mass-produced by workers who each focus on a small part of the overall job, with or without the aid of machinery.\n\"Setting up\" a violin is generally considered to be a separate activity, and may be done many times over the lengthy service life of the instrument. Setup includes fitting and trimming tuning pegs, surfacing the fingerboard, carving the soundpost and bridge, adjusting the string spacing and action height, and other tasks related to putting the finished instrument into playing condition and optimizing its sound and responsiveness to playing.\nViolin maintenance goes on as long as the instrument is to be kept in playing condition, and includes tasks such as replacing strings, positioning the soundpost and bridge, lubricating pegs and fine tuners, resurfacing the fingerboard, attending to the instrument's finish, and restoring, repairing, or replacing parts of the violin or its accessories which have suffered wear or damage.\nMaking violins\nA new violin scroll being carved.\nThe outer contour of a new violin, one of the more important aspects of the instrument, is designed by the violin maker, and in the 2020s, the outlines of the old masters' violins are usually used. Different methods of violin making include using an inside mould, an outside mould, or building \"on the back\" without a mould.\nThe \"inside mould\" approach starts with a set of plans, which include a drawing of the outer shape of the instrument. From these plans a template is constructed, which can be made from thin metal or other materials, and is a flat \"half-violin\" shape. The template is used to construct a mould, which is a violin-shaped piece of wood, plywood, MDF or similar material approximately 12&nbsp;mm or 1/2\" thick. Edward Herron-Allen, in 1885, specified a \"full mould\" with dimensions equal to the finished ribs (interior) of the violin.\nAround the mould are built the sides (or ribs), which are flat pieces of wood curved by means of careful heating. Early violin makers used strips of \"tiger\" maple wood to enhance the beauty of the violin, and most luthiers preferred Norway spruce harvested in Northern Italy. The completed \"garland\" of ribs, blocks, and linings is removed from the mould to allow attachment of the separately carved top and back. When the body is complete, the neck, which is carved out of a separate piece of wood (usually maple), is set in its mortise to complete the basic structure of the instrument, after which it is varnished. Maple, especially Norway Maple (and variety Bosnian maple), is considered the choice wood for the neck, back and sides, because of its strength and ability to withstand the stresses exerted on it by playing.\nViolin taken down, with upright soundpost visible through the sound hole.\nVital to the sound and playability of the instrument is setup, which includes adjusting the neck angle if needed, fitting the pegs so they turn smoothly and hold firmly, dressing the fingerboard to the proper scooped shape, fitting the soundpost and bridge, adjusting the tailgut and installing the tailpiece, and stringing up. A removable chinrest may be put on at this time.\nThen the instrument begins the \"playing-in\" process, as its parts adjust to the string tension. The sound of a violin is said to \"open up\" in the first weeks and months of use, a process which continues more gradually over the years. However, this process may be aborted at some point. If you put a violin to storage and pull it out a while later, you will notice when you first play that the violin has lost volume (this is a very common sign of violin inactivity), and loss of quality (this is in more severe cases of inactivity). If you put a violin into storage, pull it out a while later, and play it for a few weeks, you will notice the violin's sound start to \"open up\" again.  However, to increase the volume of the violin, the wood should be allowed to \"dry\" over several months or even years prior to use in violin-making.  This will help \"cure\" the wood, thus improving its tone, timbre, and volume.\nMaintenance\nClose-up of rosin grains on end of fingerboard.\nWith careful maintenance, a violin can last and improve for many years. A well-tended violin can outlive many generations of violinists, so it is wise to take a curatorial view when caring for a violin. Most importantly, if the collected rosin dust is not wiped from the varnish and left for long enough, it will fuse with the varnish and become impossible to remove without damage.\nCleaning the rosin off strings can make a striking difference to the sound.  A common wine cork serves admirably, quietly scrubbing off the crust of rosin without damaging the winding of the string. A dry microfiber cloth is often recommended; it retains the dust well, but makes a penetrating squeaking noise. A cloth with a little rubbing alcohol is effective, if care is taken to protect the top of the violin from the slightest chance of stray droplets of alcohol touching the varnish. The use of alcohol is generally avoided, as it easily damages varnish in ways which may be difficult or impossible to restore.\nThe tuning pegs may occasionally be treated with \"peg dope\" when they either slip too freely, causing the string to go flat or slack, or when they stick, making tuning difficult. Some violinists and luthiers use a small amount of ordinary blackboard chalk on pegs to cure slippage. \"Peg drops\" (a solution of rosin in alcohol) may occasionally be used to treat slipping pegs, but that is a temporary solution at best; quite often slipping pegs have shafts which are no longer smoothly conical and should be refitted or replaced.\nThe violin will benefit from occasional checks by a technician, who will know if repairs need to be made.\nViolinists generally carry replacement sets of strings to have a spare available in case one breaks. Even before breaking, worn strings may begin to sound tired and dull and become \"false\" over time, producing an unreliable pitch.  Another common problem with strings is unravelling of the metal winding. Strings may need replacement every two or three months with frequent use.  The higher strings require replacement more frequently than the lower strings since they are lighter in construction to produce a higher sound&ndash; fortunately their lighter weight also means they cost less.  The price of strings varies, and the quality of the strings strongly influences the timbre of the sound produced. A teacher can advise students how often to change strings, as it depends on how much and seriously one plays.\nFor the bow, the only real maintenance is regular cleaning of the stick with a cloth (to remove rosin dust), re-hairing, and replacing the leather and silver wire wrapping.  In the course of playing, hairs are often lost from the bow, making it necessary to have it rehaired periodically, which is done by professionals at roughly the cost of a new set of strings.  Other maintenance may include replacing the wire lapping and leather grip or lubricating the screw.  Large cracks and breakages in the bow are usually fatal; they cannot be repaired like the body of the violin can. A bow which has warped and is no longer straight can sometimes be bent back to true or re-cambered, but this must be done with heat by a craftsman and is not always successful or worthwhile. Loosening the hair when the bow is not being used helps keep the bow from becoming \"sprung\" or losing its camber and the hair from becoming stretched. In the 2020s, there are bows available made from fiberglass or carbon composite which are less fragile. Some of the fiberglass bows are much cheaper than wooden bows. The best carbon composite bows are used by some professional musicians.\nSound post adjustment\nThe position of the sound post inside the violin is critical, and moving it by very small amounts can make a substantial difference in the sound quality of an instrument. The thickness of the post is important as well. Sound post adjustment is as much art as science, depending on the ears, experience, structural sense, and sensitive touch of the luthier. Moving the sound post has very complex consequences on the sound; in the end, it is the ear of the person doing the adjusting that determines the desired location of the post.\nHere are some rough guides to how sound post placement influences the sound quality of the instrument:\n* If the sound is too thin and shrill, the post may be too near the f hole or too tight, or the post may be too thin.\n* If the sound is weak and there is a loss of power (especially in the lower register), the post may be too near the center of the instrument.\n* If there is a loss of overall power and tone, the post may be too far behind the bridge, or the post may be too thick.\nSchools\nThe traditional path into violin making is through apprenticing under an experienced luthier. However, there are also schools, and classes within universities, which may focus on different areas of violin making or repair, and others include auxiliary aspects of lutherie, such as playing, technical illustration and photography. Courses vary in length from several weeks to three or four years.\nBelgium\n*Ecole Internationale de Lutherie\nBrazil\n*O Curso de Luteria do Conservatório de Tatuí\n*Curso superior de Tecnologia em Luteria da Universidade Federal Do Paraná - UFPR\nCanada\n*Ecole Nationale de Lutherie\n**Quebec City, Quebec\nCzech Republic\n*Violin Making School Cheb\n**Cheb, Czech Republic\nEngland\n*London Guildhall University\n**London, England\n*Newark School of Violin Making\n**Newark-on-Trent, England\n*Chapel Violins School\n**Newark-on-Trent, England\n*West Dean College\n**Chichester, West Sussex\n*Merton College\n**Morden, Surrey\n*Cambridge Violin Makers Workshop\n**Cambridge, UK\nFinland\n*Ikaalinen Handicraft and Industrial Arts Institute\nGermany\n* Berufliches Schulzentrum (BSZ) für Technik Oelsnitz\n* Studiengang Musikinstrumentenbau Markneukirchen\n* Staatliche Berufsfach- und Fachschule für Geigenbau und Zupfinstrumentenmacher in Mittenwald\nItaly\n*Scuola Internazionale di Liuteria A. Stradivari\n**Cremona, Italy\n*Civica Scuola di Liuteria\n**Milan, Italy\n*Scuola Internazionale di Liuteria di Parma\n**Parma\nJapan\n*Tokyo Violin Making School (since 2007 closed)\nMexico\n*Escuela de Laudería / National Institute of Fine Arts and Literature (INBAL)\n**Colonia Juárez, Mexico City\nNorway\n*Musikk Instrument Akademiet\nScotland\n*Stringed Instrument Repair and Construction at Anniesland College\nSwitzerland\n*Geigenbausechule Brienz\nUnited States\n*The Chicago School of Violin Making\n**Skokie, Illinois\n*North Bennet Street School\n**Boston, Massachusetts\n*Minnesota State College-Southeast Technical\n**Red Wing, Minnesota\n*University of New Mexico\n**Albuquerque, New Mexico\n*Violin Making School of America\n**Salt Lake City, Utah\nSee also\n* Blackbird (violin), a playable violin-shaped sculpture made of diabase (dolerite)\n* Luthier\n* Stradivarius violin\nFurther reading\n* Courtnall, Roy; Johnson, Chris (1999). The Art of Violin Making. London:  Robert Hale Ltd..\n* Domenico, Angeloni (1923). Il Liutaio - Origine e costruzione del violino e degli strumenti ad arco moderni. Milan. OCLC: 558075991.\n* Heron-Allan, Edward (1885). [https://archive.org/details/cu31924022320216/page/n11/mode/2up Violin-making : as it was and is, being a historical, theoretical, and practical treatise on the science and art of violin-making, for the use of violin makers and players, amateur and professional]. London: Ward, Lock & Co. Ltd..\n* Sacconi, Simone F. (1972). The secrets of Stradivari. Cremona: Libreria del Convegno. OCOC: 227975557.\nExternal links\n*[https://books.google.com/books?id=aLhGAAAAMAAJ] - Complete bibliography\n*[http://makingtheviolin.com The violin making manual] - The complete violin making guide with vectorized images and plans\n*[http://www.violinbridges.co.uk Violinbridges] - Online bridge Archive\n*[http://bormanviolins.com/violinworkbook/vmindex.asp Violin Maker's Workbook] - complete online maker's workbook compiled by apprentice to a master luthier\n*[http://www.theviolinsite.com/violin_making Violin Making] - virtual tour of a violin shop\n*[http://www.violins.demon.co.uk/making Making a Violin] - watch a violin maker construct a violin by hand\n*[http://www.darntonviolins.com/viola1.php Photo essay on making a viola]\n*[http://www.mimf.com Musical Instrument Makers Forum]\n*[http://www.fiddleforum.com/fiddleforum/index.php?board=31.0/ Violin Discussion Forum] - section on building and maintaining violins\n*[http://www.violins.on.ca/luthier/soundpost.html Sound post setting article]\n*[http://bormanviolins.com/articles/StradArticle.pdf Path Through the Woods: The Use of Medical Imaging in Examining Historical Instruments] (PDF)\n*Free e-text of [https://www.gutenberg.org/ebooks/26878 The Repairing & Restoration of Violins by Horace Petherick] on project Gutenberg\n*[http://www.theluthierhelper.com The Luthier Helper] - Specialized search engine looking only in violin and stringed instrument making, repair and restoration resources"
    }
  ]
}