{
  "content": [
    {
      "type": "text",
      "text": "# Virginia Monument\n\n| complete      =\n| open          = 1917 June 8\n| restore       =\n| dismantled    =\n| dedicated_to  =\n| map_name      =\n| map_text      =\n| map_width     =\n| map_relief    =\n| coordinates   =\n| website       =\n| extra         =\n}}The Virginia Monument, also commonly referred to as \"The State of Virginia Monument\", is a Battle of Gettysburg memorial to the commonwealth's \"Sons at Gettysburg\" with a bronze statue of Robert E. Lee on his horse Traveller and a \"bronze group of figures representing the Artillery, Infantry, and Cavalry of the Confederate Army\". The equestrian statue is atop a granite pedestal and the group of six standing figures is on a sculpted bronze base with the figures facing the Field of Pickett's Charge and the equestrian statue of Union General George G. Meade on Cemetery Ridge. The granite pedestal without either sculpture was dedicated on June 30, 1913 for the 1913 Gettysburg reunion. On June 8, 1917, Virginia governor Henry C. Stuart presented the completed memorial to the public.\nDescription and location\nThe Virginia Monument is located on West Confederate Avenue on the Southwest side of Gettysburg National Park. The monument consists of three different parts: a bronze General Robert E. Lee perched on his horse, Traveller; a granite pedestal with inscriptions; and a bronze group of Confederate soldiers at the base of the monument.  The monument in its entirety stands at 41 feet tall, the section of Robert E. Lee and the horse standing at 14 feet tall and the granite pedestal standing at 16 feet tall. Below Lee, who is shown looking toward the distant Union lines, are seven Confederate soldiers. The men are meant to represent individuals who left various occupations to join the Confederate army: \"a professional man, a mechanic, an artist, a boy, a business man, a farmer, and a youth.\"  According to a description published at the time that sculpture was completed, \"the shattered cannon, broken wheel, discarded knapsack, swab and exploded shells which are scattered at the feet of the seven men would indicate that the place had been the scene of some desperate engagement, while the attitude of each of the character shows defensive, rather than offensive action.\"\nGettysburg National Military Park is a 3,500 acre historic park that is administered by the National Park Service to commemorate the battle of Gettysburg. The site also contains the Gettysburg National Cemetery.\nThe National Park Service states that \"the Virginia Monument was the first Southern state monument placed on the Gettysburg battlefield. Dedicated in 1917, it is located near the spot where Robert E. Lee watched the repulse of Pickett's Charge on July 3, 1863.\"\nApproval process\nThe Gettysburg National Park Commission (GNPC) was entrusted with the erection of a monument for the troops of Virginia that participated in the Battle of Gettysburg. The Commission instructed Thomas Smith, Secretary of Virginia Gettysburg Commission (VGC), to report to Henry L. Stimson, Secretary of War, that the location site of the Memorial would be in the Confederate line of battle known as \"Spangler Woods\"\nIn an extensive correspondence between Thomas Smith and John P. Nicolson, the Chairman of GNPC, the memorial's form and inscription were debated. Smith proposed that the inscription should state \"VIRGINIA TO HER SOLDIERS AT GETTYSBURG. THEY FOUGHT FOR THE FAITH OF THEIR FATHERS.\" After multiple meetings with the entirety of the GNPC, Smith and Nicolson agreed to change the inscription to \"VIRGINIA TO HER SONS AT GETTYSBURG\" and to substitute the Virginia State flag in place of the Confederate flag.\nThe Memorial was commissioned on March 9, 1908 and cost $50,000 at the time (in 2023 equating to about $850,000). The monument, with the exception of the sculptures of Robert E. Lee and the seven Confederate soldiers, was fully installed in 1913, and was dedicated at the 50th anniversary of the Gettysburg battle (1913). The statue was completed with the two sculptures in 1917, and was unveiled by Miss Virginia Carter, General E. Lee's niece, in tandem with Henry C. Stuart, the governor of Virginia at a ceremony hosted by the Gettysburg National Military Park.\nat the top of the Virginia Monument.]]\nFrederick William Sievers\nThe contract for the design of the Virginia Memorial was awarded to Frederick William Sievers. Sievers was not known for equestrian statues, yet his design was exhibited in Richmond, Virginia and thoroughly impressed John P. Nicolson, Chairman of the GNPC.\nSievers sought to produce a work that memorialized all of those who dedicated their lives to the Confederate army. Sievers found that the majority of Civil War monuments did not accurately reflect the range of soldiers who served. Sievers aimed to shift the focus from military generals and lieutenants to lower ranking soldiers.\nSievers produced many Civil War monuments for prominent locations after the success of the Virginia Monument.\nPreservation\nIn September 2022, the National Park Service worked to preserve the Virginia Memorial. The preservation project included the replacement of an old patina with a newer patina that resembled a close relation to the finish of the original construction of the Memorial.\nSee also\n*List of monuments of the Gettysburg Battlefield\nReferences"
    }
  ]
}