{
  "content": [
    {
      "type": "text",
      "text": "# Virginia Cavaliers (historical)\n\nof King Charles II in 1660]]\nVirginia Cavaliers were royalist supporters (known as Cavaliers) in the Royal Colony of Virginia at various times during the era of the English Civil War and the Stuart Restoration in the mid-17th century. They are today seen as a state symbol of Virginia and the basis of the founding Southern chivalry of the Old South.\nHistorical background\nAfter a severe struggle with the Crown, the Virginia Company was deprived of its charter in 1624. The chief cause of this was that the Puritan element, which formed the backbone of the opposition in Parliament, had also gained the ascendency in the Virginia Company. Furthermore King James did not like the action of the company a few years earlier in extending representative government to the colonists. The result was the loss of the charter.\nThe Virginia Colony became a royal colony and so it continued until the Revolutionary War. But the change had little effect on the colony, for King Charles I was so occupied with troubles at home that he gave less attention to the government of Virginia than the company had done, and popular government continued to flourish. Of the 6,000 people who had come from England before 1625, only one fifth remained alive, but this number was rapidly augmented by immigration. Governor George Yeardley died in 1627, and John Harvey, a man of little ability or character, became governor. Harvey kept the Virginians in turmoil for some years, but the colony was so firmly established that his influence did not greatly affect its prosperity.\nThe longest rule of one man in its colonial history was that of Governor William Berkeley, who became governor of Virginia in 1642 and continued to hold the office until 1677, with the exception of a few years under the commonwealth. Berkeley was a rough, outspoken man with much common sense but with a hot temper and a narrow mind.  He was a Cavalier of the extreme type, and during the first period of his governorship he spent much of his energy in persecuting the Puritans, many of whom found refuge in Maryland.\nCharles I, is the quintessential Cavalier for whom they are all named. This painting is entitled \"Charles I in Three Positions\" by [[Anthony van Dyck.]]\nCivil war\nAbout the time Berkeley assumed the office, a fierce war broke out in England between the royalist Cavaliers and the Parliamentarian  Roundheads, factions over the governance of England. Parliamentarians included many Puritans (independent Protestant denominations). Over the course of the conflict, Oliver Cromwell, one of the strongest personalities in British history, rose to prominence through his generalship and was a grandee in the New Model Army. The second civil war started when Charles sought to gain power through an invasion of England by the Scots—the latter promised that Presbyterianism would be imposed on England. In 1649, following the defeat of the Scottish army and royalist revolts, Charles I was tried, convicted and beheaded by his own subjects.\nAlthough the Puritan colonies, most notably Massachusetts, were dominated by Parliamentarians, the older colonies sided with the Crown. The Virginia Company's two settlements, Virginia and Bermuda (Bermuda's Puritans were expelled, settling the Bahamas under William Sayle), as well as Antigua and Barbados were conspicuous in their loyalty to the Crown, and singled out by the Rump Parliament in An Act for prohibiting Trade with the Barbadoes, Virginia, Bermuda and Antego in October, 1650. This dictated that\nThe act authorised Parliamentary privateers to act against English vessels trading with the rebellious colonies:\nBerkeley, with most of the Virginians, was loyal to the Crown, and he invited the young son of the executed monarch to come to America and become king of Virginia. But Parliament would suffer no opposition from the colony and it sent a commission with a fleet to reduce the colony to allegiance. The Virginians were only mildly royalist, and they yielded without a struggle; but they lost nothing by yielding, for the commonwealth granted them greater freedom in self-government than they had ever before enjoyed under the auspices of the relatively popular Puritan Governor Richard Bennett.\nIn two ways the brief period of the commonwealth in England had a marked effect on the history of Virginia. For the first and only time during the colonial period, Virginia enjoyed absolute self-government. The assembly, governorship, and council were all elective for the time, and the people never forgot this taste of practical independence. The other respect in which the triumph of the Roundheads in England affected Virginia was that it caused a small number of Cavaliers to emigrate from England to the colony, bolstering the Cavalier elite led by Berkeley; whose political power was disproportionate to their number (estimated at approximately 10% of the population of Virginia.)\nAn anonymous pamphlet published in London in 1649 gives a glowing account of Virginia, describing it as a land where \"there is nothing wanting,\" a land of 15,000 English and 300 negro slaves, 20,000 cattle, many kinds of wild animals, \"above thirty sorts\" of fish, farm products, fruits, and vegetables in great quantities, and the like. This was intended to induce home seekers to migrate to Virginia. Amongst those who migrated were the ancestors of George Washington, James Madison, James Monroe, John Marshall, and of many others of the First Families of Virginia. By 1670 the population of the colony had increased to 38,000, of whom 6,000 were indentured servants, while the African slaves had increased to 2,000.\nRestoration of 1660\nThe Stuart Restoration of 1660 brought the exiled Charles to the English, Scottish and Irish thrones as Charles II, and Berkeley again became governor of Virginia. Cromwell, the Lord Protector of England, had died in 1658, and Richard, his son and successor, was too weak to hold the reins of government and laid aside the heavy burden the next year, and Charles II became king. Charles was not a religious enthusiast, as his father had been. He is noted for his pursuit of pleasure, which many subjects applauded after the dry years of the Protectorate.\nCharles was utterly without gratitude to the people of Virginia for their former loyalty, and indeed it may be said that his accession marks the beginning of a long period of turmoil, discontent, and political strife in Virginia. Charles immediately began to appoint to the offices of the colony a swarm of worthless place hunters, and some years later he gave away to his court favorites, the Earl of Arlington and Lord Culpeper, nearly all the soil of Virginia, a large portion of which was well settled and under cultivation.\nThe Navigation Acts, enacted ten years before, was re-enacted with amendments and put in force. By this the colonists were restricted to only exporting goods to England via English vessels. Imports also were to be brought from England only. The prices therefore of both exports and imports were set in London, and the arrangement enabled the English merchants to grow rich at the expense of the colonists. The result was a depreciation in the price of tobacco, the circulating medium, to such a degree as to impoverish many planters and almost to bring about insurrection.\nAdding to the multiplying distresses of Virginia, Governor Berkeley, who had been fairly popular during his former ten-year governorship, seems to have changed decidedly for the worse. He became royalist to the core and appeared to have lost whatever sympathy with the people he ever had. He was accused of conniving with custom-house officials in schemes of extortion and blackmail, and even of profiting by their maladministration. Popular government thus suffered a long eclipse in Virginia. In 1661 Berkeley secured the election of a House of Burgesses to his liking, and he kept them in power for fifteen years, refusing to order another election.\nNotable Virginia Cavaliers\n*William Berkeley\n*Sir Thomas Lunsford\n*Henry Norwood\n*John Washington, great-grandfather of George Washington\nNotes\nReferences\n*Elson, Henry William; History of the United States of America, The MacMillan Company, New York, 1904. Chapter IV pp.&nbsp;60–73."
    }
  ]
}