{
  "content": [
    {
      "type": "text",
      "text": "# Virulent: The Vaccine War\n\n| writer         =\n| producer       = Laura Davis\n| cinematography = Tjardus Greidanus\n| editing        = Tjardus Greidanus\n| music          = Gary Lionelli\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 1 hour 20 minutes\n| country        = United States\n| language       = English\n| budget         =\n}}\nVirulent: The Vaccine War is a 2022 documentary produced by Laura Davis and directed by Tjardus Greidanus which explores the history, dangers and impact of the anti-vaccination movement in the United States at the time of the COVID-19 pandemic.\nDescription\nVirulent: The Vaccine War explores the history of vaccines and the perspectives of the opposition in light of the COVID-19 pandemic. The film posits that vaccine hesitancy is largely caused by two unconnected reasons, one is personal freedom and the other is opposition to anything that is seen as unnatural. The movie also explores conspiracy theories about vaccination created and spurred on by the anti-vaccination movement. Davis said that she was surprised to learn how complicated vaccine hesitancy is: \"I really thought it was going to be easy to dismiss vaccine skeptics as not educated. It’s much subtler than I thought\".\nThe film includes commentary by many medical experts, including the film's credited medical consultant, Paul Offit, and also identifies the big names and organizations in the anti-vaccine movement, including Del Bigtree, the CEO of the Informed Consent Action Network, and Robert F. Kennedy Jr., founder of Children's Health Defense who is interviewed in the film. Virulent highlights families impacted by preventable diseases in order to stress the importance of herd immunity from sufficient community vaccination. Davis said that \"Most people won’t change their minds immediately after watching one film. But hopefully we can open up dialogue.\"\nProduction\nGreidanus, the film's director, editor and cinematographer, has stated that being questioned at a film festival about the intent of his previous film on the subject of vaccinations, A Shot to Save the World, about the creation of the polio vaccine — regarding whether it was pro or anti vaccination — spurred him to dive further into that subject with Virulent. Production of the film began prior to the appearance of COVID-19, but due to pandemic, additional material was filmed and added.\nReception\nWendy M. Grossman writing about the film in The Skeptic said \"overall, this is a well-done portrait of the American anti-vaxx movement as it’s developed over time. Well-informed skeptics are unlikely to find a lot that’s new, but the personal stories offer food for compassion. One of these is Offit’s own, which he gives in response to Kennedy’s accusation that he’s only in vaccines for the money. As a young child, Offit was kept on a pediatric polio ward while he recovered from surgery to correct a clubfoot. He never lost the memory of the vulnerable children he saw there or his resulting desire to protect them. \"How exactly does Bobby Kennedy make the world a better place, please tell me that?\" he asks, exasperated.\"\nStuart Vyse writing in Skeptical Inquirer said  that the film \"describes the rise of the anti-vaccination movement from long before COVID-19 to the present day,\" and that it \"features interviews with pediatrician and author Dr. Paul Offit, surgical oncologist and managing editor of Science-Based Medicine Dr. David Gorski, and clinical neurologist and ''Skeptics' Guide to the Universe podcaster Dr. Steven Novella... Peter Salk, son of Salk vaccine discoverer Jonas Salk and president of The Jonas Salk Legacy Foundation, also appears in the film. The anti-vaccination position is presented in interviews with vaccine hesitant parents, as well as perhaps the most prominent and virulent anti-vax advocate, Robert F. Kennedy Jr.\" Vyse echoed the review of Jonathan Jarry of the McGill University Office for Science and Society who wrote that the film, \"shows us what the modern anti-vaccine movement looks like and pushes back with stories of its own. … People need to see it.\"\nThe Center For Inquiry wrote that the film \"examines the history of vaccine hesitancy, and the galvanizing effect Covid-19 has had on anti-vaccination activists.\" and it is \"an invitation to think again, exposing the myths and laying bare the facts about vaccine science, its history, and what it will take to eradicate the world’s most deadly diseases.\" The review also said that the film \"features scientists and others in the trenches including Dr. Paul Offit, one of the world’s preeminent virologists; public health expert Dr. Peter Salk, the son of polio vaccine inventor Dr. Jonas Salk; and New York Times columnist Kevin Roose, who writes about how disinformation spreads online.\"\nDavid Gorski wrote in Science-Based Medicine'' that the film's message is important and related its themes to the coverage of the anti-vaccine movement by himself and other medical professionals, and said it is \"a documentary that needs to be seen more widely.\"\nSee also\n* List of vaccine topics\nReferences\n}}\nExternal links\n*\n*\n* [https://virulentmovie.com Official website]"
    }
  ]
}