{
  "content": [
    {
      "type": "text",
      "text": "# Visegrád Battlegroup__disambig_1\n\n| allegiance =\n| type = Regiment\n| branch = EU Battlegroup\n| dates = 1 January 2016 – 30 June 20161 July 2019 – 31 December 2019\n| specialization =\n| command_structure = European Union Military Staff\n| size = 3700\n| current_commander =\n| garrison =\n| ceremonial_chief =\n| nickname =\n| motto =\n| colors =\n| march =\n| mascot =\n| battles =\n| notable_commanders =\n| anniversaries =\n}}\nThe Visegrád Battlegroup or V4 EU Battlegroup is an EU Battlegroup led by Poland, in which the other fellow Visegrád Group countries – the Czech Republic, Slovakia and Hungary participate. It was on standby from 1 January until 30 June 2016 and from 1 July until 31 December 2019. It's scheduled to go on standby in the first half of 2023.\nHistory\nOn 12 May 2011, Polish Defence Minister Bogdan Klich said that Poland would lead a new EU Battlegroup of the Visegrád Group. The decision was made at the V4 defence ministers' meeting in Levoča, Slovakia, and the battlegroup became operational and was placed on standby in the first half of 2016. The ministers also agreed that the V4 militaries should hold regular exercises under the auspices of the NATO Response Force, with the first such exercise to be held in Poland in 2013. The battlegroup included the members of V4 and Ukraine.\nOn 14 March 2014, a pact was signed on a joint military body within the European Union, in response to the 2014 Russian military intervention in Ukraine. The deal involves joint military exercises, coordinated defence procurement and joint defence development of the four central European countries. In the Bratislava Declaration of 9 December 2014, the V4 stated that, considering \"Russia’s aggressive actions against Ukraine (...) V4 countries will coordinate their national positions to maximise the efforts to support Ukraine\", confirming Ukraine's participation in the Visegrád Battlegroup in the first half of 2016. On Polish suggestion, the V4 agreed \"to form another V4 EU Battlegroup in the second semester of 2019\". The V4 are considering to keep the Battlegroup as a permanent unit after 2016, which would set a precedent. The Battlegroup is deemed the 'flagship' of intensified future \"systemic and systematic defence planning, exercises and perhaps even procurement and maintenance\" amongst the V4.\nThe V4 EU BG was reinforced by Ukraine in 2016 and by Croatia in 2019. In 2023, the V4 EU BG will be reinforced by Croatia, Latvia and Lithuania.\nComposition and equipment\nThe Battlegroup in 2016 consisted of around 3,700 troops:\n{| class=\"wikitable\"\n|Poland\n|1 870\n|main manoeuvre combat forces\n|-\n|Czech Republic\n|728\n|logisticians, helicopter unit, electronic combat team, medical unit\n|-\n|Hungary\n|640\n|combat engineers, civil-military cooperation unit\n|-\n|Slovakia\n|460\n|unit for protection against weapons of mass destruction\n|-\n|Ukraine\n|19\n|\n|}\nSee also\n*Czech–Slovak Battlegroup\n*Czech Republic–Russia relations\n*Hungary–Russia relations\n*Poland–Russia relations\n*Russia–Slovakia relations\n*Russia–Ukraine relations\n*Ukraine–European Union relations\n*War in Donbas\n*Warsaw Pact\n*NATO\nReferences\nExternal links\n[https://www.visegradgroup.eu/about/cooperation/visegrad-group-defence/ Visegrad Group website]"
    }
  ]
}