{
  "content": [
    {
      "type": "text",
      "text": "# Visionware\n\n|industry = Computer software\n|products =\n|fate = Acquired by SCO\n|type = Private\n|num_employees = 130 (1994)\n|revenue = $12 million (1994)\n}}\nVisionware Ltd was a British software company that developed and marketed products that helped integration of Microsoft Windows clients to Unix-based server applications.  It was based in Leeds in West Yorkshire.  The three products it was most known for were PC-Connect, XVision, and SQL-Retriever.\nVisionware was created in June 1989 as a management buy-out from Systime Computers.  The firm experienced substantial growth during its five and a half years of existence.  Visionware was acquired by the Santa Cruz Operation (SCO) in December 1994.\nOrigins in Systime\nVisionware has its origins in Leeds-based Systime Computers, which during the late 1970s and early 1980s had become the second largest British manufacturer of computers.  Its success was based around selling systems built around OEM components from Digital Equipment Corporation (DEC), and it had grown to have some 1200 employees with turnover of around £40 million.  It had then fallen on quite difficult times, in part due to lawsuits from DEC for intellectual property infringement and even more so due to running afoul of Cold War-era U.S. export restrictions regarding indirect sales to Eastern bloc countries.  In 1985 what was left of Systime had been acquired by Control Data Corporation.  Systime then focused on selling products built by its own engineers, and placed a greater emphasis on innovation in software technologies.\nThe Systime-Control Data arrangement did not prosper, and in June 1989, Control Data got out of the position via Systime being split into four separate companies, each funded by a management buyout with some venture capital funding attached.\nIndependent company\nVisionware's offices were at 57 Cardigan Lane in the Burley area of Leeds, here seen in 2017\nVisionware Ltd was one of these four management-buyout ventures, focusing on Windows-Unix connectivity products that had been developed at Systime.    The two founders were former Systime technical development manager Tony Denson and former commercial manager Chris Holmes.  It has been said that Visionware had an initial employee count of 20 people and initial annual revenues of $300,000.The new firm debuted at the European Unix Show in London in June 1989.\nAs one former SCO UK employee has succinctly summarised, \"Visionware specialised in software that ran on Windows that made Unix easier to use.\"  The core Visionware products were:\n* PC-Connect – in part a terminal emulator for Microsoft Windows, it was composed of implementation elements that ran on both Unix and Windows, and supported cut-and-paste between Windows, X Windows, and Unix character mode applications.  It was re-sold under the name of Altos Computer Systems and also was part of several other redistribution agreements.  Supported Unix platforms included Sun Solaris, IBM AIX, HP-UX, UnixWare, SCO Unix, Xenix, and various others.  PC-Connect was first developed by Systime and released by them in 1987.\n* XVision – a Windows-based server for the Unix-oriented X Window System.  It supported color graphics and maintained the look-and-feel of Windows within the X applications.  Originally called PC-XVision when under development at Systime.\n* SQL-Retriever – an Open Database Connectivity (ODBC)-compliant database connectivity software product.  It supported operation in conjunction with a number of database products, including Informix, Oracle, Uniplex, and Interbase, with the idea that Windows applications such as Microsoft Excel could pull data from a relational database and incorporate it into the application.  Originally called SQL-Connect when first developed by Systime and in its initial releases by Visionware,  the name was changed around 1991 to avoid a copyright issue with a large database vendor.\nIn the early 1990s, the market that Visionware was in – providing connectivity between Windows PCs and corporate applications – was an important and growing one.  Overall, the goal of Visionware was expressed as the enablement of \"seamless integration\" between Windows-based PCs and Unix-based servers.\nAs of 1992, a majority of Visionware's revenues were coming from the European market.  That same year, it set up a North American operation based in Menlo Park, California in the United States.  By 1993, Visionware had revenues of around $6 million.\nIn 1994, Visionware had some $12 million in revenue – double that of the previous year – and 130 employees, most of whom were in Leeds.  In addition to the North American operation, the firm also had smaller European ones in Bonn and Paris, where area marketing and communications staff were based, as well as one in Sydney, Australia.\nBy October of that year, there were industry rumours  that Visionware was open to being acquired, a notion that the company denied.\nAcquisition by SCO\nAround the time it was acquired by SCO, Visionware moved its offices to Waterside House on the Kirkstall Road in Leeds, here seen in 1997\nOn 12 December 1994, the Santa Cruz Operation announced that it had acquired Visionware for $14.75 million in cash and a small amount of stock.\nSCO had worked with Visionware since 1993 on an optimised X server for Wintif, a version of Motif with a Windows look-and-feel that was made by an earlier, Cambridge-based SCO acquisition, IXI Limited.  (And Visionware had collaborated with IXI going back to Systime days.)\nThe acquisition gave SCO a better foothold in the Windows client world and the ability to put a Windows-friendly front on its traditional OpenServer-based Unix product line, although there was some skepticism that SCO's traditional base of back-end transaction processing would see much need for desktop client access.  Visionware co-founder Denson said that both Visionware's and SCO's customers would benefit from the acquisition.\nThe Visionware brand continued until 1995 when the company, now a business unit of SCO, was merged with IXI to form IXI Visionware, Ltd. Later that year the merged business unit was subsumed more fully into its parent and became the Client Integration Division of SCO, which put out both sets of products under the \"Vision\" branded family name. This division then developed and released the Tarantella terminal services application in 1997 and that became the core of Tarantella, Inc. in 2001.  As a consequence, the Vision family received less investment going forward.\nFates\nPC-Connect had evolved into the TermVision product under SCO, with 32-bit and Windows 95 support, but that product then faded away with the Vision product line.  SQL-Retriever was dropped from the Vision line by Tarantella and had no more releases.  However, the source code for SCO's XVision product was purchased by MKS Inc., an American company based in Fairfax, Virginia, and with further enhancements and a new name, became the basis for that company's ongoing MKS X/Server product.\nTarantella, Inc. struggled and following company-wide layoffs, the Cambridge development site closed in the summer of 2003.  However the Leeds office stayed open, and became part of Sun Microsystems following its purchase of Tarantella and later became part of the Oracle Secure Global Desktop product team, moving to a facility in Lawnswood within Leeds.\nReferences"
    }
  ]
}