{
  "content": [
    {
      "type": "text",
      "text": "# Vivo Software\n\n}}\nVivo Software was a pioneer internet streaming media company which was acquired by RealNetworks in March 1998. Vivo Software designed the Vivo Video/Audio platform, including its encoding tools and end-user VivoActive Player.\nThe Vivo format, obsolete today, was one of the first to be designed and used for internet streaming. The Vivo platform was a well-known player when streaming media was in its infancy and was deployed mainly on erotic sites during the mid-1990s. Since then RealPlayer, QuickTime and Windows Media have evolved as the dominant platforms. The development of Vivo ceased in 1997 to be replaced by RealPlayer from RealNetworks.\nVivoActive\nVivoActive is an audio/video format created by Vivo Software, acquired by RealNetworks in 1997. The Vivo format is based upon H.263 video and G.723 ADPCM audio (not the G.723.1 speech codec). It uses inter-frame coding, but does not insert any key frames, except at the beginning of the clip, which effectively disables the possibility of seeking to specific locations in the stream. One of the last released versions of VivoActive Player added a workaround for this handicap by quickly decoding all frames from the first one to the requested position.\nMPlayer is able to play and convert Vivo video clips.\nPlayback\nThe official client (The VivoActive Player) was limited. Current available clients are:\n*Mplayer – http://www.mplayerhq.hu\n*RealPlayer – http://www.real.com\n*VivoActive Browser Plug-in – [https://web.archive.org/web/19990423194011/http://egg.real.com/vivo-player/vivodl.html]\nSee also\n*RealMedia\n*RealNetworks\nReferences\nExternal links\n* [https://www.iana.org/assignments/media-types/video/vnd.vivo Internet Assigned Numbers Authority for vivo]\n* [http://egg.real.com/vivo-player/vivodl.html VivoActive Browser Plug-In Download]\n* [http://investor.realnetworks.com/faq.cfm?faqid=2 RealNetworks Acquisition History]\n* [https://wiki.multimedia.cx/index.php/Vivo Multimedia Vivo]"
    }
  ]
}