{
  "content": [
    {
      "type": "text",
      "text": "# Vought F-8 Crusader\n\nThe Vought F-8 Crusader (originally F8U) was a single-engine, supersonic, carrier-based air superiority jet aircraft designed and produced by the American aircraft manufacturer Vought. It was the last American fighter that had guns as the primary weapon, earning it the title \"The Last of the Gunfighters\".\nDevelopment of the F-8 commenced after release of the requirement for a new fighter by the United States Navy in September 1952. Vought's design team, led by John Russell Clark, produced the V-383, a relatively unorthodox fighter that possessed an innovative high-mounted variable-incidence wing, an area-ruled fuselage, all-moving stabilators, dog-tooth notching at the wing folds for improved yaw stability, and liberal use of titanium throughout the airframe. During June 1953, Vought received an initial order to produce three XF8U-1 prototypes of its design. On 25 March 1955, the first prototype performed its maiden flight. Flight testing proved the aircraft to be relatively problem-free. On 21 August 1956, U.S. Navy pilot R.W. Windsor attained a top speed of 1,015&nbsp;mph; in doing so, the F-8 became the first jet fighter in American service to reach 1,000&nbsp;mph.\nDuring March 1957, the F-8 was introduced into regular operations with the US Navy. In addition to the Navy, the type was also operated by the United States Marine Corps (replacing the Vought F7U Cutlass), the French Navy, and the Philippine Air Force. Early on, the type experienced an above-average mishap rate, being somewhat difficult to pilot. American F-8s saw active combat during the Vietnam War, engaging in multiple dogfights with MiG-17s of the Vietnam People's Air Force as well as performing ground attack missions in the theatre. The RF-8 Crusader was a photo-reconnaissance model. It played a crucial role in the Cuban Missile Crisis, providing essential low-level photographs of Soviet medium range ballistic missiles (MRBMs) in Cuba that were impossible to acquire by other means at that time. Several modified F-8s were used by NASA for experimental flights, including the testing of digital fly-by-wire technology and supercritical wing design. The RF-8 operated in U.S. service longer than any of the fighter versions; the United States Navy Reserve withdrew its remaining aircraft during 1987.\nDevelopment\nBackground\nDuring September 1952, the United States Navy released a requirement calling for a new fighter. Specifics of this requirement included a maximum speed of Mach 1.2 at  with a climb rate of , and a landing speed of no more than . Experience gained during the Korean War had demonstrated that .50&nbsp;caliber (12.7&nbsp;mm) machine guns were no longer sufficient armament and, as a result, the new fighter was to be armed with 20&nbsp;mm (0.79&nbsp;in) cannon. The 20x110mm round had become common in the U.S. Navy prior to the Korean conflict, used on the McDonnell F2H Banshee, F9F, F3D Skyknight, F7U Cutlass, and the F4D, among others.\nIn response to the requirement, the American aircraft manufacturer Vought opted to produce a new design, internally designated as the V-383. Vought's design team was led by John Russell Clark. It was relatively unorthodox for a fighter, possessing a high-mounted wing which necessitated the use of a short and lightweight landing gear in the fuselage. A major contributing factor that facilitated the use of such compact main gear, however, was the variable-incidence wing (not to be confused with a variable-sweep wing, another form of variable geometry wing designed for similar purposes) which reduced the amount of pitch up required while in landing configuration at low speeds, an extremely nose high attitude being a common characteristic of the highly swept and low aspect ratio wings used on many fighters of the era. This innovative wing pivoted upwards by 7° in takeoff and landing configuration, and by doing so, increased the angle of attack of the wing without requiring the entire aircraft to pitch up, which allowed for greater forward visibility and a suitably slow landing speed. The variable-incidence wing helped the F-8's development team win the Collier Trophy in 1956.\nConsiderable competition for the requirement also emerged. This included the Grumman F-11 Tiger, the upgraded twin-engine McDonnell F3H Demon (the F3H-H, which would eventually become the McDonnell Douglas F-4 Phantom II), and the North American F-100 Super Sabre hastily adapted to carrier use and dubbed the \"Super Fury\". In addition to the fighter-orientated V-383 proposal, Vought also presented a tactical reconnaissance version of the aircraft, internally designated as the V-392.\nInto flight\nDuring May 1953, Vought's submission was declared to be the winner; one month later, the company received an initial order for three XF8U-1 prototypes (after adoption of the unified designation system in September 1962, the F8U became the F-8). On 25 March 1955, the first prototype performed its maiden flight with John Konrad at the controls; confidence was such that it was decided to exceed the speed of sound during its maiden flight. The development was relatively trouble-free, to the extent that the second prototype and the first production F8U-1 made their first flights together on the same day, 30 September 1955. On 4 April 1956, the F8U-1 performed its first catapult launch from .\nBeginning in late 1956, prototype XF8U-1s were evaluated by VX-3, during which few problems were noted. Weapons development was conducted at Naval Air Weapons Station China Lake and a China Lake F8U-1 set a U.S. National speed record in August 1956. Commander \"Duke\" Windsor set a new Level Flight Speed Record of  on 21 August 1956 beating the previous record of  set by a USAF F-100. (It did not break the world speed record of , set by the British Fairey Delta 2, on 10 March 1956.)\nAn early F8U-1 was modified as a photo-reconnaissance aircraft, becoming the first F8U-1P. Subsequently, the RF-8A was equipped with cameras rather than guns and missiles. On 16 July 1957, Major John H. Glenn Jr, USMC, completed the first supersonic transcontinental flight in a F8U-1P, flying from NAS Los Alamitos, California, to Floyd Bennett Field, New York, in three hours, 23 minutes, and 8.3 seconds.\nIn parallel with the F8U-1s and -2s, the Crusader design team was also working on a larger aircraft with even greater performance, internally designated as the V-401 and later officially designated as the Vought XF8U-3 Crusader III. It was externally similar to the Crusader and shared several design elements, as the variable incidence wing, but differed by being considerably larger while also sharing relatively few components and being capable of greater speeds amongst other abilities.\nDesign\nThe Vought F-8 Crusader was a single-engine, supersonic, carrier-based air superiority fighter. It was typically described as an all-weather fighter, yet initial production aircraft were only fitted with a ranging radar for its guns and thus was entirely reliant on external platforms to be guided towards enemies. From the F-8B onwards, air-intercept radar was fitted to the aircraft; increasingly capable and reliable radar sets were present on later models. Pilot training of the era did not focus much upon use of the radar, thus making it less effective operationally than it otherwise could have been. The addition of more advanced avionics on later models, particularly the F-8J, was often criticized as being responsible for considerable weight increases as well as having questionable effectiveness. Pilots often claimed the later F-8 models did not turn as well as early aircraft and had greater difficulty in aborting a landing attempt; furthermore, that the radar did not work well in tropical environments.\nA key feature of the F-8 was its variable-incidence wing, which allowed for a greater angle of attack to be achieved and increased lift without compromising forward visibility by pivoting 7° out of the fuselage during takeoff and landing runs. Simultaneously, the aircraft's lift was augmented by leading-edge flaps drooping by 25° and inboard flaps extending to 30°. The F-8 also took advantage of contemporary aerodynamic innovations such as an area-ruled fuselage, all-moving stabilators, dog-tooth notching at the wing folds for improved yaw stability, and liberal use of titanium throughout the airframe. The aircraft was powered by a single Pratt & Whitney J57 turbojet engine, which was equipped with an afterburner. On the initial F8U-1 production aircraft, this afterburner increased the engine's thrust from 10,200&nbsp;lb to 16,000&nbsp;lb, but, unlike later engines, lacked any intermediate thrust settings.\nThe armament of the F-8, which had been specified by the US Navy, consisted primarily of four 20&nbsp;mm (.79&nbsp;in) autocannons; the aircraft would become the final U.S. fighter to be designed with guns as its primary weapon. They were supplemented with a retractable tray with 32 unguided Mk 4/Mk 40 Folding-Fin Aerial Rocket (Mighty Mouse FFARs), and cheek pylons for four guided AIM-9 Sidewinder air-to-air missiles. In practice, Sidewinder missiles were the F-8's primary weapon; the 20mm guns were considered to be \"generally unreliable\"; moreover, the F-8 achieved nearly all of its kills using Sidewinders. It has been suggested that, had the US Navy mandated more rigorous and realistic weapons testing, the reliability of the guns could have been improved considerably.\nOperational history\nUS Navy and US Marine Corps\nIntroduction\nVX-3 was one of the first units to receive the F8U-1 in December 1956, and was the first to operate the type in April 1957, from . VX-3 was the first unit to qualify for carrier operations but several aircraft were lost in accidents, several of them fatal to their pilots.\nThe first fleet squadron to fly the Crusader was VF-32 at NAS Cecil Field, Florida, in 1957, which deployed to the Mediterranean late that year on . VF-32 renamed the squadron the \"Swordsmen\" in keeping with the Crusader theme. The Pacific Fleet received the first Crusaders at NAS Moffett Field in northern California and the VF-154 \"Grandslammers\" (named in honor of the new 1,000-mph jets and subsequently renamed the \"Black Knights\") began their F-8 operations. Later in 1957, in San Diego VMF-122 accepted the first Marine Corps Crusaders. The first combat action of F-8s was during the 1958 Lebanon crisis. F-8s of VF-32 were assigned to the USS Saratoga in support of the landing of US Marines in Lebanon.\nIn 1962, the Defense Department standardized military aircraft designations generally along Air Force lines. Consequently, the F8U became the F-8, with the original F8U-1 redesignated F-8A.\n, 1974.]]\nThe Crusader became a \"day fighter\" operating off the aircraft carriers. At the time, U.S. Navy carrier air wings had gone through a series of day and night fighter aircraft due to rapid advances in engines and avionics. Some squadrons operated aircraft for very short periods before being equipped with a newer higher performance aircraft. The Crusader was the first post-Korean War aircraft to have a relatively long tenure with the fleet.\nCuban Missile Crisis\nThe unarmed RF-8A proved good at getting low-altitude detailed photographs, leading to carrier deployments as detachments from the Navy's VFP-62 and VFP-63 squadrons and the Marines' VMCJ-2. Beginning on 23 October 1962 during the Cuban Missile Crisis, RF-8As flew extremely hazardous low-level photo reconnaissance missions over Cuba, the F-8's first true operational flights. Two-ship flights of RF-8As left Key West twice each day, to fly over Cuba at low level, then return to Jacksonville, where the film was offloaded and developed, to be rushed north to the Pentagon.\nThese flights confirmed that the Soviet Union was setting up medium range ballistic missiles (MRBMs) in Cuba. The RF-8As also monitored the withdrawal of the Soviet missiles. After each overflight, the aircraft was given a stencil of a dead chicken. The overflights went on for about six weeks and returned a total of 160,000 images. The pilots who flew the missions received Distinguished Flying Crosses, while VFP-62 and VMCJ-2 received the prestigious U.S. Navy Unit Commendation.\nMishap rate\nRF-8A in 1963.]]\nThe Crusader was not an easy aircraft to fly, and was often unforgiving in carrier landings, where it suffered poor recovery from high sink rates, and the poorly designed, castering nose undercarriage made it hard to steer on the deck. Safe landings required the carriers to steam at full speed to offset the relatively high landing speed of the Crusader. The stacks of the oil-burning carriers on which the Crusader served belched thick black smoke, sometimes obscuring the flight deck, forcing the Crusader's pilot to rely on the landing signal officer's radioed instructions. Early on, pilots were encouraged to only keep a minimum level of fuel remaining onboard prior to landing; in the long term, the adoption of the more powerful J57-P420 engine improved the situation. It earned a reputation as an \"ensign eliminator\" during its early service introduction. The nozzle and air intake were so low when the aircraft was on the ground or the flight deck that the crews called the aircraft \"the Gator\". Not surprisingly, the Crusader mishap rate was relatively high compared to its contemporaries, the Douglas A-4 Skyhawk and the McDonnell Douglas F-4 Phantom II. However, the aircraft did possess a desirable capability, as proved when several Crusader pilots took off with the wings folded and were able to land the aircraft. One of these episodes took place on 23 August 1960; a Crusader with the wings folded took off from Napoli Capodichino in full afterburner, climbed to  and then returned to land successfully. The pilot reported that the control forces were higher than normal. The Crusader was capable of flying in this configuration, though the pilot would be required to reduce aircraft weight by jettisoning stores and dumping fuel before landing. 1,261 Crusaders were built. By the time it was withdrawn from the fleet, 1,106 had been involved in mishaps.\nVietnam War\nat Da Nang, in April 1966 showing the Infrared search and track (IRST) sensor in front of the canopy.]]\nF-8J returning to  in the Gulf of Tonkin.]]\nWhen conflict erupted in the skies over North Vietnam, it was US Navy Crusaders from  that first engaged with Vietnam People's Air Force (the North Vietnamese Air Force) MiG-17s, on 3 April 1965. The MiGs claimed the downing of an F-8 and Lt Pham Ngoc Lan's gun camera revealed that his cannons had set an F-8 ablaze, but Lieutenant Commander Spence Thomas had managed to land his damaged F-8 at Da Nang Air Base, the remaining F-8s returning safely to their carrier. The F-8 repeatedly encountered the relatively nimble North Vietnamese MiGs over the following years, yet the F-8 never made first contact via radar detection in any of these engagements. Instead, F-8 pilots were reliant on ground control intercept controllers to find enemies and be guided towards a favorable firing position. A typical day mission would be performed using a pair of F-8s, one pilot concentrated on radar and navigation functions while the other searched the skies with their eyes; ground controllers would alert and direct them towards any MiGs spotted, which they'd approach at speed from behind, not relying on their own radar to detect the hostile aircraft. The presence of US surface to air missiles (SAMs) usually compelled MiGs to fly at lower altitudes, where the F-8 was more maneuverable and thus would have an advantage.\nThe US Navy had evolved its \"night fighter\" role in the air wing to an all-weather interceptor, the F-4 Phantom II, equipped to engage incoming bombers at long range with missiles such as AIM-7 Sparrow as their sole air-to-air weapons, and maneuverability was not emphasized in their design. Some experts believed that the era of the dogfight was over as air-to-air missiles would knock down adversaries well before they could get close enough to engage in dogfighting. As aerial combat ensued over North Vietnam from 1965 to 1968, it became apparent that the dogfight was not over. In one pitched air-battle between USN F-8s and VPAF MiG-21s on 1 August 1968, ace fighter pilot Nguyen Hong Nhi fired a pair of R-3S AAMs at a pair of F-8s, the second R-3S making a successful hit, claiming one F-8 shot-down. Following a brief dogfight with the other F-8, another pair of F-8s entered into the fray and fired two Sidewinder AAMs at Nguyen Hong Nhi, who was hit and safely ejected from his stricken MiG-21; the downing of ace fighter pilot Nguyen is credited to F-8H pilot Lt. McCoy of VF-51, USS Bon Homme Richard.\nAs the conflict progressed, North Vietnam received MiG-21s, which proved to be a more capable opponent for the F-8, yet it still proved to be effective with good teamwork and exploiting the MiG-21's weaknesses. Following the end of Operation Rolling Thunder in November 1968, American aircraft stopped flying in airspace in which MiGs encounters were expected and thus there were less opportunities for aerial engagements to occur. Accordingly, the Crusader became increasing used as a \"bomb truck\", with both ship-based U.S. Navy units and land-based US Marine Corps squadrons attacking communist forces in both North and South Vietnam. US Marine Crusaders flew only in the south, where they largely performed close air support and interdiction missions. During December 1972's Operation Linebacker II, numerous Navy F-8s were assigned to fly aerial superiority missions, yet these were largely unopposed; actual combat with MiGs had become exceeding rare by this point of the conflict.\nNavy Crusaders flew only from the small Essex-class carriers.\nDespite the \"last gunfighter\" moniker, the F-8s achieved only four victories with their cannon; the remainder were accomplished with Sidewinder missiles, partly due to the propensity of the 20&nbsp;mm (.79&nbsp;in) Colt Mk 12 cannons' feeding mechanism to jam under G-loading during high-speed dogfighting maneuvers. Between June and July 1966, during 12 engagements over North Vietnam, Crusaders claimed four MiG-17s for two losses. Crusader pilots would claim the best kill ratio of any American type in the Vietnam War, 19:3.  Of the 19 aircraft claimed during aerial combat, 16 were MiG-17s and three were MiG-21s. While VPAF pilots claimed 11 F-8s shot down by MiGs, official US sources indicate that only three F-8s were lost in air combat, all of them during 1966, to cannon fire from opponents in MiG-17s. A total of 170 F-8s would be lost to all causes – mostly ground fire and accidents – during the war.\nWithdrawal from frontline operations\nLTV built and delivered the 1,219th (and last) US Navy Crusader to VF-124 at NAS Miramar on 3 September 1964. The last active duty US Navy Crusader fighter variants were retired from VF-191 and VF-194 aboard  in 1976 after almost two decades of service, setting a first for a Navy fighter.\nThe photo reconnaissance variant continued to serve in the active duty Navy for yet another 11 years, with VFP-63 flying RF-8Gs up to 1982, and with the Naval Reserve flying their RF-8Gs in two squadrons (VFP-206 and VFP-306) at Naval Air Facility Washington / Andrews AFB until the disestablishment of VFP-306 in 1984 and VFP-206 on 29 March 1987 when the last operational Crusader was turned over to the National Air and Space Museum.\nThe Crusader is the only aircraft to have used the AIM-9C, a radar-guided variant of the Sidewinder air-to-air missile. During 1969, the US Navy opted to shelve the AIM-9C due to its restrictive launch envelope, as well as its high maintenance demands and associated logistical difficulties. When the Crusader retired, these missiles were converted to the AGM-122 Sidearm anti-radiation missiles used by United States attack helicopters against enemy radars.\nNASA\nF-8A supercritical wing testbed]]\nSeveral modified F-8s were used by NASA in the early 1970s, proving the viability of both digital fly-by-wire technology (using data-processing equipment adapted from the Apollo Guidance Computer), as well as supercritical wing design.\nFrench Navy\nDuring the early 1960s, the French Navy's air arm, the Aéronavale, required a carrier-based fighter to serve aboard the new carriers  and , the F-4 Phantom, then entering service with the United States Navy, proved to be too large for the small French ships. Following carrier trials aboard Clemenceau on 16 March 1962, by two VF-32 F-8s from the American carrier USS Saratoga, the Crusader was chosen and 42 F-8s were ordered; these would be the last Crusaders produced.\nThe French Crusaders were based on the F-8E, but were modified in order to allow operations from the compact French carriers; accordingly, the maximum angle of incidence of the aircraft's wing increased from five to seven degrees and blown flaps fitted. The weapon system was modified to carry two French Matra R.530 radar or infra-red missiles as an alternative to Sidewinders, although the ability to carry the American missile was retained. Deliveries of these aircraft, dubbed the F-8E(FN), started in October 1964 and continued until February 1965, with the Aéronavales first squadron, Flotille 12F reactivated on 1 October 1964. To replace the old Corsairs, Flotille 14.F received its Crusaders on 1 March 1965.\nDuring October 1974, (on Clemenceau) and June 1977 (on Foch), Crusaders from 14.F squadron participated in the Saphir missions over Djibouti. On 7 May 1977, two Crusaders went separately on patrol against supposedly French Air Force (4/11 Jura squadron) F-100 Super Sabres stationed at Djibouti. The leader intercepted two fighters and engaged a dogfight (supposed to be a training exercise) but quickly called his wingman for help as he had actually engaged two Yemeni MiG-21s. The two French fighters switched their master armament to \"on\" but, ultimately, everyone returned to their bases. This was the only combat interception to be performed by French Crusaders.\nThe Aéronavale Crusaders flew combat missions over Lebanon in 1983 escorting Dassault-Breguet Super Étendard strike aircraft. In October 1984, France sent Foch with 12.F squadron to conduct Operation Mirmillon off the coast of Libya, intended to deter Libyan ruler Colonel Gaddafi from escalating. Regional tensions around the Persian Gulf, largely related to the Iran-Iraq conflict, triggered the deployment of a task force headed by Clemenceau, which included 12.F squadron in its air way. During 1993, combat missions commenced over the skies of the former Yugoslavia; Crusaders were launched from both French carriers, which were stationed in the Adriatic Sea. These missions ceased in June 1999 with Operation Trident over Kosovo.\nThe French Crusaders were subject to a series of modifications throughout their life, being fitted with new F-8J-type wings in 1969 and having modified afterburners fitted in 1979. Armament was enhanced by the addition of R550 Magic infra-red guided missiles in 1973, with the improved, all-aspect Magic 2 fitted from 1988. The obsolete R.530 was withdrawn from use in 1989, leaving the Crusaders without a radar-guided missile. In 1989, when it was realized that the Crusader would not be replaced for several years due to delays in the development of the Rafale, it was decided to refurbish the Crusaders to extend their operating life. Each aircraft was rewired and had its hydraulic system refurbished, while the airframe was strengthened to extend fatigue life. Avionics were improved, with a modified navigation suite and a new radar-warning receiver. The 17 refurbished aircraft were redesignated as F-8P (P used for \"Prolongé\" -extended- and not to be confused with the Philippine F-8P). Although the French Navy participated in combat operations in 1991 during Operation Desert Storm and over Kosovo in 1999, the Crusaders stayed behind and were eventually replaced by the Dassault Rafale M in 2000 as the last of the type in military service.\nPhilippine Air Force\n. c. 1978]]\nDuring late 1977, the Philippine government purchased 35 secondhand U.S. Navy F-8Hs that had been stored at Davis-Monthan AFB in Arizona. 25 of them were refurbished by Vought while the remaining ten were used for spare parts. As part of the deal, the U.S. would train Philippine pilots using the TF-8A. The Crusaders were crewed by the 7th Tactical Fighter Squadron at Basa Air Base and were mostly used for intercepting Soviet bombers and escorting presidential flights. However, due to a lack of spares and the rapid deterioration of the aircraft, the remaining F-8s were grounded in 1988 and left on an open grass field at Basa Air Base. They were finally withdrawn from service three years later after they were badly damaged by the Mount Pinatubo eruption, and have since been offered for sale as scrap. Some of the inoperational airframes were refurbished for use as props in the 2000 movie Thirteen Days, a dramatization of the Cuban Missile Crisis, to depict the real-life RF-8As involved in the low-level photo reconnaissance missions that obtained photos of Soviet ballistic missiles in Cuba.\nVariants\nF8U-1 in 1958.]]\n's F-8C digital fly-by-wire testbed]]\nlanding aboard , in 1971.]]\nin 1971.]]\n* XF8U-1 (XF-8A) (V-383) – the two original unarmed prototypes.\n* F8U-1 (F-8A) – first production version, J57-P-12 engine replaced with more powerful J57-P-4A starting with 31st production aircraft, 318 built.\n* YF8U-1 (YF-8A) – one F8U-1 fighter used for development testing.\n* YF8U-1E (YF-8B) – one F8U-1 converted to serve as an F8U-1E prototype.\n* F8U-1E (F-8B) – added a limited all-weather capability thanks to the AN/APS-67 radar, the unguided rocket tray was sealed shut because it was never used operationally, first flight: 3 September 1958, 130 built.\n* XF8U-1T – one XF8U-2NE used for evaluation as a two-seat trainer.\n* F8U-1T (TF-8A) (V-408) – two-seat trainer version based on F8U-2NE, fuselage stretched 2&nbsp;ft (0.61&nbsp;m), internal armament reduced to two cannon, J57-P-20 engine, first flight 6 February 1962. The Royal Navy was initially interested in the Rolls-Royce Spey-powered version of TF-8A but chose the Phantom II instead. Only one TF-8A was built, although several retired F-8As were converted to similar two-seat trainers.\n* YF8U-2 (YF-8C) – two F8U-1s used for flight testing the J57-P-16 turbojet engine.\n* F8U-2 (F-8C) – J57-P-16 engine with 16,900&nbsp;lbf (75&nbsp;kN) of afterburning thrust, ventral fins added under the rear fuselage in an attempt to rectify yaw instability, Y-shaped cheek pylons allowing two Sidewinder missiles on each side of the fuselage, AN/APQ-83 radar retrofitted during later upgrades. First flight: 20 August 1957, 187 built.\n* F8U-2N (F-8D) – all-weather version, unguided rocket pack replaced with an additional fuel tank, J57-P-20 engine with 18,000&nbsp;lbf (80&nbsp;kN) of afterburning thrust, landing system which automatically maintained present airspeed during approach, incorporation of AN/APQ-83 radar. First flight: 16 February 1960, 152 built.\n* YF8U-2N (YF-8D) – one aircraft used in the development of the F8U-2N.\n* YF8U-2NE – one F8U-1 converted to serve as an F8U-2NE prototype.\n* F8U-2NE (F-8E) – J57-P-20A engine, AN/APQ-94 radar in a larger nose cone, dorsal hump between the wings containing electronics for the AGM-12 Bullpup missile, payload increased to 5,000&nbsp;lb (2,270&nbsp;kg), Martin-Baker ejection seat, AN/APQ-94 radar replaced AN/APQ-83 radar in earlier F-8D. IRST sensor blister (round ball) was added in front of the canopy. First flight: 30 June 1961, 286 built.\n* F-8E(FN) – air superiority fighter version for the French Navy, significantly increased wing lift due to greater slat and flap deflection and the addition of a boundary layer control system, enlarged stabilators, incorporated AN/APQ-104 radar, an upgraded version of AN/APQ-94. A total of 42 built.\n* F-8H – upgraded F-8D with strengthened airframe and landing gear, with AN/APQ-84 radar. A total of 89 rebuilt.\n* F-8J – upgraded F-8E, similar to F-8D but with wing modifications and BLC like on F-8E(FN), \"wet\" pylons for external fuel tanks, J57-P-20A engine, with AN/APQ-124 radar. A total of 136 rebuilt.\n* F-8K – upgraded F-8C with Bullpup capability and J57-P-20A engines, with AN/APQ-125 radar. A total of 87 rebuilt.\n* F-8L – F-8B upgraded with underwing hardpoints, with AN/APQ-149 radar. A total of 61 rebuilt.\n* F-8P – 17 F-8E(FN) of the Aéronavale underwent a significant overhaul at the end of the 1980s to stretch their service life another 10 years. They were retired in 1999.\n* F8U-1D (DF-8A) – several retired F-8A modified to controller aircraft for testing of the SSM-N-8 Regulus cruise missile. DF-8A was also modified as drone (F-9 Cougar) control which were used extensively by VC-8, NS Roosevelt Rds, PR; Atlantic Fleet Missile Range.\n* DF-8F – retired F-8A modified as controller aircraft for testing of missiles including at the USN facility at China Lake.\n* F8U-1KU (QF-8A) – retired F-8A modified into remote-controlled target drones\n* YF8U-1P (YRF-8A) – prototypes used in the development of the F8U-1P photo-reconnaissance aircraft – V-392.\n* F8U-1P (RF-8A) – unarmed photo-reconnaissance version of F8U-1E, 144 built.\n* RF-8G – modernized RF-8As.\n* LTV V-1000 – A vastly reworked version of the F-8 designed for the USAF International Fighter Aircraft Program in 1969 in response to the widespread Soviet MiG-21. The aircraft competed with the F-4E Phantom II, Lockheed CL-1200 and F-5A-21 in a tender for U.S. Military Assistance Program (MAP) funding. A summary of changes are installation of the GE J79-GE-17, 3800&nbsp;lbs (1723&nbsp;kg) in weight reduction, and overall simplification of the aircraft. The V-1000 was selected as the competition winner however was not given the contract.\n* XF8U-3 Crusader III (V-401) – new design loosely based on the earlier F-8 variants, created to compete against the F-4 Phantom II; J75-P-5A engine with 29,500&nbsp;lbf (131&nbsp;kN) of afterburning thrust, first flight: 2 June 1958, attained Mach 2.39 in test flights, canceled after five aircraft were constructed because the Phantom II won the Navy contract.\nOperators\nF-8Es on , 1964.]]\nF-8H in flight over California, 1970]]\nFormer operators\n;:\n* French Navy (Aéronavale)\n**Flottille 12F\n**Flottille 14F\n;:\n* Philippine Air Force\n**7th Tactical Fighter Squadron\n;:\n* United States Navy\n** Fighter Squadrons\n*** VF(AW)-3 Blue Nemesis (disestablished 2 May 1958)\n*** VF-11 Red Rippers (transitioned to F-4B, 1966)\n*** VF-13 Night Cappers (disestablished 1 October 1969)\n*** VF-24 Checkertails/Fighting Renegades (transitioned to F-14A, 9 December 1975)\n*** VF-32 Swordsmen (transitioned to F-4B, 1965)\n*** VF-33 Tarsiers (transitioned to F-4B, 1964)\n*** VF-51 Screaming Eagles (transitioned to F-4B, 1971)\n*** VF-53 Iron Angels (disestablished 29 January 1971)\n*** VF-62 Boomerangs (disestablished 1 October 1969)\n*** VF-84 Vagabonds/Jolly Rogers (transitioned to F-4B, 1964)\n*** VF-103 Sluggers (transitioned to F-4B, 1964–1965)\n*** VF-111 Sundowners (transitioned to F-4B, 1971)\n*** VF-132 Peg Leg Petes (disestablished 1 October 1962)\n*** VF-142 Fighting Falcons (redesignated VF-96 with F-4B, 1 June 1962)\n*** VF-154 Grand Slammers/Black Knights (transitioned to F-4, 1965)\n*** VF-162 Hunters (disestablished 29 January 1971)\n*** VF-191 Satan's Kittens (transitioned to F-4J, 1976)\n*** VF-194 Red Lightnings (transitioned to F-4J, 1976)\n*** VF-211 Fighting Checkmates (transitioned to F-14A, 1975)\n*** VF-661 Firefighters (disestablished 11 October 1968)\n*** VF-672 (disestablished June 1970)\n*** VF-931 (disestablished 1 November 1970)\n*** VF-932 (disestablished 1 November 1970)\n** Reserve Squadrons\n*** VF-201 Hunters (transitioned to F-4N, 1976)\n*** VF-202 Superheats (transitioned to F-4N, 1976)\n*** VF-301 Devil's Disciples (transitioned to F-4B, 1974)\n*** VF-302 Stallions (transitioned to F-4B, 1974)\n** Fleet Replacement Squadrons\n*** VF-124 Gunfighters; Pacific Fleet (transitioned to F-14A, 8 October 1972)\n*** VF-174 Hellrazors; Atlantic Fleet (redesignated VA-174 with A-7, 1 July 1966)\n** Composite Squadrons\n*** VC-1 Unique Antiquers/Blue Alii (transitioned to TA-4, 1969)\n*** VC-2 Blue Falcons (transitioned to A-4, 1970)\n*** VC-4 Dragon Flyers (disestablished 30 April 1971)\n*** VC-5 Checkertails\n*** VC-7 Tallyhoers (disestablished 30 September 1980)\n*** VC-8 Redtails\n*** VC-10 Challengers (transitioned to TA-4J, 1976)\n*** VC-13 Fightin' Saints (transitioned to A-4 Skyhawk, April 1974)\n** Light Photographic Squadron\n*** VFP-62 Fightin' Photo (disestablished 1 January 1968)\n*** VFP-63 Eyes of the Fleet (disestablished 30 June 1982)\n*** VFP-206 Hawkeyes (disestablished 29 March 1987)\n*** VFP-306 Peeping Toms/Photomasters (disestablished 30 September 1984)\n** Anti-Submarine Fighter Squadrons\n*** VSF-76 Fighting Saints (disestablished 1 September 1973)\n*** VSF-86 Gators (disestablished 1 September 1973)\n** Training Squadrons\n*** VT-86 Sabre Hawks\n** Air Development Squadron, Air Test and Evaluation Squadrons\n*** VX-3 (disestablished 1 March 1960)\n*** VX-4 The Evaluators\n* United States Marine Corps\n* NASA\n* Thunderbird Aviation\nAircraft on display\nFrance\n;F-8E(FN)\n* 151732 (French Navy Side Number 1) – Musee des Avions de Chasse, Beaune.\n* 151750 (French Navy Side Number 19) – Musée des Ailes Anciennes, Toulouse.\n;F-8P\n]]\n* 151733 (French Navy Side Number 3) – Lann Bihoue Airport, Le Meneguen.\n* 151735 (French Navy Side Number 4) – Musee Europeen de lAviation de Chasse, Montelimar-Ancone.\n* 151738 (French Navy Side Number 7) – Aeronavale Base, Landivisau.\n* 151741 (French Navy Side Number 10) – Musee de l air et de l Espace, (The Air and Space Museum), Paris, France.\n* 151742 (French Navy Side Number 11) – Musee de l aeronautique navale, Rochefort.\n* 151754 (French Navy Side Number 23) – Aeronavale Base, Landivisau.\n* 151760 (French Navy Side Number 29) – Aeronavale Base, Landivisau.\n* 151767 (French Navy Side Number 36) – Musee des Avions de Chasse, Beaune.\n* 151768 (French Navy Side Number 37) – Airport in Cuers.\n* 151770 (French Navy Side Number 39) – Aeronavale Base, Landivisau.\nPhilippines\n;F-8B\n* 145544/UE-12 - Ex United States Navy on display at a public park in Dinalupihan Philippines.\n;F-8H\n]]\n]]\n* 147056 – Philippine Air Force Aerospace Museum, Villamor Air Base, Manila.\n* 147060 - Basa Air Base, Floridablanca, Pampanga.\n* 148661 – Clark Air Base, Angeles City.\n* 148686 - \tPhilippine Military Academy, Fort Gen. Gregorio H. del Pilar, Baguio City. Registration serial incorrectly marked as 148696.\nUnited States\n]]\n;XF8U-1 (XF-8A)\n* 138899 – Museum of Flight in Seattle, Washington.\n;XF8U-2 (XF-8C)\n* 140448 – McAuliffe-Shepard Discovery Center in Concord, New Hampshire.\n;F8U-1 (F-8A)\n* 141351 – NAS Jacksonville Heritage Park, Naval Air Station Jacksonville, Florida (relocated from former NAS Cecil Field).\n* 141353 – Edwards AFB, California.\n* 143703 – USS Hornet Museum, former Naval Air Station Alameda, Alameda, California.\n* 143755 – Marine Corps Air Station Miramar, California.\n* 143806 – Wings of Freedom Aviation Museum, former Naval Air Station Willow Grove, Willow Grove, Pennsylvania.\n* 144427 – Pima Air and Space Museum adjacent to Davis-Monthan AFB in Tucson, Arizona.\n* 145336 – Planes of Fame at Chino, California.\n* 145347 – National Naval Aviation Museum at Naval Air Station Pensacola, Florida.\n* 145349 – Pueblo Weisbrod Aircraft Museum, Pueblo, Colorado.\n* 145397 – Naval Air Engineering Station Lakehurst, Lakehurst, New Jersey.\n;F8U-2 (F-8C)\n*\n* 146973 – Marine Corps Air Station Kaneohe Bay, Hawaii.\n* 147034 – (nose section only) USS Hornet Museum, former NAS Alameda, Alameda, California.\n;F8U-2N (F-8D)\n* 148693 – Mid-America Air Museum in Liberal, Kansas.\nF8U-2NE (F-8E)\n* 149150 – NAS Oceana Aviation Heritage Park, Naval Air Station Oceana, Virginia.\nF-8E(FN)\n* 151765 – under restoration to airworthiness by a private owner in Fort Myers, Florida\n;F8U-1P (RF-8G)\n* 144617 – Flying Leatherneck Aviation Museum at Marine Corps Air Station Miramar, California\n* 144618 – Celebrity Row, Davis-Monthan AFB (North Side), Tucson, Arizona.\n* 145607 – Castle Air Museum (former Castle AFB), Atwater, California.\n* 145608 – (nose section only) Pacific Coast Air Museum, Santa Rosa, California.\n* 145609 – National Museum of Naval Aviation, Naval Air Station Pensacola, Pensacola, Florida.\n* 145645 – USS Alabama Battleship Memorial Park, Mobile, Alabama.\n* 146860 – Smithsonian Institution's National Air and Space Museum Udvar-Hazy Center in Chantilly, Virginia, adjacent to Dulles International Airport.\n* 146858 – in storage at Flying Leatherneck Aviation Museum at Marine Corps Air Station Miramar, California\n* 146882 – Frontiers of Flight Museum in Dallas, Texas.\n* 146898 – Fort Worth Aviation Museum in Fort Worth, Texas.\n;F-8H\n*\n;F-8J\n]]\n* 150904 – Air Zoo in Kalamazoo, Michigan. It is currently on display indoors, with its wings folded.\n* 150920 – Flying Leatherneck Aviation Museum at Marine Corps Air Station Miramar, California Initially commissioned as an F-8E, it was later converted to an F-8J.\n;F8U-2 (F-8K)\n* 145550 – USS Intrepid Museum in New York City, New York.\n* 145592 - under restoration to airworthiness by a private owner in Seattle, Washington, After being operated by the U.S. Navy, the registration number was changed to NX19TB, with the X removed from the middle. It was then transferred to the Flying Heritage Collection at Arlington Municipal Airport in Arlington, Washington, although it is believed that the wings were still able to fold at that time. It is unknown what condition it is currently in.\n* 146931 – Estrella Warbirds Museum in Paso Robles, California. The operating mechanism of the wings remains.\n* 146939 – Patriots Point Naval & Maritime Museum aboard ex-USS Yorktown (CV-10), Mount Pleasant, South Carolina.\n*\n* 146983 – Marine Corps Air Station Kaneohe Bay, Hawaii.\n* 146985 – Valiant Air Command Warbird Museum at Space Coast Regional Airport in Titusville, Florida It is currently on display indoors, with its wings folded.\n* 146995 – Pacific Coast Air Museum, adjacent to the Sonoma County Airport in Santa Rosa, California\n* 147030 – USS Midway Museum in San Diego, California.\n;F-8L\n* 145449 – Naval Air Station Fallon, Fallon, Nevada.\n* 145527 - under restoration to airworthiness by a private owner in Seattle, Washington, Originally operated as an F-8A, it was converted to an F-8L and used until retirement. Afterwards, it was given a new registration number N37TB and taken over by Thunderbird Airlines. In 2002, ownership changed to the Flying Heritage and Combat Armor Museum and it was restored, but the wings are still folded.\n;F8U Cockpit\n* 145399 – Under restoration at [https://www.moffettfieldmuseum.org/ Moffett Historical Museum], Moffett Federal Airfield, California.\nSpecifications (F-8E)\n. Quest for Performance, Combat Aircraft Since 1945, Joseph F. Baugher\n|prime units?= kts\n|crew= 1\n|length ft= 55\n|length in= 11.6\n|length sigfig=4\n|length note=\n|span ft= 35\n|span in= 8\n|span note=\n|height ft= 15\n|height in= 9.1\n|height sigfig=3\n|height note=\n|wing area sqft= 375\n|wing area note=\n|aspect ratio= 3.4\n|airfoil=root: NACA 65A006 mod; tip: NACA 65A005 mod\n* Zero-lift drag coefficient: CD0.0133\n* Drag area:\n|empty weight lb= 18,800\n|empty weight note=\n|gross weight lb= 29,000\n|gross weight note=\n|max takeoff weight lb= 34,000\n|max takeoff weight note=\n|fuel capacity=  or\n|more general=\n|eng1 number= 1\n|eng1 name= Pratt & Whitney J57-P-20A\n|eng1 type= afterburning turbojet engine\n|eng1 lbf= 11,400\n|eng1 note=\n|eng1 lbf-ab= 18,000\n|max speed kts= 1,066\n|max speed note= at\n|max speed mach= 1.8\n|cruise speed kts= 268\n|cruise speed note=\n|stall speed kts= 135\n|stall speed note=\n|never exceed speed kts= 775\n|never exceed speed note=\n|range nmi=\n|range note=\n|combat range nmi= 394\n|combat range note=\n|ferry range nmi= 1,507\n|ferry range note= with external fuel\n|endurance=\n|ceiling ft= 58,000\n|ceiling note=\n|g limits=\n|lift to drag= 12.8\n|roll rate=\n|climb rate ftmin=\n|climb rate note=\n|time to altitude=\n|wing loading lb/sqft= 77.3\n|wing loading note=\n|fuel consumption lb/mi=\n|thrust/weight= 0.62\n|more performance=\n|guns= 4× 20 mm (0.79 in) Colt Mk 12 cannons in lower fuselage, 125 rpg\n|hardpoints= 2× side fuselage mounted Y-pylons (for mounting AIM-9 Sidewinders and Zuni rockets) and 2× underwing pylon stations\n|hardpoint capacity= 4,000 lb (2,000 kg)\n|hardpoint missiles=\n*** 4× AIM-9 Sidewinder or Matra Magic (French Navy only) air-to-air missiles\n*** 2× AGM-12 Bullpup air-to-surface missiles\n|hardpoint rockets= 2× LAU-10 rocket pods (each with 4× 5 inch (127mm) Zuni rockets)\n|hardpoint bombs=\n*** 8× 250 lb (113 kg) Mark 81 bombs or\n*** 8× 500 lb (227 kg) Mark 82 bombs or\n*** 2× 1,000 lb (454 kg) Mark 83 bombs or\n*** 2× 2,000 lb (907 kg) Mark 84 bombs\n|avionics= Magnavox AN/APQ-84 or AN/APQ-94 Fire-control radar\n}}\nSee also\nReferences\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.globalsecurity.org/military/systems/aircraft/f-8.htm F-8 Crusader factsheet on GlobalSecurity.org]\n*"
    }
  ]
}