{
  "content": [
    {
      "type": "text",
      "text": "# Vox (Stewart and Riddell novel)\n\nVox is a children's fantasy novel by Paul Stewart and Chris Riddell, first published in 2003. It is the sixth volume of The Edge Chronicles and the second of the Rook Saga trilogy; within the stories' own chronology it is the eighth novel, following the Quint Saga and Twig Saga trilogies.\nPlot summary\nThe novel begins by showing the state of play in Undertown. The usurper Vox Verlix is now trapped in the Palace of Statues having lost control over all his grand projects. The Guardians of Night took over the Tower of Night when they drove him out, the Shrykes seized the Great Mire Road, and the goblins Vox hired to enslave Undertowners and build the Sanctaphrax Forest cut the Most High Academe out of the loop. Vox was left as nothing more than a puppet used by General Tytugg of Undertown to keep the Shrykes at bay. The situation also appears to be coming to a head. The Shrykes are massing for war. The goblins in Undertown seem much more aggressive, with numerous assassins sent to kill Vox, who is now too obese to leave his Palace of Statues. To cap all this, strange sightings are being reported by Librarian Knights on patrol; demonic creatures are seen emerging from a former Undertown district named Screetown, a rubble wasteland. This is revealed to be down to the work of the Most High Guardian of Night, Orbix Xaxis, who is having his executioner Mollus Leddix feed captured librarians to rock demons.\nRook Barkwater is on patrol duty, noting the sweltering weather, when he is struck by a fireball and sent hurtling to earth. He awakens, battered and bruised, to find his skycraft the Stormhornet broken beyond repair. Rook hopelessly traverses Screetown, pursued by predators, one of which, a Rubble-ghoul, almost kills him, until he is rescued by his old friend Felix Lodd, Varis' brother, whom Rook and all the other librarians believed to be dead in Screetown, as rumour had it nobody could survive there. Felix takes Rook back to his hideout for the night, having formed a gang called \"the Ghosts of Screetown\", who trap and hunt whilst attempting to free as many as Sanctaphrax Forest slaves as they can.\nRook journeys through Undertown after bidding farewell to Felix, seeking a way back to the sewers, only to be caught by goblins. Rook is put up for auction in the slavesale, but escapes being sold into the Sanctaphrax Forest and is taken to the Palace of Statues instead. There, he meets Hesteria Spikesap, an old potioneer, along with Speegspeel, an ancient goblin butler, paranoid that the statues in the palace are trying to kill him. Rook is almost brainwashed by Vox's advisor, an amoral ghost-waif named Amberfuce, but he resists and keeps his identity. Rook the bizarre task of \"feeding the baby,\" a gigantic cog-wheel system filled with volatile phraxdust.\nAfter Rook foils a goblin assassination on Vox, Cowlquape, former Most High Academe of New Sanctaphrax before Vox's coup, arrives at the Palace as an envoy for the Librarians. After trading blows over how Cowlquape's vision for unity amongst all never came to pass, Vox explains his reason for summoning the librarians: a dark maelstrom is mere days away, and its strike will wipe out Undertown and any who remain. Vox advises that all evacuate the sewers and flee down the Great Mire Road for the Free Glades, and asks for help in escaping the Palace. Vox also offers a plan to dispose of their enemies: by luring the Shrykes and goblins into the sewers with the promise of helpless librarians, the Great Mire Road will be left unguarded. Rook and a brainwashed goblin assassins are sent to the Shryke and goblin armies, offering the means to infiltrate the sewers, so both armies are set to meet there in two days time at the eleventh hour.\nThe Librarians work fervently to build ships and rafts and evacuate just in time. Alquix Venvax, an ancient professor, unwilling to leave the library that has been his home for most of his life, remains behind. The librarians also send Rook's four banderbear friends to the Palace of Statues, to help Vox escape the Palace.\nMeanwhile, Magda Burlix, looking for Rook in Screetown since he crashed, is captured by Guardians of Night. Xanth Filatine, who acted as a spy in the Free Glades at the time Magda learnt her craft, finds himself as her interrogator. He soon repents all his evil and saves her from his masters, also stealing an essential component for Midnight's Spike – an electrical conductor atop the Tower of Night for the curing of stone sickness (It is the Guardians of Nights belief unfounded by science that lightning will end stone sickness). Their first escape ends with their capture. As they are lowered to their supposed execution, Xaxis reveals his plan: he has had a tunnel dug into the sewers, where Magda and Xanth will be pursued by the Rock Demons, who will devour the Librarians. Xanth and Magda manage to stay ahead of the beasts and meet Venvax in the library, bidding him farewell when they realise he will not leave. As the goblin and shryke armies enter the sewers to kill the librarians, Venvax sacrifices his life to let Xanth and Magda escape the goblins. The Shrykes soon engage Tytugg's forces in battle, causing huge carnage. However, the Rock Demons then arrive and proceed to slaughter both sides – any who survive are wiped out in the flood.\nOn board the barges, Rook and Cowlquape realise the purpose of Vox's baby; Vox did not predict the maelstrom, for the sphere of phraxdust will be volatile enough to trigger such an event if it is fired into the sky (a previous attempt caused Rook to crash the Stormhornet). They also realise that, with his escape now assured, there is nothing to stop Vox triggering the storm at any hour he pleases. Rook desperately swims back to shore and climbs up the Palace of Statues to stop the maelstrom. He arrives in time to see the butler Speegspeel move to set off the storm an hour before Vox's 'prediction'. Rook fights and kills Speegspeel, but then releases the storm himself by unintentionally mixing his sweat with the phraxdust. The storm destroys Undertown and the Ghosts of Screetown evacuate all the inhabitants. As the storm reaches its peak, the Guardians of Night attempt to harness the lightning to cure the Sanctaphrax rock of Stone Sickness. However, Mollus Leddix discovers Xanth's theft of the deadbolt too late, and is unable to keep Midnight's Spike aloft. Orbix Xaxis throws Leddix to his death, and insanely attempts to act as a human conductor in the place of the spike. The lightning does indeed strike, but only obliterates the Tower of Night. Rook rejoins with the Librarians, and admits he set off the Storm, which could have been prevented. However, the Librarians forgive him, eager as they are to leave the sewers, and knowing that if Rook had not intervened, the storm would certainly have been triggered anyway.\nFinally Vox's bower appears. Sensing his thoughts being probed, Rook attacks it to find that the waif Amberfuce has betrayed Vox as well, leaving him to die in the Palace of Statues. The book ends with Vox trapped in the Palace of Statues with Hesteria Spikesap, realising the extent of Amberfuce's betrayal just as Spikesap kills him by force-feeding him Oblivion. Hesteria reveals she has an unhealthy love for her master, and cradles his dead body as the Palace begins to collapse.\nReception\nThe Booksellers Wendy Cooling stated that the novel was just as thrilling as the first novel in The Edge Chronicles series. She added that \"[p]owerful imaginations and creative minds have invented this world and filled it with extraordinary characters\". Marya Jansen-Gruber from ''Through The Looking Glass Children's Book Reviews'' felt that it was an engrossing story, commenting that she could not \"help marveling at the way in which Paul Stewart and Chris Riddell together have created a world so full of both darkness and light.\" Several reviewers liked the novels' illustrations, with Maggie Elliott writing in Library Media Collection that the \"detailed illustrations of the creatures add to the enjoyment of the book.\"\nReferences\nExternal links\n[https://www.worldcat.org/oclc/868078285 Library holdings of Vox]"
    }
  ]
}