{
  "content": [
    {
      "type": "text",
      "text": "# W. D. S. Abeygoonawardena\n\n| birth_place         = Matara\n| death_date          =\n| death_place         = Galle, Sri Lanka\n| nationality         = Ceylonese\n| party               = United National Party\n| occupation          = Businessman\n| otherparty          =\n| spouse              = K. M. Charlotte Abeygoonawardena\n| children            = 7\n| residence           = \"Abeywasa\" Inland Hills Estate Karapitiya, Galle\n| alma_mater          = St. Aloysius College, Mahinda College, St. Peter's College\n| profession          = Politician\n| website             = [http://gallemotorbuscompany.yolasite.com]\n| footnotes           =\n}}\nWijesekera Don Simon Abeygoonawardena (3 October 1907 – 30 December 1975), known as W. D. S. Abeygoonawardena, was a Sri Lankan businessman and politician. He was a Member of Parliament of the Galle electorate and was also Mayor of Galle.\nEarly life\nAbeygoonawardena was born on 3 October 1907, in Naotunna, Matara, the third son of Wijesekara Don Diyonis Abeygoonawardena and Gimara Podi Hami (née Kaluarachchi). He received his education at St. Aloysius' College, Mahinda College, and St. Peter's College.\nIn 1934, Abeygoonawardena founded the Galle Motor Bus Company, an independent bus service in the country. Abeygoonawardena became the managing director in 1945, overseeing a fleet of 126 buses, mainly Chevrolet vehicles. Some of the vehicles were assembled locally at his garage in Pettigalawatte. The bus service issued tickets printed in Sinhalese and reserved seats for the Buddhist clergy.\nPolitical career\nand H. W. Amarasooriya seated next to him.|thumb]]\nAbeygoonawardena's political career began in 1945, affiliating himself with Sinhala Maha Sabha at the request of S. W. R. D. Bandaranaike. He became the first regional president of the party for the Galle District.\nIn the 3rd parliamentary election held in April 1956, Abeygoonawardena contested the electorate seat for Galle, losing to the incumbent Dahanayake. In the Ceylonese parliamentary election on 19 March 1960, Abeygoonawardena, representing the United National Party, defeated then-Prime Minister Dahanayake, receiving 10,480 votes (49% of the total) compared to Dahanayake's 9,997 votes. Dahanayake won the seat in the subsequent 5th parliamentary election, held on 20 July 1960.\nSix years later, Abeygoonawardena was elected unopposed to represent the Bazaar Ward on the Galle Municipal Council. He served as the Mayor of Galle from 1965 to 1970. During his term as Mayor, he presided over the council's centenary celebrations and presented concerns, regarding Galle's water supply, to then-Prime Minister Dudley Senanayake.\nIn 1970, after the United National Party did not nominate him for the Galle seat, Abeygoonawardena contested as the candidate for the Sri Lanka Freedom Party. Abeygoonawardena lost to the United National Party incumbent, Dahanayake. Abeygoonawardena received 20,982 votes, while Dahanayake received 22,382 votes.\nPersonal life\nAbeygoonawardena contributed to Buddhist religious activities, including the restoration of the Chaitya of Mahiyangana. He also donated 2 hectares (5 Acres) of land and contributed to the funding of the Naotunna Junior School.citation needed&#x5D;\nAbeygoonawardena died in Galle on 30 December 1975 at the age of 68. His wife, K.M. Charlotte Abeygoonawardena, died in 2009. They had seven children together.\nReferences\nExternal links\n* [http://gallemotorbuscompany.yolasite.com/ Galle Motor Bus Company]"
    }
  ]
}