{
  "content": [
    {
      "type": "text",
      "text": "# W. Gibson Ward\n\n| image              = William Gibson Ward.png\n| birth_name         = William Gibson Ward\n| birth_date         =\n| birth_place        = Birmingham, England\n| death_date         =  (aged 63)\n| death_place        = Ross, England\n| occupation         = Vegetarianism and anti-vaccination activist\n}}\nWilliam Gibson Ward  (1819 – 18 October 1882) was an English activist for vegetarianism, anti-vivisection and anti-vaccination.\nBiography\nWilliam Gibson Ward was born in Birmingham in 1819. He was the Herefordshire squire of Perriston Towers, Ross. Ward became a vegetarian at the age of 30, and also abstained from alcohol and tobacco; additionally, he was opposed to vaccination and vivisection. He was a trustee of the National Agricultural Labourers Union and contributed to their journal the ''Labourers' Union Chronicle. Ward was a fellow of the Royal Historical Society, and vice-president of the Vegetarian Society. In 1874, Ward, Isaac Pitman, John Davie and Francis William Newman were described as \"four leading vegetarians\" in England.\nWard was involved in a dispute with Henry Taylor, secretary of the National Agricultural Society. In 1876, it was reported that Ward was charged at the Birmingham Police Court with \"feloniously and maliciously libelling Henry Taylor, of Leamington Spa\" by publishing two defamatory letters. Ward later withdrew his false charges against Taylor and regretted having made them. An apology by his solicitor on his behalf was produced at court and the apology was accepted and signed by all parties involved.\nFrom 1878 to 1879, Ward wrote a series of letters to The Times on vegetarian dieting. The letters were popular with the public and increased membership to the Vegetarian Society. Historian James Gregory has noted that Ward \"played an important role in the revival through letters to The Times advocating vegetable alternatives for the working classes at a time of concern about the cost of food.\"\nWard contributed to the National Anti-Compulsory Vaccination Reporter, an anti-vaccination journal. Journalist Howard Evans was highly critical of Ward and his activities. He commented that Ward was a \"ferocious hater of the landed aristocracy\" and \"never was there such a man who had such a curious bundle of fanaticisms.\"\nWard died on 18 October 1882, at the age of 63, due to tuberculosis at his residence, Perriston Towers, in Ross.\nLegacy\nHenry S. Clubb, the founder and first president of the American Vegetarian Society, cited Ward as his inspiration for going vegetarian, based on Ward's visits to his father's home.\nSelected publications\n*\nReferences"
    }
  ]
}