{
  "content": [
    {
      "type": "text",
      "text": "# Wadi Ahwar\n\nWadi Ahwar is a major seasonal watercourse (wadi) of southern Yemen. It flows into the Gulf of Aden in Ahwar District, Abyan Governorate at , near the village of Ahwar.\nThe catchment of Wadi Ahwar has been estimated at approximately 6,300 km² up to diversion points, and somewhat larger when the deltaic area is included. Ministry of Agriculture and Irrigation, Republic of Yemen; Hydrosult Inc.; Irrigation Improvement Project (IIP). (2008, December). Water resources assessment and detail design of different components of Wadi Ahwar-Abyan: Main Report, Volume One. Ministry of Agriculture and Irrigation, Republic of Yemen.  The wadi is fed largely by episodic rainfall events and characterised by spate flows rather than a steady perennial river. In the upstream mountainous areas, runoff is relatively rapid.\nThe Wadi Ahwar delta zone supports irrigated agriculture, particularly where flood-waters and groundwater are harnessed. Traditional ‘spate’ irrigation techniques divert flood flows into fields; agricultural crops include cotton (long-staple), sorghum, millet, vegetables and melons.Maktari, M. S. (1987, December). Wadi development for agriculture in PDR Yemen (Proceedings of the Subregional Expert Consultation on Wadi Development for Agriculture in the Natural Yemen, Aden) [PDF]. Floodbased.  However, the irrigation infrastructure in the region is old and often poorly maintained, and groundwater abstraction is approaching safe yield levels, with concern about sustainability.\nDevelopment projects, such as the “Water Sector Support Project” have been undertaken in the Wadi Ahwar basin aiming at weir rehabilitation, canal system improvement, flood-diversion works and groundwater recharge enhancement.\nBecause Wadi Ahwar drains from relatively steep mountain terrain down to the coastal plain, the geomorphology involves a transition from rocky upland slopes, shallow soils and sparse vegetation, into broader alluvial fans and deltaic deposits. Sediment yield is significant during flood events.   Sea-water intrusion into the delta aquifer system is of concern because over-abstraction and reduced recharge weaken the freshwater lens. Groundwater depletion has been reported.\nSee also\n*List of wadis of Yemen\nReferences"
    }
  ]
}