{
  "content": [
    {
      "type": "text",
      "text": "# Wagners (Queensland business)\n\nThe Wagners family have been in business in Toowoomba, Queensland, Australia, since 1896 when John Henry Wagner first established the stone masonry business JH Wagner & Sons which continues to this day. In 2018 the Wagners were inducted in the Queensland Business Leaders Hall of Fame.\nHistory\nHenry Wagner, a grandson of John Henry Wagner, eventually acquired control, expanded to include concreting, and in 1989 formed a partnership with three of his sons John, Denis, and Neill. Later, a fourth son Joe, joined and became an equal partner in the business which has achieved regional, national and international distinction. One of their early projects with the stonework of the third stage of St John's Anglican Cathedral in Brisbane.\nFrom 1989, the business expanded rapidly from one concrete plant to 19 within 20 years and a work force of 1,100. Diversification led the business into pre-cast concrete, re-enforcing steel, ground-breaking building products and major construction and infrastructure projects both at home and abroad, including in sub-zero temperatures in Sakhalin, Russia.\nIn Australia, the business thrived in a range of diverse construction and infrastructure related activities. Wagners developed fibre technology products and their \"earth friendly\" concrete. In 2017, Wagners successfully listed its building materials and mining services operations on the Australian Securities Exchange.\nThe Wagner family established Toowoomba Wellcamp Airport, the first public airport to be constructed in Australia in 50 years, built with a $40 million contribution to an incorporated entertainment precinct from Queensland Government delivering on an election promise, otherwise funded with family money and to be completed in less than 20 months.  The airport is currently only for domestic and freight use, and does not have capacity to accept international travellers due to lack of customs and border control infrastructure.  Built, owned and operated by the Wagner family, the airport is a regional and interstate passenger facility with major airlines and is a hub for the export of regional produce to China via a weekly Boeing 747 service.\nDefamation case against Alan Jones\nFollowing the 2010–11 Queensland floods, radio host Alan Jones made a series of on-air allegations against the Wagners accusing them of being responsible for the deaths of 12 people during the floods following the collapse of a wall in a quarry they owned. The Wagners commenced a defamation action, which resulted in a 2018 judgment that Jones and the radio stations that broadcast him were ordered to pay $3.7 million in damages to the Wagner family.\nWellcamp Entertainment Precinct\nIn October 2020, Wagners announced they were planning to build an entertainment precinct at Wellcamp at a cost of $175 million project. The precinct will have motorsport facilities and performing arts venue capable of seating 40,000 people. The Queensland Government has committed $40 million towards the project.\nReferences\nAttribution\nFurther reading\n*\nExternal links\n*\n*\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99183588411402061 Wagners digital story and oral history: Queensland Business Leaders Hall of Fame 2018.] State Library of Queensland\n*"
    }
  ]
}