{
  "content": [
    {
      "type": "text",
      "text": "# Waking Hours\n\n| genre      = *Alternative rock\n*pop rock\n| length     = 45:49\n| label      = A&M\n| producer   =\n*Mark Freegard\n*Hugh Jones\n*Gil Norton\n| prev_title = Del Amitri\n| prev_year  = 1985\n| next_title = Change Everything\n| next_year  = 1992\n| misc       =\n}}\n| rev2      = Encyclopedia of Popular Music\n| rev2score =\n|rev3 = The Great Rock Discography\n|rev3score = 8/10\n}}\nWaking Hours is the second studio album by Scottish alternative rock band Del Amitri, released in July 1989 by A&M Records. It reached number 6 in the UK Albums Chart and featured one of the band's most famous songs, \"Nothing Ever Happens\", which reached number 11 in the UK Singles Chart. The album's opening track, \"Kiss This Thing Goodbye\", entered the top 40 of the US Billboard Hot 100 when released as a single for the second time.\nHistory\nMany Del Amitri fans consider Waking Hours to be the band's first \"real\" album. The post-punk influence of the first album, Del Amitri (1985), had produced a sound radically different to the remainder of the band's output. The first album had been extremely difficult to find for many years, before its 2003 CD reissue, leaving many who became fans in the 1990s totally unaware of its existence. Waking Hours arguably represents Del Amitri's first \"mature\" record, and was certainly the first to bring them any mainstream success.\nTypically for Del Amitri (the group never made two albums with the same band members), Waking Hours featured some recently introduced personnel: new guitarist Mick Slaven and keyboard player Andy Alston, who would become a full member after the album's release. Despite some important creative input (he contributed to the writing of \"Kiss This Thing Goodbye\" and \"Hatful Of Rain\") Slaven left the band before the album had even been released and was replaced by David Cummings. It would also be the last record for drummer Paul Tyagi, who was replaced by Brian McDermott. Both Cummings and McDermott appear on the album's front cover despite not having played on it.\nRecording\nOn the heels of a US tour in 1986, where Del Amitri had absorbed classic rock radio and picked up a diverse range of musical influences, the band began a musical evolution during an intensive period of songwriting. From taking inspiration from bands such as the Fall, the Smiths, R.E.M. and the Feelies, they now started listening to Creedence Clearwater Revival, Tom Petty and the Heartbreakers, John Mellencamp as well as country-influenced artists like Steve Earle and Lyle Lovett. \"We always said that our \"transformation\" from indie art pop to mainstream pop rock was a natural thing,\" singer and bassist Justin Currie said in 2010. \"Iain [Harvie] and I started writing separately instead of with the rest of the band, and our stuff sounded much more accessible and probably Americanized. Iain's guitar playing loosened up, started embracing blues and rock... And we then brought in a famous Glasgow guitarist called Mick Slaven, who plays like Robert Quine meets Nile Rogers meets Marc Bolan meets Jimi Hendrix. That we should sound a little different from before was inevitable.\"\nDel Amitri made their first recordings with their new lineup in spring 1987, recording the tracks \"Move Away Jimmy Blue\" and \"Talk It to Death\" with producer Gil Norton at Park Lane studios in Glasgow. The sessions also produced a handful of demos, which led to a bidding war among various labels, and the eventual signing with A&M Records later in the year. In 1988, unsuccessful attempts in London and Los Angeles with producer David Kershenbaum at recording what would become Waking Hours, left the band frustrated and disillusioned. The only track not scrapped from these sessions was the future B-side \"The Return of Maggie Brown\". But with the arrival of producer Hugh Jones, the project got back on track and recordings of \"Nothing Ever Happens\", \"Empty\" and \"You're Gone\" took place at Chipping Norton Recording Studios in Oxfordshire. Later, due to Jones' commitment to other projects, engineer Mark Freegard took over production and recorded the remaining tracks for the album at Great Linford Manor in Milton Keynes. By early 1989, recording for the album was completed.\nDrummer Paul Tyagi, who left the band during the recording of Waking Hours, was replaced in the studio by Stephen Irvine of Lloyd Cole and the Commotions, who contributed drums to five tracks, including \"Stone Cold Sober\". Other tracks such as \"Kiss This Thing Goodbye\" and \"Opposite View\" feature drum programming. Bassists James O'Malley (of Fire Next Time) and Currie's occasional session stand-in Nick Clark were drafted in for certain tracks on the album, while Mick Slaven played bass on \"When I Want You\". \"The new songs demanded pretty tight bass playing and I really couldn't get my head round it then,\" Currie said in 1992. \"But in the end I played on about five songs on the album.\"\nTrack listing\n| length1 = 4:35\n| title2 = Opposite View\n| length2 = 4:52\n| title3 = Move Away Jimmy Blue\n| writer3 =\n| length3 = 3:47\n| title4 = Stone Cold Sober\n| length4 = 4:57\n| title5 = You're Gone\n| writer5 =\n| length5 = 5:10\n| title6 = When I Want You\n| length6 = 4:32\n| title7 = This Side of the Morning\n| length7 = 4:21\n| title8 = Empty\n| length8 = 4:38\n| title9 = Hatful of Rain\n| writer9 =\n| length9 = 5:01\n| title10 = Nothing Ever Happens\n| length10 = 3:53\n}}\n2014 expanded edition\n;Disc 1\n*as per the original album\n| extra5 = Gil Norton\n| length5 = 4:26\n| title6 = So Many Souls to Change\n| note6 = B-side to \"Nothing Ever Happens\"\n| extra6 = The Groovey Tubes\n| length6 = 3:57\n| title7 = Don't I Look Like the Kind of Guy You Used to Hate\n| note7 = B-side to \"Nothing Ever Happens\"\n| extra7 = The Groovey Tubes\n| length7 = 2:50\n| title8 = Evidence\n| note8 = B-side to \"Nothing Ever Happens\"\n| extra8 = The Groovey Tubes\n| length8 = 3:10\n| title9 = Another Letter Home\n| note9 = B-side to \"Move Away Jimmy Blue\"\n| extra9 = The Groovey Tubes\n| length9 = 4:08\n| title10 = April the First\n| note10 = B-side to \"Move Away Jimmy Blue\"\n| extra10 = The Groovey Tubes\n| length10 = 2:53\n| title11 = More Than You'd Ever Know\n| note11 = B-side to \"Move Away Jimmy Blue\"\n| extra11 = The Groovey Tubes\n| length11 = 2:28\n| title12 = This Side of the Morning\n| note12 = live in the car park at 2 a.m.) (B-side to \"Move Away Jimmy Blue\"\n| extra12 = Mark Freegard\n| length12 = 4:19\n| title13 = Spit in the Rain\n| note13 = non-album single, 1990\n| extra13 = Norton\n| length13 = 3:45\n| title14 = The Return of Maggie Brown\n| note14 = version 2) (B-side to \"Spit in the Rain\"\n| extra14 = Kershenbaum\n| length14 = 3:47\n}}\nPersonnel\nCredits adapted from the album liner notes.\n;Del Amitri\n* Justin Currie – vocals, bass\n* Iain Harvie – guitar\n* Mick Slaven – guitar, bass (uncredited)\n* Paul Tyagi – percussion, drums\n;Additional musicians\n* Andy Alston – piano, organ\n* Blair Cowan – accordion, synthesizer\n* Will Mowat – sequencing, keyboards\n*Nick Clark – bass (thanked in the album credits for \"invisible bass guitar\")\n* James O'Malley – bass\n* Stephen Irvine – drums\n* Julian Dawson – harmonica\n* Robert Cairns – violin\n* Caroline Lavelle – cello\n;Technical\n* Mark Freegard – producer (1, 2, 4, 6, 7, 9), additional recording (3, 5, 8, 10)\n* Gil Norton – producer (3)\n* Hugh Jones – producer (5, 8, 10)\n* Julian Mendelsohn – mixing\n* Kevin Westenberg – photography\n* Sarah Southin – design\n* Jeremy Pearce – design\nCharts\n{| class=\"wikitable sortable plainrowheaders\"\n|+Waking Hours\n! scope=\"col\"| Chart (1989)\n! scope=\"col\"| Peakposition\n|-\n|| Australian Albums\n|| 8\n|- style=\"text-align:left;\"\n|| Canadian Albums Chart\n|| 66\n|- style=\"text-align:left;\"\n|| European Top 100 Albums\n|| 59\n|- style=\"text-align:left;\"\n|| Swedish Albums\n|| 40\n|-\n| style=\"text-align:left;\"| UK Albums Chart\n| style=\"text-align:left;\"| 6\n|-\n| style=\"text-align:left;\"| US Billboard 200\n| style=\"text-align:left;\"| 95\n|-\n|}\nCertifications\nReferences\nExternal links\n* [http://www.delamitri.com Official Del Amitri homepage]\n*"
    }
  ]
}