{
  "content": [
    {
      "type": "text",
      "text": "# Waking Sleeping Beauty\n\n| runtime        = 85 minutes\n| country        = United States\n| language       = English\n| gross          = $84,918\n}}\nWaking Sleeping Beauty is a 2009 American documentary film directed by Disney film producer Don Hahn and produced by Hahn and former Disney executive Peter Schneider. The film documents the history of Walt Disney Feature Animation from 1984 to 1994, covering the rise of a period referred to as the Disney Renaissance.\nThe film uses no new on-camera interviews, instead relying primarily on archival interviews, press kit footage, in-progress and completed footage from the films being covered, and personal film/videos shot (often against company policy) by the employees of the animation studio.\nWaking Sleeping Beauty debuted at the 2009 Telluride Film Festival, and played at film festivals across the country before its limited theatrical release on March 26, 2010, by Walt Disney Studios Motion Pictures.\nSynopsis\nThe documentary is narrated by animator and film producer Don Hahn, with numerous audio interviews from company animators and executives.\nThe documentary begins in the early 1980s, when The Walt Disney Company was led by Walt Disney's son-in-law Ron W. Miller.  Many new animators had joined the company after graduating from CalArts, but they were hired in a time where animation was considered a dying art.  Roy E. Disney, Walt's nephew and son of Disney co-founder Roy O. Disney, resigned from the company during a corporate takeover attempt by Saul Steinberg, which led to Miller's ousting. Roy returned to the company as vice-chairman of the board of directors, and chairman of the animation department. Roy installed Michael Eisner and Frank Wells, respectively, as the company's new CEO and President.\nEisner hired Jeffrey Katzenberg as head of the film division, but he proved to be a controversial figure, moving the animation department to an off-site location in Glendale, California. Roy hired Peter Schneider to be President of Walt Disney Feature Animation, who helped modernize the animation process. Losing at the domestic U.S. box office to many films released by Don Bluth, a former studio animator who left on his 42nd birthday in 1979 to found his namesake company, Disney began producing new animated features to be released at a pace of one per year. The company also began releasing its classic films in the new home video videocassette formats. A gong show in the company led to the green-lighting of numerous film projects.  The production of Who Framed Roger Rabbit, though expensive for Disney, proved to be a huge financial success, along with Oliver & Company.\nThe Disney Renaissance, which lasted from 1989 to 1999, began with The Little Mermaid. The soundtrack was composed and written by Howard Ashman and Alan Menken, who also composed the music for Beauty and the Beast; Menken later composed the music for Aladdin.  Ashman's involvement in The Little Mermaid and Beauty and the Beast aided in both being box office successes; winning two Academy Awards each, for Best Original Song and Best Original Score. However, Ashman died on March 14, 1991, and never saw a chance to see the completed film. The Rescuers Down Under utilized the new CAPS system, which blended traditional and computer animation together, but the film was a financial disappointment.\nAt the production crew's wrap party screening of Beauty and the Beast, Eisner announced that a new animation building would be constructed on the studio lot as a reward for their hard work, but Katzenberg was unaware of this. In 1994, The Lion King was released and became another triumphant success for Disney. Katzenberg expected to become the new company president following the death of Frank Wells, but was denied the position by Eisner, eventually leading to his resignation. Katzenberg would later go on to co-found future animation, film, TV, gaming, and music rival DreamWorks Pictures.\nCast\n* Don Hahn: Himself—Narrator (voice)\n* Michael Eisner: Himself (archive footage)\n* Jeffrey Katzenberg: Himself (archive footage)\n* Roy E. Disney: Himself  (archive footage)\n* Frank Wells: Himself (archive footage)\n* Peter Schneider: Himself (archive footage)\n* John Musker: Himself (archive footage)\n* Ron Clements: Himself (archive footage)\n* John Lasseter: Himself (archive footage)\n* Steven Spielberg: Himself (archive footage)\n* Rob Minkoff: Himself (archive footage)\n* Glen Keane: Himself (archive footage)\n* Roger Allers: Himself (archive footage)\n* Mike Gabriel: Himself (archive footage)\n* Thomas Schumacher: Himself  (archive footage)\n* Howard Ashman: Himself (archive footage)\n* Robert Zemeckis: Himself (archive footage)\n* Joe Ranft: Himself (archive footage)\n* Angela Lansbury: Herself (archive footage)\n* Alan Menken: Himself (archive footage)\n* Janis Roswick: Herself (archive footage)\n* Nora Menken: Herself (archive footage)\n* Anna Menken: Herself (archive footage)\n* Gary Trousdale: Himself (archive footage)\n* Kirk Wise: Himself (archive footage)\n* Jodi Benson: Herself (archive footage)\n* Jerry Orbach: Himself (archive footage)\nProduction\nNarration is done by Hahn, with new audio-only interviews done by several of the studio's principal figures, including former executives Eisner, Katzenberg, and Roy E. Disney, and animator/directors Mike Gabriel, Rob Minkoff, Roger Allers, Gary Trousdale, and Kirk Wise. The footage includes filmmakers Tim Burton, John Lasseter, Don Bluth, Ron Clements, John Musker, Steven Spielberg, Robert Zemeckis, Richard Williams, Richard Rich, and George Scribner, as well as Howard Ashman, Alan Menken, Jodi Benson, Robin Williams, Paige O'Hara, Jerry Orbach, Angela Lansbury, Jeremy Irons, Nathan Lane, Elton John, and Tim Rice. A significant portion of the personal film used was shot by John Lasseter and Joe Ranft for Disney animator Randy Cartwright, who is featured giving makeshift \"studio tours\" in 1980, 1984, and 1990. The Cartwright footage is used to bookend the film.\nThe film is dedicated to the memory of Howard Ashman, former Disney President and chief operating officer Frank Wells, animator Joe Ranft, and Roy E. Disney.\nReception\nWaking Sleeping Beauty has received generally positive reviews. Rotten Tomatoes gives the film a rating of 71% based on 51 critics. The site's general consensus is, \"[The film] doesn't probe as deep – or tell as many hard truths – as it could have, but Don Hahn's look at Disney's rebirth offers a fascinating and surprisingly candorous glimpse into the studio's past.\" Metacritic, which assigns a normalized rating out of 100 top reviews from mainstream critics, calculated a score of 70 based on 18 critics.\nIt earned a Special Achievement Award at the 2010 Annie Awards and was given an ASIFA Honorary Fellowship Of Merit.\nSee also\n* The Pixar Story, a 2007 documentary film chronicling the history of Pixar Animation Studios.\n* Dream On Silly Dreamer, a 2005 documentary by Disney animators Dan Lund and Tony West on the rise and fall of traditional animation at Disney from 1980 through 2002.\n* Howard, a 2018 documentary by Don Hahn about the life of songwriter Howard Ashman who helped create some of Disney's most iconic songs.\nReferences\nExternal links\n*\n*\n*\n*\n*"
    }
  ]
}