{
  "content": [
    {
      "type": "text",
      "text": "# Wales & Edwards\n\n}}\nWales & Edwards was a British manufacturer of milk floats based in Harlescott, Shrewsbury. They were particularly well known for their three wheelers. It was one of the oldest milk float manufacturers lasting from the early 1940s to the early 1990s. In 1989, the company was acquired by Smith Electric Vehicles. Major customers included United Dairies (later known as Unigate) and in the early years, Express Dairies. The basic design evolved throughout W&E's existence before finally ending its days as the Rangemaster.\nHistory\nThe company began life as a garage which acted as an agency for Morris and Wolseley cars. In the early 1940s, they serviced cars and sold petrol, as well as having the car salesroom. As part of the war effort during World War II, the garage was divided into two, with one half servicing cars for essential users, such as doctors, vets and farmers, and the other half servicing Morris 15 cwt (750 kg) Quads and Mobile workshops for the army. They also worked on parts for Spitfire aircraft, and the workforce was swelled by a number of Italian prisoners of war during this period.\nThe company diversified once hostilities had ceased, and Mervyn Morris produced designs for a battery electric vehicle. Staples such as bread and milk were delivered in many parts of the country by horse and cart, and the electric vehicle developed into a cheaper solution for milk deliveries. Rodington Dairy was the first to order a vehicle, which was delivered to them in early 1951. A base for manufacturing the vehicles was set up at Harlescott, a suburb to the north of Shrewsbury, and they obtained wiring harnesses from Hartley Electromotive, an electrical engineering company which had moved to Monkmoor, to the east of Shrewsbury, in 1949.\nIn 1951, United Dairies circulated a specification for a milk delivery vehicle to a number of potential manufacturers, who were asked to produce prototypes. W & E were assisted in this by Mickleover Transport, a subsidiary of United Dairies, who were responsible for managing the transport needs of the company. The prototype was tested, and two significant changes were made before production started. The transmission was replaced with a modified design, for which Mickleover obtained a patent, and the electrical control gear was made more robust. By 1953, some 700 were in service, and W & E were able to make them available to other customers. United Dairies placed an order for a further 1,250 vehicles in mid-1953. The vehicle was a three-wheeled design, with a single wheel at the front, steered by a tiller, and two powered wheels at the back. The turning circle was just , and the motor had a chain drive to a bevel shaft, which included a rubber-bonded coupling, to reduce starting and braking torque. This gave good starting performance, even when there was snow or ice on the road. Batteries were located beneath the driver's seat, and the 29-volt motor was controlled by a Sharp contactor and four-stage controller.\nAccording to The Transport Museum, Wythall, which has amassed a large collection of milk floats, the first W & E vehicle was supplied to United Dairies in 1951. Despite its limited protection for the driver, it was an immediate success, and United Dairies placed an order for a further 1,500 vehicles. The three-wheeled design was the mainstay of W & E's production, with United Dairies eventually ordering over 3,000 more. When the first vehicle, which carries the registration number XMT 422, reached the end of its working life, it was returned to W & E, who subsequently donated it to the Transport Museum, where it can be seen, restored to its 1952 condition.\n, Essex, around 1970]]\nOn the early vehicles, the control panel and tiller gear were covered by two metal panels, and some protection was provided to the driver by a canvas screen. In 1955, Mickleover Transport designed and made a front cowl to replace the panels, which was made of glasspol, a polyester resin reinforced with glass-fibre matting. The cowls were initially fitted to 100 vehicles, and improved access to the control panel and tiller gear. They contained orange pigment, of the same colour as the United Dairies livery, which meant that they did not have to be painted once manufactured. Mickleover Transport intended to fit them to a large number of vehicles.\nIn 1956, W&E introduced a 25 cwt (1.27 metric tons) vehicle where the complete cab was made of glasspol. The cab included draught deflectors at the sides, to improve the protection for the driver. They also displayed a standard 25-30 cwt chassis fitted with an Enfield 1.13 litre two-cylinder oil engine at the 1956 Dairy Show, for use in areas which were particularly hilly. The engine was air-cooled, and coupled to a three-speed gearbox, but the concept was short-lived.\nIn 1961, the company added a five-wheeled articulated milk float to their range, designed for a payload of 2 long tons, and known as the Loadmaster 2 tonner. Only 18 were ever built, before production ceased in 1966. One of them remained in service with United Dairies until 1992, by which time it was based in Eastbourne. The trailer was rebuilt from an open-sided dairy vehicle to an enclosed box van in 1985, and on withdrawal it was donated to the Wythall Transport Museum, who have since rebuilt the trailer in its original form.\nW & E felt that the maximum payload for their three-wheeled float was 30 cwt, and such a model was known as the Major. Bigger payloads required a four-wheeled float, and the Freightliner was showcased at the 1966 Royal Dairy Show. It came as a 50 cwt (2.54 metric tons) model and twin tyres were fitted on the rear axle. In order to retain the manoeuvrability of the three-wheeled vehicles, the front springs and steering drag link were placed inside the frames, which allowed a kerb-to-kerb turning circle of  to be achieved. The wheelbase was , with the cab located in front of the front wheels, to give easy access to the driving position. Three models were available, with top speeds of ,  and . The working range was from , and a series resistance controller was fitted as standard, although the model at the Dairy Show had a thyristor control unit.\nAcquisition\nFollowing changes in legislation which allowed milk to be sold by supermarkets and garages at lower prices than the home delivery dairies could charge, sales of milk floats plummeted. Wales & Edwards saw a drop in orders of 70 per cent in a single year. Attempts to find other markets for the vehicles failed, and in 1989 the company was sold to Smith Electric Vehicles, who were based in Gateshead.\nCustomers\nW&E supplied large numbers of floats to United Dairies, who had provided the original specification. They also supplied Express Dairies, who supplied milk over an area of some  in the London area. In 1963 they had a total fleet of around 2,200 battery electric road vehicles, of which 200 were Standard 3-wheelers, 190 were the 25-cwt Rangemaster model, and three were the Loadmaster articulated model.\nPreservation\nThe Transport Museum, Wythall, located to the south of Birmingham, has five W & E vehicles on display:\n*The original Standard Model, registration number XMT&nbsp;422, with an open cab dating from 1950 which belonged to United Dairies;\n*Another, registration number XOG&nbsp;847, dating from 1958, with a protected cab, which belonged to Handsworth Dairies, located in the West Midlands.\n*A Birmingham Dairies Intermediate model, registration number DOG&nbsp;639C, dates from 1965.\n*A 1968 Rangemaster, registration number ROL&nbsp;982G which was operated by the same company.\n*A 1963 Loadmaster articulated float, registration number 8505&nbsp;PF.\nOther museums with W & E vehicles on public display include:\n*the National Transport Museum of Ireland at Howth which has a vehicle, registration number 2401&nbsp;YI, supplied to Premier Dairies of Dublin in 1970, and\n*the Aldridge Transport Museum in the West Midlands, which has a 1965 model, registration number DVP&nbsp;519C, originally supplied to Midland Counties Dairies.\nSee also\n* Whitby Morrison\nBibliography\n*\n*\nReferences\nExternal links"
    }
  ]
}