{
  "content": [
    {
      "type": "text",
      "text": "# Walking the plank__disambig_1\n\nfor ''Harper's Magazine'', 1887)]]\nWalking the plank was a method of execution practised on special occasion by pirates, mutineers, and other rogue seafarers. For the amusement of the perpetrators and the psychological torture of the victims, captives were bound so they could not swim or tread water and forced to walk off a wooden plank or beam extended over the side of a ship.\nAlthough forcing captives to walk the plank has been a motif of pirates in popular culture since the 19th century, few instances are documented, all of which took place well after the classical \"Golden Age of Piracy\" which ended by 1730.\nEarliest documented records of the phrase\nThe act is described in a 1763 article about pirates from The Public Adviser:\nPhiladelphia, May 12. ... And it is also said, that four other small Vessels were cruizing about the Grenades and Guadaloupe, in the same Manner, manned by Spaniards and Caribbee Indians, who had taken several Vessels; among them one belonging to the Grenades, whose Crew they obliged to walk into the Sea, on a Plank fixed for that Purpose, but that one of them got ashore by good Swimming.\nThe phrase appeared in a 1788 book on the slave trade, which recorded a 1779 incident in which slave-ship captains declared that if they ran out of water and food, they would save themselves by making their slaves jump overboard:\nHe then asked them what they had intended to have done with their slaves ... They replied, \"to make them walk the plank,\" (i. e.) to jump overboard.\nThe phrase is also recorded in the second edition of English lexicographer Francis Grose's Dictionary of the Vulgar Tongue, which was published in 1788. Grose wrote:\nWalking the plank. A mode of destroying devoted persons or officers in a mutiny on ship-board, by blind-folding them, and obliging them to walk on a plank laid over the ship's side; by this means, as the mutineers suppose, avoiding the penalty of murder.\nHistorical instances of plank walking\nPirate John Derdrake, active in the Baltic in the late 1700s, was said to have drowned all his victims by forcing them to walk the plank, but Derdrake may have been a fictional character.\nIn 1769, a mutineer, George Wood, confessed to his chaplain at London's Newgate Prison that he and his fellow mutineers had sent their officers to walk the plank. Author Douglas Botting, in describing the account, characterized it as an \"alleged confession\" and an \"obscure account [...] which may or may not be true, and in any case had nothing to do with pirates\".\nA Mr. Claxton, surgeons-mate aboard the Garland in 1788, testified to a committee at the House of Commons about the use of the plank by slavers:\nThe food, notwithstanding the mortality, was so little, that if ten more days at sea, they should, as the captain and others said, have made the slaves walk the plank, that is, throw themselves overboard, or have eaten those slaves that died.\nIn July 1822, William Smith, captain of the British sloop Blessing, was forced to walk the plank by the Spanish pirate crew of the schooner Emanuel in the West Indies.\nThe Times of London reported on 14 February 1829 that the packet Redpole (Bullock, master) was captured by the pirate schooner President and sunk. The commander was shot and the crew were made to walk the plank.\nIn 1829, pirates intercepted the Dutch brig Vhan Fredericka in the Leeward Passage between the Virgin Islands, and murdered most of the crew by making them walk the plank with cannonballs tied to their feet.\nIn literature\nDespite the likely rarity of the practice in actual history, walking the plank entered popular myth and folklore via depictions in popular literature.\nCaptain Charles Johnson, in his 1724 book A General History of the Pyrates, described a similar practice (using a ladder rather than a plank) in the Mediterranean of classical antiquity – Roman captives were offered the ladder and given their freedom, provided they were willing to swim for it.\nThe title page of Charles Ellms's sensationalist 1837 work The Pirates Own Book, apparently drawing on Charles Johnson's description, contains an illustration titled \"A Piratical Scene – 'Walking the Death Plank'\".\nIn Charles Gayarré's 1872 novel Fernando de Lemos: Truth and Fiction, the pirate Dominique Youx confessed to capturing the schooner Patriot, killing its crew and making its passenger Theodosia Burr Alston (June 21, 1783 – approximately January 2 or 3, 1813) walk the plank. \"She stepped on it and descended into the sea with graceful composure, as if she had been alighting from a carriage,\" Gayarré wrote in Youx's voice. \"She sank, and rising again, she, with an indescribable smile of angelic sweetness, waved her hand to me as if she meant to say: 'Farewell, and thanks again'; and then sank forever.\" Because Gayarré mixed fact with fiction, it is unknown whether Youx's confession was real or not.\nRobert Louis Stevenson's 1884 classic Treasure Island contains at least three mentions of walking the plank, including at the beginning where Billy Bones tells bone-chilling stories of the practice to Jim Hawkins. (Treasure Island also popularized other now-common pirate motifs such as parrots, peglegs, and buried treasure.)\nThe concept also appears in J. M. Barrie's Peter Pan, where Captain Hook's pirates helped define the archetype.\nSee also\n*Burial at sea\n*Golden Age of Piracy\n*Illegal disposal of bodies in the water\n*Keelhauling\n*Marooning\n*Mutiny\n*West Indies Squadron\nReferences\nFurther reading\n*Don Carlos Seitz, Under The Black Flag, Dail Press, 1925 (republished by Dover Publications in 2002, )\n*Samuel Pyeatt Menefee, \"Pirates: 2. Walking the Plank\" [Answer], ''The Mariner's Mirror'', vol. 80 (May, 1994), p.&nbsp;204"
    }
  ]
}