{
  "content": [
    {
      "type": "text",
      "text": "# Walking fish__disambig_1\n\n, a species of mudskipper, perched on land. Mudskippers are one type of walking fish.|215x215px]]\nA walking fish, or ambulatory fish, is a fish that is able to travel over land for extended periods of time. Some other modes of non-standard fish locomotion include \"walking\" along the sea floor, for example, in  handfish or frogfish.\nTypes\n(Alticus arnoldorum) hopping]]\nMost commonly, walking fish are amphibious fish. Able to spend longer times out of water, these fish may use a number of means of locomotion, including springing, snake-like lateral undulation, and tripod-like walking. The mudskippers are probably the best land-adapted of contemporary fish and are able to spend days moving about out of water and can even climb mangroves, although to only modest heights. The climbing gourami is often specifically referred to as a \"walking fish\", although it does not actually \"walk\", but rather moves in a jerky way by supporting itself on the extended edges of its gill plates and pushing itself by its fins and tail.  Some reports indicate that it can also climb trees.\nThe epaulette shark (Hemiscyllium ocellatum) tends to live in shallow waters where swimming is difficult, and can often be seen walking over rocks and sand by using its muscular pectoral fins. It lives in areas of great variation in water depth, usually where the tide falls below its location. If it finds itself out of water, it can survive for several hours, and is capable of walking over land to get to water. This means that it is easily observed by beachgoers in its natural range.\nThere are a number of fish that are less adept at actual walking, such as the walking catfish. Despite being known for \"walking on land\", this fish usually wriggles and may use its pectoral fins to aid in its movement. Walking catfish have a respiratory system that allows them to live out of water for several days. Some are invasive species, for example, the northern snakehead in the U.S. Polypterids have rudimentary lungs and can also move about on land, though rather clumsily. The mangrove rivulus can survive for months out of water and can move to places like hollow logs.\nSome species of fish can \"walk\" along the sea floor but not on land.  One such animal is the flying gurnard (it does not actually fly, and should not be confused with flying fish). The batfishes of the family Ogcocephalidae (not to be confused with batfish of Ephippidae) are also capable of walking along the sea floor. Bathypterois grallator, also known as a \"tripodfish\", stands on three fins on the bottom of the ocean and hunts for food. The African lungfish (P. annectens) can use its fins to \"walk\" along the bottom of its tank in a manner similar to the way amphibians and land vertebrates use their limbs on land.\nEvolutionary link to land vertebrates\nof Tiktaalik roseae]]\nLand vertebrates originate in the Devonian period and are descended from Sarcopterygian fish. In 2006, a fossil, Tiktaalik roseae, was found which has many features of its wrist, elbow, and neck that resemble those of tetrapods, supporting the idea that it represents a sister group to tetrapods.\nComparison of fish with tetrapod-like features\nA number of fish, both extant and prehistoric, have featured some characteristics related to locomotion that are typical of tetrapods.\n{| class=\"sortable wikitable\" style=\"font-size: 85%; text-align: center; width: auto\"\n! rowspan=\"2\" | Species\n! colspan=\"1\" rowspan=\"2\" | venturing onto land\n! colspan=\"3\" | tetrapod-like spine\n! colspan=\"5\" | tetrapod-like appendages\n! colspan=\"2\" | digit-like bones\n|-\n! 5 axial regions\n! interlocking vertebrae\n! fully ossified vertebrae\n! shoulder & skull separation\n! functional 'intra-fin' joints\n! fins adapted for walking rather than swimming\n! strong & muscled fins\n! humerus, radius & ulna bones\n! differentiated distal radial bones\n! jointed distal radial bones\n|-\n! style=\"text-align:left\" | Panderichthys rhombolepis †\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Sauripterus taylori †\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Tiktaalik roseae †\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Tarrasius problematicus †\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Leptolepis koonwarriensis †\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Eastmanosteus pustulosus †\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Atractosteus spatula\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Periophthalmus barbarus\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Brachionichthys hirsutus\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Ogcocephalus darwini\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Antennarius maculatus\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Protopterus annectens\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Latimeria chalumnae\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Polypterus bichir lapradei\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"text-align:left\" | Chelidonichthys cuculus\n|\n|\n|\n|\n|\n|\n|  (3 rays)\n|\n|\n|  (3 rays)\n|\n|-\n! style=\"text-align:left\" | Hemiscyllium ocellatum\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-class=\"sortbottom\"\n|}\nDarwin fish\nAnother usage of the term walking fish is in reference to the \"Darwin fish\", a bumper sticker parody of the Ichthys, a symbol of Christianity.\nGallery\nFile:Alticus arnoldorum climbing up a vertical piece of Plexiglas - pone.0011197.s009.ogv|Alticus arnoldorum climbing up a vertical piece of Plexiglas\nFile:Hemiscyllium_ocellatum_beach.jpg|An epaulette shark clambering over the sand on a beach\nFile:OgcocephalusParvus.jpg|Ogcocephalus parvus\nSee also\n* Axolotl, colloquially known as a \"walking fish\"; it is not a fish, but a salamander, a type of amphibian.\n* Evolution of fish\nReferences"
    }
  ]
}