{
  "content": [
    {
      "type": "text",
      "text": "# Walking tour\n\nA walking tour usually refers to either:\n# a guided walk around a historical or cultural site, usually in an urban setting, or\n# a long walk over several days in the countryside, also called backpacking.\n, Jordan]]\nHistory\nAn early example of a walking tour was a pilgrimage. This was a religious journey, often taken on foot but sometimes e.g. on horseback, to a location of significance to the walker's faith. Chaucer's 14th-century narrative poem Canterbury Tales depicts such a pilgrimage. People still undertake such journeys, of which the most famous is the Camino de Santiago. Many pilgrimage routes now coincide with long-distance trails. Such trails are a recent form of a walking tour or backpacking.\nOne example is the French GR 65 path, Chemin de Saint-Jacques (in Spanish the Camino de Santiago francés),  an important variant route of the pilgrimage to Santiago de Compostela.\nEarly examples of extended walking tours were undertaken by the Romantic poets, William Wordsworth and John Keats. In 1790 Wordsworth set off on an extended tour of France, Switzerland, and Germany, which he describes  in his autobiographical poem The Prelude'' (1850). In 1798  he walked through Wales and he and Coleridge, in 1799, undertook a three-week tour of the Lake District. John Keats, who belonged to the next generation of Romantic poets began, in June 1818, a walking tour of Scotland, Ireland, and the Lake District with his friend Charles Armitage Brown. Walking tours were popular in the 19th century, and a famous example is Robert Louis Stevenson's Travels with a Donkey (1879). Stevenson also published in 1876 the famous essay \"Walking Tours\". An early American example is naturalist John Muir's A Thousand Mile Walk to the Gulf (1916), which describes a long botanizing walk, undertaken in 1867.\nAnother early type of tour was The Grand Tour, undertaken in Europe in the 17th through 19th centuries, as part of a wealthy young man's education, this involved a lengthy tour of Europe, with visits to cities, historic and cultural sites, which would involve similar walking tours as those undertaken by modern tourists. Modern young people often undertake a similar, though cheaper, form of touring.\nThere are also self-guided tours, which aid travellers by means of books, maps, pamphlets, and audio material.\nTours of cities and cultural sites\nsidewalk. Such glass studs are the remnants of the York Breadcrumbs trail, an initiative from 2005 which incorporated three custom walking tours and (now defunct) website. The tours included the Minster, the Shambles, the Guildhall etc. with a story thrown in.]]\nWith guides\nA walking tour is usually much shorter than an escorted tour, which may last for a week or more. They are led by guides that have knowledge of the places covered on the tour, and their historical, cultural and artistic significance.\nMany walking tours involve a payment to the guide, although some operate on a tip system. The \"pay what you want\" model started around 2004, and can be found in many countries. The UK-based Guild of Registered Tour has criticised the system for not requiring any training or certification of its guides.\nUrban theatre\nSeveral cities now employ dramatic spectacle to add interest to their tours. Usually guided by actors in costume, these walking tours create the feel of living history \"in a non-academic, very accessible fashion.\"\nThese tours are a form of promenade theatre, as well as museum theatre in that it makes use of first person interpretation.\nSee also\n*Audio tour\n*Boston By Foot (Boston, USA)\n*Big Onion Walking Tours (New York City)\n*Caminhada Noturna, São Paulo\n*Heritage trail\n*Hiking\n*Photowalking\n* The Rings of Saturn, a novel by  W. G. Sebald – involves a walking tour of Suffolk.\n*Walking bus\nReferences\nFurther reading\n* MacCannell, Dean. The Ethics of Sightseeing. University of California Press, 2011.\n* Pond, Kathleen Lingle. The Professional Guide: Dynamics of Tour Guiding. New York: Van Nostrand Reinhold, 1993.\n* Ruitenberg, Claudia W. \"Learning by Walking: Non-Formal Education as Curatorial Practice and Intervention in Public Space.\" International Journal of Lifelong Education 31, no. 3 (2012): 261-275.\n* Wynn, Jonathan R. The Tour Guide: Walking and Talking New York. Chicago: The University of Chicago Press, 2011.\n* Wynn, Jonathan R. \"City Tour Guides: Urban Alchemists at Work.\" City & Community 9, no. 2 (June 2010)."
    }
  ]
}