{
  "content": [
    {
      "type": "text",
      "text": "# Walking Thunder\n\nWalking Thunder is a 1994 film starring James Read, John Denver and David Tom and Bart the Bear, written and directed by Craig Clyde. It relates the memoirs of a young boy Jacob McKay who travels with his family on a wagon on their way to California and become stranded in the Rockies. There they learn to survive, adapt to their surroundings and make the most of what they have with the help of a mountain man, an elderly Sioux medicine man and a legendary bear known by the Native Americans as Walking Thunder. The film won a Silver Award at the Worldfest Film Festival. It was released in 1995, but was not widely distributed until 1997.\nPlot\nJacob McKay, a young boy, travels with his parents (John and Emma) and younger brother Toby in a covered wagon en route to California. They become separated from the wagon train and end up stranded in the Rocky Mountains. While they are sleeping, a bear rummages through the wagon, scares off their mules and livestock and scatters their possessions. The wagon's axle is broken and John decides to build a shelter, as it would take too long to fix the axle and winter is near. Jacob and Toby are sent to look for food and eventually reach a lodge owned by Dark Wind, an old Sioux medicine man. Mountain man Abner Murdock, who understands the Sioux language, acts as interpreter between Dark Wind and the kids. Murdock and Dark Wind later share a meal with the McKays, and Dark Wind tells the story of Walking Thunder, a bear with whom he shares a kindred spirit, and who reigned the land in which they live.\nThe family needs supplies to survive the winter, so Jacob is sent with Murdock to procure them from a rendezvous of mountain men which takes place days away. Meanwhile, Jacob's family, aided by Dark Wind, work to build a cabin. Eventually, Walking Thunder appears. Dark Wind utters a chant which seems to appease the bear, who leaves.\nAt the rendezvous, Jacob purchases necessities, and Murdock convinces him to also buy a rifle. Hunter Ansel Richter and his companions, Weasel and Blood Coat, see Jacob spend his money. Thinking that he may be wealthy, they decide to trail Jacob and Murdock, who are returning to the cabin, and steal from them. The trio reaches the cabin first and cases the place to see where the (non-existent) gold is hidden. When they start drinking and becoming unruly, John asks them to leave. Murdock and Jacob arrive later.\nThe next day, John goes out to hunt and gets shot at by Richter and his cohorts. Murdock saves him, helps the McKays build their cabin and leaves, planning to go to Fort Bridger for the winter. Dark Wind blesses the family and gives them tokens of grace. Walking Thunder later appears to Richter, who attempts to shoot him, but a nearby Dark Wind first utters a warning call, and the bear disappears. Frustrated, Richter shoots Dark Wind in the shoulder. Dark Wind returns to the cabin, where Emma tends to his wound. The trio eventually enters the cabin and threatens to kill the McKays unless they surrender their gold. Murdock arrives and says that there is no gold, driving them away. He changed his mind about going to the fort, feeling that he was needed at the cabin.\nMurdock takes John on a hunting trip to obtain meat for the winter. Jacob is left in charge of the cabin. Emma then goes into labor, and Dark Wind, having recovered from his injury, helps deliver the baby girl. Meanwhile, Richter, Weasel and Blood Coat try to hunt down Walking Thunder to obtain his pelt. Weasel wounds the bear. Murdock and Jacob hear the shot and ride up to avert further killing. In the ensuing fight, Weasel and Blood Coat try to take Murdock down. Richter attempts to kill Dark Wind, who is praying in the woods, but Jacob materializes behind him and tells him to put down his gun. Richter takes Jacob's rifle away and pulls out a knife. Walking Thunder then arrives and wounds Richter, scaring him off. John arrives and helps Murdock fight off Weasel and Blood Coat, who also flee.\nYears later, Jacob's grandson Danny McKay reads Jacob's journal. Danny's grandmother then gives him a brand-new journal to write his life events in. Meanwhile, Walking Thunder becomes legend. White men's version says that he died the day that he was shot. According to the Sioux, he was healed by Dark Wind and roamed with him the mountains until the day they were recalled by the spirits to their eternal after-life.\nCast\n* James Read as Abner Murdock\n* John Denver as John McKay\n* David Tom as Jacob McKay\n* Brian Keith as The Narrator\\ Old Jacob McKay\n* Irene Miracle as Emma McKay (as Klara Irene Miracle)\n* Christopher Neame as Ansel Richter\n* Ted Thin Elk as Dark Wind (as Chief Ted Thin Elk)\n* Kevin Conners as Toby McKay\n* Billy Oscar as Weasel\n* Don Shanks as Blood Coat\n* Robert DoQui as Gun Trader\n* K. C. Clyde as Danny McKay (as Kasey Clyde)\n* David Kirk Chambers as Thomas McKay\n* Carolyn Hurlburt as Anne McKay\n* Bart the Bear as Walking Thunder\nReferences"
    }
  ]
}