{
  "content": [
    {
      "type": "text",
      "text": "# Walking catfish__disambig_1\n\n| taxon = Clarias batrachus\n| authority = (Linnaeus, 1758)\n| synonyms =\n}}\nThe walking catfish  (Clarias batrachus) is a species of freshwater airbreathing catfish native to Southeast Asia. It is named for its ability to \"walk\" and wiggle across dry land, to find food or suitable environments. While it does not truly walk as most bipeds or quadrupeds do, it can use its pectoral fins to keep it upright as it makes a wiggling motion with snakelike movements to traverse land. This fish normally lives in slow-moving and often stagnant waters in ponds, swamps, streams, and rivers, as well as in flooded rice paddies, or temporary pools that may dry up. When this happens, its \"walking\" skill allows the fish to move to other aquatic environments. Considerable taxonomic confusion surrounds this species, and it has frequently been confused with other close relatives. One main distinction between the walking catfish and the native North American ictalurid catfish with which it is sometimes confused, is that the walking catfish lacks an adipose fin. It can survive 18 hours out of water.\nCharacteristics and anatomy\nThe walking catfish has an elongated body shape and reaches almost  in length and  in weight. Often covered laterally in small white spots, the body is mainly coloured a gray or grayish brown. This catfish has long-based dorsal and anal fins, as well as several pairs of sensory barbels. The skin is scaleless, but covered with mucus, which protects the fish when it is out of water.\nThis fish needs to be handled carefully when fishing it due to its embedded sting or thornlike defensive mechanism hidden behind its fins (including the middle ones before the tail fin, similar to the majority of all catfishes).\nTaxonomy, distribution, and habitat\nThe walking catfish is a tropical species native to maritime Southeast Asia. The native range of true Clarias batrachus is confirmed only from the Indonesian island of Java, but three closely related and more widespread species frequently have often been confused with this species. These are C. magur of northeast India and Bangladesh, a likely undescribed species from Indochina, and another likely undescribed species from the Thai-Malay Peninsula, Sumatra, and Borneo. Both of these undescribed species have been referred to as, Clarias aff. batrachus. At present, the taxonomic position of the Philippines population (called hito or simply \"catfish\" by the locals) is unclear, and it also is unclear whether South Indian populations are C. magur or another species. As a consequence, much information (behavioral, ecological, related to introduced populations, etc.) listed for C. batrachus, may be for the closely related species that have been confused with true C. batrachus. True C. batrachus, C. magur and the two likely undescribed species are all kept in aquaculture.\nWalking catfish thrive in stagnant, frequently hypoxic waters, and often are found in muddy ponds, canals, ditches, and similar habitats. The species spends most of its time on, or right above, the bottom, with occasional trips to the surface to gulp air.\nDiet\nIn the wild, this creature is omnivorous; it feeds on smaller fish, molluscs, and other invertebrates, as well as detritus and aquatic weeds. It is a voracious eater that consumes food supplies rapidly, so it is considered harmful when invasive.\nAs an invasive species\nWithin Asia, this species has been introduced widely. It has also been introduced outside its native range where it is considered an invasive species. It consumes the food supplies of native fish and preys on their young. It also is regarded as an invasive species because they can destroy fish farms.\nIn the United States, it is established in Florida. It is reported in California, Connecticut, Georgia, Massachusetts, and Nevada.\nThe walking catfish was imported to Florida, reportedly from Thailand, in the early 1960s for the aquaculture trade. The first introductions apparently occurred in the mid-1960s when adult fish imported as brood stock escaped, either from a fish farm in northeastern Broward County or from a truck transporting brood fish between Dade and Broward Counties. Additional introductions in Florida, supposedly purposeful releases, were made by fish farmers in the Tampa Bay area, Hillsborough County in late 1967 or early 1968, after the state banned the importation and possession of walking catfish.\nin Florida.]]\nAquarium releases likely are responsible for introductions in other states. Dill and Cordone (1997) reported this species has been sold by tropical fish dealers in California for some time. They also have been spotted occasionally in the Midwest.\nIn Florida, walking catfish are known to have invaded aquaculture farms, entering ponds where they prey on agricultural fish stocks. In response, fish farmers have had to erect fences to protect ponds. Authorities have also created laws that ban possession of walking catfish.\nIn 2017, Clarias spp. were recovered from the River Tonge, near Bolton, Northern England.\nAs food\n, East Java]]\nIn Indonesia, it is commonly referred to as lele, or when needing distinction; lele jawa or lele kampung, compared to lele dumbo or lele sangkuriang which refers to the introduced C. gariepinus. It is the main ingredient in several traditional dishes, such as pecel lele and mangut lele.\nIn Thailand, Clarias aff. batrachus is known as pla duk dan (). It is a common, inexpensive food item, prepared in a variety of ways. It is often offered by street vendors, especially grilled or fried.\nThis fish is also one of the most common freshwater catfish in the Philippines, which as aforementioned is known as hito in the local language. Despite this, current evidence of Clarias aff. batrachus populations from other regions of southeast Asia and India in relation towards C. batrachus have not been thoroughly studied.\nAquarium\nA white or calico color pattern is commonly seen in the aquarium fish trade. However, this color variation also is prohibited where walking catfish are banned. Very well-rooted plants and large structures that provide some shade should be included in an aquarium with these fish. Any small tankmates will be eaten by this fish.\nSee also\n*Eel catfish\n*List of freshwater aquarium fish species\n*List of invasive species in the Everglades\n*Clarias magur\n*Clarias macrocephalus\nReferences\nExternal links\n* [http://www.catfish-and-more.com/ Ros, Wolfgang] [http://www.datz.de/L0lNR19aT09NP0ZJRD00NDM4MDcmQUlEPTQ0MzgxMCZQQ01EPX4wOTQxNDk0NDNEMzQzNDMzMzgzMTMwMjY0RDQ5NDQzRDM2MzAzOTM1MzcmTUlEPTYwOTU3.html?UID=E3E4D6B16D7A88E02BA61FB6B737C8F87754085F7D27A251ED (2004): \"Clarias batrachus - Erfolgreiche Froschwels-Nachzucht im Aquarium\"] , Datz 57 (7): 12–15.\n* [http://www.catfish-and-more.com/ Ros, Wolfgang] [http://www.datz.de/QUlEPTQ0NTEwOSZNSUQ9NjA5NTc.html (2006): \"Clarias batrachus - Auslösen der Fortpflanzung bei Froschwelsen\"] , Datz 59 (4): 33–37."
    }
  ]
}