{
  "content": [
    {
      "type": "text",
      "text": "# Walking on Air (Kerli song)__disambig_2\n\nLove Is Dead\n| released   = April 8, 2008\n| recorded   = 2007\n| studio     =\n| venue      =\n| genre      = Alt-pop\n| length     = |3:47 }}\n| label      = Island\n| writer     =\n| producer   = Lester Mendez\n| prev_title = Beautiful Inside\n| prev_year  = 2004\n| next_title = The Creationist\n| next_year  = 2009\n}}\n\"Walking on Air\" is a song performed by Estonian singer Kerli. It is the first official single from her debut album, Love Is Dead (2008). It was originally featured on her now out of print self-titled EP (2007). Kerli wrote the song with Lester Mendez, who also produced it. It's about \"following your dreams and just going with the flow.\"\n\"Walking on Air\" was featured twice on the United States dance competition So You Think You Can Dance (season 5 and season 6). The song was also featured on a season 16 episode of the U.S. dance competition series Dancing with the Stars on May 7, 2013. The song and parts of the music video were featured in a promo for the television series Fringe. It was also iTunes' \"Free Single of the Week\" for the week of July 21, 2008. It was downloaded more than 550,000 times during its promotion week, and is the largest \"Free Single of the Week\" download total in iTunes history. The song had received mixed to positive reviews from music critics who praised the storyline of the song.\nThe music video, directed by Alex Topaller and Dan Shapiro (the team known as \"Aggressive\"), debuted on May 19, 2008. As of March 29, 2012, it has remained in the iTunes Top 200 Alternative Music Video charts since its release. The video features an inverted house theme where everything is opposite of what it is supposed to normally be.\nAn EP containing five remixes of \"Walking on Air\" was released on October 14, 2008. It contains remixes by Ralphi Rosario, Armin van Buuren and Josh Harris.\nComposition\nKerli claims when she was younger, her mother would tell her a story: \"In the black, black world there was a black, black town and in the black, black town there was a black, black house and in the black, black house there was a black, black cupboard and in the black, black cupboard there was a white box.\"  This is the inspiration for the verse in the song.\nThe song in general is about \"following your dreams and just going with the flow\" and a \"little creepy girl that comes from a little creepy place and she has her big dream and she loves music, but nobody believes in her.\" The specific details in the song, such as \"cats and hats and rocking chairs\" are based on Kerli childhood when she would frequently wear older hats.\nMusic video\nProduction\nKerli had created \"Book of Kerli\": a book of pictures that she had collected over the years of how she wanted the video and herself in the video to appear. The music video is directed by Alex Topaller and Dan Shapiro (the team known as \"Aggressive\"). It premiered on May 19, 2008 on MTV's website.\nSynopsis\nThe video beings with a man dropping off a gift box on a doorstep. After he leaves, Kerli opens the box and finds a ball-jointed doll (painted by artist Lisa Jameson aka Pepstar). After re-entering the house, Kerli turns on the TV which shows a close-up image of an eye staring around the room. She then lights a match and throws it in the fireplace when it then begins to grow lotuses. Next, she activates the ceiling fan which precedes to spin the room around as she begins to dance.\nIn the next scene, Kerli is in a kitchen where the walls are an open wintry forest and Kerli appears in a more sexualized black outfit. The windows are brick walls and snow is spewing out of an umbrella. She opens the oven which is an extremely cold freezer where a chicken is \"roasting\". She then takes the chicken and places it in the fridge which is full of flames.\nIn the music video, Kerli lies on a bed of stones. The filming of this scene took around thirty minutes and Kerli said the stones, \"fetish shoes\", latex [[duct tape and her large skirt was uncomfortable and made it feel like torture.]]\nNext, Kerli is now in her bedroom lying on a bed of stones when she starts to cry (although the tears come from the Moonstones under her eyes) and her tears float up and transform into butterflies. Another scene is shown where Kerli is with a bird in a cage and the bird is sitting upside down on a perch. Returning to the bedroom scene, the man has returned and appears to be on the opposite side of her mirror as he pounds on it and instructs her to join him. Next, the ball-jointed doll from before is now a full-sized woman and is controlling the strings of Kerli who is now a marionette. After the Kerli marionette sings the bridge, she is placed in a box where the puppeteer ball-jointed doll cuts the strings and the bricks in the windows are briefly shown collapsing.\nIn the final scene, Kerli wakes up to discover a cut string attached to her arm. She proceeds to stare at the camera which pans out to reveal Kerli is now in the gift box from before and the full-sized, ball-jointed doll is holding it rocking on a rocking chair.\nConcept\nKerli describes the video as being a \"dark\" Alice in Wonderland. The eye in the TV represents the \"all-seeing eye\" of God. It is also part of the \"inverted house\" theme, where the TV is watching her rather than her watching the TV. The lotus is the only flower that is able to grow in the mud and \"the thicker the mud, the more beautiful the flower is going to be\". The lotuses symbolize overcoming obstacles as do the act of Kerli's tears floating off and transforming into butterflies. The wallpaper is an Estonian forest. Kerli used this because her last name, \"Kõiv\" means \"birch\" in Estonian and because it also represents oppression.\nKerli based her \"clock dress\" on an image she saw on the internet and represents her love for numbers and their messy layout \"pisses on the concept of time\". Kerli describes her shoes as \"fetish shoes\".\nReception\nThe video became the number one music video on AOL for the weeks of July 16, 2008 and July 23. As of February 2024, the video has over 19,000,000 views on Vevo's YouTube channel.\nLive performances\nAmong other performances, in 2008 Kerli performed \"Walking on Air\" at the Greek Theatre on October 22 at the Scream Awards. and in 2009 at The Dome in Munich, Germany on May 22 and at the Estonian festival Õllesummer on July 19 in Tallinn.\nTrack listings and formats\n* CD promo\n# Walking on Air (Radio Edit) – 3:47\n# Walking on Air (LP Version) – 4:26\n* Digital download\n# Walking on Air (Radio Edit) – 3:47\n* 12\" vinyl promo\n# Walking on Air (Radio Edit) – 3:47\n# Walking on Air (Armin van Buuren Club Mix) – 7:43\n# Walking on Air (Lindbergh Palace Full Mix) – 6:23\n# Walking on Air (Ralphi Rosario and Craig J Club Mix) – 9:46\n# Walking on Air (Josh Harris Club Mix) – 8:06\n* CD single / digital download single\n# Walking on Air (Radio Edit) – 3:49\n# Walking on Air (Armin van Buuren Radio Edit) – 3:23\n*Remix EP\n# Walking on Air (Ralphi Rosario and Craig J Club Mix) – 9:46\n# Walking on Air (Josh Harris Club Mix) – 8:06\n# Walking on Air (Lindbergh Palace Full Mix) – 6:23\n# Walking on Air (Armin van Buuren Club Mix) – 7:43\n# Walking on Air (Ralphi Rosario Big Dub) – 9:32\nCharts\n{| class=\"wikitable sortable\"\n|-\n!align=\"left\"|Chart (2008)\n! style=\"text-align:center;\"|Peakposition\n|-\n|Austria (Ö3 Austria Top 40)\n| style=\"text-align:center;\"|35\n|-\n|Belgian Flanders (Ultratop)\n| style=\"text-align:center;\"|33\n|-\n|Belgian Wallonia (Ultratop)\n| style=\"text-align:center;\"|31\n|-\n|European Hot 100 Singles\n| style=\"text-align:center;\"|45\n|-\n|Germany (Media Control Charts)\n| style=\"text-align:center;\"|25\n|-\n|Italy (FIMI)\n| style=\"text-align:center;\"|20\n|-\n|Switzerland (Swiss Music Charts)\n| style=\"text-align:center;\"|37\n|}\nRelease history\n{|class=\"wikitable\"\n|-\n! Region\n! Date\n! Format\n|-\n| rowspan=\"2\"|United States\n| April 8, 2008\n| Digital download\n|-\n| October 14, 2008\n| Remixes EP\n|}\nReferences\nExternal links\n* [http://www.kerlimusic.com Kerli's official website]\n* [https://www.youtube.com/watch?v=wXMeZwO2qZ0 \"Walking on Air\" music video] at YouTube"
    }
  ]
}