{
  "content": [
    {
      "type": "text",
      "text": "# Walking vehicle\n\n, on display at the U.S. Army Transportation Museum]]\nA walking vehicle is a vehicle that moves on legs rather than wheels or tracks. Walking vehicles have been constructed with anywhere from one to more than eight legs. There are many designs for the leg mechanisms of walking machines that provide foot trajectories with different properties.\nWalking vehicles are classified according to the number of legs. Common configurations are one leg (pogo stick, monopod, unipod, or \"hopper\"), two legs (biped or bipod), four legs (quadruped), and six legs (hexapod). There are a few prototypes of walking vehicles. Currently almost all of these are experimental or proof of concept.\nMobility\nWalking vehicles can provide greater ground clearance than wheeled or tracked vehicles, but the complexity of their leg mechanisms has limited their use.  Examples of manned walking vehicles include General Electric's Walking truck, the University of Duisburg-Essen's ALDURO. Timberjack, a subsidiary of John Deere, built a practical hexapod Walking Forest Machine (harvester). Walking vehicles are also being explored for agricultural and forestry applications, where their ability to traverse rough or sensitive terrain can reduce soil compaction compared to wheeled machines, improving sustainability in field operations.\nOne of the most sophisticated real-world walking vehicles is the Martin Montensano-built 'Walking Beast', a 7-ton quadrapod experimental vehicle suspended by four hydraulic binary-configuration limbs with much greater dexterity.\nExamples\nWalking dragline excavators\nDragline excavators are extremely large and heavy machines used in mining and civil engineering since the 1920s that have used mechanical \"walking\" for locomotion. Typically, they use a three-legged gait: in each step, a pair of elongated \"feet\" lift the excavator together with its base and put it back down a short distance forward. Turning is achieved by lifting both \"feet\" off the ground and pivoting on top of the base in the desired direction.\nBig Muskie (1969, 12000 t) was the largest dragline excavator, and thus the largest walking machine ever built.\nLegged robots\nThe landers of the Mars 2 and Mars 3 probes carried small tethered \"rovers\" that were intended to shuffle on the Martian surface on a pair of skids, similar to a walking dragline excavator. Both landers failed, so the rovers were never deployed on Mars.\nHonda has developed a number of humanoid robots that use a bipedal gait, starting with the experimental E series in the mid-1980s and culminating with the autonomous ASIMO, introduced in 2000. ASIMO has inspired a number of similar bipedal toy robots.\nBoston Dynamics develops complex walking robots that are capable of moving over rough terrain and avoiding obstacles. The quadruped BigDog was designed for potential military applications.\nTraddino, a quadrupedal animatronic dragon created for a German festival, was recognized by the Guinness Book of World Records as the \"World's biggest walking robot\". It is operated by remote control rather than a pilot.\nKinetic sculptures\nDutch artist Theo Jansen has created many walking machines called strandbeest that wander on Dutch beaches.\nAnthropomorphic vehicles\nAt the end of 2016, Korea Future Technology built a prototype of a robot called METHOD-1, that could qualify as a mecha. The robot could walk, and its driver could control the robot's arms individually.\nIn media\nWalking vehicles have appeared frequently in popular culture and speculative design, often symbolizing the intersection of human and machine control in science fiction.\nThe concept features prominently in the Metal Gear video game franchise, in which the titular Metal Gear is a bipedal nuclear-armed tank. Creator Hideo Kojima has said the design reflects Cold War-era fears of automated warfare and draws inspiration from early robotics experiments.\nIn the Star Wars franchise, walking vehicles such as the Imperial AT-AT (All Terrain Armored Transport) and AT-ST (All Terrain Scout Transport) were designed by Industrial Light & Magic to convey mechanical power and cold efficiency. ILM modelmaker Joe Johnston cited industrial cranes and early walking excavator patents as reference material.\nIn James Cameron's Avatar (2009), the RDA's AMP suits function as powered exoskeletons and walking combat vehicles. Cameron described them as “a logical military evolution of loader exosuits,” referencing the Power Loader from Aliens (1986) and real-world robotics prototypes.\nThe Pacific Rim films (2013–2018) portray giant piloted robots called Jaegers, combining traits of walking vehicles and humanoid mecha. Director Guillermo del Toro noted that the production team studied hydraulic cranes, legged robot locomotion, and anime influences when designing realistic gait and weight.\nIn the Horizon Zero Dawn and Horizon Forbidden West video games, large animal-inspired robotic creatures employ multi-legged movement influenced by Boston Dynamics' real-world robotics. Game artists cited quadruped gait studies and NASA rover kinematics as direct design references.\nLegged vehicles and mecha continue to appear in Japanese anime such as Mobile Suit Gundam, Patlabor, and Ghost in the Shell, which collectively popularized the term mecha and influenced Western interpretations of walking vehicles in both fiction and real-world robotics.\nSee also\n* Legged robot\n* Mecha\n* Powered exoskeleton\nReferences"
    }
  ]
}