{
  "content": [
    {
      "type": "text",
      "text": "# Walking Artists Network\n\nThe Walking Artists Network (WAN) is an international network dedicated to walking as a critical and artistic practice. It reflects an increased interest in walking art and the growth of the field. Based at the University of East London, it has over 700 members from across the globe (though the majority of members are based in the United Kingdom). The network maintains an active email discussion community through JISCmail.\nFounding\nIn late 2007 a small group of artists in central London invited ‘all those who are interested in walking as a critical spatial practice’ to its attend the first meeting of the WAN. It was further developed when Clare Qualmann and Mark Hunter successfully bid for Arts and Humanities Research Council funding in 2011. This facilitated the international development of the network and allowed it to expand membership, develop a website and fund the Footwork research group.:80\nActivities\nThe Walking Artists Network works 'on the basis of events that having walking at their core (rather than arranging things at which people sit and listen to talking about walking)'.:80 This has resulted in 'a variety of walking based initiatives' that bring 'people together to walk'.:80\nStep by Step (2014-2017)\nStep by Step was an interdisciplinary seminar series at the University of East London, organized by Clare Qualmann and Blake Morris. It brought together artists and academics whose work engaged with the practice of walking, including Kubra Khademi, Anna Minton and Sara Wookey.:80\nWalking Encyclopaedia (2014)\nIn 2014, the Walking Artists Network collaborated with Airspace Gallery in Stoke-on-Trent to produce The Walking Encyclopaedia (2014), a gallery exhibition and online archive of walking practices that includes more than 150 walking practitioners and artworks.\nWays to Wander (2015)\nIn 2015 Triarchy Press published Ways to Wander,  a collection of walk suggestions, experiences, techniques and case studies by members of the Walking Artists' Network. The book was an 'output of the AHRC funded 'Footwork' project, and edited by Qualmann and Claire Hind.\nWALKING WOMEN (2016)\nIn 2016 Qualmann and Amy Sharrocks curated WALKING WOMEN, 'a series of walks talks and workshops  that featured  over forty women artists working with walking in a variety of media.':80 The event featured two programmes of work at Somerset House, London and Forest Fringe, Edinburgh.\nArtists presenting their work included Jennie Savage, Sharrocks, Deirdre Heddon, Kubra Khademi, Louise Ann Wilson, Rosana Cade, The Walking Reading Group on Participation, Monique Besten and Alison Lloyd. The Live Art Development Agency published a guide to WALKING WOMEN following the events. A radio programme featuring artists involved in the programme was broadcast on Resonance FM in July 2016.\nReferences\nFurther reading\n* Hind, Claire and Clare Qualmann. Ways to Wander: 54 intriguing ideas for different ways to take a walk. Axminster: Triarchy Press, 2015.\n* Morris, Blake. Walking Networks: The Development of an Artistic Medium. London: Rowman and Littlefield International, 2020.\n* Smith, Phil. ''Walking's New Movement''. Axminster: Triarchy Press, 2015.\nExternal links\n* [https://www.walkingartistsnetwork.org Walking Artists Network website]\n*[http://www.walkingartistsnetwork.org/step-by-step-seminar-series/ Step by Step Seminar Series]\n*[http://www.airspacegallery.org/index.php/projects/the_walking_encyclopaedia_incl._paths_of_variable_resistance Walking Encyclopaedia]\n*[https://forestfringe.co.uk/ Forest Fringe]\n*[http://www.triarchypress.net/waystowander.html Ways to Wander]\n*[https://www.jiscmail.ac.uk/WAN Walking Artists Network JISCMail]"
    }
  ]
}