{
  "content": [
    {
      "type": "text",
      "text": "# Walking in London\n\nin central London]]\n]]\nWalking is a popular recreational activity in London, despite traffic congestion. There are many streets that provide interesting walks, especially within historic central London. In addition there are attractive commons, parks, canals, and disused railway tracks that provide space for walks. This includes Wimbledon Common, Epping Forest, Hampstead Heath, and the eight Royal Parks: Hyde Park, Regent's Park, Richmond Park, etc. In recent years access to canals and rivers, including the Regent's Canal, and the River Thames has been greatly improved, and as well a number of long-distance walking routes have been created that link green spaces.\nStreets\n, Bloomsbury, London. Such London squares are important green oasis in Central London.]]\nLiterary walkers\nThere have been a number of writers who have written about their experiences of walking the streets of London, including Charles Dickens, in his essay \"Night Walks\", Henry James, in \"London\", and Virginia Woolf in \"Street Haunting: A London Adventure\" (1930).\nE. M. Forster wrote about walking in London in his essay \"London is a Muddle\", commenting that he \"used to loathe London when I was young\". However, according to Anthony Lake, by 1937, when he wrote this essay, \"he had found a way of liking it, and he had done that by walking around it\". It was \"idyllic corners of parks and spots of green within the metropolis\" that were important for him, where \"the rural world has re-asserted itself\".\nJohn Gay's 1716 satirical poem \"Trivia, or The Art of Walking the Streets of London\" describes the perils of walking London's streets at that time. It takes its name from the \"Goddess of crossroads\", Diana Trivia.\nLondon Living Streets\nLondon Living Streets is a charity \"dedicated to making London one of the world's best cities for walking and enjoying streets and public spaces – a city that is genuinely inclusive of all its residents, workers and visitors and not just designed for car users\". It has created [https://www.google.com/maps/d/viewer?mid=1djPyfTHyWyHfqVNNIqStpRbvXZ7yabk0&ll=51.50909466664297%2C-0.10753356779592771&z=14 Footways], a network of quiet and interesting streets for walking in central London.\nGuided walks\ngarden. The Inns of Court and their gardens are a quiet, attractive historic area that are open to the public to some extent.]]\nSeveral companies provide guided walking tours around parts of London. These walks are aimed primarily at tourists and the guide will often be an expert in a particular area. Such walks are often themed, such as 'Haunted London' or 'London of Jack the Ripper'. It is also possible to download a tourist guide of London onto an MP3 player or use mobile phone-based services.\nA number of organisations also offer self-guided walks, including the London Gardens Trust's \"A walk through the City of London\", and a variety listed by the Ramblers' Inner London Group.\nJubilee Walkway\nmarker]]\nJubilee Walkway is a  way marked route through the streets of central London. Originally called the Silver Jubilee Walkway, and laid down in 1977 as part of the celebrations of the Silver Jubilee of Elizabeth II, the route takes in many of London's major attractions, including the Houses of Parliament, St Paul's Cathedral, Tate Modern and the Tower of London.\nRights of way\nDefinitive maps of public rights of way have been compiled for all of England and Wales as a result of the Countryside and Rights of Way Act 2000, except the 12 Inner London boroughs, which, along with the City of London, were not covered by the Act.\nTo protect the existing rights of way in London the Ramblers launched their \"Putting London on the Map\" in 2010 with the aim of getting \"the same legal protection for paths in the capital as already exists for footpaths elsewhere in England and Wales. Currently, legislation allows the Inner London boroughs to choose to produce definitive maps if they wish, but none do so\".\nThe launch event of \"Putting London on the Map\" took place at the British Library, and since then 'the Inner London Area of the Ramblers has been working with Ramblers Central Office staff to try to persuade each of the Inner London boroughs on the desirability of producing definitive maps of rights of way\".\nIn 2011 Lambeth Council passed a resolution to work towards creating a definitive map for the borough, but this does not yet exist. The City of London has produced a Public Access Map. Definitive maps exists for the Outer London boroughs.\nUrban footpath: the alley\nOne of the most common rights of way in Inner London is the alley. These urban footpaths generally have a long history and are also found in Outer London. One example, in an old neighbourhood of the City of London, Exchange Alley or Change Alley' is a narrow alleyway connecting shops and coffeehouses. It served as a convenient shortcut from the Royal Exchange on Cornhill to the Post Office on Lombard Street and remains as one of a number of alleys linking the two streets. The coffeehouses of Exchange Alley, especially Jonathan's and Garraway's, became an early venue for the lively trading of shares and commodities. These activities were the progenitor of the modern London Stock Exchange.\nWest of the City there are a number of alleys just north of Trafalgar Square, including Brydges Place, which is situated right next to the Coliseum Theatre and just 15 inches wide at its narrowest point, only one person can walk down it at a time. It is the narrowest alley in London and runs for , connecting St Martin's Lane with Bedfordbury in Covent Garden.\nAn alley in London can also be called a passage, court, place, lane, and less commonly path, arcade, walk, steps, yard, terrace, and close. While both a court and close are usually defined as blind alleys, or cul-de-sacs, several in London are throughways, for example Cavendish Court, a narrow passage leading from Houndsditch into Devonshire Square, and Angel Court, which links King Street and Pall Mall. Bartholomew Close is a narrow winding lane which can be called an alley by virtue of its narrowness, and because through-access requires the use of passages and courts between Little Britain, and Long Lane and Aldersgate Street. While both a court and close are usually defined as blind alleys, or cul-de-sacs, several in London are throughways, for example Cavendish Court, a narrow passage leading from Houndsditch into Devonshire Square, and Angel Court, which links King Street and Pall Mall. Bartholomew Close is a narrow winding lane which can be called an alley by virtue of its narrowness, and because through-access requires the use of passages and courts between Little Britain, and Long Lane and Aldersgate Street.\nWaymarked routes\nSome designated way marked routes:\nCapital Ring\nA  circular route with 15 sections and a radius of approximately  from Charing Cross, that passes through green areas of urban and suburban London. The route forms a complete circuit, crossing the River Thames twice and with a notional starting point of Woolwich.\nGreen Chain Walk\nThe South East London Green Chain, also known as the Green Chain Walk, is a linked system of open spaces between the River Thames and Crystal Palace Park. In 1977 four London Boroughs and the Greater London Council created this Green Chain of 300 open spaces to protect them from building activity. The four London boroughs are Bexley, Bromley, Lewisham and Greenwich. Many parts of the system are also part of the Capital Ring route. The system begins at three places on the River Thames: the Thames Barrier, Thamesmead, and the riverside at Erith. There are various circular walks along the route, with an offshoot from the main route to Chislehurst, and the final section reaches Crystal Palace via Bromley.\nLondon Outer Orbital Path (\"Loop\")\nA  circular signed walk, in 24 sections, along public footpaths, and through parks, woods and fields around the edge of Outer London. The route does not form a complete circle because the Thames cannot be a crossed between Purfleet and Erith.\nDollis Valley Walk\nThe Dollis Valley Greenwalk (or Green Walk) is a footpath route in the London Borough of Barnet between Moat Mount Nature Reserve in Mill Hill and Hampstead Heath. The route links the Capital Ring and the London Loop,\nand the many green spaces and wildlife corridors along the way. It is approximately  long. It mainly follows the Dollis Brook, and is one of many parks and open spaces in Barnet.\nLea Valley Walk\nThe Lea Valley Walk starts outside Greater London but has around  within its boundary. The route follows the River Lea and the Lee Navigation for , from Leagrave, the source of the River Lea near Luton, to the Thames, at Limehouse Basin, Limehouse, east London.\nThe path runs through the Lee Valley Regional Park, a ,  long linear park, much of it green spaces, running through the northeast of Greater London, Essex and Hertfordshire from the River Thames to Ware, through areas such as Stratford, Hackney, Tottenham, Enfield, Walthamstow, Cheshunt, Broxbourne and Hoddesdon in an area generally known as the Lea Valley. Greater London's largest park, the Lee Valley Park is more than four times the size of Richmond Park.\nThe Greenway\nA walking and cycle path has been created on the land above the eastern end of the Northern Outfall Sewer, from Hackney Wick to Beckton, Poplar,\nrunning some , with access points along its length. Walk 14 of the Capital Ring follows the Greenway for most of its distance.\nThe Ridgeway\nA walking and cycle path has been created on the land above the Southern Outfall Sewer, from Plumstead railway station to Crossness Sewage Treatment works and the River Thames path, running some 3.5 miles, with access points along its length.\nDiana, Princess of Wales Memorial Walk\nThe Diana, Princess of Wales Memorial Walk is a  circular walking trail in London, England, dedicated to the memory of Diana, Princess of Wales. It goes between Kensington Gardens, Green Park, Hyde Park and St James's Park in a figure-eight pattern, passing five sites that are associated with her life: Kensington Palace, Spencer House, Buckingham Palace, St. James's Palace, and Clarence House. It is marked with eighty-nine individual plaques and has been described as \"one of the most magnificent urban parkland walks in the world.\"\nParkland Walk\nThe Parkland Walk is a  linear green walkway in London which follows the course of the railway line that used to run between Finsbury Park and Alexandra Palace, through Stroud Green, Crouch End, Highgate and Muswell Hill, mostly in Haringey. Because it avoids the closed surface section of Highgate station and its adjoining tunnels, which are closed to walkers for safety reasons, there are in fact two separate sections to this walk. It is located near Hampstead Heath and is a local nature reserve. Between Finsbury Park and Highgate, the path forms part of the Capital Ring.\nWaterside trails\nThe Beverley Brook Walk\nThe Beverley Brook Walk is a walking route in the south-western suburbs of London, England. It is  long, of which the last  follows the lower reaches of the Beverley Brook, a tributary of the River Thames. It starts at New Malden railway station and ends to the north of the Putney Embankment at Barn Elms, having passed through the green spaces of Wimbledon Common, Richmond Park, Barnes Common and Putney Lower Common on its route.\nThe Thames Path\nThe Thames Path is a National Trail that follows the length of the River Thames for , from its source near Kemble, Gloucestershire, to the Thames Barrier at Charlton, London. From Richmond to the Thames Barrier, some 28&nbsp;mi or 45&nbsp;km, it is within Greater London, passing Kew Gardens and the Wetlands Centre at Barnes and continuing through central London beside the river. Through most of the London section, the Thames Path is actually two paths, one on either side of the river downstream of Teddington lock. Many bridges link the banks, including the Millennium and the Golden Jubilee footbridges.\nRiver Wandle Trail\nThe Wandle Trail is an urban walking and cycling trail in south London that follows the River Wandle from East Croydon Station for about  to the Thames near Wandsworth Town Station. It passes through the London boroughs of Croydon, Sutton, Merton and Wandsworth\n, London Borough of Enfield ]]\nLondon canal towpaths\nLondon's canal towpaths provide numerous walking routes and connect many of the capital's famous green spaces, including from Regent's Park to Victoria Park (and then to the River Thames) and from the Lee Valley Regional Park in the east to the Colne Valley Regional Park in the west. The towpaths of the Grand Union Canal with its Paddington and Slough Arms, the Regent's Canal, Hertford Union Canal, Lee Navigation and Limehouse Cut can also be followed.\nThe New River Path\nThe New River Path is a  long-distance footpath which follows the course of the New River from its source in Hertfordshire to its original end in Islington, London. The path is waymarked throughout its length and all signs display the NR logo.\nCompleted in 1613, the water supply aqueduct supplies water from Hertfordshire to North London. Since 1992, Thames Water, with the co-operation of local people and partners and at the cost of over £2 million, have created the path.\nThe walk can be split into the following three sections.\n* Hertfordshire: . The path begins at New Gauge House, near Ware.\n* London: (1) . After passing under the M25 the path passes through a range of different scenery from built-up urban area corridor to more open aspects and through four London boroughs; Enfield, Haringey, Hackney and Islington.\n* London: (2) (Heritage section) . The path runs through open spaces and inner-city streets and follows the now truncated route of the river to its culmination at New River Head, near Clerkenwell, Islington.\nWaterlink Way\nThe Waterlink Way is a cycling and walking route in south-east London, following the River Ravensbourne (Deptford Creek)  through Greenwich, Lewisham and Bromley boroughs. It is part of Sustrans' National Cycle Network (NCN21). Signs are marked with a 'WW' symbol.\nShuttle Riverway\nA waymarked walk in south-east London, following the River Shuttle \"for its entire length of five miles (about 8 km)\" from Avery Park in Greenwich through Bexley to Hall Place Gardens.\nLondon's open spaces\nLondon's parks, heaths, and commons are crossed by numerous footpaths, both paved and unpaved, that provide walks of various lengths. There are often adjacent walking routes, whether in another park, along a canal towpath, or along the River Thames Path.\nRoyal Parks\nfrom St James's Park ]]\nWith increasing urbanisation of London, some of these were preserved as freely accessible open space and became public parks with the introduction of the Crown Lands Act 1851. There are today eight parks formally described by this name and they cover almost  of land in Greater London. Hampton Court Park is also a Royal Park, but because it is the site of a Palace, this park is managed by the Historic Royal Palaces.\nHyde Park and Kensington Gardens (which are adjacent), Green Park, Regent's Park and St James's Park are the largest green spaces in Central London. Bushy Park, Greenwich Park and Richmond Park are in suburban Outer London.\nHyde Park\nHyde Park is one of the largest parks in London. It is divided in two by the Serpentine and the Long Water. The park is contiguous with Kensington Gardens; although often still assumed to be part of Hyde Park, Kensington Gardens has been technically separate since 1728, when Queen Caroline made a division between the two. Hyde Park covers  and Kensington Gardens covers , giving an overall area of .\nHyde Park is the largest of four parks which form a chain from the entrance of Kensington Palace through Kensington Gardens and Hyde Park, via Hyde Park Corner and Green Park (19 hectares), past the main entrance to Buckingham Palace and then on through St James's Park (23 hectares) to Horse Guards Parade in Whitehall.\nand Kensington Gardens in winter]]\nKensington Gardens\nKensington Gardens are generally regarded as being the western extent of the neighbouring Hyde Park from which they were originally taken, with West Carriage Drive (The Ring) and the Serpentine Bridge forming the boundary between them. The Gardens are fenced and more formal than Hyde Park. Kensington Gardens are open only during the hours of daylight, whereas Hyde Park is open from 5 am until midnight all year round.\nThe park covers an area of . The open spaces of Kensington Gardens, Hyde Park, Green Park and St James's Park together form an almost continuous \"green lung\" in the heart of London between Kensington and Westminster.\nGreen Park\nGreen Park in the City of Westminster, Central London, one of the Royal Parks of London, covers , and is between Hyde Park and St. James's Park. Together with Kensington Gardens and the gardens of Buckingham Palace, these parks form an almost unbroken stretch of open land reaching from Whitehall and Victoria station to Kensington and Notting Hill.\n, Bushy Park ]]\nRegent's Park\nRunning through the northern end of the park is Regent's Canal, which connects the Grand Union Canal to the Limehouse Basin and the River Thames. On the northern side of the Park is Primrose Hill, which, with a height of , gives a clear view of Central London to the southeast, as well as Belsize Park and Hampstead to the north.\nRichmond Park\nRichmond Park is the second largest park in London (after the  Lee Valley Park. But it is also smaller than Epping Forest), measuring 3.69 square miles (955 hectares or 2,360 acres), it is comparable in size to Paris's Bois de Vincennes (995 ha or 2,458 ac) and Bois de Boulogne (846 ha or 2,090 ac).\nThere are various trails that are suitable for walking, including the Tamsin Trail, a  long perimeter track around the Park. The park is adjacent to the River Thames Path, and close to other open spaces, like Bushy Park and Hampton Court Park. Walk 6 of the Capital Ring leads from Wimbledon Common to Richmond Park.\nRichmond Park is a national nature reserve, a Site of Special Scientific Interest and a Special Area of Conservation in south-west London. The largest of London's Royal Parks, it is included, at Grade I, on English Heritage's Register of Historic Parks and Gardens of special historic interest in England.  It was created by Charles I in 1634 as a deer park and now has 630 red and fallow deer.\nBushy Park\nBushy Park in the London Borough of Richmond upon Thames is the second largest of London's Royal Parks, at  in area. The park, most of which is open to the public, is immediately north of Hampton Court Palace and Hampton Court Park and is a few minutes walk from the north side of Kingston Bridge. Kingston Bridge is on the route of the Thames Path and is the end point for the Thames Down Link long-distance footpath from the North Downs Way near Box Hill & Westhumble station, Surrey.\nGreenwich Park\nGreenwich Park is a former hunting park in Greenwich and one of the largest single green spaces in South East London. One of the Royal Parks of London, and the first to be enclosed (in 1433), it covers , and is part of the Greenwich World Heritage Site. It commands fine views over the River Thames, the Isle of Dogs and City of London. The Park is open from 06:00 for pedestrians (and 07:00 for traffic) all year round and closes at dusk. The Park is adjacent to Blackheath and to the Thames Path.\n]]\nBlackheath, Greenwich\nBlackheath is one of the largest areas of common land in Greater London, with  of protected commons. The heath is jointly managed by Lewisham and Greenwich Borough Councils. Highlights on the Greenwich side include the Long Pond (also known as Folly Pond), located close to the entrance of Greenwich Park. On the Lewisham side, there are three ponds, with Hare and Billet pond considered to be the most natural and probably the best wildlife habitat.\nHampton Court Park\nHampton Court Park – sometimes called the Home Park – is adjacent to Hampton Court Palace and Gardens in southwest London, mostly lying within East Molesey, with a smaller area in Kingston upon Thames. Hampton Court Park is also a royal park, but, because it contains a palace, it is administered by the Historic Royal Palaces, unlike the eight Royal Parks.\nIt is a walled deer park of around  in area and has been open to the public since 1894. The A308 road and River Thames form its boundaries. North of the A308 is Bushy Park. It is also close to Richmond Park, across the Thames. One of the main features of the park is the Long Water, which runs roughly eastward from the back of Hampton Court Palace.\nWimbledon Common\n]]\nWimbledon Common is a large open space in Wimbledon, south-west London, totalling . There are a number of footpaths, along with a variety of walks, including the  Wimbledon Path. Walk 6 of the Capital Ring crosses the Common and continues on to Richmond Park.\nWimbledon Common is managed, along with Putney Heath, and Putney Lower Common, under the Wimbledon and Putney Commons Act of 1871. Putney Lower Common is separated from the rest of the Common by about . The three commons are protected by the Act from being enclosed or built upon. The Wimbledon Common is for the benefit of the general public for informal recreation, and for the preservation of natural flora and fauna. It is the largest expanse of heathland in the London area. There is an area of bog, and the western slopes, which lie on London Clay, support mature, mixed woodland. Most of the Common is a Site of Special Scientific Interest, and a Special Area of Conservation under the EC Habitats Directive.\nHampstead Heath\nHampstead Heath, a large, ancient London park, covering , has numerous footpaths, and \"feels a million miles away – despite being approximately four miles\" (7&nbsp;km) from the City of London. North from Hampstead Heath the Dollis Valley Greenwalk (or Green Walk) is a link between the Heath and the Moat Mount Nature Reserve in Mill Hill in the London Borough of Barnet, connecting various green spaces along the way. This  long route acts as a link between the Capital Ring, which runs just north of the Heath through Highgate, and the London Loop.\nThe Heath is a grassy public space that sits astride a sandy ridge, which is one of the highest points in London, reaching . Running from Hampstead to Highgate, this ridge rests on a band of London Clay, that embraces ponds, meadows, recent and ancient woodlands, a lido, playgrounds, and a training track, and it adjoins the stately home of Kenwood House and its grounds. The Heath is \"a wonderful place for a ramble, especially to the top of Parliament Hill Fields, which offers expansive views across the city and is one of the most popular places in London to fly a kite.\" The hill is  high. Running along the Heath's eastern perimeter are a chain of ponds – including three open-air public swimming pools – which were originally reservoirs for drinking water from the River Fleet.\nHampstead Heath is an important refuge for wildlife, \"home to about 180 bird species, 23 species of butterflies\", including grass snakes, foxes, rabbits, slowworms, squirrels and frogs. Common kingfishers, jackdaws, pipistrelles and Daubenton's bats are seen over the ponds. Some introduced species have also thrived at the site, for example muntjac deer, terrapins and ring-necked parakeets. The Heath is a Site of Metropolitan Importance for Nature Conservation, and part of Kenwood is a Site of Special Scientific Interest.\nEpping Forest\nCentenary Walk 2]]\nEpping Forest is crossed by many public rights of way and orienteering and rambling are popular. There are numerous guidebooks offering shorter walks for the casual visitor. The most important event in the rambler's calendar in the area is the traditional Epping Forest Centenary Walk, an all-day event commemorating the saving of Epping Forest as a public space, which takes place annually on the third Sunday in September. There is also a long-distance challenge walk that runs , with views over Essex, Hertfordshire and London: a route \"across dragonfly meadows, over small hills, past places associated with Queen Boadicea, through beech and oak forest where deer and fox roam\". The start and finish are \"at the historic Waltham Abbey where King Harold is reputedly buried\".\nEpping Forest covers , which makes it one of London's largest open spaces. It contains areas of woodland, grassland, heath, rivers, bogs and ponds and is a Site of Special Scientific Interest. Stretching between Forest Gate in the south and Epping in the north, Epping Forest is approximately  long in the north–south direction, but no more than  from east to west at its widest point, and in most places considerably narrower. The forest lies on a ridge between the valleys of the rivers Lea and Roding; its elevation and thin gravelly soil (the result of glaciation) historically made it unsuitable for agriculture.\nSee also\n* Flâneur someone who saunters around observing society\n* Squares in London\nReferences\nExternal links\n* [http://www.bakerstreetquarter.co.uk/Walks-9183.html Baker Street Quarter: Free guided walks]\n* [https://www.mapping.cityoflondon.gov.uk/geocortex/mapping/?viewer=compass&runworkflowbyid=Switch_layer_themes&LayerTheme=Show%20the%20Explore%20The%20City%20layers City of London Interactive map]\n* [https://www.haringey.gov.uk/sites/haringeygovuk/files/hampstead_heath_trail.pdf Hampstead Heath trails]\n* [https://www.google.com/maps/d/u/0/viewer?mid=12UtvwiGb3Pfb1BBkGQCwFfBFEGI&ll=51.51295910813191%2C-0.0888723000000482&z=15 Map of London Wall Walk and Photos]\n* [https://www.cityoflondon.gov.uk/things-to-do/green-spaces/epping-forest/activities-in-epping-forest/walking-and-running-in-epping-forest Walking in Epping Forest]\n* [http://www.richmondparklondon.co.uk/walks/ Walks in Richmond Park]\n* [https://www.ifootpath.com/browse-and-search-for-walking-guides?postCode=London,%20United%20Kingdom&locationLon=-0.12775829999998223&locationLat=51.5073509&order=&viewAs=list&nRows=25 Walks in and around London]"
    }
  ]
}