{
  "content": [
    {
      "type": "text",
      "text": "# Wallachian Revolution of 1848__disambig_1\n\n| coordinates =\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Counterrevolutionary victory\n* Gheorghe Bibescu overthrown\n* Provisional government formed\n* Conservative coup d'état\n* Wallachia invaded by the Russian and Ottoman Empires\n* Revolution suppressed\n* Barbu Dimitrie Știrbei brought to the throne\n| status      =\n| combatants_header =\n| combatant1  =  Revolutionaries\n* Liberals\n* Nationalists\n| combatant2  =  Wallachia\n| combatant3  =\n| commander1  =  Neofit Gianoglu Christian Tell Ion Heliade Ștefan Golescu Gheorghe Magheru Gheorghe Scurti}}\n| commander2  =  Gheorghe Bibescu Constantin Cantacuzino Barbu Dimitrie Știrbei Omar Pasha Alexander von Lüders}}\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 =\n| casualties2 =\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Wallachian Revolution of 1848 was a Romanian liberal and nationalist uprising in the Principality of Wallachia. Part of the Revolutions of 1848, and closely connected with the unsuccessful revolt in the Principality of Moldavia, it sought to overturn the administration imposed by Imperial Russian authorities under the Regulamentul Organic regime, and, through many of its leaders, demanded the abolition of boyar privilege. Led by a group of young intellectuals and officers in the Wallachian Militia, the movement succeeded in toppling the ruling Prince Gheorghe Bibescu, whom it replaced with a provisional government and a regency, and in passing a series of major progressive reforms, announced in the Proclamation of Islaz.\nDespite its rapid gains and popular backing, the new administration was marked by conflicts between the radical wing and more conservative forces, especially over the issue of land reform. Two successive abortive coups were able to weaken the Government, and its international status was always contested by Russia. After managing to rally a degree of sympathy from Ottoman political leaders, the Revolution was ultimately isolated by the intervention of Russian diplomats and repressed by a common intervention of Ottoman and Russian armies, without any significant form of armed resistance. Nevertheless, over the following decade, the completion of its goals was made possible by the international context, and former revolutionaries became the original political class in united Romania.\nOrigins\nThe two Danubian Principalities, Wallachia and Moldavia, came under direct Russian supervision upon the close of the Russo-Turkish War of 1828–1829, being subsequently administered on the basis of common documents, known as Regulamentul Organic. After a period of Russian military occupation, Wallachia returned to Ottoman suzerainty while Russian oversight was preserved, and the throne was awarded to Alexandru II Ghica in 1834—this measure was controversial from the onset, given that, despite the popular provisions of the Akkerman Convention, Ghica had been appointed by Russia and the Ottomans, instead of being elected by the Wallachian Assembly. As a consequence, the Prince was faced with opposition from both sides of the political spectrum, while also attempting to quell the peasantry's discontent by legislating against the abuse of estate lessors. The first liberal movement, taking inspiration from the French Revolution and having for its stated purpose the encouragement of culture, was Societatea Filarmonică (the Philharmonic Society), established in 1833.\nHostility towards Russian policies erupted later in 1834, when Russia called for an \"Additional Article\" (Articol adițional) to be attached to the Regulament, as the latter document was being reviewed by the Porte. The proposed article sought to prevent the Principalities' Assemblies from modifying the Regulament any further without the consent of both protecting powers. This move met with stiff opposition from a majority of deputies in Wallachia, among whom was the radical Ioan Câmpineanu; in 1838, the project was nonetheless passed, when it was explicitly endorsed by Sultan Abdülmecid I and by Prince Ghica.\nCâmpineanu, who had proposed a reformist constitution to replace the Regulament entirely, was forced into exile, but remained an influence on a younger generation of activists, both Wallachian and Moldavian. The latter group, comprising many young boyars who had studied in France, also took direct inspiration from reformist or revolutionary-minded societies such as the Carbonari (and even, through Teodor Diamant, from Utopian socialism). It was this faction who would first explicitly publicize the demands for national independence and Moldo-Wallachian unification, which it included in a wider agenda of political reforms and European solidarity. Societatea Studenților Români (the Society of Romanian Students) was founded in 1846, having the French poet Alphonse de Lamartine for its honorary president.\nPre-revolutionary events and outbreak\nIn October 1840, the first specifically revolutionary secret society of the period was repressed by Prince Ghica. Among those arrested and taken into confinement were the high-ranking boyar Mitică Filipescu, the young radical Nicolae Bălcescu, and the much older Dimitrie Macedonski, who had taken part in the uprising of 1821.\nLithograph of a group portrait by [[Constantin Daniel Rosenthal, showing Paris-based revolutionaries during the early 1840s. From left: Rosenthal (wearing a Phrygian cap), C. A. Rosetti, anonymous Wallachian]]\nThe new ruler, Gheorghe Bibescu, released Bălcescu and other participants in the plot during 1843; soon afterwards, they became involved in founding a new Freemason-inspired secret society, known as Frăția (\"The Brotherhood\"), which was to serve as the central factor in the revolution. Early on, Frăția's nucleus was formed by Bălcescu, Ion Ghica, Alexandru G. Golescu, and Major Christian Tell; by spring 1848, the leadership also included Dimitrie and Ion Brătianu, Constantin Bălcescu, Ștefan and Nicolae Golescu, Gheorghe Magheru, C. A. Rosetti, Ion Heliade Rădulescu, and Ioan Voinescu II. It was especially successful in Bucharest, where it also reached out to the middle class, and kept a legal facade as Soțietatea Literară (the Literary Society), whose meetings were attended by the Moldavians Vasile Alecsandri, Mihail Kogălniceanu, and Costache Negruzzi, as well as by the Austrian subject Constantin Daniel Rosenthal. During the early months of 1848, Romanian students at the University of Paris, including the Brătianu brothers, witnessed and, in some cases, took part in the French republican uprising.\nRebellion broke out in late June 1848, after Frăția's members came to adopt a single project regarding the promise of land reform. This resolution, which had initially caused dissension, was passed into the revolutionary program upon pressures from Nicolae Bălcescu and his supporters. The document itself, destined to be read as a proclamation, was most likely drafted by Heliade Rădulescu, and Bălcescu himself was possibly responsible for most of its ideas. It called for, among other issues, national independence, civil rights and equality, universal taxation, a larger Assembly, responsible government, a five-year term of office for Princes and their election by the Assembly, freedom of the press, and decentralization.\nThe Proclamation of Islaz\nOriginally, the revolutionary grouping had intended to take over various military bases throughout Wallachia, and planned to simultaneously organize public gatherings in Bucharest, Râmnicu Vâlcea, Ploiești, Romanați County and Islaz. On June 21, 1848, Heliade Rădulescu and Tell were present in Islaz, where, with the Orthodox priest Șapcă of Celei, they revealed the revolutionary program to a cheering crowd (see Proclamation of Islaz). A new government was formed on the spot, comprising Tell, Heliade Rădulescu, Ștefan Golescu, Șapcă, and Nicolae Pleșoianu—they wrote Prince Bibescu an appeal, which called on him to recognize the program as the embryo of a constitution and to \"listen to the voice of the motherland and place himself at the head of this great accomplishment\".\nThe revolutionary executive left Islaz at the head of a gathering of soldiers and various others, and, after passing through Caracal, triumphantly entered Craiova without meeting resistance from local forces. According to one account, the gathering comprised as many as 150,000 armed civilians. As these events were unfolding, Bibescu was shot at in Bucharest by Alexandru or Iancu Paleologu (the father of French diplomat Maurice Paléologue) and his co-conspirators, whose bullets only managed to tear one of the Prince's epaulettes. Over the following hours, police forces clamped down of Frăția, arresting Rosetti and a few other members, but failing to capture most of them.\nProvisional Government\nCreation\nSeal of the Provisional Government in June 1848\nEarly on June 23, Bibescu also attempted to regain the loyalty of his Militia forces by an order to take a renewed oath of allegiance—the officers agreed to do so, but added that under no circumstances did they agree to shed the blood of Romanians. In the afternoon, the Bucharest populace, feeling encouraged by this development, rallied in the streets; around four o'clock, the church bells on Dealul Mitropoliei began sounding the tocsin (by banging their tongues on only one side of the drum). Public readings of the Islaz Proclamation took place, and the Romanian tricolor was paraded throughout the city. At ten o'clock in the evening, Bibescu gave in to the pressures, signed the new constitution, and agreed to support a Provisional Government as imposed on him by Frăția. This effectively disestablished Regulamentul Organic, causing the Russian consul to Bucharest, Charles de Kotzebue, to leave the country for Austrian-ruled Transylvania. Bibescu himself abdicated and left into self-exile.\nOn June 25, the two proposed cabinets were reunited into Guvernul vremelnicesc (the Provisional Government), based on the Executive Commission of the Second French Republic; headed by the conservative Neofit II, the Metropolitan of Ungro-Wallachia, it consisted of Christian Tell, Ion Heliade Rădulescu, Ștefan Golescu, Gheorghe Magheru, and, for a short while, the Bucharest merchant Gheorghe Scurti. Its secretaries were C. A. Rosetti, Nicolae Bălcescu, Alexandru G. Golescu, and Ion Brătianu. The Government was doubled by Ministerul vremelnicesc (the Provisional Ministry), which was divided into several offices: Ministrul dinlăuntru (the Minister of the Interior, a position held by Nicolae Golescu); Ministrul dreptății (Justice – Ion Câmpineanu); Ministrul instrucției publice (Public Education – Heliade Rădulescu); Ministrul finanții (Finance – C. N. Filipescu); Ministrul trebilor dinafară (Foreign Affairs – Ioan Voinescu II); Ministrul de războiu (War – Ioan Odobescu, later replaced by Tell); Obștescul controlor (the Public Controller – Gheorghe Nițescu). It also included Constantin A. Kretzulescu as President of the City Council (later replaced by Cezar Bolliac),  as Commander of the National Guard, and Mărgărit Moșoiu as Police Chief.\nThe Wallachian revolutionaries maintained ambiguous relations with leaders of the Hungarian Revolution of 1848, as well as with the latter's ethnic Romanian adversaries in Transylvania. As early as April, Bălcescu, who maintained close contacts with many Romanian Transylvanian politicians, called on August Treboniu Laurian not to oppose the unification of Transylvania and revolutionary Hungary. In parallel, secretive negotiations were carried out between Lajos Batthyány and Ion Brătianu, which were in connection to a project of creating a Wallachian–Hungarian confederation. Although it drew support from radicals, the proposal was ultimately rejected by the Hungarian side, who notably argued that this carried the danger of deteriorating relations with Russia. Progressively, Romanian Transylvanians distanced themselves from the rapprochement, and clarified that their goal was the preservation of Austrian rule, coming into open conflict with the Hungarian revolutionary authorities.\nEarly reforms\nabolition of Roma slavery, drawing by Theodor Aman]]\nThe following day, the new administrative bodies issued their first decrees. One of them instituted the horizontal tricolor with the inscription DPEПTATE – ФРЪЦIE (\"Justice – Brotherhood\" in Romanian Cyrillic as used at the time). A national motto for Wallachia, Dreptate, Frăție (\"Justice, Brotherhood\"), was also introduced. It proclaimed all traditional civil ranks to be destitute, indicating that the only acceptable distinctions were to be made on the basis of \"virtues and services to the motherland\", and creating a national guard. The Government also abolished censorship, as well as capital and corporal punishment, while ordering all political prisoners to be set free. In line with earlier demands, a call for unification of all Romanian-inhabited lands, as \"one and indivisible [nation]\", was officially voiced during that period. However, this view was still only shared by a relatively small and highly factionalized section of the intelligentsia.\nThe official abolition of Roma slavery was sanctioned by a decree also issued on June 26. This was the culmination of a process begun in 1843, when all state-owned slaves had been liberated, and continued in February 1847, when the Orthodox Church had followed suit and set free its own Roma labor force. The decree notably read: \"The Romanian people discard the lack of humanity and the shameful sin of owning slaves and declares the freedom of privately owned slaves. Those who have so far had the sinful shame of owning slaves are forgiven by the Romanian people; and the motherland, as a good mother, shall compensate, out of its treasury, whosoever shall complain of detriment as a result of this Christian deed\". A three-member Commission was left to decide on the matters of legal implementation and compensation for slave owners—it comprised Bolliac, Petrache Poenaru, and Ioasaf Znagoveanu.\nThe authorities publicized their reforms by making use of new press institutions, the most circulated of which were Poporul Suveran (a magazine edited by Bălcescu, Bolliac, Grigore Alexandrescu, Dimitrie Bolintineanu and others) and Pruncul Român (published by Rosetti and Eric Winterhalder). In parallel, the Bucharest populace could regularly hear public communiques read on the fields of Filaret (known as the \"Field of Liberty\").\nDisputes and intrigue\nRomania Breaking off Her Chains on the Field of Liberty, painting by Constantin Daniel Rosenthal (a reference to the field of Filaret)\nSupport for the Provisional Government began to be tested when the issue of land reform and corvées was again brought to the forefront. Aside from the important conservative forces, opponents of the measure were to be found inside the leadership body itself, and included the moderates Heliade Rădulescu and Ioan Odobescu. Revolutionaries who favored passing land into the property of peasants were divided over the amount that was to be ceded, as well as over the issue of compensation to be paid to boyars. A compromise was reached through postponing, with a decision taken to submit all proposals to the vote of the Assembly, which was yet to be convened, instead of drafting a decree. Nevertheless, a Proclamation to estate-holders was issued (June 28, 1848), indicating that the reform was to be eventually enforced in exchange for unspecified sums, and calling on peasants to fulfill their corvées until autumn of the same year.\nThis appeal caused a reaction from the opposition forces: Odobescu rallied to the cause of conservatives, and, on July 1, 1848, together with his fellow officers Ioan Solomon and Grigorie Lăcusteanu, arrested the entire Government. The coup almost succeeded, being ultimately overturned by the reaction of Bucharesters, who organized street resistance against mutinied troops, mounted barricades, and, eventually, stormed into the executive's headquarters. The latter assault, led by Ana Ipătescu, resulted in the arrest of all coup leaders.\nDespite this move, disputes regarding the shape of land reform continued inside the Government. On July 21, 1848, Nicolae Bălcescu obtained the issuing of a decree to create Comisia proprietății (the Commission on Property), comprising 34 delegates, two for each Wallachian county, representing respectively peasants and landlords. The new institution was presided over by the landowner Alexandru Racoviță, and had the Moldavian-born Ion Ionescu de la Brad for its vice president.\nDuring the proceedings, a number of boyars had switched to supporting peasants: the liberal boyar Ceaușescu, a delegate to the Commission's fourth session, made a celebrated speech in which he addressed laborers as \"brothers\" and deplored his own status as a landowner. An emotional audience applauded his gesture, and peasants proclaimed that God forgave Ceaușescu's deeds. Other landowners, more circumspect, asked peasants what they planned to use for compensation, for which they were to be largely responsible; according to Mihail Kogălniceanu, their answer was \"With these two slave's arms, we have been working for centuries and provided for all the landowners' expenses; once freed, our arms would work twice as much and rest assured that we will not leave you wanting of what the country's judgment will decide we should pay you\". This reportedly caused an uproar inside the Commission.\nPeasants and their supporters advocated the notion that each family was supposed to receive at least four hectares of land; in their system, which made note of differences in local traditional, peasants living in wetlands were to be assigned 16 pogoane (approx. eight hectares), those living in plains 14 (approx. seven hectares), inhabitants of hilly areas 11 (between five and six hectares), while people inhabiting the Southern Carpathian areas were supposed to receive eight pogoane (approx. four hectares). This program was instantly rejected by many landowners, and the negotiations were ended through a decision taken by Heliade Rădulescu, when it was again decided that the ultimate resolution was a prerogative of the future Assembly. The failure to address this most significant of the problems faced by Wallachians contributed to weakening support for the revolutionary cause.\nDiplomatic efforts and regency\nOttoman envoy Süleyman Pașa entering Bucharest in August 1848]]\nFaced with the clear hostility of the Russian Emperor Nicholas I, Wallachian revolutionaries sought instead a rapprochement with the Ottoman leadership. Efforts were made to clarify that the movement did not seek to reject Ottoman suzerainty: for this purpose, Ion Ghica was sent to Istanbul as early as May 29, 1848; his mission was initially successful, but later events led Sultan Abdülmecid I to reconsider his position, especially after being faced with Russian protests. Süleyman Pașa, Abdülmecid's brother-in-law, was dispatched to Bucharest with orders to report on the situation and take appropriate measures.\nWarmly received by the city's inhabitants and authorities, Süleyman opted to impose a series of formal moves, which were intended to appease Russia. He replaced the Government with a regency, Locotenența domnească, and asked for some changes to be operated in the text of the constitution (promising that these were to ensure Ottoman recognition). The new ruling body, a triumvirate, comprised Heliade Rădulescu, Nicolae Golescu, and Christian Tell.\nOn Süleyman's explicit advice, a revolutionary delegation was dispatched to Istanbul, where it was to negotiate the movement's official recognition—among the envoys were Bălcescu, Ștefan Golescu, and Dimitrie Bolintineanu. By that moment, Russian diplomats had persuaded the Porte to adopt a more reserved attitude, and to replace Süleyman with a rapporteur for the Divan, Fuat Pasha. In parallel, Russia ordered its troops in Bessarabia to prepare for an intervention over the Prut River and into Bucharest—the prospect of a Russo-Turkish war was inconvenient for Abdülmecid, at a time when the French Second Republic and the United Kingdom failed to clarify their positions in respect to Ottoman policies. Stratford Canning, the British Ambassador to the Porte, even advised Ottoman officials to intervene against the Revolution, thus serving Prime Minister Palmerston's policy regarding the preservation of Ottoman rule in the face of outside pressures. The Wallachian delegation was denied reception, and, after a prolonged stay, had to return to Bucharest.\nMetropolitan Neofit's coup\nThe burning of Regulamentul Organic and of the register of boyar ranks\nOn July 11, 1848, the false rumor that the Imperial Russian Army had left Bessarabia and was moving southwards cause the regency to leave Bucharest and take refuge in Târgoviște. This occurred after Russia had occupied Moldavia in April, a result of the unsuccessful revolt in that country. The moment was seized by conservatives: headed by Metropolitan Neofit, the latter grouping took over, and announced that the revolution had ended. When a revolutionary courier returned from the Moldavian town of Focșani with news that Russian troops had not left their quarters, the population in the capital prepared for action—during the events, Ambrozie, a priest from the Buzău Bishopric, made himself the revolutionary hero of the hour and earned the nickname Popa Tun, the \"Cannon Priest\", after ripping out the lit fuse of a gun aimed at the crowds. The outcome caused Neofit to invalidate his own proclamation, and to transfer his power back to the Provisional Government (July 12).\nOver the following months, the population radicalized itself, and, on September 18, 1848, just one week before the Revolution was crushed, crowds entered the Interior Ministry, taking over the official copies of Regulamentul Organic and the register of boyar ranks (Arhondologia). The documents were subsequently paraded through the city in a mock funeral cortege, and burned down, one sheet at a time, in the public square on Mitropoliei Hill. Neofit reluctantly agreed to preside over the ceremony and to issue a curse on both pieces of legislation.\nSuppression\nWallachia\n|combatant2=\n|commander1=\n|commander2= Kerim Pasha\n|units1=Fire company\n|units2=Unknown\n|strength1=916\n|strength2=6000\n|casualties1=48 killed56 wounded\n|casualties2=158 killed400 wounded\n|notes=\n}}\nOn , Ottoman troops headed by Omar Pasha and assisted by Fuat Pasha stormed into Bucharest, partly as an attempt to prevent the extension of Russian presence over the Milcov River. On the morning of that day, Fuat met with local public figures at his headquarters in Cotroceni, proclaiming the reestablishment of the Regulament and appointing Constantin Cantacuzino as Kaymakam of Wallachia. While all revolutionaries who attended the meeting were placed under arrest, Ion Heliade Rădulescu and Christian Tell sought refuge at the British consulate in Bucharest, where they were received by Robert Gilmour Colquhoun in exchange for a sum of Austrian florins.\nThe radical faction around Nicolae Bălcescu and Gheorghe Magheru had planned resistance on the Danube, but their opinion had failed to rally significant appeal. A group of several thousands soldiers, comprising Oltenian pandurs and volunteers from throughout the land, rallied in Râmnicu Vâlcea under Magheru's command, without ever going into action. In Bucharest itself, a force of 6000 troops under Kerim Pasha was led to the garrison on Dealul Spirii. A 900-strong force consisting of the 2nd Line Infantry Regiment, the 7th Company of the 1st Line Infantry Regiment under the command of Colonel Radu Golescu, and the fire company led by Captain Pavel Zăgănescu, met the Ottomans with resistance, provoking a brief  that lasted two and a half hours during which 158 Turks and 48 Romanians died and 400 Turks and 57 Romanians were wounded. In the evening, the entire city had been pacified. On September 27, a Russian force under Alexander von Lüders joined the occupation of Bucharest, taking over administration over one half of the city. Russia's expedition into the two Danubian Principalities was the only independent military initiative of her foreign interventions against the Revolutions of 1848.\nImmediately after the events, 91 revolutionaries were sentenced to exile. Of these, a small group was transported by barges from Giurgiu, on their way to the Austrian-ruled Svinița, near the Danube port of Orschowa. The revolutionary artist Constantin Daniel Rosenthal and Maria Rosetti, both of whom had been allowed to go free and had subsequently followed the barges on shore, pointed out that the Ottomans had stepped out of their jurisdiction, and were able to persuade the mayor of Svinița to disarm the guards, which in turn allowed the prisoners to flee. The escapees then made their way to Paris.\nMost other revolutionaries were detained in areas of present-day Bulgaria until spring 1849, and, passing through Rustchuk and Varna, were taken to the Anatolian city of Brusa, where they lived at the expense of the Ottoman state. They were allowed to return after 1856. During their period of exile, rivalry between the various factions became obvious, a conflict which became the basis for political allegiances in later years.\nIn the meantime, Magheru, upon the advice of Colquhoun, ordered the demobilization of his troops (October 10), and, accompanied by a few of his officers, passed the Southern Carpathians into Hermannstadt—at the time, the Transylvanian city was nominally in the Austrian Empire, but gripped by the Hungarian Revolution.\nAftermath\nWallachian activities in Transylvania\nStarting in December 1848, a number of Wallachian revolutionaries who had escaped or had been set free from arrest began mediating an understanding between Hungary's Lajos Kossuth and those Romanian Transylvanian activists and peasants who, under the leadership of Avram Iancu, were mounting military resistance to the Honvédség troops of Józef Bem. Nicolae Bălcescu emerged from his refuge in the Principality of Serbia, and, together with Alexandru G. Golescu and Ion Ionescu de la Brad, began talks with Iancu in Zlatna. The Wallachians presented Kossuth's proposal that Iancu's fighters should leave their base in the Apuseni and help rekindle revolution in Wallachia, leaving room for Hungary to resist Russian invention, but the offer was dismissed on the spot. In parallel, Magheru reached out to Hungarian authorities, asking them to consider confederating Hungary proper and Transylvania; this plan was also rejected.\nOn May 26, 1849, Nicolae Bălcescu met with Kossuth in Debrecen, and, despite his personal disappointment with the Hungarian discourse and his ideal of full political rights for Romanians in the region, agreed to mediate an understanding with Iancu, which resulted in a ceasefire and a series of political concessions. This came as Russian troops were entering Transylvania, a military operation culminating in Hungarian defeat at the Battle of Segesvár in late July.\nPolitical outcome\nProclamation of the Moldo-Wallachian union, painting by Theodor Aman\nThe Ottoman–Russian occupation prolonged itself until 1851, while the 1849 Convention of Balta Liman awarded the Wallachian crown to Barbu Dimitrie Știrbei. In contrast to the 1848&ndash;1849 setbacks, the period inaugurated by the Crimean War disestablished both Russian domination and the Regulamentul Organic regime, and, within the space of one generation, brought about the fulfillment of virtually all revolutionary projects. The common actions of Moldavians and Wallachians, in pace with the presence of Wallachian activists in Transylvania, helped circulate the ideal of national unity, with the ultimate goal of reuniting all majority-Romanian territories within one state.\nIn early 1859, at the close of a turbulent period, Wallachia and Moldavia entered a personal union, later formalized as the Romanian United Principalities, under Moldavian-born Domnitor Alexandru Ioan Cuza (himself a former revolutionary). Having been allowed to return from exile after the Treaty of Paris, most of the surviving revolutionaries played a major part in the political developments, and organized themselves as Partida Națională, which promoted Cuza during simultaneous elections for the ad hoc Divans. The role of Paris-based Wallachian émigrés in promoting sympathy for common Romanian goals was decisive. Partida succeeded in becoming the major factor in Romanian political life, before forming the basis of the liberal current. With Cuza's rule, the pace of Westernization increased, and, during the 1860s, a moderate land reform was carried out, monastery estates were secularized, while corvées and boyar ranks were outlawed.\nFollowing an 1866 conflict between the increasingly authoritarian Cuza and the political class, various trends organized a coup which brought Prince Carol, a Hohenzollern, to the Romanian throne—echoing a will expressed by some of the 1848 activists to have a foreign dynasty rule over a unified state. In 1877, as a consequence of the Russo-Turkish War, Romania proclaimed her independence.\nNotes\nReferences\n* Viorel Achim, The Roma in Romanian History, Central European University Press, Budapest, 2004\n* W. S. Cooke, The Ottoman Empire and Its Tributary States (Excepting Egypt), B. R. Grüner, Amsterdam, 1968\n* Neagu Djuvara, Între Orient și Occident. Țările române la începutul epocii moderne Between Orient and Occident: The Romanian Lands at the Beginning of the Modern Era), Humanitas, Bucharest, 1995\n* Ion Frunzetti, Pictorul revoluționar C.Rosenthal (The Revolutionary Painter C. Rosenthal), Editura de Stat pentru Literatură și Artă, Bucharest, 1955\n* Constantin C. Giurescu, Istoria Bucureștilor. Din cele mai vechi timpuri pînă în zilele noastre (History of Bucharest: From the Earliest Times Until Our Day), Editura Pentru Literatură, Bucharest, 1966\n* John Ashley Soames Grenville, Europe Reshaped, 1848–1878, Blackwell Publishing, Oxford, 1999\n* Mihail Kogălniceanu, [http://ro.wikisource.org/wiki/Dezrobirea_%C5%A3iganilor%2C_%C5%9Ftergerea_privilegiilor_boiere%C5%9Fti%2C_emanciparea_%C5%A3%C4%83ranilor Dezrobirea țiganilor, ștergerea privilegiilor boierești, emanciparea țăranilor (\"The Freeing of the Gypsies, the Disestablishment of Boyar Ranks, the Emancipation of Peasants\")] (Wikisource)\n* Liviu Maior, 1848–1849: Români și unguri în revoluție (1848–1849: Romanians and Hungarians in the Revolution), Editura Enciclopedică, Bucharest, 1998\n* Ignác Romsics, Béla K. Király, Geopolitics in the Danube Region: Hungarian Reconciliation Efforts, 1848–1998, Central European University Press, Budapest, 1998\n* L. S. Stavrianos, The Balkans Since 1453, C. Hurst & Co., London, 2000\nFurther reading\n*\nExternal links\n* [https://www.ohio.edu/chastain/index.htm Encyclopedia of 1848 Revolutions—new articles by scholars; comprehensive coverage]"
    }
  ]
}