{
  "content": [
    {
      "type": "text",
      "text": "# Walter Atlee Edwards\n\n|death_date=\n|birth_place= Philadelphia, Pennsylvania, US\n|death_place= Washington, D.C., US\n|placeofburial= Arlington National Cemetery\n|placeofburial_label= Place of burial\n|image=Walter Atlee Edwards.jpg\n|caption=Lieutenant Commander Walter Atlee Edwards, c. 1923\n|nickname=\n|allegiance= United States of America\n|branch= United States Navy\n|serviceyears=1906–1928\n|rank= Lieutenant Commander\n|commands=\n|unit=\n|battles=World War I\n|awards=Medal of HonorNavy CrossLégion d'honneurDistinguished Service Order\n|laterwork=\n}}\nWalter Atlee Edwards (November 8, 1886 – January 15, 1928) was a Lieutenant-Commander in the United States Navy and a recipient of America's highest military decoration – the Medal of Honor.\nBiography\nWalter Atlee Edwards was born in Philadelphia, Pennsylvania, on November 8, 1886. He entered the United States Naval Academy in 1906, graduated in June 1910 and was commissioned with the rank of Ensign in 1912. During the four years following graduation, Edwards served in the battleship , cruisers  and , and destroyers  and . For most of 1914-1916 he was stationed at Pensacola, Florida, receiving instruction in aviation, but also helped with the outfitting of the new destroyer  during this time.\nEdwards was an officer of the destroyers  and  from October 1916 until October 1917. He then became Aide for Aviation on the staff of Vice Admiral William S. Sims, Commander, U.S. Naval Forces Operating in European Waters, holding that position for the rest of World War I and into the first months of peace. In April 1919, Lieutenant Commander Edwards began brief duty with the Bureau of Navigation, in Washington, D.C., before taking up his new position as Aide to the Commandant of the Naval War College, in Newport, Rhode Island. For a year, beginning in May 1921, he was Commanding Officer of the destroyers  and .\nBetween June 1922 and September 1923, Edwards commanded the destroyer , a tour marked by the December 16, 1922 rescue of nearly 500 survivors from the burning French transport Vinh-Long. For his heroism on that occasion he was awarded the Medal of Honor, as well as receiving the Legion of Honor from the French government and the Distinguished Service Order from the King of England.\nIn 1923–1924, Lieutenant Commander Edwards was stationed at the Bureau of Navigation. He was then Gunnery Officer on the armored cruiser  and, in August 1927, took command of the destroyer .\nHospitalized in Washington, D.C., in December 1927, Lieutenant Commander Walter A. Edwards died there on January 15, 1928. He was buried at Arlington National Cemetery, in Arlington, Virginia.\nNamesake\nThe destroyer  was named in honor of Lieutenant Commander Edwards.\nMedal of Honor citation\nLieutenant Commander Edwards' official Medal of Honor citation is as follows:\nFor heroism in rescuing 482 men, women and children from the French military transport Vinh-Long, destroyed by fire in the Sea of Marmora, Turkey, on 16 December 1922. Lieutenant Commander Edwards, commanding the U.S.S. Bainbridge, placed his vessel alongside the bow of the transport and, in spite of several violent explosions which occurred on the burning vessel, maintained his ship in that position until all who were alive were taken on board. Of a total of 495 on board, 482 were rescued by his coolness, judgement and professional skill, which were combined with a degree of heroism that must reflect new glory on the United States Navy.\nSee also\n* List of Medal of Honor recipients\n* List of Medal of Honor recipients during peacetime\nReferences\n:\nExternal links\n*\n*"
    }
  ]
}