{
  "content": [
    {
      "type": "text",
      "text": "# Walter E. Ware\n\nWalter Ellsworth Ware  (August 26, 1861 in Needham, Massachusetts &ndash; April 21, 1951 in Salt Lake City, Utah) was an American architect who established a firm in 1891 in Salt Lake City, Utah and practiced until 1949, over a period of almost 60 years.  He designed numerous buildings of diverse styles and functions that remain standing, many of which are listed on the U.S. National Register of Historic Places.\nTraining\nWare received the majority of his training working at the Union Pacific railroad's Omaha drafting office between 1880 and 1888.  He also did some early architectural work in Denver, Colorado.\nCareer\nWare arrived in Salt Lake City in 1889 and began designing mostly residential architecture but quickly became involved in large civic projects. In 1901, Ware began one of the region's first architectural firms (Ware & Treganza) with Alberto O. Treganza as partner. Together they designed many residences, civic buildings, churches and carnegie libraries throughout Utah, Nevada and Wyoming until 1926, when the partnership ended. From 1938-1949, Ware joined with Lloyd W. McClenahan to form Ware & McClenahan.  Together with his partners, Ware trained many draftsman and future architects. Ware was a member of the American Institute of Architects and in 1940, Ware became the first Fellow from the Utah Chapter.\nPersonal life\nWalter Ellsworth Ware was born to inventor Elijah Ware and Martha A. Reed in Needham, Massachusetts. Elijah Ware made important contributions to steam engine technology such as the Ware Steam Wagon.  Walter married Jennie Hartley on July 14, 1890 in Laramie, Wyoming.  Their daughter Florence E. Ware trained at the Chicago Art Institute and was a respected artist.\nWorks\nWorks within Ware & Treganza are listed at that article.  Walter E. Ware has individual credit for many buildings, including a number that are listed on the National Register of Historic Places.\nGallery\nImages of selected buildings are:\nFile:First Presbyterian.jpg|First Presbyterian Church (Salt Lake City) (1903)\nFile:Converse Hall Building.JPG|Converse Hall at Westminster College (1906) *NRHP listed\nFile:Ivinson Mansion angle.jpg|Ivinson Mansion and Grounds (Laramie, Wyoming) *NRHP listed\nFile:Old Pen Rawlins Wyoming.jpeg|Wyoming State Penitentiary (Rawlings, Wyoming) *NRHP listed\nWorks\nWorks include:\n*Ivinson Mansion and Grounds (1892), Laramie, Wyoming, NRHP-listed\n*Henderson Block (1897–98), 375 W. 200 South, Salt Lake City, NRHP-listed\n*Church of Christ, Scientist (1898), 352 E. 3rd South, Salt Lake City, Utah, NRHP-listed\n*Thomas R. Cutler Mansion (1900), 150 E. State St., Lehi, Utah, possibly a work of Walter Ware, NRHP-listed\n*Wyoming State Penitentiary (1901), Rawlings, Wyoming, NRHP-listed\n*First Presbyterian Church (1903), Salt Lake City\n*Converse Hall at Westminster College (1906), Salt Lake City, NRHP-listed\n*Spalding Memorial Hall of St. Mark's Episcopal Church Salt Lake City, Utah\n*St. John's Evangelical Lutheran Church Salt Lake City, Utah\n*Henderson Block (1898) in Salt Lake City, Utah *NRHP listed\n*Mt. Pleasant Presbyterian Church Mt. Pleasant, Utah\n*Logan Presbyterian Church Logan, Utah\n*St. Thomas Aquinas Catholic Church in Logan, Utah\n*St. Anthony Catholic Church in Helper, Utah\n*Morton A. Cheesman House, 2320 Walker Lane Salt Lake City, UT (Ware, Walter), NRHP-listed\n*Ivinson Mansion and Grounds, Lots 1--8, block 178 Laramie, WY (Ware, W.E.), NRHP-listed\n*Jesse Knight House, 185 E. Center St. Provo, UT (Ware, Walter), NRHP-listed\n*Knight-Mangum House, 318 E. Carter St. Provo, UT (Ware, E. Walter), NRHP-listed\n*Lehi City Hall, 51 N. Center St. Lehi, UT (Ware, Walter E.), NRHP-listed\n*Tampico Restaurant, 169 Regent St. Salt Lake City, UT (Ware, Walter E.), formerly NRHP-listed\n*one or more buildings in Central City Historic District, roughly bounded by S. Temple, 900 South, 500 East, and 700 East Sts. Salt Lake City, UT (Ware, Walter, et al.), NRHP-listed\n*One or more buildings in Warehouse District, 200 South and Pierpont Ave. between 300 and 400 West Salt Lake City, UT (Ware, Walter), NRHP-listed\nSee also\nFor a listing of works completed in partnership with Alberto O. Treganza see Ware & Treganza.\nNotes"
    }
  ]
}