{
  "content": [
    {
      "type": "text",
      "text": "# Walter Edward Hoffman\n\n| birth_place   = Jersey City, New Jersey\n| death_date    =\n| death_place   = Norfolk, Virginia\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        =\n| relatives     =\n| residence     =\n| education     = Washington and Lee University (LLB)\n}}\nWalter Edward Hoffman (July 18, 1907 – November 21, 1996) was a United States district judge of the United States District Court for the Eastern District of Virginia.\nEducation and career\nBorn in Jersey City, New Jersey, Hoffman received a Bachelor of Science degree from the University of Pennsylvania in 1928. After attending the William & Mary Law School, he received a Bachelor of Laws from the Washington and Lee University School of Law in 1931. He was in private practice of law in Norfolk, Virginia from 1931 to 1954. He was an assistant professor of law at the William & Mary Law School from 1933 to 1942. He was a Referee in Bankruptcy for the United States District Court for the Eastern District of Virginia from 1942 to 1944.\nFederal judicial service\nHoffman was nominated by President Dwight D. Eisenhower on June 29, 1954, to the United States District Court for the Eastern District of Virginia, to a new seat created by 68 Stat. 8. He was confirmed by the United States Senate on July 14, 1954, and received commission the next day. He served as Chief Judge from 1961 to 1973. He assumed senior status on September 3, 1974. He was Director of the Federal Judicial Center from 1974 to 1977. His service was terminated on November 21, 1996, due to his death in Norfolk.\nNotable cases\nHoffman was soon caught up in desegregation cases arising from Virginia's (or the Byrd Organization's) policy of Massive Resistance. Initially, he handled them on his docket, but soon a three judge panel was created: of Hoffman, Senior 4th Circuit Judge Morris Ames Soper and fellow district judge Charles Sterling Hutcheson (until his retirement). Many of those cases were appealed by the losing Virginia entities to the Fourth Circuit Court of Appeal and United States Supreme Court. Those included the attempted closing of Seashore State Park to avoid integration, as well as attempts to keep Norfolk's schools segregated, and to harass the NAACP attorneys bringing desegregation cases (Harrison v. NAACP, NAACP v. Button, both of which were actually handled by David J. Mays and his associates as outside counsel).\nDuring his judicial career, Hoffman drew considerable praise as well as criticism (including a cross being burned on his lawn) for his handling of cases involving Massive resistance and desegregation of schools in Norfolk and Hampton Roads. He handled several cases involving boundary disputes between states at the direction of the United States Supreme Court, and presided over the trial of fellow Judge Harry E. Claiborne, as well as sentenced Vice-President Spiro Agnew after his plea of nolo contendere. A firm believer in litigants' rights to a speedy trial, Hoffman introduced the \"rocket docket\" in his district, which continues today.\nDeath and legacy\nA federal judge for 42 years, until his death in Norfolk, the Walter E. Hoffman United States Courthouse in Norfolk is named in Hoffman's honor. His papers are held by the Washington and Lee University in the archives of its School of Law. The Norfolk and Portsmouth Bar Association also names its annual award for outstanding hands-on community service for the late jurist.\nReferences\nSources\n*\n|years=1954–1974}}\n|years=1961–1973}}"
    }
  ]
}