{
  "content": [
    {
      "type": "text",
      "text": "# Wang Jing (Three Kingdoms)\n\n| term_end =\n| monarch = Cao Mao\n| office1 = Colonel-Director of Retainers (司隸校尉)\n| term_start1 =\n| term_end1 =\n| monarch1 = Cao Mao\n| office2 = Inspector of Yong Province (雍州刺史)\n| term_start2 = ?\n| term_end2 =\n| monarch2 = Cao Fang / Cao Mao\n| office3 = Administrator of Jiangxia (江夏太守)\n| term_start3 = ?\n| term_end3 = ?\n| birth_date = Unknown\n| birth_place = Linqing, Shandong\n| death_date = June 260\n| death_place = Luoyang, Henan\n| occupation = Politician\n| blank1 = Courtesy name\n| data1 = Yanwei (彦緯)\n}}\nWang Jing (died June 260), courtesy name Yanwei, was a Chinese politician of the state of Cao Wei during the Three Kingdoms period of China.\nLife\nWang Jing was born in a peasant family in Qinghe Commandery (), which is around present-day Linqing, Shandong. He was nominated by the official Cui Lin, who was also from Qinghe Commandery, to serve in the Wei government. His mother once said that it was not a good sign if he got promoted very fast in his career. However, Wang Jing still rose through the ranks in the civil service quickly. He held office as the Administrator () of Jiangxia Commandery (江夏郡; around present-day Xinzhou District, Wuhan, Hubei) and later as the Inspector () of Yong Province.\nIn 255, when Jiang Wei, a general from Wei's rival state Shu Han, led the Shu forces to attack Wei's Longxi Commandery (隴西郡; roughly present-day southern and southeastern Gansu), Wang Jing led a Wei army from Didao (狄道; present-day Lintao County, Gansu) to engage the enemy but was defeated. Wang Jing ended up being besieged by Shu forces in Didao. The siege was lifted when the Wei generals Chen Tai and Deng Ai showed up with reinforcements and drove the enemy back. Wang Jing was recalled back from Yong Province to the Wei imperial court in Luoyang and reassigned to be the Colonel-Director of Retainers () and a Master of Writing ().\nIn 260, the Wei emperor Cao Mao summoned Wang Jing, Wang Chen and Wang Ye to meet him in private and discuss plans to launch a coup to seize back power from the regent Sima Zhao. Cao Mao did not heed Wang Jing's suggestion and proceeded with the coup, but ended up being assassinated by Sima Zhao's men. After Cao Mao's death, Sima Zhao had Wang Jing and his mother arrested and executed.\nIn 266, after Sima Yan (Emperor Wu) ended the state of Wei and established the Jin dynasty, he issued an imperial decree to express sympathy for Wang Jing and his family. He appointed Wang Jing's grandson as a Gentleman Attendant ().\nSee also\n* Lists of people of the Three Kingdoms\nReferences\n* Chen, Shou (3rd century). Records of the Three Kingdoms (Sanguozhi).\n* Fang, Xuanling (ed.) (648). Book of Jin (Jin Shu).\n* Pei, Songzhi (5th century). Annotated Records of the Three Kingdoms (Sanguozhi zhu)."
    }
  ]
}