{
  "content": [
    {
      "type": "text",
      "text": "# War Feels Like War\n\n}}\nWar Feels Like War is a 2004 British documentary film. Made for BBC Storyville and TV 2 (Denmark), it was broadcast in the United States as part of the P.O.V. series. The film \"portrays journalists who covered the war in Iraq without the cover of helmets, bullet-proof vests, or the American military.\"\nFor three months, in Iraq, Spanish filmmaker Esteban Uyarra followed Jacek Czarnecki, Bengt Kristiansen, Jan Kruse, P.J. O'Rourke, and Stephanie Sinclair, five reporters and photographers, from Denmark, Norway, Poland, and the United States.  These journalists circumvented military media control to get access to a different perspective on the Iraq War. As the Coalition of the willing swept into Iraq, some journalists in Kuwait decided to travel in their wake, risking their lives to discover the impact of war on civilians.\nThe journalists include author P. J. O'Rourke, who was working for ABC Radio, as well as reporters and photographers for news operations ranging from Poland's Radio Zet to Stephanie Sinclair, a photographer for the Chicago Tribune.\nPlot\nIn the film, journalist crews are first seen trying to avoid being penned up in Kuwait City as the war is about to break. Other journalists repeatedly try to get through military zones to capture what is happening.\nOnce these journalists make it into Iraq, they capture troops at their frazzled ends, cussing. A journalist described a Scud missile \"whizzing\" by is artfully juxtaposed with a shot of a string of photographers taking a \"whiz\".\nThe reporters themselves wrestle with grisly images and the effect it may have on their humanity. One journalist admits she felt, \"I'm in over my head\", but presses on. Later, she says of a tragic scene she has just witnessed, \"If that doesn't affect you, you should find something else to do. That shit should always affect you.\" The U.S. later bombs the Baghdad hotel where these journalists are staying. After the gunfire stops, a Polish journalist files a radio report that says, \"It doesn't look good\", adding that a Marine has told him \"too many people still have weapons.\"\nAwards and film critics' views\nWar Feels Like War was awarded Honourable Mention for Best International Documentary by the Hot Docs Canadian International Documentary Festival in Toronto, Ontario, Canada.\nIn addition, it was shortlisted for the Silver Wolf Competition in the 2003 International Documentary Festival Amsterdam (IDFA) and was awarded the Jury Prize at the 2004 MovieEye Festival in Moscow.\nEsteban Uyarra was also nominated in the Best Newcomer category in the 2004 Grierson British Documentary Awards.\nThe New York Times wrote:\nBaltimore Sun television critic David Zurawik stated:\nDavid Kronke of the Daily News of Los Angeles states:\nM. S. Mason of The Christian Science Monitor states:\n}}\nSee also\n*Media coverage of the Iraq War\n* Axis of Evil\n*Baghdad or Bust\n*Control Room\n* Kill The Messenger\n*My Country, My Country\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}