{
  "content": [
    {
      "type": "text",
      "text": "# War memorial on Île du Souvenir\n\n.]]\nThe war memorial on Île du Souvenir is a war memorial dedicated to the victims of World War I, located on Île du Souvenir (or Île aux Cygnes) in the Parc de la Tête-d'Or in Lyon, France.\nArchitect Tony Garnier designed it and sculptors Jean-Baptiste Larrivé (cenotaph), Louis Bertola (bas-reliefs of Le Départ and La Guerre), and Claude Grange (bas-reliefs of La Paix and La Victoire) also contributed to the work.\nHistory\nof Jean-Baptiste and Auguste Larrivé]]\nThe city of Lyon launched a competition for a new war memorial in December 1920. The result of the first round was the selection of ten projects, five of which were proposals by Tony Garnier. His project \"Athéna\", a huge temple with a double colonnade on the hill of La Croix-Rousse, won the competition in the second round. However, this project was abandoned because it was too expensive. The winner was the \"Philae\" project, the result of a collaboration with Jean-Baptiste Larrivé.\nThe ensemble has been the subject of several redesigns: an initial group of six columns, each with a statue at the top, was replaced in 1922 by two fluted shafts rising from the water, which were also abandoned. Similarly, the project called for a perimeter wall with a frieze topped by colonnettes with a garland of plants, and stairs at the rear of the cenotaph - overly ambitious features that were never built.\nTony Garnier worked with sculptors Jean-Baptiste Larrivé for the cenotaph and Louis Bertola and Claude Grange for the bas-reliefs. The island itself was created and landscaped between 1924 and 1930.\nDescription\nThe inspiration for this project was Arnold Böcklin's painting Isle of the Dead. It is composed of a central piece, a cenotaph, which represents six bearers of a tombstone, wrapped in a shroud. It is a tribute to the 10,600 Lyonnais who died fighting for France in World War I. After Jean-Baptiste Larrivé died, his brother Auguste Larrivé finished the work.\nFour bas-reliefs were created by Louis Bertola (Le Départ and La Guerre) and Claude Grange (La Paix and La Victoire). The monument was built from blocks of stone taken from the quarries of Cruchaud (Buxy) and Goulot (Montagny-lès-Buxy).\nConservation\nListed as a historical monument since November 4, 1982, the building is part of the Parc de la Tête-d'Or pak complex, which, in addition to the war memorial, includes:\n* The main gate with its columns (Porte des Enfants du Rhône, Place du Général-Leclerc).\n* The Montgolfier Gate (Avenue Verguin).\n* The Camellia and Pandanus greenhouses.\nOn March 10, 2003, the building was awarded the label \"Heritage of the 20th Century\". A plaque commemorating this label has been placed nearby since November 2004.\nRenovation\nIn 2013, the monument was renovated and cleaned so that the 10,600 names inscribed on the cenotaph could be read (which was no longer possible). The island was closed for several years in a row, but after renovation, it was reopened to the public in early 2017.\nGallery\nFile:Île du souvenir au Parc de la tête d'or, 6 avril 2015.JPG|Île du souvenir at ''Parc de la tête d'or''.\nFile:Cénotaphe avec le nom des 10600 lyonnais morts à la guerre1.jpg|Cenotaph with the names of the 10,600 Lyonnais who died in the war.\nFile:The cenotaph and the last of the names (Vicaire-Zust).jpg|Names and holders.\nFile:Arnold Boecklin - Island of the Dead, Third Version.JPG|Island of the Dead, Arnold Böcklin, 1883, inspiration for the project.\nFile:Garnier-Tony, monument aux morts parc de la Tête d'Or, vue ensemble.jpg|Preliminary drawing by Tony Garnier held at the Museum of Fine Arts of Lyon.\nFile:Garnier-Tony, monument aux morts parc de la Tête d'Or, projet 2.jpg|Preliminary drawing by Tony Garnier held at the Museum of Fine Arts of Lyon.\nFile:Monument aux Morts (L'île du souvenir).jpg|Île aux Cygnes in the summer of 2022.\nFile:Sculpture and view of Monument aux Morts, l'île du Souvenir.jpg|La Victoire de Claude Grange (cleaned up nicely in 2020).\nFile:La guerre (Louis Bertola) et le cénotaphe (Jean Larrivé).jpg|La guerre (Louis Bertola) and the cenotaph (Jean-Baptiste Larrivé).\nReferences\nSee also\nBibliography\n*\n*"
    }
  ]
}