{
  "content": [
    {
      "type": "text",
      "text": "# War and Peace in the Nuclear Age\n\nWar and Peace in the Nuclear Age is a 1989 PBS television series focusing on the effect of nuclear weapons development on international relations and warfare during the Cold War. The 13-part series was funded by the Annenberg/CPB Project and produced by WGBH in Boston in association with NHK and Central Independent Television. The New York Times called it \"public television's equivalent of a nuclear explosion,\" praising it as \"intelligently conceived and fastidiously balanced.\"\nEpisodes\n{| class=\"wikitable\"\n!No.\n!Title\n!Air date\n!Description\n!Topics\n|-\n|1\n|\"Dawn\"\n|January 23, 1989\n|Scientists worldwide race to create nuclear weapons and be the first to use them in World War II.\n|Fascism, World War II, The Manhattan Project, The Blitz, Strategic bombing, Victory in Europe Day, Victory over Japan Day, Trinity (nuclear test), Atomic bombings of Hiroshima and Nagasaki\n|-\n|2\n|\"The Weapon of Choice\"\n|January 30, 1989\n|The United States and the Soviet Union, once allies, become Cold War adversaries.\n|Soviet atomic bomb project, Operation Crossroads, Greek Civil War, Marshall Plan, Operation Sandstone, 1948 Czechoslovak coup d'etat, Berlin Blockade, RDS-1, Thermonuclear weapon, Julius and Ethen Rosenberg, McCarthyism, Klaus Fuchs, Chinese Communist Revolution, Korean War\n|-\n|3\n|A Bigger Bang for the Buck\n|February 6, 1989\n|In the 1950s the United States begins to rely heavily on nuclear weapons for defense after the launch of the Soviet satellite Sputnik sparks fears of a \"missile gap.\"\n|Presidency of Dwight D. Eisenhower, Tactical nuclear weapon, Massive retaliation, Lockheed U-2, Sputnik 1, Ballistic missile, 1960 U-2 Incident\n|-\n|4\n|Europe Goes Nuclear\n|February 13, 1989\n|France and England race to acquire nuclear weapons during the 1950s and 1960s; NATO worries about defending Europe from the threat from the East.\n|Atomic Energy Act of 1946, Atomic Energy Research Establishment, Operation Hurricane, French Indochina, Suez Crisis, Operation Grapple, Campaign for Nuclear Disarmament, May 1958 crisis in France, Gerboise Bleue, Canopus, Warsaw Pact, Hungarian Revolution of 1956\n|-\n|5\n|At the Brink\n|February 20, 1989\n|During the 1962 Cuban Missile Crisis, America and the Soviet Union are each close to initiating nuclear war.\n|Cuban Missile Crisis, Cuba/Soviet Union Relations, Bay of Pigs Invasion, Berlin Wall, Tsar Bomba\n|-\n|6\n|The Education of Robert McNamara\n|February 27, 1989\n|Robert S. McNamara confronts the spectre of nuclear war during his tenure as Secretary of Defense (1961-1968).\n|Strategic Rocket Forces, SM-62 Snark, SM-65 Atlas, North American XB-70 Valkyrie, Convair B-58 Hustler, LGM-30 Minuteman, Berlin Blockade, Flexible response, Counterforce, Nuclear triad, Assassination of John F. Kennedy, Nike Zeus, Nike-X, LIM-49 Spartan, Sprint, Anti-ballistic missile, 41 for Freedom, Yankee-class submarine\n|-\n|7\n|One Step Forward\n|March 6, 1989\n|As the U.S. and Soviet nuclear arsenals reach a rough parity, SALT I, the first arms control agreement, is negotiated.\n|Stanley R. Mickelsen Safeguard Complex, Strategic Arms Limitation Talks, Detente, Vietnam War, Linkage, Anti-ballistic missile, Safeguard program, MIRV, 1972 visit by Richard Nixon to China\n|-\n|8\n|The Haves and the Have Nots\n|March 13, 1989\n|A case study of the dynamics of nuclear proliferation—China, India and Pakistan race to acquire atomic weapons.\n|Nuclear weapons and Israel, Operation Opera, Nuclear proliferation, Atoms for Peace, India and weapons of mass destruction, International Atomic Energy Agency, China and weapons of mass destruction, Partial Nuclear Test Ban Treaty, Sino-Indian War, Indo-Pakistani War of 1971, 1973 Oil Crisis, Nuclear Non-Proliferation Act of 1978, Soviet-Afghan War\n|-\n|9\n|Carter's New World\n|March 20, 1989\n|Jimmy Carter's goals for his presidency include the reduction of nuclear weapons and improving America's relations with the Soviet Union.\n|Rockwell B-1 Lancer, Strategic Arms Limitation Talks, R-36 missile, First Strike (1979 film), LGM-118 Peacekeeper, Ogaden War, Visit by Den Xiaoping to the United States, Iran hostage crisis, Soviet-Afghan War\n|-\n|10\n|Zero Hour\n|March 27, 1989\n|Soviet leader Gorbachev accepts President Reagan's proposal for both sides to dismantle certain missiles.\n|MGM-31 Pershing, RSD-10 Pioneer, Neutron bomb, NATO Double-Track Decision, Cruise missile, Protect and Survive, Anti-nuclear protests, Strategic Defense Initiative, Intermediate-Range Nuclear Forces Treaty\n|-\n|11\n|Missile Experimental\n|April 3, 1989\n|Supporters and critics of the MX missile discuss its role and how it could best be used.\n|LGM-118 Peacekeeper, SM-65 Atlas, LGM-30 Minuteman, Launch on Warning, Peacekeeper Rail Garrison, Air-launched ballistic missile, Strategic Arms Limitation Talks, Dense Pack, Nuclear Triad, MGM-134 Midgetman\n|-\n|12\n|Reagan's Shield\n|April 10, 1989\n|President Reagan supports the Strategic Defense Initiative as a means of eliminating the threat of nuclear attack.\n|Strategic Defense Initiative, Railgun, Nuclear Freeze Campaign, Safeguard Program, Korean Air Lines Flight 007, Moscow Summit (1988), Airborne Laser, Evil Empire Speech\n|-\n|13\n|Visions of War & Peace\n|April 17, 1989\n|Nations face the challenge of resolving disputes without nuclear weapons or physical force.\n|Early-warning radar, Glasnost, Mikhail Gorbachev, First Strike (nuclear strategy), Nuclear proliferation\n|}\nInterviews\nThe program features interviews throughout with the following individuals.\n{| class=\"wikitable\"\n|Abdul Sattar\n|George Whelan Anderson, Jr.\n|Petra Kelly\n|-\n|Agha Shahi\n|Georgy Arbatov\n|Phillip Morrison\n|-\n|Albert Carnesale\n|Gerald E. Miller\n|Pierre Marie Gallois\n|-\n|Albert Wohlstetter\n|Gerd Schmuckle\n|Pierre Messmer\n|-\n|Aleksandr Bovin\n|Glenn T. Seaborg\n|Raja Ramanna\n|-\n|Alexander Alexeyev\n|Han Xu\n|Randall Forsberg\n|-\n|Alun Gwynne Jones, Baron Chalfont\n|Hans Apel\n|Ray S. Cline\n|-\n|Andrei Gromyko\n|Hans Bethe\n|Raymond L. Garthoff\n|-\n|Andrew Goodpaster\n|Harold Brown\n|Richard C. Hottelet\n|-\n|Ash Carter\n|Harry Rowen\n|Richard Nixon\n|-\n|Bernard T. Feld\n|Helmut Schmidt\n|Richard Perle\n|-\n|Bernard W. Rogers\n|Henry Kissinger\n|Richard Pipes\n|-\n|Bertrand Goldschmidt\n|Henry M. Jackson\n|Roald Sagdeev\n|-\n|Carl Friedrich von Weizsacker\n|Herbert York\n|Robert McNamara\n|-\n|Caspar Weinberger\n|Homi Sethna\n|Robert R. Bowie\n|-\n|Chester Victor Clifton, Jr.\n|Isidor Isaac Rabi\n|Roger Hilsman\n|-\n|Clark Clifford\n|Jack Ruina\n|Roger Makins, 1st Baron Sherfield\n|-\n|Cyrus Vance\n|James A. Abrahamson\n|Roswell Gilpatric\n|-\n|David L. Aaron\n|James Callaghan\n|Royal B. Allison\n|-\n|David M. Jones\n|James R. Schlesinger\n|Rudolf Peierls\n|-\n|David Owen\n|Jerome Wiesner\n|Russell E. Dougherty\n|-\n|David Powers\n|Jimmy Carter\n|Sergey Kapitsa\n|-\n|Dean Rusk\n|John Eisenhower\n|Sidney Drell\n|-\n|Denis Healey\n|Joseph Nye\n|Subramanian Swamy\n|-\n|Donald Soper\n|K. Subrahmanyam\n|Ted Sorensen\n|-\n|E. P. Thompson\n|Kenneth Nichols\n|Thomas Hinman Moorer\n|-\n|Edward Teller\n|Lakshmi Kant Jha\n|Valentin Falin\n|-\n|Egon Bahr\n|Leslie H. Gelb\n|Victor Weisskopf\n|-\n|Eugene Carroll\n|Lew Allen\n|Vladimir Lomeiko\n|-\n|Evgeny Velikhov\n|Lynn E. Davis\n|Vladimir Semyonov\n|-\n|Frank A. Camm\n|Maurice Schumann\n|Wilhelm Grewe\n|-\n|Frank Roberts\n|McGeorge Bundy\n|William Kaufmann\n|-\n|Gennadi Gerasimov\n|Morarji Desai\n|William T. Fairbourn\n|-\n|George A. Keyworth II\n|Norman Cousins\n|William Van Cleave\n|-\n|George Ball\n|Norris Bradbury\n|Wolf Graf von Baudissin\n|-\n|George Bunn\n|Paul Nitze\n|Zbigniew Brzezinski\n|-\n|George Shultz\n|Paul Warnke\n|\n|}\nReferences\n*\n* [https://web.archive.org/web/20051101011815/http://www.lib.berkeley.edu/MRC/War&PeaceNuclearAge.html UC Berkeley Video Library review]"
    }
  ]
}