{
  "content": [
    {
      "type": "text",
      "text": "# War Memorial of Korea\n\n-->\n| former_name     =\n| established     =\n| dissolved       =\n| location        = 29 Itaewon-ro, Yongsan District, Seoul, South Korea\n| type            = War memorial and museum\n| accreditation   =\n| key_holdings    =\n| collections     =\n| collection_size = 6,300\n| visitors        =\n| founder         =\n| executive_director =\n| leader_type     =\n| leader          =\n| director        = Sun Young-Jae\n| president       = Baek Seung-joo\n| ceo             =\n| chairperson     =\n| curator         =\n| architect       =\n| historian       =\n| owner           =\n| employees       =\n| publictransit   =\n| parking         =\n| website         =\n| network         =\n| embedded        =\n}}\nThe War Memorial of Korea () is a museum located in Yongsan-dong, Yongsan-gu, Seoul, South Korea. It opened in 1994 on the former site of the army headquarters to exhibit and memorialize the military history of Korea. It was built for the purpose of preventing war through lessons from the Korean War and for the hoped for peaceful reunification of North and South Korea. The memorial building has six indoor exhibition rooms and an outdoor exhibition centre displaying war memorabilia and military equipment from China, South Korea and the United States.\nHistory\nThe War Memorial covers the history of Korean War which took place from June 25, 1950, to July 27, 1953.\nConstruction\nThe construction of the War Memorial of Korea was completed in December 1993. The project was carried out in consultation with military experts while collecting a wide range of exhibition items from at home and abroad. Upon the completion of the interior, the memorial opened officially on June 10, 1994, and became the largest landmark of its kind in the world.\nSurrounding area\nLocated on the old site of Army Headquarters, the War Memorial of Korea has three above-ground floors of exhibits. It also has two underground floors in the main building, which stands on an area of about .\nIn cloistered left and right galleries, flanking the facade of the main building, are rows of black marble monuments inscribed with the names of those who died during the Korean War, Vietnam War, clashes with North Korea since the Korean War and of policemen who died on duty. The plaza in the museum compound has an artificial waterfall, and around it are widespread rest areas so that visitors can picnic while enjoying the pleasant landscape. In the center of the plaza stands the Statue of Brothers, the elder a South Korean soldier and the younger a North Korean soldier, which symbolizes the situation of Korea's division.\nPublic transportation\n*   Samgakji Station exit 12\nExhibition areas\nAn exhibition hall (2006)\n6,300 items are displayed in seven halls and an outdoor exhibition area. There is a Memorial Hall, War History Room, Korean War Room, Expeditionary Forces Room, ROK Armed Forces Room, Exhibition Hall for Donated Artifacts, and Exhibition of Large Military Equipments.\nThe exhibitions show weapons and equipment from prehistoric times to the modern period, as well as depictions of notable military and militant figures. About 100 large weapons are displayed in the outside exhibition area on the lawns around the building.\nMemorial Hall\nUpon entering the memorial halls, this English text is inscribed:\nInscribed on this memorial are the names of the Republic of Korea Armed Forces Soldiers and Policemen killed in the Armed Forces Activation, Korean War, Vietnam War and Counter Infiltration Operation and the United Nations Forces Soldiers killed in the Korean War.\nIndoor displays\nObjects on display inside include:\n* Full-sized replica of a turtle ship\n* BM-13-16N Katyusha rocket launcher\n* LVT-3 Bushmaster amphtrack\n* M4A3E8 Sherman\n* M36 tank destroyer\n* M46 Patton\n* T-34/85 tank\n* Cadillac Fleetwood 62 used by Syngman Rhee\n* ZIL ZIS-110 limousine formerly used by Kim Il Sung\n* Cessna O-1 Bird Dog 112537\n* KTX-1 Yeo-myung, prototype for the production KAI KT-1 Woongbi advanced trainer.\n* MiG-15UTI Midget, a trainer variant of the MiG-15 Fagot fighter aircraft.\n* North American AT-6F Texan\n* North American F-51D-25-NA Mustang 44–73494. This aircraft was built at North American Aviation's Inglewood, California plant in 1944. It eventually served with the 109th Fighter Squadron of the Minnesota ANG, where it was stationed until 1952. In July of that year, it was transferred to the ROKAF as aircraft to serve in the Korean War, marked as aircraft \"K-205\".\n* North American F-86F-30-NA Sabre 52–4308. The aircraft flew with the 3200th Proof Test Group at Eglin AFB, Florida beginning in 1953. It was then transferred to ROKAF in 1955.\n* F-86 Sabre nose section\n* Yakovlev Yak-18 trainer aircraft\nOutdoor display area\nOutdoor exhibition area\nItems on display include:\nFixed-wing aircraft:\n* de Havilland Canada U-6A Beaver 51–16837 (manufacturer number 386 and 1190). This aircraft was delivered to the U.S. Army as an L-20A on October 24, 1952. In 1962, this type of aircraft was re-designated the U-6A Beaver. Under the Military Assistance Program, it was transferred to the Republic of Korea Air Force.\n* Antonov An-2 \"Colt\"\n* Curtiss C-46D-20-CU Commando 44–78541. This aircraft was built in 1944. This  aircraft served with the 45th Troop Carrier Troop Squadron in the Pacific Theater during WWII. It was eventually operated as a TC-46D Commando training aircraft by the 2578th Reserve Flying Training Center at Ellington AFB, Texas until being mothballed in April 1956. It returned to service with the 1st Air Commando Wing at Eglin AFB, Florida, in 1963. It was finally transferred to the ROKAF as part of the Cold War-era Military Assistance Program on September 25, 1968.\n* Fairchild C-123J Provider 56–4389. This aircraft was built in 1956 as a C-123B and later converted to a C-123J in the 1960s. This aircraft served with the Alaska ANG's 176th Tactical Airlift Group at Kulis ANGB, Alaska, servicing Alaskan Air Command radar sites until it was retired on January 21, 1976, and sent to MASDC. On May 5, 1977, it was sent to Korea as part of the Military Assistance Program.\n* Fairchild C-119G Flying Boxcar marked as 53–3199. Formerly a C-119F, it was converted into a C-119G between 1955 and 1957 before being transferred to the Republic of China Air Force in 1970. It was later donated to the War Memorial of Korea and repainted with USAF markings.\n* Boeing B-52D Stratofortress 55–0105. This aircraft is one of only three B-52s displayed outside the US. Served with the 4258th Strategic Wing at U-Tapao RTAFB in Thailand during the Vietnam War and the 96th Bombardment Wing at Dyess AFB, Texas. It is currently on a long-term loan to the War Memorial of Korea.\n* Grumman S-2A Tracker 13–6707. This aircraft served with the US Navy's Air Anti-Submarine Squadron 28 (VS-28) (initially nicknamed the \"Hukkers\" and later, the \"Gamblers\") aboard USS Wasp (CVS-18) beginning in 1962. Eventually, it was retired and transferred to ROKAF in 1972. During a reorganization of the Korean armed forces, it was later reassigned to the ROK Navy.\n* North American F-86D-35-NA Sabre 51–8502. This aircraft served with the USAF's Air Defense Command before being transferred to the ROKAF.\n* Northrop F-5A-40-NO Freedom Fighter 68–9046 (construction number 6412). This aircraft was one of the 190 F-5A airframes made for the ROKAF. It has a long serving career, flying with the ROKAF as late as 2000. It is currently painted with the twin tiger head insignia applied to all ROKAF F-5s.\n* McDonnell Douglas F-4C-23-MC Phantom II 64–0766. This aircraft served with the USAF's 12th Tactical Fighter Wing in the Vietnam War from 1967 to 1970. It was transferred to the 35th Tactical Fighter Squadron of the 347th Tactical Fighter Wing at Kunsan AB, South Korea. It was later used to train USAF air crews and went on to fly with the Illinois ANG's 170th Tactical Fighter Squadron and the Oregon ANG's 123rd Fighter Interceptor Squadron. After its flying career ended, it was transferred to Suwon AB, South Korea in August 1986 to be used as damage-control trainer before being put on display at the War Memorial of Korea.\n* Shenyang J-6. This aircraft is a Chinese-made copy of the Soviet MiG-19 \"Farmer\". This particular aircraft was flown by KPAF defector Captain Lee Ung-Pyeong to South Korea 25 February 1983.\n* Cessna T-41B Mescalero 67–15054. This aircraft flew with U.S. Army until it was sent to the ROKAF in 1971 as part of the Military Assistance Program to be used as a trainer. It is now marked \"T-045.\"\n* North American T-28A Trojan 51–7830. This aircraft was flown by the USAF as a trainer before being sent to the ROKAF in February 1961. This aircraft still wears its USAF \"TA-830\" buzz number.\n* Lockheed T-33A-1-LO Shooting Star 53–5129. This aircraft flew with the USAF as a trainer until being sent to South Korea as part of the Foreign Military Sales program. It is still marked with a USAF-style \"TR-129\" buzz number.\n* Cessna T-37C Tweet  72–1366. This aircraft was sold to the Republic of Korea Air Force and marked as \"21366.\". This aircraft type served with the ROKAF as a trainer, FAC, and light attack aircraft.\n* Buhwal-ho, the first domestically produced Korean aircraft.\nHelicopters\n* Bell AH-1J \"International Cobra\" 29066. This helicopter was one of eight TOW-capable AH-1J helicopters sold to the ROK Army in 1978.\n* Bell UH-1B Iroquois 62–12542. This helicopter formerly served as a helicopter gunship with the U.S. Navy's HA(L)-3 Seawolves in the Vietnam War before being transferred to the South Korean air force.\n* Bell OH-13H Sioux\n* McDonnell Douglas MD 500 Defender\n* Sikorsky H-5H Dragonfly 49–2007. This helicopter was built 1949 under a USAF contract. For November 1960 to May 1960, it served with the Commonwealth of Pennsylvania as N6591D before being donated to the USAF Museum and eventually loaned to the War Memorial of Korea.\n* Sikorsky HH-19B Chickasaw 53–4425. This helicopter was delivered to the USAF as a H-19B on September 2, 1954. It served in the USAF as a troop carrier and was eventually modified for air-sea rescue work and re-designated as an SH-19B (in 1962, all SH-19Bs were re-designated as HH-19Bs). It was eventually sent to the ROKAF in 1964.\n* Aerospatiale SA319B Alouette III 770301. This helicopter formerly served with the ROK Navy. This aircraft sank a DPRK infiltration craft disguised as a fishing vessel with AS.11 missiles on 13 August 1983, killing 5 North Korean servicemen. This helicopter is painted with a kill marking commemorating the event.\nArmored Vehicles:\n* Two M4A3E8 Shermans\n* T-34/85 tank\n* M36 tank destroyer\n* M56 Scorpion\n* M46 Patton\n* M47 Patton\n* M48 Patton\n* K1 88-Tank\n* SU-100\n* Type 59\n* Type 63\n* M113 APC\n* M557 command vehicle\n* M125 81mm mortar carrier\n* K200 KIFV\n* LVTP-7\nArtillery and Anti-Aircraft Guns:\n* ZiS-3 76mm divisional gun\n* M1938 120mm mortar\n* M101 105mm howitzer\n* M107 175mm self-propelled gun\n* M110 8 inch howitzer\n* M114 155 mm howitzer\n* M1937 152mm howitzer-gun\n* 90mm anti-aircraft gun\n* 90mm T8 anti-tank gun\n* ZPU-4\n* M167 VADS\n* Oerlikon 20 mm cannon on naval single and dual mounts\n* Bofors 40 mm on naval quad and mounts\n* 5-inch gun in single mount from an ex-ROK Navy Fletcher-class destroyer\nMissiles:\n* MIM-14 Nike Hercules\n* MIM-23 Hawk\n* Scud missile\n* MGM-52 Lance\nVessels:\n* Chamsuri-class patrol boat painted and given faux battle damage to resemble PKM-357, a ROK Navy patrol boat sunk during the Second Battle of Yeonpyeong\n* North Korean Submersible Infiltration Landing Craft (SILC) captured near Dadawpo, Busan on 3 December 1983\n* Hurricane Aircat airboat used by ROK special forces during the Vietnam War\nSee also\n* Gapyeong Canada Monument\n* Korean War Veterans Memorial, Washington, D.C.\n* Korean War Memorial, Canberra, Australia\n* Korean War Memorial Wall, Ontario, Canada.\n* National War Memorial (New Zealand)\n* Seoul National Cemetery\n* United Nations Memorial Cemetery, Busan, Korea\n* Victorious War Museum, Pyongyang, its North Korean counterpart\nReferences\nExternal links\n* [http://armour.ws/war-memorial-of-korea/ Pictures of the War Memorial of Korea]\n* [https://www.warmemo.or.kr/newwm/eng/main.jsp The War Memorial's official website]"
    }
  ]
}