{
  "content": [
    {
      "type": "text",
      "text": "# War against war__disambig_1\n\n(1842–1910) c.1890. With his essay The Moral Equivalent of War he is considered  one of the fathers of the concept of \"war against war\"]]\nIn political philosophy and international relations especially in peace and conflict studies the concept of a war against war also known as war on war refers to the reification of armed conflicts.\nOrigin\nat the 'Antikriegsmuseum' (anti-war museum) in Berlin-Mitte, Germany. One can read the title of Friedrich's book Krieg dem Kriege]]\nIf a work of Edmond Potonié-Pierre from 1877 already discusses the idea of reifying conflicts under the title \"la guerre à la guerre\" (the war against war) in its modern acceptation the concept is formally coined in 1906 by William James in his essay The moral equivalent of war. Though also used as a political slogan, it was a cornerstone of the ideology of both the European pre World War I pacifist and anti-war movements in the 20th century especially in its German version of Krieg dem Kriege from he eponymous two volume 1925 pamphlet of Ernst Friedrich which was largely translated across Europe. The age-old call to glory held no charm for German pacifist Ernst Friedrich (1894–1967). In 1924, he founded the National Anti-War Museum in Berlin, where a radical new method of protest was born. To illustrate a need for universal peace, Friedrich quickly displayed hundreds of disturbing photographs which fully revealed the hidden horrors of World War One. For those who could not personally attend his gruesome gallery, Friedrich published a book called War Against War, which featured anti-military sentiments juxtaposed with some of his most graphic images. In 1933, with thousands of copies in circulation, Friedrich encountered the wrath of the aggressive and newly formed National Socialist party. Soon, the war museum was destroyed, and its curator was forced to flee to Belgium. Prior to World War I the French labour union Confédération Générale du Travail pleaded its pacifism under the slogan guerre à la guerre! which was also the title of a poster campaign by which the French Association de la Paix par le Droit recalled the commitments taken by European powers at the Hague Convention of 1907.\nEvolution in the 20th century\nAlthough the slogan and concept (as the reification of armed conflicts) of war against war was the subject of an anti-military pleading in 1916 at the military tribunal of Neuchâtel the concept will also be developed by the French military with General Alexandre Percin, then War Minister, dedicating a comprehensive study to the subject entitled Guerre à la Guerre. The latter work, which especially explores the operational and strategic dimension of the concept from the angle of military doctrine would become a seminal contribution to its academic establishment. At times defended by the Socialist International as in the 1923 discourse of labour unionist Edo Fimmen at the international congress for peace at the Hague the concept will remain politically neutral overall in the 20th century, being also claimed by the Christian democratic movement with Gérard Marier and Jean Godin considering nuclear disarmament a central contribution to the war on war as a Christian mission\nContemporary evolution\nUnesco\nThe United Nations Educational, Scientific and Cultural Organization which constitution declares \"That since wars begin in the minds of men, it is in the minds of men that the defences of peace must be constructed\" describing a memetical conception of war, brought together - in 1982 - thirteen poets for a collective work entitled ''War on war: The poet's cry''.\nAberkane & Goldstein and a peace positivism\nMore recently the concept was discussed by scholars Joshua Goldstein and Idriss Aberkane. As Aberkane defines it, \"it permits us to ask, before the war disease reaches its terminal phase, 'has man domesticated war, or has war domesticated man? Based on the paradigm of Humberto Maturana and Francisco Varela for the description of autonomy and the works of Idries Shah in group psychology Aberkane's discussion of the concept consists of considering armed conflicts autopoietic and therefore dissipative systems which are parasitic and comparable to Richard Dawkins' notion of selfish gene hence \"selfish wars\". Conceptually Aberkane argues for a prescriptive use of peace and conflict studies, especially in a study on the defusing of the tensions in Xinjiang by which he defends the logical soundness of the concept of a \"war against war\" in five points:\n* (i) \"the qualitative complexity of the notion of interest (e.g. What you may think is not your interest may be in a broader perspective)\"\n* (ii) \"the non-refuted possibility that external conflicts of interests may be internalized within one single interest,\"\n* (iii)\" the fact that Hilbert's sixth problem has not been solved (ie physical reality is not axiomatized) which implies that\"\n* (iv) \"while limitation theorems can be demonstrated in first order logic (and game theory) there can be no limitation theorem predicating upon physical reality which comprises the notion of interest, thus in particular\"\n* (v) \"the impossibility of the total interest of peace ie. the stable intersection of individual and collective peace in international relations cannot be demonstrated.\"\nWhat Aberkane thus describes as \"erenologic positivism\" is transcribed in game theoretical vocabulary as that in international relations \"it is also not proven that a Pareto-optimal situation at the world level (or at a less formal level of describing diplomatic reality, a situation that may be reminiscent to the latter without its mathematical precision) could not be also overlapping with the Nash equilibrium of interacting individual interests.\"\nPeace–industrial complex\nAt least two approaches to the war against war may be distinguished, the frontal opposition to war or Anti-war movement on the one side and the transcendent, post-war conception of William James' 'Moral Equivalent of war' positing, in the way of the UNESCO, that the only way to end conflicts is to make Humanity busy with more fascinating endeavors than wars. In his Nobel acceptance speech Martin Luther King Jr. further underlined that idea which would become the basis of the transcendentist school (e.g. Aberkane):\nVarious scholars (Suter 1986, Aberkane 2012, Roberts 2009) and politicians (Seiberling 1972) have thus advocated that peace profiteering should simply be made palatably larger than any possible war profiteering, thus transcending the war against war. However, the first generations of Peace-Industrial scholars have advocated frontal opposition to the military–industrial complex rather than its transcendent, voluntary metamorphosis into a globally benevolent yet very profitable peace-industrial complex.\nIn 1986 Keith D. Suter defended his Ph.D dissertation on Creating the political will necessary for achieving multilateral disarmament: the need for a peace-industrial complex, which was further cited in 1995. The concept of a Peace-industrial complex had already been introduced as early as in 1969 in the U.S. Senate Committee on Government Operations. The original quote affirmed direct opposition to the military-industrial complex and was therefore not transcendent in nature: \"It is time for the United States to break the Huge military-industrial complex and begin in its stead a people and peace-industrial complex\". It received further citation throughout the 1970s. The notion appeared in the United States Congress House Committee on Science and Astronautics, Subcommittee on Science, Research, and Development in 1972   in a congressional address by US Rep. J. F. Seiberling (1972)\nSuter further defended that \"each country create a national Ministry for Peace\", which was contemporary to the creation of the Ministry for Peace Australia (MFPA) initiative and the Global Alliance for Ministries & Infrastructures for Peace (GAMIP). An Education for a Peace Industrial Complex conference (EPIC) is also mentioned in a 1984 issue of Nuclear Times magazine.\nIf Kofi J. Roberts  explicitly called for the substitution of a military-industrial complex by a peace industrial complex which would enable the focusing on federal spendings on construction rather than destruction, Idriss J. Aberkane further defended the transcendent approach to the peace-industrial complex by calling it the \"military-industrial complex 2.0\" and thus neither the enemy nor the political complement to the military industrial complex but rather its natural, inevitable evolution on the account that investors (either institutional or private) will inevitably realize the larger profitability of construction over destruction. Aberkane also advocates the political viability of a peace-industrial complex by declaring that in the 21st century, what he calls \"weapons of mass construction\" will grant much larger political leverage, leadership and soft power than weapons of mass destruction.\nSee also\n* Anti-militarism\n* Jimmy Carter\n* Anti-war movement\n* Martin Luther King Jr.\n* Peace movement\nReferences\n* John Gittings The Glorious Art of Peace Oxford University Press 2012\n* Frederick Joseph Libby War on War: campaign textbook The National council for reduction of armaments, 1922\n* R Craig Nation War on war: Lenin, the Zimmerwald Left, and the origins of communist internationalism Duke University Press 1989\n* Isaac Lewin War on War, Shengold Publishers, 1969"
    }
  ]
}