{
  "content": [
    {
      "type": "text",
      "text": "# War, Inc.\n\n| producer       =\n| starring       =\n| cinematography = Zoran Popovic\n| editing        = Michael Berenbaum\n| music          = David Robbins\n| studio         =\n| distributor    = First Look Studios\n| released       =\n| runtime        = 106 minutes\n| country        = United States\n| language       = English\n| budget         = $10 million\n| gross          = $1.2 million\n}}\nWar, Inc. is a 2008 American political action comedy film directed by Joshua Seftel and starring John Cusack and Hilary Duff. Cusack also co-wrote and produced the film.\nPlot\nIn a bar in Nunavut, hitman Brand Hauser shoots and kills three men. He takes pictures of the men with his phone, sends the pictures, and then throws the phone into a burning garbage can.\nHauser is then seen on a plane getting directions and life advice from the on-board navigation system, Jerry. He turns on his screen to receive a video call from the former Vice President who gives him his next mission: to terminate Omar Sharif, the CEO of the oil company Ugigas in Ugigistan. He tells Hauser that he will be working under the Viceroy, whose identity is still being withheld until further notice. He also tells Hauser that his cover will be a trade show host, working with Tamerlane, a huge corporation that specializes in advertising. He must produce a trade show and a gala wedding as a finale, and still manage to kill Omar Sharif before he makes his plane back to Ugigistan.\nHe is taken by a car to the safe Emerald City within the fictional war-torn desert country of Turaqistan. In the Tamerlane building, he meets Marsha, his assistant for the mission. Once inside the building, he notices a reporter, Natalie Hegalhuzen attempting unsuccessfully to get inside the Tamerlane building. Natalie attempts to find out why she can't get into Tamerlane, and after asking him several questions, is rushed out of the room by Hauser who doesn't want to reveal any personal details about himself. He does arrange for her to have drinks with him which she accepts. Hauser visits the Viceroy in a secret location hidden in a Popeyes restaurant, who tells him what he needs to do. The Viceroy (who cannot be seen, but only heard with an altered voice) informs Hauser that the grand finale of the Trade Show he's supposed to prepare will be a wedding for Yonica Babyyeah, an oversexed, Central Asian pop star. He meets briefly with her and her fiancé, Ooq-Mi-Fay.\nLater, Natalie meets Hauser at a restaurant where he gives her an all-access pass to the Trade Show. She arrives at the rehearsal and is greeted by Hauser and Marsha, who quickly go to watch Yonica's rehearsal. Her oversexed appearance and slight attraction for Hauser make him throw up on Natalie's coat and he walks out. After talking to Jerry in his car, he drinks some hot sauce and then has a flashback. He sees himself telling his fellow hitman Walken that he is tired of killing and wants to quit. He and Walken engage in a brief struggle in which he shoots Walken and leaves him for dead in the back of a garbage truck.\nAfter receiving a delivery from a dry-cleaner in Germany, Hauser returns Natalie's now-clean coat to her at her hotel. He asks her out for coffee and confesses his habit of drinking hot sauce when he's nervous. She then confesses that she doesn't despise him at all, and the two build up a small friendship. He is later visited by Yonica in his office. She tries to seduce him, but he rebuffs her. He later sees her when he is in a restaurant with Sharif and Natalie. Hauser takes Natalie home, where she kisses him. Embarrassed, she quickly rushes out of the car. She sees him the next day and asks for a pass out of the Emerald City. He gives her a card that he received earlier by videomakers who are big in the Arts Community, and might give her a good lead. Hours later, he visits Yonica and listens to her sing a beautiful ballad; from here on out, he develops a paternal affection for her.\nMeanwhile, Natalie buys the cover for a pornographic video that the videomakers were going to shoot on Yonica's wedding night, and leaks it to the American press. After a confrontation with Ooq-Mi-Fay (who was involved in the making of this video), Hauser decides that the only way to continue with the wedding peacefully is to blame everything on Ooq-Mi-Fay's friend Bhodi Bhundhang. Bhodi hunts him down and tries to kill him in a big house that Yonica is supposed to do an interview in. There, Hauser reveals his past to Natalie and Yonica, and how his wife was killed and his daughter was kidnapped. He is interrupted when he hears a gun and rushes to another room, where he is forced to fight Bhodi. He kills Bhodi in front of Natalie and Yonica, who flee the house, horrified. They rush off into a cab, where Yonica asks Natalie to be her bridesmaid; Natalie accepts. Six hours before the wedding, Hauser receives a ransom video from what appears to be a gang of terrorists, who have taken Natalie hostage. Hauser travels to a nearby city named Fallaf, saves Natalie, and makes it to Room 1101, where he had planned to meet and kill Sharif. Hauser has a change of heart and lets Sharif live, and in return is informed \"the ultimate chicken-hawk is nearby\". Realizing what this means Hauser goes to the Viceroy's secret location, and breaks down the glass to reveal the man behind the screen. The Viceroy is actually Walken &mdash; the man who killed Hauser's wife and kidnapped his daughter.\nHauser asks Walken what he did with his daughter, and finds out that Yonica was actually his daughter all along. He rushes to tell Yonica at the wedding, and arrives there right before Walken destroys the building, accidentally killing himself in the process. Fortunately, Hauser, Natalie, and Yonica survive, and rush off to a plane that Yonica and Ooq-Mi-Fay were supposed to fly off in. Once they are airborne, and have presumably escaped, we see a trailing missile about to strike the aircraft. The Vice President reveals his next plan to attack neighboring Ugigistan, blaming them for the bombing of the Emerald city, and terrorist incidents in Turaqistan.\nCast\npremiere.]]\n* John Cusack as Brand Hauser, a CIA-trained hitman posing as a trade show producer.\n* Hilary Duff as Kara Hauser / Yonica Babyyeah, a beautiful Central Asian pop star.\n** Katerina Grableva as Young Kara Hauser\n* Shirly Brener as Hauser's Wife\n* Marisa Tomei as Natalie Hegalhuzen, a reporter for liberal magazines\n* Ben Kingsley as Viceroy Walken, a former CIA officer who Hauser worked for and is now the head of Tamerlane Industries.\n* Joan Cusack as Marsha Dillon, an undercover operative for Tamerlane Industries.\n* Dan Aykroyd as The Former Vice President, working for Tamerlane Industries.\n* Ben Cross as 'Medusa Hair'\n* Lyubomir Neikov as Omar Sharif, CEO of the oil company Ugigas of Ugigistan.\n* Sergej Trifunović as Ooq-Mi-Fay Taqnufmini, husband-to-be of Yonica Babyyeah\n* Nikolay Stanoev as Bhodi Bhundhang\n* Velizar Binev as German Businessman\n* Doug Dearth as Geoff\n* George Zlatarev as Director\n* Bashar Rahal as Video Guy #1\n* Velislav Pavlov as Video Guy #2\n* Zachary Baharov as Video Guy #3\n* Ned Bellamy as Zubleh / Ooq-Yu-Fay Taqnufmini\n* Montel Williams as GuideStar Jerry, a navigational system similar to OnStar which also functions as Hauser's de facto therapist.\n* Sandy Schklair as Submarine Captain\n* John McLaughlin as himself\nProduction\non April 28, 2008.]]\nWar, Inc. is thought to be an informal sequel to the 1997 film Grosse Pointe Blank. Both films are similar in style and theme, and both films star John Cusack as an assassin and Joan Cusack as his assistant, with Dan Aykroyd in a supporting role. In an interview, Joan Cusack said, \"I think, in a way, [War, Inc.] was a Grosse Pointe Blank 2.\" John Cusack described it as a \"spiritual cousin to Grosse Pointe Blank\".\nJohn Cusack co-wrote and produced the film, as well as starring in the lead role as Brand Hauser. A working title of the film was Brand Hauser: Stuff Happens. The story is partly inspired by Naomi Klein's ''Harper's Magazine article \"Baghdad Year Zero\".\nWar, Inc. was filmed at Nu Boyana Film Studios in Bulgaria beginning in late October 2006.\nReception\nCritical response\nWar, Inc. received generally negative reviews from critics. Review aggregator Rotten Tomatoes gives the film a rating of 29% based on 86 reviews, with the consensus that the film \"attempts to satirize the military industrial complex, but more often than not it misses its target\".\nMetacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, gives the film a score of 37 based on 21 reviews.\nRoger Ebert gave the film two stars out of four, describing the film as a \"brave and ambitious but chaotic attempt at political satire\". He praises Cusack for bravery and the determination to make a film that is uncompromising and sets out to make a statement, but concedes he wanted to like the film more than he could.\nPhilip Marchand of the Toronto Star'' is critical of the crude satire of the film, unimpressed by Dan Aykroyd as a Dick Cheney-like figure we see delivering a televised rant while sitting on the toilet. He judges the film to be more about resurrecting Cusack's role as a hitman from Grosse Pointe Blank. He goes on to describe it as fast-paced, full of shooting, but ultimately \"as corrupt as the politics it attempts to satirize\".\nReviewer Reyhan Harmanci complained that the film tried so hard to be clever but treated the viewer like an idiot.\nThe film earned a Razzie Award nomination for Ben Kingsley as Worst Supporting Actor.\nBox office\nWar, Inc. opened on an extremely limited release in only two theaters across the United States on May 23, 2008. It grossed an estimated $36,600 in those two theaters during its opening weekend. The film went on to open in a further 30 theaters across the United States.\nIt was second in largest per theater gross behind Indiana Jones and the Kingdom of the Crystal Skull. It closed on August 7, 2008, without a wide release, grossing only $580,862 domestically in fewer than 40 theaters across the United States and Canada.\nHome media\nWar, Inc. was planned to have a fast DVD release date of July 1, but was delayed three months to maximize the impact of the theatrical release. The film was released later on DVD on October 14, 2008 in the US and acquired $883,364 in the opening weekend, selling 60,534 DVD units.\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}