{
  "content": [
    {
      "type": "text",
      "text": "# War of the Thuringian Succession__disambig_1\n\nThe War of the Thuringian Succession (German: Thüringisch-hessischer Erbfolgekrieg) (1247–1264) was a military conflict over a successor to the last Landgrave of Thuringia for control of the state of Thuringia (now in modern-day Germany).\nCause of the conflict\nWith the death of the childless Landgrave Henry Raspe in 1247, the Ludowingian line of Thuringian landgraves became extinct in the male line. His property included not only large parts of Thuringia, but also the Countship of Hesse had come into Ludowingian possession through the female line. In 1122, before his acquisition of the title of Landgrave, Count Louis I of Thuringia had married Hedwig of Gudensberg, the female heir of the Hessian comital family of the Gisonen. The Gisonen, whose lands were initially mainly in the upper Lahn area, had previously come into the significant inheritance of Count Werner in Lower Hesse. Then, through the marriage of Giso IV with Kunigunde of Bilstein, they had also acquired widespread property and vogtship rights from the Counts of Bilstein.\nClaims on the Ludowingians' inheritance were made by Henry Raspe's niece and his nephew. Sophie of Thuringia, married to Henry II, Duke of Brabant and Lothier, was the daughter of Henry Raspe's brother Louis IV and she claimed the territories on behalf of her son Henry. (Sophie's sister Gertrude was abbess of the imperial convent of Altenberg in Wetzlar and thus excluded from the succession.) Henry III, Margrave of Meissen, was the son of Henry Raspe's older sister Jutta. Another competitor was the Archbishop of Mainz, who could claim Hesse was a fiefdom of the Archbishopric and now, after the extinction of the Ludowingians, demanded its return.\nResults of the war\nThe war lasted over 17 years. Sophie did not succeed in winning the overall Ludowinger inheritance for her son Henry, but the war secured his Hessian possessions. This created the Landgraviate of Hesse. The Margrave of Meissen acquired Thuringia and also the title of Landgrave of Thuringia.\nThe importance of the dispute and its outcome lies in that an increasingly strong territorial principality of Hesse emerged and that, at the same time, the goal of the Ludowingians of building a strong territorial base in the heart of Germany through the combination of Hesse and Thuringia, came to an end. The Wettiners of the Margraviate of Meissen did subsequently achieve this goal. With the acquisition of the Electorate of Saxony in 1423, they gained a centre of power on the Elbe.\nSee also\n* Thuringian Counts' War (1342–1346), which had its origins in the War of the Thuringian Succession\n*  (1469–1470)\n* War of the Katzenelnbogen Succession (1500–1557) involving Hesse and Nassau-Siegen\n* Hessian War (1567–1648)\nReferences\n*"
    }
  ]
}