{
  "content": [
    {
      "type": "text",
      "text": "# War Crimes Act of 1996\n\n| cite statutes at large =\n| acts amended =\n| acts repealed =\n| title amended = 18\n| sections created = renumbered from ยง2401 through the Economic Espionage Act of 1996 ยง605(p)(1)\n| sections amended =\n| leghisturl = http://thomas.loc.gov/cgi-bin/bdquery/z?d104:HR03680:@@@S\n| introducedin = House\n| introducedbill =\n| introducedby = Walter B. Jones, Jr. (R-NC)\n| introduceddate = June 19, 1996\n| committees = House Judiciary\n| passedbody1 = House\n| passeddate1 = July 29, 1996\n| passedvote1 = voice vote\n| passedbody2 = Senate\n| passeddate2 = August 2, 1996\n| passedvote2 = unanimous consent\n| signedpresident = Bill Clinton\n| signeddate = August 21, 1996\n| amendments = Military Commissions Act of 2006\n| SCOTUS cases =\n}}\nThe War Crimes Act of 1996 is a United States federal statute that defines a war crime to include a \"grave breach of the Geneva Conventions\", specifically noting that \"grave breach\" should have the meaning defined in any convention (related to the laws of war) to which the United States is a party. The definition of \"grave breach\" in some of the Geneva Conventions have text that extend additional protections, but all the Conventions share the following text in common: \"...&nbsp;committed against persons or property protected by the Convention: willful killing, torture or inhuman treatment, including biological experiments, willfully causing great suffering or serious injury to body or health.\"\nThe law applies if either the victim or the perpetrator is a national of the United States or a member of the U.S. Armed Forces. The penalty may be life imprisonment or death. The death penalty is only invoked if the conduct resulted in the death of one or more victims.\nThe Act was passed with overwhelming majorities by the United States Congress and signed into law by President Bill Clinton.\nLegislative history\nThe law criminalized breaches of the Geneva Conventions so that the United States could prosecute war criminals, specifically North Vietnamese soldiers who imprisoned and tortured U.S. military personnel during the Vietnam War. The Department of Defense \"fully support[ed] the purposes of the bill,\" recommending that it be expanded to include a longer list of war crimes. Because the United States generally followed the Conventions, the military recommended making breaches by U.S. military personnel war crimes as well \"because doing so set a high standard for others to follow.\" The bill passed by unanimous consent in the Senate and by a voice vote in the House, showing that it was entirely uncontroversial at the time.\nTen years later, the United States Supreme Court ruled in Hamdan v. Rumsfeld that Common Article 3 of the Geneva Conventions applied to the War on Terrorism, with the unstated implication that any interrogation technique that violated Common Article 3 constituted war crimes. The possibility that American officials and military personnel could be prosecuted for war crimes for committing the \"outrages upon personal dignity, in particular humiliating and degrading treatment\" prohibited by the Conventions led to a series of proposals to make such actions legal in certain circumstances, which resulted in the Military Commissions Act of 2006.\nPotential application\nWhite House officials were concerned that they and other U.S. officials could be prosecuted under the War Crimes Act of 1996 for the U.S. treatment of detainees after the September 11 attacks for violations of the Geneva Conventions. In a January 2002 memorandum to the president, then-White House Counsel Alberto Gonzales authored a controversial memo that explored whether Common Article 3 of the Geneva Conventions applied to Al Qaeda and Taliban combatants captured during the war in Afghanistan and held in detention facilities around the world, including Camp X-Ray in Guantanamo Bay, Cuba. The memo made several arguments both for and against providing Common Article 3's protections to Al Qaeda and Taliban combatants. He concluded that Common Article 3 was outdated and ill-suited for dealing with captured Al Qaeda and Taliban combatants. He described as \"quaint\" the provisions that require providing captured Al Qaeda and Taliban combatants \"commissary privileges, scrip, athletic uniforms, and scientific instruments\". He also argued that existing military regulations and instructions from the President were more than adequate to ensure that the principles of the Geneva Conventions would be applied. He also argued that undefined language in the Geneva Conventions, such as \"outrages upon personal dignity\" and \"inhuman treatment\", could make officials and military leaders subject to the War Crimes Act of 1996 if mistreatment was discovered.\nThe adoption of the Military Commissions Act of 2006 marked grave abuses of Common Article 3 to only include torture, cruel or inhumane treatment, murder, mutilation or maiming, intentionally causing serious bodily harm, rape, sexual assault or abuse, and the taking of hostages, thereby limiting the scope of the original law.\nOn December 6th, 2023, the first charges under this law were unsealed by the Department of Justice in a press conference by Attorney General Merrick Garland. The charges are against four Russian soldiers. The charges are based around a case as a result of the Russo-Ukrainian War, in which an American citizen living in Ukraine was detained by Russian soldiers for a period of 10 days in April 2022, during which he was allegedly tortured. However, the American government has no means to arrest the people charged.\nSee also\n* Abu Ghraib torture and prisoner abuse\n* Command responsibility\n* Human rights in the United States\n* The International Criminal Court and the 2003 invasion of Iraq\n* Nuremberg Trials\n* The Prosecution of George W. Bush for Murder\n* United States and the International Criminal Court\n* Vietnam War Crimes Working Group Files\n* War crimes committed by the United States\nReferences\nExternal links\n*[http://thomas.loc.gov/cgi-bin/query/z?c104:H.R.3680: Federal Law 18 USC Sec. 2441]  known as the \"War Crimes Act\"\n*[https://assembler.law.cornell.edu/uscode/18/2441.html US Code, Part I, Title 18, Chapter 118, section 2441]\n* Human Rights First; [http://www.humanrightsfirst.org/wp-content/uploads/pdf/07801-etn-leave-no-marks.pdf Leave No Marks: Enhanced Interrogation Techniques and the Risk of Criminality] , August 2007"
    }
  ]
}