{
  "content": [
    {
      "type": "text",
      "text": "# War of Deposition against Jöns Bengtsson Oxenstierna\n\n| commander1        = Nils Bosson Sture  Sten Gustavsson Sture  Erik Axelsson Tott  Ivar Axelsson Tott\n| commander2        = Jöns Bengtsson Oxenstierna  David Bengtsson  Erik Nilsson Oxenstierna  Erik Karlsson Vasa   Claus Rønnow   Christian I  Karl Ragvaldsson  Unknown bailiff\n| units1            = Fleet from Viborg  Stockholm garrison\n| units2            =  Danish fleet\n| strength1         = At least 300 men  Unknown amount of ships\n| strength2         = At least 300 men  Unknown amount of ships\n| casualties1       = Heavy\n| casualties2       = Half of the Danish fleet destroyed\n}}\nThe War of Deposition against Jöns Bengtsson Oxenstierna () occurred during the years of 1466 and 1467, when, after Archbishop Jöns Bengtsson razed Penningsby, Nils Sture revolted. He quickly gained the support of the people in Gästriksland, arresting Jöns Bengtsson's baillif there.\nIn September, the Tott family declared one of their members, Erik Axelsson Tott, as the new riksföreståndare after threats were made on Jöns Bengtsson's life. The Tott family also possibly gained control of Stockholm through a coup, although other sources claim it was given to Ivar Gren.\nAfter a sortie from Stockholm by its defenders on 31 August, a Danish fleet led by Claus Rønnow and the Danish king, Christian I, was forced to withdraw. Jöns Bengtsson barely managed to make it on, and half of the Danish fleet was lost during the withdrawal. On 15 November, Karl Knutsson was crowned as the king for the third time, and Jöns Bengtssson died on 15 December while on Öland.\nBackground\nAfter the deposition of Karl Knutsson in 1465, dissatisfaction with Jöns Bengtsson Oxenstierna had grown. The general populace believed that Jöns Bengtsson wished to once again make Christian I the Swedish king, the priest's were upset that he wanted power and Karl Knutsson still had friends among the nobility. Soon, flyer's circulated the country criticizing Jöns Bengtsson and at a gathering in Mora, the attendees declared that they refused to pay taxes to anyone other than Karl Knutsson.\nIn 1466, when Nils Sture did not show up to a summons by Jöns Bengtsson, he sent 50 men to capture him and they razed Penningsby, which was owned by Nils Sture. However, Nils Sture was in Finland at the time. Nils Sture was an old friend of Knutsson, and he immediately demanded compensation in a meeting in Stockholm in mid-September which was met with mockery from Jöns Bengtsson. They also exchanged threats.\nDeposition\nAfter the razing of Penningsby, Nils Sture decided to go to Gästrikland to convince the population there to join his cause. Soon after arriving, he became the leader of a group of people and imprisoned Jöns Bengtsson's bailiff there. From there, the uprising spread into Hälsingland. When Jöns Bengtsson learned of the spreading uprising, he dispatched 300 men under the command of David Bengtsson northwards. Sture retreated, but he soon marched to Västerås due to his growing army.\nIn September, the powerful Tott family decided to seize power in Sweden. They quickly declared Erik Axelsson Tott as the new riksföreståndare with the help of several powerful nobles. Despite the thus-far successful revolt, many were still loyal to Christian I, including Magnus Gren, Ture Turesson Bielke, and Staffan Bengtsson Ulf. The Tott family managed to capture Stockholm through a coup in October and convinced Jöns Bengtsson to renounce his position as riksföreståndare after threatening to kill him. Other sources claim Jöns Bengtsson willingly handed Stockholm Castle to Ivar Gren with the condition that he would \"keep the lot\" for him and Christian I.\nIn November, the peoples of Dalarna, Hälsingland, Medelpad, Ångermanland, Uppland, Västmanland, and Norrbotten made a declaration calling for Karl Knutsson's return to Sweden. While they awaited a response from Knutsson, Nils Sture managed to capture Västeråshus and Jöns Bengtsson fled to Denmark.\nBattle of Arboga\nIn an attempt to fight for Oxenstierna, Erik Nilsson Oxenstierna and Erik Karlsson Vasa sent 70 men under the command of Karl Ragvaldsson. He was initially successful, capturing 24 rebels in an attack but his force was ambushed by Nils Sture after he heard of it and Ragvaldsson was imprisoned. In May, Nils Sture went to Dalarna to gather more forces and encountered Erik Nilsson and forces from Närke at Arboga. The ensuing battle ended with a defeat for Sture and forcing him to withdraw into Dalarna with some losses.\nBattle of Kolbäcksån\nflowing into the Mälaren]]\nAfter the battle at Arboga, Erik Nilsson marched into Västerås with \"much severity\". Soon after, Nils Sture met Erik Nilsson once more at Kolbäcksån. Nils Sture had around 300 men. During the fighting, both sides attempted to get across the river with heavy casualties and neither being successful, though it ended in a victory for Jöns Bengtsson's forces. Another version of the battle claims it occurred in 1466 with the end result being Nils Sture acquiring Västeråshus.\nSiege of Stockholm\nAfter midsummer, Nils Sture marched into Uppland. During this, Erik Axelsson Tott began gathering forces in Roslagen to attack forces loyal to Jöns Bengtsson that had been assembled by Ivar Gren. However, this attempt failed, and Axelsson was forced to withdraw to Stockholm which was soon besieged by Erik Nilsson and Ivar Gren. In the summer, it appeared as if Jöns Bengtsson was close to a victory with the Tott's stuck in Stockholm and Nils Sture now in Dalarna. Additionally, a Danish fleet under the command of Claus Rønnow sailed into Stockholm, with Christian I himself in the fleet. Using some fireships, the Danes managed to destroy a bathhouse in the city, but otherwise the siege was not particularly successful. Erik Karlsson Vasa was also sent to defeat a force at Södertälje which planned to attack the besiegers from the rear.\nDuring the siege, when things were looking good for Jöns Bengtsson, Ivar Axelsson Tott, the commander at Viborg, declared war on Denmark. He immediately sent a fleet to Sweden which put the Danish fleet in danger of being trapped. Thus, they withdrew, and the Danes instead planned to meet Ivar Axelsson's fleet and defeat it. Instead, Ivar Axelsson sailed to Nyköping.\nBattle of Julita slätt\nfrom 1677 by Anders Andersson]]\nWhen Ivar Axelsson arrived at Nyköping, he met up with Arvid Trolle and began marching against Örebrohus, with their goal most likely being to split the besieging army around Stockholm. When Erik Nilsson heard of the march, he immediately went to Örebro in order to save his castle there. At Julita slätt, near the sea Öljaren Erik Nilsson was decisively defeated and only managed to retreat with a handful of troops left.\nSortie of Stockholm\nOn 31 August, Erik Axelsson Tott under the cover of night sortied from Stockholm, attacking the besieging army. He then planned to march across Kungsholmen and then attack the Danes from the rear. Once he did, the Danes, who were not strong enough and believed that a force under Nils Sture was coming from the north, fled. Rønnow and Jöns Bengtsson managed to escape onto a ship. When the Danish fleet began withdrawing, ships from Stockholm followed them out of the archipelago during which half of the fleet was lost.\nLast battles\nAfter the successful sortie, any remaining resistance quickly collapsed. The remaining supporters of Jöns Bengtsson in Uppland were defeated, Karl Knutsson Gera defeated those in Östergötland along with capturing Stegeborg. Erik Nilsson Oxenstierna, Ivan Gren, and Erik Karlsson Vasa also fled into southern Sweden.\nAftermath\nAfter landing on Öland, Jöns Bengtsson would die on 15 December, with Karl Knutsson having returned to Stockholm on 12 November. Knutsson was also re-elected as the Swedish king for the third time on 15 November. The Tott family withdrew to their territory in Finland, believing they didn't have the strength to fight Karl Knutsson. Despite Karl's election as king, Axevall, Kalmar, Älvsborg, and Borgholm remained in the hands of loyalists to Christian I.\nSee also\n*\n*\nReferences\nWorks cited\n*\n*\n*\n*"
    }
  ]
}