{
  "content": [
    {
      "type": "text",
      "text": "# War of the Visions: Final Fantasy Brave Exvius\n\n| image = War of the Visions FFBE Key Art.jpg\n| developer = Square Enix, Gumi Inc.\n| publisher = Square Enix\n| director =\n| producer = Kei HironoHiroki Fujimoto\n| artist = Ryoji Ohara\n| writer =\n| composer = Noriyasu Agematsu\n| series = Final Fantasy\n| platforms = Android, iOS\n| released =\n| genre = Tactical role-playing game\n| modes =\n}}\nis a tactical role-playing game co-developed by Square Enix and Gumi Inc. and published by Square Enix for iOS and Android devices. It is a spin-off of Final Fantasy Brave Exvius that draws inspiration from the Final Fantasy Tactics series of games. The game was released exclusively for Japan in November 2019, and a global version was released in March 2020.\nOn March 25, 2025, it was announced that the Global version would be discontinued on May 29, 2025. Service for the Japanese version is ongoing.\nGameplay\nThe game features similar gameplay elements to The Alchemist Code by Gumi and the Final Fantasy Tactics series of games, especially The War of the Lions, such as a 3D, grid-based map and turn-based tactical combat. Elements common to many games of the Final Fantasy series, such as Esper summoning are also present.\nOther aspects of gameplay are similar to the original Final Fantasy Brave Exvius, with free-to-play features such as gacha systems for 'summoning' new characters to use in combat, including via in-app microtransactions. Each character includes a level progression system, and the ability to unlock new abilities.\nThe game's dialogue is fully voice-acted, and the global release includes dual audio language options.\nPlot\nThe story takes place on the continent of Ardra on the world of Lapis, the primary setting of Final Fantasy Brave Exvius, and depicts a war among five rival nations that occurred in the distant past. As in the original title, the war is waged using the power of Visions, physical manifestations of powerful warriors from different eras and worlds summoned using Crystals.\nThe continent of Ardra is also referenced in Brave Exvius and was depicted on the game's original world map, but is currently inaccessible and obscured by clouds.\nDevelopment\nWar of the Visions: Final Fantasy Brave Exvius was announced in Japan in December 2018 at FFBE Fan Festa, a convention celebrating the original title's third anniversary. Unlike with the original Brave Exvius, which was developed by Gumi subsidiary Alim and published by Square Enix, War of the Visions is co-developed by Square Enix and Gumi. The two Brave Exvius titles are developed and operated in parallel.\nThe game's logo is illustrated by series veteran Yoshitaka Amano, who also provided numerous character and key art illustrations for the original Brave Exvius, and the game's key art was illustrated by Isamu Kamikokuryo, setting art director for Final Fantasy XII, the XIII trilogy, and XV. The artwork for the game is being handled by CyDesignation, with Ryoji Ohara acting as main character designer under the supervision of Akihiko Yoshida, lead character designer for Final Fantasy Tactics, XII, and XIV.\nRelease\nPre-registration for the Japanese version of the app was announced with a gameplay trailer on June 9, 2019, followed on June 10 by an English-language announcement at the Square Enix E3 press conference that the game would launch worldwide. The game was released in Japan on November 14, 2019, and receives regular weekly content updates.\nA pre-registration campaign for the global version of the app began on February 20, 2020. Pre-registration earned players in-game rewards, dependent upon the total number of pre-registrations before the global launch. The game was released globally for both iOS and Android on March 25.\nReception\nWithin 10 days of release, the Japanese version of the game had been downloaded over 3 million times, and by February 2020 had been downloaded over 9 million times.\nBy the end of March 2020 (a week after its initial release), the worldwide version of the game had been downloaded over 1 million times, and by April, had been downloaded over 2 million times.\nAreas of praise given by reviews of the game included its single-player storyline and voiceover performances, though areas of criticism included its complexity level and balancing during PVP matches.\nGacha scandal\nOn June 29, 2021, the Consumer Affairs Agency (CAA) of Japan accused Square-Enix and Gumi of violation of \"Act against Unjustifiable Premiums and Misleading Representations\" (景品表示法), after receiving complaints about the previous gacha campaigns of rare characters and items. Those gachas were suspected of unethical manipulation of the lottery results, resulting multiple different players receiving the exact same combinations of otherwise supposedly random prizes. The CAA did not issue any penalty against the 2 corporations but an administrative order, demanding serious self-regulatory measures to prevent the same problem from happening again.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}