{
  "content": [
    {
      "type": "text",
      "text": "# War crimes in Afghanistan\n\nWar crimes in Afghanistan covers the period of conflict from 1979 to the present. Starting with the Soviet invasion of Afghanistan in 1979, 40 years of civil war in various forms has wracked Afghanistan. War crimes have been committed by all sides.\nSince the Taliban's emergence in the 1990s, its crimes include extrajudicial killings of civilians during its period running the Islamic Emirate of Afghanistan, systematic killing of civilians and wartime sexual violence during the 2010s, and executions of civilians during the 2021 Taliban offensive.\nTaliban\nExtrajudicial killings of civilians\nIslamic Emirate of Afghanistan (1996–2001)\nIn its military takeover of Mazar-i-Sharif starting on 8 August 1998, the Taliban shot dead and slit the throats of civilians, mostly Hazaras, and some Tajiks and Uzbeks, from around 10:30 until midday. Executions continued through 13 or 14 August. The Taliban carried out massacres in May 2000 and January 2001, primarily of Hazaras. In the May 2000 Robotak Pass massacre, 31 people were killed by Taliban forces, among whom 26 were \"positively identified as civilians\" by Human Rights Watch (HRW). For four days starting on 8 January 2001, Taliban forces shot dead 170 civilians in Yakawlang by firing squad.\nArmed opposition (2001–2021)\nThe Afghanistan Independent Human Rights Commission (AIGRC) called the Taliban's terrorism against the Afghan civilian population a war crime. According to Amnesty International, the Taliban commit war crimes by targeting civilians, including killing teachers, abducting aid workers and burning school buildings. Amnesty International said that 756 civilians were killed in 2006 in Taliban road bombs or suicide bombers.\nIn 2010, the Taliban systematically killed civilians in Afghanistan, usually based on claims of the victims supporting the Afghan government. A journalist interviewed by Amnesty International said that village elders refusing to cooperate with the Taliban were executed and posthumously accused of being \"American spies\".\nNATO has alleged that the Taliban have used civilians as human shields. As an example, NATO pointed to the victims of NATO air strikes in Farah province in May 2009, during which the Afghan government claims up to 150 civilians were killed. NATO stated it had evidence the Taliban forced civilians into buildings likely to be targeted by NATO aircraft involved in the battle. A spokesman for the ISAF commander said: \"This was a deliberate plan by the Taliban to create a civilian casualty crisis. These were not human shields; these were human sacrifices. We have intelligence that points to this.\" According to the US State Department, the Taliban committed human rights violations against women in Afghanistan, including the abduction of women and girls by the Taliban.\nIn 2011, The New York Times reported that the Taliban was responsible for three-quarters of all civilian deaths in the war in Afghanistan. United Nations reports have consistently blamed the Taliban and other anti-government forces for the majority of civilian deaths in the conflict. In 2013 the UN stated that the Taliban had been placing bombs along transit routes.\nIn 2015, Amnesty International reported that the Taliban committed mass murder and gang rape of Afghan civilians in Kunduz. Taliban fighters killed and raped female relatives of police commanders and soldiers as well as midwives. One female human rights activist described the situation in the following manner:\n\"When the Taliban asserted their control over Kunduz, they claimed to be bringing law and order and Shari'a to the city. But everything they've done has violated both. I don't know who can rescue us from this situation.\"\nIn 2015 in Kunduz, Taliban death squads used a hit list of civilians – \"activists, journalists and civil servants\", carried out house-to-house searches and killed them. Taliban forces entered the house of a wounded woman and shot her fatally in the head. On September 4, 2019, the Taliban kidnapped Afghan human rights activist Abdul Samad Amiri. His body was found the following day. Amnesty International has called Amiri's death a war crime.\n2021 Taliban offensive\nDuring the first half of 2021, Taliban forces were responsible for killing 699 civilians according to United Nations Assistance Mission in Afghanistan (UNAMA) or 917 according to the Afghan Independent Human Rights Commission (AIHRC). The Taliban were responsible for \"the vast majority\" of the destruction and looting of private homes and civilian infrastructure during May and June, according to UNAMA. The US and other countries started to pull out remaining troops in early 2021.\nOn 12 May 2021, Sohail Pardis, who had worked for 16 months as a translator for United States Armed Forces in Afghanistan, was beheaded by the Taliban after being pulled out of his car.\nOn 16 June, in Dawlat Abad, 22 unarmed Afghan Special Forces commandos were executed while attempting to surrender to Taliban forces. A video of the event circulated widely and was broadcast by CNN. Samira Hamidi of Amnesty International described the event as \"the cold-blooded murder of surrendering soldiers – a war crime\". She called for the event to be investigated as part of the International Criminal Court investigation in Afghanistan.\nIn July 2021 in Kandahar, Taliban forces extrajudicially executed critics and people thought to have been members of province-level governments and their relatives. Patricia Gossman of HRW stated that the \"Taliban commanders with oversight over such atrocities are also responsible for war crimes\". She described the executions as \"demonstrat[ing] the willingness of Taliban commanders to violently crush even the tamest criticism or objection\". Estimates of the number of civilians arbitrarily detained in the Taliban mid-July takeover of Spin Boldak range from 380 to 900, with the number arbitrarily executed ranging from 40 to 100.\nIn early July 2021 in Malestan District, Taliban forces killed civilians, looted private properties, set them on fire, and destroyed and looted shops. During 4–6 July 2021 in Mundarakht in Malestan District, the Taliban extrajudicially executed nine Hazaras. Hazaras have previously been persecuted by the Taliban. Three were tortured by Taliban security forces prior to their executions: Wahed Qaraman's legs and arms were broken, his hair was pulled out and he was beaten in the face; Jaffar Rahimi was severely beaten and strangled to death with his scarf; Sayed Abdul Hakim was beaten, had his arms tied and his legs shot before he was shot in the chest. Three were executed at a Taliban checkpoint and the other three were executed in Mundarakht.\nOn 15 July 2021, photojournalist Danish Siddiqui was killed in Spin Boldak, either in crossfire between Afghan National Security Forces (ANSF) and the Taliban or by execution after being captured by the Taliban. His body was mutilated, leaving his face unrecognisable and tyre marks on his face and chest.\nOn 22 July 2021, a popular comedian, Nazar Mohammad, known as \"Khasha Zwan\", was executed by the Taliban in Kandahar Province. The Times reported, with fighting raging on the outskirts of Kandahar, the second city, Nazar Mohammad, an entertainer, was dragged from his home and killed, by suspected Taliban forces.\nIn late July, four security force personnel and a hospital worker from Shakardara District were tortured by Taliban forces and executed. The cousin of one of the victims, Abdul Rahman, stated that the Taliban removed his cousin's eyes and tongue and ran a car over him before shooting him. A commander in the Afghan forces, Abdul Hamid, was executed by the Taliban near Herat after being taken prisoner.\nOn 6 August 2021, Taliban forces claimed responsibility for the 5 August assassination of Dawa Khan Menapal, head of the governmental media and information centre, in Kabul. On the same day, during which the Taliban took control of Zaranj, human rights activist Laal Gul Laal stated that the execution of 30 soldiers by the Taliban was a war crime. According to TOLOnews, some of the soldiers were tortured and had their eyes removed by the Taliban before they were killed. The Taliban stated that the soldiers had been killed in combat.\nOn 21 August 2021, a video showing Haji Mullah Achakzai, the ex-police chief of Badghis province, was shown blindfolded and restrained before he was shot to death by Taliban fighters at close range. It was reported on 30 August 2021 that Ghulam Sakhi Akbari, ex-police chief of Farha province, was killed at the Kabul-Kandahar highway.\nOn 2 September 2021, folk singer Fawad Andarab was executed by Taliban fighters after being taken from his house in Andarab Valley.\nOn 5 September 2021, Arabic-speaking Taliban fighters were singled out as the culprits for murdering a pregnant ex-police officer named Banu Negar in Firozkoh. According to Negar's family, she was eight months pregnant when three Taliban gunmen arrived at her family's house and tied up all of its occupants, before beating and shooting Negar dead in front of her husband and children.\nAccording to a Human Rights Watch's report released in November 2021, the Taliban killed or forcibly disappeared more than 100 former members of the Afghan security forces in the three months since the takeover in just the four provinces of Ghazni, Helmand, Kandahar, and Kunduz. According to the report, the Taliban identified targets for arrest and execution through intelligence operations and access to employment records that were left behind. Former members of the security forces were also killed by the Taliban within days of registering with them to receive a letter guaranteeing their safety.\nPanjshir conflict\nDuring the Panjshir conflict, the Taliban were accused of extrajudicial executions and blocking food supplies. A tribal elder said eight civilians were executed by them on 7 September. Amrullah Saleh's son Shuresh stated that his father's brother Rohullah Azizi, who had been executed alongside his driver on 9 September by the Taliban, after being stopped at a checkpoint. An investigative report published by the BBC on 13 September concluded that the Taliban had executed at least 30 civilians in Panjshir since they entered the valley at the beginning of September. Agence France-Presse reporters, allowed into Panjshir on 15 September, interviewed residents who claimed the Taliban had executed 19 civilians between the village of Khenj and Bazarak, and prevented civilians from fleeing the province in order to use them as human shields.\nSexual violence\nIn 2015 in Kunduz, Taliban forces carried out rape, including gang rape. One woman was gang-raped and executed by the Taliban as punishment for having provided reproductive health services to women.\nAnalysis\nOfficially, the Taliban has policies forbidding its members from killing civilians, cutting off certain body parts (e.g., noses and ears), or employing suicide attacks against targets lacking significant military value. It has established nominally independent commissions and disseminated phone numbers for anonymous reporting of incidents involving civilian attacks by its members, many of whom have been expelled or severely punished for violations.\nDespite these efforts, thousands of Afghan civilians have been killed in Taliban attacks since 2001, with the United Nations Assistance Mission in Afghanistan (UNAMA) attributing 74% of Afghan civilian casualties in 2013 to the Taliban. Max Abrahms states that the Taliban's leadership suffers from acute command and control problems due to the fractious nature of the organization and the impact of targeted killings of high-ranking Taliban officials by the U.S. military, which have tended to empower younger commanders more inclined to lash out against the civilian population. Abrahms found that when civilians are harmed, the Taliban often denies responsibility for attacks, sometimes even retracting initial claims of responsibility due to a mounting civilian death toll.\nSoviet Union\nNorthern Alliance\nIn December 2001, the Dasht-i-Leili massacre took place, where between 250 and 3,000 Taliban fighters who had surrendered, were shot and/or suffocated to death in metal truck containers during transportation by Northern Alliance forces. Reports place US ground troops at the scene. The Irish documentary Afghan Massacre: The Convoy of Death investigated these allegations and claimed that mass graves of thousands of victims were found by UN investigators and that the US blocked investigations into the incident.\nNATO and allies\n'']]\nSummary execution\nBy the United States\n2003 homicide of Abdul Wali\nOn 21 June 2003, David Passaro, a CIA contractor and former United States Army Ranger, killed Abdul Wali, a prisoner at a US base  south of Asadabad, in Kunar Province. Passaro was found guilty of one count of felony assault with a dangerous weapon and three counts of misdemeanor assault. On 10 August 2009, he was sentenced to 8 years and 4 months in prison.\n2010 Kandahar homicides\nDuring the summer of 2010, ISAF charged five United States Army soldiers with the murder of three Afghan civilians in Kandahar province and collecting their body parts as trophies in what came to be known as the Maywand District murders. In addition, seven soldiers were charged with crimes such as hashish use, impeding an investigation and attacking the whistleblower, Specialist Justin Stoner. Eleven of the twelve soldiers were convicted on various counts.\n2012 Kandahar massacre\nOn 11 March 2012, the Kandahar massacre occurred when sixteen civilians were killed and six wounded in the Panjwayi District of Kandahar Province, Afghanistan. Nine of the victims were children, and eleven of the dead were from the same family. United States Army Staff Sergeant Robert Bales was taken into custody and charged with sixteen counts of premeditated murder. Bales pleaded guilty to sixteen counts of premeditated murder as part of a plea deal to avoid a death sentence, and was subsequently sentenced to life in prison without parole and dishonorably discharged from the United States Army.\n2014 Amnesty International allegations\nIn November 2014, Amnesty International accused the Pentagon of covering up evidence related to war crimes, torture and unlawful killings in Afghanistan.\nBy Australia\nIn 2015, Dr Samantha Crompvoets was commissioned by the Australian Defence Force to write a report on the culture of Special Forces. Through her interviews with soldiers, Crompvoets documented \"competition killing and blood lust\" along with \"inhumane and unnecessary treatment of prisoners\". The allegations in Crompvoets' report involved soldiers in Australian, American and British armed forces. The findings became the basis for the independent commission that published the Brereton Report into war crimes committed by Australian Defence Forces.\nIn 2017, the Australian Broadcasting Corporation published a series of articles called The Afghan Files. The findings came from documents leaked to the ABC by Australian Defence Force lawyer David McBride. In response to the leak, the Australian Federal Police raided the ABC's offices in June 2019.\nIn August 2018, Australia's most decorated soldier Ben Roberts-Smith was linked in articles published by the Sydney Morning Herald, The Age and Canberra Times to a series of war crimes committed in Afghanistan during his tours of duty. Roberts-Smith subsequently launched a defamation lawsuit against the papers involved. The Publications filed a truth defence which was upheld by Justice Anthony Besanko in June 2023. Justice Besanko determined that based on civil standard of the \"balance of probabilities\" the claims were proven.\nIn November 2020, the Inspector-General of the Australian Defence Force publicly released a redacted version of the Brereton Report detailing misconduct by Australian troops in Afghanistan. Findings would predominantly focus on the SAS. Evidence was established for 39 unlawful killings by Australian forces, including murdering non-combatants and the execution of prisoners.\nFollowing the reports release, Prime Minister Scott Morrison established the Office of the Special Investigator to explore the possibility for criminal prosecution of Australian soldiers involved in the deaths of 12 afghan non-combatants. Chris Moraitis was appointed as the Director General in January 2021.\nDuring an Australian Senate Estimates hearing in February 2023, Moraitis described the agency as \"an investigative body trying to enforce Australian criminal law\" and stated that they were investigating between 40 and 50 alleged offences, with the first brief of evidence being due to be handed to prosecutors in the middle of that year.\n2012 homicide of Dad Mohammad\nIn May 2012, unarmed Afghan civilian Dad Mohammad was executed by an Australian soldier, who falsely told investigators that he acted in self-defence. Mohammad was shot three times while lying on the ground from a range of two metres. The killing was exposed in 2020 by a Four Corners documentary which focussed on atrocities committed by the Special Air Service Regiment. On 20 March 2023 a former Australian soldier was charged with murder in relation to the shooting in the first case of an ADF soldier facing charges for war crimes.\nBy the United Kingdom\nIn 2022, a BBC Panorama documentary titled 'SAS Death Squads Exposed: A British War Crime?' alleged that a single British SAS unit killed 54 people in suspicious circumstances, after a cache of emails from the group in charge of overseeing SAS operations was released. The British Ministry of Defence initially refused to comment, but later described these allegations as 'broadly accurate' in an internal memo.\nIn 2025, during the Afghanistan inquiry - set up after the Panorama exposé - a senior UK Special Air Service (SAS) officer testified that he believed the SAS operated under an unofficial policy to \"kill all [Afghan] males on target whether they posed a threat or not\", echoing a claim found in an internal SAS memo from April 2011.\nOutside of the inquiry, in May 2025, SAS veterans reported to BBC Panorama detailing allegations of war crimes, including the execution of children and 'routine' execution of detainees, facilitated by the planting of decoy grenades and pistols to prevent scrutiny by the Royal Military Police. Reports which could represent a breach of military rule were amended by members of the Special Forces legal team who \"coached\" the soldiers to add details that would increase the validity of the report. They also alleged that it was common for SAS squadrons and individual soldiers to keep kill counts in order to compete with each other.\n2011 Helmand murder\nA British Royal Marine Sergeant, identified as Sergeant Alexander Blackman from Taunton, Somerset, was convicted at court martial in Wiltshire of the murder of an unarmed, reportedly wounded, Afghan fighter in Helmand Province in September 2011. In 2013, he received a life sentence from the court martial in Bulford, Wiltshire, and was dismissed with disgrace from the Royal Marines. In 2017, after appeal to the Court Martial Appeal Court (CMAC), his conviction was lessened to manslaughter on the grounds of diminished responsibility and the sentence was reduced to seven years effectively releasing Blackman due to time served.\nAttacks on civilian objects\nBy the United States\n2015 Kunduz hospital airstrike\nOn 3 October 2015, a USAF airstrike hit a hospital operated by Doctors Without Borders in Kunduz during the Battle of Kunduz. 42 people were killed and over 30 were injured in the airstrike. Zeid Ra’ad al-Hussein, the United Nations High Commissioner for Human Rights said the airstrike may have been a war crime. Eleven days after the airstrike, a US tank entered the hospital compound. Doctors Without Borders officials said: \"Their unannounced and forced entry damaged property, destroyed potential evidence and caused stress and fear for the MSF team.\" The United States Central Command's investigation concluded that personnel failed to comply with the rules of engagement and the law of armed conflict, but that the airstrike was not a war crime, due to the lack of intentionality. The investigation found that the incident resulted from a mixture of human errors and equipment failures, and that none of the personnel knew they were striking a medical facility, Desk analysis by law professor Jens David Ohlin was inconclusive about a war crime being committed. Doctors without Borders rejected the US internal investigation, noting that it was undertaken by a party to the conflict and stated the bombing of a hospital was a violation of international humanitarian law.\nBy the Netherlands\nThe Chora Valley airstrike occurred on 17 June 2007, during the Battle of Chora, when Dutch F‑16s bombed a residential complex in Chora, Uruzgan Province, killing approximately 20 civilians, including women and children.\nSurvivors brought a civil suit, and in November 2022, the District Court of The Hague found the strike unlawful, ruling there was no sufficient evidence of Taliban presence at the time.\nIn February 2023, the Dutch government opted not to appeal and initiated compensation to victims' families. However, no individual soldier has faced criminal charges.\nBy Poland\nThe Nangar Khel incident occurred on 16 August 2007 in Paktika Province and resulted in six civilian deaths, including children and a pregnant woman, after Polish troops fired mortars and machine guns on a wedding party. Several Polish soldiers were court‑martialed, some acquitted, others given suspended sentences, but no one was convicted of war crimes. The case proceeded through multiple trials, including acquittals at the military district court (2011), a retrial ordered by the Supreme Court (2012), and final acquittals in 2015.\nThis incident is part of the ongoing 2020 International Criminal Court's investigation into war crimes in Afghanistan.\nTorture\nBy Canada\nCanadian troops were involved in several controversial incidents resulting in civilian casualties. These include the 2006 shooting of a civilian taxi passenger and a 10‑year‑old boy, as well as NATO airstrikes coordinated by Canadian forces in Kandahar that resulted in at least 17-26 civilian deaths, including women and children.\nThe Canadian Afghan detainee issue involved Canadian Forces transferring hundreds of prisoners to Afghan authorities despite credible reports of torture. Diplomat Richard Colvin testified in 2009 that detainees handed over by Canada were routinely tortured in Afghan custody. A 2012 Military Police Complaints Commission report cleared Canadian personnel of direct wrongdoing but found systemic failures in oversight and reporting procedures. Human rights groups and Canadian MPs have since called for a public inquiry.\nIn addition, a 2016 Department of National Defence inquiry acknowledged that reports of sexual abuse (including of minors) by Afghan forces were initially mishandled and not escalated up the chain of command, though it concluded that no Canadian troops were ordered to ignore such abuse. These incidents of sexual abuse occurred on Canadian military bases, including Kandahar Airfield and  Forward Operating Bases (FOBs) of Masum Ghar, Sperwan Ghar, and Wilson in the Panjwai and Zhari districts.\nBy the United States\n2002 prisoner torture at Bagram Theater Internment Facility\nIn 2002, two unarmed civilian Afghan prisoners were tortured and later killed by US armed forces personnel at the Bagram Theater Internment Facility (also Bagram Collection Point or B.C.P.) in Bagram, Afghanistan. The prisoners, Habibullah and Dilawar, were chained to the ceiling and beaten, which caused their deaths. Military coroners ruled that both the prisoners' deaths were homicides. Autopsies revealed severe trauma to both prisoners' legs, describing the trauma as comparable to being run over by a bus. Fifteen soldiers were charged, of which six were convicted.\nUse of white phosphorus\nWhite phosphorus has been condemned by human rights organizations as cruel and inhumane because it causes severe burns. White phosphorus burns on the bodies of civilians wounded in clashes near Bagram were confirmed. The US claimed at least 44 instances in which militants used or stored white phosphorus in weapons. In May 2009, the US confirmed that Western military forces in Afghanistan use white phosphorus to illuminate targets or as an incendiary to destroy bunkers and enemy equipment. US forces used white phosphorus to screen a retreat in the Battle of Ganjgal when regular smoke munitions were not available.\nLegal investigations\nInternational Criminal Court\nAn International Criminal Court (ICC) investigation in Afghanistan was authorised to proceed in 2020, after the collection of information from victims during 2017 and 2018, a 2019 request to open an investigation, a rejection of the request, and an overturning of the rejection of the request. The investigation concerns war crimes and crimes against humanity committed since 1 May 2003, in the context of the war in Afghanistan, by the Taliban and affiliated armed groups, war crimes by the Afghan National Security Forces, and war crimes committed in Afghanistan, Poland, Romania and Lithuania by United States Armed Forces and the United States Central Intelligence Agency (CIA).\nIn September 2018, the United States threatened to arrest and impose sanctions on International Criminal Court (ICC) judges and other officials if they charged any US soldiers who served in Afghanistan with war crimes. The US further stated it would not cooperate with the ICC if it carried out an investigation into allegations of war crimes by the US in Afghanistan. On 12 April 2019 a panel of ICC judges decided not to open an investigation regarding Afghanistan. The Court's chief prosecutor Fatou Bensouda provided a report that established \"a reasonable basis\" that crimes had been committed, but they decided against continuing because the US and other parties would not cooperate. In March 2020, senior judges at the ICC called for the investigation into war crimes by the US, Afghan and Taliban troops in Afghanistan, overturning the previous rejection of a probe into the US’ role in committing war crimes.\nAfghan Independent Human Rights Commission\nThe Afghan Independent Human Rights Commission (AIHRC) published a brief report after investigating the Taliban takeover of Spin Boldak on 14 July 2021 through \"reliable local sources\", and interviews with witnesses and victims' families. The AIHRC found that the Taliban forces killed 40 civilians and looted private properties, in violation of international humanitarian law.\nAfghan Unlawful Killings inquiry\nOn 22 March 2023, the British government launched a public inquiry into alleged extrajudicial killings committed by UKSF personnel in Afghanistan between 2010 and 2013, including during the 2012 Shesh Aba raid.\nSee also\n*Islamic State of Iraq and the Levant – Khorasan Province#Claimed and alleged attacks\nReferences\n}}\n}}\nSources\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}