{
  "content": [
    {
      "type": "text",
      "text": "# War pigeon\n\nHoming pigeons have long played an important role in war. Due to their homing ability, speed, and altitude, they were often used as military messengers because they were less likely to be intercepted by enemy forces. Carrier pigeons of the Racing Homer breed were used to carry messages in World War I and World War II, and 32 such pigeons were presented with the Dickin Medal. Medals such as the Croix de Guerre, awarded to Cher Ami, and the Dickin Medal awarded to the pigeons G.I. Joe and Paddy, amongst 32 others, have been awarded to pigeons for their services in saving human lives. Pigeons had a 95% success rate in delivering their messages.\nDuring World War I and World War II, carrier pigeons were used by the Australian, French, German, American, and UK forces, to transport messages back to their home coop behind the lines. When they landed, wires in the coop would sound a bell or buzzer and a soldier of the Signal Corps would know a message had arrived. The soldier would go to the coop, remove the message from the canister, and send it to its destination by telegraph, field phone, or personal messenger.\nA carrier pigeon's job was dangerous. Nearby, enemy soldiers often tried to shoot down pigeons, knowing that released birds were carrying important messages. Some of these pigeons became quite famous amongst the infantrymen for whom they worked. One pigeon, named “Spike”, flew 52 missions without receiving a single wound. Another, named Cher Ami, lost his foot and one eye, but his message got through, saving a large group of surrounded American infantrymen.\nHistory\nBefore the advent of radio, carrier pigeons were frequently used on the battlefield as a means for a mobile force to communicate with a stationary headquarters. In the sixth century BC, Cyrus, king of Persia, used carrier pigeons to communicate with various parts of his empire. In Ancient Rome, Julius Caesar used pigeons to send messages to the territory of Gaul.\nDuring the 19th-century Franco-Prussian War (1870–1871), besieged Parisians used carrier pigeons to transmit messages outside the city; in response, the besieging Prussian Army employed hawks to hunt the pigeons. The French military used balloons to transport homing pigeons past enemy lines. Microfilm images containing hundreds of messages allowed letters to be carried into Paris by pigeon from as far away as London. More than one million different messages traveled this way during the four-month siege. They were then discovered to be very useful, and carrier pigeons were well considered in military theory leading up to World War I.\nSpanish–American War\nThe United States military first used pigeons for communication during the Spanish–American War. The Coast Signal Service used pigeons that were trained to return to lighthouses along the Atlantic Coast, and the North Atlantic Squadron relied on the Naval Pigeon Messenger Service during exercises. Both the Boston Homing Club and the National Association of American Homing Pigeon Fanciers offered their birds to the war effort.  After war was declared, the Naval Pigeon Messenger Service provided communications between ships off the East Coast. Pigeons were used on torpedo boats at naval headquarters in Key West and on ships leaving San Francisco. A regiment from Colorado sailing to the Philippines sent messages back to San Francisco to notify General Wesley Merritt of their progress. However, developments in wireless telegraphy led to the discontinuation of the Naval Pigeon Messenger Service, and the birds were auctioned off.}} named Cher Ami, was awarded the French \"Croix de Guerre with Palm” for heroic service delivering 12 important messages during the Battle of Verdun. On his final mission in October 1918, he delivered a message over  despite having been shot through the breast or wing. The crucial message, found in the capsule hanging from a ligament of his shattered leg, saved 194 US soldiers of the 77th Infantry Division's “Lost Battalion\" in the Battle of the Argonne, in October 1918. When Cher Ami died, he was mounted and is part of the permanent exhibit at the National Museum of American History of the Smithsonian Institution.\n(probably aerial reconnaissance in World War I)]]\nUnited States Navy aviators maintained 12 pigeon stations in France, with a total inventory of 1,508 pigeons when the war ended. Pigeons were carried in airplanes to rapidly return messages to these stations, and 829 birds flew in 10,995 wartime aircraft patrols. Airmen of the 230 patrols with messages entrusted to pigeons threw the message-carrying pigeon either up or down, depending on the type of aircraft, to keep the pigeon out of the propeller and away from airflow toward the aircraft wings and struts. Eleven of the thrown pigeons went missing in action, but the remaining 219 messages were delivered successfully.\nPigeons were considered an essential element of naval aviation communication when the first United States aircraft carrier  was commissioned on 20 March 1922, so the ship included a pigeon house on the stern. The pigeons were trained at the Norfolk Naval Shipyard while Langley was undergoing conversion. As long as the pigeons were released a few at a time for exercise, they returned to the ship; but when the whole flock was released while Langley was anchored off Tangier Island, the pigeons flew south and roosted in the cranes of the Norfolk shipyard. The pigeons never went to sea again.\nWorld War II and later deployments\nDuring World War II, the United States military trained 54,000 homing pigeons. Over 36,000 of those pigeons were used overseas by 12 signal pigeon companies throughout each theater of operation. Upon arriving in Germany, members of the 285th Signal Pigeon Company located over 1000 homing pigeon lofts and clipped the feathers of over 15,000 pigeons to prevent their use by the Germans.\nDuring World War II, the United Kingdom used about 250,000 homing pigeons for many purposes, including communicating with those behind enemy lines such as Belgian spy Jozef Raskin. The Dickin Medal, the highest possible decoration for valor given to animals, was awarded to 32 pigeons, including the United States Army Pigeon Service's G.I. Joe and the Irish pigeon Paddy.\nThe UK maintained the Air Ministry Pigeon Section during World War II and for a while thereafter. A Pigeon Policy Committee made decisions about the uses of pigeons in military contexts.  The head of the section, Lea Rayner, reported in 1945 that pigeons could be trained to deliver small explosives or bioweapons to precise targets. The ideas were not taken up by the committee, and in 1948 the UK military stated that pigeons were of no further use. During the war, messenger pigeons could draw a special allowance of corn and seed, but as soon as the war ended this had been cancelled and anyone keeping pigeons would have to draw on their own personal rationed corn and seed to also feed the pigeons. However, the UK security service MI5 was still concerned about the use of pigeons by enemy forces.  Until 1950, they arranged for 100 birds to be maintained by a civilian pigeon fancier in order to prepare for any eventuality. The Swiss army disbanded its Pigeon section in 1996.\nPigeon vest\nThe Army, in coordination with the Maidenform Brassiere Company, developed the pigeon vest, also known as pigeon bra, to enable paratroopers to carry pigeons safely during jumps. The pigeon vest is a bra-like garment specifically developed for use in World War II. While pigeons had previously been used in World War I, and parachutes were designed specifically for them, the pigeon vest hadn't been invented before WWII.\nIn 1944, the women's underwear company Maidenform was contracted to manufacture 28,500 pigeon vests for the United States Armed Forces. The fabric used in pigeon vests was porous and tightly woven to prevent damage from their claws, and only contained a pigeon's body, leaving their head, feet, and wings free. The devices contained adjustable straps so the pigeons could be more easily carried by paratroopers. Once they landed, the pigeon vest would be undone, and then the pigeon would fly to their homing base. For the safety of the pigeons, it was recommended against confining a pigeon in a pigeon vest for over six hours.\nBeing produced by the undergarment company Maidenform, the pigeon vests had similar construction to a single bra cup with the lacing of a corset. They may have also been made from the same materials as bras. Contemporary advertisements for Maidenform bras included pictures of the pigeon vest, claiming \"There is a maiden form for every type of figure.\"\nAfter World War II ended, the War Assets Administration salvaged 27,064 pigeon vests as surplus property. The entire batch was purchased by a single dealer. An administration officer with the administration said, \"He didn't say what he planned to do with them. What could anyone do with 27,064 pigeon vests?\"\n21st century\nIn 2010, Indian police expressed suspicion that a recently captured pigeon from Pakistan might have been carrying a message from Pakistan. In 2015, a pigeon from Pakistan was logged into Indian records as a \"suspected spy\". In May 2020, another suspected Pakistani spy pigeon was captured by Indian security forces in Jammu and Kashmir. After finding nothing suspicious, India authorities released the pigeon back into Pakistan.\nIn 2016, a Jordanian border official said at a news conference that Islamic State militants were using homing pigeons to deliver messages to operatives outside  its \"so called caliphate\".\nIn 2019, the Animals in War & Peace Medal of Bravery was instituted in the United States, with two war pigeons recognized at the inaugural ceremony.\nDecorated war pigeons\nIn total, 32 pigeons were decorated with the Dickin Medal, including:\n*  All Alone (1943)\n*  Winkie (1943)\n* Tyke (1943)\n* White Vision (1943)\n* Commando (1944)\n* Paddy (1944)\n* William of Orange (1944)\n* Gustav (1944)\n* Beach Comber (1944)\n* Royal Blue (1945)\n* Mary of Exeter (1945)\n* G.I. Joe (1946)\nA grand ceremony was held in Buckingham Palace to commemorate a platoon of pigeons that braved the battlefields of Normandy to deliver vital plans to Allied forces on the fringes of Germany. Three of the actual birds that received the medals are on show in the London Military Museum so that well-wishers can pay their respects.\nIn Brussels, there is a monument commemorating pigeons that served in World War I, the .\nThree pigeons have been recognized with the Animals in War & Peace Medal of Bravery:\n* G.I. Joe, service in World War II (2019)\n* Cher Ami, service in World War I (2019)\n* The Mocker, service in World War I (2023)\nGallery\nFile:A member of the crew of an RAF Coastal Command Lockheed Hudson holding a carrier pigeon, 1942. TR42.jpg|A member of the crew of an RAF Coastal Command Lockheed Hudson holding a carrier pigeon, 1942\nFile:1972 Musik Kpl uniform.jpg|Left: Swiss homing pigeon service sergeant major, Women's Military Service, uniform of 1986\nFile:War Pigeon Carrier.jpg|War pigeon carrier at the History on Wheels Museum, Eton Wick, Windsor, UK: The pigeon would be released from this carrying important messages back home.\nFile:Bruxelles - Monument au Pigeon-Soldat - 02.JPG|The  in Brussels, commemorating pigeons that served in\nSee also\n*\n* Olga of Kiev – used pigeons and sparrows to set fire to villages in the 10th century\n*\n*\n*\n* List of equipment of the United States Army during World War II\n*\n*\n* Beach House Park, Worthing – Site of a memorial to war pigeons\n* \"Corporal Punishment\" – an episode of Blackadder featuring a fictional World War I carrier pigeon named Speckled Jim\nNotes\nReferences\nExternal links\n* [http://americanhistory.si.edu/collections/search/object/nmah_425415 Smithsonian page on Cher Ami, a decorated World War I pigeon]\n* [https://web.archive.org/web/20050825132244/http://www.usarc.army.mil/77thRSC/ History of the 77th]\n* [http://www.historylearningsite.co.uk/pigeons_and_world_war_one.htm Pigeons and WWI]\n* [https://worldwar2historyandtheww2pigeons.blogspot.com World War 2 History and the WW2 Pigeons]\n*  Reuters (21 May 2004)"
    }
  ]
}