{
  "content": [
    {
      "type": "text",
      "text": "# War Memorial Stadium (Arkansas)\n\n| pushpin_map = USA Arkansas#USA\n| pushpin_relief = 1\n| pushpin_map_caption = Location in Arkansas##Location in the United States\n| broke_ground = 1947\n| opened = September 18, 1948\n| closed =\n| demolished =\n| renovated = 2010\n| expanded =\n| owner = State of Arkansas\n| operator = Arkansas Department of Parks, Heritage, and Tourism\n| surface = FieldTurf\n| construction_cost = $1.2 million($}} in  dollars)\n| architect = Burks & Anderson\n| former_names =\n| tenants = Arkansas Razorbacks (NCAA) (1948–2025)Little Rock Rangers (USL2) (2016–present)Catholic High School Rockets (AAA)Parkview Magnet High School Patriots (AAA) (2017–present)\n| seating_capacity = 31,075 (1948–1959)40,000 (1960–1966)53,555 (1967–1985)53,250 (1986–1987)53,645 (1988–1990)53,727 (1991–2009)54,120 (2010–present)\n| record_attendance = 55,914 (September 19, 1992 vs. Alabama)\n| dimensions =\n| website = [http://www.wmstadium.com/ www.wmstadium.com]\n}}\nWar Memorial Stadium is a multi-purpose stadium in Little Rock, Arkansas. The stadium is primarily used for American football and is the home stadium for the Catholic High School Rockets, the Parkview Magnet High School Patriots, and the secondary home stadium for the University of Arkansas Razorbacks. The USL League Two affiliated Little Rock Rangers hold both home games and youth academies at the stadium. The Arkansas Activities Association high school football championship games for all classifications are held at the stadium annually.\nHistory\nWar Memorial Stadium was designed by architect Burks & Anderson with construction finished in 1947 at the cost of $1.2 million. Initial seating capacity was 31,075. On September 19, 1948, the stadium was formally dedicated by former Arkansas Razorback and Medal of Honor recipient Maurice Britt. Britt dedicated the stadium to \"the memory of her native sons and daughters who have given so much that we might have our freedom.\" Following the dedication ceremony, the first game at the stadium commenced, where the Arkansas Razorbacks defeated the Abilene Christian Wildcats by a score of 40–6.\nOther early college football contests included Philander Smith College, Ouachita Baptist College, and Arkansas Tech as well as the predecessors of the University of Arkansas Little Rock, University of Arkansas Pine Bluff, University of Arkansas Monticello, and University of Central Arkansas. The stadium hosted the Delta Classic from 2006 to 2012, an annual football game between the University of Arkansas at Pine Bluff Golden Lions and other Historically Black Colleges & Universities. The Arkansas State Red Wolves, Hendrix College, and Arkansas Baptist College have also played there in the past.\nWar Memorial Stadium hosted three professional football games in the years immediately following its opening. The Los Angeles Rams and Philadelphia Eagles played on September 10, 1949 and again on September 1, 1951. The Eagles also competed with the Detroit Lions in the stadium on August 23, 1952.\nWar Memorial Stadium has added numerous improvements to the stadium and to the playing field. A complete lighting system and an AstroTurf surface were installed for the 1970 season. A new artificial surface was installed in 1974 and also again prior to the 1984 season, before a returning to natural grass field in 1994. Artificial turf was reinstalled prior to the 2002 season when AstroPlay was installed. A new scoreboard and video screen were added prior to the 2005 football season and the field was later upgraded to field turf in 2006.\nRenovations to the club facility and press box began on December 14, 2009, following the 4A Arkansas Activities Association high school football championship game. The renovations cost approximately $7.3 million and was completed in August 2010. The renovations also included the Sports Media Legends Wall of Honor, honoring Arkansas sports journalists that distinguished themselves in their careers and have made contributions to the stadium and to the sport.\npersonnel at the stadium in 2020|300px]]\nOther uses\nIn addition to athletics, the stadium has been used for a variety of other purposes including musical concerts and speaking engagements.\nConcerts\nIn 1995, Billy Joel and Elton John performed to a sell-out crowd of 41,274, grossing over $1.6 million for concert promoter Cellar Door Concerts. Other artists who had performed at the stadium are The Eagles, The Rolling Stones, George Strait, and 'N Sync, among others.\nIn 2017, Guns N' Roses made a stop here as part of their \"Not in this Lifetime\" Tour.\nSpeaking engagements\nPresident Harry S. Truman spoke at the stadium in June 1949.\nComedian Bob Hope performed in 1949 and again in 1991 at War Memorial Stadium.\nReverend Billy Graham conducted his evangelistic crusades to thousands of listeners at the stadium that included a young Bill Clinton in 1959.  Graham returned to the stadium in 1989.\nNotable events\nArkansas Razorback Football\nBy the year 2012, Arkansas had played nearly 200 games in the stadium, usually playing two or three a year, although there were some seasons in the 1970s and 1980s when the Razorbacks played four home games at WMS. In the year 2000, athletic director Frank Broyles generated controversy by announcing that one home game would be moved from War Memorial to Fayetteville (where the Razorbacks normally play their home games). It was later revealed that Razorback Stadium on the UA campus was going to be renovated and expanded from 50,000 seats to 72,000 seats. Despite objections from Little Rock-based individuals, only two home games would be played at War Memorial up until 2012.\nIn 2013, it was announced that there would only be one game a year played at War Memorial up until 2018, at which point the team would play only in Fayetteville. In 2018, a new agreement was reached, allowing the Razorbacks to play one non-conference game at War Memorial every other year.\nIn 2021, the Razorbacks played the Golden Lions of the University of Arkansas at Pine Bluff (UAPB), marking their first game against an in-state opponent since 1944. The Razorbacks won 45-3. Between 2023 and 2025 the Razorbacks would play one non-conference opponent every year at War Memorial. In 2023, Arkansas defeated the Western Carolina Catamounts 56-13, and in 2024 the Razorbacks again defeated UAPB, 70-0.\nIn 2025, the Razorbacks played the Arkansas State Red Wolves for the first time, hosting them at War Memorial before a sold-out crowd of 54,224. Currently, the Razorbacks do not have any games scheduled at WMS after 2025.\nAluminum Bowl\nMonths prior to the 1956 NAIA football season, the National Association of Intercollegiate Athletics (NAIA) began searching for cities to host the inaugural NAIA championship game. As it appeared that the championship game was headed to Shreveport, Louisiana, the Louisiana legislature passed a bill banning integrated sporting events in the state. Since some of their member colleges had African-American athletes, NAIA looked for another city to host the game. War Memorial Stadium general manager Allen Berry worked with local businesses and the Little Rock Chamber of Commerce to raise $25,000 to get NAIA to host the game in Little Rock. Both Aluminum Company of America and Reynolds Metals Company agreed to pay $25,000 each to CBS to broadcast the game nationally and this agreement led to the game's name, the Aluminum Bowl. The NAIA invited the Montana State University Bobcats and St. Joseph's College Pumas, the two leading NAIA football teams at that time, to play on December 22, 1956. The final result was a scoreless tie, and the teams were named NAIA co-champions for the 1956 season. Despite promotion of the game by local organizers, only 5,000 spectators attended the game. Organizers failed to keep the championship game in Little Rock and the game moved to St. Petersburg, Florida in 1957.\nSalt Bowl\nThe Benton High School Panthers and the Bryant High School Hornets annually play each other for their first football game of the season. Although the rivalry dates to 1974, the game officially became known as the \"Salt Bowl\" in 2000 when it was first played at War Memorial Stadium. The title is a reference to the 19th century salt works that gave Saline County, the home of both the cities of Benton and Bryant, its name. While Benton dominated the rivalry in its early years, since 2000 Bryant has won all but two match-ups: a loss in 2005 and tie in 2014. Each year the Salt Bowl draws the largest high school football crowd of the season in Arkansas, and exceeds the attendance of most college football games held in the state. Over 20,000 tickets are sold on average, with a record of 38,215 set in 2018. During the 2018 game, a fight involving a stun gun caused a mass panic when spectators thought they heard gunshots. The game was cancelled, with authorities later reporting there was no real danger to spectators. On August 29, 2020, the annual contest was held amidst the Covid-19 pandemic with War Memorial Stadium restricted to approximately 25% capacity. This made the Salt Bowl the first sizable sporting event with spectators since the pandemic began; it also marked the first time the game was available on pay-per-view.\nSee also\n*Barton Coliseum\n*Jack Stephens Center\nReferences\nExternal links\n*[http://www.wmstadium.com/ WMStadium.com] - Official Website\n*[https://maps.google.com/maps?q=1+Stadium+Dr,+Little+Rock,+72205&ll=34.750173,-92.330389&spn=0.004346,0.007767&t=k&num=10&start=0&hl=en Google Maps Satellite Picture & Map of War Memorial Stadium]"
    }
  ]
}