{
  "content": [
    {
      "type": "text",
      "text": "# War Memorial of Musocco\n\nThe War Memorial of Musocco is a monument commemorating the soldiers from the town of Musocco who died during the First World War. Musocco at the time was an autonomous settlement until it was incorporated into the council of Milan in 1923. The monument is located in Piazzale Santorre di Santarosa, Quartiere Varesina, and is designed as to be visible from all the four streets converging into the square.\nThe monument was inaugurated in 1924 and was designed by Ugo Prat. The four statues towering the structure have later been attributed to sculptor Emilio Agnati (1876-1937). Two of those stand on a plinth surmounted by an iron crown facing North and South while two statues of women in marble are on the West and East side. On the base two bas-reliefs in bronze complete the work.\nTwo commemorative plates laying at the footstep of the plinth list the names of the soldiers who lost their life in the conflict.\nIn 2008, after the plate had become illegible due to the iron dust generated by the nearby tram tracks, the monument was restored.\nTwo statues\nThe statue on the east side, towards Via De Rossi, represents Italy and the marble plate reads: Musocco ai suoi caduti. (Musocco to its glorious heroes). The second woman on the west side, towards Via Galliari, holds a book in her hand entitled, Storia. (History) Below, an inscription on marble reports the dates in Roman numerals of the beginning and end of World War I for Italy: XXIV-V-MCMXV IV-XI-MCMXVIII.\nBas-reliefs\nOn the base on the south side, in the direction of Piazzale Accursio, there is a bronze bas-relief representing the figure of Jesus illuminating a soldier in the moment of death.\nOn the north side, a second bas-relief represents a mass scene with the celebrant, facing the altar, raises the Eucharist. A gathering of soldiers in uniforms and helmets attends the ceremony. The setting takes is outdoors, showing a tree behind the altar.\nCommemorative stones\nTwo granite stones commemorates the names of the soldiers who perished during the war. Names from Agostoni to Gatti are listed on the north side, while those from Gerosa to Villa'' are on the south side.\nNotes"
    }
  ]
}