{
  "content": [
    {
      "type": "text",
      "text": "# War (2019 soundtrack)\n\n}}\n}}\nWar is the soundtrack to the 2019 Hindi-language action film of the same name directed by Siddharth Anand, starring Hrithik Roshan, Tiger Shroff and Vaani Kapoor. The soundtrack to the film featured two songs composed by Vishal–Shekhar and three instrumental themes from the film score composed by Sanchit Balhara and Ankit Balhara. It was released by YRF Music on 27 September 2019.\nRelease\nWar's soundtrack was preceded with the first single \"Ghungroo\" released on 5 September 2019. It was written by Kumaar, and sung by Arijit Singh and Shilpa Rao. The song was choreographed by Bosco–Caesar and Tushar Kalia, which was shot at the Positano beach in Italy and Amalfi Coast. The second single \"Jai Jai Shivshankar\" was released on 21 September. The hook of the song is inspired from the eponymous song sung by Kishore Kumar and Lata Mangeshkar from Aap Ki Kasam (1974). It was sung by Vishal Dadlani and Benny Dayal, and choreographed by Bosco–Caesar; set against the backdrop of Holi celebrations, the song featured Roshan and Shroff dancing at the festival.  The soundtrack was released by YRF Music on 27 September.\nTrack listing\nHindi\nTamil\nTelugu\nReception\nDebarati S Sen of The Times of India reviewed the song \"Jai Jai Shivshankar\" and stated that the duo \"have woven the feel of unfettered revelry in the soundscape and that comes alive in the dance sequence\"; regarding \"Ghungroo\", she described the song as a \"uber-modern twist\" of the ghazal number \"Ghungroo Toot Gaye\" from Param Dharam (1987) and added that \"electronic elements have been used generously in the soundscape which give the party track, a lazy yet groovy vibe\". Joginder Tuteja of Bollywood Hungama stated that the soundtrack \"adds on further punch\".\nPratishruti Ganguly from Firstpost described that the songs, are \"catchy in their own right, but lack repeat value\"; she was more critical of the album's length, adding \"Had the album of War offered a longer selection, it probably would have been relatively easier to decide if the soundtrack warrants repeat listens.\" Anupama Chopra of Film Companion criticised the songs being \"force-fitted\" and added that \"the background music by Sanchit Balhara and Ankit Balhara has more impact than the two songs by Vishal–Shekhar\". Swarup Chakravarthy of BollySpice wrote \"the album never really gets going and definitely has no flow about it\". Nairita Mukherjee of India Today called the music as \"strictly passable\". Hanna Rachel Abraham of The Week complimented the music as \"decent\" but \"the songs are abruptly placed and add nothing to the story whatsoever except seeing Hrithik Roshan dance again\".\nAccolades\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\"| Award\n! scope=\"col\"| Date of ceremony\n! scope=\"col\"| Category\n! scope=\"col\"| Recipient(s)\n! scope=\"col\" class=\"unsortable\"| Result\n! scope=\"col\" class=\"unsortable\"|\n|-\n! scope=\"row\" rowspan=\"3\"| Filmfare Awards\n| rowspan=\"3\"| 15 February 2020\n| Best Female Playback Singer\n| Shilpa Rao (\"Ghungroo\")\n|\n| style=\"text-align:center;\" rowspan=\"3\"|\n|-\n| rowspan=\"2\"| Best Choreography\n| Bosco–Caesar (\"Jai Jai Shiv Shankar\")\n|\n|-\n| Bosco–Caesar & Tushar Kalia (\"Ghungroo\")\n|\n|-\n! scope=\"row\" rowspan=\"5\"| International Indian Film Academy Awards\n| rowspan=\"5\"| 27–29 November 2020\n| Best Music Director\n| Vishal–Shekhar\n|\n| style=\"text-align:center;\" rowspan=\"5\"|\n|-\n| Best Male Playback Singer\n| Arijit Singh (\"Ghungroo\")\n|\n|-\n| Best Female Playback Singer\n| Shilpa Rao (\"Ghungroo\")\n|\n|-\n| Sound Mixing\n| Anuj Mathur – YRF StudiosPritam Das\n|\n|-\n| Best Choreography\n| Bosco–Caesar & Tushar Kalia (\"Ghungroo\")\n|\n|-\n! scope=\"row\" rowspan=\"3\"| Mirchi Music Awards\n| rowspan=\"3\"| 19 February 2020\n| Song of The Year\n| \"Ghungroo\"\n|\n| style=\"text-align:center;\" rowspan=\"3\"|\n|-\n| Female Vocalist of The Year\n| Shilpa Rao (\"Ghungroo\")\n|\n|-\n| Song Engineer – Recording & Mixing\n| Abhay Rumde & Vijay Dayal (\"Ghungroo\")\n|\n|-\n! scope=\"row\" | Screen Awards\n| 8 December 2019\n| Best Choreography\n| Bosco–Caesar & Tushar Kalia (\"Ghungroo\")\n|\n| style=\"text-align:center;\" |\n|-\n! scope=\"row\" | Zee Cine Awards\n| 13 March 2020\n| Best Choreography\n| Bosco–Caesar (\"Jai Jai Shiv Shankar\")\n|\n| style=\"text-align:center;\" |\n|}\nNotes\nReferences"
    }
  ]
}