{
  "content": [
    {
      "type": "text",
      "text": "# War bride__disambig_1\n\nreunites in Sydney with Canadian bride and daughter in 1945.]]\nWar brides are women who married military personnel from other countries in times of war or during military occupations, a practice that occurred in great frequency during World War I and World War II.\nAllied servicemen married many women in other countries where they were stationed at the end of the war, including the United States, the United Kingdom, Australia, New Zealand, China, Japan, France, Italy, Greece, Germany, Poland, Luxembourg, Armenia, Turkey, Syria, Lebanon, Thailand, Vietnam, the Philippines, Taiwan, Korea, India, and the Soviet Union. Similar marriages also occurred in Korea and Vietnam with the later wars in those countries involving U.S. troops and other anti-communist soldiers.\nThe term war brides was first used to refer to women who married Canadian servicemen overseas and then later immigrated to Canada after the world wars to join their husbands. This term later became popular during World War II. It first started when in January 1919, the Canadian government offered to transport all dependents of Canadian servicemen from Britain to Canada. This included free ocean transport (third class) and rail passage. There are currently no official figures for the numbers of war brides and their children. By the end of 1946, over forty thousand Canadian serviceman had married women from Europe.\nThere is no exact number on the number of World War I European brides married to American soldiers. Research shows that between thousands to tens of thousands immigrated to the United States after World War I as war brides from Belgium, England, Ireland, France, Greece, Russia, Italy, and Germany.\nAfter the end of World War II the number of women from Europe and Asia who became war brides to American soldiers was estimated in the hundreds of thousands.\nThere were various factors contributing to the intermarriages between foreign servicemen and native women. After World War II, many women in Japan came to admire the personal attributes and status of American soldiers, while there was also mutual attraction to Japanese women among American servicemen. British women were attracted to American soldiers because they had relatively high incomes, and were perceived as friendly. (A British catchphrase, \"Overpaid, oversexed, and over here,\" also entered Australian popular culture.)\nMarriage to Asian war brides had a significant impact on United States immigration law, as well as the public perception of interethnic, interracial, interfaith, and interdenominational couples. The massive migration of Asian wives to the United States was challenged by pre-existing laws against interracial marriage; however, there was widespread public sympathy for such couples, due to the high reputation of Japanese immigrant brides in the United States. This led to widespread defiance of the law by American servicemen, as well as increased tolerance for interethnic and interracial couples in the United States, and ultimately the repeal of the highly restrictive 1924 Immigration Act in 1952.\nPhilippine–American War\nAfter the Philippine–American War, some Filipina women married  U.S. servicemen. Those Filipinas were already U.S. nationals and so when they immigrated to the U.S., their legal status was made significantly different from that of previous Asian immigrants to the U.S.\nWar brides in World War I\nThere are no official figures for war brides in World War I. One report estimated that 25,000 Canadian servicemen married British women during World War I. In World War II, approximately 48,000 women married Canadian servicemen overseas. By 31 March 1948, the Canadian government had transported about 43,500 war brides and 21,000 children to Canada.\nThere is no exact number but research estimates on the number of World War I European brides married to American soldiers show that between 5,000 and 18,000 immigrated to the United States after World War I. The brides came from Belgium, England, Ireland, France, Russia, Italy and Germany.\nWar brides in World War II\n, England, 1941.]]\nUnited States of America\nEstimates suggest 200,000 women from Continental Europe were married to American soldiers. An estimated 70,000 G.I. war brides left the United Kingdom, 15,500 from Australia, 14,000-20,000 from Germany, and 1,500 from New Zealand, between the years 1942 and 1952, having married American soldiers.\nAfter the end of World War II, 50,000 to 100,000 women from East Asia were married to American soldiers, and in total it is estimated that 200,000 Asian women migrated from Philippines, Japan and South Korea between 1945 and 1965. The estimates for the war brides and military spouses from 1947 to 1975 from Japan totalled 66,681, from Korea 28,205, from the Philippines, 51,747, from Thailand 11,660, and from Vietnam 8,040. The war bride allowed Asian men and American american soldiers to import Asian brides for marriage. 825 marriages were record in Japan (including Okinawa), during this period with 397 marriages were to Japanese American soldiers, 211 to white american soldiers and 15 to african american soldiers.\nThe U.S. Army's Operation War Bride, which eventually transported an estimated 70,000 women and children, began in Britain in early 1946. The press dubbed it Operation Diaper Run. The first group of war brides (452 British women and their 173 children, and one bridegroom) left Southampton harbor on  on January 26, 1946, and arrived in the U.S. on February 4, 1946. According to British Post-War Migration, the U.S. Immigration and Naturalization Service reported 37,553 war brides from the British Isles took advantage of the War Brides Act of 1945 to emigrate to the United States, along with 59 war bridegrooms.\nEffect of Asian immigrant brides on United States immigration laws\n'' was sympathetic to the experiences of mixed couples, emphasizing their courage in the face of discrimination.]]\nAround 50,000 United States servicemen married Japanese wives at the end of World War II and during the occupation period. 75% of the marriages that involved non-Japanese were white American soldiers. Marriages to Asian women initially faced legal obstacles due to pre-existing laws against interracial marriage. However, the determination of American servicemen to marry Japanese women resulted in widespread defiance of the law. The positive reception of Japanese war brides generated sympathy from the general public about the difficulties faced by interracial couples, and promoted increased tolerance for interracial couples. In 1947, the War Brides Act was amended to give citizenship to the children of American servicemen regardless of race or ethnicity. Ultimately the effort to normalize interracial marriages to Japanese women led to the passage of the McGarran-Walter Act, which repealed the Immigration Act of 1924, thereby loosening restrictions on immigration and citizenship requirements for non-Northwestern European immigrants.\nAccording to journalist Craft Young, a daughter of a Japanese war bride, an estimated 50,000 Japanese war brides migrated to the United States.\nHowever, according to the US consulate, they counted only over 8,000 marriages with 73% being white men and Japanese women by the end of the occupation.\nAustralia\nin October 1945]]\nIn 1945 and 1946 several bride trains were run in Australia to transport war brides and their children traveling to or from ships.\nRobyn Arrowsmith, a historian who spent nine years researching Australia's war brides, said that between 12,000 and 15,000 Australian women had married visiting U.S. servicemen and moved to the U.S. with their husbands.\nUnited Kingdom\n's Lobey Dosser series by the G.I. Bride character (with her baby Ned), forever trying to hitchhike from the fictional Calton Creek in Arizona back to Partick in Scotland. The statue was erected in Partick station in 2011.]]   Many war brides came from Australia and other countries to Britain aboard HMS Victorious following World War II. Roughly 70,000 war brides left Britain for America, Canada, and elsewhere during the 1940s.\nCanada\nIn Canada, 47,783 British war brides arrived accompanied by some 21,950 children. From 1939, most Canadian soldiers were stationed in Britain, and as such, about 90% of all war brides arriving in Canada were British. Three thousand war brides came from the Netherlands, Belgium, Newfoundland, France, Italy, Ireland, and Scotland. The first marriage between a Canadian serviceman and a British bride was registered at Farnborough Church in the Aldershot area in December 1939, just 43 days after the first Canadian soldiers arrived. Many of those war brides emigrated to Canada beginning in 1944 and peaking in 1946. A special Canadian agency, the Canadian Wives' Bureau, was set up by the Canadian Department of Defence to arrange transport and assist war brides in the transition to Canadian life. The majority of Canadian war brides landed at Pier 21 in Halifax, Nova Scotia, most commonly on the following troop and hospital ships: , , ,  ,  and .\nSignificantly, an estimated 30,000 to 40,000 Newfoundland women married American servicemen during the time of Ernest Harmon Air Force Base's existence (1941–1966), in which tens of thousands of U.S. servicemen arrived to defend the island and North America from Nazi Germany during World War II and the Soviet Union during the Cold War. So many of those war brides settled in the U.S. that in 1966, the Newfoundland government created a tourism campaign specifically tailored to provide opportunities for them and their families to reunite.\nThe Canadian Museum of Immigration at Pier 21 has exhibits and collections dedicated to war brides. There is a National Historic Site marker located at Pier 21, as well.\nGermany\nDuring and after World War II, the majority of German brides were married to white Americans, but some married non-White soldiers. European war brides who filed applications with US officials to emigrate to the United States were sometimes rejected, as there was less approval of interracial marriages involving African American or Filipino American males.\nItaly\nDuring the campaign of 1943–1945, there were more than 10,000 marriages between Italian women and American soldiers.\nFrom relationships between Italian women and African American soldiers, mulattini were born; many of those children were abandoned in orphanages, because interracial marriage was then not legal in many US states.\nJapan\nA Japanese war bride is a woman who married an American citizen following the post WW II military occupation of their home country. Their spouses were typically GIs or soldiers.\nJapan's post-WWII occupation by America facilitated many interracial marriages between servicemen and Japanese women. Following Japan's defeat and post war food shortages, many women sought employment as a means to provide for their families.  Many were also enamored by the status, power, and prestige the GIs carried with them because of their victory, and sought new economic opportunity through immigration to the United States.\nSeveral thousand Japanese who were sent as colonizers to Manchukuo and Inner Mongolia were left behind in China. Most of the Japanese left behind in China were women, most of whom married Chinese men and became known as \"stranded war wives\" (). Because they had children fathered by Chinese men, the Japanese women were not allowed to bring their Chinese families back with them to Japan and so most of them stayed. Japanese law allowed only children fathered by Japanese fathers to become Japanese citizens. It was not until 1972 that Sino-Japanese diplomacy was restored, which allowed those survivors the opportunity to visit or emigrate to Japan. Even then, they faced difficulties; many had been missing so long that they had been declared dead at home.\nHowever, when President Truman signed the Alien Wife Bill, this loosened immigration restrictions by creating the 1945 War Brides Act, which allowed the spouses of servicemen to migrate without breaking the quotas set by the 1924 Immigration Act. Under the subsequent amendments in the 1946 and 1947 Soldier Brides Act, the time period for immigration was extended by 30 days, all of which led to the immigration of nearly 67,000 Japanese women between the years 1947 and 1975. However, they were not permitted to naturalize until the passage of the McCarran-Walter Act of 1952, which banned using race as a factor in allowing residents to naturalize. New immigration legislation profoundly impacted Asian immigration patterns by making Asian war brides the largest instance of Asian women migrating to the United States. The migration of over 72,000 women over the span of just 15 years grew the Asian American population by 20%, which in turn gave many Japanese women increased attention in the public eye.\nThese women came from a diverse array of backgrounds ranging from poverty to upper-class, but all were devastated by the destruction and bombings wrought by the war. They often struggled to provide for themselves and their families due to post-war food, fuel, and employment shortages.  Many met servicemen through jobs working on military bases as waiters, clerks, and secretaries. They often chose to move to the United States in hopes of forging a new life.\nJapanese women who had immigrated post-WWII as war brides were used to help construct the Asian model minority stereotype. For example, the American Red Cross Brides' School in Japan advised them on how to correctly assimilate into mainstream American society. Their classes offered textbooks in home economics, U.S. history, housekeeping, child raising, and ultimately shaped the modern Japanese woman's beliefs so that these actions were in accordance with mainstream American views on gender roles. Some of these classes even taught women how to bake or to properly wear heels. The ideal wife was taught to be a good mother, homemaker and companion to her husband. Thus, by conforming to an idealized concept of how a good housewife behaved, these Japanese women often became model minorities promoted as what others should strive to personify, held up as examples of what an assimilated immigrant should look like.  Further, with the passage of the Immigration Act of 1965, immigration could no longer be lawfully restricted by race, ethnicity, nationality or creed.\nIn spite of these language and behavioral classes, many Japanese women struggled to find a community, especially after the internment of hundreds of thousands of Japanese Americans left them feeling displaced and unsure of their racial status in the context of segregation and post war xenophobia.\nVietnam\nSome Japanese soldiers married Vietnamese women or fathered multiple children with the Vietnamese women who remained behind in Vietnam, and the Japanese soldiers themselves returned to Japan in 1955. The official Vietnamese historical narrative views them as children of rape and prostitution. The Japanese forced Vietnamese women to become comfort women along with Burmese, Indonesian, Thai and Filipina women, and they made up a notable portion of Asian comfort women in general. Japanese use of Malayan and Vietnamese women as comfort women was corroborated by testimonies. There were comfort women stations in areas that make up present-day Malaysia, Indonesia, the Philippines, Burma, Thailand, Cambodia, Vietnam, North Korea, and South Korea. A Korean comfort woman named Kim Ch'un-hui stayed behind in Vietnam and died there when she was 44 in 1963, owning a dairy farm, cafe, U.S. cash, and diamonds worth 200,000 U.S. dollars.\nA number of Japanese soldiers stayed behind immediately after the war to stay with their war brides, but in 1954 they were ordered to return to Japan by the Vietnamese government and were encouraged to abandon their wives and children.\nThe now-abandoned Vietnamese war brides who had mothered children would be forced to raise them by themselves and often faced harsh criticism for having relations with members of an enemy army that had occupied Vietnam.\nKorea\nKorean war brides were those who married American GIs and immigrated to the United States to pursue opportunities for freedom and economic advancement. Many Korean women followed a similar path as the Japanese war brides above after Korea became an independent nation following Japan's defeat in WWII. After the decolonization of Japan's territories, concerns about the spread of communism and Cold War containment policies, in addition to the Korean War, brought many American soldiers to Korea. These war brides often met American servicemen in military bases through gambling halls, prostitution, or other illicit businesses. Much like their Japanese counterparts, many were convinced that Korea offered them little economic opportunity and success. They therefore saw marriage as a gateway into a new country full of wealth and prosperity.\nAlthough it was a struggle for Korean war brides to assimilate into American society, they  generally enjoyed greater economic opportunity in their new country. 6,423 Korean women married U.S. military personnel as war brides during and immediately after the Korean War.\nVietnam War\n8,040 Vietnamese women came to the U.S. as war brides between 1964 and 1975.\nIraq and Afghanistan Wars\nWar brides from wars subsequent to Vietnam became less common due to differences in religion and culture, shorter durations of wars, direct orders, and a change in immigration and military laws. As of 2006, only about 2,000 visa requests had been made by U.S. military personnel for Iraqi and Afghan spouses and fiancées. There have nevertheless been several well-publicized cases of American soldiers marrying Iraqi and Afghan women.\nSee also\n* War Brides Act\n* Eswyn Lyster (1923–2009), a British-born Canadian author best known for writing extensively on the Canadian war bride experience\n* War children\n* Brides of ISIL\n* GI Brides, a narrative non-fiction book about British war brides of World War II\n* War Brides, a 1916 silent film by Herbert Brenon and starring Alla Nazimova\n* I Was a Male War Bride, a screwball comedy film featuring Cary Grant as a male war bride\n** Roger Charlier (1921–2018), inspiration for the film\n* Japanese War Bride, a 1952 film by King Vidor featuring Shirley Yamaguchi and Don Taylor\n* Madame Butterfly, a 1904 opera by Giacomo Puccini about a Japanese child bride who is abandoned by her husband, a US Navy lieutenant, redone in 1989 as Miss Saigon\nReferences\nFurther reading\n*\n*\n*\n* Herbison, Chico. Schultz, Jerry. \"Quiet Passages: The Japanese War Bride American Experience.\" The Center for East Asian Studies: The University of Kansas\nExternal links\n* [http://uswarbrides.com/ \"American War Bride Experience; Fact, Stories about American War Brides\"; American War World II GI Brides. website]\n* [http://www.lonniestory.com/ Luxembourg War Brides; \"The Meeting of Anni Adams:  The Butterfly of Luxembourg\"; American War Brides. website]\n* [https://web.archive.org/web/20080525112516/http://warbrides.com.au/home/ Australian War Brides website]\n* [http://www.canadianwarbrides.com/ Canadian War Brides of WW II website]\n* [http://www.nlwarbrides.ca/ Newfoundland & Labrador War Brides website]\n* [http://www.vac-acc.gc.ca/remembers/sub.cfm?source=history/secondwar/warbrides Canadian War Brides from Veterans' Affairs Canada website]\n* [http://www.cbc.ca/archives/categories/war-conflict/second-world-war/love-and-war-canadian-war-brides/topic---love-and-war-canadian-war-brides.html CBC Digital Archives – Love and War: Canadian War Brides]\n* [https://nzhistory.govt.nz/war/us-forces-in-new-zealand/yankee-boys-kiwi-girls Yankee boys, Kiwi girls history webpage]\n* [https://nzetc.victoria.ac.nz/tm/scholarly/tei-WH2Prob-c15-7.html Marriages from Problems of the 2NZEF (eText of Official History of New Zealand in WW II)]\n* [http://library.christchurch.org.nz/Heritage/Photos/disc7/IMG0031.asp New Zealand servicemen and their war brides, 1946 (photo)]\n* [http://members.shaw.ca/francislyster/warbride Eswyn Lyster's Canadian War Bride page] – the book \"Most Excellent Citizens\"\n* [https://web.archive.org/web/20070509060535/http://bulletin.ninemsn.com.au/article.aspx?id=261776 War brides of World War II reunion 2007]\n* [https://ww1warbrides.blogspot.com/ Canadian War Brides of the First World War website]\n* [https://docslib.org/doc/13456598/ The ships of Operation War Bride]"
    }
  ]
}