{
  "content": [
    {
      "type": "text",
      "text": "# War in Russia (computer game)\n\n| genre = Computer wargame\n| platforms = Apple II, Atari 8-bit\n|alt =\n}}\nWar in Russia is a 1984 computer wargame developed and published by Strategic Simulations for the Apple II and Atari 8-bit computers. It was designed by Gary Grigsby.\nGrigsby later built on War in Russia with his project Second Front: Germany Turns East (1990), initially planned as a remake of the game. Second Front then supplied the foundation for ''Gary Grigsby's War in Russia (1993), another successor product.\nGameplay\nWar in Russia is a computer wargame that simulates the Eastern Front during World War II at the division scale. It covers the conflict from 1941 to 1945. Because of its scope and complexity, it is classified as a monster wargame.\nDevelopment\nWar in Russia was designed by Gary Grigsby and released in 1984, the same year he launched Objective: Kursk and Reforger '88.\nReception\n| rev2 = Current Notes\n| rev2Score =\n}}\nIn a 1985 survey of computer wargames for Current Notes, M. Evan Brooks called War in Russia'' the definitive monster wargame and \"another essential addition to the Wargamer's Library\", despite noting the challenge of its large scope and the flaws with its artificial intelligence.\nIn his 1989 survey of computer wargames, J. L. Miller of Computer Play recommended War in Russia, which he found highly detailed and \"much more complex\" than Strategic Studies Group's competing product Russia: The Great War in the East 1941–1945. However, he said that it contained \"more flaws as well\" and noted that \"the AI does not handle the later stages of the war well\".\nLegacy\nAccording to Computer Gaming Worlds Alan Emrich, War in Russia \"was the first monster wargame for the computer, a triumph of scale, subject matter and head-to-head play via e-email.\" War in Russia was among the first inductees into Computer Gaming Worlds \"Hall of Fame\" section in 1988. In 1996, Computer Gaming World declared War in Russia the 126th-best computer game ever released. The magazine's wargame columnist Terry Coleman named it his pick for the 14th-best computer wargame released by late 1996.\nGary Grigsby built on War in Russia in Second Front: Germany Turns East, which was at first planned as a straight remake of the game. He subsequently built on Second Front with ''Gary Grigsby's War in Russia''.\nReferences\nExternal links\n*"
    }
  ]
}