{
  "content": [
    {
      "type": "text",
      "text": "# War Lord (novel)\n\nWar Lord is the 13th and last novel in the Saxon Stories series by Bernard Cornwell. It was published on 15 October 2020 in the UK.\nUhtred of Bebbanburg plays a crucial role in the battle that will decide whether Alfred the Great's dream of England comes to pass or not.\nPlot summary\nThe aged Uhtred wants nothing more than to end his days in peace in his beloved Bebbanburg and pass it on to his second son, also named Uhtred. However, inexorable fate has other ideas.\nMany years before, Uhtred had taught the young Æthelstan, a grandson of King Alfred the Great, how to be a king and, by winning a crucial battle, placed him on the throne of Wessex. Æthelstan had given Uhtred his oath to never fight him or invade his native Northumbria while Uhtred lived.\nFor many years, Æthelstan kept his word, but having gained control of the Saxon kingdoms of Mercia and East Anglia, the only thing standing in the way of fulfilling Alfred the Great's dream of uniting all of the Ænglisc-speaking peoples under one monarch is a Northumbria ruled by a weak king named Guthfrith. Furthermore, Æthelstan's Christian advisers have told him that an oath to a pagan is not binding.\nFinally, he breaks his promise and invades Northumbria. He orders Uhtred to capture the fleeing Guthfrith and turn him over, which Uhtred does. (Guthrith is allowed to keep his throne, but Æthelstan places a strong garrison in Eoferwic, Guthfrith's capital, to keep him in line.) Constantine, king of Alba, Northumbria's northern neighbour, grows concerned and starts forging an alliance against Æthelstan. He sends an envoy to Uhtred, trying to gain his support, but Uhtred does not want to be dragged in on either side.\nWhen Uhtred neglects to inform Æthelstan of the meeting, Æthelstan mistrusts his old friend and mentor, and sets into motion a plan to seize Bebbanburg. He summons Uhtred and others to a gathering, then sends Aeldred, one of his advisers, and 200 men to Bebbanburg with a letter with a forgery of Uhtred's seal. Uhtred's estranged eldest son, Bishop Oswald, warns him, and Uhtred is able to race home before Aeldred arrives. Remaining hidden, he watches as Aeldred tries to bring his men into the fortress using the forgery, then sends Aeldred away.\nLater, he spreads rumours that he has found a treasure trove of gold. As he had hoped, this lures both Guthfrith and Aeldred into his trap. He captures and kills them, then blames their deaths on a Scottish raiding party. Æthelstan is not fooled. He brings an army to (seemingly) besiege Bebbanburg. However, this is just a ploy to deceive Constantine. Æthelstan, after reaching Bebbanburg, keeps marching his men further north, into Alba. However, though he advances all the way to the northern end of Britain, Constantine avoids meeting him in battle, and Æthelstan eventually has to return home.\nThere is peace for three years. Then Anlaf, the most powerful Norse leader in Ireland, joins Constantine, Owain of Strath Clota, and others in invading Cumbria. There they challenge Æthelstan to a battle at a site they have chosen. Uhtred examines the spot carefully and realises that, while it favours the invaders, it also makes their battle plan obvious, and Uhtred believes Æthelstan can win if he follows Uhtred's advice. Æthelstan does, and though outnumbered, crushes his enemies after a hard-fought battle.\nJust before the battle, Æthelstan orders Uhtred to marry a rich, young widow so that he will have a strong, loyal man to guard his northern border. While Uhtred is content to be Lord of Bebbanburg, with his new wealth and lands extending from coast to coast, others start calling him the Lord of the North.\nReception\nThe book currently holds a rating of 4.60 out of 5 on Goodreads with 66% of a total 14,600 ratings being 5 stars.\nReferences"
    }
  ]
}