{
  "content": [
    {
      "type": "text",
      "text": "# War of the Monsters__disambig_1\n\n| publisher  = Sony Computer Entertainment\n| director   = Kellan Hatch\n| producer   = Dylan Jobe\n| designer   = Eric SimonichKellan HatchDylan JobeScott Campbell\n| programmer = Bruce WoodardJeff LimbackMike BadgerDylan JobeKarl Loveridge\n| artist     = David WrightJennifer FortinYeon-Seon KimSteve Argyle\n| writer     =\n| composer   =\n| platforms  = PlayStation 2\n| released   =\n| genre      = Action, fighting\n| modes      = Single-player, multiplayer\n}}\nWar of the Monsters is a fighting video game developed by Incog Inc. Entertainment and published by Sony Computer Entertainment for the PlayStation 2. Santa Monica Studio assisted on development, The game was released on the PlayStation 2 in January 2003 in North America and in April in Europe. An emulated and upscaled version was re-released on the PlayStation 4 in December 2015.\nThe game is set in the aftermath of an alien invasion of Earth where their hazardous fuels have spawned giant monsters that battle one another in city environments. The game pays homage to kaiju films and 1950s science fiction films.\nGameplay\nMonsters battle in a city environment.\nIn War of the Monsters, players take the roles of large monsters in city environments. The game plays as a fighting game yet works differently from the traditional one-on-one structured rounds. Instead, fights can include up to 4 monsters in a four-way simultaneous fighting structure. The camera is in third person perspective, allowing the player to focus solely on their character.\nMonsters have two status bars in each game, health and stamina. Like the standard fighting game formula, every time a monster takes damage, their overall Health bar drops until it is completely depleted, resulting in player defeat. Stamina determines how much energy a monster can attack with. The bar drops if a monster picks up another foe or performs a ranged attack. If the bar is full, a monster can perform special attacks, whereas if the bar is completely drained, they become temporarily unable to use basic attacks (they can still throw and attack with items however, which adds energy to the bar and helps an empty bar recover faster).\nAlso unlike most fighting games, players are allowed to roam freely within the city area, which allows climbing of jumping from buildings and cliffs. Monsters can use the environment to deal out damage to their foes by making weapons of various objects found within the city, such as vehicles and rubble as projectiles, steel girders and stone columns as clubs and radio antennae as a spear to impale others, temporarily stunning them. There are also some environment pick-ups, which can increase health or stamina, appearing as green or blue orbs and floating radioactive signs. Buildings can be destroyed if a monster directly attacks or is thrown into it. In some cities, taller buildings can topple over sideways that can crush other monsters, killing them instantly.\nIn the Adventure mode, along with a series of set fights with other monsters, boss battles are also present. They are much larger than the standard playable monsters and required certain strategies to defeat. \"Tokens\" can also be earned through Adventure mode, which can be spent at the \"Unlocks\" shop to unlock more cities, monsters, and monster skins. And you also can unlock mini-games like dodge ball or city destruction.\nMultiplayer options allow two players via split-screen, which can be set to merge into one screen when both players are close enough to fit on the same screen.\nPlot\nEach level of the game features a fictional movie poster that includes the game's monsters.\nThe plot is set in the 1950's where a fleet of alien flying saucer warships invade the Earth, causing massive damage. The scientists of the world's nations manage to create a series of secret weapons, which, when activated, let loose shock waves that short-circuit the saucers and cause them to crash. Unfortunately, the flying saucers were all fueled by a green radioactive liquid, which leaked out as they crashed. Through this, the fuel infects animals, humans, and robots, turning them into giant mutant monsters, creating a war for supremacy among them. The player acts as one of these monsters and battles against the rest in fictional cities across the globe and the remaining UFOs.\nThe story mode of the game starts out in Midtown Park where a giant mutant ape called Congar defeats a wave of military forces but is fought and defeated by the lead monster.\nIn Gambler's Gulch, the lead monster also defeats the reptilian beast, Togera. After Togera's defeat, a military class mech called Robo-47 and the military show up and attack the lead monster but are defeated as well. At a military base at Rosedale Canyon, the lead monster is confronted by a horde of irradiated giant ants and a mega robot, Goliath Prime. Prime and the ants are all defeated.\nIn Metro City, the military decide to test their new weapon, Mecha-Congar, on the giant mantis, Preytor, who was attacking the city. Before they could fight the lead monster appears and defeats them both. The lead monster then travels to Century Airfield and defeats the twin dragons called Raptros.\nThen, at the Atomic Island power plant, the lead monster defeats a swarm of Kineticlops, living electrical monsters, by causing a nuclear meltdown. In the resulting ruins, the lead monster must battle a large, three headed plant creature called Vegon.\nTwo Robo-47s stop a UFO attack in scenic Baytown and then try to slay the lead monster. Both are repelled and beaten.\nIn the Pacific island of Club Caldera, the rock monsters, Magmo and Agamo fight each other with the lead monster caught in the middle. Both are beaten.\nAfter defeating two robots, Ultra-V at the \"Tsunopolis\", the lead monster is abducted by a UFO that takes it back to the mothership. There the lead monster has to fend off three Zorgulons before being abducted once more when the mothership explodes, causing the UFO to crash into the North American city of Capitol. There, the alien leader Cerebulon attacks in a multi-layered tripod battle suit. After Cerebulon is defeated, the lead monster victor watches as the last part of Cerebulon, a small timid insect-like creature flees. A short movie is shown about the monster's origin depending on who the player chooses. The only exceptions are Raptros the dragon and Zorgulon the alien creature who has their own ending with roar in victory.\nReception\n| Allgame =\n| EGM = 7.67/10\n| EuroG = 8/10\n| Fam = 27/40\n| GI = 6/10\n| GamePro =\n| GameRev = B−\n| GSpot = 7.4/10\n| GSpy =\n| GameZone = 8.2/10\n| IGN = 8.9/10\n| OPM =\n| rev1 = Entertainment Weekly\n| rev1Score = A−\n| rev2 = Maxim\n| rev2Score = 10/10\n}}\nWar of the Monsters received \"generally favorable reviews\" according to video game review aggregator Metacritic.  In Japan, Famitsu gave it a score of three sevens and one six for a total of 27 out of 40.\nMost reviewers praised the game's style and monster roster, being a homage to classic monster movies. IGN stated that \"the game draws its inspiration from movies like The Beast from 20,000 Fathoms, King Kong, and  Godzilla, the characters immediately appear to be inspired by from the great Ray Harryhausen\", going on to say \"each of the game's 10 gigantic beasts are as fun to play as they are to look at\" while GameSpot said \"a slick presentation gives the game the style of an old drive-in movie or news telecast, and it really works well to accentuate the game's retro theme and characters.\" The publication later named it the second-best PlayStation 2 game of January 2003.\nGameSpy was equally impressed, noting the destructible environments, that \"WotM captures the joy of destruction more so than any game I've ever played. Did you think knocking over buildings was fun in Rampage? It's ten... no, twelvety times better in WotM\". Game Informer, however, complained about certain aspects of gameplay, that \"the unblockable attacks are just downright unfair\" and that \"the lazy camera produces numerous blind spots throughout a battle\". GameRevolution noted AI issues, that \"the monsters routinely demonstrate a strong sense of self-preservation\", which they called \"extremely frustrating behavior\".\nDuring the 7th Annual Interactive Achievement Awards, the Academy of Interactive Arts & Sciences nominated War of the Monsters for \"Console Fighting Game of the Year\", which was ultimately given to Soulcalibur II.\nSee also\n* King of the Monsters, an earlier series of games with a similar plotline.\n* Rampage, an earlier series with similar monsters.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}