{
  "content": [
    {
      "type": "text",
      "text": "# War of the Camps__disambig_1\n\n}}\nPLO\n* Fatah\n* DFLP\n* Palestinian Liberation Front\nSupported by:\nAl-Mourabitoun CAOL SSNP-L (Anti-Syrian government faction) PSP (1987) LCP (1987)\n| combatant2        =  Amal Movement\n* Lebanese Resistance Regiments\nSSNP-L\nPNSF\n* PFLP-GC\n* Fatah al-Intifada\n* As-Sa'iqa\nSupported by:\nSyria\n* Syrian Army\nLebanese Army\n*6th Infantry Brigade\n*8th Infantry Brigade\n| commander1        =  Yasser Arafat Abu Abbas Nayef Hawatmeh Ibrahim Kulaylat Abbas al-Musawi Mohsen Ibrahim Inaam Raad Walid Jumblatt George Hawi\n| commander2        =  Nabih Berri Isaam al-Mahayri Ahmed Jibril Abu Musa Isam al-Qadi Hafez al-Assad Ghazi Kanaan  Michel Aoun  Rashid Karami\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| casualties3       = Between 4,500 and 6,500 dead\n| image_size        = 300px\n}}\nThe War of the Camps (), was a subconflict within the 1984–1990 phase of the Lebanese Civil War, in which the Sunni Palestinian refugee camps in Beirut were besieged by the Shia Amal militia.\nThe War of the Camps was a struggle for control over West Beirut and was considered an extension of the political struggle between Syria and the Palestine Liberation Organization (PLO). It took place between May 1985 and July 1988.\nBackground\nDuring the 1948 Arab-Israeli War and the subsequent Nakba (catastrophe) of the Palestinian people, hundreds of thousands of Palestinian refugees fled to Southern Lebanon. A few Palestinians with skills and capital were allowed to reside in cities ; the majority, however were destitute peasants who could only offer their unskilled work to the Lebanese economy, and mostly lived in squalid refugee camps near the main cities. Upon arriving in Southern Lebanon, the locals sympathized with their catastrophic conditions, and many were sheltered in Abdul Husayn Sharaf ad-Dine's ''al-Ja'fariyya school until the authorities dealt with the situation. Sharaf ad-Dine also introduced a Palestinian curriculum known as \"Matriculation\", to allow Palestinian students to finish what they had started in Palestine. The sympathy was shared by the depopulatees of the Shia villages in Palestine, many of whom were massacred.\nEven before the establishment of the Palestine Liberation Organization (PLO) in 1964, exiled Palestinian intellectuals residing in Lebanon and other Arab countries began to form clandestine paramilitary groups in the late 1950s. In 1956, Sharaf ad-Dine's ''al-Ja'fariyya'' school organized a guerrilla group consisting of 25 Lebanese and Palestinian students with the sole purpose of launching strikes in Israel.  Moreover, prior to the Cairo Agreement in 1969, PLO's chairman Ahmad Shukeiri (1964–1967) had set up a PLO training camp in the southern village of Kafr Dunin. As such, pro-Palestinian sentiment among some Lebanese, in particular the Shiites, was high. However, this unconditional support was disrupted following clashes between the Palestinians and the Lebanese Army in April 1969. Israeli retaliation against Palestinian operations mostly affected the local civilians, and in 1970 had led to the migration of more than 50,000 from the south. Actions of rogue factions further contributed to the alienation of the locals, such as setting up checkpoints throughout Beirut and the South, actions which Musa Sadr denounced as unrepresentative of the mainstream PLO.\nIsrael's second invasion of Lebanon in June 1982 succeeded in driving thousands of Palestinian fighters under the command of PLO Chairman Yassir Arafat out of Southern Lebanon and West Beirut. Under international auspices, PLO forces were evacuated to northern Lebanon and re-settled in the port city of Tripoli. By this time, however, Syrian President Hafez al-Assad proceeded to expel Arafat and the Palestinian factions allied to him from Lebanon. Israel's 1982 invasion led to its beginning a 20-year-long occupation of a shallow fringe of southern Lebanon (10 to 15 kilometers) as a security zone for its border, allied with a local force - the South Lebanon Army, which was originally purely Christian but gradually added local Shiites and Druze to its ranks. Meanwhile, with permission from Syria, Iran sent a contingent of Revolutionary Guards to Lebanon, tasked with amalgamating, reorganizing and building up the small Shiite religious factions into a new organization - Hezbollah.\nAssad sought to control both the PLO and Lebanon. He worried that Palestinian guerrilla activities would invite another Israeli invasion and that his minority Alawite regime in Sunni-majority Syria would be endangered by the advancement of the (mostly Sunni) Palestinians. Initially, the Syrian government encouraged its favoured Palestinian groups to compete for influence, facilitating the entrance of as-Sa'iqa, PFLP-GC, and the pro-Syrian dissident Fatah faction under Colonel Said al-Muragha (Abu Musa). However, Syria's allies were strong only in the areas controlled by the Syrian Army, such as the Beqaa valley. In the areas beyond Syria's control, however, it soon became apparent that Palestinian organizations such as Fatah, PFLP and DFLP had far stronger support.\nAssad recruited Said al-Muragha to drive Arafat and his loyalist fighters out of Lebanon. Musa, himself a former member of Fatah, used Arafat's public willingness to negotiate with Israel as a pretext for war. In November 1983, Musa's Fatah al-Intifada (Fatah-Uprising) faction fought the Arafatist Fatah for a month at Tripoli, until Arafat once again was on his way to Tunisia by December. Unfortunately for Assad, Arafat's Fatah forces quietly returned to Lebanon over the next two years, ensconcing themselves in the many refugee camps in Beirut and the South.\nAs more Palestinians regrouped in the South, Assad's anxiety grew, as he did not want to give Israel a pretext for another invasion. This time, Assad recruited the more powerful Shia Amal Movement militia headed by Nabih Berri to dislodge Arafat's loyalists. Assad benefited from this alliance, which enabled him to exert a greater degree of control over Lebanese affairs through his local Lebanese allies. The benefit for Amal was revenge for decades of Palestinian arrogance and the opportunity of gaining further control over Shia-populated areas of Lebanon.\nBy mid-1985 Amal was also in conflict with the Druze Progressive Socialist Party (PSP) and its militia, the People's Liberation Army (PLA), led by Walid Jumblatt in the mountainous Chouf region. As Amal-PSP relations severely deteriorated, the Palestinian alliance with the Druze PSP was re-established. Unlike the majority of other Lebanese leftist militias, the Communist Action Organization in Lebanon (OCAL), led by Muhsin Ibrahim, refused to cooperate with Syria in its attempts to vanquish Arafat. This refusal brought the wrath of the Syrians on the OCAL, forcing them to operate underground from 1987 onwards.\nHistory\nThe war of the camps\nOpposing forces\nAllied with the pro-Arafat Palestinian refugee camp militias were the Lebanese Al-Mourabitoun, Sixth of February Movement, Communist Action Organization in Lebanon (OCAL), Druze Progressive Socialist Party (PSP) and Kurdish Democratic Party – Lebanon (KDP-L), who faced a powerful coalition of Lebanese Communist Party (LCP), and Shia Muslim Amal movement militia forces backed by Syria, the Lebanese Army,  and the anti-Arafat Fatah al-Intifada, As-Sa'iqa, Palestine Liberation Army, and Popular Front for the Liberation of Palestine – General Command (PFLP–GC) dissident Palestinian guerrilla factions.\nSome Palestinian fighters were able to return to the camps via Cyprus. The journey involved paying substantial sums of money to the Lebanese Forces militia who controlled the port at Jounieh. On 2 January 1987 the ferry from Larnica with 164 passengers was turned back by the Israeli Navy. The fighters were not arriving in large numbers; one estimate suggests 3-4,000 arrived in 1985.\nApril 1985\nThe February 6 Intifada forced the Multinational Force (MNF) to withdraw from Beirut in February–March 1984. Amal took control of West Beirut, establishing a number of outposts and checkpoints around the camps (mostly in Beirut, but also to the south). On 15 April 1985, an alliance of Amal, the PSP, and the Lebanese Communist Party (LCP) militia, the Popular Guard, attacked the Al-Mourabitoun, the main Sunni Nasserite militia and the closest ally of the PLO in Lebanon. The Al-Mourabitoun was vanquished after a week of street-fighting and their leader, Ibrahim Kulaylat sent into exile.\nMay 1985\nOn 19 May 1985, heavy fighting erupted between Amal Movement and Palestinian camp militias for the control of Sabra and Shatila and Burj el-Barajneh camps in Beirut. Amal was supported by the predominantly Shia Sixth Brigade of the Lebanese Army commanded by General Abd al-Halim Kanj and by the 87th Infantry Battalion from the predominantly Christian Maronite Eighth Brigade loyal to General Michel Aoun stationed in East Beirut. Virtually all the houses in the camps were reduced to rubble.\nIn terms of sheer numbers, the Shi'ites outnumbered the Palestinians 5:1. Amal was heavily backed by Syria and indirectly supported by Israel, whereas the PLO did not enjoy much outside support. Amal also had the advantage over the PLO in terms of military equipment, especially artillery pieces and armored vehicles.\nAlthough the PSP/PLA and LCP/Popular Guard joined forces with Amal in defeating the Al-Mourabitoun, they remained militarily neutral in the fight against the PLO. Despite prodding from Syria, these political parties and their respective militias contributed nothing more than verbally expressing support for Amal and demanding that Arafat step down. The PSP/PLA even allowed the PLO to station their artillery on Druze-controlled areas. This left Amal to do the work of dislodging the Arafat loyalists, with some help from Syria's anti-Arafat Palestinian allies, such as As-Sa'iqa, PFLP-GC and Fatah al-Intifada. The alliance between Amal and most of the pro-Syrian Palestinian groups eventually soured however, and clashes would later break out between them. While some dissident Palestinian commanders such as Ahmed Jibril and Abu Musa still supported Amal against the PLO, many anti-Arafat fighters battled Amal in defense of the camps.\nOn 30 May 1985, much of Sabra fell to its attackers. Amid Arab and Soviet political pressure on Syria and an emergency meeting of Arab League foreign ministers scheduled to discuss the issue on 8 June, Amal declared a unilateral ceasefire the next day. Despite this, lower-scale fighting continued. In Shatila, the Palestinians only retained the part of the camp centered around the mosque. Burj al-Barajneh remained under siege as Amal prevented supplies from entering or its population from leaving.\nThe death toll remains uncertain, but is likely to have been high. International pressures led to a ceasefire being signed between Amal and the Palestinian National Salvation Front on 17 June in Damascus. Sporadic clashes erupted again in September 1985.\nMay 1986\nThe situation remained tense and fighting occurred again between September 1985 and March 1986. Fighting broke out for a third time on 27 March 1986, coinciding with a rocket attack on Kiryat Shimona; it lasted for three days. In Sidon, Amal issued a stern warning to Palestinian factions who tried to reorganize in southern Lebanon. At the time it was estimated that there were more than 2,000 PLO fighters in Lebanon. Exactly one year after the first battle, on 19 May 1986, heavy fighting erupted again. Bolstered by newly received heavy weaponry (including Soviet-made artillery pieces and T-55A tanks loaned by Syria), Amal tightened its siege on the camps. Many ceasefires were announced but most of them did not last more than a few days.\nJune 1986\nMeanwhile, throughout West Beirut, Amal continued to suppress the remaining predominately Sunni, pro-Palestinian militias such as the small Nasserite Sixth of February Movement in June 1986. The PLO was also aided by Lebanese-Kurdish fighters from the Kurdish Democratic Party – Lebanon (KDP–L), who lived with their families alongside the Palestinians in the refugee camps. Many leftist Lebanese-Kurdish militants joined Palestinian guerrilla movements during the 1975-76 Lebanese civil war, and these militiamen now fought to protect their homes from Amal, as well as supporting their Palestinian comrades. The situation began to cool on 24 June 1986, when the Syrians deployed some of their Commando troops, assisted by a special task-force of 800 Lebanese Army soldiers and Gendarmes from the Internal Security Forces.\nSeptember 1986\nThe tension due to this conflict was also present in the South, where the presence of Palestinian guerrillas in the predominantly Shia areas led to frequent clashes. The third and deadliest battle began on 29 September 1986, when fighting broke out around the Rashidieh camp in Tyre between Amal and locally based PLO groups. Amal surrounded and blockaded the camp, though some supplies arrived by sea. All the smaller Palestinian camps were destroyed and hundreds of homes set on fire. A thousand Palestinian men were kidnapped. By December 7,500 Palestinian civilians had fled from Tyre to Sidon which was not under Amal’s control. Thousands of others fled inland. Around 7,000 non-combatants remained in the camp. A month after the break-out of fighting in Tyre Amal laid siege to the camps in Beirut. On 24 November a force consisting of most of the Palestinian factions in Sidon launched an offensive against Amal positions in the Christian town of Maghdouché on the eastern hills of Sidon, in order to re-open the road to Rashidieh. In a week of fighting they managed to take control of most of the town. During the offensive the Israel Air Force (IAF) launched several air strikes against Palestinian positions around the Sidon area. As before, the Arab League pressured both parties to stop the fighting. On 1 December King Fahd of Saudi Arabia is quoted as saying the attacks on the camps “wounded the Arabs everywhere”. A cease-fire was negotiated between Amal and pro-Syrian Palestinian groups on 15 December 1986, but it was rejected by Arafat's Fatah, who tried to appease the situation by giving some of its positions to the Al-Mourabitoun militia in exchange for supplies to the camps.\nFebruary–April 1987\nFollowing the disappearance of Terry Waite, January 1987, the dynamics in Beirut changed. The return of global media organisations to the city led to attention being focused on the sieges of Bourj el-Barajneh and Shatila. Dr Pauline Cutting, a British doctor in Bourj el-Barajneh, was amongst those who gave graphic descriptions, via radio telephone, of conditions in the camps. Deliverance of humanitarian aid of the UNRWA to the camps was severely restricted through the ongoing blockades of the Amal milita. Because of that, many Palestinian refugees suffered, lacking needed medical care and supplies. There had been no fresh food or medicines allowed in for eight weeks. On 13 February two trucks of supplies were allowed into Bourj el-Barajneh, but they were shelled on their  arrival, six people were killed and twenty four wounded. On 17 February Nabih Berri, in Damascus, ordered an end to the sieges.\nSimultaneously a major escalation of violence erupted in West Beirut, when the Druze PSP/PLA and Amal again turned against each other in what became known as the \"War of the Flag\". The conflict was started when a PSP/PLA fighter, acting on orders from their leader Walid Jumblatt, walked to the Channel 7 TV station (French: Télé Liban – Canal 7) building in the Tallet el-Khayat sector at Msaytbeh and replaced the Lebanese national flag hoisted there by the Druze five-coloured flag, which was interpreted by Amal militiamen as a deliberate act of provocation. A new round of brutal fighting soon spread throughout western Beirut, and although Amal forces initially managed to restore the Lebanese national flag on the Channel 7 building, they were subsequently overpowered by an alliance of PSP/PLA, LCP/Popular Guard and SSNP militias, and driven out of large portions of West Beirut. On 21–22 February, the week of fighting was ended by the arrival in West Beirut of 7,000 Syrian Commando troops under the command of Major general Ghazi Kanaan, assisted by Lebanese Internal Security Forces (ISF) gendarmes, who immediately closed over fifty militia \"offices\" and banned the carrying of weapons in public, detaining in the process many young men with beards suspected of being militiamen and began executing anyone found with unauthorised weapons.\nAn incident on 24 February in which over twenty Hizbollah supporters were killed led to intense pressure on Syria from Iran and an end to the army’s advance into the Southern suburbs, Dahieh, with its 800,000 Shia residents. Shortly afterwards Syria troops took over positions around the camps and began allowing medicines into them. Women were allowed to leave to find food. Men were not. It was estimated that there were 200 PLO fighters remaining in Shatila Camp and 700 in Bourj el-Barajneh. There were around 20,000 non-combatants. During the last bout of fighting around 240 people were killed and 1,400 wounded, many of the casualties were in the Shia districts which were shelled from the Chouf.\nConsequences\nInternal fighting had happened before in the Muslim/leftist camp (the former Lebanese National Movement or LNM) but never on such a massive scale. This inflicted a severe blow in terms of public image for many Muslim militias and destroyed the perception of unity. The main Lebanese Sunni militia, the Al-Mourabitoun, was crushed and their leader Ibrahim Kulaylat sent into exile. The results were mitigated since the PLO retained control of some of the camps.\nAt the end of the war, an official Lebanese government report stated that the total number of casualties for these battles was put at 3,781 dead and 6,787 injured in the fighting between Amal and the Palestinians. Furthermore, the number of Palestinians killed in inter-factional clashes between pro-Syrian and pro-Arafat organizations was around 2,000. The real number is probably higher because thousands of Palestinians were not registered in Lebanon and the blockade meant that no officials could access the camps, so that all the casualties could not be counted. As the Amal-initiated \"War of the Camps\" against the PLO ended, the religiously oriented Hezbollah and its rival the essentially secular Amal began clashing in South Lebanon and in Beirut's southern suburbs over control of the Shiite population of Lebanon.\nSee also\n* Amal Movement\n* Lebanese Army\n* Lebanese Civil War\n* List of weapons of the Lebanese Civil War\n* Internal Security Forces\n* Sabra and Shatila massacre\n* Mountain War (Lebanon)\n* People's Liberation Army (Lebanon)\n* War of Brothers\n* 6th Infantry Brigade (Lebanon)\n* 8th Infantry Brigade (Lebanon)\nNotes\nReferences\n* Edgar O'Ballance, Civil War in Lebanon, 1975-92, Palgrave Macmillan, London 1998.\n* Éric Micheletti and Yves Debay, Liban – dix jours aux cœur des combats, RAIDS magazine n.º41, October 1989 issue.  (in French)\n* Samer Kassis, 30 Years of Military Vehicles in Lebanon, Beirut: Elite Group, 2003.\n* Moustafa El-Assad, Civil Wars Volume 1: The Gun Trucks, Blue Steel books, Sidon 2008.\n* Rex Brynen, Sanctuary and Survival: the PLO in Lebanon, Boulder: Westview Press, Oxford 1990.  – [https://prrn.mcgill.ca/research/papers/brynen2.htm]\n* Joe Stork, The War of the Camps, The War of the Hostages, MERIP Reports, No. 133 (June 1985), pp.&nbsp;3–7 and 22.\n* Robert Fisk, Pity the Nation: Lebanon at War, London: Oxford University Press, (3rd ed. 2001).  – [https://books.google.com/books?id=VrXpeELOUNsC&pg=PA145]\n* The War of the Camps, Journal of Palestine Studies, Vol. 16, No. 1 (Autumn, 1986), pp.&nbsp;191–194.\n*Zachary Sex & Bassel Abi-Chahine, Modern Conflicts 2 – The Lebanese Civil War, From 1975 to 1991 and Beyond, Modern Conflicts Profile Guide Volume II, AK Interactive, 2021.\nFurther reading\n*Antoine J. Abraham, The Lebanon war, Greenwood Publishing Group, 1996.  – [https://books.google.com/books?id=pk2GxcpojakC&dq=lebanese+arab+army&pg=PA38]\n*Barry Rubin (editor), Lebanon: Liberation, Conflict, and Crisis, Middle East in Focus, Palgrave Macmillan, London 2009.  – [https://books.google.com/books?id=9V_JAAAAQBAJ&dq=maronite+league&pg=PA40]\n* Denise Ammoun, Histoire du Liban contemporain: Tome 2 1943–1990, Éditions Fayard, Paris 2005.  (in French) – [https://books.google.com/books?id=aGHk5M0CGcoC&pg=PT234]\n* Fawwaz Traboulsi, ''Identités et solidarités croisées dans les conflits du Liban contemporain; Chapitre 12: L'économie politique des milices: le phénomène mafieux'', Thèse de Doctorat d'Histoire – 1993, Université de Paris VIII, 2007. (in French) – [http://www.111101.net/Writings/Author/Fawwaz_Traboulsi/]\n*Fawwaz TrabouIsi, War, Militias and the State: The Role of War in State and Society Transformation – the Lebanese Case, Paper presented at the workshop on \"War as a Source of State and Social Transformation in the Middle East\", Social Science Research Council, Paris, 2–4 November 1994, pp.&nbsp;1–26. – [http://isites.harvard.edu/fs/docs/icb.topic572311.files/Mon%20Jul%2020%20-1/Trabulsi.pdf]\n* Fawwaz Traboulsi, A History of Modern Lebanon: Second Edition, Pluto Press, London 2012.\n*Jean Sarkis, Histoire de la guerre du Liban, Presses Universitaires de France - PUF, Paris 1993.  (in French)\n*Samir Kassir, La Guerre du Liban: De la dissension nationale au conflit régional, Éditions Karthala/CERMOC, Paris 1994.  (in French)\n*Samir Makdisi and Richard Sadaka, The Lebanese Civil War, 1975-1990, American University of Beirut, Institute of Financial Economics, Lecture and Working Paper Series (2003 No.3), pp.&nbsp;1–53. – [http://www.aub.edu.lb/fas/ife/Documents/downloads/series3_2003.pdf]\n*Oren Barak, The Lebanese Army – A National institution in a divided society, State University of New York Press, Albany 2009.  – [https://books.google.com/books?id=JM1xpHXZumAC&dq=lebanese+arab+army&pg=PA100]\n* Itamar Rabinovich, The war for Lebanon, 1970-1985, Cornell University Press, Ithaca and London 1989 (revised edition). , 0-8014-9313-7\nExternal links\n*[http://armeelibanaise.kazeo.com/ Histoire militaire de l'armée libanaise de 1975 à 1990] (in French)\n* , with Palestinians, leftists, and Druze fighters allied against Amal, eventually drawing further Syrian intervention."
    }
  ]
}