{
  "content": [
    {
      "type": "text",
      "text": "# War Against the Weak\n\n'War Against the Weak: Eugenics and America's Campaign to Create a Master Race' is a 2003 book by historian and journalist Edwin Black. Overall, War Against the Weak shows how the eugenics movement was supported and promoted by a wide range of individuals, organizations, and corporations in the United States, and how this led to the forced sterilization and persecution of millions of people. According to professor Jack Fischel, \"It is apparent from Black’s research that American eugenicists contributed to Nazi racial hygiene policy.\"\nSynopsis\nA non-fiction book that explores the eugenics movement in the United States and how it led to the forced sterilization and genocide of millions of people, primarily those deemed \"unfit\" by the movement's proponents. The book traces the history of eugenics from its origins in the late 19th century, through its rise in popularity in the early 20th century, and its eventual decline after World War II.\nBlack examines the role of prominent eugenicists such as Charles Davenport, Harry Laughlin, Madison Grant, Henry Fairfield Osborn, Alexander Graham Bell, E.S. Gosney, Clarence Gamble, Irving Fisher, Margaret Sanger, Willet Hays and Alexis Carrel and how their beliefs were embraced by the government, academia, and the scientific community. He details how eugenics led to the forced sterilization of thousands of Americans, many of whom were poor, mentally ill, or people of color.\nThe book also delves into the links between American eugenics and the Nazi regime in Germany, where eugenics was taken to its ultimate and horrific conclusion with the Holocaust.\nBlack reveals how American eugenicists provided inspiration and support to the Nazi regime, and how the Holocaust was in many ways the fulfillment of the eugenicist dream.\nAcademic journal reviews\n*\n*\n*\n*\n*\n*\n*\n* Rosenberg M. WELL-BORN? New Formations. 2007;(60):162-165. [https://search.ebscohost.com/login.aspx?direct=true&db=a9h&AN=25025079&site=eds-live&scope=site EBSCO]\nReferences\nSee also\n* Eugenics\n* Racism\n* Eugenics in the United States"
    }
  ]
}