{
  "content": [
    {
      "type": "text",
      "text": "# War of Faith\n\n| alt_name             =\n| genre                = SpyWarRevolutionary\n| writer               = Weng Liangping\n| director             = Yao Xiaofeng\n| starring             = Wang YiboLi QinWang Yang\n| theme_music_composer =\n| open_theme            =\n| end_theme             = Not What You Thinkby Zhou Shen\n| composer             =\n| country              = China\n| language             = Mandarin\n| num_episodes         = 38\n| list_episodes        =\n| executive_producer   = Zhang Shuwei\n| producer             =\n| editor               =\n| location             = ShanghaiJiangxi\n| cinematography       =\n| camera               = Multiple-camera setup\n| runtime              = 45 minutes\n| company              = CCTViQIYIRuyi PicturesEnlightenment Pictures\n| channel              = CCTV-8iQIYI\n| first_aired          =\n| last_aired           =\n| related              =\n| based_on             =\n| creator              =\n}}\nWar of Faith () is a 2024 Chinese spy war revolutionary theme drama directed by Yao Xiaofeng starring Wang Yibo, Li Qin, and Wang Yang. War of Faith is iQiyi's first drama to reach over 10,000 hits in 2024 and it is one of the most influential spy dramas in recent years.  This drama does not focus too much on spy warfare, but more on the establishment of the protagonist's faith.  It tells the story of Wei Ruolai (played by Wang Yibo), a patriotic young man in the 1930s who witnessed the darkness of society, gradually found his life direction, and finally joined the historical torrent of the new revolution led by the Chinese Communist Party.\nSynopsis\nSet in 1930s Shanghai, the series tells the story of Wei Ruolai, a math genius from a small poor village, who became an ordinary employee of the Kuomintang Central Bank.  He gradually gained the appreciation of senior adviser Shen Tunan (played by Wang Yang) for his outstanding workability and was accepted as a disciple. In the process, Wei Ruolai saw a lot of corruption and darkness in the Kuomintang's financial field and got pulled into the conflict between the Kuomintang and the Chinese Communist Party (CCP). Guided by Shen Tunan's sister, Shen Jinzhen (played by Li Qin), who has been working as an underground member of the CCP, different choices made Wei Ruolai and Shen Tunan eventually part ways.  After Wei Ruolai's action to seek justice for the common people and Shen Jinzhen's identity became compromised, both of them escaped from Shanghai to Jiangxi. Under the CCP's leadership, Wei Ruolai participated in the smokeless war to smash the Kuomintang's economic blockade of the Central Soviet Area, and gradually grew into a red financier who was responsible for the party's economic front.\nCast\n* Wang Yibo as Wei Ruolai, a young man who relied on his outstanding ability to enter the central bank as Shen Tunan's personal assistant. He gradually gained Shen Tunan's appreciation and became his student. But after experiencing the \"Counterfeit Currency Case\" and the \"Construction of Treasury Bills\" incident, he saw the corruption and darkness of the National Government. In the process, he chose to join the Soviet State Bank and became a red financier who took charge of the Communist Party's financial front.\n* Li Qin as Shen Jinzhen, as a senior engineer who came from a wealthy family and returned from studying abroad. She is a staunch underground member of the Chinese Communist Party and has participated in the execution of party tasks many times, obtaining intelligence information from her brother, Shen Tunan, and passing it on to higher-level organizations.\n* Wang Yang as Shen Tunan, the Senior Advisor to the Central Bank. Believing in the Three People's Principles, he intended to take back customs custody rights and achieve financial unification. He carried out an economic encirclement and suppression of the Soviet area and was later arrested in the Soviet area. In the Soviet area, his faith changed and he became an underground party member, renamed, Gu Yan, and worked hand in hand with Wei Ruolai to fight for his future financial career in Shanghai.\n* Zhang Tianyang as Lin Qiaosong, the captain of the Detective Team of the Military Law Division of Songhu Garrison Command. A graduate of Whampoa Military Academy, he is ruthless, smart and cunning. He once had hopes for national rejuvenation, but under the impact of reality, he began to drift with the crowd. He participated in many actions to arrest and kill members of the underground party of the Chinese Communist Party.\n* Wang Xueqi as Xu Nuo, the owner of a tailor shop, whose true identity is an underground member of the Chinese Communist Party, is responsible for the underground organization work in Shanghai. He and Shen Jinzhen were both teachers and friends. Sensing Wei Ruolai's talent in finance, Shen Jinzhen was reminded that he really wanted to develop Wei Ruolai into a colleague. After discovering that his identity was exposed, he decided to detonate the bomb and sacrifice himself.\n* Gao Lu as Su Dishu, Shen Tunan's wife. Knowledgeable and sensible, with love in her heart, she has always been firmly by Shen Tunan's side to support his financial reform work. Later, due to the chaotic domestic environment, she took their daughter to the UK under Shen Tunan's persuasion.\n* Yang Kun as Aunt Zhou, the landlord on Qibao Street, where Wei Ruolai lives. An old aunt from Shanghai who is smart and capable but hard-spoken and soft-hearted. She cared deeply about Wei Ruolai. Because she mortgaged her house to buy construction bonds and lost everything, she couldn't bear the blow and went completely insane.\n* Xiya Lan as Niu Chunmiao, Wei Ruolai's fiancée.  She has a bold and lively personality.  After returning to her hometown with Wei Ruolai and Shen Jinzhen, she joined the Communist Party organization together with Wei Ruolai.\n* Ling Ting as Li Shengda, a traitor to the Communist Party who could not withstand the torture of the enemy and rebelled against the organization, leading to the sacrifice of Lone Star, Wei Ruochuan (Wei Ruolai's brother). He was attempted murder twice by the Communist Party but survived. Later, he negotiated with Kang Shaojie and others by using information on the Communist Party, and was strangled by Wei Ruolai on his way to escape.\n* Zhu Tie as Leiming, a member of the Chinese Communist Party, head of the General Affairs Section of the Soviet State Bank. He is proficient in trade and negotiation.  He led the negotiations on the Tungsten ore trade with Germany.\n* Song Shuia as Huang Congyun, Shen Tunan's secretary. He has strong personal abilities, mainly handles Shen Tunan's daily work, and has won Shen Tunan's trust. He respected Shen Tunan very much and continued to follow him even after he lost power, and eventually died to protect Shen Tunan.\nProduction\nWar of Faith was filmed from January 2023 to May 2023.  The original script took five years in the making.\nSoundtrack\n{| class=\"wikitable\"\n! Name of the song\n! Lyrics\n! Composer\n! Singer\n! Remark\n|-\n| \"Not What You Think\"\n| colspan=\"2\" rowspan=\"1\" |Chen Xi\n| Zhou Shen\n| theme song\n|-\n| \"Looking at the Sparks\"\n| colspan=\"2\" rowspan=\"2\" |Dong Dongdong\n| Aska Yang\n| Ending song\n|-\n| \"Elder brother\"\n| Zhang Zining\n| episode\n|-\n| \"Dreamland\"\n| Chen Xi\n| Dong Dongdong\n| Wang Zhengliang\n| episode\n|-\n| \"Light of Life\"\n| colspan=\"2\" rowspan=\"1\" |Chen Xi\n| rural\n| episode\n|-\n| Opera \"Make Way for the Busy Man\"\n| colspan=\"2\" rowspan=\"1\" |Excerpt: Rossini's opera \"The Marriage of Figaro\"\n| Wang Dongjun\n| -\n|-\n| Pingtan \"New Edition by Wei Ruolai\"\n| colspan=\"2\" rowspan=\"1\" |Hou Xiaosheng, Zhang Yilin\n| Hou Xiaosheng\n| -\n|}\nSoundtrack was officially announced on March 19.\nReception\nThe drama garnered many critical reviews, positive responses, and discussions among viewers.  One of the most famous quotes from the main character, Wei Ruolai: “There is an old saying in China that you can take advantage of the long wind and break through thousands of miles of waves. The barren land you see, as long as you give time and patience, will definitely grow into a good economic land that is enough to support the world.” It has not only been used for publicity by major cultural and tourism companies, but also used by China Nuclear Energy, Sinopec, China Energy Construction, China Shipbuilding Industry, China General Nuclear Power Corporation, China Three Gorges, China Grain Reserves, China Post, State-owned Assets, Xiaoxin Kirin Software, and other units.\nThe Xinhua Daily Telegraph said that War of Faith is a \"breakthrough in the perspective of traditional spy war works\" and \"broaden[s] the audience['s perspective of] espionage works\".  The historical background related to the plot has triggered heated discussions among netizens. Following the clues such as the names of people and places appearing in the play, netizens relived history as the plot progressed.  The perspective of the drama is unique. It cuts into the spy war theme from a financial perspective, which has never been seen in previous spy war dramas.\nThe People's Daily praised the drama for its \"cinematic quality from the shooting angle to the color tone\" and \"excellent character creation\".  From the protagonist to the supporting role, almost every actor used wonderful performances to bring the characters to life and let the audience \"turn on this drama and feel as if they have traveled through time and space in person, gaining an immersive experience.\"\nThe Guangming Daily applauds the drama for \"skillfully weav[ing] the interpretation of faith into a suspenseful story\", triggering the audience's empathy with the characters.  The audience follows the life path of the protagonist, and witnesses the growth process that reflects the ideological and emotional characteristics of young people in that era, hence allowing \"the audience to see from him that faith is really tested in the face of danger, the strength of faith is tested in the rain of bullets, and the beauty of faith is shown in the close connection between personal fate and the future of the country and nation.\"\nAccolades\n{| class=\"wikitable\"\n|-align=center\n!Year\n!Awards\n!Category\n!Nominee\n!Result\n!Ref\n|-\n| rowspan=\"7\" |2024|| rowspan=\"5\" |The 29th Shanghai TV Festival Magnolia Award||Best TV Series|| ||\n|\n|-\n|Best Director\n|Yao Xiaofeng\n|\n|-\n|Best Actor\n|Wang Yang\n|\n|-\n|Best Cinematograhy\n|Zhou Wencao\n|\n|-\n|Best Art||Wu Jiakui||\n|-\n|The 32nd China TV Golden Eagle Awards||Best TV Series|| || ||\n|-\n|The 29th Asian Television Awards||Best TV Series|| ||\n|}\nReferences\nExternal links\n*[https://weibo.com/u/7869121746 War of Faith] on Weibo\n*"
    }
  ]
}