{
  "content": [
    {
      "type": "text",
      "text": "# War of Independence Ribbon\n\nThe War of Independence Ribbon (also known as \"freedom star\" ribbon) is an Israeli decoration and campaign ribbon awarded to Israelis who took part in the 1947–1949 Palestine war.\n|established=|higher=Medal of Distinguished Service|image=|lower=Sinai War Ribbon|name=The War of Independence Ribbon|precedence_label=Order of wear|type=Service Ribbon}}\nAward criteria\nThe ribbon is awarded to:\nA.  Any person who served in the IDF for a term of four months or more, between 1 February 1948 and 10 March 1949.\nB.  All IDF soldiers who fell during the War of Independence. In this case the ribbon will be awarded to the soldier's family for custody.\nC.  Those who do not fulfill the requirement of section A specified above, but have served in the IDF and have actually engaged in combat during the War of Independence. In this case every request will be dealt with separately.\nD.  Anyone who was confined to a border settlement for 120 consecutive days during the period specified in section A above.\nE.  This also applies to those who acted as officials dealing with immigration and procurement.\nIf the person eligible for the award has died, a family member or next-of-kin (which includes, in this instance, a widower, a widow, a son, a daughter, a father, a mother, a brother or a sister) is entitled to submit an application requesting the ribbon, or get a replacement in the event of loss or wear and tear.\nDesign\nRibbon\nThe ribbon is dark blue with a single red stripe in the middle and two white stripes on either end with a light blue stripe between each pair. The ribbon represents the flag and State of Israel and the red represents all those who lost their lives during the war.\nClasps\n*Decoration of State Warriors clasp\n*Palmah clasp\n* Jerusalem Defenders shield\n*WWII Jewish brigade badge\nSee also\n* The Volunteer Ribbon\n* Fighters against Nazis Medal\n*Israeli military decorations\nReferences"
    }
  ]
}