{
  "content": [
    {
      "type": "text",
      "text": "# War of Attrition (horse)__disambig_1\n\n| death_date =\n| country   = Ireland\n| colour    = Brown\n| breeder   = Miss B A Murphy\n| owner     = Gigginstown House Stud\n| trainer   = M F Morris\n| record    = 34 starts, 14 wins (three grade-one wins)\n| earnings  = £741,257\n| race      = Swordlestown Novices Cup (2005)Cheltenham Gold Cup (2006)Guinness Gold Cup (2006)\n| awards    =\n| honours   =\n| updated   =\n}}\nWar of Attrition (7 May 1999 – 21 October 2022) was a National Hunt racehorse and winner of the Cheltenham Gold Cup in 2006.\nBackground\nWar of Attrition was a brown gelding bred in Ireland by Miss B A Murphy. He was sired by Presenting out of the broodmare Una Juna and trained by Michael Mouse Morris.\nRacing career\nWar of Attrition's confirmation and pedigree suggested his potential would blossom when jumping fences over distances, emphasizing stamina. Therefore, his second at the 2004 Cheltenham Festival in the Supreme Novices' Hurdle when beaten a neck by subsequent Champion Hurdler, Brave Inca, promised a bright future lay ahead when sent chasing. That promise, along with two comfortable victories in novice chases, hallmarked by sound jumping, saw War of Attrition sent off favourite in the Arkle Challenge Trophy Chase at the 2005 festival, where he could only finish seventh, 14 lengths behind the Martin Pipe trained Contraband. A first grade-one victory soon followed at the Punchestown Festival in the Swordlestown Novices Cup Chase the following month, providing compensation for the Arkle disappointment and supplying a more accurate indication of War of Attrition's ability after reported minor setbacks latterly in his novice season.\nVictory over the previous season's Cheltenham Gold Cup winner Kicking King, on his debut in open company provided War of Attrition's Gigginstown House Stud ownership with real hope that he could reach the very peak of National Hunt racing during the 2005/06 season. A staying on second to multiple grade-one winner Beef Or Salmon, on his first start over three miles in the Lexus Chase at the Leopardstown Christmas meeting provided a good preparatory run before the testing  miles of the Cheltenham Gold Cup. Ridden prominently, the combination of good ground and racing beyond three miles for the first time saw War of Attrition travel comfortably with the generous pace during the festival showpiece. Taken to the front three fences from home by jockey, Conor O'Dwyer, Mouse Morris's stable star jumped impeccably and ran on strongly up the Cheltenham hill to win racing's most prestigious chase by  lengths from 2005 Grand National hero, Hedgehunter. War of Attrition's win gave O'Dwyer a second victory in the Gold Cup ten years after Imperial Call claimed the race and Ireland a Saint Patrick's Day first, second and third with Forget The Past completing the placings along with his compatriots. Another grade-one win followed at the Punchestown Festival in the Guinness Gold Cup for War of Attrition when making all to beat Beef Or Salmon by a comfortable  lengths, rounding off a highly successful 2005/06 season and confirming his standing as a high-class staying chaser.\nRacing on less favourable soft ground, the following season proved more difficult, yielding only one win before War of Attrition picked up a tendon injury when in the final phases of preparation for an attempt to defend his Cheltenham Gold Cup crown, keeping him off the track for nearly two years. Groundbreaking stem-cell therapy on the tendon, combined with sympathetic handling by Morris – described as \"an artist, distinct from the commercial horse trainer\", brought the brown gelding back to a good level of form once recovered. The long absence and the need for him to be raced on softer ground to aid his soundness meant War of Attrition never scaled the heights of past glories but still recorded two more victories over fences during the 2008/09 season and a never-threatening second in the grade-one Lexus Chase behind Exotic Dancer.\nThe 2009/10 season was earmarked as War of Attrition's last in racing, in which a return to hurdling was implemented in a bid to renew enthusiasm in the veteran after finishing mid-division in the Hennessy Gold Cup at Newbury. It proved another shrewd move by Morris as War of Attrition won two grade two hurdle races, the latter when beating Mourad by a head at Navan in February. A fourth run in a grade-one race at the Cheltenham Festival followed where War of Attrition enjoyed racing prominently before fading two flights from home in the World Hurdle, won for the second successive year by the top-class staying hurdler Big Buck's. One final start over the larger obstacles in the Guinness Gold Cup back at the Punchestown Festival provided a fitting end to War of Attrition's career who, on good ground and racing beyond three miles produced another stirring display under Davy Russell to finish a superb second,  lengths behind Planet of Sound with 2008 Cheltenham Gold Cup winner Denman back in fourth.\nRetirement\nImmediately after his final race, owner Michael O'Leary paid glowing tribute to War of Attrition by saying \"apart from the birth of my children, this horse has given me the best days of my life\". The grade-one, three-mile novices' hurdle run at the Punchestown Festival was named in honour of the horse in 2012. War of Attrition ran 34 times, winning 14, including three grade-one races, over £700,000 in prize money and ranks as one of Ireland's best and most consistent chasers from the first decade of the twenty-first century. He was euthanized after suffering from colic, on 21 October 2022, at the age of 23.\nReferences\nExternal links\n* [http://www.jockeycolours.com/horses/War_Of_Attrition.html Career 1-2-3 Colour Chart] – War of Attrition"
    }
  ]
}