{
  "content": [
    {
      "type": "text",
      "text": "# War and Pain\n\n| recorded     = June 19–27, 1984\n| studio       = Le Terroir Studio, Laterrière (now part of Saguenay, Québec), Canada\n| genre        = |speed metal}}\n| length       = 42:07\n| label        = Metal Blade\n| producer     = Voivod\n| prev_title   =\n| prev_year    =\n| next_title   = Rrröööaaarrr\n| next_year    = 1986\n}}\n| rev2 = ''Collector's Guide to Heavy Metal\n| rev2Score = 7/10\n| rev3 = Exclaim!\n| rev3score = (favourable)\n| rev4 = PopMatters\n| rev4score = (favourable)\n| rev5 = Rock Hard\n| rev5Score = 7.5/10\n| rev6 = Sputnikmusic\n| rev6score = 3.5/5\n| noprose = yes\n}}\nWar and Pain is the debut studio album by Canadian heavy metal band Voivod, released in September 1984.\nWar and Pain'' was reissued several times on the CD format (sometimes on different labels in other countries): the first CD issue on Metal Blade in 1987, in 1990 on Enigma Records; remastered by Metal Blade and reissued in 1994; it was also released in Roadrunner's Pricekillers series (also 1990); and again by Metal Blade in 2004 as a remastered 3-CD boxset (see the 20th Anniversary Edition section for the bonus material).\nA music video was made for the title song \"Voivod\" and was directed by Dédé Fortin.\nLegacy and influence\nThe track \"Black City\" was used by heavy metal record store, Black City Records, located in Bristol, England, as the name of their business in 2021.\nTrack listing\n\"Condemned to the Gallows\" was originally recorded for the compilation album Metal Massacre V. Aside from one \"War and Pain\" cassette pressing, \"Condemned to the Gallows\" would not appear again on any Voivod release until re-recorded in 2023 for Morgöth Tales.\n20th Anniversary Edition\nDisc two: Morgoth Invasion (Live demo, December 1984)\nBonus CD\n*In addition to videos, text, and images, the Bonus CD also contains a 46.5 MB mp3 file consisting of the first 7 tracks from a live demo recorded in January 1984, known as \"To The Death.\"\nPersonnel\n;Voivod\n*Denis \"Snake\" Bélanger – vocals\n*Denis \"Piggy\" D'Amour – guitar\n*Jean-Yves \"Blacky\" Thériault – bass\n*Michel \"Away\" Langevin – drums, artwork\n;Production\n*Voivod – producers\n*Guy Pedneault – engineer\n*Brian Slagel – executive producer\nReferences"
    }
  ]
}