{
  "content": [
    {
      "type": "text",
      "text": "# War of aggression__disambig_1\n\nre-enacting the destruction of a Polish border post]]\nA war of aggression, sometimes also war of conquest, is a military conflict waged without the justification of self-defense, usually for territorial gain and subjugation, in contrast with the concept of a just war.\nWars without international legality (i.e. not out of self-defense nor sanctioned by the United Nations Security Council) can be considered wars of aggression; however, this alone usually does not constitute the definition of a war of aggression; certain wars may be unlawful but not aggressive (a war to settle a boundary dispute where the initiator has a reasonable claim, and limited aims, is one example).\nIn the judgment of the International Military Tribunal at Nuremberg, which followed World War II, \"War is essentially an evil thing. Its consequences are not confined to the belligerent states alone, but affect the whole world. To initiate a war of aggression, therefore, is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nArticle 39 of the United Nations Charter provides that the UN Security Council shall determine the existence of any act of aggression and \"shall make recommendations, or decide what measures shall be taken in accordance with Articles 41 and 42, to maintain or restore international peace and security\".The Rome Statute of the International Criminal Court refers to the crime of aggression as one of the \"most serious crimes of concern to the international community\", and provides that the crime falls within the jurisdiction of the International Criminal Court (ICC). However, the Rome Statute stipulates that the ICC may not exercise its jurisdiction over the crime of aggression until such time as the states parties agree on a definition of the crime and set out the conditions under which it may be prosecuted. At the Kampala Review Conference on 11 June 2010, a total of 111 State Parties to the Court agreed by consensus to adopt a resolution accepting the definition of the crime and the conditions for the exercise of jurisdiction over this crime. The relevant amendments to the Statute entered into force on July 17, 2018 after being ratified by 35 States Parties.\nPossibly the first trial for waging aggressive war is that of the Sicilian king Conradin in 1268.\nDefinitions\nThe origin of the concept, the author Peter Maguire argues, emerged from the debate on Article 231 of the Treaty of Versailles of 1919: \"Germany accepts the responsibility of Germany and her allies for causing all the loss and damage to which the Allied and Associated Governments and their nationals have been subjected as a consequence of the war imposed upon them by the aggression of Germany and her allies.\" Maguire argues:\n}}\nand Nazi Germany's leader Adolf Hitler in 1940]]\nThe Japanese invasion of Manchuria had a significant negative effect on the moral strength and influence of the League of Nations. As critics had predicted, the League was powerless if a strong nation decided to pursue an aggressive policy against other countries, allowing a country such as Japan to commit blatant aggression without serious consequences. Adolf Hitler and Benito Mussolini were also aware of this, and ultimately both followed Japan's example in aggression against their neighbors: in the case of Italy, against Ethiopia (1935–1937) and Albania (1939); and Germany, against Czechoslovakia (1938–1939) and Poland (1939).\nIn November 1935, the League of Nations condemned Italy's aggression in Ethiopia and imposed economic sanctions. The prominent jurist Hans Kelsen argued that in the Ethiopian case, the League had \"at least made certain efforts to fulfill its duty in the cases of illegal aggression undertaken by member states against other member states.\"\nThe Convention for the Definition of Aggression\nTwo Conventions for the Definition of Aggression were signed in London on 3 and 4 July 1933. The first was signed by Czechoslovakia, Romania, the Soviet Union, Turkey and Yugoslavia, and came into effect on 17 February 1934, when it was ratified by all of them but Turkey. The second was signed by Afghanistan (ratified 20 October 1933), Estonia (4 December), Latvia (4 December), Persia (16 November), Poland (16 October), Romania (16 October), the Soviet Union (16 October) and Turkey, which ratified both treaties on 23 March 1934. Finland acceded to the second convention on 31 January 1934. The second convention was the first to be registered with the League of Nations Treaty Series on 29 March 1934, while the first was registered on 26 April. As Lithuania refused to sign any treaty including Poland, it signed the definition of aggression in a separate pact with the Soviet Union on 5 July 1933, also in London, and exchanged ratifications on 14 December. It was registered in the Treaty Series on 16 April 1934.\nThe signatories of both treaties were also signatories of the Kellogg–Briand Pact prohibiting aggression, and were seeking an agreed definition of the latter. Czechoslovakia, Romania and Yugoslavia were members of the Little Entente, and their signatures alarmed Bulgaria, since the definition of aggression clearly covered its support of the Internal Macedonian Revolutionary Organization. Both treaties base their definition on the \"Politis Report\" of the Committee of Security Questions made 24 March 1933 to the Conference for the Reduction and Limitation of Armaments, in answer to a proposal of the Soviet delegation. The Greek politician Nikolaos Politis was behind the inclusion of \"support for armed bands\" as a form of aggression. Ratifications for both treaties were deposited in Moscow, as the convention was primarily the work of Maxim Litvinov, the Soviet signatory. The convention defined an act of aggression as follows:\n* Declaration of war upon another State.\n* Invasion by its armed forces, with or without a declaration of war, of the territory of another State.\n* Attack by its land, naval or air forces, with or without a declaration of war, on the territory, vessels or aircraft of another State.\n* Naval blockade of the coasts or ports of another State.\n* Provision of support to armed bands formed in its territory which have invaded the territory of another State, or refusal, notwithstanding the request of the invaded State, to take, in its own territory, all the measures in its power to deprive those bands of all assistance or protection.\nThe League prerogative under that convention to expel a League member found guilty of aggression was used by the League Assembly only once, against the Soviet government itself, on December 14, 1939, following the Soviet invasion of Finland.\nPrimary documents:\n*[http://www.worldlii.org/cgi-bin/disp.pl/int/other/treaties/LNTSer/1934/75.html Text of the Convention of 3 July]\n*[http://www.worldlii.org/int/other/treaties/LNTSer/1934/102.html Text of the Convention of 4 July]\n*[http://www.worldlii.org/int/other/treaties/LNTSer/1934/95.html Text of the Convention of 5 July]\nThe Nuremberg Principles\nIn 1945, the London Charter of the International Military Tribunal defined three categories of crimes, including crimes against peace. This definition was first used by Finland to prosecute the political leadership in the war-responsibility trials in Finland. The principles were later known as the Nuremberg Principles.\nIn 1950, the Nuremberg Tribunal defined Crimes against Peace, in Principle VI, specifically Principle VI(a), submitted to the United Nations General Assembly, as:\n}}\nSee: Nuremberg Trials: \"The legal basis for the jurisdiction of the court was that defined by the Instrument of Surrender of Germany, political authority for Germany had been transferred to the Allied Control Council, which having sovereign power over Germany could choose to punish violations of international law and the laws of war. Because the court was limited to violations of the laws of war, it did not have jurisdiction over crimes that took place before the outbreak of war on September 1, 1939.\"\nFor committing this crime, the Nuremberg Tribunal sentenced a number of persons responsible for starting World War II. One consequence of this is that nations who are starting an armed conflict must now argue that they are either exercising the right of self-defense, the right of collective defense, or – it seems – the enforcement of the criminal law of jus cogens. It has made formal declaration of war uncommon after 1945.\nReading the Tribunal's final judgment in court, British alternate judge Norman Birkett said:\nAssociate Supreme Court Justice William O. Douglas charged that the Allies were guilty of \"substituting power for principle\" at Nuremberg: \"I thought at the time and still think that the Nuremberg trials were unprincipled. Law was created ex post facto to suit the passion and clamor of the time.\"\nThe United Nations Charter\nThe relevant provisions of the Charter of the United Nations mentioned in the RSICC article 5.2 were framed to include the Nuremberg Principles. The specific principle is Principle VI.a \"Crimes against peace\", which was based on the provisions of the London Charter of the International Military Tribunal that was issued in 1945 and formed the basis for the post World War II war crime trials. The Charter's provisions based on the Nuremberg Principle VI.a are:\nThe Inter-American Treaty of Reciprocal Assistance (Rio Pact)\nThe Inter-American Treaty of Reciprocal Assistance, signed in Rio de Janeiro on September 2, 1947, included a clear definition of aggression. Article 9 stated:\nIn addition to other acts which the Organ of Consultation may characterize as aggression, the following shall be considered as such:\nFurther discussions on defining aggression\nThe discussions on definition of aggression under the UN began in 1950, following the outbreak of the Korean War. As the western governments, headed by Washington, were in favor of defining the governments of North Korea and the People's Republic of China as aggressor states, the Soviet government proposed to formulate a new UN resolution defining aggression and based on the 1933 convention. As a result, on November 17, 1950, the General Assembly passed resolution 378, which referred the issue to be defined by the International Law Commission. The commission deliberated over this issue in its 1951 session and due to large disagreements among its members, decided \"that the only practical course was to aim at a general and abstract definition (of aggression)\". However, a tentative definition of aggression was adopted by the commission on June 4, 1951, which stated:\nAggression is the use of force by a State or Government against another State or Government, in any manner, whatever the weapons used and whether openly or otherwise, for any reason or for any purpose other than individual or collective self-defence or in pursuance of a decision or recommendation by a competent organ of the United Nations.\nGeneral Assembly Resolution 3314\nOn December 14, 1974, the United Nations General Assembly adopted Resolution 3314, which defined the crime of aggression. This definition is not binding as such under international law, though it may reflect customary international law.\nThis definition makes a distinction between aggression (which \"gives rise to international responsibility\") and war of aggression (which is \"a crime against international peace\"). Acts of aggression are defined as armed invasions or attacks, bombardments, blockades, armed violations of territory, permitting other states to use one's own territory to perpetrate acts of aggression and the employment of armed irregulars or mercenaries to carry out acts of aggression. A war of aggression is a series of acts committed with a sustained intent. The definition's distinction between an act of aggression and a war of aggression make it clear that not every act of aggression would constitute a crime against peace; only war of aggression does. States would nonetheless be held responsible for acts of aggression.\nThe wording of the definition has been criticised by many commentators. Its clauses on the use of armed irregulars are notably vague, as it is unclear what level of \"involvement\" would entail state responsibility. It is also highly state-centric, in that it deems states to be the only actors liable for acts of aggression. Domestic or transnational insurgent groups, such as those that took part in the Sierra Leone Civil War and the Yugoslav Wars, were key players in their respective conflicts despite being non-state parties; they would not have come within the scope of the definition.\nand Russian President Vladimir Putin were both accused of starting a war of aggression.]]\nThe Definition of Aggression also does not cover acts by international organisations. The two key military alliances at the time of the definition's adoption, NATO and the Warsaw Pact, were non-state parties and thus were outside the scope of the definition. Moreover, the definition does not deal with the responsibilities of individuals for acts of aggression. It is widely perceived as an insufficient basis on which to ground individual criminal prosecutions.\nWhile this Definition of Aggression has often been cited by opponents of conflicts such as the 1999 Kosovo War and the 2003 Iraq War, it has no binding force in international law. The doctrine of Nulla poena sine lege means that, in the absence of binding international law on the subject of aggression, no penalty exists for committing acts in contravention of the definition. It is only recently that heads of state have been indicted over acts committed in wartime, in the cases of Slobodan Milošević of Serbia and Charles Taylor of Liberia. However, both were charged with war crimes, i.e., violations of the laws of war, rather than with the broader offence of \"a crime against international peace\" as envisaged by the Definition of Aggression.\nThe definition is not binding on the Security Council. The United Nations Charter empowers the General Assembly to make recommendations to the United Nations Security Council but the Assembly may not dictate to the Council. The resolution accompanying the definition states that it is intended to provide guidance to the Security Council to aid it \"in determining, in accordance with the Charter, the existence of an act of aggression\". The Security Council may apply or disregard this guidance as it sees fit. Legal commentators argue that the Definition of Aggression has had \"no visible impact\" on the deliberations of the Security Council.\nRome Statute of the International Criminal Court\nThe Rome Statute of the International Criminal Court lists the crime of aggression as one of the most serious crimes of concern to the international community, and provides that the crime falls within the jurisdiction of the International Criminal Court (ICC). However, Article 5.2 of the Rome Statute states that \"The Court shall exercise jurisdiction over the crime of aggression once a provision is adopted in accordance with articles 121 and 123 defining the crime and setting out the conditions under which the Court shall exercise jurisdiction with respect to this crime. Such a provision shall be consistent with the relevant provisions of the Charter of the United Nations.\" The Assembly of States Parties of the ICC adopted such a definition in 2010 at the Review Conference in Kampala, Uganda.\nSee also\n*Right of conquest\n*Command responsibility\n*Crime against peace\n*Peremptory norm\n*International criminal law\n*International law\n* Invasion\n*Jus ad bellum\n*List of war crimes\n*Nuremberg principles\n*Preventive war\n*Six-day war\n*Russian invasion of Ukraine\n*United States invasion of Iraq\n*Voluntary war\n*War crime\n*War of liberation\nNotes\nReferences\nList of reference documents (alphabetical by author):\n* Lyal S. Sunga The Emerging System of International Criminal Law: Developments in Codification and Implementation, Kluwer (1997) 508 p.\n* Lyal S. Sunga Individual Responsibility in International Law for Serious Human Rights Violations, Nijhoff (1992) 252 p.\n* H. K. Thompson, Jr. and Henry Strutz, Dönitz at Nuremberg: A Reappraisal, Torrance, Calif.: 1983.\n* J. Hogan-Doran and B. van Ginkel, \"Aggression as a Crime under International Law and the Prosecution of Individuals by the Proposed International Criminal Court\" Netherlands International Law Review, Volume 43, Issue 3, December 1996, pp.&nbsp;321–351, T.M.C. Asser Press 1996.\nExternal links\n* Dinstein, Yoram. [http://www.mpepil.com/sample_article?id=/epil/entries/law-9780199231690-e236&recno=11& Aggression], Max Planck Encyclopedia of Public International Law\n*[https://web.archive.org/web/20110616100534/http://www.icc-cpi.int/iccdocs/asp_docs/Resolutions/RC-Res.6-ENG.pdf Amendments] to the Rome Statute of the International Criminal Court on the crime of aggression\n* [http://www.juragentium.org/topics/wlgo/cortona/en/pietropa.htm Stefano Pietropaoli, Defining evil. The war of aggression and international law]\n* [http://www.icc-cpi.int/NR/rdonlyres/6756D8C1-98A1-47D3-BC13-EA8D8AA860F1/282450/03092010_IHLDialogs_Chautauqua_Speech1.pdf From Nuremberg to Kampala – Reflections on the Crime of Aggression, Address by Judge Dr. jur. h. c. Hans-Peter Kaul of the ICC at the 4th International Humanitarian Law Dialogs, 2010]\n* [https://www.un.org/law/books/HistoricalReview-Aggression.pdf Historical Review of Developments relating to Aggression, 2003] (UN publication)"
    }
  ]
}