{
  "content": [
    {
      "type": "text",
      "text": "# War memorials (Eastern Somme)\n\nThe Monuments aux Morts of the Eastern Somme are French war memorials commemorating those who died in World War I on the eastern side of the Somme region.\nMonuments aux Morts of the Eastern Somme\n{| class=\"wikitable sortable\"\n|-\n! style=\"width:100px\" |Work\n! style=\"width:100px\" class=\"sortable\"|Image\n! style=\"width:100px\" |Location\n! style=\"width:650px\" class=\"unsortable\"|Subject, notes and references\n|-\n|Allonville Monument aux morts\n|\n|Allonville Somme\n|Allonville's war memorial involves the work of Athanase Fossé (1851–1923). It stands by the church and was completed on 13 August 1920. Athanase Fossé did not charge for his work but gave his services free of charge as he had been born in Allonville and is buried there. In the church of Allonville there is a relief by Fossé of Joan of Arc, shown emerging from the flames and thus delivered from death.\n|-\n|Amiens Monument aux morts\n|\n|Amiens  Somme\n|Amiens has three war memorials,  all by Albert-Dominique Roze.  One is in Amiens Cathedral. This was completed in 1923 and inaugurated on 6 April 1924. In Roze's composition a dead soldier lies in the centre of the relief and on his right are his wife and child and on the left his father and mother. All appear in tears but the Virgin Mary stands above the soldier's body with arms spread as though consoling them all.  The main Roze work is Amiens's war memorial and as one would expect the war memorial for the capital of Picardy is of huge proportions.  It stands in the Place du Maréchal Foch and  remembers not only the 2,666 Amienois who died in the Great War but also the fact that Amiens was a garrison town and that troops left there for the front.  Work on the monument was started in 1927 and the inauguration took place on 14 April 1929. On the eastern side two foot soldiers hold hands. One is young the other older and thus represent the two generations involved in the war and underlines the brotherhood felt on the front line.  On the southern side, a cavalryman and an aviator are featured with propeller and bomb. On the eastern side an engineer with rope and hammer and a tank driver complete with caterpillar track and conning tower are featured and on the northern side are seen an artilleryman with cannon and shell and a marine. At the top a figure representing \"Victory\" holds a pen and writes the names of the dead on the bough of a tree. The funds for this monument were raised by public subscription and by organising tombolas, concerts and galas.  Jules Derivery and Denis Sosthene carried out the marble work involved. Originally the plan was for a monument to commemorate both allies and those citizens of Amiens who died in the Great War. It was to be called the \"panthéon interallie\" and it was planned to place it at the exit from Amiens that leads to Albert and the battlefield of the Somme.  However this idea was abandoned in favour of a monument just remembering those from Amiens who died. The third monument in Amiens stands in the National Military Cemetery at Saint-Acheul and It was inaugurated on 27 July 1924, commissioned by \"Le Souvenir Français\" which had since its foundation in 1887, worked to commemorate those soldiers who died on the field of battle. Several photographs of Amiens' main monument aux morts are shown in the gallery below.\n|-\n|Andechy Monument aux morts\n|\n|Andechy  Somme\n|At Andechy the war memorial is a sculpture by Georges Legrand. This was another village on the frontline and was completely destroyed during World War I The Battle of Andechy took place on the 4 and 5 November 1914.\n|-\n|Arvillers Monument aux morts\n|\n|Arvillers Somme\n|Arvillers' memorial is an example of \"Le Soldat au drapeau\", which was number 2139 in Marbreries Générales Gourdon's catalogue. The work at Arvillers was dated 1923. The choice of statue was made by the ex-soldiers of the town. This Marbreries Générales Gourdon work can be seen on monuments throughout France.\n|-\n|Barleux Monument aux morts\n|\n|Barleux Somme\n|The memorial at Barleux features an allegory of the French Republic holding a flag and a crown of laurel. This is the work of the sculptor Armanet from Porcieu-Amblagnieu in Rhône-Alpes.\n|-\n|Bouchavesnes-Bergen Monument aux morts\n|\n|Bouchavesnes-Bergen   Somme\n|The war memorial involves the work of Michelet Firmin-Marcelin (1875–1951) and dates from 1926. There is also a statue of Maréchal Foch in Bouchavesnes-Bergen.  The reconstruction of the village and the statue of Maréchal Foch as well as the war memorial, were financed by way of gifts from a Norwegian. The local authorities voted to erect a monument on 7 August 1925. On 4 July 1926 on the tenth anniversary of the Battle of the Somme the monument was inaugurated in the presence of the sculptor, Maréchal Foch and Senator Klotz.  In 1996 the monument collapsed and was replaced by a granite stele.\n|-\n|Bouchoir Monument aux morts\n|\n|Bouchoir  Somme\n|At Bouchoir the war memorial features an allegory of a woman holding a dying soldier in her arms and placing a crown of laurel on his head. It is the work of Victor Lefranc Robillard of Montdidier and dates from 1926.  On 2 March 1926 the local authority decided to complete the war memorial offered to Bouchoir by a Franco- American committee and a contract was signed with Victor Lefranc Robillard to add a sculptured group. The \"''Commission d'examen des monuments de la Somme\" were critical of the sculpture saying that its proportions were at variance with the monument itself and the sculpture itself stands apart from the main monument.\n|-\n|Bougainville Monument aux morts\n|\n|Bougainville  Somme\n|At Bougainville is another work by Albert-Dominique Roze, this entitled \"The defence of the flag\".  It features two soldiers defending the French flag, one holds a rifle and the other the flag.  The monument was inaugurated on 25 September 1921 and was funded by a gift from the mother of a young Bougainville man killed in the war.  Roze, it seems, was a friend of the family. The work is dated 1921.  Roze has returned to his theme of \"Brothers in Arms\".\n|-\n|Bray-sur-Somme Monument aux morts\n|\n|Bray-sur-Somme Somme\n|This war memorial features work by the Albert-based marbrier Boindin Lechien.  It was inaugurated on 5 October 1924. The monument carries the names of several World War I battles. The central feature is a soldier, on foot, and holding the flag. Boindin also worked on the war memorial at Dernacourt.\n|-\n|Chaulnes Monument aux morts\n|\n|Chaulnes  Somme\n|The war memorial at Chaulnes was completed by Jules Déchin in 1920.  It involves a combination of \"La France victorieuse\" and \"Le Poilu morant''\" both heavily marketed in France by Société Antoine Durenne but normally as separate pieces. There are incidentally several instances where Jules Déchin's \"Le Poulu mourant\" is paired with Benet's \"Poilu victorieux\". Benet was another sculptor with whom Société Antoine Durenne worked extensively.  Inauguration of the Chaulnes monument took place on 3 August 1924.\n|-\n|Corbie Monument aux morts\n|\n|Corbie   Somme\n|At Corbie the war memorial was the work of Albert-Dominique Roze and dates from 1923. A mother is shown telling a young child of the sacrifice made by his father and others. She holds in her hand the names of those who had died, inscribed on a scroll. A committee was formed on 25 October 1923 and subsequently received a contribution raised by the community of 37,000 francs. The Corbie monument features a curved wall at the rear of the statue on which are carved the names of the dead. The monument is similar to that at Cayeux-sur-Mer.\n|-\n|Davenscourt Monument aux morts\n|\n|Davenscourt  Somme\n|The Davenescourt war memorial stands in the Place de la Mairie and is an Albert-Dominique Roze work dating from 1928.  It features a standing and older soldier perhaps a reservist. This village lost 30 inhabitants out of 653.  The soldier holds his helmet and has in front of him a list of the dead.\n|-\n|Doullens Monument aux morts\n|\n|Doullens  Somme\n|The Doullens memorial dates from 1925 and involves sculptural work by Louis Voclin and Attenni. Marcel Gogois was the architect and the monument was carved from Euville stone. The marble pedestal was carved by Attenni and inauguration took place on 11 October 1925.\n|-\n|Etalon Monument aux morts\n|\n|Etalon  Somme\n|Etalon's so-called \"La croix de bois\" relief, a work by Valentin-Charles Molliens is the main feature of the war memorial which stands near to the village church. A maquette of this work was shown at the exhibition of the Société des Amis des Arts du département de la Somme in April 1929 under the number 249.  This relief shows a cross with the helmet of a dead soldier perched on the top. It stands in a field of corn with corn-poppies growing around.\n|-\n|Fouilloy Monument aux morts\n|\n|Fouilly  Somme\n|At Fouilly one can see a war memorial by Établissements H.Jacomet of Villedieu in the Vaucluse, this another of the foundries who supplied pieces for memorials in the Somme and elsewhere. Établissements H.Jacomet's main products were the pieces « Arc de Triomphe » and « Poilu », the piece « Poilu baionnette au canon », and the piece « Victoire ». These were all works by Etienne Camus the Toulouse sculptor. « Poilu » can be seen in many villages in the Somme region (Estrées-Deniécourt, Grouches-Luchuel, Le Boisle, Maison-Ponthieu, etc.).\n|-\n|Framerville-Rainecourt Monument aux morts\n|\n|Framerville-Rainecourt\n|At Framerville-Rainecourt is a war made by Jules Déchin (1869–1947). The sculpture features a soldier with rifle, leaning against a post which carries the inscription \"Framerville\". This work dates from 1925 and is situated by the old cemetery just by the church. The pedestal also carries an inscription acknowledging the soldiers of the British and Australian Armies who died in this area. The monument was inaugurated on 26 September 1926.\n|-\n|Guerbigny Monument aux morts\n|\n|Guerbigny   Somme\n|At Guerbigny the war memorial is a Leyritz/Durenne \"Soldat Vainqueur\" and dates from 1922 . It stands in the Place de l'Eglise. The community lost 16 inhabitants out of a total population of 482 and on 6 January 1920 the local council voted 1,000 francs to cover the erection of a war memorial. The builders Massin Fils et Boulogne of Roye erected the monument and the Leynitz statue on the top cost 6,700 francs. Of this 6,700 francs, 2,500 francs were voted by the council and 4,200 francs was raised by subscription. Leyritz's statue can be seen elsewhere in France- Le Fau-de-Peyre in Lozère, Mareuil-sur-Arnon in Cher, Saint-Denis-en-Margeride in Lozère, and at Saint-Leger-sous-Brienne in the Aube.\n|-\n|Gueudecourt Monument aux morts\n|\n|Gueudecourt  Somme\n|In the commune of Gueudecourt there is Jules Déchin's \"Armistice\". Déchin worked with the marbrier Louis Polard. The monument was erected in October 1928 and the cost was 10,500 francs of which 8,000 were given by the town of Monaco who had \"adopted\" Gueudecourt. The war memorial was inaugurated in April 1929. In the work \"Armistice\", the soldier holds his right arm forward and at his feet is a milestone indicating \"Compiègne and Rethondes.  It was there that the armistice was signed and it is to that point that the poilu is reaching out.\n|-\n|Guillaucourt Monument aux morts\n|\n|Guillaucourt Somme\n|Guillaucourt's war memorial dates from 1922 and was erected by Teisseire, a Vichy builder under the direction of the architect Paul Martin. The sculptural work was by Auguste Carvin. The monument cost 11,481 francs, of which only 600 francs came from the local council, with almost 11,000 francs being raised by public subscription. Inauguration took place on 22 October 1922. The central figure is a veiled widow, her head bowed, placing some laurel on the helmet of a deceased soldier.\n|-\n|Hangest-en-Santerre Monument aux morts\n|\n|Hangest-en-Santerre Somme\n| The Hangest-en-Santerre war memorial dates from 1923. The decision to erect a war memorial had been taken on 13 July 1923 and a contract was made with Georges Legrand to carry out the sculptural work involved.  Legrand's wife was a native of the village.\n|-\n|Harbonnières Monument aux morts\n|\n|Harbonnières  Somme\n|Harbonnières' war memorial features the work of Georges Roty.  The monument cost 19,000 francs, of which 16,000 francs was raised by public subscription.  Inauguration took place on 29 October 1922. There is no record of Georges Roty having worked on any other war memorial either in Picardy or other parts of France although he was one of the sculptors taking part in the competition organised to select a war memorial at Montdidier.  It is a composition with a woman crying over the helmet of a dead soldier.  She holds both palm and laurel.\n|-\n|La Faloise Monument aux morts\n|\n|La Faloise  Somme\n|La Faloise's memorial features an original sculptural composition by Henri Louis Leclabart.  It depicts an old man, a farmer and perhaps a father, taking time off from his work to look at a grave of a dead soldier. He holds a long narrow spade. The monument dates from 1923.\n|-\n|Le Quesnel Monument aux morts\n|\n|Le Quesnel  Somme\n|At Le Quesnel the monument features the figure of a soldier. It is at Le Quesnel on the road from Amiens to Roye. It shows the Canadian Army during the Battle of Amiens from 8 to 11 August 1918. The Germans had suddenly attacked the British Armies on the Western Front and by 5 April they had been beaten back to a position just in front of Amiens but the Germans were halted there by a brigade of Canadian Cavalry who at the time were fighting as both a cavalry unit and infantry.\n|-\n|Mailly-Maillet Monument aux morts\n|\n|Mailly-Maillet  Somme\n|The Mailly-Maillet war memorial was the work of the Albert marbrier Dessein-Houriez and dates from 1922. It is an allegory representing France holding a sword and a wreath and crushing a German eagle. The inauguration took place on 30 July 1922.\n|-\n|Marcelcave Monument aux morts\n|\n|Marcelcave  Somme\n|Here the war memorial features a sculpture by Louis Henri Leclabart which dates from 1925. Part of the cost of the monument was a gift from the commune of Canteleu, who had \"adopted\" Marcelcave during the war. It was often the case that villages not near to the front-line would adopt villages who were and give them financial and moral support. In Leclabart's work a wounded soldier is defended by his brother in arms.\n|-\n|Miraumont Monument aux morts\n|\n|Miraumont  Somme\n|The war memorial at Miraumont has an almost identical sculpture to that at Thézy-Glimont but this was supplied by Gaudier-Rembaux. The sculpture features a child holding a laurel branch towards the Croix de Guerre.  As already mentioned, Molliens’ studio was at Longpré-les-Amiens and in the church there, the Church of St.Lèger, there is a parish war memorial which was a collaboration between the marbrier Marcel Sueur and Molliens.  Molliens’ work here is a medallion, the work dating from 1909.\n|-\n|Montauban-de-Picardie Monument aux morts\n|\n|Montauban-de-Picardie. Somme\n| This village's war memorial features the same composition as that seen on the war memorial at Guillaucourt.\n|-\n|Montdidier Monument aux morts\n|\n|Montdidier   Somme\n|The pyramid shaped war memorial of Montdidier was completed in 1923 and is to be found in the Place de la République.  A committee charged with constructing the war memorial was created in November 1920 and in October 1922 this committee organised a competition open to architects, artists and sculptors. The first prize went to the parisienne architects Andre Japy and Alfred Tord. The statues represent the two generations involved in the war and were the work of Albert-Dominique Roze.\n|-\n|Morchain Monument aux morts\n|\n|Morchain    Somme\n|The village of Morchain has another important work by Georges Legrand.\n|-\n|Moreuil Monument aux morts\n|\n|Moreuil   Somme\n|At Moreuil the war memorial is a work in marble by Albert-Dominique Roze. A soldier is seen in the act of throwing a grenade. The monument commemorates in particular the release of Moreuil from German occupation on 8 August 1918. It was inaugurated on 12 October 1924 by General Charles Nollet, the Minister of War.  At the back of the monument is a medallion commemorating the soldiers of the 1870 war.\n|-\n|Morisel Monument aux morts\n|\n|Morisel   Somme\n|At Morisel the village's war memorial stands in the Place de l'Église and features Charles-Henri Pourquet's \"Résistance\".  Made in a series, it represents the Verdun sentiment \"Ils ne passeront pas\". The same piece can be found at Dompierre-sur Authie.\n|-\n|Nesle Monuments aux morts\n|\n|Nesle    Somme\n|Nesle's war memorial was the work of the sculptor Emile Ancellin (1880–1941) who was born and lived in Nesle. The monument dates from 1922.\n|-\n|Péronne Monument aux morts\n|\n|Péronne    Somme\n|It was Paul Auban who sculpted this war memorial- \"Picarde maudissant la guerre\" situated in the rue Beranger. In this piece a woman leans over a dead body and shakes her fist towards the unseen enemy. There are also bas-reliefs signed by Paul Theunissen and the monument was completed in 1926. It was inaugurated on 20 June 1926.  Auban was also one of the sculptors who worked on the victory Fontaine Sube at Reims. The other sculptors were Louis Baralis, Joseph Wary and Paul Gasq. Theunissen's two reliefs show a scene from the trenches in 1916 and a scene from Charles Quint's unsuccessful siege of 1536. Catherine of Poix, also known as \"Marie Fouré\" led the defence of the town and was said to have thrown a Spaniard off the top of the wall.\n|-\n|Pierrepont-sur-Avre Monument aux morts\n|\n|Pierrepont-sur-Avre  Somme\n|The war memorial stands in front of the church and the work was given the name \"statuaire de la douleur\" when first shown in the revue L’Art funeraire et commemorative. It is a sculptural composition by Charles-Henri Pourquet and was completed in 1926. This village lost 14 of her 465 inhabitants in the Great War. Pourquet was paid 13,500 francs for his work. The monument is worked in Savonnieres stone. The soldier in the high relief composition is draped in the National Flag and in the second, in low relief, there are crosses from the military cemetery and in the background an allegory of the Nation holding in extended arms two crowns of laurel. The addition of numerous crosses seems to underline the number of deaths being commemorated and is highly effective.\n|-\n|Poix-de-Picardie Monument aux morts\n|\n|Poix-de-Picardie Somme\n|The war memorial in this village dates from 1920 and was the work of the builders Galland and Grujon and the architect Dupont. It was Valentin-Charles Molliens who sculpted the relief at a cost of 2,000 francs. The relief shows a young man embracing the flag with a crown of laurel in front of him. Poix-de-Picardie lies at the junction of the N1 and N29, 20 miles south west of Amiens and has a 16th-century church.\n|-\n|Proyart Monument aux morts\n|\n|Proyart.  Somme\n|This is the most expensive war memorial erected in the Somme region. It was from the Marbreries Générales Gourdon range and cost 320,000 francs. It was the most expensive item in Gourdon's catalogue. It consists of an \"arc de triomphe\" and under that arch stands a soldier carved from white marble. On the sides of the arch are some splendid reliefs.\nThe monument was erected in 1924 and the land involved was the gift of Mr.and Mrs Normand who also put up most of the funds involved in erecting the monument. Mr. Normand was a wine merchant in the Champagne area. The Normands had lost their only son, killed in combat in the Great War and the monument stands in the grounds of the local chateau owned by the Normand family. Another contributor to the cost of this monument was the town of Cognac who had \"adopted\" Proyart during the war. The monument was inaugurated on 28 September 1924 by General de Castelnau who had commanded the French army in the Somme from September 1914 to August 1915.  On the sides of the arch are three bas-reliefs: \"Le Départ\", \"L’assaut à Proyart\", and \"La France reconnaissante à Proyart.\"\nThe relief \"L’assaut à Proyart\" shows eight soldiers advancing towards the enemy lines including one with field glasses, another on look-out and a third with a periscope. In the distance another group of soldiers are in the same trench. The relief shows trees which had been destroyed and the barbed wire of no man's land. The relief \"Le Départ\" portrays a soldier saying goodbye to his family; his wife, his child, his mother, all in front of the family home. In the rear there is a village and its church.  The relief \"La France reconnaissante\" is an allegory of a victorious France wearing a phrygien bonnet and a crown of laurel and embracing a soldier holding the national flag. A battalion of soldiers is shown marching by and there is the Arc de Triomphe in Paris encircled by torches of fire. The central figure of the soldier is carved from marble and the rifle is made from cast iron. The soldier's foot rests on a German helmet (the point at the top of the helmet is no longer there).\n|-\n|Rosières-en-Santerre Monument aux morts\n|\n|Rosières-en-Santerre  Somme\n|The sculptor, Auguste Carvin, was chosen to carrying out the sculptural work on the Rosières-en-Santerre memorial. The monument was inaugurated on 1 November 1922. The central figure of the monument is a poilu (\"poilu debout dit le sacrifice\") standing on a pedestal, his face looking upwards, his hand on his chest and two bas-reliefs below show the mother and wife of a dead soldier kneeling before his grave; the mother holds a bouquet of roses. On the other side of the central pedestal are a further two bas-reliefs.  One of these reliefs features the tomb of a soldier. In the background are a village and can make out the bell-tower. On the right a sower turns towards the tomb as though in hommage- he is perhaps sowing the seeds of the future.\n|-\n|Roye Monument aux morts\n|\n|Roye  Somme\n|The memorial stands in the Place des Combattants in the centre of the town. Carved in stone from Romaneche in Ain this is a work by Jules Déchin and the entrepreneur Petit, and was based on a project by the Grand Prix de Rome winning architect Rubin. This composition juxtaposes allegories of war and peace. On one side of the monument is an allegory of the town of Roye, crowned and holding a palm on which is hooked the Croix de Guerre with the helmet of a soldier placed on a broken cross at its feet and on the other is a representation of the bombardment of Roye and the sufferings of the war- a woman and her child sit and the child is clearly disturbed and in the background is the ruins of the town with what is left of the church of Saint-Pierre. The monument cost 80,000 francs and was inaugurated on 21 July 1927 by Édouard Herriot.\n|-\n|Rubempré Monument aux morts\n|\n|Rubempré  Somme\n|In the commune of Rubempré there are two examples of the work of Pierre Ansart; that in the church and the public war memorial.  In both cases Ansart worked with Marcel Sueur, the Amiens Marbrier. The war memorial in the parish church is a most interesting one and in the church there is also a second commemoration of the 1914–1918 war, this being a painting by the then curate.  The parish church monument lies against the wall south of the nave under the crucifix. Apart from a list of the men remembered, a dead soldier in relief is etched on a panel. It is a stylised representation with large contours and painted in red. A smaller plaque has been added to remember the dead of the 1939–1945 conflict.  The dead soldier lies flat his hands crossed in prayer with the inscription \"in gloria, in pace\" and then the coat of arms of Rubempré. The Ansart/Sueur public war memorial in the rue Richard Vilbert is a sculpture and mosaic with a Croix de Guerre and a helmet. This dates from 1920.\n|-\n|Saint-Leger-les-Domart Monument aux morts\n|\n|Saint-Leger-les-Domart  Somme\n|At Saint-Leger-les-Domart the war memorial stands in the rue Anatole Jovelet.  A poilu stands with arms crossed and unarmed,. It is the work of the founder Alexis Rudier and the marbrier Jules Bouldoduc of Wimereux. The pedestal is made from Lune stone. The statue was inaugurated on 6 November 1921. There are few statues in France featuring such a soldier and there are those who interpret the pose as that of resistance whilst others have suggested pacifism.\n|-\n|Sauvillers-Mongival Monument aux morts\n|\n|Sauvillers-Mongival  Somme\n|Here the war memorial features a work by Marius Giot (1897–1980).  The monument dates from 1935 and features a machine-gunner. The late date here is explained by Sauvillers-Mongival being almost totally destroyed during the 1914–1918 war, with only three buildings surviving. A major reconstruction was therefore necessary after 1918.\n|-\n|Soyécourt Monument aux morts\n|\n|Soyécourt  Somme\n|At the village of Soyécourt there is an example of the work in marble entitled \"Histoire écrivant\" which was marketed by the marbriers Établissements Rombaux-Roland and can be seen throughout France. This monument was erected in 1925; the municipal council had decided on a monument on 8 December 1924 and Établissements Rombaux-Roland executed it in August 1925 for 17,675 francs. A major contribution to the cost was made by the town of Châtellerault who had \"adopted\" Soyécourt.  Établissements Rombaux-Roland of Jeumont were a major foundry and marketed an extensive range of statues through a comprehensive catalogue. They were one of the foundries who did not to identify the sculptors with whom they were involved. Their range included:-\n*\"Au mépris du danger\"\n*\"Coq (sur demi-sphere laurée)\"\n*\"Coq (sur sphere)\"\n*\"Coq (sur terrasse)\"\n*\"Coq sur casque lauré\"\n*\"France au drapeau No.999\"\n*\"Histoire écrivant\"\n*\"Poilu\"\n*\"Poilu aux lauriers\"\n*\"Stele a la deuillante\".\nThere are examples of Établissements Rombaux-Roland editions at Marquaix, Domart-Becquincourt, Roisel and Soyécourt.  At Marquaix, which lies on the D6 running east from Peronne, there is an example of \"France au drapeau No.999\". Inauguration took place on 28 August 1927 and the cost of the monument was 9,750 francs. At Domart-Becquincourt, a commune 30 miles east of Amiens, is an example of \"Au mépris du danger \".  The total cost was 10,500francs.  This work also appears throughout France either in bronze or marble.\n|-\n|Thézy-Glimont Monument aux morts\n|\n|Thézy-Glimont Somme\n|The war memorial at Thézy-Glimont features a carving by Valentin-Charles Molliens (1868–1937). The village also has a statue to Mosel Eloi (1735–1809) who invented a special tool used for lifting peat/turf.\n|-\n|Vignacourt Monument aux morts\n|\n|Vignacourt   Somme\n|Vignacourt's monument aux mort stands in the cemetery and is another work by Albert-Dominique Roze who explores there theme of the widow holding her child. The memorial cost 22,000 francs and was inaugurated on 7 August 1921. In the same cemetery another monument by Roze and standing in the British section of the cemetery remembers those allied soldiers buried there. The monument in the British cemetery was erected by the village in honour of the Commonwealth dead and is a statue of a French soldier, on the base of which are engraved the words: \"''Frères D'armes de L'Armèe Britannique, tombes au Champ D'Honneur, dormez en paix. Nous veillons sur vous.\" (\"Brothers in arms of the British Army, fallen on the field of honour, sleep in peace; we are watching over you''.\"). The cemetery was designed by Sir Reginald Blomfield\n|-\n|Villers-Bretonneux Monument aux morts\n|\n|Villers-Bretonneux  Somme\n|The area around this village saw much fighting between April and August 1918, being strategically placed in relation to the German Army's access to Amiens. Villers-Bretonneux had seen a clash on 27 November 1870 between the French and Prussian armies.  The war memorial of Villers-Bretonneux features a statue of a woman symbolising grief. The woman is veiled, is in tears and holds a crown of laurel. The sculpture dates from 1928 and is attributed to Mariene Hérant-Bender and at the back of the monument there is a cartouche by the sculptor André Del Debbio.  The village had first expressed its wish to have a war memorial in 1920 but it was not possible to erect the monument until 1928, as the village had been almost totally destroyed during the war. There is a plaque at the foot of the Villers-Bretonneux war memorial which remembers the role played by the Australians in liberating the village. Just outside the village is the Villers-Bretonneux Memorial, an Australian National Memorial erected to commemorate all Australian soldiers who fought and died in France and Belgium during the First World War especially those whose graves are not known.\n|}\nGallery\nImage:The figure of Victory at the top of Amiens' mon ument aux morts.JPG|The figure of Victory at the top of the Amiens war memorial\nImage:Amiens monument aux morts 1.JPG|Detail from the Amiens war memorial\nImage:Amiens monument aux morts 2.JPG|Detail from the Amiens war memorial\nImage:Amiens monument aux morts 3.JPG|Detail from the Amiens war memorial\nImage:Amiens monument aux morts 4.JPG|Detail from the Amiens war memorial\nImage:Amiens monument aux morts 5.JPG|Detail from the Amiens war memorial\nImage:Amiens monument aux morts 6.JPG|Detail from the Amiens war memorial\nImage:Amiens monument aux morts 7.JPG|Detail from the Amiens war memorial\nImage:Chaulnes 6.JPG|The figure Le Poilu morant- part of the Chaulnes war memorial\nImage:Nesle 3.JPG|Close-up of soldier on the Nesle war memorial.\nImage:Peronne relief 1536.JPG|The 1536 siege of Péronne\nImage:Peronne relief 1916.JPG|Scene from the trenches in 1916\nImage:Pierrepont 1.JPG|Detail from the war memorial at Pierrepont-sur-Avre\nImage:Pierrepont 99.JPG|Detail from the war memorial at Pierrepont-sur-Avre\nImage:Proyart 300.JPG|The relief Le Départ\nImage:Proyart 2.JPG|The relief L’assaut à Proyart\nImage:Proyart 1.JPG|Pillar at the entrance to the war memorial showing French Army helmet on flag positioned above the Croix-de-Guerre.\nImage:Proyart 78.JPG|Detail of the work above the central arch of the Proyart war memorial\nImage:Proyart 77.JPG|The soldier at the centre of the war memorial at Proyart.\nImage:Proyart 120.JPG|The relief on the war memorial at Proyart above the allegory of France greeting a soldier- Soldiers marching by.\nImage:Proyart 101.JPG|The relief showing an allegory of France greeting a victorious soldier-La France reconnaissante à Proyart.\nImage:Proyart 4.JPG|Plaque mentioning Mr. Mrs Francois Normand who funded the monument and had lost their only son in the Great War\nImage:Villers-Bretonneux 2.JPG|The plaque at Villers-Bretonneux remembering the role played by the Australian Imperial Force in liberating the village\nSee also\n*World War I memorials\n*War memorials (Aisne)\n*War memorials (Oise)\n*War memorials (Western Somme)\nReferences\nExternal links\n* [http://sites-of-memory.de/main/index.html Sites of Memory] (Historical markers, memorials, monuments, and cemeteries worldwide)\n* [http://yourarchives.nationalarchives.gov.uk/index.php?title=Memorial_at_Dormans_to_both_First_and_Second_Battles_of_the_Marne A National Archives article giving further information on the memorial at Dormans which is dedicated to the First and Second Battles of the Marne]\n* [http://yourarchives.nationalarchives.gov.uk/index.php?title=The_Australian_Memorial_at_Villers-Bretonneux A further National Archives article dealing with the Villers-Bretonneux Australian Memorial]\n* [http://www.memorial-genweb.org/~memorial2/ FranceGenWeb]-Source of information on monument aux morts"
    }
  ]
}