{
  "content": [
    {
      "type": "text",
      "text": "# War and Remembrance (miniseries)\n\n| director           = Dan Curtis\n| starring           =\n| narrated           = William Woodson\n| composer           = Bob Cobert\n| country            = United States\n| language           = English\n| num_episodes       = 12\n| executive_producer = Dan Curtis\n| producer           = Barbara Steele\n| editor             = John F. Burnett  Peter Zinner\n| location           = United StatesYugoslaviaPolandItalyWest GermanyFranceAustriaSwitzerlandEnglandCanada\n| cinematography     = Dietrich Lohmann\n| camera             =\n| runtime            = 1620 minutes\n| company            =\n| channel            = ABC\n| first_aired        =\n| last_aired         =\n| related            =\n}}\nWar and Remembrance is an American miniseries based on the 1978 novel of the same name written by Herman Wouk. The miniseries, which aired from November 13, 1988, to May 14, 1989, covers the period of World War II from the American entry into World War II immediately after Pearl Harbor in December 1941 to the day after the bombing of the Japanese city of Hiroshima. It is the sequel to the 1983 miniseries The Winds of War, which was also based on one of Wouk's novels.\nPlot\nThe television mini-series continues the story of the extended Henry family and the Jastrow family starting on December 15, 1941 and ending on August 7, 1945 and their life experiences during World War II.\nCast\nStarring\n* Robert Mitchum as Capt. Victor \"Pug\" Henry\n* Jane Seymour as Natalie Henry\n* Hart Bochner as Byron Henry\n* Victoria Tennant as Pamela Tudsbury\n* Polly Bergen as Rhoda Henry\n* David Dukes as Leslie Slote (  1–9)\n* Michael Woods as Warren Henry (  1–3)\n* Sharon Stone as Janice Henry (  1–8)\n* Robert Morley as Alistair Tudsbury (  1–5)\n* Barry Bostwick as Carter \"Lady\" Aster (  1–8)\n* Sami Frey as Avram Rabinovitz\n* Topol as Berel Jastrow (  1–11)\n* John Rhys-Davies as Sammy Mutterperl (  1–7)\n* Ian McShane as Philip Rule (  1–8)\n* William Schallert as Harry Hopkins\n* Bill Wallis as Werner Beck (  1–7)\n* Jeremy Kemp as Brig. Gen. Armin von Roon\n* Steven Berkoff as Adolf Hitler\n* E. G. Marshall as Dwight D. Eisenhower (  9 & 11)\n* Robert Hardy as Winston Churchill\n* Ralph Bellamy as Franklin D. Roosevelt (  1–11)\n* John Gielgud as Aaron Jastrow (  1–11)\nGuest starring\n* G. W. Bailey as Commander Jim Grigg\n* J. Kenneth Campbell as Commander Hoban\n* John Dehner as Admiral Ernest King\n* Peter Graves as Palmer Kirby\n*  as SS Lt. Colonel Rudolf Höss\n* Leslie Hope as Madeline Henry\n* Barry Morse as Col. Gen. Franz Halder\n* William R. Moses as Lt. Cdr. Simon Anderson\n* Howard Duff as William Tuttle\n* Pat Hingle as Admiral William \"Bull\" Halsey\n* Milton Johns as SS Lt. Colonel Adolf Eichmann\n*  as Selma Ascher\n* G. D. Spradlin as Admiral Raymond A. Spruance\n* Jack Ging as Commander William Buracker\n* Michael McGuire as Captain Miles Browning\n* Eddie Albert as Breckinridge Long\n* Brian Blessed as General Yevlenko\n* Mike Connors as Col. Harrison \"Hack\" Peters\n* Sky du Mont as Claus Schenk Graf von Stauffenberg\n* Nina Foch as Comtesse de Chambrun\n* Kenneth Colley as SS Colonel Paul Blobel\n* Hardy Krüger as Field Marshal Erwin Rommel\n* William Prince as Admiral Chester W. Nimitz\n* Eli Danker as Udam\n* Robert Stephens as SS Major Karl Rahm\n* Richard Dysart as Harry S. Truman\n;Co-starring\n* R. G. Armstrong as General \"Moose\" Fitzgerald\n* Ian Abercrombie as Vice Admiral Rodney\n* John Barrard as Oskar Friedman\n* Anthony Bate as Field Marshal Gerd von Rundstedt\n* William Berger as Consul General Jim Gaither\n* Norman Burton as General George Marshall\n* Eric Christmas as Admiral Sir Dudley Pound\n* Matt Clark as Chief Clark\n* Georges Corraface as Pascal Gaffori\n* Carl Duering as Dr. Karl Goerdeler\n* Lawrence Dobkin as General George S. Patton\n* Vernon Dobtcheff as Henri Bulle\n* Paul Glawion as Gen. Friedrich Paulus\n* Joachim Hansen as Alfred Jodl\n* Earl Hindman as Lt. Commander C. Wade McClusky\n* Elizabeth Hoffman as First Lady Eleanor Roosevelt\n* Ian Jentle as Joseph Goebbels\n* Wolf Kahler as SS Major Anton Burger\n* Charles Lane as Admiral William Standley\n* Michael Madsen as Lt. 'Foof' Turhall\n* Christopher Malcolm as Bunky Thurston\n* John Malcolm as Field Marshal Wilhelm Keitel\n* Aubrey Morris as Father Martin\n* George Murdock as General Leslie Groves\n* Charles Napier as Lt. General Walter Bedell Smith\n* Dennis Patrick as Admiral Mahlon Tisdale\n* Wolfgang Preiss as Field Marshal Walter von Brauchitsch\n* Wolfgang Reichmann as Martin Bormann\n* Clifford Rose as SS Lt. General Heinz Kammler\n* Michael Sarne as SS Captain Schwarz\n* Barbara Steele as Elsa MacMahon\n* Peter Vaughan as General Kurt Zeitzler\n*  as Heinrich Himmler\n* Mills Watson as Chief Derringer\n* Geoffrey Whitehead as Albert Speer\n* Michael Wolf as Hermann Goering\n* Robert S. Woods as Lt. Cmdr. Eugene Lindsey (Enterprise)\nProduction\nDevelopment\nWar and Remembrance had a multi-year production timeline. It was, at the time, the most expensive single project in the history of filmed entertainment and the most expensive single-story undertaking in United States television history. Costing $135 million according to Brandon Stoddard in his Television Academy Foundation interview, it took over ABC's broadcast schedule for two one-week periods in 1988 and 1989, totaling 30 prime-time hours.\nUp to that point, television had been dominated by the Big Three broadcasting networks in the United States, ABC, NBC and CBS. Shortly afterwards, cable television began the fragmentation of the United States broadcasting audience in earnest, leaving War and Remembrance the last of the giant miniseries. Miniseries had been major events on American television and ABC had produced some of the most seminal, under its ABC Novels for Television banner, including QB VII, Rich Man, Poor Man, Roots, Roots: The Next Generations, and Masada.\nBecause Herman Wouk was happy with Dan Curtis's 1983 ABC Novel for Television adaptation of The Winds of War, Wouk allowed Curtis to adapt the sequel novel as well. Curtis turned the project down at first, however. He feared it would be impossible to accomplish, even with virtually unlimited resources. Curtis worried that the massive naval battles could not be recreated, because so few WWII-era ships and planes still existed. More importantly, Curtis, who was Jewish, wondered how to do justice to the reality of the Holocaust, saying \"to put on film the true horror was impossible. Once one false note sneaks in, you're gone. And, in my own eyes, I felt failing would be an absolute crime.\" Curtis credited his wife Norma with convincing him to take on the mammoth job, recounting that she told him \"You'll kill yourself if someone else finishes this story.\"\nParamount Television had produced The Winds of War at a cost of $40 million, $32 million of which was covered by ABC's licensing fee. However, Paramount decided not to produce the sequel and sold the rights to ABC, which produced the massive miniseries itself. ABC first planned a $65 million, 20-hour series, but when they went to Curtis, he said he wanted to make a $100 million, 30-hour series, which they eventually greenlit. There were also strict contractual restrictions on advertising that Herman Wouk had negotiated in 1977, before either miniseries aired. He had approval over all ads and required them not to disturb the narrative or to run under 30 seconds. Wouk also refused to allow any advertising for personal care products, foods, or any other ABC programming. Major eventual sponsors were Ford Motors, Nike, IBM, GE and American Express. In addition, Wouk required that certain Holocaust sequences run uninterrupted by commercials of any kind. ABC's standards and practices division also agreed to an unprecedented waiver allowing frontal nudity during the lengthy Holocaust sequences, running parental advisories before any episodes beginning before 8pm.\nThe screenplay took two years to write. While Wouk wrote the script for The Winds of War alone, for War and Remembrance Curtis and Earl W. Wallace wrote the dramatic scenes dealing with the fictional Henry family, while Wouk wrote the scenes involving historical figures.  The series was nearly called off in 1985, just as it was nearing the completion of $16 million in preproduction, when ABC was bought by Capital Cities Communications, which instituted a thrifty executive direction.\nCasting\nAlthough most of the enormous cast of The Winds of War returned to their roles in War and Remembrance, including Robert Mitchum, Victoria Tennant, Polly Bergen and Jeremy Kemp, several roles were recast. John Houseman, who played Aaron Jastrow in Winds of War, was too frail for War and Remembrance's lengthy production schedule. He died of spinal cancer in 1988, the year War and Remembrance was broadcast. Houseman was replaced by John Gielgud. Jane Seymour was cast as Natalie Henry in place of Ali MacGraw after Seymour campaigned for the role and made a screen test. Dan Curtis was struck by her performance and immediately cast her in the vital role.\nJan-Michael Vincent, who played Byron Henry in The Winds of War, was busy as the action lead in the American television series Airwolf. Cast and crew also hint in more recent interviews in the featurette on the Winds of War DVD that Vincent's drinking made him difficult on set. Vincent was replaced by Hart Bochner. Other major replacements include Sharon Stone as Janice (replacing Deborah Winters), Leslie Hope as Madeline (replacing Lisa Eilbacher), Michael Woods as Warren (replacing Ben Murphy), Robert Morley as Alistair Tudsbury (replacing Michael Logan), Barry Bostwick as Aster (replacing Joseph Hacker), and Steven Berkoff as Adolf Hitler (replacing Günter Meisner). William Woodson again serves as narrator.\nFilming\nDuring preproduction, Dan Curtis lobbied the Polish Communist government tirelessly for permission to film on the grounds of the Auschwitz concentration camp, and after two years it was eventually granted, making War and Remembrance the first major commercial motion picture to be filmed there. His request was aided by the intercession of TVP, the public Polish TV network, and the support of Poland's preeminent World War II expert, who approved the script. Curtis said that he was allowed to film at Auschwitz on the condition that the script not have \"one word about Polish antisemitism\" during the war.\nFilming of the miniseries began with production at Auschwitz from January to May 1986. When the Chernobyl nuclear disaster happened nearby, causing legitimate fears of fallout spreading across Scandinavia and Eastern Europe, Curtis called in nuclear scientists from the International Atomic Energy Agency in Vienna to give the location a clean bill of health, but allowed any crew members who were still afraid to wait in Munich for the production to return. The crematoriums were rebuilt adjacent to the original site, from the original German blueprints, because they had been demolished by the Nazis at the end of the war.\nBecause the miniseries was being shot out of sequence, Jane Seymour's long hair could not be cut for the scenes at Auschwitz, which were the very first she filmed. Instead, make-up artists took shears to a full scalp wig for her to wear for those scenes instead. Both Curtis and Seymour contracted pneumonia in the brutal sub-zero temperatures there  and the production had to briefly shut down as a result. Several actual Auschwitz-Birkenau survivors were cast as extras for the Auschwitz-Birkenau selection sequence and former Auschwitz internee Branko Lustig, later a two-time Oscar-winning producer, served as assistant director on the series.\nFilmed from January 1986 to September 1987, the 1,492 page script (by Earl W. Wallace, Dan Curtis, and Herman Wouk) contained 2,070 scenes. There were 757 sets: 494 in Europe, including France, Italy, Austria, Yugoslavia, Switzerland, West Germany, England, and Poland, and 263 in the United States (including Hawaii) and Canada.  There were 358 speaking parts in the script; 30,310 extras were employed in Europe and 11,410 in the United States. The gargantuan production was filmed in a series of seven 13-week shooting blocks, after each of which it would shut down for a month to do preliminary work for the next 13-week shoot.\nThe series was shot in Yugoslavia in Zagreb and Osijek, where the old town district of Tvrđa, a Habsburg star-shaped fortress, was used as a primary location, doubling for the almost identical fortress town of Terezín in Czechoslovakia, which was converted by the Nazis to a Jewish ghetto. Filming took place in France throughout Paris, including the Paris Opera, where a scene from The Marriage of Figaro was staged with a 42-piece symphony orchestra and 500 extras, and Lourdes, where the production took over the Sanctuary of Our Lady of Lourdes; in West Germany in Baden-Baden and Berchtesgaden, where members of the United States Army, stationed nearby were hired as extras for some of the scenes shot at Hitler's Eagle's Nest; in Rome and Siena, Italy; Bern, Switzerland; London and Cambridge, England; and Vienna, Austria. Scenes set in Russia were filmed in Montreal in temperatures reaching 40 degrees below zero Celsius. In addition, miniatures for the sea battles were filmed in the water tank of the 007 Stage at Pinewood Studios in the United Kingdom.\nIn the US, the production shot extensively in and around Los Angeles. Filming also took place in Washington, D.C.; at the United States Naval Academy in Annapolis, Maryland; at Long Beach Naval Station in Long Beach, California aboard ; in Bremerton, Washington; at Naval Air Station Pensacola in Pensacola, Florida aboard the aircraft carrier ; in Mobile, Alabama, aboard ; and throughout Hawaii, including Pearl Harbor aboard  and Waianae, where a large group of warships were assembled.\nAfter principal photography was completed, a wrap party for cast and crew was held on January 8, 1988 aboard the ocean liner  in Long Beach, which had previously been used as a filming location for The Winds of War.\nEpisodes\n{| class=\"wikitable plainrowheaders\"\n|-\n! colspan=5 | Parts I–VII\n|-\n! style=\"background: #544d2c; color: #ffffff;\"| Part\n! style=\"background: #544d2c; color: #ffffff;\"| Title\n! style=\"background: #544d2c; color: #ffffff;\"| Original air date\n! style=\"background: #544d2c; color: #ffffff; width:10%\"| Viewers(millions)\n! style=\"background: #544d2c; color: #ffffff; width:10%\"| Rating/share(households)\n|-\n|Viewers=32.0\n|Aux4=21.8/31\n|ShortSummary = In the aftermath of the attack on Pearl Harbor, Victor \"Pug\" Henry is assigned the command of a Cruiser (the Task Force Flagship), son Warren is assigned as a dive bomber pilot on an aircraft carrier, while son Byron is already serving as an officer on a submarine. Pug asks his wife Rhoda to reconsider her divorce plans, even though he knows about her affair with Palmer Kirby, but Pug also gets a message from Pamela Tudsbury that she wants to rekindle their relationship. Berel Jastrow is captured by the Nazis and taken to Auschwitz in Nazi occupied Poland. In Naples, Italy, Natalie Henry, her son Louis, and her Uncle Aaron Jastrow await evacuation from Europe aboard a refugee boat bound for Palestine. Werner Beck, a German diplomat and Aaron's former student at Yale, convinces them to return to Siena.\n|LineColor = 544d2c\n}}\n| Viewers             = 26.6\n| Aux4                = 19.0/29\n| ShortSummary        = Leslie Slote, now working at the American Legation, receives secret Nazi documents from the Wannsee Conference, but his contact is killed before providing more authentication. Beck reports to Adolf Eichmann on his plans to get Aaron to make propaganda radio broadcasts favorable to the Axis powers. Natalie makes arrangements for them to escape from Italy with an Italian Jewish family. Berel and other prisoners are forced to prepare Auschwitz for an inspection visit by Heinrich Himmler. Himmler observes the gassing of a trainload of Dutch Jews as he is given a tour of the camp by its commandant, Rudolf Höss.\n| LineColor           = 544d2c\n}}\n|Viewers=27.6\n|Aux4=19.8/31\n|ShortSummary = Pug and Warren participate in the Battle of Midway, but Warren is killed during a clean-up mission. Pamela admits to Rhoda that she has feelings for Pug, but in the aftermath of Warren's death, she cannot break his lasting ties to Rhoda. Aaron and Natalie flee Italy.\n|LineColor = 544d2c\n}}\n|Viewers=23.3\n|Aux4=16.8/25\n|ShortSummary = Aaron and Natalie evade Beck and eventually escape to Marseille, Vichy France. Rhoda tells Palmer that she has decided to stay with Pug. Byron, now serving as a diplomatic courier between Gibraltar and Vichy France, visits the American Consul General in Marseille, who is arranging exit visas for Aaron and Natalie. Byron and Natalie reunite later that night.\n|LineColor = 544d2c\n}}\n|Viewers=24.6\n|Aux4=17.0/26\n|ShortSummary = Byron and Natalie's reunion is brief, because he must return to duty. Still without the proper documents, Natalie decides to wait until it is safer to cross the border. However, Germany invades Vichy France, and Aaron and Natalie are eventually interned with other Jews. In North Africa, Alistair Tudsbury is killed when his jeep hits a landmine. At Auschwitz, Col. Paul Blobel is given a tour of the newly constructed crematoriums, and is then given Berel's work group. At the Battle of Tassafaronga (part of the Guadalcanal Campaign), Pug is forced to abandon his ship after it is heavily damaged by Japanese forces.\n|LineColor = 544d2c\n}}\n|Viewers=24.6\n|Aux4=17.5/29\n|ShortSummary = President Franklin D. Roosevelt asks Pug to go to Moscow as a military aide. There, Pug tours the Russian Front and observes how the Soviet forces are using materials obtained via the Lend-Lease policy. Aaron and Natalie are eventually moved to Baden-Baden. After Aaron becomes ill, they are rushed to Paris for emergency surgery. While he recuperates, she works at an American library, but is stunned when Beck finds her.\n|LineColor = 544d2c\n}}\n|Viewers=25.0\n|Aux4=16.9/28\n|ShortSummary = Berel and other prisoners are forced to dig up corpses as part of Col. Paul Blobel's Sonderaktion 1005 operation. In a flashback sequence, Blobel recalls to a lieutenant the events of Babi Yar. Berel eventually escapes. Byron's submarine torpedoes a large Japanese transport, but the sub's commander, \"Lady\" Aster, orders his crew to kill any survivors clinging to the lifeboats or in the water, causing Byron and the other officers to question the order. Beck takes Natalie to dinner and the opera, and explains how tenuous their situation is. Natalie tries to arrange to join Americans in Germany being taken under Swiss protection, but Beck stops them. Aaron, Natalie and Louis are sent on a train to Theresienstadt.\n|LineColor = 544d2c\n}}\n|-\n! colspan=5 | Parts VIII–XII: The Final Chapter\n|-\n! style=\"background: #0257AC; color: #ffffff;\"| Part\n! style=\"background: #0257AC; color: #ffffff;\"| Title\n! style=\"background: #0257AC; color: #ffffff;\"| Original air date\n! style=\"background: #0257AC; color: #ffffff;\"| Viewers(millions)\n! style=\"background: #0257AC; color: #ffffff;\"| Rating/share(households)\n|-\n|Viewers=19.8\n|Aux4=13.4/21\n|ShortSummary = Aaron, Natalie and Louis are interned at Theresienstadt, where Adolf Eichmann forces Aaron to become a Jewish Elder on the camp's \"Cultural Council\". Czech resistance fighters rescue Berel from an SS patrol. Pug and Rhoda eventually decide to divorce. Pug then asks Pamela to marry him.\n|LineColor = 0257AC\n}}\n|Viewers=19.6\n|Aux4=14.4/22\n|ShortSummary = Leslie Slote, now with the OSS, meets with French Resistance leaders to organize uprisings against the Nazis, but is killed leading a raid on a German garrison. The Allies invade Normandy. Karl Rahm, Commandant of Theresienstadt, threatens to have Louis torn in half unless Natalie plays her part as a \"happy Jew\" during an upcoming Red Cross tour of the camp.\n|LineColor = 0257AC\n}}\n|Viewers=20.6\n|Aux4=15.1/24\n|ShortSummary = Aaron and Natalie are forced to act as \"happy Jews\" during the Red Cross' tour of Theresienstadt. They then fake Louis' death as Berel and other Czech Resistance fighters smuggle him out of the camp. Aaron and Natalie are then put on a train to Auschwitz. Hitler survives an assassination attempt during the 20 July plot.\n|LineColor = 0257AC\n}}\n|Viewers=21.3\n|Aux4=15.7/25\n|ShortSummary = At Auschwitz, Aaron is sent to die in the gas chambers, while Natalie is allowed to live as a forced laborer. Byron leads a successful attack on an enemy tanker, but it makes him realize he is not a career officer. As Allied forces advance closer to Germany, Himmler orders all traces of the Holocaust, including Auschwitz, to be destroyed; Natalie is one of the prisoners who are evacuated and forced on a death march. As Nazi SS troops retreat from Czechoslovakia, they loot and burn farms as they go, capturing Berel, Louis, and other resistance fighters. The SS then gun down their prisoners, but Berel manages to shield Louis with his dying body.\n|LineColor = 0257AC\n}}\n|Viewers=23.5\n|Aux4=15.9/26\n|ShortSummary = Allied troops advance further into Germany. In early March, 1945, an American squad finds Natalie barely alive. Hitler commits suicide and Germany surrenders. Pug and Pamela marry in the chapel at the United States Naval Academy in Annapolis, Maryland. The Americans successfully test an atomic bomb. Byron is able to find Natalie, who has survived years in Nazi camps and is now recuperating at a Paris hospital. Byron searches for their son, Louis. throughout Europe, eventually locating Louis at an orphanage in England. On the day after the atomic bombing of Hiroshima, Byron reunites with Natalie and Louis.\n|LineColor = 0257AC\n}}\n|}\nBroadcast\nThe scope of the production had required it to be greenlit years in advance. By 1988, network viewership had shrunk to just 68 percent of television viewers. As a result, by the time the series aired, it was never expected to earn a profit. ABC stated that they fully expected to lose at least $20 million on it. The miniseries was originally intended to run on consecutive nights in January 1989, but the 1988 Writers Guild of America strike caused ABC to move the first half, chapters I–VII, up to air in the fall of 1988. The strike raised ABC's ratings hopes, because it meant that the series would run without any other original programming opposite it on the other networks. However, when they were broadcast in November 1988, the first seven episodes no longer aired on consecutive nights, as originally planned, running instead spread out over eleven days.\nAlthough the miniseries won every time slot against its competition on NBC and CBS, and outperformed ABC's regular programming, it still underperformed ABC's ratings expectations, with the first chapter averaging an 18.6 Nielsen rating and a 29% viewer share. Because the ratings were lower than ABC had promised the various sponsors, the network was obligated to give additional free \"make-good\" advertising time to them. The low ratings were also reported to be partly responsible for ABC entertainment head Brandon Stoddard losing his job in April 1989. Dan Curtis blamed the lower-than-expected ratings partly on the confusing airdates, saying in a 2002 interview that ABC \"skipped Saturdays and Mondays, the viewers lost the thread, and they didn't even put up a sign saying 'To Be Continued' at the end of the first half.\" In addition, because the editing schedule was so compressed, ABC allowed Curtis to turn in episodes of enormously varying length, running anywhere from two to three hours with commercials, often with odd running times like two hours and five minutes or two hours and twenty minutes. As a result, the episodes had extremely inconsistent start and end times each night they ran. NBC mocked ABC's airing strategy in a promo for their November sweeps programming, comparing their schedule of various regular series, television premieres of acquired films, the Vanna White telefilm Goddess of Love and a Comedy Store special against ABC's \"eighteen hours of a war story that doesn't end.\"\nDue to the lower than expected ratings for the first half, the second half, chapters VIII–XII (marketed by ABC as \"The Final Chapter\"), had several hours cut before airing. The second half was also mixed and aired in mono, instead of the stereo used on the first half. This was not a cost-cutting measure, but the result of a technical issue encountered with airing the stereo mix on the first half.\nWith the series costing $105 million to produce, Capital Cities/ABC lost an estimated $30-$40 million on the production. This began the downfall of the miniseries, where the format faced decreasing lengths and ratings into the mid-1990s as a result of increasing VCR ownership and cable television; by the 1996–1997 season, the longest-running network miniseries airing was a six-hour adaptation of The Shining (1996).\nAwards\nWar and Remembrance received 15 Emmy Award nominations, including best actor (John Gielgud), actress (Jane Seymour) and supporting actress (Polly Bergen), and won for best miniseries, special effects and single-camera production editing. It also won three Golden Globes, receiving trophies for Best Miniseries, as well as two awards for John Gielgud and Barry Bostwick, who tied for Best Supporting Actor.\nReferences\nExternal links\n*\n* [https://www.youtube.com/watch?v=LbZQsQ-x7q8 War and Remembrance] television film trailer at YouTube\n* [https://interviews.televisionacademy.com/shows/war-and-remembrance] Television Academy Foundation interviews\n}}"
    }
  ]
}