{
  "content": [
    {
      "type": "text",
      "text": "# War of Ferrara (1482–1484)\n\n}}\nThe War of Ferrara (also known as the Salt War, Italian: Guerra del Sale) was fought in 1482–1484 between Ercole I d'Este, Duke of Ferrara, and the forces mustered by Ercole's personal nemesis, Pope Sixtus IV and his Venetian allies. Hostilities ended with the Treaty of Bagnolo, signed on 7 August 1484.\nDiplomatic background\nThe failure of the Pazzi conspiracy against Florence in 1480 and the unexpected peace resulting from Lorenzo de' Medici's daring personal diplomacy with Ferdinand I of Naples, the Pope's erstwhile champion, was a source of discontent among the Venetians and Pope Sixtus IV alike. With the Treaty of Constantinople of 1479, Venice had ended its long conflict with the Ottoman Turks, and was freed to turn its whole attention to its role in its terra firma (mainland) and to the peninsula of Italy more generally.\nIn addition to the usual minor friction over strongholds along the borders, there was a contest over the commerce in salt, which was reserved for Venice by a commercial pact. Nevertheless, Ferrara, which was ruled by Ercole I d'Este, had begun to take control over the saltworks at Comacchio. This appeared to be a threat to the mainland interests of the Republic of Venice.\nVenice was supported by Girolamo Riario, Lord of Imola and Forlì – the nephew of Pope Sixtus – who, having taken possession of the strategic stronghold of Forlì in September 1480, and having received swift papal confirmation, now looked towards Ferrara to extend Della Rovere territory.\nThe immediate casus belli at the beginning of 1482 was, as usual, a minor infraction of prerogatives: Venice maintained a representative in Ferrara with the high title of visdominio, under whose care lay the Venetian community in Este lands. In 1481, overreaching his mandate by the arrest of a priest for debt, the visdominio was excommunicated by the vicar of the bishop of Ferrara, and forced out of the city. This was made the excuse for the declaration of war.\nIn alliance with Venice, besides the papal troops and those of Riario, were contingents supplied by the Republic of Genoa, William VIII, Marquis of Montferrat, and Pier Maria II de' Rossi, Count of San Secondo. Taking Ferrara's side, which was loosely under the command of Federico da Montefeltro, Duke of Urbino, were troops of Ercole's father-in-law Ferdinand of Naples, led by his son Alfonso of Calabria, who invaded the Papal States from the south. Ferrara was also supported by troops sent by Ludovico il Moro of Milan, and those of Federico I Gonzaga of Mantua and Giovanni II Bentivoglio of Bologna, lords of two cities threatened by the mainland power of Venice.\nHistory\nVenetian troops led by the condottiero Roberto Sanseverino attacked Ferrarese territory from the north, brutally sacking Adria, quickly overrunning Comacchio, attacking Argenta at the edge of the saltmarshes, and besieging Ficarolo in May (capitulated 29 June) and Rovigo (capitulated 17 August).\nVenetian forces crossed the Po River and in November 1482 stood before the walls of Ferrara, where they laid close siege to the city. Sixtus appears to have had a change of heart concerning the season's advances, which now threatened to put Venice in an uncomfortably strong position in mainland northern Italy.\nIn the Papal States, the Colonna family took advantage of disorder, fighting fierce battles against their Della Rovere enemies. The main encounter, however, was the pitched Battle of Campomorto near Velletri, 21 August 1482, in which the Neapolitan troops were soundly defeated by Roberto Malatesta, and the duke of Calabria was only just rescued by a contingent of his Turkish soldiers. Some Orsini castles also fell into papal hands, but where battle failed, malaria succeeded: Roberto Malatesta's death in Rome on 10 September largely unravelled Papal successes in the Lazio. Sixtus made a separate peace with Naples in a truce of 28 November and a peace treaty was signed on 12 December.\nThe entreaties of Sixtus towards Venice to cease hostilities were vigorously rebuffed: his threats of excommunication were countered by the withdrawal of the Venetian ambassador, which led to the interdict of Sixtus against Venice in May 1483. Now Sixtus granted free passage to Alfonso and his troops to go to the defence of Ferrara against the pope's recent allies, aided by papal troops under Virginio Orsini. A contingent of Florentine troops also arrived, and the fortunes of Este began to look much better.\nIn a diversionary manoeuvre, Venice sent Roberto Sanseverino to attack the Duchy of Milan on the pretext of supporting the rights of the Visconti heir. However, this arm of the campaign was itself diverted as Sanseverino's efforts were expended against Alfonso, who was sacking Milanese territories. In September 1483, Alfonso laid siege to Asola, which fell in eight days.\nTreaty of Bagnolo\nThe war concluded with the Treaty of Bagnolo, signed on 7 August 1484. Ercole ceded the territory of Rovigo in the Polesine, lost at an early stage of the fighting, and the Venetian forces that were occupying Ferrara-owned territory withdrew. Ercole had successfully avoided the absorption of Ferrara, the seat of the Este, into the Papal States.\nSixtus was made more eager to sue for peace by the series of victories by Venetian forces, who seized the opportunity to forward their territorial ambitions and had been hasty to declare war on Ferrara on a minor pretext. Florence, Naples, Mantua, Milan, and Bologna stood by Ferrara. While the papal forces were holding in check the Neapolitans who sought to move north to aid Ferrara, and with the Roman Campagna being harassed by the Colonna, and Milan engaged in combat with Genoa, the Venetians had besieged Ferrara into starvation. With the Venetians ready to take over Ferrara, the Pope, fearing his erstwhile allies, suddenly changed sides: he made a treaty with Naples and permitted the Neapolitan army to pass through his territories, giving them the chance to convey supplies to Ferrara and neutralize the siege. At the same time, the Pope excommunicated the Venetians, and now urged all Italy to make war upon them.\nThe Peace of Bagnolo checked Venetian expansion in the terra firma, ceding to it the town of Rovigo and a broad swath of the fertile delta of the Po.\nNevertheless, Sixtus was not pleased with the terms reached without consulting him:\nThe war was the subject of an anonymous poem entitled La guerra di Ferrara.\nSee also\n* Wars in Lombardy\n* Italian Wars\n* List of treaties\nNotes\nFurther reading\n*\nExternal links\n* [http://www.zum.de/whkmla/military/15cen/ferrarese14821484.html The Ferrarese War 1482–84] On-line links\n* [http://cronologia.leonardo.it/storia/aa1481a.htm La guerra di Ferrara] details in Italian"
    }
  ]
}