{
  "content": [
    {
      "type": "text",
      "text": "# War in the 20th Century\n\nThe War in the 20th Century or La Guerre au vingtième siècle in the original French is an 1883 science fiction short novel written and illustrated by Albert Robida. It is the third illustrated short novel by the same name published by Robida, with the other two being published in 1869 and 1883. Robida is considered to be the first Science Fiction illustrator, and this piece in particular is often lauded for its robust illustrations.\nThe novel was written in 1869, before being published in La Caricature (1880–1904) in 1883, and then again in 1887. The novel was republished in English in 1998 in an anthology called Around the World.\nPlot summary\nThe novel opens with a brief recollection of the novels alternate history, including a civil war in the Danubian provinces (modern day Romania), an attempt by the United States to invade the country by sea, and the destruction of Corsica by China. From the short historical brief, it goes on to detail the experiences of a young soldier from Toulouse, Fabius Molinas. As the reader is introduced to Molinas, a \"telephone bulletin\" tells of an emerging casus belli occurring on 25 June 1945, and the subsequent assignment of Molinas as a 2nd Class Gunner in the 6th Squadron of the 18th Territorial Balloonists.\nAs the mobilization progresses, Molinas first describes so called  \"flying foggers\", air ships which spread a concealing fog onto the French border to help conceal the emerging war effort. It is also noted that the fog carries a nauseating odor, a harbinger of the various warfare practices which followed.\nThe first battle described includes largely conventional warfare, cannons firing on moving fortresses (presumably similar to modern armoured personnel carriers), and the eventual crash of the first airship Molinas is stationed on. The crash resulted in Molinas joining a ground offensive, during which the first use of chemical weapons is detailed. The opposing side deploys a multitude of bombs throughout the city, each emanating a green fog, which kills on contact.\nAfter surviving the gas and the corresponding counteroffensive, Molinas dons the uniform of an enemy chemical officer, and travels behind enemy lines, where he learns of the enemies \"Defensive Medical Corps\" a group of \"chemical engineers, doctors, and apothecaries\" who were working on land mines equipped with various \"concentrates and microbes\" including specifically Yellow fever, Glanders, Dysentery, Measles, and Toothaches. The infective products, being stored in a large reservoir is then destroyed by Molinas, who opens fire on it.\nMolinas, who at the time was still wearing a chemical suit, avoids all but a toothache, and reports back to the French offensive, having crippled the enemies abilities, and in turn infecting 179,510 civilians and military personnel, all on the side of the enemy.\nThroughout additional battles, the use of mediums by the French is introduced, working to clear minefields. This eventually reveals two hidden enemy units, who use further chemical and biological weapons, including asphyxiating gas, sleeping gas, a seizure inducing gas, and so called \"chemical scabies\". The French then respond with a corrosive weapon of their own, which wipes out the chemical units.\nAfter the ground offensive, Molinas is put in charge of a small submarine, which he proceeds to sink after taking out multiple enemy vessels. After once again escaping, and finding the French army, he is again put in charge of a Submarine, using it to cut off enemy communications before finally receiving medical care at a French Hospital.\nIn the last two detailed battles of the war, Molinas is put in charge of two further airships, losing one to wild animals, and crashing another into a Mexican city in a fire fight, at which point Molinas receives word that the war is over.\nProminent themes\n* Futurism and Innovation\n* National exceptionalism and patriotism\n* Dystopianism\n* Social change\n* Biological warfare\nAccurate predictions of the future\n* Mobilization of France in a major conflict in 1945. (The first official French involvement in World War II came just a few years early in 1940, and the conflict was ongoing in 1945)\n* Armoured personnel carriers\n* Chemical and Biological weapons, specifically blister agents\n* Submarine and air warfare\n* Battlefield communications including telephones\nSee also\n* Biological warfare in popular culture\n* Biological warfare\nReferences"
    }
  ]
}