{
  "content": [
    {
      "type": "text",
      "text": "# War of the Ring (SPI game)\n\n, 1977]]\nWar of the Ring, subtitled \"S.R. 1418 to 1419\", is a licensed wargame published by Simulations Publications, Inc. (SPI) in 1977 that simulates the events described in The Lord of the Rings by J.R.R. Tolkien.\nDescription\nWar of the Ring was the first licensed product to attempt to cover the entire series of conflicts depicted in Lord of the Rings from the Fellowship's departure from Rivendell to the final battle at the Black Gates of Mordor. It is a two-player game, with one player taking the side of the Free Peoples of Middle-earth, and the other player taking the dark forces of Sauron. There are also rules for a three-player version, with one player taking the role of Saruman.\nCharacter game\nThe Character game uses more basic rules, and follows the quest by the Fellowship of the Ring to destroy the One Ring. On one side is the Fellowship. The other player controls the nine Nazg没l, Saruman, the Mouth of Sauron, and possibly Gollum, if he manages to acquire the Ring. If the Fellowship succeeds in transporting the Ring to Mount Doom, the Fellowship wins. If the Dark Forces locate the Ring, wrest it from the Fellowship and transport it to Barad-d没r, then the Dark Forces win. The Dark Power also has the option of winning a military victory, played out by moving Nazg没l to various important Fellowship-controlled fortresses and rolling dice see if they are captured.\nCampaign game\nThe more complex mode of play is the Campaign Game, which adds in army units for both sides as well as other characters from the story who were involved in the military campaigns. An odds-ratio combat system is used to play out combat between armies. Players can win with their Ring-based objective from the Character game or by capturing a specified list of objectives with their armies.\nCharacters in the game are rated for their abilities in individual combat, magic, army leadership, endurance, and resistance to the lure of the Ring. The latter rating determines the difficulty they have of voluntarily removing the Ring once they put it on; they gain various benefits by wearing it, but if they do so for too many turns, they become a \"semi-Ringwraith\" under Dark Power control.\nTo simulate Sauron's conflicting needs of searching for the Ring versus directing his armies, the Dark Power player is given a variable number of \"Shadow Points\" each turn, which they can spend to perform various activities. Among these is searching for the Fellowship; although the hex locations of various Fellowship members are known, their identity is not (their counters are kept upside-down), and Sauron must perform search actions with Nazg没l or orcs to identify the characters, and to spot them so they can be fought or captured. Which areas of the map can be searched, and with what forces, is controlled by a small deck of cards.\nPublication history\nIn 1976, SPI was granted a license by the Tolkien Estate to produce wargames based on Lord of the Rings. SPI subsequently produced three wargames in 1977: Sauron, Gondor: The Siege of Minas Tirith, and War of the Ring. The latter was a game designed by Richard Berg, with graphics by Redmond A. Simonsen and cover art by Tim Kirk. SPI also packaged all three games into a boxed set titled Games of Middle Earth. This proved to be one of SPI's bestsellers, debuting at Number 1 on SPI's Top Ten list four months before publication based on pre-orders alone. War of the Ring was released in November 1977, after which Games of Middle Earth remained SPI's bestselling game for almost two years. Shannon Appelcline identified War of the Ring as the most notable of the early science-fiction and fantasy games published by SPI.\nReception\nIn Issue 24 of the British wargaming magazine Perfidious Albion, Charles Vasey and Geoffrey Barnard discussed the game. Barnard commented, \"This game may or may not be a success as a simulation of the books, but for my money it is a failure as a game ... It seems to be a very mechanical game [where] nothing much seem to happen.\" Vasey replied, \"The rules are rather incomplete but have some original ideas ... The searches are a bit odd as they depend on the cards. The Army combat system suffers from lots of flaws ...The individual combat is rather too predictable in final result.\" Barnard concluded, \"Probably any fan of the books will not be too bothered, as it does have all the colour, but if you are not too much of a fan, try to get to play the game, or at least study it carefully, before you buy it.\" Vasey concluded, \"I like it, it gives a real feel of the book along with nail-biting play choices ... Those into the books can have delightful events like a Balrog sitting in Shelob's Lair cursing the clerks at Posting!\"\nIn The Space Gamer No. 16, Tony Zamparutti liked the game, saying \"War of the Ring is not only a fun game, but a fairly good recreation of the events in LOTR.\"\nIn Issue 40 of Moves, Neil Randall was initially impressed by the \"wealth of details\", and \"the amount of research\", and noted that \"The graphics are beautiful, the play is fast, and the outcome is always in doubt.\" But Randall had major issues with the Search System, where the player who controls Sauron has an opportunity to find the Fellowship of the Ring using the One Eye. Randall believed that \"The Search System [...] fails to work both tactically and, most importantly, strategically.\"  Randall pointed out that the Sauron player merely needed to stack all of the Nazgul onto Mount Doom, wait for Frodo, successfully search for him, and then kill him. Randall believed that this was so far from Tolkien's original vision that it made the game unplayable to a Tolkien fan. Randall's only suggestion to save what he otherwise thought was an excellent game, was to design a hidden movement system and do away with the Search System.\nIn the inaugural issue of Ares, Dave Ritchie called the Character Game \"somewhat feeble\", called the rules \"atrocious\", and also noted the problem that the Sauron player knows exactly where the Good characters are all the time. On the plus side, Ritchie found the Army Game \"captures much of the richness of the mythos which was absent in the Character Game\", and he enjoyed \"the thorough attention to detail.\" He concluded by giving the game an average rating of 7 out of 10, saying, \"Games of War of the Ring range from predictable to cliff-hanging, gut-wrenching suspense. Fairly complex, and requires several hours to play. Not for those who have not read the Ring Trilogy.\"\nIn Issue 17 of Phoenix, Brad Laidlaw admired the cover art by Tim Kirk that illustrated the battle between Gandalf and the Balrog in the Mines of Moria. He also liked the quality of the components, but found typos in the rules. As much as he liked the game, Laidlaw noted that since the only realistically achievable way for the Fellowship player to win is to destroy the Ring, the Dark Power player can simply stack all their units on Mount Doom, attempt to spot the Fellowship when it enters the hex (with a good chance of success), and if successful, conduct a series of individual combats to attempt to take the Ring. As a result, the entire game can be decided by an enormous brawl atop Mount Doom. As Laidlaw pointed out, \"What is needed of course is a set of hidden movement rules which would rocket the game into brand new orbit. Any takers? The game is certainly worth it.\"\nIn the 1980 book The Complete Book of Wargames, game designer Jon Freeman called the game \"A valiant effort at producing a workable simulation that retains the feel and color of Tolkien's setting.\" Freeman gave this game an Overall Evaluation of \"Very Good\", concluding, \"The game is aimed at introducing Tolkien fans to wargaming rather than the reverse, and there are enough holes in the rules that gamers unfamiliar with the plot may have some difficulties.\"\nAwards\nAt the 1978 Origins Awards, War of the Ring won the Charles S. Roberts Award for Best Fantasy Board Game of 1977.\nOther reviews\n* Fire & Movement #17\n*The Wargamer Vol.1 #7\n* Campaign #84\n*Spartan #11\n*Line of Departure #44\n*Ann Arbor Wargamer #20\n*Games\n*1980 Games 100 in Games\n* [https://archive.org/details/games-26-1981-november/page/56/mode/2up 1981 Games 100] in Games\n*1982 Games 100 in Games\nReferences\nExternal links\n* (SPI version)"
    }
  ]
}