{
  "content": [
    {
      "type": "text",
      "text": "# War of the Worlds (2025 film)\n\n| story          = Kenneth A. Golde\n| based_on       =\n| producer       =\n| starring       =\n| cinematography = Christopher Probst\n| editing        =\n| music          = Jon Natchez\n| studio         =\n| distributor    = Universal Pictures\n| released       =\n| runtime        = 89 minutes\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nWar of the Worlds is a 2025 American screenlife science fiction film based on H. G. Wells's 1898 novel The War of the Worlds. The film was directed by Rich Lee with a screenplay by Kenneth A. Golde and Marc Hyman from a story by Golde. It stars Ice Cube, Eva Longoria, Clark Gregg, Andrea Savage, Henry Hunter Hall, Iman Benson, Devon Bostick, and Michael O'Neill.\nWar of the Worlds was released by Universal Pictures on Amazon Prime Video on July 30, 2025. The film received negative reviews from critics, who panned the cinematography, writing, Ice Cube's performance, and the film's product placement.\nPlot\nDepartment of Homeland Security (DHS) officer Will Radford works for a government surveillance program that can monitor every person on Earth. His relationship with his pregnant daughter Faith and son Dave is strained due to his use of the program to constantly monitor them. While helping FBI agents try to find a mysterious hacker, known as \"Disruptor\", meteors begin striking all over the planet. When large machines emerge from the meteorites and start attacking humans, Will and his friend Sandra from NASA conclude it is an alien invasion. Will helps Dave and Faith evade the machines before being called to a meeting with DHS Director Donald Briggs, U.S. Secretary of Defense Walter Crystal, and the United States president.\nWhen the president authorizes a military response, other governments do likewise. Will notices the machines are concentrating around data centers around the world, dispersing smaller insectoid creatures to harvest data inside the buildings. The data nourishes the alien machines, and they continue to defeat the human forces attacking them. Will is dismayed to discover that Disruptor is actually Dave, who links him to classified information regarding a surveillance operation known as \"Goliath\". These classified files reveal to Will that alien ships had previously arrived on Earth, and that the government knew they fed on data. Despite warnings that activating Goliath could attract the aliens, Briggs activated it anyway. Will confronts Briggs, who claims his actions were necessary to keep people safe. Briggs then locks Will out of the DHS system.\nWill, Dave and his team of hackers re-enter the system and plant a virus to disable the aliens' machines. The virus fails to stop the aliens, who locate and kill most of Dave's fellow hackers. The military plans to bomb the DHS headquarters (under which Goliath is kept), to ensure the aliens cannot access the system. Using a variation of Faith's cancer-destroying \"Cannibal\" code concealed in a flash drive delivered by her boyfriend, Amazon delivery driver Mark, Will breaks into the bunker and shuts down Goliath in time, simultaneously deactivating the aliens. The military calls off the bombing.\nWill and Dave are celebrated as heroes, Briggs is arrested for his crimes and Faith is credited with using her DNA studies to ensure the aliens' defeat. Crystal gives Will an offer to lead a new surveillance program that will not interfere with people's privacy, but he declines, saying, \"Now, I'm watching you.\" He then leaves to go to Faith's baby shower.\nCast\n* Ice Cube as William \"Will\" Radford, a surveillance and threat assessment expert at the Department of Homeland Security who watches people via a security program\n* Eva Longoria as Dr. Sandra Salas, Will's friend who works at NASA and monitors the weather\n* Clark Gregg as Donald Briggs, Director of the Department of Homeland Security\n* Iman Benson as Faith Radford, Will's daughter, a biomedical researcher who is pregnant\n* Henry Hunter Hall as David \"Dave\" Radford, Will's son, a video gamer and hacker known as Disruptor\n* Devon Bostick as Mark Goodman, Faith's boyfriend, Amazon delivery driver\n* Michael O'Neill as Walter Crystal, United States Secretary of Defense\n* Andrea Savage as Sheila Jeffries, FBI Agent\n* Jim Meskimen as the President of the United States\nProduction\nIn September 2020, in the midst of the COVID-19 pandemic, Ice Cube joined in the lead role in an untitled film produced by Timur Bekmambetov, which would be directed by Rich Lee with a screenplay by Kenneth A. Golde for Universal Pictures. Universal was intrigued by the project by Bekmambetov's use of screenlife technology, described as having \"the look of commercial event film but at the budget of a contained thriller\", which also allowed the actors and crew members to work in individual workspaces, which was seen as useful regarding the pandemic's impact on the film industry. In October, Eva Longoria joined the cast, and Universal greenlit the film and \"fast tracked it by having it go into production\" that month. By April 2024, it was revealed to be an adaptation of the 1898 novel The War of the Worlds by H. G. Wells.\nProduction lasted for fifteen days. Post production lasted for two years. According to producer Patrick Aiello, the film was originally developed for a theatrical release by Universal, and it was later acquired by Amazon which included an Amazon delivery driver character as fitting to its platform. Aiello said the production budget was below $10 million. Ice Cube stated the film was filmed in isolation due to the 2020 lockdown.\nIn July 2025, Clark Gregg, Andrea Savage, Henry Hunter Hall, Iman Benson, Devon Bostick, and Michael O'Neill were revealed to have been part of the project. The film was produced using a screenlife technique that places audiences inside the action through the lens of phones, computers, and tablets. Bekmambetov added: \"If aliens invaded today, how would we experience it? Most likely, we'd be watching it on our phones, in that way, it's kind of a modern spin on Orson Welles's War of the Worlds. Back then, he used radio, the most popular technology of the time, to make people believe the invasion was real. Today, that medium is the screen of our devices.\" Jon Natchez composed the film's score.\nWar of the Worlds was released by Universal Pictures on Amazon Prime Video on July 30, 2025.\nReception\nThe product placement from Amazon was panned by critics. The film's climax, where an Amazon employee uses a Prime Air drone to deliver Ice Cube's character a flash drive, was heavily criticized. Brian Tallerico of RogerEbert.com gave it zero out of four stars, considered the constant promotion of Amazon \"truly morally icky\", and recommended watching Union instead.\nPeter Debruge of Variety considered the film to be a poor adaptation of The War of the Worlds, criticizing Ice Cube's performance. NBC's Austin Mullen called it one of the worst films of 2025. The movie has entered Rotten Tomatoes's list of \"100 Worst Movies of All Time\" at #76, . Kevin Nguyen of The Verge described the movie as \"so bad it's good\". Entertainment Weekly reviewer Jordan Hoffman gave it a positive review, saying, \"It's certainly stupid, but it's also a great deal of fun.\"\nSee also\n*List of works based on The War of the Worlds\nReferences\nExternal links\n*"
    }
  ]
}