{
  "content": [
    {
      "type": "text",
      "text": "# War Memorial of Brugherio\n\nThe War Memorial of Brugherio is a sculptural complex made by Ernesto Bazzaro in 1933. It is situated in Via Vittorio Veneto, in front of the Federico Sciviero Primary School.\nHistory\nThe mayor of Brugherio at the time, Ercole Balconi, wanted to commemorate the fallen citizens of Brugherio during World War I with a monument. He commissioned scapigliati sculptor Ernesto Bazzaro (well-known war memorial artist in Lombardy) to erect one in Brugherio. The work was officially inaugurated in 1933, being initially opposed by parish leader, Don Giuseppe Camagni (1921-1957). Tina Magni, first librarian and historical brugherese, remembers that the pastor opposed since 1929 the official inauguration of said monument. The chronological gap between the construction work and the official opening is evident from the archival material stored in the Public Library of Brugherio, showing the diplomatic efforts made by the deans of Brugherio's schools aimed at reconciling the two highest authorities of the city, mainly the mayor and the parish priest.\nArtistic analysis\nThe complex, sculpted in bronze and stone, in the Scapigliatura style, adopted by Bazzaro in his early years after meeting Tranquillo Cremona. Scapigliatura proposed to abandon the academic technicality of late-romantic style, conveying reality with a \"restless sentimentality\". The War Memorial of Brugherio is characterized by \"dramatic tension\" derived from the dichotomy between the complex gesture of its two soldiers at the foot of a rock on which stands Victory, leaning against an eagle. Victory leans towards the exterior and is therefore dynamic. The soldiers are separated from Victory by an imposing stone block, and are said to be \"isolated in their spiritual and psychological tension\". Victory offers the soldiers a compassionate gesture, and is shown as about to throw a rose at the soldier who came to the rescue of his dead comrade. The soldier, aware of the goddess, turns to her, anxious and upset, to collect the gift. The dramatic tension which accompanies the juxtaposition of the goddess and the soldiers, can also be appreciated between the two soldiers themselves: one lifeless, lying on the ground; the second, is desperate and caught in anguish, as shown by his arm being extended towards the merciful god.\nReferences\nBibliography\n*\n*\n*\n*\nExternal links\n*\n*\n*"
    }
  ]
}