{
  "content": [
    {
      "type": "text",
      "text": "# War of the Hungarian Succession\n\nThe War of the Hungarian Succession (1490–1494) was a war of succession triggered by the death of King Matthias Corvinus I of Hungary and Croatia (r. 1458–1490).\nName\nThere is no commonly used name for this war in historiography. However, there is agreement in historical literature that the casus belli was the death of Matthias Corvinus, who except for his illegitimate son John Corvinus had no legitimate heir, and thus several rival claimants began to wage war to succeed him as king of Hungary and Croatia. Descriptions that have been used by various scholars include 'War of (the) Hungarian Succession' and 'the succession struggle'.\nClaimants\n* John Corvinus (Hungarian: Corvin János), the illegitimate son of Matthias Corvinus and his mistress Barbara Edelpöck. Matthias had spent the last few years of his life primarily to securing John as his successor.\n* Vladislaus (alias Vladislav, Wladislas and Ulászló), the king of Bohemia, from the Jagiellonian dynasty. He would eventually win the war and become known as king Vladislaus II of Hungary and Croatia.\n* John Albert (Polish: Jan Olbracht), Vladislaus' brother and also from the Jagiellonian dynasty, who would become the king of Poland in 1492 as John I.\n* Maximilian I, Holy Roman Emperor and archduke of Austria, from the House of Habsburg. He raised claims based on the Habsburg–Hunyadi treaty.\nWar\nStruggle for the crown\nMatthias Corvinus died unexpectedly in Vienna on 6 April 1490. By the time the noblemen assembled to elect his successor in May, four candidates laid claim to the throne. Matthias' illegitime son, John Corvinus was primarily supported by barons and prelates who owned estates along the southern frontier (including Lawrence Újlaki and Peter Váradi, Archbishop of Kalocsa). Maximilian of Habsburg referred to the 1463 Peace Treaty of Wiener Neustadt, which prescribed that Emperor Frederick or his heirs were to inherit Hungary if Matthias died without a legitimate heir. Vladislaus claimed Hungary as the eldest son of the sister of Matthias's predecessor, Ladislaus the Posthumous. However, his parents, who wanted to secure a separate realm to their each sons, proposed Vladislaus's younger brother, John Albert.\nMost Hungarian barons and prelates preferred Vladislaus, because his rule in Bohemia had indicated that he would respect their liberties. Vladislaus also pledged that he would marry Matthias's wealthy widow, Beatrice of Naples, after his coronation. His two supporters, Stephen Báthory and Paul Kinizsi, defeated John Corvinus on 4 July. The Diet of Hungary elected Vladislaus king on 15 July. Vladislaus who had left Prague for Hungary in late June issued a charter promising to refrain from imposing extraordinary taxes or introducing other \"harmful novelties\" and to closely cooperate with the Royal Council. He reached Buda (the capital of Hungary) on 9 August. He met his brother, who had marched as far as Pest on the opposite side of the Danube River, but they did not reach a compromise.\nVladislaus was crowned king on 18 September in Székesfehérvár. In accordance with the promise he made after his election, he settled in Buda. In his absence, Bohemia was administered by the great officers of state, especially the Burgrave of Prague and the Chancellor. Moravia, Silesia and Lusatia had acknowledged his rule soon after Matthias Corvinus's death. Although Vladislaus pledged that the three provinces would be attached to the Hungarian Crown until the money stipulated in the Peace of Olomouc was paid to the Hungarian treasury, the Estates of the Bohemian Crown argued that the personal union under his rule made that stipulation void. The 400,000 gold florins were never paid.\nJohn Albert did not renounce Hungary after Vladislaus's coronation. He captured Eger and laid siege to Kassa (Košice in Slovakia) in September. Vladislaus married Beatrice of Naples in Esztergom on 4 October, but the marriage was kept secret, although she gave considerable funds to him to finance his campaigns for Hungary. Maximilian of Habsburg also invaded Hungary and seized Szombathely, Veszprém and Székesfehérvár by the end of November. Vladislaus's supporters relieved Kassa in early December, and Maximilian withdrew from Hungary before the end of the year, because he could not finance his campaign. John Albert renounced his claim to Hungary in exchange for the Duchy of Głogów and the suzerainty over half of Silesia on 20 February 1491.\nVladislaus's troops had meanwhile expelled the army of Maximilian of Habsburg from Hungary. In the Peace of Pressburg, signed on 7 November 1491, Vladislaus renounced all territories that Matthias Corvinus had conquered in Austria and also acknowledged the Habsburgs' right to inherit Hungary and Bohemia if he died without a son. The Hungarian-Czech Black Army of 18,000 soldiers commanded by Stephen Zápolya routed John Albert at the Battle of Eperjes (Prešov in Slovakia) on 24 December 1491, forcing him to abandon his claim to Hungary.\nOttoman invasions and Black Army mutiny\nAlthough the succession dispute itself was practically settled in late 1491, the war was far from over, as the Ottoman Empire sought to exploit Hungary and Croatia's internal instability by invading to make territorial gains, while the Black Army mutinied due to a lack of wages. The first Ottoman incursion into Hungary was repelled at the Battle of Vrpile in early September 1491.\nThe Black Army was sent to the south region to fight the Ottoman invasions. While waiting for their wages, they sought plunder in the nearby villages. The National Council ordered Paul Kinizsi to stop the plundering at all costs. He arrived in Szegednic-Halászfalu in late August 1492, where he dispersed the Black Army led by Haugwitz. Of the 8,000 members, 2,000 were able to escape to western Styria, where they continued to pillage the countryside. The prisoners were escorted to Buda, where the Black Army was officially disbanded and they were allowed to leave abroad under the condition never to come back and claim their payment. They joined the forces already in Austria. They confronted Count Georg Eynczinger on 7 May 1493, at Thaya, where they were all killed or captured and tortured to death. The last remaining mercenaries were integrated into local garrisons, such as the one in Nándorfehérvár (Belgrade) under the leadership of Balthasar Tettauer, brother of Wilhelm Tettauer. They were so frustrated about their financial status that they allied with Ottoman Mihaloğlu Ali Bey to handle secretly the fort to his Sultan, Bayezid II. When their plan surfaced, Paul Kinizsi intervened in May 1494 before their act could take place. He arrested the captain and his crew for treason and starved them to death. As the last Ottoman army had been defeated at Villach in 1493, the disappearance of the Black Army concluded the war.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}