{
  "content": [
    {
      "type": "text",
      "text": "# War Chamber (2019)\n\nWar Chamber was a professional wrestling supercard event produced by Major League Wrestling (MLW), which took place on September 7, 2019. It aired as a special episode of MLW's television program, Fusion, on September 14, 2019 on beIN Sports. It was the first event under the War Chamber chronology.\nTwelve matches were contested at the event, with two matches airing on television, eight matches being taped for future episodes of Fusion, as well as two non-televised matches. The main event was the namesake War Chamber match, pitting Team Von Erichs (Marshall Von Erich, Ross Von Erich, Low Ki and Tom Lawlor) against Contra Unit (Ikuro Kwon, Jacob Fatu, Josef Samael and Simon Gotch), which Team Von Erichs won. The undercard featured a match between Leo Brien and Blake Banks.\nProduction\nBackground\nMajor League Wrestling previously held two WarGames events featuring the namesake WarGames match. However, in 2018, WWE acquired the rights to the WarGames name from MLW for its NXT TakeOver events, which led to MLW stopping the usage of WarGames name.\nOn June 2, 2019, MLW.com reported that MLW would be holding an event in Dallas, Texas for the first time later in the year. The following day, it was reported that the event which would be titled War Chamber would be taking place on September 7 at the NYTEX Sports Centre. It was later revealed that the War Chamber match would headline the event, which was a variation of the WarGames match, with the only difference being that the ring would be locked by a carbon steel chamber and barbed wire would be placed on the top of the chamber and victory could be attained by pinfall or submission. It was announced that the War Chamber event would air on television as a special episode of Fusion on beIN Sports on September 14.\nStorylines\nThe card consisted of matches that resulted from scripted storylines, where wrestlers portrayed villains, heroes, or less distinguishable characters in scripted events that built tension and culminated in a wrestling match or series of matches, with results predetermined by MLW's writers. Storylines were played out on MLW's television program Fusion.\nThe Contra Unit trio of Simon Gotch, Jacob Fatu and Josef Samael debuted in MLW at Intimidation Games by attacking Tom Lawlor after Lawlor had successfully defended the MLW World Heavyweight Championship against Low Ki in a steel cage match. The group attacked Lawlor numerous times, leading to a title match between Lawlor and Fatu at Kings of Colosseum, which Fatu won thus winning the World Heavyweight Championship. On the June 22 episode of Fusion, Ross Von Erich and Marshall Von Erich, the sons of Von Erich family member Kevin Von Erich made their MLW debut alongside Lawlor to defeat Contra Unit in a six-man tag team match, thus becoming Lawlor's allies in the rivalry. On the August 3 episode of Fusion, Ikuro Kwon made his MLW debut as the newest Contra Unit member by spraying mist into Marshall Von Erich's eyes after the Von Erichs defeated The Spirit Squad. On August 4, MLW.com reported that Lawlor and the Von Erichs challenged Contra Unit to the namesake match at the War Chamber event, which was made official on August 7. On the August 10 episode of Fusion, Kwon was added to the War Chamber as the fourth member of the Contra Unit. On August 20, it was announced that Kevin Von Erich would be the cornerman for Lawlor and Von Erichs at War Chamber. On the August 31 episode of Fusion, Lawlor received his rematch against Fatu for the World Heavyweight Championship, which Fatu retained with the help of Contra Unit. Contra Unit attacked Lawlor and the Von Erichs after the match until Low Ki made the save for them. On September 3, it was announced that Ki would be joining Lawlor and the Von Erichs as the fourth member on their team in the War Chamber, stemming from a previous attack by Contra Unit on Low Ki on the May 25 episode of Fusion.\nEvent\nThe event opened with a match between Leo Brien and Blake Banks. Brien executed an Oklahoma Stampede on Banks for the win. After the match, LA Park and Salina de la Renta showed up and Park attacked Banks and the referee and then Renta announced that Park would be cashing in his Golden Ticket opportunity for the World Heavyweight Championship at Saturday Night Superfight pay-per-view.\nThe main event was the namesake War Chamber match, pitting Team Von Erichs (Marshall Von Erich, Ross Von Erich, Low Ki and Tom Lawlor) against Contra Unit (Ikuro Kwon, Jacob Fatu, Josef Samael and Simon Gotch). Marshall and Ross hit a double-team iron claw slam on Gotch for the win.\nAftermath\nLA Park would receive his World Heavyweight Championship opportunity against Jacob Fatu at Saturday Night SuperFight, where Fatu retained the title.\nResults\n|note1=fusion\n|stip1=Singles match\n|match1=Dominic Garrini defeated Ariel Dominguez\n|note2=dark\n|stip2=Tag team match\n|match2=The Spirit Squad (Kenny and Mikey) defeated Andy Dalton and enhancement talent\n|stip3=Singles match\n|match3=Leo Brien defeated Brandon Banks\n|match4=Gringo Loco and Air Wolf defeated Myron Reed and Kotto Brazil\n|note4=fusion\n|stip4=Tag team match\n|stip5=Singles match\n|match5=Austin Aries defeated Brian Pillman Jr.\n|note5=fusion\n|note6=fusion\n|stip6=Bunkhouse match\n|match6=Mance Warner defeated Jimmy Havoc\n|note7=fusion\n|stip7=Singles match\n|match7=Timothy Thatcher defeated Douglas James\n|note8=dark\n|stip8=Singles match\n|match8=Mega Danger defeated Ace Austin\n|note9=fusion\n|stip9=Tornado tag team match\n|match9=Los Parks (El Hijo de L.A. Park and L. A. Park) (with Salina de la Renta) defeated Magnus and Septimo Dragon\n|note10=fusion\n|stip10=Singles match\n|match10=Jordan Oliver defeated Zenshi\n|note11=fusion\n|stip11=Two out of three falls match for the MLW World Tag Team Championship\n|match11=The Dynasty (MJF and Richard Holliday) (c) defeated The Hart Foundation (Davey Boy Smith Jr. and Teddy Hart)\n|stip12=War Chamber match\n|match12=Team Von Erichs (Marshall Von Erich, Ross Von Erich, Low Ki and Tom Lawlor) (with Kevin Von Erich) defeated Contra Unit (Ikuro Kwon, Jacob Fatu, Josef Samael and Simon Gotch)\n}}\nReferences\nExternal links\n*[https://mlw.com/september-7-war-chamber/ War Chamber official website]"
    }
  ]
}