{
  "content": [
    {
      "type": "text",
      "text": "# War Eagle__disambig_1\n\nWar Eagle is a battle cry, yell, or motto of Auburn University and supporters of Auburn University sports teams.  War Eagle is a greeting or salutation among the Auburn Family (e.g., students, alumni, fans).  It is also the title of the university's fight song and the name of the university's golden eagle.\nThe widespread use of \"War Eagle\" by Auburn devotees has often led to outside confusion as to Auburn's official mascot. However, the official mascot of Auburn University is Aubie the Tiger, and all Auburn athletic teams, men's and women's, are nicknamed the Tigers. Auburn has never referred to any of its athletic teams as the \"Eagles\" or \"War Eagles.\" The university's official response to the confusion between the Tigers mascot and the War Eagle battle cry is, \"We are the Tigers who say 'War Eagle.'\"\nSince 1930, and continuously since 1960, Auburn has kept a live golden eagle on campus. Since 2001 Auburn has presented an untethered eagle to fly over Jordan-Hare stadium prior to the start of football games. War Eagle VIII, a golden eagle named Aurea, along with Spirit, a bald eagle, perform the War Eagle Flight before all Auburn home games at Jordan–Hare Stadium.\nHistory of the \"War Eagle\" phrase\nAs early as 1916, the Columbus, Georgia Daily Enquirer mentioned \"War Eagle\" as an Auburn battle cry. In the 1846 edition of Francis Parkman's study of the Plains Indians The Oregon Trail, the term \"War Eagle\" is used to describe the feathers in the headdress of various Dakota tribe members. In the 19th and early 20th centuries, \"War Eagle\" appeared from time to time in the United States as an evocative nickname for people and things such as Native Americans (including professional wrestlers); race horses; a U.S. civil war mascot; and, in one case, a coal mine interest.\nThere are several stories about the origin of the battle cry.  One of these is a mythical story published in 1959 in the Auburn Plainsman, conceived by its then editorial page editor, Jim Phillips.  This myth is detailed below under War Eagle I. Another mythical story is told about an Auburn student who returns to the University after the war with an eagle who was wounded on the battlefield with him but he nursed back to health. The eagle soared above the field in 1892 as Auburn scored the winning touchdown as the crowd chanted \"War Eagle!\" Just then, the eagle fell to the ground dead from age but was to live on as the Auburn football battle cry for generations to come.\nA 1914 football game against the Carlisle Indians provides another myth.  According to this story, there was a lineman/tackle named Bald Eagle on the Indians' team.  Attempting to exhaust that player, Auburn's team began running multiple plays directly at his position.  Without even huddling, the Auburn quarterback Lucy Hairston would yell \"Bald Eagle,\" letting the rest of the team know that the play would be run at the tackle.  Spectators, however, thought the quarterback was saying \"War Eagle,\" and began to chant that.\nAnother legend claims that \"War Eagle\" was the name given to the large golden eagle by the Plains Indians because the eagle furnished feathers for use in their war bonnets.\nAccording to a 1998 article in the Auburn Plainsman, the most likely origin of the \"War Eagle\" cry grew from a 1913 pep rally at Langdon Hall, where students had gathered the day before the annual football game against the University of Georgia.  Cheerleader Gus Graydon told the crowd, \"If we are going to win this game, we'll have to get out there and fight, because this means war.\"  During the frenzy, another student, E. T. Enslen, dressed in his military uniform, noticed something had dropped from his hat.  Bending down, he saw it was the metal emblem of an eagle that had come loose during his wild cheering.  Someone asked him what he had found, and Enslen loudly replied, \"It's a War Eagle!\"  The new cry was used by students at the game the following day.\nWar Eagle birds\nAuburn has had eight numbered \"War Eagle\" birds, but the first of these only appeared in a legend about the history of the phrase \"War Eagle\".\nWar Eagle I (1892)\nThe mythical War Eagle I has the most colorful story of all of the \"War Eagle\" eagles.  War Eagle I's story begins in the Civil War. According to the legend, a soldier from Alabama during the Battle of the Wilderness came across a wounded young eagle. The bird was named Anvre, and was cared for and nursed back to health by the soldier. Several years later the soldier, a former Auburn student, returned to college as a faculty member, bringing the bird with him. For years both were a familiar sight on campus and at events. On the day of Auburn's first football game in 1892 against the University of Georgia, the aged eagle broke away from his master during the game and began to circle the field, exciting the fans. But at the end of the game, with Auburn victorious, the eagle fell to the ground and died.\nIn 2010, a children's book,\"The War Eagle Story\" by Francesca Adler-Baeder and illustrated by Tiffany Everett was published that favors this version of the story.\nThis legend was originally published in the March 27, 1959, edition of the Auburn Plainsman and was conceived by then editorial page editor Jim Phillips. Though apocryphal, this tale is most often told as the beginning of the association of \"War Eagle\" with Auburn.  Phillips has pressed several recent presidents of Auburn to research the true origin of the battle cry \"before my fictitious story gets carved in stone.\"\nWar Eagle II (1930)\nAuburn's first real, live-eagle confirmed mascot, War Eagle II, was mentioned in the New York Times, which noted then that \"War Eagle\" was already established as Auburn's battle cry. In November 1930 a golden eagle swooped down on a flock of turkeys in Bee Hive, Alabama, southwest of Auburn, Alabama, and became entangled in a mass of pea vines. Fourteen individuals and businesses scraped together $10 and purchased the eagle from the farmer who owned the pea patch. Cheerleaders DeWit Stier and Harry \"Happy\" Davis (who later became executive secretary of the Alumni Association) helped care for the new bird. It was put in a strong wire cage and taken to the Auburn football game against the University of South Carolina in Columbus, Georgia on Thanksgiving Day.\nAuburn, having not won a Southern Conference game in four seasons, was anticipated to lose. However, Auburn took a 25–7 victory over the Gamecocks. The student body concluded that the luck from the eagle's presence—which had been absent from their prior losses—was responsible for the victory that day. The eagle was kept in a cage behind Alumni Hall (renamed Ingram Hall), and cared for by members of the \"A\" Club.\nThe bird's ultimate fate is unknown. Some say it died or was carried away by students of a rival school. Others say it was given to a zoo due to the high cost of upkeep; there is even a rumor that it was stuffed and put in the John Bell Lovelace Athletic Museum.\nOriginally known simply as \"War Eagle\" this bird was retroactively named \"War Eagle II\" with the arrival of War Eagle III.\nWar Eagle III (1960–1964)\nAuburn's third eagle arrived in Auburn in November 1960 after being captured by a cotton farmer in Curry Station, Talladega County, Alabama who found the bird caught between two rows of cotton. The eagle was sent to Auburn by the Talladega County Agent along with a load of turkeys. It was first taken to the Alpha Tau Omega fraternity house where it refused a cold chicken leg but made fast work of a live chicken. After a short stay in one of the Wildlife Department's animal pens, the eagle was moved into a cage built by the Auburn's Delta chapter of Alpha Phi Omega fraternity. This would begin a 40-year period where Alpha Phi Omega was the bird's primary caretaker.\nJon Bowden, a fraternity brother who had previously worked with hawks in Colorado and Missouri, volunteered to serve as the bird's trainer. Formally named War Eagle III, Jon nicknamed the bird \"Tiger.\" In April 1961, Jon and Tiger made their first appearance as trainer and mascot on the baseball diamond. Auburn was playing the Georgia Tech Yellow Jackets and was trailing 10–13 in the eighth inning, but rallied in the ninth and scored 4 runs to win the game.\nThe students were receptive to the new mascot and expressed a concern for a larger cage to house War Eagle III. In 1964, on the morning of the football game against Tennessee, War Eagle III was seen by his trainer, A. Elwyn Hamer Jr., sitting on the ground next to his perch. He had sprung the clip on his leash and escaped. After several days of searching, the bird was found shot to death in a wooded area near Birmingham, Alabama, where the game was being played.\nWar Eagle IV (1964–1980)\nThe Birmingham Downtown Action Committee found another golden eagle in the Jackson, Mississippi zoo and presented it to the Auburn student body in October 1964. This became War Eagle IV, also called \"Tiger.\" She lived in a large aviary—until torn down in 2003 the second largest single-bird enclosure in the country—that had been funded and constructed by the Alpha Phi Omega fraternity and named for A. Elwyn Hamer Jr., War Eagle III's first trainer who had been killed in a plane crash in December 1965.\nThroughout the years, the fraternity provided care and training for the mascot. On the morning of the 1980 Iron Bowl against Alabama in Birmingham, she was found dead by her trainers (Tim Thomason, Charlie Jacks, Bob Ingram, Arnie Cobb, and her former trainer Bill Watts), having died of natural causes at age 22, after having served as Auburn's mascot for 16 years. A marker in memory of War Eagle IV is located on the Auburn University campus near the former site of the aviary.\nWar Eagle V (1981–1986)\nThrough the efforts of War Eagle IV's trainers and with the financial support of the Birmingham Downtown Action, an immature golden eagle was located soon after the death of War Eagle IV and brought to Auburn from Wyoming. The bird arrived in Auburn on March 3, 1981 and was taken to the Veterinary School where she was kept for a short period in order to be examined for any signs of shock from travel. She was then transferred to a small cage until the annual \"A Day\" football game when she was presented to the University by the Birmingham Downtown Action Committee on May 9, 1981.\nThe bird was under the stewardship of the U.S. Government under the provisions of the Endangered Species Act and was on loan to the Auburn University Veterinary School. She was officially named War Eagle V, and nicknamed \"Tiger\" as was tradition. She was approximately two years old at her arrival and was very active on campus. She attended many university functions, Alumni meetings, schools, hospitals, the 1985 Boy Scouts of America National Jamboree, and the 1986 National Order of the Arrow Conference.\nOn September 4, 1986, War Eagle V died of a ruptured spleen at the age of 8 and a half years old. War Eagle V was taken to Auburn's veterinary school the night before by her trainer, Jim McAlarney, who noticed that she was not behaving normally. McAlarney spent the night at the veterinary school while veterinarians made a futile effort to save the bird's life.\nWar Eagle VI (1986–2006)\nThe eagle trainers began working soon after the unexpected death of War Eagle V to find a new golden eagle. The Auburn University Alumni Association and many Auburn alumni contributed to the effort and a new eagle was located at the Tennessee Valley Authority Raptor Rehabilitation Facility in Land Between The Lakes, Kentucky. Trainers made the trip to the facility to receive Auburn's new mascot. The bird originally came from St. Louis, Missouri, where she was seized by Federal agents as part of an illegal breeding operation and brought to Kentucky by wildlife biologist, Robert D. Smith, who managed the Bald Eagle and Osprey programs at Land Between the Lakes and just happened to have a son at Auburn.  Like War Eagle V, she was under the stewardship of the U.S. Government under the provisions of the Endangered Species Act and was on loan to the Auburn University College of Veterinary Medicine. She arrived in Auburn on October 8, 1986 at an age of six years. Like the two eagles before her, she was cared for by the members of Alpha Phi Omega and nicknamed Tiger.\nIn 2000, day-to-day care of War Eagle VI was turned over to the Auburn University Raptor Center, ending the 40-year program of care by Alpha Phi Omega. Shortly thereafter, the bird was moved from the Hamer Aviary to the Auburn University Raptor center. The Hamer Aviary was torn down in the summer of 2003.\nThe tradition of a live eagle flying before Auburn football games began in 2000 with Tiger, a golden eagle also known as War Eagle VI. Under the leadership of Dr. Ronald Montgomery, then Director of the Auburn University Raptor Center (AURC), the center trained and cared for the eagles that took part in this unique pregame ritual. In the years that followed, other eagles housed at the AURC continued the tradition, soaring over the stadium and landing on the field as fans proudly chanted, \"War Eagle.. On February 8, 2002, War Eagle VI flew in Rice-Eccles Stadium as part of the opening ceremonies of the 2002 Olympic Winter Games in Salt Lake City. War Eagle VI was featured the next day on NBC's Today Show.\nIn the summer of 2003, allegations of improper care of the birds by the Auburn University Raptor Rehabilitation Center were leveled by the university administration and by the United States Fish and Wildlife Service. Many of the birds were suffering from diseases and malnourishment. After all investigations were concluded, War Eagle VI was allowed to fly again prior to Auburn home games.\nWar Eagle VI's presence continued to be used throughout her life as a wildlife educational tool.\nOn November 11, 2006, War Eagle VI was officially retired in a pregame ceremony before the Georgia game.  During halftime of the same game, her successor, Nova, was named War Eagle VII.  In her final game as War Eagle VI, Auburn defeated Arkansas State 27–0, finalizing the team's record under War Eagle VI at 174-69-4.  She saw two undefeated Auburn seasons, four SEC titles, and six SEC Western Division crowns.\nTiger continued to make non-flying appearances at Auburn University events and for wildlife education to various organizations until her death on June 18, 2014, at age 34 shortly following cataract surgery.\nWar Eagle VII (2006–2019)\nNova, Auburn's fourteen-year-old golden eagle, was officially named War Eagle VII on November 11, 2006.  He was hatched in the Montgomery Zoo in 1999 and moved to Auburn at six months of age.  Prior to being named War Eagle VII, Nova had already participated in pre-game flights and conservation exhibits throughout the southeast.\nHe is a National Champion as of 2010.\nAs of 2017- Nova was suspended from flight activities due to a diagnosis of chronic heart disease.  Auburn University would instead use Spirit, a bald eagle, in place of Nova for the 2017-18 Football Season\nWar Eagle was named the #4 mascot in a poll by Foxsports.\nWar Eagle VIII (2019–present)\nUpon receiving War Eagle VII's diagnosis in 2017, a three-year-old golden eagle named Aurea was tabbed as his eventual successor. She made her stadium debut in 2018 and was officially named War Eagle VIII in a Board of Directors meeting on November 22, 2019,\n\"War Eagle\" as Auburn's fight song\n\"War Eagle\" is the university's official fight song. It is played before and after games, as well as immediately after Auburn scores by the Auburn University Marching Band. (Auburn plays \"Glory, Glory, to Ole Auburn\" after an extra point.) In addition, the Samford Carillon, located in the clock tower of Samford Hall, rings the fight song every day at noon.\n\"War Eagle\" was written in 1954 and 1955 by New York songwriters Robert Allen and Al Stillman. The \"Auburn Victory March\" had been the fight song for decades. The Jordan Vocational High School Band of Columbus, Georgia, under the direction of Bob Barr first performed the song during Auburn's 1955 season-opener versus Chattanooga.\nAuburn University currently does not hold ownership of the copyright for \"War Eagle\". The Auburn Alumni Association did not renew it and the copyright is currently held by the estate of Robert Allen, one of the songwriters who composed it. Therefore, companies selling products with \"War Eagle\" being played must acquire licensing from the estate as well as Auburn University. There is a movement within the university to regain the ownership of the song.\nSee also\n* List of individual birds\nReferences\nExternal links\n* [http://www.vetmed.auburn.edu/raptor/ Auburn University Raptor Center]\n* [https://www.aphio-delta.org/ Alpha Phi Omega, Delta Chapter] - Caretakers of the War Eagle program from 1960 to 2000.\n* [http://band.auburn.edu/aumb/ Auburn University Marching Band]"
    }
  ]
}