{
  "content": [
    {
      "type": "text",
      "text": "# War of Bohemian Succession (1125–1126)\n\n)\n| date              = 1125–1126\n| place             = Chlumec (Ústí nad Labem District), Duchy of Bohemia\n| result            = Bohemian victory\n| combatant1        =  Duchy of Bohemia\n| combatant2        =  Holy Roman Empire\n* Kingdom of Germany\n| commander1        = Soběslav I of Bohemia\n| commander2        = Lothair III of Germany Otto II the Black\n| strength1         =\n| strength2         =\n| casualties1       = Battle of Chlumec:3 killed\n| casualties2       = Battle of Chlumec:270–500\n}}\nThe War of Bohemian Succession (1125–1126) was a war between the Imperial Forces of the Holy Roman Empire and the Duchy of Bohemia about the succession in the Duchy of Bohemia.\nBackground\nSince Duke Bretislaus I of Bohemia had implemented the inheritance principle of agnatic seniority in the 11th century, the order of succession in Bohemia, many rivalling scions of the ramified Přemyslid dynasty waged war against each other. The claimants to the Prague throne sought for formal recognition by the Holy Roman Emperor, when in actuality, the accession required the active support by the Bohemian nobility.\nThe Přemyslid duke Vladislaus I of Bohemia, ruling since 1109, likewise had to struggle to consolidate his authority, defying the claims raised by his brother Bořivoj II who had reached his enfeoffment by Emperor Henry IV in 1101. When Vladislaus died in 1125 his succession was disputed among his surviving brother Soběslav I and his Moravian cousin Otto II, duke in Olomouc and Brno. Otto could appeal to the agnatic seniority principle, and he also reached the support of Vladislaus' widow Richeza of Berg and King Lothair III.\nBattle of Chlumec\nIn November 1125 King Lothair met with Bavarian nobles in Regensburg. They settled for a campaign into Bohemia in favour of Otto the Black who, according to the chronicler Otto of Freising, had offered a considerable sum of money. The Bohemian nobles received an ultimatum either to expel Soběslav or to face a punitive expedition.\nDuke Soběslav I, represented by negotiators in Regensburg, prepared for war. He made the Bohemian aristocracy rally to his support, strongly referring to the legacy of Saint Adalbert of Prague and Duke Wenceslas. In the winter of 1125–26 he had defensive works and encampments erected along the Kulmer Steig route, the presumed gateway of Lothair's troops. As the thaw set in, Lothair on February 18 crossed the Bohemian border at the Nakléřov Pass with his army and met Sobeslav's troops either near Chlumec or in the vicinity of the Lotarův vrch (\"Lothair Mountain\") near Jílové. The exact location of the battle is not known.\nA vanguard of about 200 heavy armoured knights commanded by Otto the Black was immediately attacked by Bohemian forces in a narrow valley, while the main army under King Lothair found itself entrapped with no option to withdraw back to the mountain pass. The battle ended in a crushing defeat of the Imperial troops. Otto fell in action, and Lothair was captured with many of his liensmen like Margrave Albert the Bear and Landgrave Louis I of Thuringia. Soběslav won a convincing victory and released his captives on the condition of his investiture.\nAftermath\nSoběslav enfeoffment by King Lothair ended the state of war. Though formally the victor paid homage to the defeated, the duke strengthened his position and was able to affront all threats to his rule in Bohemia until his death in 1140. To commemorate his victory, he had a rotunda built on top of the Říp Mountain and consecrated by the Olomuc bishop Jindřich Zdík, one of the oldest Czech national monuments.\nExternal links\n*\nSources"
    }
  ]
}