{
  "content": [
    {
      "type": "text",
      "text": "# War Brides (1916 film)\n\n| starring       = Alla NazimovaCharles Bryant\n| music          = Robert Hood Bowers\n| cinematography = J. Roy Hunt\n| editing        = James MacKaye\n| distributor    = Selznick Pictures\n| released       =\n| runtime        = 72 minutes\n| country        = United States\n| language       = Silent (English intertitles)\n| gross          = $300,000\n}}\nWar Brides is a lost 1916 American silent war drama film directed by Herbert Brenon and starring Alla Nazimova. The film marked Nazimova's debut in motion pictures.\nThe film's lost status makes it a sought-after title.\nPlot\nThe film was based on the eponymous one-act play by the poet, playwright, and suffragist Marion Craig Wentworth (1872–1942). A newlywed soldier is sent to the front and killed. When his young widow learns of his death she considers committing suicide, but decides against it because she is pregnant. The King of her country (unnamed in the original; Germany in the later version) decrees that women must bear more children to fight in future wars. Soon afterwards, as the King is passing through her village, the pregnant widow leads a procession of women to protest the war. Soldiers try to hold her back, but she manages to come face to face with the King, and kills herself in front of him. The title card reads, \"If you will not give us women the right to vote for or against war, I shall not bear a child for such a country!\"\nCast\n*Alla Nazimova as Joan\n*Charles Hutchison as George\n*Charles Bryant as Franz\n*William Bailey as Eric\n*Richard Barthelmess as Arno\n*Nila Mac as Amelia (*Nila Mack)\n*Gertrude Berkeley as The Mother\n*Alex Shannon as The King\n*Robert Whitworth as Lt. Hoffman\n*Ned Burton as Captain Bragg\n*Theodora Warfield as Minna\n*Charles Chailles as A Financier\nReception\nWar Brides was one of the most successful plays of 1915. It opened in January at B.F. Keith's Palace Theatre in New York City, with Alla Nazimova in the lead role, and toured the country for several months. The play was so much in demand that a second production toured the South, with Gilda Varesi in the lead.\nIn 1916 the play was made into a silent film, also starring Nazimova in her first onscreen role. The film did very well in the United States, bringing the studios a profit of $300,000, and was widely acclaimed by critics. Because of its pacifist message, it was banned in some cities and states. For example, while it had been showing in Maryland, once the United States entered the war the film was banned as its pacifist message might affect military recruitment. In 1917 it was withdrawn from circulation on the grounds that \"The philosophy of this picture is so easily misunderstood by unthinking people\". Later that year the producer, Lewis Selznick, had the film edited to give it an anti-German slant, and re-released it to American theaters. It was not shown in any other Allied countries.\nReferences\nFurther reading\n*\nExternal links\n*\n*[http://www.allmovie.com/movie/war-brides-v115952 AllMovie.com]"
    }
  ]
}