{
  "content": [
    {
      "type": "text",
      "text": "# War Department Halt railway station__disambig_1\n\nThe War Department halt was an informal railway station on the Romney, Hythe and Dymchurch Railway in Kent, England. Over the 15 years that the station was open, its location is believed to have moved several times. Details are scarce as this was a secret military installation, but the end of the War Department branch line moved as building work moved onto new stages. When the installation closed in 1945 the railway company took over the line for freight shipment of ballast. Again, the end point of the line changed several times as the exact location of extraction of ballast changed, until closure of the branch in 1951. The locations of the halt are now under water owing to subsequent commercial extractions and flooding of the ballast pits.\nMilitary origins\nIn 1929 a branch line was constructed curving away inland from south of Romney Sands station (then known as Maddieson's Camp). This line was constructed at the request of the War Office and provided a train service to a secret military installation working on acoustic aircraft detection at Denge. Their work was highly successful, but almost immediately replaced by the superior invention known as radar.\nOperation\nThe War Department operated their own locomotive, which was stabled at Hythe engine shed, and for which they had running rights for the full length of the railway. This is the only independently owned locomotive to have seen long-term service on the railway. They operated daily staff trains between Hythe station and the end of the branch line. As this was always known as the War Department Line, its terminal stop was the War Department Halt.\nPost-war use\nAfter World War II the War Office abandoned both the project and the line. The railway company took over the War Department locomotive (assigning it to the Permanent Way Department) and also the War Department Line, using it for freight-only services, transporting shingle to Hythe where it was transferred to road transport. As a freight-only service, the War Department halt may be said to have closed at the end of the war, as passengers no longer alighted at this location. However, freight-only traffic continued on the line until 1951. The final use of the branch was for the temporary storage of a train whose locomotive had failed in service nearby, thus allowing the continued use of the single-track mainline by other trains. This incident was in the autumn of 1951, and the branch line's tracks were lifted a few weeks later as part of winter engineering works, 1951–52.\nReferences"
    }
  ]
}