{
  "content": [
    {
      "type": "text",
      "text": "# War in Gotland (1313)\n\nSweden\n| combatant2        =  Gotlanders\n| commander1        =  Birger Magnusson\n| commander2        = Unknown\n| strength1         = Unknown\n| strength2         = Unknown\n}}\nThe War in Gotland (1313), also known as the Tax war against the Gutes, was a short lived conflict fought between the forces of the Swedish King Birger, and the people of Gotland. The primary cause of the war was the high taxes imposed by Sweden on Gotland, which fueled anger and later resulted in the Gotlanders refusing to pay taxes.\nBackground\nin 1313, the king of Sweden, Birger Magnusson, went on an expedition towards Gotland in order to increase taxes there. The Gotlandic peasants however refused to pay more taxes and armed themselves against the Swedes.\nBattle of Röcklinge backe\nAt Röcklinge backe, the Swedish and Gotlandic forces met, and according to the Eric Chronicle, a large battle took place where the Gotlanders won a crushing victory and Birger was forced to flee back to his ships. It is also said that the king was close to death during the battle. He was later found hiding under a Hazel bush, but he was later beaten, captured, and taken back to Visby as a prisoner. After the war, the chronicle claims that he was no longer receiving any taxes from Gotland, however, the fact that the chronicle was written as early as the 1320s has put this depiction into question.\nAftermath\nThe exact outcome of the war is debated, in Olaus Petri's Swedish chronicle, which was written in the 16th century, it is said that the taxes imposed on the Gutes was increased to 110 marks of lead silver and that the ledungslam was raised to 90 marks of lead silver, which was imposed both on the burghers in Visby and the Gutes living on the countryside. The Gutes were also forced to hand over a third of any valuable ore they find on the island, which is considered a victory for Birgers regal ideas.\nAnother proof of Birger's war being successful is a letter that was sent to \"the elder of the island of Gotland and its congregation\". The letter, which was dated August 25, 1320, contains good news: the Swedish National Council had decided to cancel the extraordinary taxes that King Birger had imposed on the Gutes.\nReferences"
    }
  ]
}