{
  "content": [
    {
      "type": "text",
      "text": "# War (Marvel Comics)\n\nWar is the name of four fictional characters, who are supervillains appearing in American comic books published by Marvel Comics. All are members of the Four Horsemen of Apocalypse: Abraham Kieros; the fifteenth-century incarnation of War (real name unknown); the mutant Gazer; and the First Horseman War. The title has also been held by the Hulk, Deathbird, and Colossus.\nAbraham Kieros\nPublication history\nWar first appeared in X-Factor #11 (December 1986), and was created by Louise Simonson and Walter Simonson.\nThe character subsequently appears in X-Factor #15 (April 1987), #17 (June 1987), #19 (August 1987), #22–25 (November 1987–February 1988), Daredevil #252 (March 1988), X-Factor #26–27 (March–April 1988), X-Factor #84 (November 1992), The Uncanny X-Men #294–295 (November–December 1992), and Wolverine (vol. 2) #147 (February 2000).\nWar appeared as part of the \"Apocalypse's Horsemen\" entry in the ''Official Handbook of the Marvel Universe Update '89'' #1.\nFictional character biography\nWar (Abraham Kieros) was a young Vietnam War veteran who was paralyzed in combat. He was kept in a hospital and placed in an iron lung, but felt as though he was betrayed and forgotten by his country. Apocalypse appeared to him one day and offered him the ability to move and to get revenge on those who had tossed him aside. He accepted the offer and was indeed given the ability to move again, which allowed him to use his mutant power—the ability to create explosions through kinetic contact, usually by clapping his hands together—in Apocalypse's service as his Horseman of War. He often bickered with fellow Horseman Famine and disliked her total lack of obedience.\nWar liked to take control of situations and during their first confrontation with X-Factor, attempted to lead the other Horsemen. Famine and Pestilence refused to obey his orders and flew off to do their own business. Soon after, Death took over leadership and the Four Horsemen learned to ride as one. During the attack on Manhattan, War immediately attacked Cyclops and was later teleported back to the ship by Apocalypse, where he fought several more X-Factor members. He was eventually defeated by Iceman. Apocalypse then grabbed War and fled.\nLater, during the \"X-Cutioner's Song\" story arc, War attacked Colossus and Iceman, but soon fled after Caliban grabbed Jean Grey and Cyclops, handing them over to Apocalypse, who was really Mister Sinister in disguise. The X-Men sought out the Horsemen and War was presumably defeated in combat.\nMuch later, War appeared in an hospital, once again paralyzed from the neck down, apparently abandoned by Apocalypse who stripped him of his powers. Archangel, who had gained newfound powers and had been searching for Kieros, healed him of his wounds, giving him hope to start over with a new life.\nPowers and abilities of Abraham Kieros\nAbraham Kieros is a mutant with the power to create explosions in his immediate area by clapping his hands. He does so by harnessing the minor kinetic force created when his hands strike each other, amplifying it to a significant degree, and redirecting it spatially so that it strikes and affects some other object in his line-of-sight, causing an explosive release of force. The limits of the range in which his power is effective have not yet been determined.\nWhile a servant of Apocalypse, War rode a robot mount that resembled a demonic quadruped beast, could travel on land or fly through the air, and was capable of teleportation.\n15th century incarnation\nNot much is known about this incarnation of War. He was chosen by Apocalypse in the fifteenth century to become his horseman and lead his army, the Riders of the Dark. This army was so fierce and powerful that most people presumed it was just a myth used to scare soldiers before their first battle. It was no myth at all, and it precisely was what people thought it was, fierce and strong. In most of their battles, the only soldier who had to fight was War, who would single-handedly defeat hordes of men just by himself.\nIn 1459, the Riders of the Dark appeared in Romania where Vlad Ţepeş' army was fighting against the Ottomans and emerged victorious. Unfortunately for Vlad (who would become Dracula), War defeated Dracula's army. The survivors fled for their life, abandoning Dracula on the field who stood his ground and faced War but ultimately fell.\nGazer\nGazer was a mutant astronaut, who after being depowered on M-Day, went out into space to die. Instead he was transported onto Apocalypse's ship and made to battle for the title of War, one of the Horsemen of Apocalypse. With Ozymandias' intervention, he was victorious, and through a torturous process became the newest incarnation of War.\nGazer was an astronaut permanently stationed alone on a NASA observation space station, due to the unusual metabolism he possessed as his mutant power, whereby he could absorb harmful radiation and process it to gain sustenance. He first encountered the X-Men when they used his station as a staging post for an attack on a group of non-sentient aliens which induced harmful emotions in humans.\nShortly afterwards, he lost his powers on M-Day, along with 90% of mutants. Succumbing to radiation sickness, he began to imagine that an experiment on the effects of radiation sickness was sentient (calling it \"Phantom Torso\"), and it constantly advised him to call NASA to ask for a return home. However, he remained until an alien resembling Doop, which he had built up to himself as his last hope, passed by his station on its way to crash-landing on Earth near Polaris, who had seen it in space and had a similar reaction.\nThereafter, \"Phantom Torso\" stopped \"talking\" to him, and he put on a spacesuit and went out into space to die. However, he was teleported to Apocalypse's sphinx-like ship, and forced to battle Dr. Foster, a human archeologist who had stumbled upon Apocalypse's tomb, for the \"right\" to become War, Horseman of Apocalypse. Gazer would have lost the battle if it were not for Ozymandias, Apocalypse's servant. Ozymandias told Gazer that he would owe him and one day the scribe would become the master.\nGazer went through a terribly painful process where his skeleton was stretched, the former X-Man Sunfire, who was also chosen by Apocalypse to be a Horseman, tried to save him but Gazer had already been under Apocalypse's mind-control by then and helped recapture Sunfire.\nAs War, Gazer was sent to battle the X-Men and Sentinel Squad O*N*E. Upon returning to Apocalypse's sphinx, he was approached by Ozymandias who wanted his debt repaid. War, no longer Gazer, did not fulfill his oath and instead revealed the truth to Apocalypse about Ozymandias' treachery.\nDuring a heated battle against the X-Men, Ozymandias finally took his vengeance, stabbing Gazer from behind with a sword.\nPowers and abilities of Gazer\nBefore M-Day, Gazer, in addition to his unusual appearance, could absorb radiation at frequencies and levels which induce radiation sickness in normal humans and photosynthesize it as food.\nAfter his depowering on M-Day, he was taken by Apocalypse and transformed to possess superhuman strength, enhanced durability, and the ability to absorb and channel solar energy as blasts of fire through his eyes. He also carried a spiked mace which flashed with electricity-like bursts and rode a robotic horse-like flying mount.\nWar (First Horseman of Apocalypse)\nWar is one of four children of Apocalypse and Genesis, born and raised on Okkara. She and her siblings grow up to be the first Horsemen of Apocalypse and fight against the Brood in Ancient Egypt. When the forces of the dimension of Amenth invade Earth and split Okkara into Krakoa and Arakko, War, along with her mother, her siblings, all Okkaran mutants, and the newly created island of Arakko, is voluntarily sealed away in Amenth to stop the invasion while her father Apocalypse remains on Earth.\nDuring the millennia of fighting against the Amenthi hordes, War has a son who is later known as Summoner with a mutant named Bracken. Bracken is killed by the mutant Solem in a duel, leading to War imprisoning the latter.\nAfter Genesis becomes Annihilation's new host, Arakko is subjugated and united with the forces of Amenth. War and her siblings are sent to Otherworld to destroy the province of Dryador and lay siege to the Starlight Citadel. When Summoner successfully lures Apocalypse to Otherworld, the Horsemen attack and severely wound their father. When Saturnyne intervenes and arranges the X of Swords tournament, War is chosen as a swordbearer for Arakko and travels with her sister Pestilence to recruit their aunt Isca the Unbeaten, the mercenary Pogg Ur-Pogg, and, to War's fury, Solem.\nAt the banquet prior to the tournament, War attempts to poison Wolverine, but inadvertently poisons Cypher instead. White Sword heals Cypher, calling War's ploy cowardly.\nWar's first challenge in the tournament is against Solem in a contest of who can cut off a limb from their opponent first. Solem calls in a favor owed to him by Wolverine and asks the Krakoan mutant to take his place, telling War that Wolverine had killed her son Summoner in a previous challenge to enrage her before departing. War outmatches Wolverine in combat (though he had been poisoned by Death) but is unable to cut off his head due to his adamantium skeleton. Wolverine cuts off her left hand (which she later regenerates) and wins the challenge, though the victory goes to Arakko since he was standing in for Solem. After the tournament concludes and Annihilation is defeated, War and her siblings (excluding Death) return to Amenth with their parents.\nWhen Genesis incites a civil war on Planet Arakko, War joins her mother there and fights against Storm and her allies. After the war ends, she joins her mother and her brother Famine in exile on Phobos.\nPowers and abilities of War\nWar is an Omega-level mutant with the power to psionically manipulate air molecules and excite them to create flame. Her head is constantly burning and she is able to create new body parts from her flames. War is also very long-lived, having been alive for thousands of years.\nIn combat, she wields Vermilion, the Red Sword of War. According to Apocalypse, she was the best Horseman of War who ever served him, with all her successors being \"underwhelming\" by comparison.\nOther versions\nAge of Apocalypse\nAn unidentified incarnation of War with powers similar to Abraham Kieros appears in \"Age of Apocalypse\" as a member of Apocalypse's first wave of Horsemen. He was defeated by Mikhail Rasputin when Apocalypse invaded Russia and ultimately killed by Nemesis.\nMutant X\nAn incarnation of War, presumably Abraham Kieros, appeared in the Mutant X reality. He constantly bickered with Death, but they had a mutual respect for each other.\nIn other media\nTelevision\n* The Abraham Kieros incarnation of War appears in X-Men: The Animated Series, voiced by James Millington. Another incarnation of War who served Apocalypse in ancient times made a non-speaking cameo later in the series.\n* In X-Men: Evolution, Magneto (voiced by Christopher Judge) is made the Horseman of War after Apocalypse's awakening.\nFilm\nA version of War with powers similar to Abraham Kieros' appears in X-Men: Apocalypse, portrayed by Fraser Aitcheson. This incarnation served Apocalypse in Ancient Egypt. Later in the film, Magneto (portrayed by Michael Fassbender) is chosen by Apocalypse as his Horseman of War.\nReferences\nExternal links\n*\n*"
    }
  ]
}