{
  "content": [
    {
      "type": "text",
      "text": "# War of the Peters\n\n|caption=\n|date=June 2000 – August 2001\n|place=Unity State, Sudan\n|territory=\n|result=Ceasefire\n|combatant1=  SPDF SSDF\n|combatant2=  SPLA-Mainstream\n|commander1=  Peter Par Jiek Paulino Matip Nhial\n|commander2=  Peter Gadet\n|strength1=\n|strength2=\n|casualties1=\n|casualties2=\n|casualties3= Many killed,  60,000 displaced\n| campaignbox =\n}}\nThe War of the Peters was a conflict primarily fought between the forces of Peter Par Jiek and Peter Gadet from June 2000 to August 2001 in Unity State, Sudan. Though both were leaders of local branches of larger rebel groups that were involved in the Second Sudanese Civil War (the SPDF and SPLA, respectively), the confrontation between the two commanders was essentially a private war. As Par and Gadet battled each other, the Sudanese government exploited the inter-rebel conflict as part of a divide and rule strategy, aimed at weakening the rebellion at large and allowing for the extraction of valuable oil in Unity State. In the end, Gadet and Par reconciled when their respective superiors agreed to merge the SPDF and SPLA.\nBackground\nFollowing its independence in 1956, the Sudan had suffered from numerous internal conflicts over political, ethnic, economic, and religious issues. In 1983, revolutionaries and separatists from the country's marginalized south launched an uprising against the government which was traditionally dominated by elites from the north. The Second Sudanese Civil War had begun, and fighting spread across southern, eastern and western Sudan. The most prominent southern rebel group was the \"Sudan People's Liberation Army\" (SPLA) under the leadership of John Garang. As the war escalated and spread, the SPLA grew increasingly powerful and overran much of southern Sudan. Despite these successes, the SPLA faced major internal and external opposition. Many southern Sudanese outright opposed the group for a variety of reasons, and instead sided with the government or set up rival insurgent movements. In addition, Garang's leadership style caused tensions within the SPLA. He was charismatic, and a capable military commander, but also brutal and autocratic, suppressing and even executing critics.\nTwo prominent SPLA commanders, Riek Machar and Lam Akol, attempted to overthrow Garang in an unsuccessful coup in 1991. The SPLA consequently split into warring factions, and the Sudanese government exploited this by employing a divide and rule strategy. It occasionally supported Machar's group (SPLA-United) so that it could fight against and weaken Garang's faction (SPLA-Mainstream). In the next decade, alliances and militias formed and broke up again, while warlords carved out their own domains. The Sudanese government increasingly focused on clearing areas in the south for oil extraction instead of winning the war, as it was in desperate need of cash. As time went on, oil money became crucial for the Sudanese war effort. One of the centers of oil production was Unity State, also known as Western Upper Nile. To secure the oil wells and pipelines and open land for oil extraction, the government often employed southern militias. These paramilitaries knew the terrain, were more expendable than Sudanese Armed Forces (SAF) units, and allowed the government to frame the civil war as anarchic tribal infighting to deflect criticism of its own governance.\nThe most prominent pro-government paramilitary group of southern Sudan was the SSDF. The SSDF was an umbrella organization for several armed factions, including Machar's loyalists and the troops of warlords like ex-Anyanya II leader Paulino Matip Nhial. It proved to be unstable and affected by internal rivalries, and gradually broke apart. Different SSDF factions already fought each other in 1997 and 1998, and the government allowed it to happen as it mistrusted most of the SSDF anyway. The combat between the pro-government militias was fuelled by a desire of the warlords to control the oil-rich areas and thereby increase their revenue. Matip managed to oust Machar's followers and other rivals from the valuable region around Bentiu, drawing the latter's ire. At the same time, the regime intensified efforts to take full control of the Block 5A oilfields in Unity State. These were held by Machar's forces, and he protested that the oil fields should remain under his control. The government responded by launching a campaign to drive away civilians and Machar's troops from drilling locations in Block 5A such as Thar Jath. Spearheaded by the SAF, northern militias, and Matip's force, entire tracts of land were depopulated. In response, Machar's local loyalists under Tito Biel and Peter Par Jiek aligned with the SPLA and counterattacked. A chaotic and brutal campaign ensued, as the military and numerous militias fought over control of the oil fields.\nIn September 1999, most of Matip's militia revolted under Peter Gadet, as they were upset how the government was using local Nuer militias (like themselves) against other Nuer, }} while excluding them from the oil revenues. This was a major setback for the government. Gadet was a highly competent commander, and quickly captured the arms depot at Makien military base. He subsequently unified his force with the militias of other regional warlords such as Biel and Par to form the \"Upper Nile Provisional United Military Command Council\". The rebel alliance proceeded to capture several important oil wells, and the towns of Buoth, Rier, and Tan near Bentiu.\n(pictured 2012) to southern Sudan.]]\nThe insurgents consequently agreed to split Unity State. Gadet and Par were assigned territories mostly in accordance to the ethnic groups which supported them: Gadet, an ethnic Bul Nuer, got Mayom and Wangkei (inhabited by Bul Nuer), while Par, a Dok Nuer, was granted Bentiu, Thar Jath, Leer, and Adok (territory of the Dok, Jikany, Jagei, and Leek Nuer). The \"Upper Nile Provisional United Military Command Council\" alliance was quite successful, and the united forces of Gadet and Par defeated the SAF and Matip's militia in several battles. This adversely affected government control over Unity State, and reduced local oil production. The situation changed once again in February 2000, when Machar openly broke with the government, fully left the SSDF, and founded the SPDF rebel group. This development resulted in new tensions among the insurgents of Unity State. Machar loyalists like Par and Biel joined the SPDF, while Gadet had officially sided with SPLA-Mainstream – Machar's declared enemy. }} Limited clashes between Gadet and some Machar loyalists, though not between Gadet and Par, broke out soon after. Despite the tensions and opposing political alignments, cooperation mostly continued until the Sudanese government launched another major offensive in Unity State in April 2000. This offensive pushed the rebel alliance to the breaking point. Old rivalries came to the fore, fuelled by the government's divide and rule strategy.\nHistory\nStart of the conflict\n(pictured 2012) ]]\nThe cooperation between Peter Par and Peter Gadet broke down in June–July 2000, as their militias began to fight each other. Who was responsible for the outbreak of hostilities is unknown, as both sides blamed each other. The SPDF stated that its forces were attacked by Gadet loyalists \"for no reason\" in Nimne on 26 June 2000. The SPLA argued that Par had executed 22 fighters loyal to Gadet in December 1999 and June 2000, and forged an alliance with the Sudanese government. This had allegedly forced the SPLA to act. Tribal tensions between Dok and Bul Nuer may have contributed to the conflict. At least some locals framed the Par-Gadet fighting as Dok-Bul tribal war.\nIn any case, Gadet launched a surprise attack on Nimne on 26 June or 7 July, resulting in open war. The conflict subsequently became known as \"War of the Peters\". As Par and Gadet clashed with each other, the Sudanese government eagerly exploited the situation. It provided ammunition to Par as long as he fought against the SPLA and left pro-government troops alone. Most of the SPDF officially denied the reports of government support: Machar publicly claimed that the ammunition had come from secret stockpiles, and another SPDF commander stated that they had bought it from Baggara tribesmen. Taban Deng Gai admitted that Par had received one arms shipment from the government \"to survive\". In fact, cooperation between Par and the government increased in intensity. Matip's SSDF militia began to openly fight alongside Par's men, and the latter also guarded government installations, especially the oil extraction facilities of Thar Jath in Block 5A. The SPDF even protected the road to Thar Jath, allowing Lundin Petroleum to access a new drilling site in Block 5A. Regardless, Par officially remained in opposition to the government.\nEscalation and conclusion\nBetween July and August 2000, Par joined forces with Matip's militia and attacked Gadet's forces in the area between Nimne and Nhialdiu. They gradually pushed the SPLA westward, attacking Wicok, Buoth, Boaw, and Koch in succession. Most of Gadet's troops were forced to flee across the Jur River, and only Buoth remained under SPLA control. At the same time, Gadet was resupplied by the SPLA central command, and recruited new troops, including at least 400 child soldiers. He launched a counter-offensive in August 2000, and had retaken most of the lost ground by late September. When they captured Koch, Gadet's men killed two health workers and stole the local clinic's medical supplies. Meanwhile, tensions grew between Par and SPDF co-commander Tito Biel. To avoid war between them, Machar sent Biel to Maiwut County where he was supposed to rally Jikany Nuer to the SPDF's cause.\nThe War of the Peters was brutal, led to enormous destruction, and displaced up to 60,000 people. Many civilians fled to Bahr el Ghazal, and although hunger and disease spread among the refugees, most subsequently chose to stay as their old homes had been destroyed. Both sides used scorched earth tactics, and completely destroyed many settlements, including Nhialdiu. Schools were also targeted, and the militants killed, raped, and abducted many civilians. The war also increased lower-level tribal conflicts between the Bul and Dok Nuer. The region became too dangerous for the delivery of humanitarian aid, worsening the civilians' suffering. The Sudanese government and the oil companies benefitted greatly from the War of the Peters, as the inter-rebel fighting allowed them to boost the oil extraction. In turn, the government was able to increase its defense expenditure and acquire new weaponry for the civil war.\nGadet's troops attacked the United Nations relief hub of Nyal inside SPDF territory in February 2001. This almost resulted in a further escalation, as the attack was regarded as breach of an earlier peace agreement between Nuer and Dinka militias that was still partially in effect. In addition, this raid caused tensions in Par's militia. Nyal was traditionally Nyuong Nuer territory, and the Nyuong fighters of Par's force believed that the Dok and Bul were spreading their destructive tribal conflict to Nyuong lands. As a result, a shootout between Nyuong and Dok militants erupted at Par's base in Nyal in early May 2001. Gadet launched another major raid against Bentiu, a center of the regional oil infrastructure, on 8 June 2001. The SPLA-Mainstream used the occasion to warn oil companies to withdraw from Sudan, threatening that they were regarded as military targets by the rebels. The War of the Peters continued until August 2001, when Par and Gadet agreed to a ceasefire. A few months later, Machar came to an understanding with the SPLA leadership and agreed to merge the SPDF with SPLA-Mainstream, whereupon Par and Gadet signed a final peace agreement in Koch in February 2002. Par and his faction joined the SPLA, and he and Gadet formally merged their armies. In contrast, Tito Biel was opposed to joining SPLA-Mainstream, and defected to Matip's militia.\nAftermath\nThe restoration of a rebel alliance in Unity State resulted in growing insecurity in the Block 5A oilfield. Lundin Petroleum suspended operations at Thar Jath, forcing the government to launch new costly offensives in Unity State in 2002. The offensives proved to be successful enough to serve as a model for other military operations. Fighting continued, and allegiances continued to shift in Unity State. In particular, Gadet would play out the SPLA and the government against each other to gain power, and eventually fully defected back to the pro-government forces. The Second Sudanese Civil War ended in 2005, and South Sudan became independent in 2011. Many issues of the conflict remained unresolved, and most southern warlords such as Gadet continued to maintain their private armies. The warlords occasionally revolted, and South Sudan remained politically unstable. The country descended into another civil war in late 2013. Par and Gadet died during this conflict: The former was killed fighting against his former superior, Machar, while the latter died after a heart attack.\nNotes\nReferences\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}