{
  "content": [
    {
      "type": "text",
      "text": "# Waratah, Tasmania\n\n| pushpin_label_position = right\n| lga      = Waratah-Wynyard Council\n| postcode = 7321\n| timezone = AEST\n| utc      = +10\n| timezone-dst= AEDT\n| utc-dst  = +11\n| pop      =\n| maxtemp = 12.3\n| mintemp = 3.6\n| rainfall = 2162.8\n| location1= Burnie\n| dist1=62.9\n| dir1=SSW\n| location2= Devonport\n| dist2=106\n| dir2=SW\n| location3= Launceston\n| dist3=186\n| dir3=W\n| location4= Hobart\n| dist4=354\n| dir4=NW\n| stategov = Braddon\n| fedgov   = Braddon\n}}\nWaratah is a locality and town in North Western Tasmania adjacent to Savage River National Park. The town was constructed to support a tin mine at Mount Bischoff. It is built at the top of a waterfall, and water was diverted from the stream to provide water for mine sluicing and processing. At the , Waratah had a population of 249. It was also the first town in Australia to have electric street lights in 1886.\nHistory\nTin was discovered at Mount Bischoff by James \"Philosopher\" Smith in 1871. The mine operated successfully at first. The easy ore was all extracted by 1893 when sluicing was discontinued. Mining continued opencut on the face of the mountain, and underground. The underground mine closed in 1914, but surface mining continued for some time before it also ceased after the price of tin slumped in 1929. The mine was reopened by the Commonwealth Government in 1942 to support the war effort, but it finally closed in 1947.\nIt was the mine that produced power for 400 incandescent streetlights in 1886.\nMount Bischoff Post Office opened on 1 September 1874 and was renamed Waratah in 1882.\nIn the vicinity of the locality, a number of smaller mines worked at the same time as the Mount Bischoff workings. Mount Magnet silver mine was connected by the Mount Magnet Tramway within 10 miles south west of the town.\nPolitics\nAt the 2007 Australian federal election, the polling place at Waratah Primary School registered a total of 148 votes. 72 votes (49.32%) were cast for the Labor candidate Sid Sidebottom, 54 votes (36.99%) were cast for the Liberal candidate Mark Baker and 17 votes (11.64%) were cast for Greens candidate Paul O'Halloran.\nClimate\nWaratah has a cold Oceanic climate (Köppen climate classification: Cfb), particularly cool by Australian standards and bordering on a Subpolar oceanic climate (Cfc). It is one of the coldest and wettest localities in Tasmania. The town has a high frequency of cloudy days and maximum temperatures often fail to get above , even in summer. Snow is common through the winter and spring, sometimes occurring in summer, and heavy rainstorms can be experienced throughout the year. Extremes have ranged from 32.8&nbsp;°C (91.0&nbsp;°F) to -5.5&nbsp;°C (22.1&nbsp;°F). Waratah's wettest month on record was May 1923 with 644.8&nbsp;mm (25.3&nbsp;in) of rain recorded.\n|date=March 2013}}\nReferences\nFurther reading\n* Haygarth, Nic Baron Bischoff: Philosopher Smith and the Birth of Tasmanian Mining 2004.\nExternal links\n* [http://www.warwyn.tas.gov.au/site/page.cfm Waratah-Wynyard council page]"
    }
  ]
}