{
  "content": [
    {
      "type": "text",
      "text": "# Waratah Lahy\n\n| birth_place      =\n| death_date       =\n| death_place      =\n| resting_place    =\n| resting_place_coordinates =\n| nationality      =\n| residence        =\n| education        =\n| alma_mater       = Australian National University\n| known_for        = Painting\n| notable_works    =\n| style            =\n| home_town        =\n| movement         =\n| spouse           =\n| partner          =\n| awards           =\n| elected          =\n| patrons          =\n| memorials        =\n| website          =\n| module           =\n}}\nWaratah Lahy (born 1974) is an artist and art teacher based in Canberra, Australia.\nIn 2007, she completed a Doctorate of Philosophy (Visual Arts) at the Australian National University's School of Art. Her thesis explored the depiction of Australian culture.\nExhibitions\nSolo exhibitions\nLahy's first solo exhibition was Eleven ships at Canberra Contemporary Art Space (October 1999), with works painted on blankets, addressing notions of Australian identity and comfort. Sonia Barron reviewed the exhibition as \"...questioning, rather than conclusive.\"\nHer exhibition Crowd: Australian culture at the Canberra School of Art (2003) included silhouettes cut from beer cans, and was reviewed positively for its quirkiness and humour.\nGroup exhibitions\nLahy showed oils on linen in Stitched up and going off at Canberra Contemporary Art Space (August–September 2000).\nHer bottle-top miniatures in Found out at Lake Macquarie City Art Gallery (2006) were reviewed as \"delightful\", and changing the idea of the landscape genre.\nLahy's work in Natural Digression at Level 17 Artspace (October 2010) was reviewed as not necessarily occupying the space of photographic documentation or drawings.\nShe contributed nostalgic miniature oil on glass works to ''It's A Small World at the Glasshouse Regional Gallery, Port Macquarie (August–September 2013). Later that same year, her miniature paintings were in The Christmas show at Beaver Galleries, Canberra, and were reviewed as dreamlike and disturbing.\nShe was part of Pareidolia: cloud gazing at Megalo Print Gallery, Canberra (March–April 2017). Her monotypes of aliens in suburbia were reviewed in the Canberra Times as being \"...slightly menacing and disturbing...\".\nExhibition catalogues\n* Stitched up, 2000.\n* Look: the Australian National University, School of Art, Graduate Program in Visual Arts, Visual Arts Graduate Season 2007, February and March 2007.\n* Push your buttons: badges by Al Munro, Barbara McConchie, Bernie Slater, Charlie Sofo, David Wills, Ivo Lovric, Lucy Quinn, Sivia Vélez, Stephanie Jones, Waratah Lahy: exhibition 24 April - 5 May 2007, foyer gallery, ANU School of Art, Canberra.\n* 30 years | 30 artists | 30 works : 24 November to 19 December 2015.\nAwards\nLahy received the Helen Maxwell Award in December 2005, for her Found 2004'' work.\nShe won the EASS Patrons' Graduate Anniversary Scholarship in March 2006.\nShe had a residency at Megalo Print Studio and Gallery in 2012.\nReferences\nExternal links\n* [http://waratahlahy.com/home.html Official website]\n* [http://www.mayspace.com.au/artworks.php?artistID=87 Artist profile on May Space]"
    }
  ]
}