{
  "content": [
    {
      "type": "text",
      "text": "# Warbirds over Wanaka__disambig_1\n\n| country      = New Zealand\n| years_active =\n| first        =\n| founder_name = Sir Tim Wallis\n| last         = 2024\n| prev         =\n| next         = 2026\n| participants = Royal New Zealand Air Force, Royal Australian Air Force, United States Air Force, Air National Guard, French Air Force of New Caledonia, Alpine Fighter Collection\n| attendance   =\n| area         = Wānaka Airport\n| budget       =\n| patron       =\n| organised    =\n| people       =\n| member       =\n| website      =\n}}\nWarbirds over Wanaka is a biennial air show in Wānaka, held on the Easter weekend of even-numbered years since 1988. It is held at Wānaka Airport, 10&nbsp;km south-east of Wānaka, in the southern South Island of New Zealand. Initially conceived by New Zealand live deer recovery pioneer, Sir Tim Wallis, as a show for him to display his collection of World War II aircraft, the event has grown into a major institution. Roads are closed and traffic is detoured around the area during the weekend. Hotels, motels and backpackers around Wānaka are usually booked well in advance (two years ahead). Accommodation is impossible to find if one does not have a booking.\nA large contingent of historic and contemporary aircraft of note from all over New Zealand and the world converges on Wānaka each second Easter for the air show. Numerous aviation personalities from all over the world attend Warbirds over Wanaka, Gen Chuck Yeager and Buzz Aldrin being the most notable of recent times. The mainstays of the display have traditionally been the aircraft from Sir Tim's Alpine Fighter Collection, based at the New Zealand Fighter Pilots' Museum. However, this collection is currently (2006) in the process of being broken up. A new charitable trust has been established to run the event in the future.\nAt Easter on the alternate (odd) years a similar air show is held at Omaka air field in Blenheim in the northern South Island, under the title of Classic Fighters. Its emphasis is on World War I aircraft including as many as seven Fokker Dr.I triplanes. Also on alternate (odd) years Wings over Wairarapa airshow is held at Hood Aerodrome, Masterton, in the North Island.\nIt is traditional for RNZAF aircraft heading to Wānaka for the airshow to perform aerial displays over the cities of Christchurch and Dunedin on their journey to the show.\nEvents\n1988\nAs well as aircraft there were displays of vintage vehicles and agricultural machinery. The event attracted an estimated 14,000 visitors. Among the aircraft was Tim Wallis's Mustang, a Hawker Sea Fury, de Havilland Venom, DC3 and Harvards. The Royal New Zealand Air Force (RNZAF) put on a display with their Red Checkers aerobatic team. A profit of $41,000 was made, which was divided between the Wanaka Swimming pool and the next Warbirds event.\n1990\nA more detailed organisation together with increased promotion saw attendance double to 28,000. A feature was Tim Wallis's repaired Spitfire XVI.\n1992\nThe star of the show was a Messerschmitt Bf 109 (Hispano Ha.1112 Buchon) owned by the Duxford-based Old Flying Machine Company and flown by Mark Hanna. The Alpine Fighter Collection's Curtiss P-40K Kittyhawk made its first post-restoration flight at the show, also flown by Mark Hanna.\n1994\nThe star attractions were a Mitsubishi Zero replica and a Corsair, among 11 aircraft types new to the event. The Saturday event was tragically marred by the death of pilot Ian Reynolds while displaying his de Havilland Canada DHC-1 Chipmunk.\n2000\nThe public flying debut of the Alpine Fighter Collection's Hawker Hurricane P3351 and three Polikarpov I-153s. This was also the last display of the RNZAF A-4 Skyhawk fighter jets and also the Aermacchi MB-339CB Black Falcons display team, due to the disbandment of 75 Squadron and 14 Squadron by the Labour Government under Helen Clark.\n2002\nFour Polikarpovs participated in the flying display. Three of them were Polikarpov I-16 monoplanes and the fourth a Polikarpov I-153 Chaika.\n2004\nThe 2004 airshow attracted an estimated 99,000 people over the 9th to the 11th April. Aircraft that were displayed included the return of ex RNZAF P-40E Kittyhawk and an FG-1D Corsair, which accompanied the locally based Spitfire Mk.XVI and P-51D in the final Breitling Fighters display. Jurgis Kairys made his first Wanaka airshow that year and the sole airworthy Lavochkin La-9 flew at the show. Buzz Aldrin was the guest of honour.\n2006\nThe 2006 airshow was held over the weekend of April 14–16. For the first time an F-111 of the Royal Australian Air Force (RAAF) took part in the flying display. A record 111,000 people were estimated to have attended.\n2008\nThe 2008 air show was held over the weekend of March 21–23. 86,000 people were estimated to have attended. The F-111 returned and was the last year featuring the Polikarpovs. The RAAF also brought in their new C-17 Globemaster, a first for Wanaka.\n2010\nAirshow dates were from 2–4 April. The first display of the McDonnell Douglas F/A-18 Hornets of the RAAF. Another overseas star was the specially-imported Mitsubishi A6M Zero of the Commemorative Air Force.\n2012\nThe 2012 airshow was held on April 6, 7, 8. Aircraft displayed that year included a T-6C Texan II, the RNZAF's future main trainer. The Agusta A109 also debuted at the show as the RNZAF's replacement for the Sioux helicopter. A pair of Strikemasters appeared at the show and two Spitfires were displayed also. A recently imported Grumman Avenger flew at Wanaka and a Hawker Hunter took part, as well as a Boeing 777 belonging to Air New Zealand performing a display on the Sunday.\n2014\nThe airshow took place from 18–20 April. The RNZAF Bell UH-1H Iroquois helicopter, which had been a regular feature of the airshow since its inception in 1988, made its final display before retiring from service and being replaced by the NH-90.\n2016\nThe airshow took place from 25 to 27 March. A Hispano Aviación HA-1112 from the Aircraft Restoration Company was ferried across for the show. The resident PBY Catalina made its first airshow at Wanaka after a restoration program took place for the aircraft to ensure its airworthiness.\n2018\nThe 2018 show took place from March 30 to April 2, with aviation displays by historic and current aircraft from 10 am to 4 pm on both the 31st and 1st. Participants in the show included displays by U.S. Air Force (USAF) F-16s from the 35th Fighter Wing at Misawa Air Base in Japan, a Harvard display team; RNZAF NH90s; the Kiwi Blue RNZAF Parachute display team; RNZAF C-130 Hercules and Boeing 757; the RAAF Hawk 127 high performance jet trainer; The French Air Force of New Caledonia's CASA; RNZAF Seasprites; a Yak-52 team formation aerobatic display; Juka aerobatics; USAF C-17 Globemasters; the RNZAF Black Falcons; a re-enacted WWII dogfight and tailchase featuring the Spanish-built Bf 109, the Buchon HA-1112, Avro Anson, Spitfire, Yak-3 and P-51D; P-40, Avenger, Catalina and DC-3 displays; and jet formation aerobatics from Vampires and L-39s.\nOther events at the airshow included skydivers, glider and model aircraft displays, a classic 1930s aircraft flypast, a military re-enactment, and a parade of Packard vintage cars.\nThe opening of the show was marred by an incident involving one of the show's Yak-3 aircraft, with the plane (piloted by its owner, Arthur Dovey), hitting a parked mobile boom-lift unit (cherry picker) as it was landing. There were no injuries, but the aircraft sustained major damage. An investigation found the airshow organisers at fault for not adequately briefing the pilot regarding the runway obstructions.\n2020\nThe 2020 airshow was to take place over 10–12 April. Aircraft planned to appear included one of the Polikarpov I-16s that was rebuilt in the 1990s by Sir Tim Wallis. Another aircraft that was scheduled to appear was a Boeing B-52 Stratofortress that would flyover Wanaka on Sunday on its way to Australia from Guam, making the type's airshow debut in New Zealand. On March 15 it was announced that the 2020 show would be cancelled due to the COVID-19 pandemic. This marked the first time in the event's history that a show had been cancelled.\n2022\nThe 2022 airshow was to take place from 15–17 April. A highlight of the programme was to be the New Zealand airshow debut of the Lockheed Martin F-35 Lightning II, with an example from the RAAF scheduled to perform flying displays over the weekend. Another \"star\" aircraft planned to appear included the Polikarpov I-16 which had remained in the country after the cancellation of the 2020 event. The country's government changed the COVID \"traffic light\" alert level to \"Red\" nationwide on 23 January and the following day the airshow's organisers announced that the 2022 show would be cancelled.\n2024\nThe 2024 airshow was announced in October 2022 and took place between 29 and 31 March 2024 Elements of the RNZAF including the Black Falcons aerobatic display team and the US American Eagles Jet Display Team. Notable aircraft at the airshow included an RNZAF de Havilland Mosquito, a restored RNZAF P-51 Mustang, a new RNZAF P-8A Poseidon, several RNZAF C-130 Hercules planes and several USAF F-16s. About 64,800 people attended the airshow, generating over NZ$40 million for the local economy.\nReferences\nBibliography\n*\nExternal links\n*[http://www.warbirdsoverwanaka.com/ Official web site]"
    }
  ]
}