{
  "content": [
    {
      "type": "text",
      "text": "# Warburg hypothesis\n\nWarburg effect}}\n, whose research activities led to the formulation of the Warburg hypothesis for explaining the root cause of cancer.]]\nThe Warburg hypothesis (, ), sometimes known as the Warburg theory of cancer, postulates that the driver of carcinogenesis (cancer formation) is insufficient cellular respiration caused by insult (damage) to mitochondria.  The Warburg effect, on the other hand, describes the observation that cancer cells, and many cells grown in vitro, exhibit glucose fermentation even when enough oxygen is present to properly respire.  In other words, instead of fully respiring in the presence of adequate oxygen, cancer cells ferment. The Warburg hypothesis is that the Warburg effect is the root cause of cancer.\nHypothesis\nThe hypothesis was postulated by the Nobel laureate Otto Heinrich Warburg in 1924. He hypothesized that cancer, malignant growth, and tumor growth are caused by the fact that tumor cells mainly generate energy (as e.g., adenosine triphosphate / ATP) by non-oxidative breakdown of glucose (a process called glycolysis). This is in contrast to healthy cells which mainly generate energy from oxidative breakdown of pyruvate. Pyruvate is an end-product of glycolysis, and is oxidized within the mitochondria. Hence, according to Warburg, carcinogenesis stems from the lowering of mitochondrial respiration. Warburg regarded the fundamental difference between normal and cancerous cells to be the ratio of glycolysis to respiration; this observation is also known as the Warburg effect.\nIn the somatic mutation theory of cancer, malignant proliferation is caused by mutations and altered gene expression, in a process called malignant transformation, resulting in an uncontrolled growth of cells. The metabolic difference observed by Warburg adapts cancer cells to the hypoxic (oxygen-deficient) conditions inside solid tumors, and results largely from the same mutations in oncogenes and tumor suppressor genes that cause the other abnormal characteristics of cancer cells. Therefore, the metabolic change observed by Warburg is not so much the cause of cancer, as he claimed, but rather, it is one of the characteristic effects of cancer-causing mutations.\nWarburg articulated his hypothesis in a paper entitled The Prime Cause and Prevention of Cancer which he presented in lecture at the meeting of the Nobel-Laureates on June 30, 1966 at Lindau, Lake Constance, Germany.  In this speech, Warburg presented additional  evidence supporting his theory that the elevated anaerobiosis seen in cancer cells was a consequence of damaged or insufficient respiration.  Put in his own words, \"the prime cause of cancer is the replacement of the respiration of oxygen in normal body cells by a fermentation of sugar.\"\nThe body often kills damaged cells by apoptosis, a mechanism of self-destruction that involves mitochondria, but this mechanism fails in cancer cells where the mitochondria are shut down. The reactivation of mitochondria in cancer cells restarts their apoptosis program.\nSee also\n* Carcinogen\n* Carcinogenesis\n* 2-Deoxy-D-glucose\n* Pyruvic acid\n* Cellular respiration\n* Inverse Warburg effect\nReferences\nFurther reading\n*"
    }
  ]
}