{
  "content": [
    {
      "type": "text",
      "text": "# Warburton, Punjab, Pakistan\n\n| pushpin_map            = Pakistan\n| pushpin_label_position =\n| pushpin_map_alt        =\n| pushpin_mapsize        =\n| pushpin_map_caption    =\n| subdivision_type       = Pakistan\n| subdivision_name       =\n| subdivision_type1      = Province\n| subdivision_name1      = Punjab\n| population_total       = 30,738\n| population_as_of       = 2017\n| population_est         =\n| pop_est_as_of          =\n| population_footnotes   =\n| area_total_km2         =\n| elevation_m            =\n| population_density_km2 =\n| leader_title           =\n| leader_name            =\n| leader_title1          =\n| leader_name1           =\n| area_code              = 0562\n| area_code_type         = Calling code\n| timezone1              = PST\n| utc_offset1            = +5\n| website                =\n| footnotes              =\n}}\nWarburton city also known as Mandi Warburton is a large town situated in Nankana Sahib District in the Punjab province of Pakistan. It is about  north of Nankana Sahib and 30&nbsp;km southeast of Sheikhupura.The newly constructed Karachi–Lahore Motorway has reduced the cities travel time from Lahore greatly.\nThe city was named by or after John Paul Warburton (1840–1919), a high-ranking police officer of the Raj period. John Paul Warburton is widely acknowledged for his campaign against dacoits who lived in forests nearby and looted travellers. The Warburtons were a prominent Anglo-Indian family, but John Paul was adopted, originally being called Jan Dad Khan. His residence at that time was turned into a high school which is still functional. This area is surrounded by industries. There is a police station, a post office and a girls degree college. The main businesses in Warburton are related to agriculture as the town is situated in an agricultural region, notably rice. Farmers from adjacent villages emphasise on Warburton as the main market where they sell their goods as well as buy fertilisers, seeds and stuff. Several banks have branches through the city that aid the farmers.\nThe town also contains remains of pre-partition era structures which probably were houses or religious buildings. Warburton is a very peaceful and harmonious place with not just Shias and Sunnis but people from minority religions too living normally. There are many mosques, imam bargahs, and churches here.\nBefore establishment of Nankana Sahib as a district the town was a part of Sheikhupura district. The town falls under constituency NA-117 (Nankana Sahib-Ι) of the National Assembly of Pakistan.\nWarburton has a grand market where people from nearby villages come and shop.\nBefore Partition of India in 1947 the town was also home to several Sikh families the remains of which can still be seen.\nPopular attractions include the Sapphire factory, the scenic Police Station of Warburton, the Warburton High School - previously mansion to John Paul Warburton.\nReferences"
    }
  ]
}