{
  "content": [
    {
      "type": "text",
      "text": "# Warbirds and Wheels Museum\n\n| dissolved           =\n| location            = Wānaka Airport\n| type                = Aerospace museum, automotive museum\n| accreditation       =\n| key_holdings        =\n| collections         =\n| collection_size     =\n| visitors            =\n| founder             =\n| director            =\n| president           =\n| chairperson         =\n| curator             =\n| historian           =\n| owner               =\n| publictransit       =\n| car_park            =\n| parking             =\n| network             =\n| website             = [https://web.archive.org/web/20210127051416/https://www.warbirdsandwheels.com/ (archived)]\n| embedded            =\n}}\nWarbirds & Wheels in Wānaka, New Zealand was a museum displaying military aircraft and early 20th century classic and vintage automobiles and motorcycles. It opened in 2011 and operated for ten years from premises located at Wānaka Airport on .\nThe museum was opened in December 2011 under an initiative by the Warbirds Over Wanaka Community Trust and three local businessmen to replace the former New Zealand Fighter Pilots Museum.\nAfter the death of one of the owners and the drop in international tourism as a result of the COVID-19 pandemic, the museum closed in September 2021.\nCollection\nThe museum had several military aircraft on static display, including a Douglas A-4 Skyhawk, a BAC Strikemaster Mk 88, a de Havilland Vampire FB5, a Hawker Hurricane Mk IIA (in airworthy condition), and a replica Royal Aircraft Factory S.E.5a.\nOver time the emphasis shifted more towards classic and vintage automobiles and motorcycles. The museum was managed by a consortium of private car collectors from Wanaka and focused mainly on vehicles from the 1930s to 1950s. Specifically, the collection included several rare cars and examples of automobiles from before World War II, such as a meticulously restored 1934 Duesenberg Model J - the only one in the southern hemisphere, a 1935 Auburn Speedster 851 SC, a \"one of two\" 1918 Packard semi-collapsible Landaulet Fleetwood model from New York, and a handful of pre-World War I vehicles such as a 1907 Ford Model K.\nAlmost all of the cars were in working order and had current registrations and Warrants of Fitness, with some of them on loan by their private owners and used for rides. The displays were complemented by equipment and paraphernalia from the respective time periods, such as old petrol pumps and signs, and listed details and stories about the individual cars.\nReferences\nExternal links\n*[https://web.archive.org/web/20210127051416/https://www.warbirdsandwheels.com/ Official website archives] on Archive.org"
    }
  ]
}