{
  "content": [
    {
      "type": "text",
      "text": "# Warburg–Sarnau railway\n\n| end              = Sarnau\n| routenumber      = *612 (Volkmarsen–Korbach)\n*622 (Korbach–Sarnau)\n| linenumber       = 2972\n| linelength_km    = 100.904\n| gauge =\n| speed            =\n| locale          = Hesse and North Rhine-Westphalia, Germany\n| map=\n| map_state     = collapsed\n}}\nThe Warburg–Sarnau railway is a 100.9 kilometre-long, single-track, partially disused secondary railway line in North Rhine-Westphalia and North Hesse. The middle section, Korbach–Frankenberg, is called the Untere Edertalbahn (Lower Eder Valley Railway) or the Nationalparkbahn (National Park railway) and the southern section, Frankenberg–Sarnau(–Marburg), is called the Burgwaldbahn (Burgwald railway).\nThe line between Warburg and Volkmarsen, which is known as the Twistetalbahn (Twiste Valley Railway), has been dismantled. Since the reactivation of the section between Korbach Süd and Frankenberg on 11&nbsp;September 2015 there has been continuous rail traffic from Marburg to Brilon Stadt (from Korbach via the Wabern–Brilon Wald railway).\nRoute\nThe line initially runs in a double loop through Warburg down into the Diemel valley and then runs upstream along the Twiste via Bad Arolsen towards Korbach, where it crosses the Diemel–Eder/Fulda/Weser watershed. In Korbach, it is possible change to the line to Brilon Wald (Uplandbahn), which is also operated by the Kurhessenbahn. The line continues through the narrow valleys of the Kuhbach and the Itter (which requires two tunnels) to Herzhausen, past the beginning of the Edersee. The railway line then  follows the Eder upstream to Frankenberg. In Burgwald, the line crosses Rhine–Weser watershed via the Wiesenfeld Tunnel, reaching the valley of the Wetschaft at Ernsthausen. In Sarnau, where the Wetschaft joins the Lahn, the line also joins the Kreuztal–Cölbe railway.\nHistory\nTwiste Valley Railway (Warburg–Korbach)\nstation, a former junction including a triangular junction and branches of the routes to Warburg, Kassel and Korbach-Süd (May 2014)]]\nThe almost 44&nbsp;kilometre-long northern section, also known as the Twistetalbahn, runs between Warburg and Welda in North Rhine-Westphalia. The section from Warburg to Arolsen (which was not yet prefixed with Bad) was opened on 1&nbsp;May 1890. The extension to Korbach followed on 15&nbsp;August 1893. The line was classified as a line of minor importance in the German Empire. The 25.2&nbsp;km-long section from Warburg to Arolsen required the acquisition of land at a cost of 300,000 marks, an average cost per km of 11,900 marks and the construction cost excluding land acquisition amounted to 2,550,000 marks or 101,200 marks per km.\nThe opening of the Volkmarsen–Vellmar-Obervellmar railway in 1897 created a direct connection to Kassel. Since passengers were mostly bound for Kassel and wanted to avoid the round about route via Warburg and a change of trains, traffic on the Volkmarsen–Kassel route developed more strongly than on the Volkmarsen–Warburg route. Therefore, passenger services on this section ended on 28&nbsp;May 1967. Freight operations ended on 10&nbsp;March 1977. Since this section was uneconomic, it was closed on 31&nbsp;December 1982 and dismantled in 1983. The Twiste rail trail\npartly runs along the former line.\nThe Volkmarsen–Korbach section also saw a decline in the number of passengers in the 1980s. On 30&nbsp;May 1987, when passenger traffic on the Lower Eder Valley Railway ended, it also ended on the Volkmarsen–Korbach section, although freight traffic continued. In the 1990s, there were calls for the reopening of this section. As a result, passenger services resumed on 4&nbsp;October 1998. It was one of the first reactivations of rail services in Hesse. In the meantime, operations have been taken over by the DB subsidiary Kurhessenbahn and the number of passengers has increased. From 28&nbsp;May 2006 to 9&nbsp;December 2006, the line was converted to a computer-based interlocking and extensively renovated. With the 2013/2014 timetable change in December 2013, the new Twistesee crossing loop was opened east of Bad Arolsen (no embarkation/disembarkation), which enabled a new timetable concept to be introduced with coordinated transfers in Korbach and shorter travel times between Kassel and Korbach.\nLower Eder Valley Railway (Korbach–Frankenberg)\n]]\nThe Untere Edertalbahn (Lower Eder Valley Railway), also known as the Nationalparkbahn (National Park Railway) since 2015, is the 31 kilometre-long middle section of the Warburg–Sarnau line. It opened on 1&nbsp;May 1900. Passenger traffic was largely made up of commuters bound for Frankenberg, Marburg or Korbach. In Frankenberg, it was possible to transfer to Winterberg, Bad Berleburg and Bestwig. Brilon-Wald and Bad Wildungen could be reached from Korbach. A Heckeneilzug (\"hedge express\", that it is a train that stops at all stations on the rural part of the route, but runs as an express at the city end; E 2832/2833) also ran on this route until around 1982 to/from Bremerhaven (for a time ) via Bielefeld, Brilon and Marburg to/from Frankfurt am Main.\nSince no other railway lines branched off between Korbach and Frankenberg, most of the stations were outside the towns, the well-developed B 252 runs parallel and the region is only sparsely populated, passenger transport became less and less profitable. Therefore, Deutsche Bundesbahn failed to invest in infrastructure and rolling stock and reduced services from time to time. In the years before the closure, for example, the first passenger train from Frankenberg to Korbach did not run until 10 AM, making the service useless for schoolchildren and commuters. The staff-intensive signalling and safety technology led to high operating costs. Therefore, passenger operations were discontinued on 3&nbsp;May 1987. There was still freight traffic between Frankenberg and Ederbringhausen until 1 June 1991. The rest of the line was only occasionally used by freight trains. There were also some excursion trips on the section, but these were discontinued in 1991. Nevertheless, there were excursion trips on the whole section for the 1997 Hessentag (Hessian Day), which was held in Korbach.\nAfter the Korbach–Volkmarsen section was reactivated in 1998, plans began to be developed to use the Lower Eder Valley Railway again for passenger traffic to create a continuous connection to Marburg and the Frankfurt Rhine-Main area. Passenger services were first restored on the 1.5 kilometre-long section from Korbach Hauptbahnhof to Korbach Süd on 9&nbsp;September 1999. In 2005, the Frankenberg–Herzhausen section was cleared for reactivation. In 2007, however, a cost-benefit analysis was carried out, which did not find that the line would have any economic benefit. As a result, the Nordhessischer Verkehrsverbund (NVV) exercised its right to withdraw from the implementation of the project. At that time, plans included the investment of €43 million to accelerate operations on the Cölbe–Korbach route to establish good connections to the Regional-Express to Frankfurt in Marburg and to the RE 17 to Hagen in Brilon Wald. The potential passenger traffic between Korbach and Frankenberg of 1150 passengers per day was not enough to justify these costs.\nAs a lead-up to the planned reactivation, excursion services were operated from Frankenberg to Herzhausen on Sundays and public holidays in 2006 and 2007, but this was not continued in the following years as a result of Waldeck-Frankenberg budget cuts. After the first setback, things changed in North Rhine-Westphalia as a result of the planned connection of the network to the town centre of Brilon (Brilon Stadt station). With the new RE&nbsp;57 service, Dortmund–Brilon, good connections to the Sauerland and the Ruhr area could be created in Brilon Wald without having to upgrade the line between Korbach and Cölbe for higher speeds. Under this option, there could also be good connections towards Kassel in Korbach on the hour. A new attempt to reactive the line was started with this stripped-down option.\nOn 25 September 2008, the Landtag of Hesse decided, on the basis of an initiative by the Greens, to reactivate the Frankenberg–Korbach railway, which had not yet been dismantled, for regular rail traffic. A continuous connection from Marburg via Korbach to Brilon was to be created. Regular traffic between Frankenberg and Herzhausen would have been restored from the summer of 2009. A continuous connection to Korbach was envisaged in the long term. However, this decision was initially not implemented by the state government that followed in 2009, which consisted of the CDU and the FDP.\nExcursion services were operated again from May to October 2011, April to October 2012 and April to October 2013. Five pairs of trains ran between Marburg and Herzhausen every two hours on Sundays and public holidays. The section between Herzhausen and Korbach Süd remained closed to all traffic because of the heavy vegetation and its poor condition. The stops at Goßberg and Schreufa were still not served.\nOn 29&nbsp;September 2011, the local daily newspapers, the Frankenberger Zeitung and the Hessische/Niedersächsische Allgemeine reported that the Waldeck-Frankenberg district was making €2.8 m available for the reopening of the section from Herzhausen to Korbach. In December 2011, the NVV announced that it would consider reactivating the section for passenger and freight traffic. Positive economic returns and a viable concept for financing operations would be necessary before a decision was taken to restart operations. The result of the cost–benefit analysis confirmed that the project would have a value above 1, which is positive. The NVV decided to reactivate it at the beginning of July 2012. This was also endorsed by Deutsche Bahn and the state of Hesse. After the district council of Waldeck-Frankenberg also voted for its reactivation on 17&nbsp;September 2011 and agreed to contribute more than €3 million to the costs, the resumption of traffic was finally agreed.\nConstruction work to reactivate the line began in Vöhl-Herzhausen on 30&nbsp;June 2014. For this purpose, the line between Frankenberg and Korbach was modernised from 2014 to 2015 and new platforms were built. Schreufa and Itter stations were not reactivated because they are distant from the localities they are named after. The cost of these measures totalled €31.9 million, of which the State of Hesse accepted €23 million. The two tunnels at Vöhl-Thalitter had to be completely renovated and eight level crossings protected with safety equipment. It was originally planned to introduce new services at  the 2014/2015 timetable change in December 2014 to allow trains to run over the line at a maximum speed of 60&nbsp;km/h. The travel time from Korbach to Frankenberg is 38 minutes. The start of construction work was delayed until 30&nbsp;June 2014.\nOn 11&nbsp;September 2015 after 15 months of construction, the line was officially put back into operation in the presence of the Hessian Transport Minister Tarek Al-Wazir and on 12/13&nbsp;September 2015 public operations commenced with a line festival. Scheduled passenger services resumed on 14&nbsp;September 2015.\nJust three months after the start of operations, the NVV reported that the number of passengers was 400 passengers per day (Monday to Friday), which was well above the projection of 250 at the end of the period considered for the planning.\nPoliticians and transport operators decided in March 2014 that a station allowing trains to cross would be built in Frankenberg-Viermünden at a later date. This crossing station would be necessary due to the planned connection in Brilon Wald to the RE&nbsp;57 service to Dortmund. Since this line was intended to eventually run every two hours between Brilon City and Dortmund and has an unusual symmetry minute at 30 minutes past the hour, journeys towards Brilon have to be delayed by an hour in order to make a connection. With the construction of the crossing point, however, trains in both directions can now cross in Viermünden. Before the completion of the crossing station at Viermünden, most trains continued to Bestwig due to a lack of connections. The hourly rotation has the additional advantage that the trains terminating in Frankenberg do not have to wait for more than an hour. The crossing point was originally supposed to go into operation in December 2016. It was finally completed in December 2017. At the same time as the new Viermünden station was  built, the pedestrian underpass in Korbach was renewed. The new platform at Korbach Süd was completed in October 2017. As a result, on the Hessentag in 2018, which took place again in Korbach, special services ran again on the whole line. At the timetable change on 15 December 2019, the two-hour service was intensified so that services largely run hourly from noon.\nBurgwald Railway (Frankenberg–Sarnau)\nin autumn 2010]]\nThe Burgwald Railway (Burgwaldbahn) is the 26&nbsp;km long southern section of the Warburg–Sarnau railway. It opened on 1&nbsp;July 1890. The Burgwald Railway branches off the Kreuztal–Cölbe railway in Sarnau and runs through the Wetschaft valley to Frankenberg, where the lines to Bad Berleburg and Winterberg branched off. The passenger traffic consisted largely of travellers bound for Marburg, Korbach, Frankenberg or the Frankfurt Rhine-Main region. Freight traffic on the line, which was only of a regional nature, was sometimes significant. The most important railway junction on the line was Frankenberg, but from the 1960s onwards it became less and less important and with the closure of the Upper Edertal Railway in 1981 and the Lower Edertal Railway in 1987 it was left as only a terminus for trains from Marburg. Passenger and freight traffic also decreased significantly on the Burgwald Railway. From that time, there were repeated reports that the Burgwald Railway would be closed. In 2002, when the Kurhessenbahn integrated the Burgwald Railway into its network, which was operated with then modern class 628 railcars, the decline in passenger traffic was stopped, but freight traffic continued to decline sharply. Until 2005, it was the only branch line in Hesse with daily freight traffic. Today, it is still served by occasional trains carrying timber from Frankenberg, Battenberg and a siding in Allendorf. It is likely that it will be completely closed in the next few years, as the ability to operate on the line to Battenberg is only guaranteed for four years and numerous speed limits will be imposed on the trains.\nTraffic could have been completely stopped in 2007. The NVV wanted to initiate a closure process. It was only averted due to pressure from the DB and the Kurhessenbahn. Since then, the very dilapidated infrastructure has been renewed and accessibility has been improved. At the end of the work, the line was completely closed from 2&nbsp;July to 4&nbsp;October 2010. During this time, the line was converted to computer-based signalling and the Birkenbringhausen and Simtshausen stations were moved closer to the towns. In addition, all platforms were raised to 55&nbsp;centimetres and extended to a uniform length of 95&nbsp;metres. Tactile paving and modern shelters were installed. The line has been upgraded for safe operations for 20 years. The Kurhessenbahn stated, however, that the Burgwald Railway would only have a secure future if the Lower Eder Valley Railway to Korbach was reactivated. The renovation of the line to mark the 120th anniversary was celebrated with the Burgwaldbahnfest (Burgwald Railway Festival) on 23&nbsp;and 24&nbsp;October 2010. On the occasion of this event, the Marburg–Frankenberg–Herzhausen line was operated by special trains with different haulage. In 2009, there had already been three special services, namely to the dragon boat race on the Edersee (23&nbsp;and 24&nbsp;May), steam train services for the Eisenbahnfreunde Treysa (\"Treysa Railway Friends\"; 31&nbsp;May) and the Eder Bike Tour (14&nbsp;June).\nStations\nThe Burgwald Railway has seven stations today. However, the trains stop at nine because the section of line through the stations of  and , which is also served, is no longer considered to form part of the Burgwald Railway. There used to be stations at Todenhausen and Niederwetter, but these were closed in the 1980s.\n{| class=\"wikitable\"\n|- style=\"background:#C0C0C0\"\n! Stations\n! Municipality / State\n! Fare system\n! Line-km\n! Notes\n|-\n|\n| Marburg\n| RMV\n| align=\"center\" | 108.3\n| Interchange with services to/from Frankfurt, Kassel, Gießen\n|-\n|\n| Cölbe\n| RMV\n| align=\"center\" | 104.4\n| Junction with Main–Weser Railway\n|-\n| Sarnau\n| Lahntal\n| align=\"center\" | –\n| align=\"center\" | 100.9\n| Junction with Kreuztal–Cölbe railway\n|-\n| Wetter (Hessen)\n| Wetter\n| RMV\n| align=\"center\" | 96.1\n| Wetter (Hess-Nass) until July 2010\n|-\n| Simtshausen\n| Münchhausen\n| RMV\n| align=\"center\" | 91.3 (91.8)\n| Station moved towards the town centre in 2010\n|-\n| Münchhausen\n| Münchhausen\n| RMV\n| align=\"center\" | 88.2\n| Midpoint of the line. Train crossings usually take place here.\n|-\n| Ernsthausen\n| Burgwald\n| NVV\n| align=\"center\" | 86.1\n| No freight loaded since May 1994\n|-\n| Wiesenfeld\n| Burgwald\n| NVV\n| align=\"center\" | 81.7\n| Request stop\n|-\n| Birkenbringhausen\n| Gemeinde Burgwald\n| NVV\n| align=\"center\" | 79.8 (79.3)\n| Station moved towards the town centre in 2010\n|-\n|\n| Frankenberg (Eder)\n| NVV\n| align=\"center\" | 74.9\n| Once a junction with the Nuttlar–Frankenberg railway and the Bad Berleburg–Allendorf railway\n|-\n|}\nCurrent operations\nAll trains on the route are operated by the DB subsidiary, Kurhessenbahn. The fare structure of the Nordhessischer Verkehrsverbund (NVV) applies to most of the line, while that of the Rhein-Main-Verkehrsverbundes (RMV) applies between Münchhausen and Marburg.\nRegional trains run every hour from Korbach via Bad Arolsen and Volkmarsen to Kassel. These are mostly operated with Stadler GTW (class 646) diesel railcars. There is also little freight traffic to Korbach.\nThe trains between Korbach and Frankenberg run every two hours and hourly in the morning and afternoon. Since the travel time between the junction at Korbach and Viermünden is too short for stable operation, services that are additional to the basic two-hour pattern have to omit the stops in Ederbringhausen, Schmittlotheim and Thalitter. Most of the trains run through from Brilon Stadt to Marburg. According to the NVV, an average of 440 passengers per day used the reactivated section of the route and up to 700 on peak days such as on weekends. Since the reactivation of the line, the number of passengers on the connecting lines has also increased. The Kurhessenbahn estimated the demand at 600 passengers a day in 2020.\nBetween Frankenberg (Eder) and Marburg (Lahn) there are hourly Regionalbahn services on weekdays, which cross in Münchhausen. The transport associations run the Brilon Stadt–Korbach–Frankenberg–Marburg service under the name of RB&nbsp;42.\nIn March 2016, the Kurhessenbahn won the tender for the Northwest Hesse diesel network and so continues to operating the line network for another 15 years from December 2017. The services were originally to be operated by two low-floor multiple units, a used Stadler GTW (number 13) and a Siemens Desiro (14). Since the modernisation of the Desiro set was not carried out on time by AW Kassel, the Kurhessenbahn initially operated Desiro and GTW railcars from sister companies, Erzgebirgsbahn, Westfrankenbahn and Usedomer Bäderbahn. Class 628 multiple units were replaced by Siemens Desiro Classic railcars from 2019. The rolling stock has been serviced at the Kurhessenbahn repair shop in Korbach since December 2018.\nReferences\nFootnotes\nSources\n*\n*\n*}}"
    }
  ]
}