{
  "content": [
    {
      "type": "text",
      "text": "# Warbstow\n\n|official_name=            Warbstow\n|cornish_name=             Logwerburgh\n|population=               569\n|population_ref=           (United Kingdom Census 2011 including Canworthy Water and Fonston)\n|civil_parish=             Warbstow\n|unitary_england=          Cornwall\n|lieutenancy_england =     Cornwall\n|region=                   South West England\n|constituency_westminster= North Cornwall\n|post_town=                LAUNCESTON\n|postcode_district =       PL15\n|postcode_area=            PL\n|dial_code=                01566\n|os_grid_reference=        SX205904\n}}\nWarbstow () is a village and civil parish in Cornwall, England, United Kingdom. The parish has a population of 439 according to the 2001 census, increasing to 520 at the 2011 census.\nThe parish is one of the few left in England to still have an exclave. The main body of the parish includes the villages of Warbstow, Warbstow Cross and Trelash and a number of hamlets, whereas the exclave (from which the main part is separated by about 150m) includes the hamlet of Canworthy Water.\nBoth the neighbouring parish of Treneglos and Warbstow belonged in the 12th century to the Lords of Cardinham who donated them to the priory of Tywardreath. Warbstow was then a chapelry to Treneglos and the two benefices were later united as a vicarage. According to Charles Henderson, writing in 1925, \"The presence ... of St Werburga ... is not easily accounted for (though the parish is famous for geese which figure in her legend)\".\n[[File:Higher and Lower Youlton Farms - geograph.org.uk - 380683.jpg|thumb|left|Higher and Lower Youlton [sic] Farms]]\nAt Youlstone an Iron Age bronze bowl was discovered in 1925. At Lower Youlton farm is a Cornish cross in use as a footbridge; it has undergone much wear from foot passengers and its original location is unknown.\nPlaces of interest\nThe parish church of St Werburgh was originally Norman, but largely rebuilt in the 15th century. Warbstow Bury is a large Iron Age hillfort with massive ramparts. It was once the venue for an annual gathering of Methodists from the circuits of Camelford, Holsworthy (Devon) and Launceston who assembled here on Whit Tuesday for an open air service.\nReferences\nExternal links\n* [http://crocat.cornwall.gov.uk/dserve/dserve.exe?dsqIni=Dserve.ini&dsqApp=Archive&dsqDb=Catalog&dsqCmd=Overview.tcl&dsqSearch=((text)='warbstow') Cornwall Record Office Online Catalogue for Warbstow]"
    }
  ]
}