{
  "content": [
    {
      "type": "text",
      "text": "# Warblish\n\nWarblish is the human imitation of bird vocalizations using existing words and phrases in a human language. The term was coined in 2017 by the linguist Hannah Sarvasy, but warblish itself is an ancient human tradition. Warblish is shared by a community, and likely does not apply to homophonic translations created by one person.\nCharacteristics\nUnlike onomatopoeia, where nonsense is created to sound like a bird's call, warblish uses real lexical items. Words in warblish might have meaning that related to the bird in a clever or useful way, or warblish may be humorous and nonsensical. Helen Innes of New Zealand has documented more than 1,500 examples in 55 languages, and sees warblish as a literary form. Good warblish may have a clear meaning or memorable alliteration, she told Audobon magazine. Conducting much of her search in texts such as memoirs, Innes noticed that warblish disappeared from some books in later editions. This suggests that an editor did not view warblish as valuable, \"even if bird interpretations were usefully specific—as in when Serbia’s Golden Orioles would sing crvlijva glijva (worm-infested mushroom) to warn the fungi weren’t as fresh in late spring.\nExamples\nNorthern waterthrush: ''Nice old ladies don't chew tobacco\nCalifornia quail: Chicago! Chicago!\nMountain Chickadee: Cheeseburger!\nGreat Tits: Kiss a shit!\nGreen catbird: Here I are\nBarred owl: Who cooks for you?''\nImportance\nWhile warblish might seem trival, it has been suggested to have nontrival functions.Warblish seems at first to be a trivial phenomenon, a clownish verbal play between children or whimsical adults calling out cheeeeeseburger or whip poor will to the birds. Beyond its role as a mnemonic to help people recognize birds by their calls, it is a meaningful biocultural sensory practice that helps train people to listen carefully, make the world “one’s own” and pay careful attention to the ecologies of the other-than-human life around them.In many societies, warblish serves as more than just a mnemonic device for remembering bird vocalizations. Sarvasy outlines several functions and meanings associated with warblish cross-culturally:Heralding seasonal changes, planting/harvesting times Warning humans of approaching people, animals, or spirits Referencing mythology in which people transform into birds Describing observable bird behaviors and routines Facetious or humorous attributions.\nResearch\nAccording to Sarvasy, warblish has been overlooked as a topic of study compared to onomatopoeia and non-vocal mimicry of birdsong. More research is needed into the forms warblish takes across cultures, its functions and meanings, conventionality within speech communities, and how it relates to cultural knowledge of avian ecology and behavior. Cataloging examples of warblish from around the world can provide insights into humans' creative linguistic responses to the natural environment. A recent study has found warblish to widespread across cultures.\nSee also\n* Pish\n* Ideophone\nReferences\nExternal links\n* [https://warblish.wordpress.com/ Warblish Blogsite]"
    }
  ]
}