{
  "content": [
    {
      "type": "text",
      "text": "# Warblington railway station\n\n| grid_name           = Grid reference\n| grid_position       =\n| manager             = Southern\n| platforms           = 2\n| code                = WBL\n| classification      = DfT category E\n| original            = London, Brighton and South Coast Railway\n| pregroup            = London, Brighton and South Coast Railway\n| postgroup           = Southern Railway\n| years               = 1 November 1907\n| events              = Opened as Denville Halt\n| years1              = December 1907\n| events1             = Renamed Warblington Halt\n| years2              = 5 May 1969\n| events2             = Renamed Warblington\n| mpassengers =\n27,928}}\n8,536}}\n19,292}}\n22,674}}\n28,036}}\n| footnotes           = Passenger statistics from the Office of Rail and Road\n}}\nWarblington railway station serves the Warblington and Denvilles suburbs of Havant in Hampshire.\nIt is located on the West Coastway Line which runs between Brighton and Southampton,  from Brighton. Situated opposite Warblington School, the station lies very close to a major road junction: the point at which the A259 coast road leaves the A27. Standing on the platform at the station entrance end it is possible to see the platforms of Havant railway station a short straight-line distance away.\nHistory\nThe railway line between  and Portsmouth was built in stages, and the section between  and  was opened on 15 March 1847, and there were two intermediate stations, at  and . Other stations were opened later, several coinciding with the introduction of steam rail-motor services between Portsmouth and Chichester by the London, Brighton and South Coast Railway on 11 June 1906. One such station, named Denville Halt, was opened on 1 November 1907; the following month this was renamed Warblington Halt. On 5 May 1969 it was simplified to Warblington.\nServices\nAll services at Warblington are operated by Southern using  EMUs.\nThe typical off-peak service in trains per hour is:\n* 1 tph to  via\n* 1 tph to\nAdditional services, including trains to and from  via  call at the station during the peak hours.\nOn Sundays, eastbound services run to and from Brighton instead of London Victoria.\n}}\nGallery\nFile:Warblington railway station - station entrance.jpg|The station entrance\nFile:Warblington railway station - up train.jpg|An up train\nFile:450014 at Warblington 15th August 2007.jpg|A down train\nFile:Warblington railway station - Level Crossing.jpg|The level crossing\nFile:Warblington railway station 1.JPG|The barriers rising\nFile:Havant & Portsmouth RJD 11.jpg|A 1910 Railway Clearing House map of lines around Warblington railway station\nFile:Warblington Station 2025.jpg|Entrance to Warblington railway Station in 2025\nReferences\nExternal links"
    }
  ]
}