{
  "content": [
    {
      "type": "text",
      "text": "# Warby-Ovens National Park\n\n| map             = Victoria\n| map_alt         =\n| map_width       = 200px\n| relief          = yes\n| label           = Warby-Ovens National Park\n| label_position  =\n| location        = Victoria\n| established     =\n| area_ha         =\n| area_km2        = 146.55\n| area_ref        =\n| visitation_num  =\n| visitation_year =\n| visitation_ref  =\n| nearest_city    = Wangaratta\n| nearest_town    =\n| governing_body  = Parks Victoria\n| website         =\n}}\nThe Warby-Ovens National Park is a national park located on the lands of the Bangerang clan of the Yorta Yorta Nation in the Hume region of Victoria, Australia near Killawara. The  national park is situated approximately  west of Wangaratta and  northeast of Melbourne.\nThe park draws its name from the Warby Ranges, which are named in honour of Ben Warby, a pastoralist who settled in the area in 1844, and the Ovens River. Initially reserved as a state park in 1978, the national park was declared in June 2010. Parts of the national park are contained within the  Warby–Chiltern Box–Ironbark Important Bird Area because of its importance for the conservation of Box-Ironbark forest ecosystems and several species of threatened woodland birds dependent on them.\nThe park is within the Northern Inland Slopes bioregion, which encompasses the granite, metamorphic and sedimentary lower foothills north of the Great Dividing Range in North East Victoria.  The area surrounding the park has been cleared for agriculture, with the park making up 16% of the protected areas within the bioregion. Mount Glenrowan, located within the national park, provided a good vantage point for bushranger Ned Kelly and The Kelly Gang in the late 1800s, who had an easy view of .\nFlora\nTwelve ecological vegetation classes exist within the park, including eight which are classified as vulnerable or endangered within the Northern Inland Slopes bioregion, those being the Alluvial Terraces Herb-rick Woodland, Alluvial Terraces Herb-rick Woodland/Creekline Grassy Woodland, Woodland Mosaic, Box-Ironbark Forest, Creekline Grassy Woodland, Grassy Woodland, Plains Grassy Woodland, Spring Soak Woodland and Valley Grassy Forest. Box-Ironbark Forest, which is characterised by an over-storey of Mugga Ironbark (Eucalyptus sideroxylon), Red Box (Eucalyptus polyanthemos) and Grey Box (Eucalyptus macrocarpa), makes up 27% of the park, and is found predominantly in the northern area of the park.  The plateau and higher areas of the Warby Range are characterised by Healthy Dry Forest, which makes up 24% of the park.  Vegetation within these areas consists of an over-storey of Red Stringybark (Eucalyptus macrorhyncha), Red Box (Eucalyptus polyanthemos) and Long-leaf Box (Eucalyptus goniocalyx).  Granitic Hill Woodland occurs on the steep slopes of the western side of the park, and is characterised by Blakely's Red Gum (Eucalyptus blakelyi), Red Stringybark (Eucalyptus macrorhyncha) and White Cypress Pine (Callitris glaucophylla). The park contains almost 500 species of native plants, 23 of which are classified as threatened, including the Northern Sandalwood (Santalum lanceolatum) and the Narrow Goodenia (Goodenia macbarronii), both of which have action statements under the Flora and Fauna Guarantee Act 1988 (Vic), and the Spur-wing Wattle (Acacia triptera), which only occurs in Victoria in the Warby ranges.\nThe Santalum lanceolatum (Northern Sandalwood), which is a small tree or tall shrub and has highly aromatic wood, dark, furrowed bark and thick, grey-green leaves, was historically widespread and common to the rocky faces of the Warby ranges. During the late 1800s after the gold rush, miners harvested and exported the highly fragrant timber to Asia.  Monitoring of the Warby Range population has occurred over the past 30 years, with only one old tree being documented in 1968 and 1974.  During 1979, a fire in the area was initially thought to have killed the small population of Northern Sandalwood in the Warby Range, however fire affected individuals coppiced from dormant buds, and suckered from root systems. In 1980, nine individual plants were identified, and in 1990 the population covered an area of 1.5 hectares and numbered 65 individual plants, half of which are less than 2m tall.[6] The majority of the current plants have originated from suckers from the oldest trees.\nThe Goodenia macbarronii is a yellow flowering, herbaceous plant growing to 40&nbsp;cm tall.  It has basal leaves which are narrow-obovate to linear oblanceolate, thick with coarse teeth around the edge and may have several rosettes linked by short underground stems.[7] The Narrow Goodenia occurs in spring-soaks, drainage lines and areas which stay moist all year round.\nThe Grass Tree (Xanthorrhoea glauca subspecies angustifolia), which was listed under the Flora and Fauna Guarantee Act 1988 (Vic) as endangered in 2013, occurs in low fertility soils primarily in the Box-Ironbark forest area of the park. Infrequent fires since European settlement have resulted in tall grass trees with full skirts. Mature grass trees have been found to be sensitive to fire, with high mortality rates occurring after controlled fuel reduction burns. They have also been found to be susceptible to Phytophthora cinnamomi, a fungal disease which causes die-back in native plants and is present in the park. Seedlings germinate in shady, moss covered sites under Brachyloma daphnoides (Daphne heath).\nFauna\nReptiles and Amphibians\nThe Warby-Ovens National Park provides habitat for 21 species of reptiles and 9 species of amphibian, five of which are threatened species. The Lace Monitor (Varanus varius) is classified as vulnerable in Victoria, the Woodland Blind Snake (Ramphotuphlops proximus) is listed as near threatened, the Brown Toadlet (Pseudophryne bibronii) is listed as endangered and the Rugose Toadlet (Uperoleia rugosa) is classified as data deficient in Victoria but is listed under the Flora and Fauna Guarantee Act 1988 (Vic). The Inland Carpet Python (Morelia spilota metcalfei), which was classified as endangered in Victoria in 1994, inhabits steep rocky slopes and granite outcrops with open granitic woodland or low heathland within the park. Hollow logs and hollow bearing trees, as well as large rock outcrops are used for shelter and thermoregulation, with eggs being laid and incubated by the female snake in rock crevices and hollow logs. During the summer months when the Inland Carpet Python is most active, they seek out more open habitat in search of their prey, which consists of small to medium-sized mammals, with European rabbits (Oryctolagus cuniculus) making up 50-80% of their diet. As the Inland Carpet Python is semi-arboreal, other prey species include gliders and possums.\nMammals\nThe park is habitat for 22 species of mammal. The Squirrel Glider (Petaurus norfolcensis) is a nocturnal, arboreal mammal found from Queensland through New South Wales to Victoria and is listed as endangered in the southern part of its range, which includes the Warby-Ovens National Park. Squirrel gliders primarily glide from tree to tree[14], and use tree hollows as nesting sites, and daytime dens. They can be differentiated from the Sugar Glider (P. breviceps), which often inhabits the same area, by its larger size, bushier tail and lack of a white tip to the tail.  Box-ironbark forests are habitat for the Squirrel glider in the park, with winter flowering Mugga ironbark providing a valuable winter food source.  Squirrel gliders also feed on arboreal insects, including beetles and caterpillars, and acacia gum, eucalypt pollen, nectar and sap.\nBirds\nOf the 146 species of bird found in the park, 18 are listed as threatened in Victoria. The Grey-crowned Babbler (Pomatostomus temporalis) occurs in the Box-ironbark forests in the north of the park and is classified as endangered in Victoria, and has an Action Statement under the Flora and Fauna Guarantee Act 1988 (Vic). The Grey-Crowned Babbler is an insectivorous social bird, living in groups of 2 to 12 individuals, which consists of a breeding pair, and a group of non-breeding helpers, including the previous years' chicks, all of which participate in nesting and defence of territories. Open woodland with leaf litter on the ground and eucalypt regeneration or tall shrubs is the preferred habitat of the Grey-Crowned Babbler, enabling them to forage for insects on the forest floor, and create their large domed nests from sticks between 1 and 6 meters above ground level.\nBoth the Painted Honeyeater (Grantiella picta) and the Regent Honeyeater (Xanthomyza phrygia) are found in the park, and have Action Statements under the Flora and Fauna Guarantee Act 1988 (Vic). The Painted Honeyeater is classified as vulnerable in Victoria and is a migratory bird which arrives in Victoria in October, breeds over summer and then flies north again in March or April.  It spends winter in the semi-arid woodlands of inland and northern Australia. While in Victoria the Painted Honeyeater inhabits Box-ironbark forests and other dry open forest where mistletoe from the genus Amyema occurs, mainly A. pendulum (Drooping mistletoe) and A.miquelli (Box mistletoe). Mistletoe is both the main food source and preferred nest location for the Painted Honeyeater, which in turn is an important disseminator of mistletoe seeds. The Regent Honeyeater (Xanthomyza phygia) is a black and yellow coloured, medium-sized honeyeater which inhabits dry open forests and woodlands on the inland slopes of the Great Dividing Range. They are classified as endangered in Victoria as they are the only member of their genus, Xanthomyza, and their previously wide distribution ranging from north of Brisbane to Adelaide has contracted as forest has been cleared for agriculture. In Victoria, it occurs in isolated locations including the Chiltern-Mt Pilot National Park, Warby-Ovens National Park and the Reef Hills Park. The Regent Honeyeater relies on Grevillea species, Mugga Ironbark (E. sideroxylon), Yellow Box (E. melliodora) and Yellow gum (E. leucoxylon) for nectar and insects associated with these plants as sources of food. The Regent Honeyeater breeds between September and February, with nests located between 4 and 25 meters above ground level in forks in trees, and constructed from strips of bark, dried grass and other plant materials.\nThe Powerful Owl (Nonox strenua) is the largest species of owl in Australia measuring 60–65&nbsp;cm from head to tail, and is listed as vulnerable in Victoria.  It is found across most of Victoria with the exception of the drier north west, and wetter mountain forests, however prefers old growth forests. The Powerful owl pairs for life and nests in hollow trees during winter, with the young remaining dependent on the adults until they are eight months old.  The young disperse during the February and March of the following year to establish their own territories. They are opportunistic raptors, which prey on arboreal or semi-arboreal marsupials, including gliders and possums.\nThe Box-ironbark ecological vegetation class is also habitat to the Swift Parrot (Lathamus discolour) during the winter months. The Swift Parrot arrives on mainland Australia between January and May, when it spends the winter in the box-ironbark forests feeding on the nectar of winter flowering Mugga Ironbark (E. sideroxylon), Yellow Box (E. melliodora), Yellow gum (E. leucoxylon), Grey box (E. macrocarpa) and White box (E. albens). Lerps, which are the sugary coatings of the psyllid insects that feed on eucalypt sap are also an important food source. The parrots depart in spring to return to eastern Tasmania to breed. The Swift Parrot, is one of only two migratory parrots in the world, and is the only member of its genus.\nEnvironmental Threats\nEnvironmental threats to the flora and fauna of the Warby-Ovens National Park include fire, pests and invasive species, habitat fragmentation and disease.  The Warby-Ovens National Park has a number of roads running through it which fragments the habitat of species including the Squirrel glider (P. norfolcensis), which relies on trees being close enough together to be able to glide between them. Roads also increase the likelihood of collisions between vehicles and wildlife.  Large gaps between fragments results in arboreal species such as the Squirrel Glider coming down onto the ground to move between fragments, increasing the likelihood of them becoming prey to introduced species such as foxes. Road and access tracks can aid in the spread of the soil-borne plant disease Phytophthora cinnamomi, which affects several species within the park, including the Daphne Heath and Grass Trees. P. Cinnamomi originates in Europe, and is thought to have come to Australia with the early settlers. The affected trees and plants root systems rot, and the plants die, and follow-on affects to the parks fauna include increased habitat fragmentation, loss of nesting sites in old hollow trees, and loss of food sources. Loss of habitat has been listed as one of the major threats to the Grey-crowned Babbler (P. temporalis), Painted Honeyeater (G. picta), the Regent Honeyeater (X. phrygia), and the Swift Parrot (L. discolour).\nPests and invasive species are key threats to the parks flora and fauna, with the Inland Carpet Python (Morelia spilota metcalfei) being susceptible to predation by wild dogs and foxes. Birds and small mammals such as the sugar glider (P. breviceps) and squirrel glider (P. norfolcensis) are at threat of falling prey to cats and foxes. The native Noisy Miner (Manorina melanocephala), Red Wattlebird (Anthochaera carunculata) and the Noisy Friarbird (Philemon corniculatus), whose populations have spread due to habitat fragmentation are a threat to the Swift Parrot (L. discolour), the Painted honeyeater (G. picta) and the Regent honeyeater (X. phrygia) through competitive exclusion. Pest plant species such as Patersons curse (Echium plantagineum), St. Johns Wort (Hypericum perforatum), Quaking grass (Briza sp.) and Cootamundra Wattle (Acacia baileyana) have the potential to impact the structure of the under storey and mid storey in the Granitic Hill Woodlands and Healthy Dry Forest Ecological Vegetation Classes, and the Narrow goodenia (G. macbarronii) in moist areas of the park.\nFire is a threat to the species inhabiting the park due to the sensitivity of some species to fire, including Grass Tree (Xanthorrhoea glauca subspecies angustifolia),and the native cypress pine (C. glaucophylla). Loss of habitat structure, old growth trees containing hollows and mature trees due to their destruction from intense fire is a key threat to species that rely on hollows for nest sites, shelter, and to provide habitat for their food sources such as the Powerful owl (N. strenua), which uses tree hollows as nesting sites and preys on other hollow reliant animals such as gliders and possums. The semi-arboreal Inland Carpet Python (Morelia spilota metcalfei), spends time during late summer basking in the branches of trees and would be killed by fires occurring late summer, as would clutches of eggs which are laid in cavities just below the ground, or within hollow logs . Dense regrowth after fire and the altered structure of the vegetation will have affects on the birdlife of the park, with some species known to avoid areas of dense regrowth such as Grey-crowned Babbler (P. temporalis).\nManagement\nManagement of the Warby-Ovens National Park is conducted by Parks Victoria in association with the Department of Sustainability and Environment, the Department of Primary Industries, the Goulburn-Broken Catchment Management Authority and the North East Catchment Management Authority, the CFA, the Rural Cities of Wangaratta and Benalla, and Moira Shire, Aboriginal Affairs Victoria and Tourism Victoria, and includes activities such as revegetating areas that were previously grazed and harvested for timber to create continuous habitat for fauna within the park, and establishing and protecting corridors between the park and the Ovens River. Community and visitor awareness of P. cinnamomi is undertaken by the publication of pamphlets and signage within the park.  Some areas of the park are quarantined and closed to visitors to help prevent the spread of the disease throughout the park. Priority actions from Flora and Fauna Guarantee Action Statements are implemented to help preserve the threatened species and ecological vegetation classes that inhabit the park.  This includes protecting large hollow bearing trees, both live and dead, and protecting fallen timber.\nAreas of the park that contain species sensitive to fire are protected from fires and prescribed fuel reduction burns by assigning Special Protection Areas – Natural Values, which contain the Northern Sandalwood (Santalum lanceolatum), the Spur-winged wattle (Acacia triptera) and grass trees (Xanthorrhoea glauca angustifolia). Pest animal species are controlled to reduce the impacts on fauna within the park.  Fox control programs have been in place since 1993, and the Rabbit Busters program and the release of calicivirus has reduced the number of rabbits within the park considerably. Control of rabbits within the park is important due to the susceptibility of the Granitic Hills Woodland Ecological Vegetation Class to rabbit impacts.\nVisitor activities are managed in such a way that they minimise impact to the flora and fauna of the park.  Maintained tracks are provided for bushwalking and cycling is permitted on all open roads within the park as well as several of the wider walking tracks, with some tracks being seasonally closed during wet conditions to prevent the spread of P. cinnamomi.  Other activities such as orienteering, prospecting and rock climbing are strictly controlled and limited to prescribed areas of the park to limit impacts to flora and fauna.\nParks Victoria is working with adjacent landholders to build partnerships to aid in the protection of remnant vegetation on private land, and to undertake pest animal and plant control programs.\nSee also\n}}\n* Protected areas of Victoria\n* List of national parks of Australia\nReferences\nExternal links\n*"
    }
  ]
}