{
  "content": [
    {
      "type": "text",
      "text": "# Warchild (Lowachee novel)\n\n| oclc              = 49397465\n| series            = Warchild #1\n}}\nWarchild is a science fiction novel by Canadian writer Karin Lowachee. It was published by Warner Aspect in 2002. It won the Warner Aspect First Novel Award. Warchild was also a finalist for the 2002 Philip K. Dick Award.\nPlot summary\nThe story starts when eight-year-old Joslyn Musey's parents die in a vicious pirate attack on his home ship, the merchant  Mukudori.  Jos, along with a handful of the ships other children, are captured by the attackers.  Vincenzo Marcus Falcone, an infamous pirate and captain of the \"Genghis Khan\", keeps Jos as his hostage, with the intention of making him a protégé. Falcone teaches Jos how to \"win people over\" with manners and cunning, and especially good looks.\nThe human race, EarthHub, is at war with aliens called the striviirc-na, who are called \"strits\" by the Hub.  When the pirate ship Genghis Khan docks at Chaos Station, which is located in deep space, the station is suddenly attacked by the striviiric-na.  Jos escapes Falcone during the attack, but is shot, then captured  and is taken to the alien homeworld, Aaian-na, by the Warboy, the leader of the human sympathizer movement on Aaian-na, Nikolas S'tlian. Jos gradually accepts his place on Aaian-na and the Warboy teaches him to be a Ka'redan, or \"assassin-priest\" which is the ruling caste on the planet.\nJos is trained on Aaian-na until he is fourteen, when he is formally made a member of the Ka'redan. At that time, being told that the only way to end the war is through a treaty with EarthHub's most notorious spacecarrier, the Macedon, he is assigned to spy on the ship as part of its elite crew. Jos is taught to act like an Earthhub human and sent back to Austo Station in the Hub to join the Macedon. Once on the Macedon, however, he discovers that his previous distinctions between good and bad no longer apply.\nJos battles on the Macedon, eventually encountering Evan D'Silva, one of his former friends on the Mukudori, who he rescues from a pirate ship. He discovers a connection between the Warboy's brother, Ash-dan, and Falcone's pirates, who have been trading weapons to the sympathizers in exchange for aid in hiding captured children.\nThe novel ends with a face off between the Genghis Khan and the Macedon. The Macedon encounters the Genghis Khan meeting with the Warboy's brother's ship, and is boarded by the pirates. Jos and his unit are captured by the Khan and Jos is interrogated by Falcone. It is eventually revealed to his ship mates that he is spying for the Warboy. However, at that point, the Warboy, who had been tracking his brother, shows up with his ship, and his crew release Jos and the other prisoners and takes them to his ship.\nThe Warboy's ship then helps the Macedon destroy the pirate ships, after which ''Macedon's Captain, Cairo Azarcon, arranges for the Warboy to dock on Chaos Station. Jos encounters Falcone on deck, being transported to police facilities, when Falcone attempts to escape. Jos then stabs Falcone to death on deck, after which he is taken back to the Macedon'' under Captain Azarcon's protection. He is made a liaison officer as Azarcon attempts to negotiate a peace treaty with the striviiric-na.\nSee also\n* Burndive (2003) – the second book in the Warchild series.\n* Cagebird (2005) – the third book in the Warchild series.\nReferences\nExternal links\n*[http://www.twbookmark.com/books/98/0446610771/ Publisher's description of Warchild]"
    }
  ]
}