{
  "content": [
    {
      "type": "text",
      "text": "# Wardour Street English\n\nWardour Street English is the name given to a pseudo-archaic form of diction affected by some writers, particularly those of historical fiction. It alludes to the former reputation of Wardour Street in the Soho district of London as a centre for dealers in antique and reproduction furniture, and their supposed propensity for passing off modern imitations as original items.\nThe phrase was coined by the historian Archibald Ballantyne in an article entitled Wardour Street English, published in Longman's Magazine in 1888, in which he characterized William Morris's translation of the Odyssey as “not literary English of any date; this is Wardour-Street Early English—a perfectly modern article with a sham appearance of the real antique about it.” The phrase appeared sporadically thereafter in literary criticism, particularly in reference to Morris's work, and there is a brief mention of \"antiquarian rubbish, Wardour Street English\" in ''The King's English, by the brothers H.W. Fowler and F.G. Fowler, but it was the article Wardour Street in A Dictionary of Modern English Usage'', written by H.W. Fowler after his brother's death, that gave the expression broad currency, and led to it often being attributed to him. Fowler wrote:\nWords deprecated by Fowler included anent, aught, ere, erstwhile, haply, maugre, oft, perchance, thither, to wit, varlet, withal, and wot. Some words that Fowler found objectionable became part of normal English idiom, including albeit, forebears, and proven.\nWardour Street English includes not only an incongruous choice of vocabulary, but also pseudo-archaic sentence structure. Fowler criticised the use of inverted protasis with had, should and were (as in \"Had he done this, then…, rather than \"If he had done this, then…\"), although this objection does not appear in later editions. A more recent edition gives as examples \"Bread and wine needs a man to fight and die\" and \"Us enchants he, but eke frightens.\"\nModern critics are more likely to take issue with the incongruous use of modern vernacular in popular broadcast period dramas than pseudo-archaic language.\nSee also\n* Archaism\nReferences\nCitations\n*  (book review)\n*\n*\n*\n*\n*\n*\n*\n*\n*\n}}\n*"
    }
  ]
}