{
  "content": [
    {
      "type": "text",
      "text": "# Ward Creek (Lake Tahoe)\n\n| native_name_lang   =\n| name_other         = Wards Creek\n| name_etymology     =\n| image              = Ward Creek mouth Lake Tahoe.jpg\n| image_size         = 300\n| image_caption      = The mouth of Ward Creek on Lake Tahoe\n| map                =\n| map_size           =\n| map_caption        =\n| pushpin_map        = USA California\n| pushpin_map_size   = 300\n| pushpin_map_caption= Location of the mouth of Ward Creek in California\n| subdivision_type1  = Country\n| subdivision_name1  = United States\n| subdivision_type2  = State\n| subdivision_name2  = California\n| subdivision_type3  = Region\n| subdivision_name3  = Placer County\n| subdivision_type4  =\n| subdivision_name4  =\n| subdivision_type5  = Cities\n| subdivision_name5  = Pine Land, Timberland\n| length             =\n| width_min          =\n| width_avg          =\n| width_max          =\n| depth_min          =\n| depth_avg          =\n| depth_max          =\n| discharge1_location=\n| discharge1_min     =\n| discharge1_avg     =\n| discharge1_max     =\n| source1            = Between Ward Peak and Twin Peaks in the Granite Chief Wilderness of the Sierra Nevada Mountains\n| source1_location   =\n| source1_coordinates=\n| source1_elevation  =\n| mouth              = Lake Tahoe\n| mouth_location     = Tahoe Pines\n| mouth_coordinates  =\n| mouth_elevation    =\n| progression        =\n| river_system       =\n| basin_size         =\n| tributaries_left   =\n| tributaries_right  =\n| custom_label       =\n| custom_data        =\n| extra              =\n}}\nWard Creek is a  eastward-flowing stream in Placer County, California, United States. The creek flows into Lake Tahoe  south of Tahoe City, California, and has undergone extensive restoration to reduce sediment and surface run-off to maintain the purity of Lake Tahoe.\nHistory\nWard Creek and Ward Peak are named for homesteader Ward Rush, whose claim was made on April 1, 1874. In the early 1980s the McClatchy family donated lands on the south side of the creek to California State Parks.\nWatershed\nWard Creek, the fourth largest stream (by area and discharge) of the 63 Tahoe Basin watersheds contributes 6% of the stream runoff flowing into Lake Tahoe. The creek was a major source of sediment related to erosion from subdivisions and logging roads in the watershed. The Ward Creek watershed drains an area of  and has a North Fork beginning on the south slope of Ward Peak and a South Fork originating on the north side of Twin Peaks. The Ward Creek watershed is just north of the Blackwood Creek watershed, and just south of Alpine Meadows Ski Resort which is on the north side of Ward Peak and Scott Peak. The creek mainstem is paralleled by Ward Creek Boulevard/Road.\nEcology\nFrom 2006 to 2013 Ward Creek Park was restored by California State Parks, the California Tahoe Conservancy and other partners to reduce erosion which deposites sediment in Lake Tahoe, removal of fire-prone crowded trees and removal of a diversion dam.\nBeaver dams on Ward Creek reduce sediment and nutrient (such as phosphorus) loads that would otherwise flow to Lake Tahoe.\nRecreation\nWard Creek Park is a California State Park whose  is bordered by Ward Creek on the north and Highway 89 on the east. The area along the creek is protected by the California State Parks system. The Park has an extensive trail system that ties in with the bike path along Highway 89 and connects with USFS trails to Stanford Rock (which lies midway between Twin Peaks and the mouth of Ward Creek) and the Tahoe Rim Trail.\nSee also\n*List of Lake Tahoe inflow streams\nReferences\nExternal links\n*[http://www.parks.ca.gov/?page_id=513 California State Parks: Ward Creek]\n*[http://www.wardcreek.net/index.htm Ward Creek Watershed Restoration]\n*[http://www.wardcreek.net/pictures.htm Ward Creek Photo gallery]"
    }
  ]
}