{
  "content": [
    {
      "type": "text",
      "text": "# Warden (college)\n\nWarden is a title used by the heads of some university colleges, halls of residence, and other institutions. Its use in this sense dates back at least to the 13th century at Merton College, Oxford, as a translation of the Latin .\nEngland\nUniversities and colleges\nThe only degree-awarding institutions to have used the title for the head of the institution are Durham University and Goldsmiths, University of London. The head of Durham University was titled the warden until 1909, while the head of the Durham division of the federal university, who held the vice-chancellorship in rotation with the rector of King's College (the Newcastle division of the university), was titled the warden of the Durham colleges from 1937 to 1963. Since 1963, the head of the university has held the title of vice-chancellor and warden.  The title of warden was used by the head of Goldsmiths until 2024, when the title was changed to vice-chancellor after the institution gained university status in its own right.\nIn collegiate universities, the title has mainly been used for heads of college at the University of Oxford. The only college to use the title at the University of Cambridge is Robinson College. None of the colleges at Durham University use the title for their head of college but the title is used by the head of Cranmer Hall, a theological college that forms part of St John's College, Durham. Colleges that use the title of warden at the University of Oxford are:\n* All Souls College\n* Keble College\n* Merton College\n* New College\n* Nuffield College\n* St Antony's College\n* Wadham College\nThe title is also used at Oxford by Rhodes House and was used in two defunct colleges that closed at the time of the reformation, Canterbury College and Durham College, and by Greyfriars permanent private hall, which closed in 2008. It has also been used as the title of the heads of fictional Oxford colleges: Shrewsbury College in Dorothy L. Sayers's Gaudy Night, St Severin's College in Jill Paton Walsh's The Late Scholar and Judas College in Max Beerbohm's Zuleika Dobson.\nThe University of Bristol and the University of Manchester had wardens in at least some of their halls of residence until the 2010s. Bristol had 12 wardens in its halls of residence when they were abolished in 2017. Halls at Manchester that had wardens included Ashburne Hall, St Anselm Hall (to 2018) and Hulme Hall.\nThe title of warden has also been used for the heads of Church of England theological colleges. These have included St Augustine's College, Canterbury, (defunct), the theological department of Queen's College, Birmingham (now The Queen's Foundation, but no longer using the title), Lincoln Theological College (defunct) and Rochester Theological College (defunct). The only theological college where the title remains in use is Cranmer Hall, Durham.\nSchools\nThe title has also been used in a small number of private schools, either for the chair of the council, as at Winchester College, or for the headteacher, as at Forest School, Walthamstow, Radley College and St Edward's School, Oxford. In 2022, Richard Townend, son of the founder Lt-Col Stuart Townend, stepped down as headmaster of Hill House International Junior School to make way for his younger son Edmund; he was made Warden of the school.\nAustralia\nThe title of warden is used by the head of some Australian residential colleges, including Trinity College at the University of Melbourne, St John's College at the University of Queensland, St Paul's College at the University of Sydney and St George's College at the University of Western Australia. The title was also used by the head of Newcastle University College, prior to the institution becoming the independent University of Newcastle, and by the head of New England University College, prior to the institution becoming the independent University of New England. Until 2024, the title was used by the head of Wollaston Theological College, when it was changed to principal.\nSee also\n* Chancellor (education)\n* Master (college)\n* Principal (university)\n* Provost (education)\n* Rector (academia)\nReferences"
    }
  ]
}