{
  "content": [
    {
      "type": "text",
      "text": "# Ward End\n\nWard End is an area of Birmingham, England. It covers the area between Saltley, Hodge Hill and Stechford and includes Ward End Park, a public park that has been open for over 100 years.\nWard End territory\nPelham in Ward End joins with Alum Rock Ward End starts by Ward End Park on the Washwood Heath Road and finishes at the Fox and Goose public house.\nThe Fox & Goose\nThe Fox & Goose, a pub and shopping area is situated in the eastern part of Ward End and marks the boundary with Stechford and Hodge Hill.\nWard End Park\nThe park, opened in 1904, covers a large part of Ward End. A typical English park, it is heavily populated in the summer months. Ward End Park House is located within the park and dates back to 1759.\nThe park also has two large multi-sports practice courts, two professional cricket nets, two large play sections and a car park.\nSecondary schools\nThe secondary school which served this area from 1958 was Ward End Hall Secondary Modern; later known as Ward End Hall County Secondary School, before finally being renamed Park View Upper School in 1983 when it catered solely for 4th and 5th year senior pupils, and sixth-formers (or Year 10, 11, 12 and 13s as they are known these days). Park View Lower School was the name given to the next closest secondary school, Naseby, after the two schools amalgamated in the mid-1980s. However, whether it was due to lack of demand for places or just financial problems, the former Ward End Hall School was closed down and demolished in the mid-1990s. A housing estate now stands on the site of the former school. Park View School was renamed Rockwood Academy in 2015. In addition to Rockwood Academy, there is a secondary education establishment quite locally at Washwood Heath (Washwood Heath Academy) and two more in Hodge Hill (Hodge Hill College; and Hodge Hill Girls' School, a former grammar school).\nPlaces of worship\nThere are a number of places of worship in Ward End, Christ Church in Burney Lane and a large number of mosques.George Grenfell Memorial Hall situated to the rear of Grenfell Baptist Church in Bankdale Road B8 2AA. Monk Road Methodist is now an African pentecostal church.\nUnusual events\nSeveral unusual events have occurred in Ward End over the years.\nIn late-1981 and into 1982, the residents of five houses on Thornton Road informed the police that stones had been thrown against their windows at night. The stones had no fingerprints, so a night-time surveillance using infrared cameras and image-intensifiers was set up. The stone-throwing continued even though no human activity was seen. Eventually the Birmingham CID gave up and left the case open.\nIn late-2004 and early 2005, there were rumours that a man had bitten several people on Glen Park Road; described as being black and in his mid-20s he was dubbed the \"Birmingham Vampire\". However the police had received no reports of any attack, and the hospitals had received no bite victims. The local press was inundated with calls from worried residents in Ward End and the surrounding area. The case has been dismissed as an urban legend.\nIn 2006, Tarmac (a heavy building materials company) drew up a list of Britain's \"spookiest roads\", with Drews Lane in Ward End coming tenth. Invisible cars are frequently heard on the road.\nFamous Resident\nCharlie Hall, character actor in many Laurel and Hardy films, was born here.\nReferences\nExternal links\n*[http://www.birmingham.gov.uk/wardendlibrary Ward End Library]\n*[http://www.virtualbrum.co.uk/east.htm Photographs of Ward End]\n*[http://www.hub-4.com/news/318/tarmac-has-found-britains-spookiest-road Spooky roads article]\n*[https://www.theguardian.com/uk_news/story/0,,1392046,00.html Birmingham Vampire article]"
    }
  ]
}