{
  "content": [
    {
      "type": "text",
      "text": "# Ward, New Zealand\n\n| population_total        =\n| population_as_of        =\n| population_density_km2  = auto\n| subdivision_type        = Country\n| subdivision_name        = New Zealand\n| subdivision_type1       = Region\n| subdivision_name1       = Marlborough\n| subdivision_type2       = Ward\n| subdivision_name2       =\n| seat_type               = Electorates\n| seat                    =\n| leader_title            = Territorial Authority\n| leader_name             = Marlborough District Council\n| leader_title1           = Marlborough District Mayor\n| leader_name1            =\n| leader_title2           = Kaikōura MP\n| leader_name2            =\n| leader_title3           = Te Tai Tonga MP\n| leader_name3            =\n| image_map               = |zoom=7}}\n| coordinates             =\n| official_name           =\n| image_skyline           = Ward War Memorial 003.JPG\n}}\nWard is a small town in Marlborough, New Zealand. It is located on State Highway 1,  north of Kaikōura. The Flaxbourne River flows past to the north and into the Pacific Ocean at Ward Beach to the south-east of Ward. A current initiative aims to have the town renamed as Flaxbourne.\nHistory\nflows into the sea]]\nFlaxbourne Station was established in the area around 1847. In 1905, most of the station was subdivided as part of the government's land reform, and Ward township was formed. The area was known by the name of the station. On the initiative of Richard Seddon, who was prime minister at the time, the township was named after his friend and political colleague Joseph Ward; a measure that was controversial at the time. The township of Seddon, named after Richard Seddon at the same time, is  north of Ward.\nIn 1961 the population was 218.\nAs of 2017, there is a campaign to have the town renamed as Flaxbourne. The NZ Geographic Board, i.e. the organisation that has the final say on place names in New Zealand, has advised that the name Ward has never been officially registered.\nDemographics\nWard is defined by Statistics New Zealand as a rural settlement. It covers  and had an estimated population of  as of  with a population density of |R}}/3.56|0}} people per km2. It is part of the larger Awatere statistical area.\nWard had a population of 81 at the 2018 New Zealand census, a decrease of 27 people (−25.0%) since the 2013 census, and a decrease of 21 people (−20.6%) since the 2006 census. There were 36 households, comprising 45 males and 33 females, giving a sex ratio of 1.36 males per female. The median age was 51.0 years (compared with 37.4 years nationally), with 12 people (14.8%) aged under 15 years, 6 (7.4%) aged 15 to 29, 42 (51.9%) aged 30 to 64, and 21 (25.9%) aged 65 or older.\nEthnicities were 88.9% European/Pākehā, 22.2% Māori, and 3.7% other ethnicities. People may identify with more than one ethnicity.\n59.3% had no religion, and 40.7% were Christian.\nOf those at least 15 years old, 6 (8.7%) people had a bachelor's or higher degree, and 15 (21.7%) people had no formal qualifications. The median income was $29,100, compared with $31,800 nationally. 6 people (8.7%) earned over $70,000 compared to 17.2% nationally. The employment status of those at least 15 was that 42 (60.9%) people were employed full-time, and 12 (17.4%) were part-time.\nEducation\nWard School is a coeducational full primary (years 1–8) school with a roll of  as of  A celebration to mark 100 years of schooling in the area was held in 2006.\nThe nearest secondary schools are Marlborough Boys' College and Marlborough Girls' College, both  away in Blenheim.\nReferences\nExternal links\n*\n*"
    }
  ]
}