{
  "content": [
    {
      "type": "text",
      "text": "# Ward Farnsworth\n\n| nationality =\n| alma_mater  = Wesleyan UniversityUniversity of Chicago Law School\n| employer    = University of Texas School of Law\n| occupation  = Dean\n| website     = http://www.wardfarnsworth.com/http://www.chesstactics.org/\n}}\nWard Farnsworth (born 1967) is Professor of Law and holder of the W. Page Keeton Chair at the University of Texas School of Law, where he was Dean from 2012 to 2022. He served as Reporter for the American Law Institute’s Restatement of the Law Third, Torts: Liability for Economic Harm, and is the author of books on law, rhetoric, philosophy, and chess.\nEducation and clerkships\nFarnsworth graduated from Wesleyan University, Middletown, Connecticut in 1989 (B.A.) and with high honors from the  University of Chicago Law School in 1994 (J.D.).\nImmediately after law school, Farnsworth served as a law clerk for Judge Richard A. Posner on the Seventh Circuit and then clerked for Justice Anthony M. Kennedy of the United States Supreme Court. He then worked as a Legal Adviser to the Iran-United States Claims Tribunal in The Hague.\nAcademic career\nPrior to beginning his tenure as dean at Texas, Farnsworth taught for 15 years at Boston University School of Law, and served several years as associate dean for academic affairs. He was appointed Dean of the University of Texas School of Law in May 2012. He has received many teaching awards over the years, including the United Methodist Scholar/Teacher of the Year Award in 2009 from Boston University.\nPublications\nFarnsworth has written on a wide range of subjects.  His legal writing includes articles on economic analysis of law, constitutional law, statutory interpretation, and legal applications of cognitive psychology.  He is author of Restitution: Civil Liability for Unjust Enrichment (Chicago 2014), and The Legal Analyst: A Toolkit for Thinking About the Law (Chicago 2007), an acclaimed guide to interdisciplinary approaches to legal thought. He is Reporter for the American Law Institute’s Restatement Third, Torts: Liability for Economic Harm.  He also is the co-author (with Mark F. Grady) of a casebook on the law of torts, and co-author (with Andrew Kull) of a casebook on the law of restitution, both published by Aspen.\nFarnsworth is the author of four books on the English language: ''Farnsworth's Classical English Rhetoric (Godine 2010), Farnsworth's Classical English Metaphor (Godine 2016), Farnsworth's Classical English Style (Godine 2020), and Farnsworth's Classical English Argument (Godine 2024), all of which have received critical acclaim. He is also the author of two books on philosophy, The Practicing Stoic (Godine 2018) and The Socratic Method (Godine 2021), and a treatise on chess, which is available online.\nSee also\n* List of law clerks of the Supreme Court of the United States (Seat 1)\nReferences\nExternal links\n*\n*\n*\n*\n*\n*\n* [http://www.lel.ed.ac.uk/~gpullum/farnsworth.pdf Farnsworth's Classical English Rhetoric] – Reviewed by Geoffrey K. Pullum\n*\n*\n* [https://www.wsj.com/articles/farnsworths-classical-english-style-review-the-charm-of-novelty-11590100108 \"Classical English Style – Reviewed by Barton Swaim in the Wall St. Journal)\"].\n* [https://www.washingtonpost.com/entertainment/books/aristotles-lisp-why-socrates-loved-dancing-and-other-tales-of-ancient-thinkers/2018/06/06/ece2fc44-64ff-11e8-a768-ed043e33f1dc_story.html?noredirect=on \"The Practicing Stoic – Reviewed by Michael Dirda The Washington Post\"].\n* [https://www.wsj.com/articles/the-socratic-method-book-review-let-us-reason-together-11656085510 \"The Socratic Method – Reviewed by Martha Bayles Wall Street Journal''\"]."
    }
  ]
}