{
  "content": [
    {
      "type": "text",
      "text": "# Ward Cheney\n\nWard Cheney (23 February 1813 Manchester, Connecticut - 22 March 1876) was a pioneer manufacturer of silk fabrics.\nBiography\nCheney was principal founder of the house of Cheney Brothers and was most active in its business management. He entered the dry goods business in Providence, Rhode Island, with his brother Charles. When Charles moved to Ohio, Ward returned to South Manchester and found several brothers raising a Chinese mulberry, Morus multicaulis. The success of the experiments led him and brothers Frank and Rush to start a silk culturing operation in Burlington, New Jersey. In 1838 he and his brothers Ralph, Rush and Frank established the manufacturing firm of Cheney Brothers in South Manchester.\nThey had many obstacles with which to contend. The factory was suspended after three or four years, but was revived in 1841. The business was finally organized as a joint-stock company, retaining the firm name, and Ward became president of the corporation.\nThe brothers steadily built an extensive business, with mills at South Manchester and Hartford, employing 2,500 people. The materials they produced were considered equal to the best made in Europe, and found a special demand for use in sewing machines on account of their strength, uniformity of twist, and fine finish. They afterward made great progress in weaving silk goods with power-looms and made printed as well as plain-dyed fabrics.\nOn their father's farm, the brothers established the model manufacturing village of South Manchester, with cottage homes, and a spacious and architecturally elegant hall and theatre where dramatic and other entertainments were given gratis, and religious exercises were held on Sundays. It also had a school, a library and reading room, boarding houses, and pleasure grounds. The brothers had their homes there too, and their relations with their workmen afforded a rare instance of cordiality and affection. From time to time, skilled operatives were brought over from England to settle in South Manchester.\nCheney was known in business circles as generous and progressive, and frequently aided young men beginning mercantile life. He was president of the Silk Association of America.\nFamily\nCheney's brother Seth Wells Cheney was an artist, married to writer Ednah Dow Littlehale Cheney. His brother John Cheney, a portrait engraver, was praised by curator S. R. Koehler at the Museum of Fine Arts, Boston, although interest in line engraving was in decline at that time.\nWard's brothers who joined him at Cheney Brothers were:\nCharles Cheney (26 December 1803 - 20 June 1874) went to Tolland, Connecticut as a clerk when he was about fourteen years old, and before he was of age engaged in mercantile business on his own account in Providence. In 1834, he moved to Ohio and established himself as a farmer at Mount Healthy, near Cincinnati, Ohio, where he remained eleven years, during which period he became interested in the anti-slavery movement. In 1847 he joined his brothers at Cheney Brothers in South Manchester. He spent a considerable portion of his time in Hartford, where they had also extensive manufactories. He served in the legislature for one or two terms and was distinguished for his public spirit and generous charities.\nRalph Cheney (13 January 1806 - 16 September 1869)\nAs well as joining his brothers in the silk enterprise, he was fond of agricultural pursuits and devoted most of his life to farming.\nRush Cheney (25 April 1815 - 7 June 1882)\nHe possessed inventive talent and capability in the application\nof mechanical principles to manufacturing; and thus\ncontributed a very important element to the building up of the\nmanufacture of silk fabric, in which he was engaged most of his life.\nFrank Cheney (born 5 July 1817)\nA natural mechanic, he joined\nwith his brother Rush in the invention and construction of\nmachinery which made the family business successful.\nSons of the brothers who joined the enterprise were Frank Woodbridge and Arthur:\nFrank Woodbridge Cheney (born 5 June 1832) was a son of Charles. After graduation at Brown University in 1854, he joined the Cheney Brothers operations at Hartford. He volunteered for the Civil War in 1862 and became lieutenant colonel of the 16th Connecticut Volunteers. The regiment went to the front on 29 August, 1,010 strong but undisciplined and almost wholly ignorant of drill. The Confederates were beginning the invasion of Maryland that ended in repulse at Antietam, and all available troops were hurried forward to meet them irrespective of experience as soldiers. On 12 September, Frank Cheney led his regiment of recruits in a skirmish that proved preliminary to the battle of Antietam, in which engagement he was severely wounded, late in the afternoon, while endeavoring to rally his men, who, never having had a battalion drill, had been thrown into disorder by the enemy's fire. Cheney's wound proved so serious that he was obliged to retire from the service on 24 December 1862. In 1863, Frank married Mary Bushnell, daughter of Horace Bushnell. They had 12 children. Frank traveled in Europe, China, and Japan, studying the silk industries of those countries, and joined Cheney Brothers as its treasurer. His eldest son Horace B. Cheney followed in his footsteps.\nArthur Cheney (14 January 1837 - December 1878) was the youngest of Ward's three children. He interested himself in the drama and built the Globe Theatre, Boston, originally called Selwyn's Theatre. It was managed with varying success by Selwyn, Floyd, and others, and, when it was burned, was rebuilt by Arthur and carried on at a loss.\nIn addition to Arthur, Ward Cheney also had two other children, Louis and Alice.\nSee also\n* Cheney Brothers Historic District\nNotes\nReferences\n*"
    }
  ]
}