{
  "content": [
    {
      "type": "text",
      "text": "# Ward Township, Hocking County, Ohio\n\n|population_total         = 1183\n|population_density_km2   = auto\n|population_density_sq_mi = auto\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 259\n|elevation_ft             = 850\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 39-80780\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1086325\n|website                  =\n|footnotes                =\n}}\nWard Township is one of the eleven townships of Hocking County, Ohio, United States. As of the 2020 census the population was 1,183.\nGeography\nLocated in the far eastern part of the county, it borders the following townships:\n*Coal Township, Perry County - north\n*Trimble Township, Athens County - east\n*Dover Township, Athens County - southeast corner\n*York Township, Athens County - south\n*Starr Township - southwest corner\n*Green Township - west\n*Falls Township (northeastern portion) - northwest\nIt is the most easterly township in Hocking County.\nMurray City, the smallest municipality in Hocking County, is located in Ward Township, as are the unincorporated communities of Carbon Hill and Sand Run.\nName and history\nWard Township was organized in 1836. It was named for Naham (or perhaps Nathan) Ward, a landowner.\nIt is the only Ward Township statewide.\nGovernment\nThe township is governed by a three-member board of trustees, who are elected in November of odd-numbered years to a four-year term beginning on the following January 1. Two are elected in the year after the presidential election and one is elected in the year before it. There is also an elected township fiscal officer, who serves a four-year term beginning on April 1 of the year after the election, which is held in November of the year before the presidential election. Vacancies in the fiscal officership or on the board of trustees are filled by the remaining trustees.\nPublic services\nThe residents of Ward Township are served by the Nelsonville-York City School District and Nelsonville-York High School.\nReferences\nExternal links\n*[http://www.co.hocking.oh.us County website]"
    }
  ]
}