{
  "content": [
    {
      "type": "text",
      "text": "# Ward Walsh\n\n| birth_place   = Los Angeles County, California, U.S.\n| death_date    =\n| death_place   =\n| height_ft     = 6\n| height_in     = 0\n| weight_lbs    = 213\n| high_school   = Trinity (CA)\n| college       = Colorado (1967–1970)\n| undraftedyear = 1971\n| pastteams     =\n*Houston Oilers ()\n*Green Bay Packers ()\n| statlabel1    = Rushing attempts\n| statvalue1    = 39\n| statlabel2    = Rushing yards\n| statvalue2    = 165\n| statlabel3    = Receptions\n| statvalue3    = 10\n| statlabel4    = Receiving yards\n| statvalue4    = 58\n| statlabel5    = Touchdowns\n| statvalue5    = 2\n| statlabel6    = Kick returns\n| statvalue6    = 1\n}}\nWard Walsh (born November 21, 1948) is an American former professional football running back who played two seasons in the National Football League (NFL) for the Houston Oilers and Green Bay Packers. He made the Oilers as an undrafted free agent in 1971 and was released by the team in 1972. He then joined the Packers and played with them until being released in 1973.\nEarly life\nWalsh was born on November 21, 1948, in Los Angeles County, California. He attended Trinity High School in Weaverville, California; as a junior in 1965, he was named All-Superior California and All-Shasta Cascade League (SCL) after leading Trinity to the league title with 14 touchdowns at fullback, additionally being selected the league's player of the year. He helped Trinity to another conference title as he ran for 1,404 yards and averaged 8.0 yards-per-carry as a senior, being named All-Superior California, the SCL player of the year and first-team All-Northern California while placing second in the conference with 150 points scored. He was also invited to the Shrine Football Classic, a goal he had set in fourth grade, and scored the game-winning touchdown in an upset by the North team over the South.\nCollege career\nWalsh began attending the University of Colorado Boulder in 1967 and made his debut for their Buffalo football team the following year, recording 63 rushing yards in his first game. He finished his sophomore season—1968—with 103 carries for 384 yards (a 3.7 average) and five touchdowns along with 13 receptions for 136 yards and another touchdown. He was ninth in the Big Eight Conference in total touchdowns while helping the Buffaloes finish with a record of 4–6. In 1969, he helped Colorado reach the Liberty Bowl with an 8–3 record, running 114 times for 502 yards (a 4.7 average) and catching seven passes for 67 yards but scoring no touchdowns. He improved in 1970 and was their leading rusher, carrying the ball 117 times for 679 yards (a 5.8 average) and three touchdowns while catching five passes for 25 yards and another touchdown, helping them return to the Liberty Bowl. He placed second in the conference in rushing average and sixth for rushing yards, ending his collegiate career with 1,565 rushing yards and 225 receiving yards along with 10 touchdowns.\nProfessional career\nWalsh went unselected in the 1971 NFL draft but signed with the Houston Oilers as an undrafted free agent and made the final roster that year. He made his NFL debut in Week 2 of the season, against the Kansas City Chiefs, and went on to appear in 13 games that year, totaling 38 rushes for 129 yards and six receptions for 36 yards and a touchdown. He had his top game of the year against the Buffalo Bills in Week 13, running 11 times for 56 yards. He returned for the 1972 season and appeared in the opening six games, running for 36 yards on eight carries while totaling four catches for 22 yards, before being waived. He also scored a touchdown by blocking a punt and recovering it in the end zone.\nWalsh joined the Green Bay Packers following his stint with the Oilers, appearing in two games but recording no statistics. He was released by the Packers in August 1973.\nPersonal life\nWalsh had a son, David, who played quarterback and defensive end for Palos Verdes High School.\nReferences"
    }
  ]
}