{
  "content": [
    {
      "type": "text",
      "text": "# Wardlow, Derbyshire\n\n|map_type                 = Derbyshire\n|official_name            = Wardlow\n|population               = 118\n|population_ref           = (2011)\n|civil_parish             =Wardlow\n|shire_district           = Derbyshire Dales\n| shire_county            = Derbyshire\n|region                   = East Midlands\n|constituency_westminster =\n|post_town                = Buxton\n|postcode_district        =SK17\n|postcode_area            =SK\n|dial_code                =\n|os_grid_reference        = SK1874\n}}\nWardlow is a parish and linear village in the Derbyshire Dales two miles from Tideswell, Derbyshire, England. The population at the 2011 census was 118.  The village contains the church of the Good Shepherd and the small hamlet of Wardlow Mires, which contains a notable pub, The Three Stags' Heads.\nHistory\nIn 1755, two stone coffins were found when a cairn was excavated, and surrounding these were seventeen other remains which spread out in a radial way, although another source says there were seventeen coffins, and gives the date that they were found during the construction of a turnpike road as 1759.\nBlack Harry was a highwayman on the turnpike roads who troubled travellers on the moors around Wardlow and Longstone. In Stoney Middleton his name lives on in place names like Black Harry Gate and Black Harry House, but it was at Gibbet Field near Wardlow that he met his end when he was hanged and Gibbeted after being arrested by the Castleton Constables.\nIn 1815, on Gibbet field, near Wardlow the last man to be gibbeted in Derbyshire was displayed. The tollkeeper, Hannah Oliver, had been strangled, and the vital clue was her missing red shoes. The local cobbler, Mr Marsden of Stoney Middleton, confirmed that shoes found at the house of 21-year-old Antony Lingard had been made for Hannah. This was the key evidence that led his to being hung in chains near the village. Lingard's body was displayed on April Fools' Day 1815, and remained there for some months. A poem by William Newton, which imagined the anguish of the murderer's father having to gaze on this sight, was given much of the credit for the abolition of gibbeting in 1834.\nA school was built in 1833, and was expanded in 1872 to serve 45 children. The school building still boasts a bell tower, and is used today as a village hall and Sunday school. In 1871 the census revealed the complexities of having a village in two parishes. The census returns show how the small number of inhabitants had to be divided into two different lists.\nThe church of the Good Shepherd was built in 1873 to seat one hundred people, and consists of a chancel, a nave, and a turret between the chancel and nave. It is a Grade II listed building.\nIt was not until 1937 that piped water came to Wardlow, so it is fitting that the village still celebrates with a well dressing each September.\nWardlow Mires\nThe Three Stags' Heads\nWardlow Mires is a small hamlet with a single public house. The Three Stags' Heads in Wardlow Mires is a Grade II listed building and listed on the Campaign for Real Ale's National Inventory of Historic Pub Interiors. It is like a farmhouse might have been 200 years ago: a small stone flagged room with a cast-iron range, whitewashed walls, a small bar and a couple of rickety tables and chairs. For many years the mummified remains of a cat were exhibited in a glass case. The cat's remains were found during alterations to a chimney breast and were thought to have been placed there for superstitious reasons.\nAbove Wardlow Mires is an unusual large rocky outcrop known as Peter's Stone. The name is believed to come from its resemblance to St. Peter's in Rome. The other more grisly name for Peter's Stone is Gibbet Rock, for it was here that Lingard's body was displayed for the entertainment of visitors for several months.\nSee also\n*Listed buildings in Wardlow, Derbyshire\nReferences\nExternal links"
    }
  ]
}