{
  "content": [
    {
      "type": "text",
      "text": "# Ward–Takahashi identity\n\nIn quantum field theory, a Ward–Takahashi identity is an identity between correlation functions that follows from the global or gauge symmetries of the theory, and which remains valid after renormalization.\nThe Ward–Takahashi identity of quantum electrodynamics (QED) was originally used by John Clive Ward and Yasushi Takahashi to relate the wave function renormalization of the electron to its vertex renormalization factor, guaranteeing the cancellation of the ultraviolet divergence to all orders of perturbation theory. Later uses include the extension of the proof of Goldstone's theorem to all orders of perturbation theory.\nMore generally, a Ward–Takahashi identity is the quantum version of classical current conservation associated to a continuous symmetry by Noether's theorem. Such symmetries in quantum field theory (almost) always give rise to these generalized Ward–Takahashi identities which impose the symmetry on the level of the quantum mechanical amplitudes. This generalized sense should be distinguished when reading literature, such as Michael Peskin and Daniel Schroeder's textbook, from the original Ward–Takahashi identity.\nThe detailed discussion below concerns QED, an abelian theory to which the Ward–Takahashi identity applies. The equivalent identities for non-abelian theories such as quantum chromodynamics  (QCD) are the Slavnov–Taylor identities.\nThe Ward operator describes how a scalar term in a Lagrangian transforms under infinitesimal gauge transformations. It is closely related to the BRST operator and plays a central role in providing a geometric description of the consistent quantization of gauge theories.\nWard–Takahashi identity\nThe Ward–Takahashi identity applies to correlation functions in momentum space, which do not necessarily have all their external momenta on-shell.  Let\n:\\mathcal{M}(k; p_1 \\cdots p_n; q_1 \\cdots q_n) = \\epsilon_{\\mu}(k) \\mathcal{M}^{\\mu}(k; p_1 \\cdots p_n; q_1 \\cdots q_n)\nbe a QED correlation function involving an external photon with momentum k (where \\epsilon_{\\mu}(k) is the polarization vector of the photon and summation over \\mu=0,\\ldots,3 is implied), n initial-state electrons with momenta  p_1 \\cdots p_n, and n final-state electrons with momenta q_1 \\cdots q_n.  Also define \\mathcal{M}_0 to be the simpler amplitude that is obtained by removing the photon with momentum k from our original amplitude.  Then the Ward–Takahashi identity reads\n:\\begin{align}\nk_{\\mu} \\mathcal{M}^{\\mu}(k; p_1 \\cdots p_n; q_1 \\cdots q_n) = e \\sum_i \\left[ \\mathcal{M}_0\\right. & (p_1 \\cdots p_n; q_1 \\cdots (q_i-k) \\cdots q_n) \\\\\n& \\left. - \\mathcal{M}_0(p_1 \\cdots (p_i+k) \\cdots p_n; q_1 \\cdots q_n) \\right]\n\\end{align}\nwhere e is the charge of the electron and is negative in sign.  Note that if \\mathcal{M} has its external electrons on-shell, then the amplitudes on the right-hand side of this identity each have one external particle off-shell, and therefore they do not contribute to S-matrix elements.\nWard identity\nThe Ward identity is a specialization of the Ward–Takahashi identity to S-matrix elements, which describe physically possible scattering processes and thus have all their external particles on-shell.  Again let \\mathcal{M}(k) = \\epsilon_{\\mu}(k) \\mathcal{M}^{\\mu}(k) be the amplitude for some QED process involving an external photon with momentum k, where \\epsilon_{\\mu}(k) is the polarization vector of the photon.  Then the Ward identity reads:\n: k_{\\mu} \\mathcal{M}^{\\mu}(k) = 0\nPhysically, what this identity means is the longitudinal polarization of the photon which arises in the &xi; gauge is unphysical and disappears from the S-matrix.\nExamples of its use include constraining the tensor structure of the vacuum polarization and of the electron vertex function in QED.\nDerivation in the path integral formulation\nIn the path integral formulation, the Ward–Takahashi identities are a reflection of the invariance of the functional measure under a gauge transformation. More precisely, if \\delta_\\varepsilon represents a gauge transformation by \\varepsilon (and this applies even in the case where the physical symmetry of the system is global or even nonexistent; we are only worried about the invariance of the functional measure here), then\n:\\int \\delta_\\varepsilon \\left(\\mathcal{F} e^{iS}\\right) \\mathcal{D}\\phi  = 0\nexpresses the invariance of the functional measure where S is the action and \\mathcal{F} is a functional of the fields. If the gauge transformation corresponds to a global symmetry of the theory, then,\n:\\delta_\\varepsilon S=\\int \\left(\\partial_\\mu\\varepsilon\\right)J^\\mu\\mathrm{d}^dx = -\\int\\varepsilon \\partial_\\mu J^\\mu\\mathrm{d}^dx\nfor some \"current\" J (as a functional of the fields \\phi) after integrating by parts and assuming that the surface terms can be neglected.\nThen, the Ward–Takahashi identities become\n:\\langle\\delta_\\varepsilon\\mathcal{F}\\rangle - i\\int\\varepsilon\\langle\\mathcal{F}\\partial_\\mu J^\\mu \\rangle\\mathrm{d}^dx = 0\nThis is the QFT analog of the Noether continuity equation \\partial_\\mu J^\\mu=0.\nIf the gauge transformation corresponds to an actual gauge symmetry then\n:\\int\\delta_\\varepsilon\\left(\\mathcal{F}e^{i\\left(S+S_{gf}\\right)}\\right)\\mathcal{D}\\phi = 0\nwhere S is the gauge invariant action and S_{\\mathrm{gf}} is a non-gauge-invariant gauge fixing term. Gauge-fixing terms are required so as to be able to perform second quantization of a classical gauge theory. The path-integral (Lagrangian) formulation of quantum field theory does not entirely avoid the need for gauge-fixing, as there is still a need to compute the asymptotic states of the scattering matrix (e.g in the interaction picture.) In short, gauge-fixing is required, but it breaks the overall gauge invariance of the theory. The Ward–Takahashi identities then describe exactly how all of the different fields are tied to one-another, under an infinitessimal gauge transformation. These Ward–Takahashi identities are generated by the Ward operator; in the linearized form, the Ward operator is the BRST operator. The corresponding charge is the BRST charge. When the gauge theory is formulated on a fiber bundle, the Ward–Takahashi identities correspond to a (global) right-action in the principle bundle: they are generated by the Lie derivative on the vertical bundle.\nWhen the functional measure is not gauge invariant, but happens to satisfy\n:\\int\\delta_\\varepsilon\\left(\\mathcal{F}e^{iS}\\right)\\mathcal{D}\\phi = \\int\\varepsilon\\lambda\\mathcal{F}e^{iS}\\mathrm{d}^dx\nwith \\lambda is some functional of the fields \\phi, the corresponding relation gives the anomalous Ward–Takahashi identity. The conventional example is the chiral anomaly. This example is prominent in the sigma model theory of nuclear forces. In this theory, the neutron and proton, in an isospin doublet, feel forces mediated by pions, in an isospin triplet. This theory has not one, but two distinct global symmetries: the vector \\overline\\psi\\gamma_\\mu\\psi and the axial vector \\overline\\psi\\gamma_5 \\gamma_\\mu\\psi symmetries; equivalently, the left and right chiral symmetries. The corresponding currents are the isovector current (the rho meson) and the axial vector current. It is not possible to quantize both at the same time (due to the anomalous Ward–Takahashi identity); by convention, the vector symmetry is quantized so that the vector current is conserved, while the axial vector current is not conserved. The rho meson is then interpreted as the gauge boson of the vector symmetry, whereas the axial symmetry is spontaneously broken. The breaking is due to quantization, that is, due to the anomalous Ward–Takahashi identity (rather than to a Higgs-style Mexican-hat potential, which results in an entirely different kind of symmetry breaking). The divergence of the axial current relates the pion-nucleon interaction to pion decay, fixing g_A\\approx 1.267 as the axial coupling constant. The Goldberger–Treiman relation f_\\pi g_{\\pi N \\overline N} \\simeq g_A m_N relates g_A to the pion decay constant f_\\pi. In this way, the chiral anomaly provides the canonical description of the pion-nucleon interaction.\nReferences"
    }
  ]
}