{
  "content": [
    {
      "type": "text",
      "text": "# Wardun Yussof\n\n| birth_place = Brunei\n| height =\n| position = Goalkeeper\n| currentclub =\n| clubnumber =\n| youthyears1 =\n| youthclubs1 = Wijaya FC\n| years1 = 1999–2001\n| caps1 =\n| goals1 =\n| clubs1 = PAPP\n| years2 = 2000–2004\n| caps2 =\n| goals2 =\n| clubs2 = Brunei\n| years3 = 2002–2003\n| caps3 =\n| goals3 =\n| clubs3 = Wijaya\n| years4 = 2004\n| caps4 =\n| goals4 =\n| clubs4 = DPMM\n| years5 = 2005–2006\n| caps5 =\n| goals5 =\n| clubs5 = Wijaya\n| years6 = 2006–2024\n| caps6 = 185+\n| goals6 = 0\n| clubs6 = DPMM\n| years7 = 2010–2011\n| caps7 =\n| goals7 =\n| clubs7 = → Majra (loan)\n| years8 = 2024–2025\n| caps8 = 6\n| goals8 = 0\n| clubs8 = Kasuka\n| nationalyears1 = 2001\n| nationalcaps1 = 3\n| nationalgoals1 = 0\n| nationalteam1 = Brunei U23\n| nationalyears2 = 2000–2025\n| nationalcaps2 = 23\n| nationalgoals2 = 0\n| nationalteam2 = Brunei\n| club-update = 2 October 2025\n| nationalteam-update = 14 March 2025\n}}\nMohammad Wardun bin Yussof (born 14 September 1981) is a Bruneian former footballer who played as a goalkeeper. One of the finest goalkeepers Brunei has ever produced, Wardun took the mantle left by Ibrahim Abu Bakar and Yunos Yusof and spent over 20 years at the top of his field representing the national team as well as DPMM FC at club level, winning the S.League in 2015 as well as the Singapore Premier League in 2019.\nClub career\nWardun played for DPMM from 2006 to 2024, having returned from Wijaya FC after a brief spell in 2004. Previously, he was a squad member of the Brunei team that participated in the M-League.\n]]\nWardun was sent on loan to Majra FC in 2010 as Brunei (and in extension DPMM) served a two-year FIFA ban. He became the team captain in that period and even converted a penalty in the semi-final of the 2011 Brunei League Cup. He went on to win the final. Returning to the S.League with his parent club in 2012, Wardun became the undisputed number one ever since. He did not miss a game in the 2015 season when DPMM finally clinched the S.League title after coming close twice.\nOn 2 April 2017, Wardun dropped to the bench and missed his first league game in three years, allowing longtime rival Alizanda Sitom to be the oldest player to start in the S.League. The reason was due to an ankle injury. Another injury to his thumb in May further blighted his season, and in the end he managed only 8 starts in DPMM's disastrous 2017 campaign. Despite a pre-season injury to last season's starter Mu'izzuddin Ismail in 2018, Wardun was kept away from the starting lineup by the signing of youth international keeper Haimie Anak Nyaring. He finally made his bow for the season on 3 June against Albirex Niigata (S) after Haimie was red-carded in the 74th minute.\nAt the start of the 2019 season, Wardun became the starting goalkeeper under new coach Adrian Pennock, who also appointed him as team captain. He kept three clean sheets in consecutive matches for DPMM against Home United, Geylang International and Albirex Niigata (S) before finally conceding to a Khairul Amri strike in the 83rd minute in the home victory against Tampines Rovers on 7 April. His form continued into the second half of the season when on 6 July, in the away game against Warriors FC, Wardun produced a string of magnificent saves including saving a Jonathan Béhé penalty and keeping out a point-blank header by Khairul Nizam in the final minutes of the game to keep the score at 3–3 and thus salvage a point for DPMM. His age-defying save drew gratuitous praise from Pennock who compared it to a similarly iconic save by one of England's finest goalkeepers, Gordon Banks.\nOn 29 September 2019, Wardun lifted the Singapore Premier League trophy as DPMM captain after a 5–4 win against Hougang United concluded a triumphant league campaign for the Bruneian team. He also boasted the most clean sheets for the season with 10 in 24 games.\nWardun announced in January 2020 that he intended to retire at the end of the 2020 season. However, he continued to be affiliated with the club until February 2024. He subsequently moved to Kasuka FC and made his debut at the 2024–25 ASEAN Club Championship qualifying play-offs against Shan United on 17 July in a 1–1 draw. He then managed to win the Brunei domestic title with the club after going unbeaten for 13 matches.\nIn August 2025, Wardun was the starting keeper for Kasuka's qualifying matches for the 2025–26 ASEAN Club Championship and 2025–26 AFC Challenge League against DH Cebu and Phnom Penh Crown respectively. After failing to advance in both competitions, Wardun was replaced in the squad by Jefri Syafiq Ishak, ultimately signifying the end of his football career.\nInternational career\nWardun was first selected for the national team in the 2000 AFC Asian Cup qualification matches against Macau, Japan and Singapore. A year later, Wardun made his first start for Brunei at the 2002 World Cup qualifying round for Asia, in a 0–5 loss against Yemen on 7 April 2001. He appeared a total of four times in the campaign. He was in goal for the 2004 AFC Asian Cup qualification matches held in the Maldives.\nAfter a huge gap without any international appearances, Wardun played in the 2008 Suzuki Cup qualifying when the whole Brunei team was represented by his club, DPMM FC.\nWardun was the keeper when Brunei gained their first World Cup qualifying victory over Chinese Taipei in Kaohsiung on 12 March 2015. A year later, he was also in the starting lineup for the 2016 AFF Suzuki Cup qualification matches in Cambodia. Wardun conceded eight goals in three games as Brunei finished third in the qualifying group.\nWardun's next international tournament was a month later at the 2016 AFC Solidarity Cup held in Kuching, Malaysia. In the semi-final against Macau on 12 November, Wardun was sent off in the 55th minute for denying Niki Torrão a goal-scoring opportunity at the edge of the penalty box. Brunei went out 4–3 on penalties thereafter, with Tarmizi Mat Johari between the goalposts.\nWardun was included in the national team's 23-man squad for the 2018 AFF Suzuki Cup qualification matches against Timor-Leste in September 2018.\nAfter three years away from the national team, Wardun accepted a callup to the Wasps for the 2027 Asian Cup qualifying match against Lebanon hosted by Qatar on 25 March 2025. He was an unused substitute in a 5–0 loss.\nHonours\nClub\n;Wijaya FC\n* Brunei FA Cup: 2002\n;DPMM FC\n* Singapore Premier League: 2015, 2019\n* Singapore League Cup (3): 2009, 2012, 2014\n* Brunei FA Cup: 2022\n;Majra FC\n* Brunei League Cup: 2011\n;Kasuka FC\n* Brunei Super League: 2024–25\nIndividual\n* Singapore Premier League Golden Glove: 2014, 2019\n* Singapore Premier League Team of the Year: 2019\nPersonal life\nWardun has two sons and a daughter with his wife. The elder son, Wa'ie Haziq, is a Brunei under-23 youth international goalkeeper. The younger son, Wa'ie Harith, is also a goalkeeper.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}