{
  "content": [
    {
      "type": "text",
      "text": "# Ward Evangelical Presbyterian Church\n\n| attendance       = 2,500 (2011)\n| website          = [http://ward.church/ ward.church]\n}}\nWard Evangelical Presbyterian Church is a church located in Northville Township and Farmington Hills, Michigan, both suburbs of Detroit.\nHistory\nWard was started on May 1, 1956, in the Lincoln School in Livonia, Michigan. In 1960, Ward relocated to the corner of Farmington and 6 Mile. As the church was growing, Ward kept expanding. In 1972, an 1,100-seat sanctuary was opened, and in 1978, Knox Hall, the Calvin Room, and Children's and Student ministry spaces were completed. Ward also planted three daughter churches: Trinity Presbyterian Church in Plymouth in 1979, Grace Chapel in Farmington Hills in 1983, and Cornerstone Presbyterian Church in Brighton in 1986.\nThe church decided to withdraw from the United Presbyterian Church (now merged into the Presbyterian Church (USA)) and was instrumental in the creation of its current denomination, the Evangelical Presbyterian Church. In 1983, Ward purchased land at its current site at 6 Mile and Haggerty in Northville Township, and its new building was completed in March 1998. In 2022, Ward Church opened a second campus in Farmington Hills, at the corner of 12 Mile Road and Halsted. The building was formerly the location of Grace Chapel, a daughter church of Ward that opened its doors in the early 80s. The two churches voted in the winter of 2022 to merge their two congregations, thus creating Ward Church Farmington Hills.\nPastor\nDr. Bartlett L. Hess was the founding pastor, who served from 1956 to 1992.  Rev. Mark Brewer succeeded him, departing in 1994.  Perry Mobley then briefly served as interim.  Dr. James McGuire was called as senior pastor in October 1995 and served until September 2006. Rev. Joel Eidsness served as Interim Senior Pastor until December 2008, and in February 2009, Rev. Scott McKee began serving as senior pastor.\nReferences\nExternal links\n*[http://www.wardchurch.org Ward Evangelical Presbyterian Church]\n*[http://www.epc.org Evangelical Presbyterian Church]"
    }
  ]
}