{
  "content": [
    {
      "type": "text",
      "text": "# Wardian case__disambig_1\n\nA Wardian case\nThe Wardian case was an early type of terrarium, a sealed protective container for plants. It found great use in the 19th century in protecting foreign plants imported to Europe from overseas, the great majority of which had previously died from exposure during long sea journeys, frustrating the many scientific and amateur botanists of the time. The Wardian case was the direct forerunner of the modern terrarium and vivarium and the inspiration for the glass aquarium.\nIt is named after Nathaniel Bagshaw Ward (1791–1868) of London, who promoted the case after experiments. He published a book titled On the Growth of Plants in Closely Glazed Cases in 1842. A Scottish botanist named A. A. Maconochie had created a similar terrarium almost a decade earlier, but his failure to publish meant that Ward received credit as the sole inventor.\nHistory and development\nFour distinct styles of Wardian cases\nWard was a physician with a passion for botany. His personally collected herbarium amounted to 25,000 specimens. The ferns in his London garden in Wellclose Square, however, were being poisoned by London's air pollution, which consisted heavily of coal smoke and sulphuric acid.\nWard also kept cocoons of moths and the like in sealed glass bottles, and in one, he found that a fern spore and a species of grass had germinated and were growing in a bit of soil. Interested but not yet seeing the opportunities, he left the seal intact for about four years, noting that the grass actually bloomed once. After that time however, the seal had become rusted, and the plants soon died from the bad air. Understanding the possibilities, he had a carpenter build him a closely fitted glazed wooden case and found that ferns grown in it thrived.\nWard published his experiment and followed it up with a book in 1842, On the Growth of Plants in Closely Glazed Cases.\nEnglish botanists and commercial nurserymen had been passionately prospecting the world for new plants since the end of the 16th century, but these had to travel as seeds or corms, or as dry rhizomes and roots, as salty air, lack of light, lack of fresh water and lack of sufficient care often destroyed all or almost all plants even in large shipments. With the new Wardian cases, tender young plants could be set on deck to benefit from daylight and the condensed moisture within the case that kept them watered, but protected from salt spray.\nThe first test of the glazed cases was made in July 1833, when Ward shipped two specially constructed glazed cases filled with British ferns and grasses all the way to Sydney, Australia, a voyage of several months that found the protected plants still in good condition upon arrival. Other plants made a return trip: a number of Australian native species that had never survived the transportation previously. The plants arrived in good shape after a stormy voyage around Cape Horn.\nOne of Ward's correspondents was William Jackson Hooker, later director of the Royal Botanic Gardens, Kew. Hooker's son Joseph Dalton Hooker was one of the first plant explorers to use the new Wardian cases, when he shipped live plants back to England from Aotearoa/New Zealand in 1841, during the pioneering voyage of HMS Erebus that circumnavigated Antarctica.\nAnother style of Wardian case\nWardian cases soon became features of stylish drawing rooms in Western Europe and the United States. In the polluted air of Victorian cities, the fern craze and the craze for growing orchids that followed owed much of their impetus to the new Wardian cases.\nMore importantly, the Wardian case unleashed a revolution in the mobility of commercially important plants. In the 1840s, Robert Fortune used Wardian cases to ship 20,000 tea plants to British India, smuggling them out of Shanghai, China, to begin the tea plantations of Assam. In 1860, Clements Markham used Wardian cases to smuggle the cinchona plant out of South America. In the 1870s, after germination of imported hevea seeds in the heated glasshouses of Kew, seedlings of the rubber tree of Brazil were shipped successfully in Wardian cases to Ceylon (Sri Lanka) and the new British territories in Malaya to start the rubber plantations.\nWardian cases have thus been credited for helping break geographic monopolies in the production of important agricultural goods.\nKew Gardens used Wardian cases to ship plants abroad up until 1962.\nWardian cases unintentionally caused the introduction of many invasive species around the world, such as the Japanese honeysuckle, which invaded most of the United States and other countries from its native East Asia. The pathologist and horticulturalist Beverly Thomas Galloway, chief of the Bureau of Plant Industry, noted in 1924 that they were probably \"the means of scattering more dangerous insects, nematodes, and other pests over the earth than almost any other form of carrier.”\nThe oldest surviving Wardian case is believed to be from circa 1880, discovered at Tregothnan in 1999.\nWard was always active in the Society of Apothecaries of London, of which he became Master in 1854. Until 1899, the Society managed the Chelsea Physic Garden, London, the second oldest botanical garden in the UK. Ward was a founding member of both the Botanical Society of Edinburgh and the Royal Microscopical Society, a Fellow of the Linnean Society and a Fellow of the Royal Society.\nSee also\n*Vivarium\n*Pteridomania\n*Bottle garden\n*Biotope\nReferences\nFurther reading\n*\n*\n*\nExternal links\n*[https://www.plantexplorers.com/explorers/biographies/ward/nathaniel-bagshaw-ward.htm Biography of Nathaniel Bagshaw Ward]\n*[http://community.fortunecity.ws/greenfield/clearstreets/84/ward/dh321.html David Hershey's website devoted to Ward and his discovery]\n*[https://www.telegraph.co.uk/gardening/3296777/The-remarkable-case-of-Dr-Ward.html \"The Remarkable Case of Dr Ward\" at the Telegraph]"
    }
  ]
}