{
  "content": [
    {
      "type": "text",
      "text": "# Wardy Joubert III\n\nWardy \"Wood\" Joubert III (August 30, 1971 – December 11, 2016) was an American preacher, football coach and pornographic model, and the subject of an internet meme that has circulated since 2012.\nBiography\nJoubert was born on August 30, 1971, in San Francisco. He gained the nickname \"Wood\" as a kid while playing baseball. After high school he became a semi-pro arena football player. He worked as a football coach and as a deacon at the St. Paul Tabernacle Baptist Church in San Francisco.\nIn 2010 he took part in having erotic imagery taken of him as a side profession, ostensibly to make ends meet during tough financial times.\nJoubert died of a heart attack in 2016 at the age of 45.\nMeme\nIn 2009, Joubert modeled for a nude photo while sitting on a bed. This photo was published to the internet. A photoshopped version garnered attention for the morphed size of Joubert's penis. The meme, called \"Wood Sitting on a Bed\" was subsequently shared on websites such as 4chan and Reddit in 2012.\nIn 2020, the meme resurfaced as part of a COVID-19 prank, whereby the photo was shared on WhatsApp under the guise of being an alert related to the virus. On Reddit, a subreddit appeared under the name \"r/barrywood\" where users can upload newly created memes. The page contains a link to a GoFundMe page that was created after Joubert's death in 2016 to help with funeral expenses. On May 27, 2020, an update was added to the GoFundMe page stating that new donations would be used for \"boxed lunches and hygiene packs daily to families without housing in San Francisco. This is a cause that was very near and dear to Wardy's heart and we would like to keep up the good work and tradition of helping the person next to you without judgement.\" Some companies, including Barstool Sports and comedian Tom Segura, began to merchandise the photo by selling clothing with his image. Proceeds went to Joubert's family.\nIn May 2020, WIN News in Ballarat, Victoria accidentally broadcast a photoshopped video which included the photo of Joubert.\nOn February 1, 2022, an advertising magazine, Community Connections, was mailed out that included a full-page ad for Chiaro's Pizza & Restaurant in Bucks County Pennsylvania that had the infamous photo as the latte art of a cup of cappuccino. The family restaurant deeply apologized for it slipping past their and the magazine's proofreaders.\nReferences"
    }
  ]
}