{
  "content": [
    {
      "type": "text",
      "text": "# Ware River\n\n| mouth_location    = Three Rivers\n| mouth_coordinates =\n| length            =\n| source1_elevation =\n| mouth_elevation   =\n| discharge1_avg    =\n| basin_size        =\n}}\nThe Ware River is a  river in central Massachusetts. It has two forks, its West Branch, which begins in  Hubbardston, Massachusetts, and its East Branch, which begins in Westminster, Massachusetts. The Ware River flows southwest through the middle of the state, joins the Quaboag River at Three Rivers, Massachusetts, to form the Chicopee River on its way to the Connecticut River.\nThe Brigham Pond Dam, forming a pond of the same name, first impounds the West Branch of the Ware River in Hubbardston. The East Branch of the River originates north of Bickford Pond in Westminster, near the adjoining town of Princeton. Much of Hubbardston lies within the Ware River watershed and feeds tributaries of the Ware and Millers rivers, the Millers River running generally west, and the Ware River running generally southwest. The Ware River is part of the Massachusetts Water Resources Authority drinking water system serving the greater Boston area. There is also a flood control dam on the Ware River in Hubbardston and Barre. This dam was constructed by and is maintained by the US Army Corps of Engineers. Large sections of the Ware River Watershed are owned and/or maintained by the Massachusetts Department of Conservation and Recreation including 22,000 acres in the vicinity of the dam.\nHistory\nThe river was named for early fish weirs (locally pronounced). In 1928 the building of a  aqueduct connecting the Ware River to the Wachusett Reservoir commenced a major public works undertaking. The  massive horseshoe-shaped conduit, known as the Wachusett-Coldbrook Tunnel, had to be blasted through solid rock at a depth of . The arrival in 1931 of the first water from the Ware River by way of this tunnel probably saved the Wachusett Reservoir from drying up, for a prolonged drought had reduced Wachusett’s water supply to less than 20 percent of capacity.\nIn 1933 the Quabbin Aqueduct was completed, ready to transport water from the Quabbin Reservoir under construction. The Swift River Diversion tunnel is in full use, bypassing water around the dam area.\nTopography\nThe Ware River starts at an elevation of about  above sea level, fed from the numerous small streams within its watershed, before ending at the village of Three Rivers at an elevation of about . The river flows through many historic mill towns where its fall towards the sea provided power. One of the largest such towns is Ware, Massachusetts, which shares its name. This river is part of the Connecticut River Watershed.\nTowns along the river\n* Barre (South Barre, Barre Plains)\n* Hardwick (Gilbertville, Old Furnace, Wheelwright)\n* Hubbardston\n* Princeton\n* Ware\n* Westminster\n* Warren\n* Palmer (Three Rivers, Thorndike)\nSignificant structures\nBarre Falls Dam north of Barre\nBarre Falls Dam\nThe Barre Falls Dam is located on the Ware River in Hubbardston, Massachusetts, about  below the junction of the river's east and west branches and  northwest of Worcester. Designed and constructed by the United States Army Corps of Engineers, this dam substantially reduces flooding along the Ware, Chicopee, and Connecticut rivers. Construction of the project began in May 1956 with completion in July 1958 at a cost of $2 million.\nThe project consists of an earth fill dam with stone slope protection  long and  high. There are three dikes totaling  in length, with a maximum elevation of . Cut in rock, the spillway comprises a concrete weir  in length. The weir's crest elevation is  lower than the top of the dam. There is no lake at the Barre Falls Dam. The flood storage area for the project, which is normally empty, stores floodwaters and covers about  in the towns of Barre, Hubbardston, Rutland, and Oakham. The entire project, including all associated lands, covers . The Barre Falls Dam can store up to  of water for flood control purposes. This is equivalent to  of water covering its drainage area of .\nThe Barre Falls reservoir is located within the Upper Ware River Watershed. The Massachusetts Department of Conservation and Recreation (MDCR) manages and preserves the land for water quality protection. The Massachusetts Water Resources Authority (MWRA) manages these water resources, which are part of the public water supply for the metropolitan Boston area.\nWare River Diversion\nThe Ware River Diversion facility feeds Ware River water into the Quabbin Aqueduct. This is used to start a natural siphon so water can flow from the Quabbin to the Wachusett Reservoir, or from Wachusett Reservoir to the Quabbin Reservoir.\nSee also\n*List of rivers of Massachusetts\nReferences\n*\n*\n*[https://waterdata.usgs.gov/nwis/inventory/?site_no=01172500 Ware River near Barre]\n*[https://archive.today/20121213025958/https://webcam.crrel.usace.army.mil/barre_plains/ Ware River Web Cam near Barre Plains]\n*[https://web.archive.org/web/20041025201509/https://webcam.crrel.usace.army.mil/barre_plains/images/Bp1camerajpeg.htm Ware River Web Cam archive]\n*[http://www.warelibrary.org/johnson.htm Town of Ware on the Ware River]\n*[https://ma.water.usgs.gov/basins/chicopeesfw.htm Chicopee River basin]\n*[http://www.foquabbin.org/chronology.html History of the Quabbin Reservoir and Ware River development]\n*[https://www.flickr.com/photos/joeforjette/255584947/ Ware River near Coldbrook]\n*[http://home.manhattan.edu/~walter.matystik/wcb/2/files/boston.htm Court order and statement of facts about MWRA facilities]\n*[http://www.mass.gov/dcr/waterSupply/watershed/warelmp.htm Ware River Watershed Land Management Plan]"
    }
  ]
}