{
  "content": [
    {
      "type": "text",
      "text": "# Wareham St Martin\n\nWareham St Martin is a civil parish in the English county of Dorset. The parish is administered by a parish council with 11 members. At the 2021 census, it had a population of 2,615.\nWith an area of , Wareham St Martin is larger than the average parish in Dorset, and it includes a mostly rural area north of the town of Wareham, including much of Wareham Forest. The only significant settlement within the parish is the village of Sandford on the A351 road between Wareham and Poole. The parish also includes the Holton Heath trading estate. It is in Dorset unitary district, and for elections to Dorset Council it is part of Wareham electoral ward. It is within the Mid Dorset and North Poole constituency of the House of Commons.\nThe parish can trace its origins to the ancient parish of St Martin's Church on Wareham's north walls. However, as Wareham's built-up area grew beyond the walls and into areas that were in Wareham St Martin, such as at Northport, the area of the Wareham St Martin parish has on several occasions been reduced by transfers of the new developments to Wareham town (initially to St Mary's parish, and later to Wareham municipal borough and now the modern Wareham Town civil parish).\nDemographics\n{| class=\"wikitable sortable\" style=\"text-align:center;\"\n|+ Census population of Wareham St Martin parish\n|-\n! scope=col width=18%| Census\n! scope=col width=18% class=\"unsortable\"| Population\n! scope=col width=18% class=\"unsortable\"| Female\n! scope=col width=18% class=\"unsortable\"| Male\n! scope=col width=18% class=\"unsortable\"| Households\n! scope=col width=10% class=\"unsortable\"| Source\n|-\n!scope=row| 1921\n|| 530\n||\n||\n||\n||\n|-\n!scope=row| 1931\n|| 769\n||\n||\n||\n||\n|-\n!scope=row| 1951\n|| 1,296\n||\n||\n||\n||\n|-\n!scope=row| 1961\n|| 2,109\n||\n||\n||\n||\n|-\n!scope=row| 1971\n|| 2,740\n||\n||\n||\n||\n|-\n!scope=row| 1981\n|| 3,370\n||\n||\n||\n||\n|-\n!scope=row| 1991\n|| 2,480\n||\n||\n||\n||\n|-\n!scope=row| 2001\n|| 2,752\n|| 1,379\n|| 1,373\n|| 1,113\n||\n|-\n!scope=row| 2011\n|| 2,774\n|| 1,377\n|| 1,397\n|| 1,133\n||\n|-\n!scope=row| 2021\n|| 2,615\n|| 1,353\n|| 1,262\n|| 1,101\n||\n|}\nReferences\nExternal links\n*[http://www.warehamstmartinpc.org.uk/ Wareham St Martin Parish Council]"
    }
  ]
}