{
  "content": [
    {
      "type": "text",
      "text": "# Warehouse Theatre (Stephens)\n\n}}\nThe Warehouse Theatre is a black box theatre operated by Stephens Collage in Columbia, Missouri, and serves as a performance space for student-run productions, including those from the Conservatory for the Performing Arts. As a women's college, Stephens has historically admitted a very limited number of males as students in the School of Creative and Performing Arts Theatre and Dance programs. The theater typically does four shows per year, two per semester.\nThe theater regularly hosts musicals, plays, and student-produced works, with tickets managed through the college's online box office.\nThe Warehouse Theatre Company, a student-led organization, produces several shows each season and offers students hands-on experience in directing, acting, and stage management.\nMission statement\n”The Warehouse fosters freedom of material and vision by producing original scripts, avant-garde pieces, and socially poignant works which, more often than not, highlight women’s issues and experiences.”\nThe Warehouse Board\nThere are usually 11 members on the Warehouse board. These members are in charge of different aspects of the company. As a whole, they make important decisions about the Warehouse season, including choosing the shows, and also plan and organize events, such as fundraisers or open mic nights. While the first year, second year, and conservatory representatives are elected at the beginning of the new academic year, the other board members are elected at the middle of the second semester of the previous year.\nEvents\nIn addition to putting on four shows, the Warehouse hosts numerous events throughout the year.\nWarehouse Dance\nGenerally at the end and/or beginning of the school year the Warehouse will host a themed dance for all to enjoy.\nOpen Mic Night\nOne Wednesday every month, the Warehouse hosts an open mic night. These open mic nights are designed as a way to give Stephens students an outlet to express themselves and entertain others. Students can dance, sing, perform, do stand-up, read poetry or do whatever they want. Students of all majors are encouraged to come and show off what they can do.\nPlay-in-a-Day\nStarting in February 2012 the Warehouse hosted a 24-Play Festival. Students wrote, directed, memorized, designed, and performed an hour of 10-minute plays, all in 24 hours. In 2019, this was scheduled to be replaced with the first-ever Short Play Festival but was canceled due to COVID-19.\nPast events\nThe Warehouse had a few traditions that have not been passed on in recent years, but up until then had been annual. Some are as follows.\nMusical revue\nIn the past, the Warehouse presented a musical revue every year. The revue is entirely musically directed, choreographed and performed by students. In 2009, the revue was entitled Bombs Away: A Musical Revue of Flops and in 2008, it was called ''De-Briefing: A Night of Women Singing Some of Musical Theatre's Most Popular Songs for Men.\nShows\n{| class=\"wikitable\"\n!Show\n!Author\n!Year\n!Type\n|-\n|Gidion's Knot\n|Johnna Adams\n|October 2020\n|Drama (filmed)\n|-\n|Everyman\n|unknown\n|February 2020\n|Drama\n|-\n|Neighborhood 3: Requisition of Doom\n|Jennifer Haley\n|November 2019\n|Thriller\n|-\n|The Amish Project\n|Jessica Dickey\n|September 2019\n|Drama\n|-\n|Anton in Show Business\n|Jane Martin\n|April 2019\n|Comedy\n|-\n|Machinal\n|Sophie Treadwell\n|February 2019\n|Drama\n|-\n|Sans Merci\n|Johnna Adams\n|December 2018\n|Tragedy\n|-\n|The Anastasia Trials in the Court of Women\n|Carolyn Gage\n|October 2018\n|Drama\n|-\n|Chamber Music/No Exit\n|Arthur Kopit/Jean-Paul Sartre\n|April 2009\n|One acts\n|-\n|Moonlight and Valentino\n|Ellen Simon\n|February 2009\n|Sentimental comedy\n|-\n|Bombs Away: A Revue of Flops\n|\n|February 2009\n|Musical revue\n|-\n|The Great Cross Country Race''\n|Alan Broadhurst\n|November 2008\n|Children's show\n|-\n|Snake in the Grass\n|Alan Ayckbourn\n|October 2008\n|Thriller\n|-\n|One Act Play Festival\n|\n|April 2008\n|\n|-\n|Triptych\n|Edna O'Brien\n|February 2008\n|Drama\n|-\n|The Most Massive Woman Wins\n|Madeleine George\n|November 2007\n|Drama\n|-\n|De-Briefing\n|\n|October 2007\n|Musical revue\n|-\n|Naomi in the Living Room\n|Christopher Durang\n|October 2007\n|Absurd\n|-\n|Marion Bridge\n|Daniel MacIvor\n|April 2007\n|Sentimental comedy\n|-\n|43 Plays for 43 Presidents\n|Chicago's Neo-Futurists Theatre Collective\n|February 2007\n|Absurd\n|-\n|Cover of Life\n|R.T. Robinson\n|November 2006\n|\n|-\n|Extremities\n|William Mastrosimone\n|October 2006\n|Drama\n|}\nAcademic Role\nThe Warehouse Theatre plays a central role in Stephens College's Conservatory for the Performing Arts, serving as a hands-on training ground for students enrolled in performance-based degree programs. Most notably, it is used by students pursuing a Bachelor of Fine Arts (BFA) in Musical Theatre and a BFA in Theatre Arts, who participate in all aspects of production — from acting and directing to lighting, costuming, and stage management.\nThis immersive environment is designed to mirror professional standards, allowing students to build practical experience and gain creative autonomy within a controlled academic framework. As part of their coursework, students audition for roles, propose original works, and engage in collaborative critique, guided by faculty and guest artists. The Warehouse Theatre Company — a fully student-run organization — frequently produces shows in the space, often selecting material and overseeing production schedules independently, fostering leadership and entrepreneurship in young theater-makers.\nThe Warehouse is considered an extension of the classroom, providing what Stephens College calls a “learn-by-doing” conservatory model. Productions staged here are often tied to semester-long learning goals and serve as capstone projects or juried performances.\nReferences\nExternal links\n*[https://www.stephens.edu/academics/programs-of-study/sopa/theatre-arts/ Stephens College Theater Department]\n*[https://warehousetheatreco.wixsite.com/whtco/ Warehouse Theatre Company Website]"
    }
  ]
}