{
  "content": [
    {
      "type": "text",
      "text": "# Warea, New Zealand\n\n| subdivision_type4       = Community\n| subdivision_name4       = Taranaki Coastal Community\n| seat_type               = Electorates\n| seat                    =\n| leader_title            = Territorial Authority\n| leader_name             = South Taranaki District Council\n| leader_title1           = Regional council\n| leader_name1            = Taranaki Regional Council\n| leader_title2           = Mayor of South Taranaki\n| leader_name2            =\n| leader_title3           = New Plymouth MP\n| leader_name3            =\n| leader_title4           = Te Tai Hauāuru MP\n| leader_name4            =\n| unit_pref               = Metric\n| area_footnotes          =\n| area_total_km2          = 42.15\n| population_footnotes    =\n| population_as_of        = 2023\n| population_total        = 390\n| population_density_km2  = auto\n| image_map               = |zoom=9}}\n| coordinates             =\n}}\nWarea is a community in the west of Taranaki, in the North Island of New Zealand. It is located on State Highway 45, 26 kilometres north of Ōpunake. The local Pūniho Marae, also known as Tarawainuku Marae, is a traditional meeting ground of the Taranaki Iwi hapū of Ngā Māhanga. It includes the Kaimirumiru and Ko Pauna te Tipuna meeting houses.\nDuring the First Taranaki War in April 1860, government troops crossed the Hangatahua River and attacked Māori settlements and a mill around Warea. On 28 April 1865 during Second Taranaki War, Warea was the location of a government fortification, Warea Redoubt. The redoubt was abandoned in early 1868.\nDemographics\nWarea locality covers . The locality is part of the larger Parihaka statistical area.\n}}\nWarea had a population of 390 in the 2023 New Zealand census, an increase of 39 people (11.1%) since the 2018 census, and an increase of 48 people (14.0%) since the 2013 census. There were 210 males and 177 females in 147 dwellings. 2.3% of people identified as LGBTIQ+. There were 102 people (26.2%) aged under 15 years, 51 (13.1%) aged 15 to 29, 204 (52.3%) aged 30 to 64, and 27 (6.9%) aged 65 or older.\nPeople could identify as more than one ethnicity. The results were 87.7% European (Pākehā); 23.1% Māori; 2.3% Pasifika; 0.8% Asian; and 1.5% Middle Eastern, Latin American and African New Zealanders (MELAA). English was spoken by 96.2%, Māori by 6.9%, Samoan by 0.8%, and other languages by 4.6%. No language could be spoken by 3.1% (e.g. too young to talk). New Zealand Sign Language was known by 0.8%. The percentage of people born overseas was 9.2, compared with 28.8% nationally.\nReligious affiliations were 30.0% Christian, 1.5% Māori religious beliefs, 0.8% Buddhist, 1.5% New Age, and 1.5% other religions. People who answered that they had no religion were 62.3%, and 5.4% of people did not answer the census question.\nOf those at least 15 years old, 63 (21.9%) people had a bachelor's or higher degree, 162 (56.2%) had a post-high school certificate or diploma, and 69 (24.0%) people exclusively held high school qualifications. 45 people (15.6%) earned over $100,000 compared to 12.1% nationally. The employment status of those at least 15 was 177 (61.5%) full-time, 39 (13.5%) part-time, and 6 (2.1%) unemployed.\nReferences"
    }
  ]
}