{
  "content": [
    {
      "type": "text",
      "text": "# Wareham High School\n\n| established = 1991\n| campus      = Urban\n| principal   = Scott Palladino\n| grades      = 812\n| ratio       = 9.25\n| staff       = 63.01 (FTE)\n| enrollment  = 583 (2023–2024)\n| mascot      = Viking\n| colors      = Blue & Gold\n| rivals      = Bourne, Old Rochester\n| newspaper   = \"The Viking Times\"\n| yearbook    = \"The Caper\"\n| location    = 7 Viking Dr.,Wareham, MA 02571\n| country     = United States\n| website     =\n}}\nWareham High School is a public high school located in Wareham, Massachusetts, United States. The school is a part of the Wareham Public School System, and serves roughly 500 students in grades 812. Wareham High School's colors are Blue, Gold & White, and their mascot is the Vikings.\nEnrichment activities\nThere are over 25 clubs and activities students can become involved in, and the school is known for its  award-winning DECA organization, marching band and drama program. The band may be small but is mighty and energetic. They have entertained the fans at football games for years with popular stand tunes and half time shows. The band's past shows include Spy themes, The Beatles, Blues Brothers, songs from the 70s and most recently \"Songs from the 80's\". They also have a club called Key Club which they do community service activities serving our wareham community.\nThe drama program, known as the \"Viking Theater Company\" instills discipline, hones group skills, exposes students to the rigors of work under pressure and to the rewards of committed, goal-oriented effort, while performing a straight play, a musical, and several shorter pieces every school year.\nAthletics\nWareham is renowned for its powerful boys' basketball and football teams. The football team has won 6 South Coast Conference titles and has had 5 undefeated regular season (1978, 1980, 1995, 2004, 2006). They won the State Title in 1995, guided by All-American quarterback and linebacker, Stephen Cooper, who is currently an NFL linebacker for the San Diego Chargers. Wareham were also the State runners-up in 1980 and 2006. The Wareham football program has produced numerous Division 1 and NFL players, including Stephen Cooper (UMaine & NFL), Shea Allard (Delaware & NFL), Mike Laperriere (Northeastern), Wayne Sylvester (Kansas), and Darien Fernandez (Laramie - Wyoming).\nThe boys' basketball team is regarded as one of the best high school teams in New England. They won the 2009-2010 Division 3 State Championship. They have also compiled 4 undefeated seasons since 2002, and have competed in 5 Regional Championships and 3 State Championship games. They won state championships in 2010, 2023, and 2024.\nThe color guard team has been the state champions in their division a total of three times. The years were: 2011 for their show \"Glitter in the Air\", 2012 for their show \"Titanic\" and 2014 for their show \"Stormy Love\".\nAs of 2023-2024, Wareham High competes in the Mayflower Athletic Conference for athletics, which competes at the Division 3 and 4 levels of athletics in Massachusetts. Their nickname is the \"Vikings,\" and their colors are Blue, White & Gold. Wareham's main rival in neighboring Bourne High School. They have played each other in the annual Thanksgiving Day football game every year since 1933, over 80 years. In 2018 and 2019, they have lost by a combined score of 82-0.\n*FALL\n**Football\n**Boys' Soccer\n**Girls' Soccer\n**Field Hockey\n**Golf\n**Girls' Volleyball\n**Cheerleading\n**Cross Country\n**Color Guard\n*WINTER\n**Boys' Hockey\n**Girls' Hockey (w/ Mashpee and Bourne)\n**Boys' Basketball\n**Girls' Basketball\n**Indoor Track\n**Cheerleading\n**Wrestling\n** Color Guard\n*SPRING\n**Baseball\n**Softball\n**Boys' Tennis\n**Girls' Tennis\n**Track & Field\nNotable alumni\n*Stephen Cooper - Class of 1997, NFL linebacker for the San Diego Chargers, played college football at University of Maine, All-State Quarterback & Linebacker at Wareham.\n*Geena Davis - Class of 1974. Movie actress.\n*Leroy Gomez - Class of 1968. American singer and songwriter best known for his work with Santa Esmeralda.\n*Joshua Onujiogu - Class of 2016. NFL linebacker for the Seattle Seahawks, played college football at Framingham State University, MASCAC Defensive Player of The Year.\nReferences\nExternal links\n*[http://warehamps.org/ Wareham Public School System]"
    }
  ]
}