{
  "content": [
    {
      "type": "text",
      "text": "# Waren (port)\n\n}}\nWaren, also known as Warn, Waren Bay, Warenmouth and Warenquay, was a seaport at Budle Bay, on the north-east coast of England. The recorded history of the port spans from the 1240s to the early twentieth century.\nWaren was England's northernmost mainland port during periods in which Berwick Upon Tweed was controlled by the Kingdom of Scotland. The port was associated with Bamburgh and its castle, situated  to the east-south-east.\nGeography\nBudle Bay is a  square-plan mudflat open to the north sea on its north-east side. Two burns form channels across the bay; the Waren Burn enters at its southern corner and the smaller Ross Low from the western corner. These meet in the intertidal zone and continue east to the low water mark as Budle Water.\nThe port at Waren was situated on Budle Water, where a quay and pier were built on the south bank, and extended west along the Waren Burn as far as Waren Mill.\nThe main settlements close to the port are Waren Mill, and Bamburgh, which having a north-east facing seafront of sandy beach, with a rocky foreshore to the north-east, provides no shelter for anchorage. Budle Water is the closest natural harbour.\nHistory\nThe placement of a Roman fort, Outchester, on the north bank of the Waren Burn at Spindlestone Mill,  upstream of Waren Mill, is taken to indicate an intention to secure the Waren harbour and a route from it to the Devil's Causeway.\nIn post-Roman times, the dolerite outcrop on which Bamburgh Castle is situated was a centre of regional power dating back at least to the Celtic Brittonic fort of  Din Guarie, and may have been the capital of the kingdom of Bernicia, the realm of the Gododdin people.\nThe recorded history of the port dates to a royal charter of 26 April 1247, granted to the burgesses of the new borough of Warenmouth. The port and settlement were founded by William Heron, sheriff of Northumberland from 1246 and keeper of Bamburgh Castle from 1248, on the common land of Bamburgh in the vicinity of the contemporary farm of Newtown, east of Budle. The charter granted the same liberties and customs to Warenmouth as had been extended to those of Newcastle Upon Tyne, including the right to hold a market; inception of a merchant guild, and exemption from trial by battle and jurisdiction to settle trade disputes within the borough, the sheriff acting as bailiff.\nIn its earliest years Warenmouth appears to have acted chiefly as a fishing port. Its fortune seems to have fallen with that of Bamburgh Castle, which was besieged for nine-months during the War of the Roses before falling in 1464 to the Yorkists, and entering an unsettled period in which its ownership twice reverted to the Crown.\nStafford Linsley, in Ports and Harbours of Northumberland, asserts that the name Warenmouth fell into disuse in the fourteenth century, in favour of Newtown; and that the port \"seems to have been quite forgotten by 1575\", a reference to enquiries made about Bamburgh and its estate in June 1575, when local jurors were asked where 'the Cee Towne' was, and replied 'There is at this day no place or towne of that name, that we can know, unlesse that be menie [sic] of the towne of Bamburgh, which is scituate not far from the foresaid castle, on the west parte thereof, and hath been a borough and market towne, but now not frequented with market, but in manner decayed, and the most parte thereof desolate and unbielded.'\nWaren is recorded in a 1753 return to the Court of Exchequer as being a harbour or creek within the administrative Port of Berwick.\nThe port in the early 1800s is described in Grace Darling and her Times:\nBesides the grain trade and its use as a fishing port, Linsley records exports from the port of whinstone, transported from quarries south of the port on rail tracks running across what is now the perimeter of a golf course.\nWaren is recorded in nineteenth century shipowner and port directories, still as part of the Port of Berwick. In 1843 it is specified as having  of water on spring tides, and  on neap tides, but with a shifting bar. Pilots, normally from Holy Island harbour, were necessary, and a steam boat was kept at the port to tow vessels into and out of the port. Linsley traces advice on the use of Waren to as late as 1948, when mariners were warned of the Warnham bar and advised that entry should not be attempted without assistance from pilots from Holy Island or Seahouses.\nReferences"
    }
  ]
}