{
  "content": [
    {
      "type": "text",
      "text": "# Waresboro, Georgia\n\n|postal_code_type                = ZIP code\n|postal_code              = 31503\n|area_code                       = 912\n|blank_name               = FIPS code\n|blank_info               =\n|blank1_name              = GNIS feature ID\n|blank1_info              =\n|website                  =\n|footnotes                =\n}}\nWaresboro is an unincorporated community and census-designated place (CDP) in Ware County, Georgia, United States, located west of Waycross. The community is part of the Waycross micropolitan statistical area.\nThe 2020 census listed a population of 375.\nHistory\nIn 1824, Waresboro was the first county seat of Ware County. In 1860, newspaperman and lawyer Carey Wentworth Styles practiced law in Waresboro, after moving to the community from Brunswick where he had been mayor. While in Waresboro, Styles published the Georgia Forester, a weekly newspaper. In 1861, Styles was elected as a delegate from Ware County to the Georgia Secession Convention where, along with the other delegate from Ware, Col. William Angus McDonald, Styles voted to secede.  Styles left Waresboro at the beginning of the Civil War, when he enlisted in the Confederate Army. After the war, he moved to Atlanta, where he founded The Atlanta Constitution.\nA railroad junction located some miles away from Waresboro grew into the city of Waycross, which eventually became the hub of commerce in Ware County. In 1873, Waycross replaced Waresboro as the county seat, sending the Waresboro area into a slow decline.\nThe community of Waresboro was granted a city charter by act of the Georgia General Assembly on December 9, 1893. As the neighboring city of Waycross grew, the fortunes of Waresboro diminished.\nEventually, the city reverted to an unincorporated community, which remains the current status.\nAccording to the Waycross Journal Herald dated November 13, 1975, Louise Mock donated the oldest home in Ware County to the Okeefenokee Heritage Center. The house originally stood at the intersection of Church Street and Old Stagecoach Road, before being moved, in 1982, to the Heritage Center, where it underwent partial restoration. It was the home of General Thomas Hilliard, and is preserved as The Hillard House at the Heritage Center. It is now on display, and contains furniture, implements, and tools of the period of original occupation.\nDemographics\n2020\n}}\nWaresboro was first listed as a census designated place in the 2020 U.S. census.\n{| class=\"wikitable\" style=\"text-align:center;\"\n|+Waresboro CDP, Georgia – Racial and ethnic composition\n!Race / Ethnicity (NH = Non-Hispanic)\n!Pop 2020\n!% 2020\n|-\n|White alone (NH)\n|327\n|87.20%\n|-\n|Black or African American alone (NH)\n|20\n|5.33%\n|-\n|Native American or Alaska Native alone (NH)\n|1\n|0.27%\n|-\n|Asian alone (NH)\n|0\n|0.00%\n|-\n|Pacific Islander alone (NH)\n|0\n|0.00%\n|-\n|Some Other Race alone (NH)\n|1\n|0.27%\n|-\n|Mixed Race or Multi-Racial (NH)\n|7\n|1.87%\n|-\n|Hispanic or Latino (any race)\n|19\n|5.07%\n|-\n|Total\n|375\n|100.00%\n|}\nIn 2020, it had a population of 375.\nReferences\nExternal links\n* [https://vanishingsouthgeorgia.com/category/waresboro-ga/  Vanishing South Georgia - Photos of Waresboro]\n* [http://vault.georgiaarchives.org/digital/collection/vg2/id/15837  Image of original Ware County Courthouse in Waresboro (1870-1880)]"
    }
  ]
}