{
  "content": [
    {
      "type": "text",
      "text": "# Ware Opening\n\n|moves = 1.a4\n|ECO = A00\n|birth =\n|nameorigin = Preston Ware\n|AKA = Meadow Hay Opening\n}}\nThe Ware Opening, also known as Meadow Hay Opening, is an uncommon chess opening for White beginning with the move:\n: 1. a4\nIt is named after Preston Ware, a U.S. chess player who often played uncommon openings. The Ware is considered an irregular opening; it is classified under the A00 code in the Encyclopaedia of Chess Openings.\nOpening idea\nThe Ware Opening attacks the b5-square and prepares to bring the a1-rook into the game. The b5-square is non-essential and if Black plays 1...e5, the f8-bishop prevents the development of the white rook for the moment. The reply 1...e5 also gains space for Black in the center, a typical objective of most openings but one completely ignored by the Ware Opening. Noting all this, the Ware Opening is normally seen played only by players completely new to chess.\nAn experienced player using the Ware Opening will usually meet a response of 1...d5 or 1...e5 with 2.d4 or 2.e4, respectively, since a reversed Scandinavian or Englund Gambit would be unsound here. After 1...d5 2.Nf3, 2...Nf6 is recommended, since a reversed Fajarowicz can arise after 2...c5 3.e4!? dxe4 4.Ne5 where a4 has some utility.\nIn the 2012 World Blitz Championship, 1.a4 was employed as a little joke by Magnus Carlsen against Teimour Radjabov, who during the blitz championship two years earlier had told him \"Everyone is getting tired. You might as well start with 1.a4 and you can still beat them.\" The game soon turned into a sort of Four Knights Game where Carlsen finally prevailed.\nCarlsen also played this in the blitz portion of the 2022 Norway chess tournament, ultimately losing to Wesley So.\nVariations\nThere are several named variations of the Ware Opening. The best known of these are:\n* 1...e5 2.a5 d5 3.e3 f5 4.a6 (Ware Gambit).  In this variation, White attempts to create an open file in exchange for a pawn.\n* 1...e5 2.h4 (Crab Variation). This version is generally chosen more for its aesthetic considerations than its strategic ones; white's pawns extend like a crab's pincers, preparing to attack on the sides.\n* 1...b6 2.d4 d5 3.Nc3 Nd7 (Cologne Gambit).\n* 1...b5 2.axb5 Bb7 (Wing Gambit of the Ware Opening).\n* 1...a5 (Symmetric Variation).\n* 1... e5 2. Ra3 (Meadow Hay Trap)\nSee also\n* Corn Stalk Defense – sometimes known as the \"Ware Defense\"\n* List of chess openings\n* List of chess openings named after people\nReferences\nBibliography\n*\n*\n*\n*\n*\nde:Unregelmäßige Eröffnungen#Ware-Eröffnung"
    }
  ]
}