{
  "content": [
    {
      "type": "text",
      "text": "# Warfare (film)\n\n| writer         =\n| producer       =\n| starring       =\n| cinematography = David J. Thompson\n| editing        = Fin Oates\n| music          =\n| studio         = DNA Films\n| distributor    = A24\n| released       =\n| runtime        = 95 minutes\n| country        =\n| language       = English\n| budget         = $20&nbsp;million\n| gross          = $33.6 million\n}}\nWarfare is a 2025 war film written and directed by Ray Mendoza and Alex Garland. Based on Mendoza's experiences during the Iraq War as a U.S. Navy SEAL, the film depicts an encounter on 19 November 2006 after the Battle of Ramadi. The script is drawn from the testimonies of the platoon members and is presented in real time. It stars an ensemble cast including D'Pharaoh Woon-A-Tai as Mendoza, alongside Will Poulter, Cosmo Jarvis, Kit Connor, Finn Bennett, Joseph Quinn, and Charles Melton. The film is dedicated to platoon member Elliott Miller (portrayed by Jarvis in the film), who lost his leg and ability to speak in the incident.\nWarfare premiered at the Music Box Theatre in Chicago on 16 March 2025, and was released in the United States by A24 on 11 April 2025, and in the United Kingdom on 18 April. The film received positive reviews and has grossed $33.6 million worldwide.\nPlot\nIn 2006, after the Battle of Ramadi, Navy SEAL platoon Alpha One takes control of a local two-story house under the cover of darkness. JTAC communications officer Ray Mendoza coordinates air support to monitor their position, while sniper and corpsman Elliott Miller monitors a market down the street with fellow sniper Frank. They are providing overwatch in support of a joint operation with the marines.\nIraqi translators Farid and Sidar communicate with the two families who live on separate floors of the building, gathering them in one of the bedrooms. The team observes increasing enemy activity, and air support leaves the area. ANGLICO Lieutenant McDonald radios for air assets while the translators warn that the enemy has broadcast a call to arms. Leading Officer in Charge Erik and Leading Petty Officer Sam orders the translators to guard the lower level of the building.\nA grenade is thrown into the sniper's room. Elliott is injured, and a CASEVAC is called to evacuate him while the SEALs and the insurgents exchange gunfire. The team gathers their gear and blow Claymore mines to clear the perimeter. Through dense smoke cover, the translators lead Elliott, Sam, Erik, Ray, and machine gunner Tommy out to the waiting U.S. Army M2 Bradley. As its ramp drops, an IED is detonated. Farid is killed; Sidar flees; Elliott and Sam are severely wounded; Ray, Erik, and Tommy suffer concussions. The Bradley crew, also sustaining casualties, withdraws.\nAlpha One falls back and regroups in the house, tending to Sam and Elliott's severe injuries. Sam constantly screams in agony while Elliott remains unconscious. Erik urgently calls Alpha Two to redeploy onto their position, but their advance is delayed by firefights in the street. Air support returns, but because enemy fighters are so close to Alpha One's position, McDonald can only coordinate a show of force. Ray and Erik's traumatic brain injuries cause them to dissociate and become badly disoriented. Elliot eventually regains consciousness, and morphine is applied to him and Sam.\nAlpha Two reach Alpha One's building; Erik allows Alpha Two leader, Jake, to take command. Jake's request for another CASEVAC is denied for fear of another IED attack. He orders his communications officer, John, to impersonate the brigade's commanding officer to approve their evacuation. The SEALs provide covering fire as Elliott and Sam are each loaded into a Bradley and successfully extracted. The remaining soldiers return to the house with insurgents converging on their position. Believing they might have infiltrated the second floor from the roof, Jake orders two other Bradleys to take out the top deck of their building. Under the cover of another show of force, Alpha One and Alpha Two are extracted by the Bradleys and leave the neighborhood under heavy fire. The families in the house slowly emerge from the bedroom, relieved that the soldiers have left. The surviving insurgents cautiously gather in the street.\nThe film ends on the title card: For Elliott. Before the end credits roll, the real SEAL Team 5 involved in the mission are shown participating in the production of the film, alongside a photo montage that shows the actual house, the declassified/classified individuals involved and the actors portraying them.\nCast\nWith the exception of Mendoza and Miller, all real-life figures were given aliases for their characters.\nAlpha One Platoon\n* D'Pharaoh Woon-A-Tai as Ray Mendoza, a communicator/JTAC\n* Will Poulter as Erik, a Lieutenant and Officer in Charge, leader of Alpha One\n* Cosmo Jarvis as Elliott Miller, a Corpsman and lead sniper\n* Kit Connor as Tommy, a gunner and the youngest member of Alpha One\n* Taylor John Smith as Frank, a sniper\n* Michael Gandolfini as USMC Lieutenant 'Mac' McDonald, an ANGLICO and Fire Support Officer\n* Adain Bradley as USMC Sergeant Laerrus, an ANGLICO enlisted Marine assisting McDonald\n* Joseph Quinn as Sam, the Leading Petty Officer (based on Joe Hildebrand)\n* Nathan Altai as Farid, an Iraqi translator assisting Alpha One\n* Heider Ali as Sidar, an Iraqi translator assisting Alpha One\nAlpha Two Platoon\n* Charles Melton as Jake, a Lieutenant J.G. and Assistant Officer in Charge, leader of Alpha Two\n* Finn Bennett as John, a communicator/JTAC for Alpha Two\n* Noah Centineo as Brian Zawi, a gunner (based on Brian Alazzawi) in Alpha Two\n* Evan Holtzman as Brock, a sniper in Alpha Two\n* Henry Zaga as Aaron, a point man in Alpha Two\n* Alex Brockdorff as Mikey, a point man/gunner in Alpha Two\n* Aaron Deakins as Bob, a member of Alpha Two\nIraqi Family\n* Donya Hussen as Noor\nProduction\nIn February 2024, it was announced that A24 was developing a war film with Ray Mendoza and Alex Garland attached, which would follow Garland's film Civil War, for which Mendoza was military supervisor. The duo wrote the script and planned to direct the film together. At the time of the announcement, Charles Melton was in negotiations to star, and Joseph Quinn was being considered for the cast. D'Pharaoh Woon-A-Tai was cast to portray Mendoza himself in March 2024, when the title was confirmed to be Warfare, with Kit Connor, Cosmo Jarvis, Will Poulter, and Finn Bennett being added to the cast. That month, Garland announced he would step back from directing films and focus on writing, announcing that his directorial role in Warfare would be more of a supporting role to Mendoza's. In April 2024, Noah Centineo, Taylor John Smith, Adain Bradley, Michael Gandolfini, Henry Zaga, and Evan Holtzman joined the cast. Filming took place at Bovingdon Airfield Studios in the UK.\nRelease\nWarfare was released by A24 in the United States on 11 April 2025. The film premiered at the Hollywood American Legion Theater in Los Angeles on 12 March 2025, in front of veterans and members of the military community and featured a questions and answers session with the directors after the screening.  The film had a star-studded red carpet premiere in Los Angeles on 27 March 2025.\nThe film had a UK premiere at Battersea Power Station Cinema on 1 April 2025, which was attended by many of the cast and crew, before going on general release in the UK on 18 April 2025.\nThe film is scheduled to be available to stream on HBO Max starting 12 September 2025.\nReception\nBox office\n, Warfare grossed $26 million in the United States and Canada, and $6.9 million in other territories, for a worldwide total of $32.9 million.\nIn the United States and Canada, Warfare was released alongside The Amateur, Drop, and The King of Kings, and was projected to gross $6–9&nbsp;million from 2,670 theaters in its opening weekend. The film made $3.6 million on its first day, including an estimated $1.16&nbsp;million from preview screenings throughout the week. It went on to debut to $8.3 million, finishing fourth at the box office. In its second weekend the film made $4.9 million (a drop of 41%), finishing in fifth.\nCritical response\nAudiences polled by CinemaScore gave the film an average grade of \"A–\" on an A+ to F scale (tied with The Iron Claw for the highest grade earned by an A24 film), while those surveyed by PostTrak gave it a 90% overall positive score, with 67% saying they would definitely recommend the film.\nIn a five-star review for the BBC, critic Caryn James wrote, \"together, Garland's virtuosity and Mendoza's first-hand experience create a masterful technical achievement that is, more important, emotionally harrowing.\" Critic Wendy Ide of The Guardian also gave Warfare five stars, writing that the film, \"doesn't just show you the horrors of war; it forces you to taste the dust and the choking panic, smell the fear and the cordite and the tinny metallic tang of spilled blood\", and favorably compared it with other war films such as Saving Private Ryan, Come and See, and All Quiet on the Western Front.\nIn a mixed review, Gregory Nussen of Deadline Hollywood wrote: \"At best, Warfare is an artfully made recreation; at worst it is naked military propaganda set during one of the country's most egregious moments of imperialism.\"\nAccolades\n{| class=\"wikitable sortable plainrowheaders\"\n|+\n! scope=\"col\" | Award\n! scope=\"col\" | Date of ceremony\n! scope=\"col\" | Category\n! scope=\"col\" | Recipient(s)\n! scope=\"col\" | Result\n! scope=\"col\" class=\"unsortable\" |\n|-\n! rowspan=\"2\" scope=\"row\"| Astra Midseason Movie Awards\n| rowspan=\"2\"| 3 July 2025\n| Best Picture\n| rowspan=\"3\"| Warfare\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n| Best Stunts\n|\n|-\n! scope=\"row\"| Critics Choice Super Awards\n| 7 August 2025\n| Best Action Movie\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Taormina Film Festival\n| 14 June 2025\n| Premio Migliore Regia (Best Director Award)\n| Alex Garland and Ray Mendoza\n|\n| align=\"center\"|\n|-\n! scope=\"row\" rowspan=\"7\"| British Independent Film Awards\n| rowspan=\"7\"| 30 November 2025\n| Best Casting\n| Kharmel Cochrane\n|\n| align=\"center\" rowspan=\"7\"|\n|-\n| Best Editing\n| Fin Oates\n|\n|-\n| Best Effects\n| Simon Stanley-Clamp, Ryan Conder\n|\n|-\n| Best Make-Up & Hair Design\n| Paul Gooch, Tristan Versluis\n|\n|-\n| Best Production Design\n| Mark Digby\n|\n|-\n| Best Sound\n| Sound team\n|\n|-\n| Best Ensemble Performance\n| D'Pharaoh Woon-A-Tai, Will Poulter, Cosmo Jarvis, Kit Connor, Finn Bennett, Joseph Quinn, Charles Melton\n|\n|-\n|}\nReferences\nExternal links\n*"
    }
  ]
}