{
  "content": [
    {
      "type": "text",
      "text": "# Warfield Lectures\n\nThe Warfield Lectures are named in honor of Annie Kinkead Warfield, the wife of Benjamin Breckinridge Warfield professor of theology at the Princeton Theological Seminary from 1887 to 1921.\nWhere lectures have been published the book titles are below.\nLecturers\n* 1959 - James I. McCord \"The Grace of God in Christian Theology\"\n* 1960 - John K. Reid \"The Life in Christ\"\n* 1961 –  Zwingli: A Reformed Theologian\n* Apr. 1962 – Karl Barth Evangelical Theology: An Introduction\n* Nov. 1962 - Kenneth Joseph Foreman Identification: Human and Divine\n* 1964 – Hendrikus Berkhof The Doctrine of the Holy Spirit\n* 1965 – John McIntyre The Shape of Christology: Studies in the Doctrine of the Person of Christ\n* 1966 - Otto Weber \"Calvin’s Doctrine of the Church\"\n* 1967 - James M. Robinson \"The New Testament as Hermeneutic\"\n* 1968 - Roger Mehl Catholic Ethics and Protestant Ethics\n* 1969 - Ronald Gregor Smith (cancelled due to his passing) The Doctrine of God\n* 1970 – John E. Smith The Analogy of Experience: An Approach to Understanding Religious Truth\n* 1971 - Lukas Vischer \"Church and Mankind\"\n* 1972 - Langdon Gilkey \"Providence and Eschatology: Theological Reflections on History and Politics\"\n* 1973 – Paul Ricoeur \"Philosophical and Theological Hermeneutics\"\n* 1974 - William O. Fennell God’s Intention for Man: Essays in Christian Anthropology\n* 1975 - Daniel Thomas Jenkins Christian Maturity & Christian Success\n* 1976 - C. A. Van Peursen\n* 1977 - Robert McAfee Brown \"Theology in a New Day: An Exercise in Transposition\"\n* 1978 – George S. Hendry \"The Theology of Nature\"\n* 1979 –  \"The Commandments and the Common Life\", published posthumously as The Decalogue and a Human Future (1995)\n* 1981 – Thomas F. Torrance The Trinitarian Faith: The Evangelical Theology of the Ancient Catholic Church\n* 1982 – Hugh T. Kerr\n* 1983 – Jane Dempsey Douglass Women, Freedom, and Calvin\n* 1984 – Lesslie Newbigin Foolishness to the Greeks: The Gospel and Western Culture\n* 1986 – Letty M. Russell Household of Freedom: Authority in Feminist Theology\n* 1989 – John W. de Gruchy Liberating Reformed Theology (1991)\n* 1991 – Michael Welker   Creation and Reality\n* 1993 – Colin Gunton A Brief Theology of Revelation\n* 1994 – B.&nbsp;A. Gerrish Saving and Secular Faith: Toward a Systematic Theology\n* 1995 – Shirley Guthrie Always Being Reformed: Faith for a Fragmented World\n* 1996 – Christina Baxter\n* 1997 – Karlfried Froehlich ''Sensing the Scriptures: Aminadab's Chariot and the Predicament of Biblical Interpretation\n* 2000 –  Protestant Theology at the Crossroads: How to Face the Crucial Tasks for Theology in the Twenty-First Century\n* 2001 – J.&nbsp;B. Torrance\n* 2002 – James M. Gustafson An Examined Faith: The Grace of Self-Doubt\n* 2003 – John Polkinghorne Science and the Trinity: The Christian Encounter With Reality\n* 2004 –  The Barmen Theses Then and Now\n* 2007 – Kathryn Tanner Christ the Key\n* 2009 – Randall C. Zachman Reconsidering John Calvin\n* 2009 – David Fergusson The Providence of God: A Polyphonic Approach\n* 2011 – David Kelsey\n* 2012 – Cornelius Plantinga Reading for Preaching: The Preacher in Conversation with Storytellers, Biographers, Poets, and Journalists\n* 2013 – Jennifer Herdt Assuming Responsibility: Ecstatic Eudaimonism and the Call to Live Well\n* 2014 –  This Incredibly Benevolent Force. The Holy Spirit in Reformed Theology and Spirituality\n* 2015 – Sarah Coakley\n* 2016 – J. Kameron Carter\n* 2018 –\n* 2022 –\n* 2024 - Philip G. Ziegler God's Adversary and Ours: A Brief Theology of the Devil''\nReferences"
    }
  ]
}