{
  "content": [
    {
      "type": "text",
      "text": "# Wargame: AirLand Battle__disambig_1\n\n}}\n|engine       = IrisZoom v3\n|genre        = Real-time strategy\n|modes        = Single-player, multiplayer\n|platforms    = Windows, Linux, OS X\n}}\nWargame: AirLand Battle is a real-time strategy video game developed by Eugen Systems and published by Focus Home Interactive, released on May 29, 2013. It is set in Europe during the Cold War, most specifically in the years 1975–85. The game is the sequel to the Wargame: European Escalation.\nGameplay\nWargames playable factions are the Warsaw Pact, which is subdivided into the Soviet Union, Communist Poland, East Germany, and Czechoslovakia; and NATO, which is subdivided into the United States of America, United Kingdom, France, West Germany, Canada, Sweden, Norway, and Denmark. Players can choose various units from the subfactions of the side they are playing on, unlocking new units or improved variants as they progress. Each country has its own arsenal of units, reflecting their military doctrine. It is possible to create a 'deck' or battlegroup focusing on various criteria, with the option to mix units from multiple nations' armories.\nCampaigns\nWargame: Airland Battle includes four campaigns that can be played alone or cooperatively with another player. The turn-based portions of all four campaigns take place on the same map depicting Northern Europe.\nMultiplayer\nWargame: AirLand Battle is a primarily multiplayer game. There are several game modes to play.\nThe majority of multiplayer games are skirmish battles, where players fight against other players and/or AI generated opponents with custom built decks. These battles vary in size, location, and style, adding to generally unique experience for each game.\nReception\n| Destruct = 8.5/10\n| EuroG = 8/10\n| GSpot = 8/10\n| IGN = 8.4/10\n| PCGUS = 87/100\n| PCPP = 9/10\n}}\nWargame: AirLand Battle has received generally positive reviews upon release, with a Metacritic score of 80/100.\nSequel\nWargame: Red Dragon was released in April 2014. It is set during the Cold War but after the original games, in East Asia. It introduces China, Japan, North Korea, South Korea, and the ANZAC (Australia and New Zealand) as new factions. The campaign focuses around a Korea conflict during the 1980s. It introduces naval warfare to the Wargame series.\nSee also\n* List of PC exclusive titles\n* Wargame: European Escalation\n* Wargame: Red Dragon\n* Victory! The Battle for Europe\nReferences\nExternal links\n*"
    }
  ]
}