{
  "content": [
    {
      "type": "text",
      "text": "# Wargrave & Shiplake Regatta\n\nThe Wargrave & Shiplake Regatta is a regatta on the River Thames in England. It is the local regatta of the villages of Wargrave in Berkshire and Shiplake in Oxfordshire. Some of the boats used are of a traditional clinker-built style, others are fibre-glass.\nThe regatta is believed to have been officially founded in 1867, although regatta activity also took place here in the 1850s. It takes place annually on the Oxfordshire bank of the river, on the reach above Marsh Lock.\nThe Berkshire Chronicle of 31 August 1867 tells us that a Wargrave Regatta took place the previous Wednesday, August 28, on a course from Bolney Island to Wargrave Ferry, under the auspices of Wargrave Yacht Club. However, the Parish Magazine mentions that this followed a gap of eleven years, suggesting that a local regatta had been held at some time in the 1850s; and a silver rudder engraved Wargrave Regatta 1856 was recently found. However no official records are known to establish the date of the first regatta exactly. 1867 is taken as the 'official' date of birth.\nThe regatta attracts over 1,000 competitors taking part in around 400 races, making it is the second largest Thames regatta after the Henley Royal Regatta. It is held over two days at the beginning of August. The course is about  long, with the start close to Shiplake Railway Bridge. Races go downstream.\nThere are races for:\n* Canadian Canoes\n* Dinghies\n* Dongolas\n* Punts\n* Skiffs\nDongola races\nThese are split into categories:\n* Grand Dongola – competitive races for all types of crew\n* Veteran Dongola – competitive races where crew members must be over 45 years of age\n* Thames Dongola – for entrants taking the event less seriously\n* Under 17 and Under 12 Dongola – for junior crews\nSee also\n* Dongola racing\n* Rowing on the River Thames\n* Skiffing\nReferences\nExternal links\n* [http://www.wsregatta.co.uk/ Official Regatta website]\n* [http://www.wsregatta.co.uk/about.php What is Wargrave & Shiplake Regatta?]"
    }
  ]
}