{
  "content": [
    {
      "type": "text",
      "text": "# Wargames Research Group\n\n-->\n| founder             = Phil Barker, Bob O'Brien, and Ed Smith\n| founding_location   = United Kingdom\n| dissolved           =\n| merger              =\n| type                =\n| tax_id              =\n| registration_id     =\n| status              =\n| purpose             =\n| professional_title  =\n| headquarters        = United Kingdom\n| location_city       =\n| location_country    =\n| location_city2      =\n| location_country2   =\n| addnl_location_city =\n| addnl_location_country =\n| addnl_location_city2 =\n| addnl_location_country2 =\n| coordinates         =\n| origins             =\n| region_served       =\n| products            =\n| services            =\n| methods             =\n| fields              =\n| membership          =\n| membership_year     =\n| language            =\n| owner               =\n| sec_gen             =\n| leader_title        =\n| leader_name         =\n| leader_title2       =\n| leader_name2        =\n| leader_title3       =\n| leader_name3        =\n| leader_title4       =\n| leader_name4        =\n| board_of_directors  =\n| key_people          =\n| main_organ          =\n| parent_organization =\n| subsidiaries        =\n| secessions          =\n| affiliations        =\n| budget              =\n| budget_year         =\n| revenue             =\n| revenue_year        =\n| disbursements       =\n| expenses            =\n| expenses_year       =\n| endowment           =\n| endowment_year      =\n| staff               =\n| staff_year          =\n| volunteers          =\n| volunteers_year     =\n| students            =\n| students_year       =\n| awards              =\n| website             =\n| remarks             =\n| formerly            =\n| footnotes           =\n| bodystyle           =\n}}\nThe Wargames Research Group (WRG) is a British publisher of rules  and reference material for miniature wargaming. Founded in 1969 they were the premier publisher of tabletop rules during the seventies and eighties, publishing rules for periods ranging from ancient times to modern armoured warfare, and reference books which are still considered standard works for amateur researchers and wargamers. They are best known for their seminal ancient and medieval period rules, and also for De Bellis Antiquitatis and Hordes of the Things fantasy rules.\nHistory\nWRG was founded by Phil Barker, Bob O'Brien, and Ed Smith in 1969, when they published War Game Rules: 1000 B.C. to 500 A.D..\nThe rules quickly gained widespread acceptance through the miniature wargaming world, especially in the UK, and quickly became the acknowledged standard for ancient warfare. WRG followed with rules for other periods which gained similar widespread acceptance.\nInnovative features of the rules included:\n* morale rules, based on a reaction test which evaluated the tactical situation of a unit as well as the casualties it had suffered. The results of the reaction test could result in players' losing control of their troops.  Not only would troops on occasion flee but they could also go into uncontrolled advance.\n* Up till 1969 the normal way of recording casualties was to remove figures.  The WRG rules made use of the nominal 1:20 figure scale, in which one wargames figure represented 20 men.  Casualties were considered as lost men and noted down with figures being removed only when a whole 20 had been lost. This was regarded as a major innovation.\nWhile very much a minority interest, both the 6th Edition and the 7th Edition continue to be played even at a competition level.  Both, however, are no longer supported by WRG.\nWRG rules have been sufficiently widely adopted that other popular rule sets sometimes choose to adopt the same basing requirements for figures to avoid requiring rebasing of the large number of WRG-based armies.  Aspects of the WRG basing system such as the intermediate group of infantry between heavy and skirmisher infantry have, however, come under criticism.\nAt the beginning of the 1990s WRG introduced  De Bellis Antiquitatis (DBA) which was a radical simplification of ancient and medieval wargaming. The concepts of DBA were adapted to allow significantly larger games, which led to  De Bellis Multitudinis (DBM) for Ancient and medieval and De Bellis Renationis (DBR) for Renaissance. The DBx series of rules are still in widespread use, the latest incarnation being De Bellis Magistrorum Militum (DBMM).\nDBA was also adapted to a fantasy setting in Hordes of the Things.\nSignificance\nWRG rules were a significant milestone in the development of modern miniature wargaming, and attempted to  use historical research to provide historical realism in wargames. Thus, the WRG referred to the original historical texts as the basis for their reference works, rules sets and army lists, and their historical publications are often found in wargaming and other bibliographies.\nThe reference works published by WRG are aimed at the wargamer rather than the academic history student, but are nonetheless accurate enough to be occasionally cited in more scholarly texts.\nProducts\nRules\nAncients & Medievals\nIn seven editions, normally referred to by wargamers just by the edition number.\n* War Games Rules 1000 B.C to 500 A.D, 1st Edition, Ancient War Games Research Group, Feb 1969.\n* War Games Rules 1000 B.C to 500 A.D., 2nd Edition, Ancient War Games Research Group, July 1969\n* War Games Rules 1000 B.C. to 1000 A.D., 3rd Edition, War Games Research Group, September 1971\n* War Games Rules 1000 B.C. to 1000 A.D., 4th Edition, War Games Research Group, August 1973\n* Wargames Rules 3000 B.C - 1250 A.D, 5th Edition, Wargames Research Group, 1976 The 5th Edition revised the order system, laying down more rigorously what orders could be given.\n* Wargames Rules 3000 BC to 1485 AD, 6th Edition, Wargames Research Group, 1980\n* Wargames Rules 3000 BC to 1485 AD, Revised 7th Edition, Wargames Research Group, 1986\n* Wargames Rules 3000 BC to 1485 AD, Amended 7th Edition, Wargames Research Group, 1987* Warrior is a development of this edition.\nRenaissance\n* Rulettes for 16th Century Naval Warfare, Wargames Research Group, 1978\n* Wargames Rules 1420-1700 George Gush 2nd Edition, Wargames Research Group, 1979\nHorse and Musket\n* Wargames Rules 1750 - 1850, Wargames Research Group, January 1971.\n* Wargames Rules 1685-1845, Wargames Research Group, 1979\n* ''Corps d'Armee: Napoleonic Rules for Large Scale Wargames, Geoffrey Wootten, Wargames Research Group, 1989\nModern\n* War Games Rules Infantry Action 1925-1975, War Games Research Group, June 1972.\n* War Games Rules Armour & Infantry 1925-1950, War Games Research Group, June 1973\n* War Games Rules Armour & Infantry 1950-1975, War Games Research Group, January 1974\n* War Games Rules for Armoured Warfare 1950-1985, Wargames Research Group, 1979\n* War Games Rules 1925-1950: Wargames Rules for All Arms Land Warfare from Platoon to Battalion Level, Wargames Research Group, 1988\n* War Games Rules 1950-2000: Wargames Rules for All Arms Land Warfare from Platoon to Battalion Level, Wargames Research Group, 1993\nDBx\n* DBA\n** De Bellis Antiquitatis, Wargames Research Group, 1990\n** De Bellis Antiquitatis, Version 2.0, Wargames Research Group, 2001\n** De Bellis Antiquitatis, Version 3.0, Wargames Research Group, 2014\n* DBM\n** De Bellis Multitudinis 3000 BC to 1500 AD, Phil Barker and Richard Bodley Scott. Wargames Research Group, 1993\n* DBR\n** De Bellis Renationis' 1494 AD to 1701 AD, Phil Barker and Richard Bodley Scott, Wargames Research Group, 1995\n* Hordes (Fantasy)\n** Hordes of the Things, Phil Barker, Sue Laflin Barker & Richard Bodley Scott, Wargames Research Group, 1991\n** Hordes of the Things, Phil Barker, Sue Laflin Barker & Richard Bodley Scott, 2nd Edition, Wargames Research Group, 2002\n** Hordes of the Things, Phil Barker, Sue Laflin Barker & Richard Bodley Scott, Version 2.1, Wargames Research Group, 2014\n* DBMM\n** De Bellis Magistrorum Militum 3000 BC to 1500 AD, Phil Barker, 2007 (Partizan Press, not WRG)\n** De Bellis Magistrorum Militum 3000 BC to 1515 AD, Version 2.0, Phil Barker, Wargames Research Group, 2010\n** De Bellis Magistrorum Militum 3000 BC to 1525 AD, Version 2.1, Phil Barker, Wargames Research Group, 2016\nOther\n* Richard Nelson, Naval wargames rules: fleet action (September 1973, 20pp and two copies of a quick reference card).\n* Decline and Fall, board game about the fall of the Roman Empire.\n* Seastrike'', Robin Wyatt, ('modern' naval warfare, copyright 1973, the forward is dated March, 1974). Miniatures/board game hybrid tabletop game, with plastic-laminated cardboard counters depicting ships, aircraft, and emplacements, 24 page rulebook, rules summary cards, custom movement and firing range rulers, card deck for combat resolution, cardboard islands, orders envelopes contain paper mission orders and orders cards packaged in a glossy cardboard file folder with naval silhouette artwork. The play area is the table surface, with cardboard island terrain. Ships are depicted by counters of various sizes with hull outlines and systems icons to be erasably crossed off to indicate damage. The rules use measured distance and angles like miniatures rules.\nArmy Lists\nAncients & Medievals\n* Army Lists For use with rules 3000 B.C - 1250A.D. War Games Research Group, 1977.\n* Army Lists For use with wargames rules 3000 BC to 1485 AD Book One - 3000 BC - 75 AD, Wargames Research Group, 1981\n* Army Lists For use with wargames rules 3000 BC to 1485 AD Book Two - 55 BC - 1000 AD, Wargames Research Group, 1982\n* Army Lists For use with wargames rules 3000 BC to 1485 AD Book Three - Armies Originating After 1000 AD, Wargames Research Group, 1982\n* Army Lists Volume 1: Armies of the Ancient Near East 3000BC - 500BC, D. Hutchby & S. Clark, Wargames Research Group, 1992\n* Army Lists Volume 2: Armies of the Far East, Asia and America, D. Hutchby & S. Clark, Wargames Research Group, 1993.\nRenaissance\n* Army Lists For use with rules 1490 A.D - 1660 A.D, War Games Research Group, 1978.\n* Army Lists For use with Wargames Research Group Wargames Rules 1420 - 1700, George Gush, Wargames Research Group, 1984\nDBx\n* D.B.M. Army Lists Book 1: 3000 BC - 500 BC, Phil Barker & Richard Bodley Scott, Wargames Research Group, 1993\n* D.B.M. Army Lists Book 2: 500 BC - 476 AD, Phil Barker & Richard Bodley Scott, Wargames Research Group, 1993\n* D.B.M. Army Lists Book 3: 476 AD - 1071 AD, Phil Barker & Richard Bodley Scott, Wargames Research Group, 1994\n* D.B.M. Army Lists Book 4: 1071 AD - 1500 AD, Phil Barker & Richard Bodley Scott, Wargames Research Group, 1994\n* D.B.R. Army Lists Book 1: Armies of the Great Italian Wars, Valois-Habsburg-Tudor Wars, Turkish Wars, Chinese and Japanese Wars, The Americas and of the Reformation, Phil Barker, Wargames Research Group, 1995\nReference Books\n* Warfleets of antiquity.\n* Tony Bath, Setting up a wargames campaign, Wargames Research Group, May 1973 (75pp).\n** Chapters \"How to set up your campaign\", \"map movement\", \"contacts, battles and after affects\", \"umpires - and the lack of same\", \"supply and replacement\", \"characterisation\", \"campaign extras\", \"horse and musket campaigns\", \"Victorian campaigns\", \"World War I\", \"World War II\", \"mini campaigns\", and \"naval campaigns\".\n* Tony Bath, Setting up a Wargames Campaign Revised Third Edition, Wargames Research Group, 1986.\n* Alan Buttery, Armies and Enemies of Ancient Egypt and Assyria: 3200 BC to 612 BC, Wargames Research Group, 1974.\n* John P Greer, The Armies and Enemies of Ancient China 1027 BC - 1286 AD, Wargames Research Group, 1975.\n* Richard Nelson, Armies of the Greek and Persian Wars 500 to 350 BC, Wargames Research Group, 1975\n* Ian Heath, Armies of Feudal Europe 1066-1300, Wargames Research Group, 1977\n* Ian Heath, Armies and Enemies of the Crusades 1096-1291, Wargames Research Group, 1978\n* Ian Heath, Armies of the Dark Ages 600-1066, Second Edition, Wargames Research Group, 1980\n* Phil Barker, The Armies and Enemies of Imperial Rome 150 BC to 600 AD, Fourth Edition, Wargames Research Group, 1981\n* Duncan Head, Armies of the Macedonian and Punic Wars 359 BC to 146 BC, Wargames Research Group, 1982.\n* Ian Heath, ''Armies of the Middle Ages, Volume 1: The Hundred Years' War, the Wars of the Roses and the Burgundian Wars, 1300-1487, Wargames Research Group, 1982\n* Ian Heath,  Armies of the Middle Ages, Volume 2: The Ottoman Empire, Eastern Europe and the Near East, 1300-1500, Wargames Research Group, 1984\n* Nigel Stillman and Nigel Tallis, Armies of the Ancient Near East 3000 BC to 539 BC'', Wargames Research Group, 1984.\nReferences\n*http://uts.cc.utexas.edu/~sparta/topics/articles/academic/booklist.htm\n*https://www.fordham.edu/halsall/med/sloan.html\n*https://www.parthia.com/webreport_6.htm\n*http://www.laconia.org/gen_info_literature/Peloponnesian_war.htm\n*http://www.theiwf.org/dbmClarifications.html\n*http://www.iworg.com/ratings/\nExternal links\n*[http://www.wargamesresearchgroup.net/ The Wargames Research Group — web site]"
    }
  ]
}