{
  "content": [
    {
      "type": "text",
      "text": "# Warhammer 40,000: Shootas, Blood & Teef\n\n| platforms    =\n| released     = 20 October 2022\n| genre        = Run and gun, platform\n| modes        = Single-player, multiplayer\n|alt =\n}}\nWarhammer 40,000: Shootas, Blood & Teef is a run and gun platform video game set in the Warhammer 40,000 universe, developed and published by Rogueside. It was released for Microsoft Windows, PlayStation 5 and Xbox Series X/S on 20 October 2022. In the game the player takes control of an Ork warrior leading an invasion of the planet Luteus.\nGameplay\nPlayers can choose one of four classes for their Ork character. Health and grenades can be restored through pickups. Teef (teeth) are used as an in-game currency which can be used to purchase new weapons or cosmetic items. Ammunition is infinite but when a weapon's magazine is empty it must be reloaded. As players kill enemies a WAAAGH meter is charged which, when filled, increases fire rate. It uses 2D graphics.\nDevelopment and release\nRogueside is a Belgian game development studio that had previously released another sidescrolling run and gun game, Guns, Gore & Cannoli. Tech lead Baptiste Deboutte said the game blended elements of platformers, run and gun games, and ballistic shooters. Comparing the game to Metal Slug, the developer highlighted the twin-stick controls as distinctive and made to improve the game's dynamism. First announced in June 2021 at Warhammer Skulls 2021, a Games Workshop video game announcements livestream, the game was released on 20 October 2022 for Microsoft Windows and Nintendo Switch, on 25 October 2022 for Xbox One and Xbox Series X/S, and on 2 December 2022 for PlayStation 4 and PlayStation 5.\nReception\nSwitch: 67/100\n| TA   = 3.5/5\n| rev1 = Softpedia\n| rev1Score = 5/5\n| rev2 = The Games Machine\n| rev2Score = 8.2/10\n}}\nAccording to review aggregator Metacritic, Warhammer 40,000: Shootas, Blood & Teef received \"generally favorable reviews\" on Windows and mixed reviews on Switch. Softpedia said that \"the mechanics and the presentation are well integrated, and the combat mechanics are top notch.\" PC Gamer praised its replayability and art style. The short length of the game was criticised.  The Switch port was criticised for performance issues.\nShootas, Blood & Teef was also reviewed by Power Unlimited, and CG Magazine.\nReferences\nExternal links\n*"
    }
  ]
}