{
  "content": [
    {
      "type": "text",
      "text": "# Warhammer: Dark Omen\n\n|EU|1998}}PlayStationApril 7, 1998\n| genre = Real-time tactics\n| modes = Single player, Multiplayer\n| platforms = Microsoft Windows, PlayStation\n}}\nWarhammer: Dark Omen is a fantasy real-time tactical wargame based upon the Warhammer Fantasy Battle table-top game and figurines, and is the sequel to the 1995 game Warhammer: Shadow of the Horned Rat. Developed by Mindscape, in conjunction with Games Workshop, and published by Electronic Arts, the game was released in Spring 1998 for Microsoft Windows and PlayStation. The game's story takes place within the Warhammer Fantasy setting, and focuses on the efforts of a mercenary army to combat a threat to the Old World by a vast army of undead forces led by a powerful entity that has recently arisen.\nWhile the game features similar mechanics to that of Shadow of the Horned Rat, it featured a number of improvements including greater 3D generated terrains (which was supported through the first-generation Voodoo 3dfx 3D accelerator card effects), a more streamlined interface system, and an improved army management system, but with more focus on a linear storyline that offers players choices of how to proceed at various intervals, affecting what units and magic items they receive, and what battles they undertake. Despite incorporating more usage of 3d graphics, the limited hardware of 1998 meant that all units in the game utilised 2D sprites (\"billboarding\") to render them.\nSince its release, most reviews of the game have been favourable, complimenting the improvements made over its predecessor, though with some criticism levied against its difficulty level and a few limitations with the new interface system.\nGameplay\nThe player's cavalry charging Goblin archers.\nAs with Shadow of the Horned Rat, the game focuses on players taking on a variety of battles that incorporate a mixture of medieval warfare and fantasy elements, while employing the use of units based within the Warhammer Fantasy setting, ranging from infantry, cavalry, ranged, artillery, wizards, and specialised units. Much of the gameplay from its predecessor remains the same, in that players are required to deploy units before a battle, and must win by killing/routing all enemy units, while losing if all their units are killed/routed from the battlefield. Losses made in engagements can be replaced when between battles, while units can be given magic items to use to help them with enemies. In addition, wizards can cast spells when the player has enough magical power available to them, which builds up over time, with the spell's cost determining how much power is used.\nCompared to its predecessor, Dark Omen features a number of upgrades and improvements to gameplay. The first is the greater incorporation of 3d terrains, which as a direct result, means ranged and artillery units are affected by the \"line-of-sight\" rule - these units must have a clear visual of a target, before they can engage them. The second is an improved interface system for the player to use with units, including onscreen HUD indicators to help keep track of friendly and enemy units, especially when they're not shown on the player's screen. Unlike Shadow of the Horned Rat, the single-player campaign focuses on a linear path that features choices the player must make - these choices determine what battles the player encounters, what units they can take on into their army, and what items they can pick up - but includes an improved army management system, allowing the player to freely reinforce units that have lost soldiers, improve their armour (if applicable), make note of which units are new and which are temporary, and provide better control over the arrangement of magic items for units.\nOne major inclusion to Dark Omen is a multiplayer mode, in which players can compete online against others, leading armies based upon the factions used in the game - Imperial, Orcish, and Undead - across a variety of battlefields based on the story campaign. Players begin matches by purchasing an army with a predefined amount of resources, whereupon the aim of battles is the same as in single-player. Once a battle is over, the player receives a purse of money, regardless of winning or losing, to help them prepare for their next match.\nPlot\nA few years after helping to end the skaven plot in Shadow of the Horned Rat, Morgan Bernhardt, commander of the \"Grudgebringer\" mercenaries, continues to take on work for those who have the gold to spare with the Empire. After helping to defend a trading post from a goblin attack, Bernhardt finds himself called to the city of Altdorf for a meeting with Emperor Karl Franz, who reveals to him that orcs have recently begun invading the Border Princes from the south. Agreeing to help Sven Carlsson, a border prince and Bernhardt's old friend and employer, the mercenaries head to contend with the threat, but soon discover that the orcs are fleeing into the empire to escape attack from an increasing number of undead forces.\nReturning to Altdorf with news of this matter, Franz sends reinforcements to assist Carlsson. He then assigns Bernhardt to reinforce an Imperial fort under attack, whilst escorting his cousin, Countess Isabella Von Liberhurtz, to a town along his route. During the escort, bandit ambush the group, whereupon Bernhardt learns that a vampire lord seeks to abduct Isabella and make her his bride. After assisting the fort, the mercenaries return to Altdorf, whereupon they learn that Isabella was kidnapped after her escort was over, and that the recently increasing number of undead forces across the Old World is the result of an evil undead entity, known as the Dread King, having returned to the world. Learning that the Dread King now seeks three objects to increase his power, Bernhardt finds himself tasked with investigating what each is and preventing the undead from retrieving them, reluctantly being joined by Witchhunter General Matthias in his quest.\nHeading to Sylvania first, Bernhardt destroys the first object - a powerful warpstone - while rescuing Isabella and killing the vampire lord that abducted her. Upon reporting his success, he then proceeds to the Northern Wastes via Kislev, engaging undead and destroying the second object - a necromancer assistant trapped in a glacier, who had become powerful over time. Following his success, Bernhardt travels to Bretonnia and the dark city of Moussilon, whereupon the mercenaries manage to destroy the third and final object - a group of deceased grail knights that had been resurrected to serve the Dread King's armies. Following the final campaign, Bernhardt returns to Altdorf, whereupon the Dread King's location is discovered to be at the Black Pyramid within the south. Tasked by Franz to destroy, Bernhardt leads his men south and engages the Dread King, successfully destroying him and saving the Old World from the undead threat.\nReception\n| Allgame_PC =\n| Allgame_PS =\n| CNG_PC = 8/10\n| CGSP_PC =\n| CGW_PC =\n| Edge_PC = 6/10\n| Edge_PS = 6/10\n| EGM_PS = 5.25/10\n| GI_PC = 8.75/10\n| GI_PS = 7.75/10\n| GameFan_PS = 69%\n| GSpot_PC = 8.3/10\n| IGN_PC = 7/10\n| NGen_PS =\n| OPMUK_PS = 8/10\n| PCGUS_PC = 86%\n}}\nThe PC game received favorable reviews. PC Gamer USs Jason Bates found Dark Omen to be \"definitely one of the better strategy games on the market.\" Although he was let down by its linear campaign, he concluded that the game \"combines a rock-solid miniatures wargame system with state-of-the-art graphics into an engrossing real-time thrill.\" In Computer Gaming World, Elliott Chin compared Dark Omen favorably to Myth: The Fallen Lords, and called it \"an excellent 3D RTS game that's much more fun than its predecessor.\" Although he found the game \"frustrating\", thanks to its interface limitations and high difficulty, he summarized it as \"a deep, tactical game with plenty of magic.\" Benjamin E. Sones of Computer Games Strategy Plus, although he praised its campaign mode as superior to those of other real-time strategy games, and considered its interface an improvement upon Shadow of the Horned Rat, remarked that \"a few nagging flaws still manage to drag Dark Omen back from the brink of greatness.\", specifically the inability to issue orders while the game is paused, which emphasizes player response time rather than careful strategy. He expressed uncertainty as to whether those who disliked Shadow of the Horned Rat would be completely appeased by the improvements.\nHowever, Dark Omens PlayStation port was widely panned. GamePro called it \"a debacle\", and \"a real-time strategy game without the strategy\", arguing that the factor of troop numbers is so overwhelming that any other decision the player makes is irrelevant to a battle's outcome. They also derided the use of 2-D talking heads for cutscenes. The writer concluded, \"Unless you're a huge fan of the Warhammer franchise, avoid this bleak title at all cost. Major dental work would be preferable to playing Dark Omen.\" Electronic Gaming Monthlys review team agreed that the game overemphasizes strength in numbers to the point that it becomes boring and excessively easy after just a few battles. Next Generation, however, found that the deployment of troops is vital to winning, and concluded, \"Casual realtime gamers may find it too daunting, but the difficulty level should appeal to hawks looking for a challenge.\" They acknowledged that the controls are more difficult to manage with the PlayStation's gamepad than with a PC mouse.\nAccording to writer Mark H. Walker, the game was commercially unsuccessful. He dubbed it a \"top-notch\" title that \"should have sold well but didn't.\"\nThe PC version was nominated for GameSpots \"Best Game No One Played\" award in its Best & Worst of 1998 Awards, which went to Battlezone.\nSee also\n* List of Games Workshop video games\nReferences\nExternal links\n*"
    }
  ]
}