{
  "content": [
    {
      "type": "text",
      "text": "# Warhammer 40,000: Armageddon\n\niOS19 June 2015macOS20 June 2017\n| genre         = Computer wargame\n| modes         = Single-player, multiplayer\n}}\nWarhammer 40,000: Armageddon is a computer wargame developed by Flashback Games and The Lordz Games Studio, and published by Slitherine Software for Windows on 26 November 2014. It is based on Games Workshop's tabletop wargame Warhammer 40,000.\nGameplay\nWarhammer 40,000: Armageddon is a turn-based strategy wargame played on a hex grid, set on a polluted hive world where Imperium armies have to defend from ork hordes. It uses Panzer Corps game engine. There is co-op and player versus player multiplayer, either via online, hotseat, or play-by-mail methods.\nRelease\nWarhammer 40,000: Armageddon was announced on 21 May 2013. The game was released on 26 November 2014. An iOS port was released on 19 June 2015. A macOS port was released on 20 June 2017. Several downloadable content (DLC) packs were released: Untold Battles, ''Vulkan's Wrath, Angels of Death, Glory of Macragge, and Ork Hunters in 2015, and Golgotha in 2016.\nReception\n(PC) 68/100\n| EuroG = (PC) 6/10\n| GStar = (PC) 73%\n| Gamezebo = (iOS)\n| MS = (PC) 7/10\n| PCGUK = (PC) 61%\n| PCGN = (PC) 7/10\n| PG = (iOS)\n| TA = (iOS)\n}}\nThe iOS and PC versions received \"average\" reviews according to the review aggregation website Metacritic. Several critics called the game very similar to Panzer Corps'', Slitherine's game from 2011.\nRichie Shoemaker of Eurogamer said of the PC version: \"[a]t the core of Warhammer 40,000: Armageddon there is a very good strategy game, unfortunately too much of it is either obscured, poorly explained or needs attention before it can be given a recommendation.\" Adam Smith of Rock Paper Shotgun said that \"[i]t's an accessible wargame and a good place to start for those familiar with the fiction and looking to make the jump to hex-based warfare.\"\nReferences\nExternal links\n*[http://flashback.games/warhammer-armageddon/ Warhammer 40,000: Armageddon]  at Flashback Games\n*[https://web.archive.org/web/20141012031536/http://www.thelordzgamesstudio.com/site/game/warhammer-40000-armageddon/ Warhammer 40,000: Armageddon] at The Lordz Games Studio (archived)\n*"
    }
  ]
}