{
  "content": [
    {
      "type": "text",
      "text": "# Wariʼ__disambig_1\n\n}}\n()\n| rels = traditional tribal religion\n| langs = Wariʼ\n| related =\n}}\nThe Wariʼ, also known as the Pakaa Nova, are an indigenous people of Brazil, living in seven villages in the Amazon rainforest in the state of Rondônia. Their first contact with European settlers was on the shores of the Pakaa Nova River, a tributary of the Mamoré River. Many of the Wari' live within the Sagarana Indigenous Territory near the town of Rodrigues Alves (which lies between Rio Guaporé Indigenous Territory and Pacaás Novos National Park).\nName\nEuropeans at one time used the name \"Pakaa Nova\" to refer to the Wariʼ, because they encountered the indigenous people near the Pakaa Nova River. The people prefer to be referred to as \"Wariʼ\", their term in their language meaning \"we, people.\" They are also known as the Jaru, Oro Wari, Pacaas-Novos, Pacahanovo, Pakaanova, Pakaanovas, Uari, and Uomo.\nLanguage\nThe Wariʼ speak the Pakaásnovos language, which belongs to the Txapakura, or Chapacura-Wanham language family.\nAlong with the Torá, the Moré (or Itenes), and the Oro Win, the Wariʼ are the last of the Txapakura language linguistic group. Other groups were exterminated by Europeans or Brazilians.\nThere is a large grammar of the Wari' language written by Barbara Kern and Daniel Everett.\nPopulation and locations\nUp until the 19th century, the Wariʼ were present in the Amazon's Southeast, namely the basin of the Lage River (a right-bank-tributary river of the Mamoré River), the Ouro Preto river, the Gruta and Santo André creeks, the Negro river (all tributaries of the lower and middle courses of the right bank of the Pakaa Nova River), and the Ribeirão and Novo rivers (tributaries of the left bank of the Pakaa Nova River).\nIn the early 20th century, continuous incursions by neo-Brazilians in search of rubber trees forced the Wariʼ to relocate to the less accessible headwaters of the Mamoré River. They were confined in that area until pacification. Today, they live in eight settlements located in the state of Rondônia, Brazil.\nDenomination and ethnicity\nThe tribe is divided into subgroups, but there is no specific word to define an individual that belongs to a different group. The closest term that is usually applied is tatirim (stranger). A person from the same subgroup is referred to as \"win ma\" (land fellow).\nToday, the Wariʼ subgroups are:\n* Oro Nao\n* Oro Eo\n* Oro At\n* Oro Mon\n* Oro Waram\n* Oro Waram Xijein\nSome individuals still identify themselves with two other subgroups that no longer exist, the OroJowin, or the OroKaoOroWaji. Oro is a collectivizing particle that can be translated as \"people\" or \"group\".\nRelations between subgroups\nPresent relations between subgroups are influenced by dynamics that existed before pacification. Each subgroup is intimately connected with a territory; however, the frontiers between territories are fluid.\nAn area associated with one subgroup can be incorporated into the territory of another subgroup (if it is occupied by a group that also belongs to another subgroup). This is made possible by the semi-nomadic characteristic of the Wari' people.\nMembership to any given subgroup is not defined by fixed rules. Children may be considered members of either parent's subgroup, or of the subgroup associated with the territory in which they were born. Cultural or subgroup identities are part of one's birthright, but socially constructed during a lifetime through relations with one's relatives and neighbors. The Wariʼ recognize that individuals have multiple identities based on their specific relations and experiences.\nSociety\nEvery subgroup is organized around a set of brothers, each of whom is often married to women who are sisters. Polygyny, especially sororal polygyny (co-wives are sisters), is the basis of the Wariʼ family structure. Villages are made up of nuclear families and a separate house, called \"the men's house\". It serves as a dormitory for single adolescents and as a meeting place for adult men. A couple usually varies their place of residence, shifting between the woman's parents' and the man's parents', although no specific rule determines when the shift is made.\nThe Wariʼ are semi-nomadic, moving their villages at least once every five years. They stay away from floodplains but remain closer to the shores of small perennial rivers.\nA maize swidden, providing the staple crop, is developed around the village. Finding the ideal earth for corn growing (black earth or terra preta) plays a key role in determining where to set up a village. The importance of agricultural land is also reflected in the language, since a person from the same subgroup is called a \"land fellow\".\nBeliefs\nBody, soul, and humanity\nAparecida Vilaça, professor of Social Anthropology at the National Museum, Federal University of Rio de Janeiro discusses the Amazonian concept of the body by drawing upon ethnographic research of the Wari’. First, it is important to note that humanity is not restricted to humans. Anything that acts human, i.e., performs rituals, has a family life, or drinks beer, may be considered human.\nIn the native language, Txapuakura,  is the closest word to the body and must be used in conjunction with a possessive suffix (his, her, its). Husband and wife are considered to share the same body, furthermore, all who live together are consubstantial. Vilaça describes kwere- as a “way of being.” For example, a person's temperament is caused by their kwere-, an animal's diet is attributed to its kwere-, and the wind's strength originates from its kwere-. Vilaça asserts that this human/non-human parallel suggests a relationship to a “wider cosmological process.” The concept of the ontological turn is often used in regard to Wari' beliefs because the Wari’ interpretations of body and soul are so vastly unfamiliar to cultures that operate under the distinction of the divide between culture and nature into a dichotomy, which calls into question if all human viewpoints are comparable or perhaps even mutually intelligible.\nAfter providing background on the concept of the body, Vilaça moves into a discussion about humanity. Wari’ means “we, people, human beings,” and is defined in opposition to game animals. Hunted animals can be considered human because they act as predators at times. The Wari’ warn that one must distrust their own eyes because the human form can be deceptive. The human form is seen as a good indication that something is a human, but may be deceptive as human bodies can be attracted to other subjectivities and transformed into them. The transformation of a body may be the result of the agency of another and not of the subject of transformation's desire to transform. In one story, a child went to gather food with her mother in the forest. After noticing that they had been away from the village for days, the child grew suspicious. She noticed a jaguar's tail between her mother's legs and screamed until the animal fled and her mother was summoned again.\nA transformation like this is attributed to the soul or jam-. Vilaça emphasizes that the body and soul are interconnected. The Wari’ believe that the soul gives instability and capacity for transformation. When a shaman sees the soul of an animal, he sees it as a person and is unable to kill it. Alternatively, the shaman may kill a fellow Wari’ because he views them as an animal. An animal appears differently in each person's eyes. Furthermore, someone with a keen vision can view humanity in all things. Lastly, it is noted that metamorphosis generates fear because of its associated vulnerability and instability.\nTo the Wari’, seeing the soul of an animal has the potential to make one a lousy hunter because you're no longer able to kill the creature that one observes as if it were too a human, the commonality of shared experience makes one unable to kill it. The reverse then may also occur, and the fellow human could be seen as prey. This concept is referred to by the author as “perspectival oscillation” and has the potential to happen to anyone at any time, and the signs that it's happened are as subtle as small abnormalities in appearance or behavior.\nEffect of missionaries\nThe Wari concept of body is combined with one's perspective whereas the Wari’ concept of the heart, or ximixi’, refers to the physiological organ, the core of something, and one's emotional state, morality, and intelligence. In order for the Wari’ to consider someone a human being, they must have the quality of jamixi’ or the ability to transform into different bodies and perspectives. This transformation is understood to occur due to illness and transformation is viewed negatively as a loss of one's wari’ or body and perspective. This, in turn, affects the way that they differentiate between Wari’ and other beings and affects the ways in which others view them. Christianity, where differentiation and dominion between human and animal is established immediately within the Bible, thus provided the Wari’ with a tool for differentiating themselves from animals and other beings. Another aspect of Christianity that was attractive to easing the anxieties of sense of self and relation among the Wari’ was the idea of Christian brotherhood. One major change that came about through the adoption of Christianity was the transition between a sense of being concentrated in the body to a being concentrated in the heart, allowing the Wari’ sense of self to be turned inward.\nCannibalism\nThe Wari' formerly practiced endocannibalism, specifically mortuary cannibalism. This was done as a form of utmost respect to those who had died.\nRight after death, the closest relatives would hug and embrace the deceased person. The body would be left for about three days, although there was no set span, and depended largely upon how soon family members in other settlements could get to the funeral. By this time, the body had typically begun to decompose in the heat and humidity of the Amazon, sometimes reaching the stage where the body became bloated and discolored. When all relatives within a reasonable distance had arrived, the relatives respectfully prepared the body to eat.\nMortuary preparation involved ritual wailing and other ceremonies, building a fire, removing the visceral organs, and finally roasting the body. The decedent's closest kin would not consume the body, but they urged the attendant relatives to eat. Consumption of the flesh would assuage the family's grief, as it meant that the soul of the deceased would be kept in the living bodies of relatives instead of being abandoned to wander the forest alone. The practice was considered equally an act of compassion, affinal love, and grief. The relatives were encouraged to eat what they could, but this sometimes amounted to little more than small tokens of the spoiled meat. Even this consumption often caused the mourners great gastric distress. The heart and liver were eaten, but much of the body and hair was burned.\nThis practice continued until the 1960s. Today, Wariʼ do not practice any form of cannibalism. They bury their dead after two or three days of mourning.\nWarfare\nToday, the Wariʼ are peaceful, but before pacification they warred with neighboring tribes. Their most notable victories occurred over the Karipuna, a Tupi ethnicity, and the Uru-Eu-Wau-Wau. With contact with the Brazilian government in the 20th century, the focus of their warfare shifted and they lost contact with the old wijam (enemy).\nThe Wariʼ consider enemies as \"former Wariʼ\" who have distanced themselves to the point of severing cultural exchanges. In spite of that, a Wariʼ warrior did not distinguish between an enemy and an animal, and thus felt no need to be merciful or gracious to an enemy any more than he would to an animal.\nOnce fighting was over, Wariʼ warriors would bring home the bodies of the fallen enemies whenever possible. Those bodies would be served to the women and younger men who had stayed home in order to strengthen the group. Children were prohibited from eating dead enemies.\nThe battle warriors retreated to the men's house, where they stayed in quarantine. During this period they moved around as little as possible, staying in their hammocks for most of the day and drinking only chicha. The purpose was to \"keep the enemy's blood within the warrior's body\", thus giving him strength. Sex was prohibited, as they thought the blood of the enemy would \"turn into semen\" and thus allow the enemy's strength to be passed on to the tribesmen's children. The warrior was not allowed to partake of the fallen enemies, because it was believed that he had kept the enemy's blood within himself, and such an act would be self-cannibalism, resulting in his death. The quarantine ended when the women refused to continue preparing the chicha.\nPacification\nPacification in this context is between the Wari' people and the rest of the connected world. It is important to note that the Wari' did not ask for this 'pacification'. There are many perspectives on whether or not pacification of indigenous peoples is moral; therefore, it is important to define the distinction between pacification (peace) and a civilizing mission (assimilation/missionaries).\nPrior to pacification attempts, interaction with the Wari' was extremely minimal. Starting in the 1950s, rubber tappers sought Wari' land for rubber trees. These rubber tappers resorted to exterminating Wari' villages and their people. As a result, the Serviço de Proteção ao Índio (SPI) began to attempt contacting the Wari' people.\nDisease outbreaks and war over land from outsiders caused the population of the Wari' to reduce by nearly 50%. At the time, the Wari' had just begun to relocate themselves due to extreme rubber tree farming.\nAs a result, the Wari' turned to the Serviço de Proteção ao Índio and missionaries for assistance. The Serviço de Proteção ao Índio intentionally set up posts in order to meet and assist the Wari'. Due to the aforementioned disease outbreaks and rubber tappers, the Wari' eventually settled near these posts.\nMissionaries\nAround 1956, the Wari' caught the attention of Protestant missionaries (and later Catholic and Evangelical missionaries). The Wari' were interested in the missionaries because of their generosity and their capability to cure disease.\nThe missionaries challenged Wari' beliefs by proposing new perspectives. The Wari' originally believed that all Wari' were brothers and that enemies were the same as animals. Missionaries changed the perspective of many Wari' to see all humans as brothers and animals as objects. This switch in perspective established the idea that fighting among brothers (other humans) was bad. To further convey their point, missionaries often lived alongside Wari' and attempted to learn the Wari' language. Parts of the Bible were translated into the Wari' language from 1975 to 1984. Following the translation of the Bible, was a collective conversion of the Wari' to Christianity for only about a decade in the 1970s and 1980s, followed by a collective reconversion.\nAfter 9/11, which the Wari' were able to witness on TV, many converted back to Christianity believing that this was a sign of the end of the world. The post-9/11 Christianity practiced by the Wari’ population, can be differentiated from the missionary led Christianity from 1975 to 1984, as it was almost entirely led by native faith leaders and taught in their native language.\nThis was not without cruelty. The Wari' were forced to work full time on large plantations and in other enterprises in order to receive assistance and teachings. They were forced to obey orders, they were sent to forced isolation, and they were punished with jets of cold water when showing traditional values/beliefs. Despite this, the converted Wari' people decided that this was worth the new ideology and material benefits. Deconversion was also common with converted Wari', but deconversion usually did not last long.\nBy the 2000s, a large majority of Wari' had gone back to their original traditions – only 30% remain Christian as of 2019.\nNotes\nReferences\n* Conklin, B. (2001). Consuming Grief: Compassionate Cannibalism in an Amazonian Society. Austin: University of Texas Press. 978–0292712362\n* Vilaça, Aparecida (2010). Strange Enemies: Indigenous Societies and Scenes of Encounters in Amazonia. Durham: Duke University Press. 978–0822345732\n* Kern, Barbara and Daniel Everett (1997). Wari . London: Routledge.\nExternal links\n* [http://www.nmai.si.edu/searchcollections/results.aspx?regid=492 Wari artwork], National Museum of the American Indian"
    }
  ]
}