{
  "content": [
    {
      "type": "text",
      "text": "# Waris Shah__disambig_1\n\n}}\n| image            = Portrait of the Punjabi poet Waris Shah (Lahore, ca.1859).jpg\n| imagesize        =\n| caption          = Depiction of Waris Shah, Lahore, ca.1859\n| birth_date       =\n| birth_place      = Jandiala Sher Khan, Sheikhupura, Punjab, Mughal Empire\n| death_date       =\n| death_place      = Jandiala Sher Khan, Sheikhupura, Sikh Empire\n| occupation       = Poet\n| genre            = Sufi poetry\n| notableworks     = Heer Ranjha- by Waris Shah - A Classic Book on their love story\n}}\nPir Waris Shah (}} ; 1722  1798) was an 18th-century Punjabi Muslim Sufi poet of the Chishti order, known popularly for his contribution to Punjabi literature.\nHe is primarily known as the author of the Heer Ranjha love poem. It's about one of the most popular tragic romances of Punjab. Traditionally, this love poem is recited in bhairavi raga and this continues to be done even today.\nBackground\nSyed Mohammad Waris Shah was born in Jandiala Sher Khan, Punjab, present-day Pakistan, into a reputed Sayyid family and was a descendant of Sayyid Muhammad Al-Makki through his son Sayyid Badruddin. His father's name was Gulsher Shah and mother's name was Kamal Banu. Waris's parents are said to have died when he was young. Waris spent years in search of the perfect spiritual guide. Waris Shah acknowledged himself to be a disciple of an ustad from Kasur, namely Hafiz Ghulam Murtaza from whom he received his education. After completing his education, Waris moved to Malka Hans, a village twelve kilometres north of Pakpattan. Here he resided in a small room (or Hujra), adjacent to a historic mosque now called Masjid Waris Shah, until his death.\nWaris Shah was also an eyewitness to the first Invasion of India by the Afghan leader Ahmad Shah Abdali. He witnessed the Battle of Lahore between the Afghan forces and the Mughal forces under Shah Nawaz which resulted in Lahore coming under Afghan control during January 1748. Waris Shah condemned Shah Nawaz's actions during the battle and even referred to him as a coward. Other poets later added their own verses in Qissa Waris Shah throughout the history. It is estimated that there are 11069 forged  verses in the commonly available Qissa Waris Shah. One of the oldest and most accurate copy of Qissa Waris Shah published by Kripa Ram  in 1916 is available in the Punjab Public Library in Lahore\nWorks\nExamples\nMany verses of Waris Shah are widely used in Punjab in a moral context, for instance:\n* Naa adataan jaandiyan ne, Bhavein katiye poriyan poriyan ji\n:\n:(A man never abandons his habits, even if he is hacked to pieces)\n* Waris rann, faqir, talwar, ghora; Chare thok eh kisse de yar nahin (Waris says that woman, beggar, sword and horse, these four are never anyone's friends)\n* Waris Shah faqir di aqal kithe;  eh pattian ishq padhiyan hun\n:\n: (It is beyond the wisdom of faqeer Waris Shah (to write this verse), (But) these lessons are taught by Love)\n* Eh rooh qalboot da zikr sara nal aqal de mel bulaya ee (This entire reference is about Soul meeting with the Divine, Beloved which has been contrived with great wisdom)\nTomb\nThe tomb or mausoleum of Waris Shah is near Sheikhupura, Punjab, Pakistan in Jandiala Sher Khan town. His urs (death anniversary) is held and celebrated there every year.\nLegacy\nThe renowned Punjabi writer and poet Amrita Pritam is best remembered for her famous work Ajj Aakhaan Waris Shah Nu (lit: \"Today I Invoke Waris Shah\") about the horrors of the partition of the Punjab during the Partition of India.\n* Ajj Akan Waris shah nu, k tu Qabran vichon bol\n:\n: (Today, I call upon Waris Shah, to rise from the grave and speak)\n* Te Ajj kitaab e ishq da, koi Agla warka khol\n:\n:(And plead with him to open another page in the book of love)\nPortrayal in media\nWaris Shah's life has been fictionalised in Punjabi-language films. A 1964 Pakistani film titled Waris Shah featured Inayat Hussain Bhatti in the title role. Another film on the life of Shah, Sayyed Waris Shah, was released in India in 1980; followed by Waris Shah: Ishq Daa Waaris in 2006 which had Gurdas Maan in the role of Waris Shah.\nSee also\n* List of Punjabi language poets\nReferences"
    }
  ]
}