{
  "content": [
    {
      "type": "text",
      "text": "# Warialda\n\n| maxtemp  = 26.1\n| mintemp  = 8.4\n| rainfall = 689.1\n| stategov = Northern Tablelands\n| fedgov   = New England\n| dist1    = 500\n| dir1     = N\n| location1= Sydney\n| dist2    = 326\n| dir2     = SW\n| location2= Brisbane\n| dist3    = 60\n| dir3     = NW\n| location3= Inverell\n| dist4    = 80\n| dir4     = E\n| location4= Moree\n}}\nWarialda is a town in the North West Slopes region of New South Wales, Australia, in Gwydir Shire. It is situated on the banks of Warialda Creek. At the , Warialda had a population of 1,130.\nTransport\nThe Gwydir Highway runs through town and, along with Stephen Street, is considered one of the town's two main streets.\nWarialda is serviced by daily NSW TrainLink coach services (excluding Tuesdays) to Inverell and Tamworth, connecting with train services to Sydney. Additionally, there are three weekly coach services each to Grafton (connecting with XPT train services to and from Brisbane) and Moree on alternating days (excluding Sundays). The NSW TrainLink coach stop is located outside the tourist information centre.\nThe town is connected to the Inverell railway line as a major station on the way between Moree and Inverell. Due to the lay of the land, the station was built just outside of town at a new site known as .\nHistory\nThe original inhabitants of the region were the Weraerai Aboriginals and the first Europeans in the area were probably escaped convicts. Allan Cunningham was the first official European visitor in 1827.\nThe first settlement was established in 1837 with a Border Police outstation erected in 1840. The town site was gazetted in 1847 and was the first in the Northwest Slopes region. Warialda was the headquarters of the Yallaroi Shire, until its merger with neighbouring Bingara Shire to form Gwydir Shire. Warialda Post Office opened on 1 January 1848. The town's first newspaper was the Warialda Standard, which was first published in 1896 and remains in publication.\nWarialda is the birthplace of Elizabeth Kenny, world-renowned pioneer in the treatment of poliomyelitis. The baptismal font used for Sister Kenny's baptism is still in use and housed in the Church of England located in Stewart Avenue.\nWarialda is also the birthplace of Olive Rose Fitzhardinge (1881–1956) who became famous in the 1930s as a rose breeder in Warrawee, the name of her best known rose.\n}}\nIndustry\nWarialda is the service centre for the local agricultural sector. Farms around Warialda produce wheat, sorghum, barley, sheep, beef cattle. Some of the locals also earn a dollar or two hunting wild pigs, which are exported, mainly to Germany, where there are demands for wild boar which are not present in the Australian market.\nWarialda serves as an education precinct for local families with a strong base of excellent education facilities including preschools, public schools, a catholic primary school, TAFE outreach centres and vocational education programs.\nAgriculture, health and education are the primary industries providing support for a small but thriving business sector. Some of the local businesses include a supermarket, hardware store, cafes, service stations, butcher, bakery, pubs and a golf & bowling club along with other small businesses providing a cross-section of goods & services.\nReligion\nPresbyterian Church and Manse, Warialda]]\nWarialda is home to congregations of the Anglican, Catholic, Presbyterian, and Uniting Churches.\nThe Anglican and Catholic churches are located near the Gwydir Highway in the main part of town on the south bank of the Warialda Creek.\nAnglican Church\nSt. Simon's & St. Jude's Anglican Church is located on the corner of Stewart Avenue and Market Streets.\nBuilt 1966, it was home to Sister Elizabeth Kenny Memorial Baptistry, as a tribute to Elizabeth Kenny born in Warialda 20th Sept 1880, for her work with those who had Polio.\nCatholic Church\nSt. Patrick's Catholic Church is located at 29 Geddes Street.\nPresbyterian church\nSt. Stephen's Presbyterian Church is located on the corner of Stephen and Long Streets. The front of the church has three stained glass windows representing The Good Shepherd, from John 10:1–21, as an Australian scene.\nThe Presbyterian Manse was built from convict-hewn sandstone which formed part of the original town gaol. A local landowner used this stone built a house for himself and donated the rest of the stone to the church. The Manse bears examples of gaol graffiti, such as \"Hell is here\" upside-down outside the office window, and \"Lord, remember me\" at the back of the building.\nEducation\nWarialda Public School was established in 1851.\nWarialda High School has been named as a Centre for Excellence.\nSt Joseph's Catholic School provides education for K to 6.\nSport\nThe Warialda Wombats are the most successful team in the New England Group 19 Rugby League competition with 12 titles in its history and predecessor competitions.\nNoel Cleal and his brother Les emerged from the town to rise to prominence with Eastern Suburbs in the New South Wales Rugby League premiership, with Les later going on to captain-coach many country club sides while Noel won a title with Manly Warringah in 1987.\nPlaces of interest\nBetween Warialda and Inverell on the Gwydir Highway is Cranky Rock. According to local legend, in the late 1800s a Chinese man jumped off Cranky Rock into the creek while being pursued by the local police after murdering a local woman. Cranky Rock is now a popular picnic spot.\nFestivals\n2008 marked the town's first Honey Festival. There is entertainment throughout the day, featuring local artists.  In addition there are market stalls and refreshments available.  The highlight of the day happens at 2pm when there is a street parade with colourful floats constructed and manned by community groups. The festival has since been held regularly in the town, with a tenth festival held in September 2016.\nReferences\nExternal links"
    }
  ]
}