{
  "content": [
    {
      "type": "text",
      "text": "# Warington Baden-Powell\n\n| birth_place = Oxford, England\n| known_for   = Sea Scouting, Canoe sailing.\n| death_date  =\n| death_place = Chelsea, London\n| spouse      =\n| father      = Baden Powell\n| mother      = Henrietta Grace Smyth\n| relatives   = Robert Baden-Powell (brother)Agnes Baden-Powell (sister)George Baden-Powell (brother)Frank Baden-Powell (brother)Baden Baden-Powell (brother)Baden Henry Powell (half-brother)\n}}\nHenry Warington Smyth Baden-Powell KC (3 February 1847 – 24 April 1921), known as Warington, was a British admiralty lawyer, master mariner and canoeist. He wrote a book on Sea Scouting and held positions in The Boy Scouts Association, formed by his brother, Robert Baden-Powell.\nLife\nHe was born Henry Warington Powell in New College Lane, Oxford; the son of Reverend Professor Baden Powell, who held the Savilian Chair of Geometry at the University of Oxford from 1827 to 1860.\nHis mother, a gifted musician and artist, was Henrietta Grace Smyth, the third wife of Baden Powell (the previous two having died).  She was the elder daughter of William Henry Smyth and his wife Annarella.\nWarington was the eldest child of the marriage, his siblings were George Baden-Powell, Robert Baden-Powell, Frank Baden-Powell, Agnes Baden-Powell, and Baden Baden-Powell. Warington was educated at St Paul's School, London, which he entered in 1857. In 1860, his father died, following which his mother changed the family surname from Powell to Baden-Powell in his memory.\nIn 1861, aged 14, Warington joined the training ship HMS Conway as a cadet. He completed his training there in 1864 with a creditable Double Extra Certificate, and then accompanied his uncle, Captain Henry Toynbee, on a voyage on the East Indiaman, Hotspur. Following that, he joined the Peninsular and Oriental Steam Navigation Company as a 4th officer. Early in his career he qualified as a Master Mariner and was commissioned a Lieutenant in the Royal Naval Reserve. Being the eldest son made Warington financially responsible for maintaining his mother's household, which was probably his motivation for leaving the sea in 1873 and starting legal training. He was called to the Bar in Trinity Term 1876, being admitted as a barrister of the Inner Temple. He was later admitted to the Admiralty Bar and became a member of several important organizations focused on the sea. He was appointed a King's Counsel (KC) on 24 December 1897. On 13 September 1913, Warington married New Zealand-born Cicely Hilda Farmer (known as Hilda) at All Saints, Knightsbridge. He had been secretly engaged to Hilda for nearly twenty years.\nHe was elected as a Fellow of the Royal Geographical Society (FRGS). He also held membership in The Shipwrights' Company, the Yacht Racing Association and the Athenaeum Club. He was elected an Associate of the Royal Institution of Naval Architects in 1889.\n, Fife.]]\nWarington died from tuberculosis, in Chelsea on 4 April 1921 but is buried in the Eastern Cemetery at St Andrews in Fife on the upper terrace, in his wife's family plot.  A portrait can be found on the Internet.\nCanoe sailing\nFrom his childhood, Warington Baden-Powell had been an enthusiastic sailor of small boats and later became a pioneer of sailing canoes, which he designed himself based on the \"Rob-Roy\" type of hybrid canoe-kayaks which had been built by John \"Rob Roy\" MacGregor. In July 1869, accompanied by a companion known only as \"H\", possibly his brother Baden Henry, Warington undertook a canoeing expedition in the Baltic Sea, and published an account of his adventures in 1871. He was an early member and promoter of the Royal Canoe Club which he had joined in 1874. By the late 1870s, sailing canoes were taking part in organised racing, and providing keen amateur sport at reasonable cost at a time when yachting was an activity for the wealthy.\nThe Encyclopædia Britannica Eleventh Edition mentions him in the 'Canoe' entry:\nIn 1872, Warington took his brothers, including the 15 year-old Robert, on an expedition by canoe up the Thames to its source and then on to the River Severn and the River Wye. There followed several other family expeditions in southern England which made a deep impression on Robert, who later recalled that Warington had \"infused so much jollity and romance into that early sea-training that it gripped me from the first\".\nIn 1886, the American Canoe Association challenged the Royal Canoe Club to a sailing race and accordingly, Warington travelled to the United States with Walter Stewart and their canoes for the ACA annual meet at the Thousand Islands in the Saint Lawrence River. However, the heavy British general-purpose cruising canoes were beaten by the Americans who had developed specialised racing boats.\nSea Scouts\n, the Scout Association's national headquarters in Essex]]\nHis brother, Robert, asked him to write a manual for Sea Scouts. He devised a training scheme with The Boy Scouts Association's Chief Sea Scout, Lord Charles Beresford and, in June 1912, his book, Sea Scouting and Seamanship for Boys was published. Warington admitted, in his book's preface, that the book could provide only an overview of boating skills required. His book remained in print until 1949.\nIn 2011, a Sea Scout Group of the Portuguese Corpo Nacional de Escutas based in The Azores, named their 16-metre sailing yacht  Almirante Warrington Baden-Powell in his honour. In 2012, a bronze bust of Warington was unveiled by Edward Baden-Powell, the great-grandson of Sir George Baden-Powell, at The Scout Association's national headquarters at Gilwell Park in Essex.\nPublished works\n* [https://archive.org/details/canoetravelling00powegoog/page/n8 Canoe Travelling: Log of a Cruise on the Baltic, and Practical Hints on Building and Fitting Canoes] (London: Smith, Elder, 1871)\n* [http://www.thedump.scoutscan.com/ss4b_1911.pdf Sea Scouting and Seamanship for Boys] (Glasgow: Brown, Son & Ferguson, 1912)\nReferences"
    }
  ]
}