{
  "content": [
    {
      "type": "text",
      "text": "# Waring's problem__disambig_1\n\nIn number theory, '''Waring's problem' asks whether each natural number k has an associated positive integer s such that every natural number is the sum of at most s natural numbers raised to the power k''. For example, every natural number is the sum of at most 4 squares, 9 cubes, or 19 fourth powers. Waring's problem was proposed in 1770 by Edward Waring, after whom it is named. Its affirmative answer, known as the Hilbert–Waring theorem, was provided by Hilbert in 1909. Waring's problem has its own Mathematics Subject Classification, 11P05, \"Waring's problem and variants\".\nRelationship with Lagrange's four-square theorem\nLong before Waring posed his problem, Diophantus had asked whether every positive integer could be represented as the sum of four perfect squares greater than or equal to zero. This question later became known as Bachet's conjecture, after the 1621 translation of Diophantus by Claude Gaspard Bachet de Méziriac, and it was solved by Joseph-Louis Lagrange in his four-square theorem in 1770, the same year Waring made his conjecture. Waring sought to generalize this problem by trying to represent all positive integers as the sum of cubes, integers to the fourth power, and so forth, to show that any positive integer may be represented as the sum of other integers raised to a specific exponent, and that there was always a maximum number of integers raised to a certain exponent required to represent all positive integers in this way.\nThe number g(k)\nFor every k, let g(k) denote the minimum number s of kth powers of naturals needed to represent all positive integers. Every positive integer is the sum of one first power, itself, so g(1) = 1. Some simple computations show that 7 requires 4 squares, 23 requires 9 cubes,Remember we restrict ourselves to positive natural numbers. With general integers, it is not hard to write 23 as the sum of 4 cubes, e.g. 2^3 + 2^3 + 2^3 + (-1)^3 or 29^3 + 17^3 + 8^3 + (-31)^3. and 79 requires 19 fourth powers; these examples show that g(2) \\ge 4, g(3) \\ge 9, and g(4) \\ge 19. Waring conjectured that these lower bounds were in fact exact values.\nLagrange's four-square theorem of 1770 states that every natural number is the sum of at most four squares. Since three squares are not enough, this theorem establishes g(2) = 4. Lagrange's four-square theorem was conjectured in Bachet's 1621 edition of Diophantus's Arithmetica; Fermat claimed to have a proof, but did not publish it.\nOver the years various bounds were established, using increasingly sophisticated and complex proof techniques. For example, Liouville showed that g(4) is at most 53. Hardy and Littlewood showed that all sufficiently large numbers are the sum of at most 19 fourth powers.\nThat g(3) = 9 was established from 1909 to 1912 by Wieferich and A. J. Kempner, g(4) = 19 in 1986 by R. Balasubramanian, F. Dress, and J.-M. Deshouillers, g(5) = 37 in 1964 by Chen Jingrun, and g(6) = 73 in 1940 by Pillai.\nLet \\lfloor x\\rfloor and \\{x\\} respectively denote the integral and fractional part of a positive real number x. Given the number c = 2^k \\lfloor(3/2)^k\\rfloor - 1 , only 2^k and 1^k can be used to represent c; the most economical representation requires\n\\lfloor(3/2)^k\\rfloor - 1 terms of 2^k and 2^k - 1 terms of 1^k. It follows that g(k) is at least as large as 2^k + \\lfloor(3/2)^k\\rfloor - 2. This was noted by J.&nbsp;A. Euler, the son of Leonhard Euler, in about 1772.\nThe Ideal Waring Theorem would be an unconditional strengthening of Euler's observation:\n: Define: g*(k)  = 2^k + \\lfloor(3/2)^k\\rfloor - 2. Then g(k) = g*(k).\nWork by Dickson and Pillai in 1936, Rubugunday in 1942, Niven in 1944 and many others has proved that\n:\ng(k) = \\begin{cases}\n2^k + \\lfloor(3/2)^k\\rfloor - 2\n&\\text{if}\\quad\n2^k \\{(3/2)^k\\} + \\lfloor(3/2)^k\\rfloor \\le 2^k, \\\\\n2^k + \\lfloor(3/2)^k\\rfloor + \\lfloor(4/3)^k\\rfloor - 2\n&\\text{if}\\quad\n2^k \\{(3/2)^k\\} + \\lfloor(3/2)^k\\rfloor > 2^k\n\\text{ and }\n\\lfloor(4/3)^k\\rfloor \\lfloor(3/2)^k\\rfloor + \\lfloor(4/3)^k\\rfloor + \\lfloor(3/2)^k\\rfloor = 2^k, \\\\\n2^k + \\lfloor(3/2)^k\\rfloor + \\lfloor(4/3)^k\\rfloor - 3\n&\\text{if}\\quad\n2^k \\{(3/2)^k\\} + \\lfloor(3/2)^k\\rfloor > 2^k\n\\text{ and }\n\\lfloor(4/3)^k\\rfloor \\lfloor(3/2)^k\\rfloor + \\lfloor(4/3)^k\\rfloor + \\lfloor(3/2)^k\\rfloor > 2^k.\n\\end{cases}\nDickson's 1936 proof applies when k > 6, and Pillai's when k > 7, leaving g(4), g(5), and g(6) to be resolved as documented above.\nNo value of k is known for which 2^k\\{(3/2)^k\\} + \\lfloor(3/2)^k\\rfloor > 2^k. Mahler proved that there can only be a finite number of such k, and Kubina and Wunderlich have shown that any such k must satisfy k > 471\\,600\\,000, extending work of Stemmler. Thus it is conjectured that this never happens, that is, g(k) = 2^k + \\lfloor(3/2)^k\\rfloor - 2 for every positive integer k.\nThe first few values of g(k) are:\n: 1, 4, 9, 19, 37, 73, 143, 279, 548, 1079, 2132, 4223, 8384, 16673, 33203, 66190, 132055, 263619, 526502, 1051899, ... .\nThe number G(k)\nFrom the work of Hardy and Littlewood, the related quantity G(k) was studied with g(k).  G(k) is defined to be the least positive integer s such that every sufficiently large integer (i.e. every integer greater than some constant) can be represented as a sum of at most s positive integers to the power of k. Clearly, G(1) = 1. Since squares are congruent to 0, 1, or 4 (mod 8), no integer congruent to 7 (mod 8) can be represented as a sum of three squares, implying that . Since  for all k, this shows that . Davenport showed that  in 1939, by demonstrating that any sufficiently large number congruent to 1 through 14 mod 16 could be written as a sum of 14 fourth powers (Vaughan in 1986 and 1989 reduced the 14 biquadrates successively to 13 and 12). The exact value of G(k) is unknown for any other k, but there exist bounds.\nLower bounds for G(k)\n{| class=\"wikitable\" style=\"float:right; text-align: center\"\n! Bounds\n|-\n| 1 = G(1) = 1\n|-\n| 4 = G(2) = 4\n|-\n| 4 ≤ G(3) ≤ 7\n|-\n| 16 = G(4) = 16\n|-\n| 6 ≤ G(5) ≤ 17\n|-\n| 9 ≤ G(6) ≤ 24\n|-\n| 8 ≤ G(7) ≤ 33\n|-\n| 32 ≤ G(8) ≤ 42\n|-\n| 13 ≤ G(9) ≤ 50\n|-\n| 12 ≤ G(10) ≤ 59\n|-\n| 12 ≤ G(11) ≤ 67\n|-\n| 16 ≤ G(12) ≤ 76\n|-\n| 14 ≤ G(13) ≤ 84\n|-\n| 15 ≤ G(14) ≤ 92\n|-\n| 16 ≤ G(15) ≤ 100\n|-\n| 64 ≤ G(16) ≤ 109\n|-\n| 18 ≤ G(17) ≤ 117\n|-\n| 27 ≤ G(18) ≤ 125\n|-\n| 20 ≤ G(19) ≤ 134\n|-\n| 25 ≤ G(20) ≤ 142\n|}\nThe number G(k) is greater than or equal to\n: {|\n| 2r+2 || if k = 2r with r &ge; 2, or k = 3 × 2r;\n|-\n| pr+1 || if p is a prime greater than 2 and k = pr(p &minus; 1);\n|-\n| (pr+1 − 1)/2 &nbsp; || if p is a prime greater than 2 and k = pr(p &minus; 1)/2;\n|-\n| k + 1 || for all integers k greater than 1.\n|}\nIn the absence of congruence restrictions, a density argument suggests that G(k) should equal .\nUpper bounds for G(k)\nG(3) is at least 4 (since cubes are congruent to 0, 1 or −1 mod 9); for numbers less than 1.3,  is the last to require 6 cubes, and the number of numbers between N and 2N requiring 5 cubes drops off with increasing N at sufficient speed to have people believe that ; the largest number now known not to be a sum of 4 cubes is , and the authors give reasonable arguments there that this may be the largest possible. The upper bound  is due to Linnik in 1943. (All nonnegative integers require at most 9 cubes, and the largest integers requiring 9, 8, 7, 6 and 5 cubes are conjectured to be 239, 454, 8042,  and , respectively.)\nis the largest number to require 17 fourth powers (Deshouillers, Hennecart and Landreau showed in 2000 that every number between  and 10245 required at most 16, and Kawada, Wooley and Deshouillers extended Davenport's 1939 result to show that every number above 10220 required at most 16). Numbers of the form 31·16n always require 16 fourth powers.\nis the last known number that requires 9 fifth powers (Integer sequence S001057, Tony D. Noe, Jul 04 2017),  is the last number less than 1.3 that requires 10 fifth powers, and  is the last number less than 1.3 that requires 11.\nThe upper bounds on the right with  are due to Vaughan and Wooley.\nUsing his improved Hardy–Ramanujan–Littlewood method, I.&nbsp;M. Vinogradov published numerous refinements leading to\n: G(k) \\le k(3\\log k + 11)\nin 1947 and, ultimately,\n: G(k) \\le k(2\\log k + 2\\log\\log k + C\\log\\log\\log k)\nfor an unspecified constant C and sufficiently large k in 1959.\nApplying his p-adic form of the Hardy–Ramanujan–Littlewood–Vinogradov method to estimating trigonometric sums, in which the summation is taken over numbers with small prime divisors, Anatolii Alexeevitch Karatsuba obtained in 1985 a new estimate, for k \\ge 400:\n: G(k) \\le k(2\\log k + 2\\log\\log k + 12).\nFurther refinements were obtained by Vaughan in 1989.\nWooley then established that for some constant C,\n: G(k) \\le k(\\log k + \\log\\log k + C).\nVaughan and Wooley's survey article from 2002 was comprehensive at the time.\nSee also\n* Centered polygonal number theorem\n* Fermat polygonal number theorem, that every positive integer is a sum of at most n of the n-gonal numbers\n* Waring–Goldbach problem, the problem of representing numbers as sums of powers of primes\n* Subset sum problem, an algorithmic problem that can be used to find the shortest representation of a given number as a sum of powers\n* Pollock's conjectures\n* Sums of three cubes, discusses what numbers are the sum of three not necessarily positive cubes\n* Sums of four cubes problem, discusses whether every integer is the sum of four cubes of integers\n* Jacobi's four-square theorem, provides the number of ways a positive integer can be represented as the sum of 4 squares\nNotes\nReferences\n*  G. I. Arkhipov, V. N. Chubarikov, A. A. Karatsuba, \"Trigonometric sums in number theory and analysis\". Berlin–New-York: Walter de Gruyter, (2004).\n* G. I. Arkhipov, A. A. Karatsuba, V. N. Chubarikov, \"Theory of multiple trigonometric sums\". Moscow: Nauka, (1987).\n* Yu. V. Linnik, \"An elementary solution of the problem of Waring by Schnirelman's method\". Mat. Sb., N. Ser. 12 (54), 225–230 (1943).\n* R. C. Vaughan, \"A new iterative method in Waring's problem\". Acta Mathematica (162), 1–71 (1989).\n* I. M. Vinogradov, \"The method of trigonometrical sums in the theory of numbers\". Trav. Inst. Math. Stekloff (23), 109 pp. (1947).\n* I. M. Vinogradov, \"On an upper bound for G(n)\". Izv. Akad. Nauk SSSR Ser. Mat. (23), 637–642 (1959).\n* I. M. Vinogradov, A. A. Karatsuba, \"The method of trigonometric sums in number theory\", Proc. Steklov Inst. Math., 168, 3–30 (1986); translation from Trudy Mat. Inst. Steklova, 168, 4–30 (1984).\n*  Survey, contains the precise formula for G(k), a simplified version of Hilbert's proof and a wealth of references.\n*  Has an elementary proof of the existence of G(k) using Schnirelmann density.\n*  Has proofs of Lagrange's theorem, the polygonal number theorem, Hilbert's proof of Waring's conjecture and the Hardy–Littlewood proof of the asymptotic formula for the number of ways to represent N as the sum of s kth powers.\n* Hans Rademacher and Otto Toeplitz, The Enjoyment of Mathematics (1933) (). Has a proof of the Lagrange theorem, accessible to high-school students.\nExternal links\n*"
    }
  ]
}