{
  "content": [
    {
      "type": "text",
      "text": "# Waris Hussein\n\n| birth_place = Lucknow, United Provinces, British India\n| nationality =\n| citizenship =\n| education =\n| occupation = Television and film director\n| years_active = 1960–present\n| known_for = First Director of Doctor Who\n| mother     = Attia Hosain\n}}\nWaris Hussein (né Habibullah; born 9 December 1938) is a British-Indian television and film director. At the beginning of his career he was employed by the BBC as its youngest drama director. He directed early episodes of Doctor Who, including the first serial, An Unearthly Child (1963), and later directed the multiple-award-winning Thames Television serial Edward & Mrs. Simpson (1978).\nEarly life\nHussein was born Waris Habibullah in Lucknow, British India, into a family of the aristocratic Taluqdar class, and spent his early years mainly in Bombay. He came to the UK with his family in 1946, when his father, Ali Bahadur Habibullah, was appointed to the Indian High Commission. After the independence of India in 1947, his father returned to India, but his mother, Attia Hosain, chose to stay in England with her children, and worked as a writer and as broadcaster on the Indian Section of the BBC's Eastern Service from 1949.\nHe was educated at Clifton College, and then studied English literature at Queens' College, Cambridge, where he directed several plays. His contemporaries included Derek Jacobi, Margaret Drabble, Trevor Nunn, and Ian McKellen, whom he directed in several productions, including a Marlowe Society revival of Caesar and Cleopatra.\nCareer\nAfter graduating in 1960, he joined the BBC to train as a director. He also changed his name from Habibullah to Hussein: \"It sounded like the King of Jordan then, but [later] turned out to be more like Saddam – and that doesn't help in life\".\nHussein directed the first Doctor Who serial, An Unearthly Child, in 1963, although he was unsure about the effect directing television science fiction would have on his career:\"[I was] a graduate from Cambridge with honours, and you're directing this piece about cavemen in skins [..] I thought, 'Where have I landed up in my life?'\"\nIn 1964, Hussein returned to the series to direct most of the fourth serial, Marco Polo. He went on to direct many other productions such as a BBC television version of A Passage to India (Play of the Month, 1965); the BBC serial Notorious Woman (1974); the suffragette movement BBC drama Shoulder to Shoulder (1974); and the Thames Television serial Edward and Mrs Simpson (1978). During production of the latter two series, he worked once more with former Doctor Who producer Verity Lambert. He also directed for Thames the first story (a four-parter) in the Armchair Thriller series.\nHussein's feature film A Touch of Love (1969), with Ian McKellen among the cast, was entered into the 19th Berlin International Film Festival. Other theatrically released films include Melody  (1971), also known as S.W.A.L.K, with Jack Wild and Mark Lester, and Henry VIII and his Six Wives (1972), starring Keith Michell, Charlotte Rampling, and Donald Pleasence.\nIn the 1980s and 1990s, Hussein directed several television movies in the United States. One British project was Intimate Contact (1987), a four-part drama for Central TV with Claire Bloom and Daniel Massey, portraying the experience of a couple where the husband has contracted and ultimately dies from AIDS. Although he did not reveal it to anyone on the production at the time, the subject was particularly close one for Hussein, who lost his own partner Ian to the disease.\nHussein directed Sixth Happiness (1997), a film whose screenplay was written by Firdaus Kanga, the author of the semi-autobiographical novel Trying to Grow. Meera Syal, Nina Wadia, and Firdaus Kanga starred in the film.\nIn the BBC docu-drama An Adventure in Space and Time (2013), about the creation of Doctor Who, Hussein was portrayed by Sacha Dhawan.\nAwards\nHussein received a Best Drama Series or Serial BAFTA award in 1979 for Edward and Mrs. Simpson (shared with producer Andrew Brown), and an Outstanding Directing in a Variety or Music Program Emmy Award in 1985 for Copacabana.\nPersonal life\nHussein is gay, lost a partner of twelve years to AIDS in the 1980s, and discussed his own sexuality and the wider subject in a 2017 episode of the Doctor Who: The Fan Show.\nDirector credits\n*Play of the Month: A Passage to India (1965)\n*A Touch of Love (1969)\n*Quackser Fortune Has a Cousin in the Bronx (1970)\n*Melody (1971)\n*The Possession of Joel Delaney (1972)\n*Henry VIII and His Six Wives (1972)\n*Divorce His, Divorce Hers (1973)\n*Arch of Triumph (1984)\n*Murder Between Friends (1994)\n*Sixth Happiness (1997)\nReferences\nExternal links\n*"
    }
  ]
}