{
  "content": [
    {
      "type": "text",
      "text": "# Warir\n\n|pushpin_map      = Indonesia_Southwest_Papua#Indonesia Raja Ampat\n|pushpin_map_caption =\n|location         = Sele Strait\n|area_km2         = 42.8\n|length_km        = 10\n|coastline_km     = 48.3\n|elevation_m      =\n| country         = Indonesia\n| country_admin_divisions_title     = Province\n| country_admin_divisions           = Southwest Papua\n| country_admin_divisions_title_1   = Regency\n| country_admin_divisions_1         = Raja Ampat\n| population       =\n| population_as_of =\n}}\nWarir, or Waiji, is an island in the Raja Ampat Archipelago of Southwest Papua, Indonesia. Situated in the Sele Strait, it lies off the eastern coast of the larger island of Salawati. It has an area of , its length north to south is about , and its east-west extent varies between  and . It is relatively low-lying, with no point exceeding an elevation of . Its interior is forested, with mangroves fringing the coastal areas, and some agricultural land in the north. The small settlement of Wamega is situated on the north-west coast.\nWarir has long been used for cultivation, and it has been important for the people of Samate and Kalobo villages of Salawati. For about a year during World War II, the island was inhabited by the people of Samate who had fled the Japanese occupation of their village. After the establishment of Indonesian rule since the 1960s, immigrant Bugis people have settled on the island.\nThe waters around Warir fall within the Dampier Strait Marine Protected Area.\nSurroundings\nTo the west of Warir is the narrow and long Lenna Strait (, width ranging between 0.5 and 1.1&nbsp;km), which separates it from the mainland of Salawati, where the village of Kalobo is located facing Warir across the strait. The small islands of Waif, Motop, Kalobo Peleh and Kalobo Wei are located in the Lenna Strait. At the south shore of Warir, narrow creeks separate it from the three smaller islands of Warir Manyanyim (with an area of 0.3km), Warir Takektol (0.8km), an unnamed island with an area of 0.45km.\nTo the south-east, similar narrow creeks separate the islands of Batimee (4.6km) and Winkle (0.8km). Batimee in turn is surrounded by the tiny islands of Batimee Lil, Sobrain Maralol, Sobrain Sawi, and Batimee Ket.\nFurther up north along the coast of Warir can be found the tiny island of Wamasinketo. The island of Kasim, also known as Kasiem or Kasimraja (0.17km), lies off the northeastern tip of Warir.\nA few kilometres to the south-east across the strait of Sangoilin Mon lie the Kabra Islands.\nReferences"
    }
  ]
}