{
  "content": [
    {
      "type": "text",
      "text": "# Waris Mir\n\n| birth_place = Sialkot, Punjab, British India\n| death_date  =\n| education   = City University London (M.Phil)\n| occupation  = Journalist, educator\n| awards      =\n| spouse      = Mumtaz Begum (deceased)\n| children    = 5, including Hamid Mir, Amir Mir, Huma Mir\n| nationality = Pakistani\n}}\nWaris Mir (22 November 1938  9 July 1987) was a Pakistani journalist, intellectual, writer and academic known for his struggle to uphold the cause of democracy and press freedom.\nEarly life\nWaris Mir was born on 22 November 1938, the son of Mir Abdul Aziz, who was a poet in Punjabi, Kashmiri, Urdu and Persian. He was a staunch believer in the basic human rights of freedom of thought and expression.\nEducation and career\nWaris completed his secondary school education at Murray College in Sialkot, a city in the Punjab province of Pakistan. He received his master's degree in Journalism and Mass Communication in 1964 from the University of the Punjab, Lahore and joined the same department as a lecturer in 1965.\nHe completed his M.Phil. degree in journalism from City University in London in 1976. He was appointed Chairman of the Mass Communication Department in the University of the Punjab where he taught for over 20 years while at the same time writing articles and columns in Urdu newspapers of the country.\nHe wrote on national and international issues of his times. He was popular amongst his readers, especially during General Zia-ul-Haq's martial law.\nIn the time of dictatorship\nA staunch believer in the basic human rights of freedom of thought and expression, especially during the Martial Law periods of President General Ayub Khan and General Zia-ul-Haq.\nDespite facing censorship snipping, threats, mental torture and vandalism, he stood his ground firm against all odds, upholding his principled stance of opposing dictatorship and backing democracy and freedom of expression. The books authored by Mir in Urdu included Hurriyat-e-Fikar kai Mujahid (The warriors of the intellectual freedom), Kaya Aurat Aadhi Hai (Is woman half the human?), and Fauj ki Sayasat (The politics of the Army).\nDeath and legacy\nWaris died of a sudden cardiac arrest at the age of 48 under mysterious circumstances. He was laid to rest in the Punjab University graveyard close to the New Campus Underpass which was renamed as the 'Waris Mir Underpass' by the provincial government of Punjab in 2013. At the time of his death, Waris was at the peak of his professional career as a writer. His writing on Pakistan's contemporary politics, the army's meddling in politics, feminist issues, cultural reforms, religious beliefs, philosophical questions, literary references, and historical background continued to remain relevant long after his death. According to Asma Jahangir, a noted Pakistani human rights activist and lawyer, writing in The News International newspaper in 2013:\nIf one begins to read through his writing from a critical appreciative point of view, it becomes evident that he was a fiery and blunt writer who knew not how to mince his words while expressing his opinion. Waris Mir had liberal, democratic and progressive views. His writings particularly made a lasting imprint upon the minds of two kinds of people – the youth and women. To him, freedom and thought and expression equalled intellectual liberty in light of social responsibility.\nAwards and recognition\nWaris Mir was posthumously awarded Pakistan's highest civil award Hilal-e-Imtiaz (the Crescent of Excellence) on 23 March 2013 by the President of Pakistan in recognition of his meritorious services in the field of journalism and for furthering the cause of democracy through his writings.\nThe Government of Bangladesh also decorated him with the country's second highest prestigious award for foreigners, the Friends of Liberation War Honour in 2013 for writing meticulously and fearlessly as a Pakistani journalist against the Pakistani military action in 1971 against the civilian population of the then East Pakistan (now Bangladesh).\nPublications\n* Waris Mir ka Fikri Asasa – Intellectual asset of Waris Mir (Three volume book)\n* Fauj ki Syasat – (Army in Politics)\n* Kya Aurat Aadhi hai – Is woman half a human?\n* Mujahid-e-Hurriyet-e-Fikar\n* Khoshamdi Journalism and Politics\nReferences\nExternal links\n*"
    }
  ]
}