{
  "content": [
    {
      "type": "text",
      "text": "# Warley, West Midlands\n\n| os_grid_reference=\n| post_town=\n| postcode_area=\n| postcode_district=\n| dial_code=\n| constituency_westminster =\n| metropolitan_borough=        Sandwell\n| metropolitan_county=          West Midlands\n| hide_services=\n| population =\n| population_ref =\n| area_total_km2=\n|static_image=Warley Woods memorial.JPG\n|static_image_caption=The Edwardian drinking fountain in Warley Woods Park, in 2013\n|website=\n}}\nWarley is a residential area of Oldbury in the metropolitan borough of Sandwell in the West Midlands of the United Kingdom. Historically in both Worcestershire and Shropshire, the name has been used for both a civil parish (1884&ndash;1908) and a county borough/civil parish (1966&ndash;1974). Warley has been the name of a UK Parliament constituency since 1997.\nHistory\nA civil parish of Warley was created on 25 March 1884 by the merger of the Warley Salop parish with parts of the parishes of Warley Wigorn and Ridgacre. On 30 September 1908 the parish was abolished, becoming part of Oldbury, although the Warley name was retained as a district of Oldbury, which was developed for housing after 1920. This also included a development by Smethwick county borough council, into which part of Warley had been incorporated in 1928 to enable Smethwick council to build houses there.\nThe name was re-used in 1966 by the creation of the County Borough of Warley and civil parish, from the merger of Oldbury with Smethwick and Rowley Regis as well as parts of Dudley and Tipton. However, this was short-lived as the borough was merged with West Bromwich in 1974 to form the metropolitan borough of Sandwell.\nThe name remains as Warley Woods, Warley Infant and Nursery School, Warley Rugby Club and Warley Golf Club. Warley is also used in the names of local authority wards. It is also used in shops and local amenities in areas not part of the historical district itself especially those which were part of the old Warley Council e.g. in Blackheath, Rowley Regis and Smethwick.\nSee also\n* Evolution of Worcestershire county boundaries since 1844\n* Shropshire (Detached)\nReferences\nExternal links\n*"
    }
  ]
}