{
  "content": [
    {
      "type": "text",
      "text": "# Warlands\n\nWarlands is a fantasy comic book series from the now-defunct production house, Dreamwave Productions, created by Pat Lee. It consists of four main series and several side stories. Warlands series have been published by Image Comics and Dreamwave Productions own publishing company. A series of action figures was also released by D-Boy Toys in 2000.\nComic books\nThe series was first published by Image Comics beginning in August 1999 for a twelve issue run. Follow up series Warlands: The Banished Knight and Warlands: The Age of Ice were initially published by Image before Dreamwave began to publish their own comics in 2002. The final series to be published, Warlands: Dark Tide Rising was launched in December 2002 and was the only Warlands series solely published through Dreamwave. A 2005 relaunch of Warlands with the series Warlands: Malagens Campaign was to be published through Dabel Brothers Productions however following the bankruptcy of Dreamwave  the series never materialized and rights to the Warlands property were purchased by Canadian entrepreneur Christian Dery.\nWarlands\nThe story followed the Vampire hordes of Datara, led by Lord Malagen, who having defeated the dwarves, elves and humans living in the eastern part of Warlands, have to deal with a new set of heroes searching for an ancient artifact, the mysterious Darklyte Armor, which could defeat the Vampires once and for all.\nThe first series consisted of twelve issues and was published by Image Comics beginning in August 1999. Pat Lee was credited for writing the plot and penciling the series while Adrian Tsang served as writer, Alvin Lee served as Inker and Roger Lee Edited the series. The first issue was printed with a special chroma cover and back. The series was collected into two Trade Paperbacks published by Image Comics; Volume One: Darklyte collected #1-6 while Volume Two: Atrelegis collected #7-12.\nGood characters\n*Elessa: A deposed elven princess from Adara, high city of the elves. She has short pink hair and is adept at using swords.\n*Jerell: A blonde knight who was defeated at Shal Hazar Castle who travels with Elessa. He often wears a chainmail hood.\n*Delezar: A rogue mage with blue hair who wears a green cloak and hood.\n*Atrelegis: A young vampire prince believed dead for nearly 300 years, he makes his way back to reclaim the world of Warlands.\n*Zeph: Delezar's young assistant who always wears a mysterious blindfold.\nBad characters\n*Malagen: Evil vampire lord who always wears black armor. He has an evil scar across his face. His allies call him \"The Kahn\".\n*Aalok: Malagen's son.\n*Simpao: Malagen's faithful follower.\n*Vardemis : A vampire lord who can control the two headed dragon Shim'tar.\n*Tessan: An attractive vampire lord under Malagen who has long red hair and red eyes. He always wears matching red clothes.\nWarlands: The Age Of Ice\nAtrelegis defeated the Vampire hordes of Datara, led by Lord Malagen. Now a never-ending winter has enveloped Warlands and it is up to the archmage Zeph and a new team of heroes to end the cold spell.\nThe series was published from July 2001 and consists of nine issues, a #0 issue and a #. The first five issues were published by Image Comics but from the sixth issue the series was published through Dreamwaves own publishing company. The series was again penciled and plotted by Pat Lee with Adrian Tsang also serving as writer. A Trade Paperbacks - Warlands Volume 3: The Age of Ice was published by Dreamwave in May 2003.\nGood characters\n*Elene: A blonde elven archer who is looking for Zeph. She has a ponytail and seeks an end to the cold weather. Daughter of Marisana and Jerell from the first Warlands story.\n*Zeph: Young assistant to Delezar, who was killed. He always wears a mysterious blindfold. He is now an archmage.\n*Tahjarra: A dark-haired female berserker who is friends with Elene.\n*Jaros: A member of the Ryotian race, he is a strong man with white wings and bird feet.\nBad characters\n*Aeteva: Evil Ryotian queen who has grey wings and bird feet. She keeps numerous female, human slaves.\n*Aragon: A black-haired young man with a bandanna who has dark powers.\n*Astaroth: A giant red-skinned demon who is summoned by Aragon to defeat Zeph. He goes on the rampage with hordes of evil creatures and threatens to destroy the outpost, causing all the characters in the story to unite.\nWarlands: Banished Knights\nFollows a group of heroes in Warlands when vampires from Malagen's regime find themselves being persecuted by the other races. It also reveals what happens to Tessan.\nThe First issue was published in December 2001 by Image Comics. The series was written by Adrian Tsang, pencilled by Alvin Lee (Issues #1-2) & Mateo Guerrero (Issues #3-4) and Edited by Roger Lee.\nGood Characters\n*Greyson: A muscle-bound young vampire with blonde hair who was left over from the war. He wears a thick headband.\n*Rosala: A stunning young vampire woman with pale hair and skin who uses a scythe.\n*Raithe: A raven-haired oriental vampire who uses two swords. He has black armour and red eyes.\nBad Characters\n*Tessan: An attractive vampire lord under Malagen who has long red hair and red eyes. He always wears matching red clothes.\n*Belmiro: Rosala's friend. He is a green-haired vampire.\nWarlands: Dark Tide Rising\nA gang of heroes arises once again to combat the troubled soul of Warlands, which has become unbalanced. Its dark soul threatens to wipe out all the light and peace in the world.\nThe first issue was published in May 2002 by Dreamwave Productions. The series was written by Bryan Augustyn with pencils by Matteo Guerrero and edited by Roger Lee.\nGood characters\n*Laina: A blonde elven mage with a ruby in her headband.\n*Iona: A human berserker girl with light purple hair. She wields a greatsword and comes from the snowy mountains.\n*Baggot: The lovestruck Dwarven companion of Laina.\n*Zadok: A priest of the \"Unknown Light\" with a beard and long blonde hair. He has a pet wolf called Freya.\n*Pelonis: A brash young man who seeks to be a holy warrior.\n*Shaizan: The golden-hearted ruler of Xian Li city. He is able to turn into a red Oriental dragon.\n*Luzien: A legendary character of infinite light and goodness similar to Jesus. His spirit inhabits Luzien's Ladder.\nBad characters\n*Balen Sargos: An ambitious warlord who seeks opportunity. He also wants to be good at the same time.\n*Kyra: The dark-haired lady who drives Balen.\n*Shadow Soul: The dark heart of Warlands.\nAction figures\nA line of Action figures was released by D-Boy in 2000, and was previewed at the American International Toy Fair in 2000. One line of figures was released consisting of four characters; Elessa, Prince Aalok, Shrogan and Lord Malagen. Multiple versions of each figure were released including convention exclusives and a limited edition line of Signature Edition Variants.\nReferences"
    }
  ]
}