{
  "content": [
    {
      "type": "text",
      "text": "# Warlock (band)\n\n| years_active        = 1982–1989\n| label               = Mausoleum, Vertigo\n| associated_acts     =\n| website             =\n| current_members     =\n| past_members        = Doro PeschPeter SzigetiRudy GrafThomas StudierMichael EurichFrank RittelNiko ArvanitisTommy BolanTommy HenriksenBobby RondinelliJon Levin\n}}\nWarlock was a German heavy metal band founded in 1982 in Düsseldorf by members of the underground bands Snakebite and Beast. The band gained popularity and some commercial success in Europe in the mid-1980s, due to the personality and stage presence of lead vocalist Doro Pesch. Warlock supported successful heavy metal bands on tour, such as W.A.S.P., Judas Priest, Dio and Megadeth.\nBy the end of the decade, Doro Pesch was the sole original member who remained in the band and she was forced to change the name to Doro for legal reasons. Doro, the band, continues to play several songs taken from the Warlock repertoire in their live shows.\nThe band has reunited for festival appearances and special occasions since 2003, under the name Warlock 1986.\nHistory\nFormation and first contract\nThe first nucleus of the band was formed under the name Snakebite in Düsseldorf, West Germany in 1980, and was composed of Doro Pesch on vocals, Michael Bastian on guitar, Frank Rittel on bass and Thomas Franke on drums, the latter coming from the band Stallion. Franke was soon replaced by Michael Eurich and, just before disbanding, Snakebite acquired the left-handed Peter Szigeti as second guitarist from Beast. Snakebite and Beast were two of the many bands playing in the local clubs and bars and recording cheap demos to promote their music. Pesch, Szigeti and Eurich did try-outs with other groups, but in October 1982 went on to form a new band with Thomas Studier on bass and guitarist Rudy Graf, who came up with the name Warlock and a bucket full of songs. The new band found a manager in Peter Zimmermann, who arranged gigs in support of German hard rockers Trance, contributing to build a solid reputation for Warlock in the local underground metal scene.\nAfter recording a four-track demo and sending it to several record labels and music magazines, the band obtained a contract with the Belgian independent label Mausoleum Records. Frank Rittel joined Warlock on bass before they started recording their debut album Burning the Witches in 1984, with producer Axel Thubeauville, a talent scout of German heavy metal groups. Burning the Witches was recorded in only six days and remixed by Rainer Assmann and Henry Staroste before publication.\nThe album was well received by critics and fans and Warlock toured for the first time outside of Germany to launch their first release, often alongside their label mates Steeler. Unfortunately, bad distribution and poor financing for the tour from the record label crippled the commercial potential of the album, leaving the band profoundly dissatisfied with Mausoleum.\nHellbound and True as Steel\nIn early 1985, the band signed a contract with the major label Phonogram and recorded their second album Hellbound, produced by Henry Staroste and released in May 1985 on Vertigo Records in Europe. The band started to receive attention from the media and appeared in TV shows in the UK and Germany. Their first full European tour brought them to Camden Palace Theater in London, where the concert was filmed for Warlock's first video release Metal Racer. Warlock's live performance was welcomed with a rave review by the British magazine Kerrang! and the group was elected 'Best New Band' of 1985 in the Readers' Poll of that magazine. Doro Pesch was also elected Best Female Singer by the readers of the music magazine Metal Forces at the end of 1984. The band played at the Metal Hammer Festival at Loreley, Germany in September, alongside Metallica, Venom, Running Wild, Pretty Maids, Nazareth and Wishbone Ash.\nLater that year, after the tour for Hellbound, guitarist Rudy Graf left the band and was replaced by Niko Arvanitis, a former bandmate of Rittel in Stormwind.\nThis updated line-up recorded the album True as Steel in May–June 1986, produced again by Henry Staroste and mixed in the US by Michael Wagener. The album received mixed reviews, but was Warlock's highest-charting in Germany, climbing up to No. 18, and got a fair amount of radio airplay in the US, due to the single \"Fight for Rock\". The band's first music video was made for that song and appeared on MTV.\nOn 16 August 1986, Doro Pesch was the first woman to front a band at the Monsters of Rock festival at Castle Donington, England, where Warlock played on the same stage of Motörhead, Def Leppard, Ozzy Osbourne and Scorpions. Warlock also opened the Monsters of Rock festival at the Maimarktgelände Eisstadion in Mannheim, West Germany, with a line-up similar to the British show and the addition of McAuley Schenker Group and Bon Jovi. 1986 and 1987 were spent on a tour which included UK dates supporting W.A.S.P., and European dates supporting metal superstars Judas Priest, during their 'Fuel for Life' tour.\nInternational breakthrough and change of name\nAfter the tour for True as Steel, Pesch spent time in the US with new manager Alex Grob to promote the band and arrange tours and recordings in America. At the same time, Szigeti and Rittel decided to leave the band, apparently unwilling to face the commitment that a transfer to the United States would involve. They were promptly replaced by the American musicians Tommy Bolan (formerly of Armed Forces), and Tommy Henriksen. With the new line-up, Warlock recorded in the US their fourth and last studio album, Triumph and Agony, produced by Joey Balin in 1987. Triumph and Agony was Warlock's best-selling album, going Gold in Germany and reaching number 80 in the Billboard 200 US album chart. The videos for the singles \"All We Are\" and \"Für Immer\", shot respectively in the Los Angeles river basin and in the swamps of Baton Rouge, were on rotation on MTV's heavy metal program ''Headbangers' Ball''.\n, Warlock's lead singer]]\nWarlock toured Europe as support band for Dio and, after that, proceeded to make their first and sole extensive US tour, opening for Megadeth alongside Sanctuary. They played also several shows on their own with different opening acts, such as Fates Warning, Sword and Lillian Axe. Eurich and Arvanitis quit after the tour and were replaced by Bobby Rondinelli (formerly of Rainbow) and guitarist Jon Levin (sometimes mislabeled as Jon Devin).\nAt the end of 1988, Doro Pesch remained the only original member and the only German still in the band. At this time, Peter Zimmermann, the band's ex-manager, sued for rights to the band name and merchandise, and won. Pesch continued to fight for the name, but conceded with record label requests to rename the band DORO in order to continue her career; the first edition of the LP Force Majeure, recorded with the final formation of Warlock, was the last one to expose a sticker with the name of the band next to DORO, with the exception of the compilation Rare Diamonds of 1991. Pesch eventually regained the rights to the name Warlock in 2011, after years of legal battles. DORO is an active band and still performs Warlock songs in their live shows.\nOther activities\nAfter his departure from Warlock, Rudy Graf joined the German speed metal band Rage in 1986 and recorded with them the album Execution Guaranteed. Today he's working as a studio musician and songwriter.\nFrank Rittel, Peter Szigeti and former Snakebite drummer Thomas Franke played in 1987 on Animal House, the first solo album by the former Accept singer Udo Dirkschneider. Rittel and Szigeti formed in the 1990s the melodic metal bands Energy and Coracko, without much success.\nMichael Eurich formed the band Casanova with singer Michael Voss, which was active at end of the 80s.\nDoro Pesch reunited with Szigeti, Arvanitis, Rittel and Eurich to perform as Warlock at her 20th Anniversary celebration concert in Düsseldorf on 13 December 2003 and later at Wacken Open Air festival 2004. More legal troubles over using the name Warlock ensued with former member Rudy Graf and appearances of the reunited band at festivals and special concerts were billed as \"Warlock 1986\". Frank Rittel quit playing bass and retired from the music business in 2004.\nArvanitis and Szigeti played together in late April 2005 at the 'Rock Classic Allstars' show in Bochum, Germany, with Martin Kesici, Axel Rudi Pell, Kai Hoffmann, Jeff Brown (ex-Sweet) and German soccer star Holger Aden.\nIn December 2008, Pure Steel Records released the first official tribute album to Warlock, titled Tribute to Steel, with the special appearance of the band members.\nSince 2011, Tommy Henriksen has been a member of Alice Cooper's solo band, and since 2012 he has also been a member of Hollywood Vampires, a supergroup that also includes Cooper, Joe Perry, and Johnny Depp.\nMusic and style\nWarlock were one of the few successful female-fronted heavy metal bands in the circuit during the 80s, when the scene was dominated by male singers. Doro Pesch's voice and stage presence immediately caught the attention of fans and press, and she became the principal means of promotion for the band, as well as the main spokesperson for Warlock.\nWarlock's music is always primarily described as heavy metal, and the band cite as main influences 1970s metal acts such as Judas Priest, Scorpions, Accept, and groups from the new wave of British heavy metal movement.\nWarlock's sound and songwriting evolved from the traditional heavy metal of their debut album Burning the Witches to the faster and darker Hellbound, which incorporates elements of power metal, such as fast tempos, powerful choruses and fantasy-inspired lyrics. True as Steel is a more commercial album, where any reference to fantasy and the occult in the lyrics was abandoned. Triumph and Agony recovers elements of the first albums, but veers also towards a melodic and FM radio-friendly sound, influenced by the US production.\nPower ballads were also characteristic of Warlock and are present in the track listings of every album.\nLineups\n1982–1983\n* Doro Pesch – vocals\n* Peter Szigeti – guitar\n* Rudy Graf – guitar\n* Thomas Studier – bass\n* Michael Eurich – drums\n1983–1985\n* Doro Pesch – vocals\n* Peter Szigeti – guitar\n* Rudy Graf – guitar\n* Frank Rittel – bass\n* Michael Eurich – drums\n1985–1987\n* Doro Pesch – vocals\n* Peter Szigeti – guitar\n* Niko Arvanitis – guitar\n* Frank Rittel – bass\n* Michael Eurich – drums\n1987–1988\n* Doro Pesch – vocals\n* Niko Arvanitis – guitar\n* Tommy Bolan – guitar\n* Tommy Henriksen – bass\n* Michael Eurich – drums\n1988–1989\n* Doro Pesch – vocals\n* Jon Levin – guitar\n* Tommy Henriksen – bass\n* Bobby Rondinelli – drums\nTimeline\nDiscography\n*Burning the Witches (1984)\n*Hellbound (1985)\n*True as Steel (1986)\n*Triumph and Agony (1987)\nReferences\nExternal links\n*[http://www.doropesch.com Doro Pesch's website]\n* (also includes Warlock information)"
    }
  ]
}