{
  "content": [
    {
      "type": "text",
      "text": "# Warlpiri language\n\n| familycolor      = Australian\n| fam1             = Pama–Nyungan\n| fam2             = Ngumpin–Yapa\n| fam3             = Ngarrkic\n| dia1             = Warlpiri\n| dia2             = Ngaliya\n| dia3             = Walmala\n| dia4             = Ngardilpa\n| dia5             = Eastern Warlpiri\n| sign             = Warlpiri Sign Language\n| iso3             = wbp\n| glotto           = warl1254\n| glottorefname    = Warlpiri\n| aiatsis          = C15\n| map              = Warlpiri map.png\n| notice           = IPA\n| pronunciation    =  ()\n| states           = Australia\n| nativename       =\n| script           = Latin\n}}\nThe Warlpiri ( or ) language is an Australian Aboriginal language spoken by close to 3,000 of the Warlpiri people from the Tanami Desert, northwest of Alice Springs, Central Australia. It is one of the Ngarrkic languages of the large Pama–Nyungan family, and is one of the most widely-spoken Aboriginal languages in Australia in terms of speakers. One of the most well-known terms for The Dreaming (an Aboriginal spiritual belief), Jukurrpa, derives from Warlpiri.\nWarnayaka (Wanayaga, Woneiga), Wawulya (Ngardilpa), and Ngalia are regarded as probable dialects of Warlpiri on the AUSTLANG database, although with potentially no data; while Ngardilypa is confirmed.\nAvoidance register\nIn Warlpiri culture, it is considered impolite or shameful for certain family relations to converse.  (For example, a woman should not converse with her son-in-law.) If such conversation is necessary, speakers use a special style of the language, the avoidance register. The avoidance register has the same grammar as ordinary Warlpiri but a drastically reduced lexicon. Most content words are replaced by a generic synonym or a word unique to the avoidance register.\nSign language\nWarlpiri Sign Language exists as well as the spoken language.\nPhonology\nIn the following tables of the Warlpiri sound system, symbols in  give the practical alphabet used by the Warlpiri community. Phonemic values in IPA are shown in /slashes/ and phonetic values in [square brackets].\nVowels\n{| class=\"wikitable\" style=\"text-align:center;\"\n!\n! Front\n! Back\n|-\n! Close\n|\n|\n|-\n! Open\n| colspan=\"2\" |\n|}\nWarlpiri has a standard three-vowel system, similar to that of Classical Arabic, with a phonemic length distinction creating a total of six possible vowels.\nConsonants\n{| class=\"wikitable\" style=\"text-align:center;\"\n! rowspan=\"2\" |\n! colspan=\"2\" | Peripheral\n! Laminal\n! colspan=\"2\" | Apical\n|-\n! Bilabial\n! Velar\n! Palatal\n! Alveolar\n! Retroflex\n|-\n! Plosive\n| ~\n| ~\n| ~\n| ~\n| ~\n|-\n! Nasal\n|\n|\n|\n|\n|\n|-\n! Trill\n| colspan=\"2\" |\n|\n|\n|\n|-\n! Flap\n| colspan=\"2\" |\n|\n|\n|   is phonetically an unusual consonant  that is possibly unique to Warlpiri. The tip of the tongue begins in retroflex position but then moves forward rapidly, flapping against the alveolar ridge.}}\n|-\n! Lateral\n| colspan=\"2\" |\n|\n|\n|\n|-\n! Approximant\n| colspan=\"2\" |\n|\n| colspan=\"2\" |\n|}\nAs shown in the chart, Warlpiri distinguishes five positions of articulation and has oral and nasal stops at each position. The oral stops have no phonemic voice distinction, but they display voiced and unvoiced allophones. Stops are usually unvoiced at the beginning of a word and voiced elsewhere. In both positions, they are usually unaspirated.\nWarlpiri, like most other Australian languages, has no fricative consonants.\nSyllables and stress\nWarlpiri syllables are quite constrained in structure. All syllables begin with a single consonant, there are no syllable-initial consonant clusters and no syllable begins with a vowel. After the consonant is a single long or short vowel, which is sometimes followed by a single closing consonant.  Open syllables are much more common than closed ones. No syllable ends with a stop or with the retroflex flap /ɽ/.\nThe most common kind of consonant cluster occurs when a syllable ends with a nasal consonant and the next syllable begins with the corresponding stop, but other clusters like /rk/ and /lp/ also occur.\nStress is not generally distinctive but is assigned by rule. Polysyllabic words receive primary stress on the first syllable, with secondary stresses tending to occur on alternate syllables thereafter; this rhythm may be broken by the structure of the word and so some three-syllable stress groups occur.\nVowel harmony\nIf two adjacent syllables in a Warlpiri morpheme have high vowels, those high vowels are almost always alike: both /u/ or both /i/. The number of Warlpiri roots with adjacent syllables having /u/ and /i/ is very small. Both progressive and regressive'' vowel harmony occur. In progressive vowel harmony, the second vowel changes to match the first; in regressive harmony, the first changes to match the second.\nThe tendency to prefer adjacent high vowels to be identical also spreads across morpheme boundaries within a word. Adding a suffix to a word can place a /u/ and an /i/ in contact. When that happens, one of the vowels tends to assimilate by changing to match the other vowel. That kind of assimilation is called vowel harmony and is common in the world's languages. It is found, for example, in Finnish, Hungarian, Mongolian and Turkish.\nRegressive harmony occurs only when a tense suffix is attached to a verb (see below). For example, when the verb  (class 2) is placed in the past tense with the suffix , the result is , not . Progressive harmony occurs with most other kinds of suffixes. For example, when the ergative case suffix  is attached to the noun  'boomerang', the result is , not .\nOn occasion, long chains of high vowels can assimilate, each forcing the next. For example, when the class 2 verb  is attached to the past tense suffix -rnu, the resulting word is .\nWords\nNo Warlpiri word begins with an alveolar consonant; the first consonant of a word must be bilabial, palatal, retroflex or velar. Exceptions include borrowings such as  'dollar', from English dollar.\nAll Warlpiri words end in vowels. When a word's final meaningful component ends in a consonant, the repair strategy is almost always to append a meaningless suffix, usually .\nAlphabet\nSince the 1950s, Warlpiri has been written in the Latin script using an alphabet originally devised by Lothar Jagst and later modified slightly. The Warlpiri alphabet uses only ordinary letters, with no accent marks, and has the following deviations from IPA:\n#Long vowels are written by doubling the vowel letter: ii, aa, uu.\n#Retroflex consonants are written with digraphs formed by prefixing r to the usual alveolar symbol: rt, rn, rl.\n#The palatal stop is written j.\n#Other palatals are written with digraphs formed by suffixing y to the usual alveolar symbol: ny, ly.  The palatal approximant is written y.\n#The velar nasal is written ng.\n#The alveolar trill is written rr.\n#The retroflex flap is written rd.\n#The retroflex approximant is written r.\nTo those basic rules are added two adjustments to make the alphabet easier to use.\n#The indicators y (for palatal) and r (for retroflex) are often dropped if they are redundant in consonant clusters with the same position of articulation: nyj is written nj, rnrt is written rnt.\n#At the beginning of a word, the retroflex indicator r may be omitted. That does not produce ambiguity because no Warlpiri word begins with a plain alveolar consonant:  'foot' is written .\nMorphology\nVerbs\nWarlpiri verbs are built from a few hundred verb roots, distributed among five conjugation classes. Two of the classes contain the vast majority of verb roots; the other three classes have only a few roots each.\nA large class of modifying prefixes, or preverbs, are used to create verbs with specific meanings. For example, the verb root  means 'run' by itself, and  means 'scurry into hiding'. The preverb  is used with a few other verb roots to form other verbs of hiding or seclusion. Preverbs are sometimes reduplicated for emphasis or to change the meaning.\nMost preverb-verb combinations are fixed in the lexicon, and new combinations cannot be created freely. However, a few preverbs are very productive and can be combined with many different roots, and some roots accept almost any preverb.\nThe verb root is followed by a tense suffix. There are five tense suffixes for each conjugation class, as shown in the following table.  (Some optional variations have been omitted.)\n{| class=\"wikitable\" border=\"1\" style=\"text-align: center\"\n!Class\n!Nonpast\n!Past\n!Imperative\n!Immediate future\n!Present\n|-\n!1\n|\n|\n|\n|\n|\n|-\n!2\n|\n|\n|\n|\n|\n|-\n!3\n|\n|\n|\n|\n|\n|-\n!4\n|\n|\n|\n|\n|\n|-\n!5\n|\n|\n|\n|\n|\n|}\nNouns\nWarlpiri nouns are assembled from thousands of roots, with a rich array of derivational techniques such as compounding and derivational suffixes. Plurals are formed by reduplication of the root.\nAuxiliary word and agreement suffixes\nEach full Warlpiri clause may contain an auxiliary word, which, together with the verb suffix, serves to identify tense and to clarify the relationship between main and dependent clauses.  Common auxiliaries include  (present tense),  (future tense),  (conditional).  The auxiliary word is almost always the second word of a clause.\nThe auxiliary word also functions as the home for an elaborate family of suffixes that specify the person and number of the subject and object of the clause. They are similar to the familiar conjugational suffixes that agree with the subject in Indo-European languages, but in Warlpiri, they are placed on the auxiliary instead of on the verb and agree with the object as well as the subject.\nAn example of a suffixed auxiliary word can be seen in the farewell,  'I will see you.'  Here,  indicates future tense, -rna indicates first-person singular subject 'I', -ngku indicates second-person singular object 'you' and  is the nonpast form of the class 3 verb 'see'.\nIn the past tense, the auxiliary word often drops out completely. In that case, the agreement suffixes attach instead to the first or second word of the clause, as in  'I saw you'.\nThe junction at which the agreement suffixes are attached can trigger progressive vowel harmony.  Thus,  '(S)he will see you' shows the vowel of the suffix -ngku (second-person singular object) assimilating to the final vowel of .\nSee also\n*Endocentric and exocentric\n*Non-configurational language\nReferences\nSources\n*Nash, David (1980). Topics in Warlpiri Grammar, PhD thesis, MIT.\n*Laughren, Hoogenraad, Hale, Granites (1996).  ''A Learner's Guide to Warlpiri: Tape course for beginners'', IAD Press, Alice Springs.\nFurther reading\n*\n*\n*\n* [https://doreco.huma-num.fr/languages/warl1254 Warlpiri DoReCo corpus] compiled by Carmel O'Shannessy. Audio recordings of narrative texts, with transcriptions time-aligned at the phone level and translations."
    }
  ]
}