{
  "content": [
    {
      "type": "text",
      "text": "# Warlock (video game)\n\n|released = May 26, 1995\n|genre = Action  Platform\n|modes=Single-player\n|platforms = Genesis, Super NES\n}}\nWarlock (also stylized Beware the Ultimate Evil of Warlock) is a side-scrolling action video game based on the 1989 horror film series of the same title. It was released on May 26, 1995 through Acclaim Entertainment for the Genesis and Super NES platforms. A version for the Atari Jaguar was planned by Trimark Interactive but never released.\nStory\nOnce every thousand years, the sun and the moon align together. When this happens, the Evil One sends his only son, the Warlock, to Earth to gather six ancient runestones. When assembled, the runestones give the possessor ultimate power to undo the Earth's creation. Using sorcery inherited from his ancestors, a modern druid must travel through time to prevent the Warlock from finding all of the runestones.\nGameplay\nAs a druid, the player is armed with seven different spells that will aid him in his battle against the Warlock. Up to 255 spells of a certain kind can be carried, although the status bar only shows up to nine.\n#weak smart bombs\n#strong smart bombs\n#healing\n#revival\n#protection\n#tremor\n#time reversal\nReception\nSNES: 44%\n|NGen=SMD:SNES:\n|TOT=SNES: 55/100\n}}\nNext Generation reviewed the SNES version of the game, rating it two stars out of five, and stated that \"There's nothing wrong, just nothing notable.\"\nCaptain Squideo of GamePro gave the Genesis version a negative review, remarking that the game is highly derivative of other platform shooters, and that it suffers from delayed controls, overly small enemies, and a lack of variety in the gameplay. A reviewer for Next Generation gave the Genesis version one out of five stars. He too found the game overly derivative, and commented that \"Some of the backgrounds are well shaded, and the accompanying music is a touch on the eerie side, but all this game does is to prove that bad movies make horrible side-scrolling action games.\"\nThe SNES version was better received. Upon its release The Post and Courier gave a positive review for the game, saying that the SNES version's graphics were better than those of the Genesis/Mega Drive port and that the game was overall good for novice and young players. GamePros Bro' Buzz gave the Super NES version a more mixed appraisal than Captain Squideo's Genesis version review. He also criticized the delayed controls, but praised the organ music and sound effects, and concluded \"Warlock won't set your system on fire, but ... it's a good intermediate adventure with some truly challenging puzzles.\"  However, in 1999, Game Informer gave the SNES version 3.5 out of 10, saying, \"While visually appealing at times, Warlock is repetitive and lacking in interesting enemies, and the only thing that challenges the player is the horrid play control of the character.\"\nIn 2012, Complex included the game on its list of \"The 10 Greatest Wizards in Video Games\" due to the versatility of the druid player.\nReferences\nExternal links\n* [http://ultimateconsoledatabase.com/reviews/genesis/warlock_GEN.htm Ultimate Console Database]"
    }
  ]
}