{
  "content": [
    {
      "type": "text",
      "text": "# Warmonger: Operation Downtown Destruction__disambig_1\n\nWarmonger: Operation Downtown Destruction is a first-person shooter video game developed by NetDevil that uses the Nvidia PhysX engine. It was available as a paid download from the official site and from Nvidia via their free GeForce Power Pack download.\nFeatures\nThe game, which is built on the Unreal Engine 3, uses the Nvidia PhysX physics engine. This allows for a destructible environment, as well as advanced cloth and water effects. The PhysX engine allows players to block passages and create new ones, allowing for more realistic gameplay. For example, after entering the upper floor of a building, a sniper can blow up the stairs behind them to block access, but conversely a rocket blast to the wall that is providing cover will leave them vulnerable. The only parts of the environment that cannot be destroyed are core gameplay objects and/or objects that line the borders of a map. However, due to the amount of indestructible terrain, many actions which one might expect to be possible are not.\nGameplay\nWarmonger is set in an apocalyptic future during full-scale corporate war within the cities of the US. These once-proud metros have been host to combat operations that have left them abandoned and practically razed. Players play as mercenaries in this war, though there is no storyline to the gameplay.\nThere are two game modes: \"Capture and Hold\", where teams vie for control points; and a standard \"Team Deathmatch\". There are 7 multiplayer maps and a training map.\nThe game is played online through the GameSpy Comrade gaming service, which is bundled with the game. The game can also be played over a LAN.\nReferences\nExternal links\n* [http://www.netdevil.com/ NetDevil]\n* [http://www.nvidia.com/content/forcewithin/us/download.asp GeForce Power Pack download]\n* [http://physxinfo.com/data/vreview_warmonger.html PhysX screenshots/video]"
    }
  ]
}