{
  "content": [
    {
      "type": "text",
      "text": "# Warm Mineral Springs (spring)\n\n| locmapin        = Florida#USA\n| location        = Warm Mineral Springs, Florida\n| area            =\n| added           = November 28, 1977\n| visitation_num  =\n| visitation_year =\n| refnum          = 77000408\n}}\nThe Warm Mineral Springs is a water-filled sinkhole located in North Port, Florida, a mile north of U.S. 41. The primary water supply is a spring vent deep beneath the pool's water surface. Warm Mineral Springs is the only warm water mineral spring in the State of Florida. It is an important geological and archaeological site containing Native American remnants. The site was operated as a spa from 1946 until 2000. It was added to the U.S. National Register of Historic Places on November 28, 1977. The springs re-opened for swimming only in 2014.\nGeology\nWarm Mineral Springs is a sinkhole formed in carbonate rock by the collapse of the roof of a cavern 30,000 years ago. The land surrounding the sinkhole is flat, and about  above mean sea level. The circular opening of the sinkhole at the current water level is  across. The sinkhole is  deep, and is shaped roughly like an hourglass. The opening narrows to  across a few meters below the surface of the water. About  below the surface the opening widens for a short space, forming a ledge under an overhang. The opening narrows to  across at  below the surface, and then opens up again, reaching  across at the bottom of the sinkhole. Debris from the collapsed roof and sides of the sink, and other material that has fallen into the sink, forms a large cone at the bottom, rising to  below the surface of the water.\nThe environment in Florida during the Pleistocene period was much different than today. Due to the enormous amount of water frozen in ice sheets during the last glacial period, the sea level was at least  lower than it is today. Florida had about twice the land area of today, its water table was much lower, and its climate was cooler and much drier. There were few running rivers or springs in the part of Florida that is now above sea level. The few water sources in the interior of Florida were rain-fed lakes and water holes perched on relatively impervious deposits of marl and deep sinkholes partially filled by springs, such as Warm Mineral Springs. The water level in the sinkhole 12,000 years ago was about  lower than it is today. Dripstone (stalactites and stalagmites) has formed on the walls of Warm Mineral Springs down to about  below the present level of the water, indicating that the water level in the sinkhole was at least low long enough for the dripstone to form.\nAlthough there are many small freshwater springs in the walls of the sinkhole, the primary source is a vent  below the surface of the water which discharges an estimated  a day of warm [] mineralized water. The water has a high content of dissolved chloride (1,600 to 1,700 milligrams per liter [mg/L]) and hydrogen sulfide (9,200 to 9,600&nbsp;mg/L), and essentially no dissolved oxygen. The source of the water is uncertain. The water enters the sinkhole at the  level from a conduit that extends with several turns to a point  from the entrance and  below the surface of the water. The conduit has an elliptical shape, about  high by  wide, for much of its length. At the far end the conduit opens up into two small caverns. Most of the flow appears to enter through the floor of the last cavern. Between  and  a day overflows from the sinkhole.\nHistory\nThe area surrounding the spring was developed as a spa in 1946, including the construction of a bathhouse. The property was sold in 1955 and the new owners began a housing development, platting 3,000 housing lots on the property. The Warm Mineral Springs Motel was opened at the entrance to the spring in 1958. In 1959, a Park Spa Building and Cyclorama (depicting Ponce de Leon's alleged discovery of the Fountain of Youth) were built at the spring to house a Florida Quadricentenial celebration, which ran from December 14, 1959, to March 15, 1960. The Spa Building and the Cyclorama were designed by Jack West, a leader of the Sarasota School of Architecture. The Spa Building, the Cyclorama, and a sales building attached to the Spa, were added to the National List of Historic Places in 2019 as the Warm Mineral Springs Building Complex.\nIn the late 1950s, William Royal and other scuba divers found artifacts and human bones from at least seven individuals in Warm Mineral Springs. A partially burned log found in association with some of the human bones was radiocarbon dated to about 10,000 years ago. If the bones were the same age as the log, then the bones were the oldest known evidence of human occupation in Florida at the time. Bone artifacts recovered in association with the human bones were described as of \"Archaic period in the Americas-type.\" Apparently, the bones and artifacts were deposited above the water level in the sinkhole at that time.\nOne skull recovered from under sediment about  under the present water level in the sinkhole contained organic matter. Hospital medical staff who examined the contents of the skull observed that it looked like a brain. One doctor reported that he could distinguish the cerebellum from pieces of the cerebrum. A section through the material also appeared to show grey and white matter. Tests were consistent with the material being brain matter, but no cellular structure could be observed.\nUnrestricted access to the spring resulted in scuba divers removing human bones and artifacts and stalactites and stalagmites as souvenirs and for sale. Almost all artifacts had been removed from the sinkhole before scientific exploration began. The property owners started restricting access to the sinkhole and trying to prevent looting and vandalism in the 1970s.\nAgencies that care for public property are required to inventory archaeological resources and to ensure their protection and preservation in the long term. They employ archeologists, part of whose job it is to catalog and curate artifacts found on that property. Landowners and those having permission to collect from the landowners are less constrained but not entirely free to do whatever they wish. Unmarked graves are protected by law and it is illegal to disturb them except under certain terms of various federal, state and local laws.\nWilburn Cockrell, an archaeologist at Florida State University, started working at Warm Mineral Springs in 1972. This work led to the private owner's protecting the site due to its archaeological significance. Archaeological exploration of the sinkhole paused in 1975, resuming in 1984. Phase II of the project found evidence of tool making by early humans. There is evidence of the Paleo-Indian and Archaic cultures.\nWilburn Cockrell has described Warm Mineral Springs as the \"burial ground\" for the prehistoric residential community at nearby Little Salt Spring. In a 1988 interview, Cockrell stated that the remains of more than 20 Paleoindians have been found in the sinkhole, including some radiocarbon dated to 12,000 years ago. The archaeologists also found bones of several Pleistocene animals, including a giant ground sloth, a saber-toothed cat, a horse, and a camelid. Cockrell found an 11,000-year-old human skeleton in a fetal position, apparently placed in a crevice with broken stalactites holding it in place. This may be the oldest known intentional burial in North America.\nIn 1996-1997, a group of diver explorers conducted an underwater survey of the site resulting in the mapping of two warm water vents ~97 degrees F and two cool water vents ~76 degrees F. The group also videotaped the site including the source of the deepest warm water vent at the end of a 150&nbsp;ft. lone cave.\nWarm Mineral Springs was purchased on December 20, 2010, by Sarasota County and the city of North Port for $5.5 million.\nArchitecture\nThe buildings serving the springs have been attributed to Sarasota School of Architecture architect Jack West and were constructed sometime in the late 1950s. The entry building contains a gift shop, locker rooms, showers, and a restaurant.\nA separate circular structure dubbed the \"Cyclorama\" contains a 226 x 13&nbsp;ft 360-degree mural, with some 3-D figures, depicting nine scenes of Ponce de Leon's arrival in Florida in 1513 and his search for a fountain of youth, since Warm Mineral Springs is thought to have been that particular fountain. The Cyclorama was created as part of the 1959 commemorations for the 400th anniversary of Tristan de Luna's settlement of Pensacola, the first in \"La Florida.\" The large mural was painted by local Sarasota artist Don Putman and originally, was accompanied by a 22-minute narration by Lowell Thomas. The Cyclorama has been closed since the 1970s and its fate is unknown although restoration efforts of the park facilities are underway following the devastation of Hurricane Ian.\nNotes\nReferences\n*\n*\n*\nExternal links\n* [http://www.nationalregisterofhistoricplaces.com/FL/Sarasota/state.html Sarasota County listings] at [http://www.nationalregisterofhistoricplaces.com National Register of Historic Places]\n*\n* [http://www.floridacaves.com/warmmineral.htm Warm Mineral Springs] at [http://www.floridacaves.com Florida Cave, Cavern, and Sinkhole Diving]\n* [http://www.fasweb.org/chapters/warmmineralsprings.htm Warm Mineral Springs Archaeological Society] at [http://www.fasweb.org Florida Anthropological Society]\n*"
    }
  ]
}