{
  "content": [
    {
      "type": "text",
      "text": "# Warminster Township, Pennsylvania\n\n| coor_pinpoint          =\n| coordinates_footnotes  =\n| subdivision_type       = Country\n| subdivision_name       =\n| subdivision_type1      = State\n| subdivision_name1      =\n| subdivision_type2      = County\n| subdivision_name2      = Bucks\n| established_title      = Founded\n| established_date       = 1711\n| established_title1     =\n| established_date1      =\n| founder                =\n| seat_type              =\n| seat                   =\n| government_type        = Council-manager\n| leader_party           =\n| leader_title           =\n| leader_name            =\n| unit_pref              = Imperial\n| area_footnotes         =\n| area_total_sq_mi       = 10.18\n| area_land_sq_mi        = 10.16\n| area_water_sq_mi       = 0.02\n| area_urban_sq_mi       =\n| area_rural_sq_mi       =\n| area_metro_sq_mi       =\n| area_water_percent     =\n| area_note              =\n| elevation_footnotes    =\n| elevation_ft           = 315\n| population_total       = 32682\n|population_as_of = 2010\n|population_footnotes =\n| population_density_sq_mi = auto\n| population_demonym     =\n| population_note        =\n| timezone1              = EST\n| utc_offset1            = -5\n| timezone1_DST          = EDT\n| utc_offset1_DST        = -4\n| postal_code_type       = ZIP Code\n| postal_code            = 18974\n| area_code_type         =\n| area_codes              = 215, 267 and 445\n|blank_name = FIPS code\n|blank_info = 42-017-80952\n| website                =\n|pop_est_as_of = 2016\n|pop_est_footnotes =\n|population_est = 32460\n}}\nWarminster Township, also referred to as Warminster, is located in Bucks County, Pennsylvania, United States. It was formally established in 1711. The township is 13.7 miles north of Philadelphia and had a population of 33,603 according to the 2020 U.S. census.\nHistory\nThe town was called Warminster Township as early as 1685, before its borders were formally established in 1711. It was originally part of Southampton Township, which was founded in 1682 by William Penn.  Warminster was named after a small town in the county of Wiltshire, at the western extremity of Salisbury Plain, England. Warminster, Pennsylvania was mostly settled by English and Scotch-Irish colonists after William Penn received a grant of land in the area from King Charles, II. It was the site of the Battle of Crooked Billet during the Revolutionary War, which resulted in a resounding defeat for George Washington's colonial troops.\nWarminster's Craven Hall is included in the National Register of Historic Places listings in Bucks County, Pennsylvania. Warminster's most significant historical figure was William Tennent, an outspoken religious leader and educator.\nWarminster began as a small farming community, and agriculture was central to most of its history. The first steamboat model was designed and made in Warminster township. John Fitch and Steven Pagano were the inventors and designers of the model steam boat that was tried out on the Delaware river and successfully floated.\nDuring World War II, the U.S. Navy acquired an industrial site here from the Brewster Aeronautical Corporation in 1943. The Center initially served as a weapons development and airplane testing facility. The Naval Air Warfare Center, previously called the Johnsville Naval Air Development Center and then the Naval Air Development Center, operated in Warminster from World War II until it closed in 1996. As recently as 1955, the township had no residential subdivisions and only one housing complex, Lacey Park off County Line Road.\nIn the 1960s the naval site became adapted as a training center for the Mercury, Gemini, and Apollo space programs. The facility also developed a prototype \"black box,\" best known as the indestructible recorder of cockpit conversations and information in the event of a crash.\nGeography\nWarminster Township is 3.7 miles northwest of Philadelphia at their closest points and has a total area of 10.2&nbsp;square miles (26.5&nbsp;km2), all  land. Warminster is drained by the Delaware River tributaries of the Neshaminy Creek and the Pennypack Creek. Its villages include Babytown, Breadysville (also in Warwick Township,) Casey Highlands, Davisville, Hartsville (also in Warwick Township), Johnsville, Rosewood Park, Warminster, and Warminster Heights.\n}}\nAs of the 2010 U.S. census, Warminster Township had a population of 32,682 people. The racial makeup of the township was 89.3% White, 3.1% African American, 0.2% Native American, 1.9% Asian, 0.1% Pacific Islander, 3.7% from other races, and 1.8% from two or more races. Hispanic or Latino of any race were 7.7% of the population.\nGovernment\nWarminster Township is governed by a five-member Board of Supervisors, currently:\n* Katherine L. Frescatore (D), Chairman\n* Kenneth M. Hayes (D), Vice-Chairman\n* Judith A. Hoover (D), Secretary\n* Chuck Heybach (D), Treasurer\n* Janice Charlton (R)\nMajor corporations\n*ABB\n*Burpee Seeds\n*CRC Industries, founded in 1958\n*Havis, Inc.\n*Hurst Performance, based in Warminster from the 1950s to 1970s\n*Naval Air Warfare Center Warminster\n*V. La Rosa and Sons Macaroni Company\nEmergency services\n* Warminster Fire Department (Stations 90, 91, and 92)\n* Warminster Police Department (74PD)\n* Central Bucks EMS, the Emergency Medical Services provider for Warminster (replaced Warminster Volunteer Ambulance Corps (Squad 122) in 2017)\n* Hartsville Fire Company (Station 93) [http://ww.hartsvillefc.org/] - which also covers part of Warwick Township\nEducation\nPublic schools\nPublic schools (part of the Centennial School District):\n*Davis Elementary School\n*McDonald Elementary School\n*Willow Dale Elementary School\n*Log College Middle School\n*William Tennent High School\nParochial schools\n*Archbishop Wood Catholic High School\n*Nativity of Our Lord School\nPrivate Schools\n*ATG Learning Academy\n*Middle Earth Academy\nUniversity\n*Pennsylvania State University Applied Research Laboratory Navigation Research & Development Building Center\n*Won Institute of Graduate Studies\nParks and recreation\nWarminster Township's Recreation Services Division provides many events and community services, including overseeing and maintaining  of recreation areas within 13 parks. Sports teams, including soccer, football, basketball, swimming, wrestling, baseball, and softball are provided by various adult and youth sports organizations throughout their respective seasons. The township has partnered with the Central Bucks YMCA starting in January 2015 to offer many of the recreational programs previously offered by the township. The Parks and Recreation Department also offers discount tickets to amusement parks, attractions, ski resorts, and movies.\nWarminster Community Park is the largest of the township's parks at , with over five miles of walking trails. Other facilities at Warminster Community Park include nature areas, basketball courts, a playground, pavilion, picnic area, pond, restrooms, and soccer fields. Warminster Community Park is also home to Bark Park, a fenced-in, off-leash dog park. Also located at Warminster Community Park is Safety Town, a miniature version of Warminster Township where children can ride tricycles and big wheels. The miniature town is sponsored by local businesses, who appear on the storefronts of buildings, and has signs and pavement markings to teach children the rules of the road.\nSmall neighborhood parks make up the bulk of the other parks in Warminster Township. Smaller parks in the township include Barness Park, a  park which has a walking trail and nature area; The Crossing, a  park which has a walking trail, a playground, open space, and nature area; Crooked Billet Green, an  park which has basketball courts, a playground, and a softball field; Devonshire Court, a  park which has open space and a nature trail; Ivy Woods, a  park which is undeveloped; Kemper Park, a  park which has walking trails, nature areas, picnic areas and pavilions, a playground, and a softball field; Log College Park, a  park which has a basketball court, tennis court, nature areas, a playground, and grass volleyball courts; Maple Street Park, a  park which has a basketball court and playground; Meadow Run Park, a  park which has a picnic area and playground; Munro Park, a  park which has a baseball field, lighted soccer fields, picnic areas, a playground, a seasonal refreshment stand, restrooms, softball fields, tennis courts, a basketball court, and a skate park; Szymanek Park, a  park which has basketball courts, a football field, restrooms, a softball field, and a playground; and Werner Park, a  park which has a lighted football field, picnic areas, a playground, a seasonal refreshment stand, restrooms, and a softball field.\nThe township is also home to a public golf course called Five Ponds Golf Club, which is the best-reviewed public golf course in Bucks County. The golf course is owned by Warminster Township and privately managed.\nInfrastructure\nTransportation\nAs of 2018 there were  of public roads in Warminster Township, of which  were maintained by the Pennsylvania Department of Transportation (PennDOT) and  were maintained by the township.\nNumbered routes in Warminster Township include Pennsylvania Route 132 (Street Road), which runs northwest–southeast through the township between Warrington and Southampton; Pennsylvania Route 263 (York Road), which runs north–south through the township between Hatboro and Jamison; and Pennsylvania Route 332 (Jacksonville Road), which runs southwest–northeast through the township between Hatboro and Ivyland. Other important roads include County Line Road, which runs northwest–southeast along the southwestern border with Montgomery County; Bristol Road, which runs northwest–southeast along the northeastern border of the township; Davisville Road, which runs southwest–northeast along the southeastern border of the township; and Mearns Road, which begins at Street Road in the center of the township and heads northeast.\nSEPTA provides train and bus service in Warminster Township. The Warminster station serves as the terminus of SEPTA Regional Rail's Warminster Line commuter rail service into Center City Philadelphia. SEPTA City Bus Route 22 begins in Warminster and heads south to Olney Transportation Center in North Philadelphia via Willow Grove. TMA Bucks operates the Richboro-Warminster Rushbus, which offers peak-hour shuttles between a connection with the Warminster Line train and the Route 22 bus at the Warminster station and certain businesses in Warminster and surrounding areas in Ivyland, Northampton Township, and Richboro. Two cab companies also operate within the township.\nFreight rail service to Warminster Township is provided by the Pennsylvania Northeastern Railroad (which operates along SEPTA trackage) and the New Hope Railroad. Both railroads have an interchange point in the township.\nUtilities\nElectricity and natural gas in Warminster Township is provided by PECO Energy Company, a subsidiary of Exelon. Trash and recycling collection in Warminster Township is provided under contract by J.P. Mascaro & Sons. Cable, telephone, and internet service to the area is provided by Xfinity and Verizon. Warminster Township is served by area codes 215, 267, and 445.\nWater and sewer service in the township is provided by the Warminster Municipal Authority, which serves 10,300 customers. The Warminster Municipal Authority receives water from groundwater wells in the township along with water purchased from the North Wales Water Authority. Multiple groundwater wells in the township are contaminated with perfluorooctanesulfonic acid (PFOS) and perfluorooctanoic acid (PFOA) from the former Naval Air Warfare Center Warminster site, leading to the authority having to close wells to install treatment systems to decontaminate the water. The United States Navy paid for the treatment systems for the wells. As a result, the Warminster Municipal Authority has increased the amount of water it purchases from the North Wales Water Authority to ensure safe drinking water.\nHealth care\nJefferson Health–Abington operates the Jefferson Health–Warminster (formerly Abington Health Center–Warminster) outpatient center in the township, which offers outpatient services, community health services and programs, and support groups. The health center is located in the former Warminster Hospital, whose emergency room and inpatient services were closed after Abington Memorial Hospital purchased the hospital in October 2007 from Solis Healthcare, who had acquired it from Tenet Healthcare two months prior.\nCrime\nWarminster has a total crime rate lower than 53% of all U.S. cities, and a violent crime rate 4.13 times lower than the national average.\nLaw enforcement\nThe Warminster police department consists of four built-in special units:\n*K-9\n*Bike Patrol\n*Highway Safety Unit (HSU)\n*SWAT\nFour Warminster police chiefs have been fired for or convicted of wrongdoing:\n*Chief Elmer Clawges was convicted on December 10, 1997, of assaulting his wife. Clawges had also been accused by 12 women of sexual wrongdoing while on duty, including having sex with girls as young as 13 and sexually harassing women.\n*Chief James M. Gorczynski pleaded guilty on April 5, 2005, to stealing over $130,000 belonging to the township.\n*Chief Rowan P. Kelly Jr. was fired for allegedly drinking on duty, assaulting citizens, and sexually harassing women.\n*Officer John Powell was convicted on April 6, 2005, of attempted sex crimes against a minor. Powell was sentenced to up to eight years in prison.\nClimate\nAccording to the Köppen climate classification system, Warminster Township, Pennsylvania has a hot-summer, wet all year, humid continental climate (Dfa). Dfa climates are characterized by at least one month having an average mean temperature ≤ 32.0&nbsp;°F (≤ 0.0&nbsp;°C), at least four months with an average mean temperature ≥ 50.0&nbsp;°F (≥ 10.0&nbsp;°C), at least one month with an average mean temperature ≥ 71.6&nbsp;°F (≥ 22.0&nbsp;°C), and no significant precipitation difference between seasons. During the summer months, episodes of extreme heat and humidity can occur with heat index values ≥ 100&nbsp;°F (≥ 38&nbsp;°C). On average, the wettest month of the year is July which corresponds with the annual peak in thunderstorm activity. During the winter months, episodes of extreme cold and wind can occur with wind chill values }}\nEcology\nAccording to the A. W. Kuchler U.S. potential natural vegetation types, Warminster Township, Pennsylvania would have an Appalachian Oak (104) vegetation type with an Eastern Hardwood Forest (25) vegetation form.\nNotable people\n*Charles M. Betts (1838-1905), Pennsylvania State Representative and Medal of Honor recipient\n*Kermit Cintrón, boxer\n*John Fitch, inventor\n*Paul Hipp, actor and musician who grew up in Warminster.\n*Robert Ramsey, U.S. Congressman\n*Milton Santiago, boxer\n*Gerald Shur (1933-2020), founder of the United States Federal Witness Protection Program\n*William Tennent, clergyman and educator\n*Mike Vogel, actor\n*David Wharton, 1988 Olympic swimmer\nReferences\nExternal links\n* [http://www.warminstertownship.org/ Warminster Township]"
    }
  ]
}