{
  "content": [
    {
      "type": "text",
      "text": "# Warmians (ethnic group)\n\n| languages        = Polish (Warmian subdialect)German (High Prussian, Low Prussian)\n| religions        = Roman Catholicism\n| related_groups   = Poles\n| footnotes        =\n}}\nWarmians are a Polish ethnic group from Warmia. Most are Roman Catholic and today speak the Warmian subdialect of Polish; historically, some Warmians also spoke the High Prussian or Low Prussian dialects of German. As of recent estimates, the Warmian community numbers between 4,000 and 20,000 individuals, with many residing in the Warmian-Masurian Voivodeship, particularly in areas such as Olsztyn (formerly Allenstein).\nHistory\nBetween the 14th and 17th centuries, settlers from northern, Mazovia moved to former territories of Old Prussians, following conquests by the Teutonic Order, and the erection of the Monastic state of the Teutonic Knights. Earlier, the southern parts of Warmia had become German-speaking, but eventually, more Polish settlers than Germans arrived to settle the land, particularly after 1410, so that the region gradually Polonized.\nThe bishopric of Warmia became in 1466 an autonomous part of Royal Prussia, and remained part of the Polish–Lithuanian Commonwealth until 1772 when it was annexed by the Kingdom of Prussia (see: Partitions of Poland). While the Mazurs in the neighboring Ducal Prussia became Protestants when Duchy adopted Lutheranism in the 16th century, most Warmiaks, populating the areas around Olsztyn, remained Catholics.\nDuring World War II, the Warmiaks were persecuted by the Nazi German government, which wanted to erase all aspects of Polish culture and Polish language in Warmia.\nAfter the war, due to their Polish roots and their Catholic faith (unlike the Masurians who were predominantly Protestant, who had a friendly attitude towards the Germans), they were not victims of the large-scale expulsion of Germans. However, over the course of time, large numbers of Warmiaks decided to leave their native land and settle in more prosperous West Germany, exercising their right to German citizenship granted by the Basic Law as citizens or their descendants of inhabitants of Germany in the borders of 1937.\nGallery\nFile:Hedwig Neuhof Ermländerinnen auf dem Kirchgang.jpg|Warmian women in church attire. Painting by Hedwig Neuhof ca. 1900\nFile:Ermländische Sonntagstracht.jpg|Warmian women in Sunday attire, ca. 1920\nFile:Kajny chalupa drewniana.JPG|Warmian wooden house and chapel in Kajny.\nNotes\nReferences"
    }
  ]
}