{
  "content": [
    {
      "type": "text",
      "text": "# Warm and Tender__disambig_1\n\n| recorded   = 1988\n| studio     =\n* Melbourne Concert Hall and Metropolis Audio (Melbourne, Australia)\n* Ocean Way Recording (Hollywood, California, USA)\n| genre      = Children's\n| length     = 41:27\n| label      = Geffen\n| producer   = John Farrar\n| prev_title = The Rumour\n| prev_year  = 1988\n| next_title = Back to Basics: The Essential Collection 1971–1992\n| next_year  = 1992\n| misc       =\n}}\n}}\nWarm and Tender is the fourteenth studio album and first of children's lullabies released by Olivia Newton-John in October 1989. After being absent on Newton-John's last album The Rumour, producer John Farrar returned for this album. After recording extensively in the UK and US throughout her career, this was Newton-John's first album recorded in her hometown of Melbourne.\n\"Reach Out for Me\" peaked at number 32 on the Billboard Adult Contemporary charts   and number 153 on the ARIA Charts.\nReception\nAllMusic praised the album as \"a major achievement for Olivia Newton-John, a majestic combination of lullabies and standards,\" further commenting \"if Olivia Newton-John made Warm and Tender to prove to the world that she is an artist with depth and courage, she achieved her goal. It's a marvelous recording.\"\nIn their review of the album, Billboard commented that \"(Geffen) label debut finds the Aussie lass gratefully shedding her contrived sexpot image and donning the serene veneer of motherhood. Beautifully orchestrated set of lullabies could warm the heart of the toughest AC programmer...This is the perfect environment for Newton-John's smooth and silky voice, and may very well be the springboard for her return into the pop spotlight.\"\nCashbox noted that \"motherhood has really had quite an effect on everyone’s favorite Xanadu roller babe. No longer does she yodel about hopeless devotion or high school graduations. This is Olivia: the Mother, crooning every childhood ditty that you can recall and even a few that you can’t. ...The entire album is dreamy, ethereal sleepy-time music, so effective...I don’t see a lot of commercial possibilities here, but\nit seems as if Olivia is after a more loving-expression kind of thing rather than her former hungry-for-pop success.\"\nTrack listing\nPersonnel\nMusicians\n* Olivia Newton-John – vocals, arrangements (2, 4, 6, 8, 10, 13, 15)\n* Graeme Lyall – all orchestral arrangements and conductor\n* The Victorian Philharmonic Orchestra:\n* Rudolf Osadnik – leader\n* Ron Layton – contractor\n* Joe Chindamo – acoustic piano, keyboards\n* Adrian Scott – programming\n* Don Stevenson – guitars\n* Ben Robertson – bass\n* Robert Clarke – percussion\n* Alex Pertout – percussion\n* Vernon Hill – flute\n* Vicki Philipson – oboe\n* Stephen Robinson – Cor anglais\n* Julie Rains – harp\nOther musicians\n* \"Warm and Tender\" – all instruments by Brian Mann and John Farrar\n* \"Reach Out for Me\" – all instruments by Brian Mann and John Farrar; Synclavier by Sean Callery\n* \"The Flower That Shattered the Stone\" – synthesizers by Brian Mann; Synclavier by Sean Callery\nProduction\n* John Farrar – producer\n* Allan Sides – engineer, mixing\n* Ian McKenzie – additional engineer\n* Eric Rudd – assistant engineer\n* Bernie Grundman – mastering at Bernie Grundman Mastering (Hollywood, California)\n* Gabrielle Raumberger – art direction\n* Larry Vigon Studio – design, album logo\n* Alberto Tolot – front cover photography\n* Nancy Manning – dust sleeve photography\n* Billy Sammeth – management\nCharts\n{| class=\"wikitable sortable plainrowheaders\"\n|+Chart performance for Warm and Tender\n!Chart (1989–1990)\n!Peakposition\n|-\n!scope=\"row\"|Australian Albums (ARIA)\n|align=\"center\"|109\n|-\n!scope=\"row\"|Japanese Albums (Oricon)\n|align=\"center\"|43\n|-\n|-\n!scope=\"row\"|US Cashbox Top 200 Albums\n|align=\"center\"|151\n|}\nReferences"
    }
  ]
}