{
  "content": [
    {
      "type": "text",
      "text": "# Warnstorfia exannulata\n\n| synonyms = *Amblystegium capillaceum Mitt.\n*Amblystegium purpurascens (Schimp.) C.E.O.Jensen\n*Drepanocladus brasiliensis Broth.\n*Drepanocladus exannulatus f. rotae (De Not.) Mönk.\n*Drepanocladus fluitans subsp. purpurascens (Schimp.)\n*Harpidium exannulatum var. purpurascens (Schimp.) C.E.O. Jensen\n*Hypnum fluitans var. purpurascens Schimp.\n*Hypnum stramineoides Sauerb.\n*Warnstorfia exannulata var. exannulata\n| synonyms_ref =\n| subdivision_ranks = Varieties\n| subdivision_ref =\n| subdivision = *Warnstorfia exannulata var. nigricans (Brid.) Ochyra\n}}Warnstorfia exannulata is a leafy branching wetland moss in the genus Warnstorfia within the family Amblystegiaceae and class Bryopsida. This bryopsida moss is also known as ringless-hook moss or Warnstorfia moss.  It is the most common species of the genus in wetland environments and can be difficult to distinguish from others within the genus. It grows in acidic soils like fens and bogs, or in freshwater pools and lakes.\nMorphology\nDescription\nWarnstorfia exannulata grows as an interwoven mat of glossy moss. It is yellow-green when young and matures to be dark-green, purple-brown, or reddish-brown. W. exannulata can have either regular or irregular pinnate branching and has secondary pinnate branching. Stems are often curved. The main stems can grow up to 30&nbsp;cm in length depending on growing conditions, with one study finding their longest sample at 28&nbsp;cm aged approximately 8 years old. The stem and branch leaves are similar in shape with the branch leaves being slightly thinner on average. Leaves are linear-lanceolate in shape and 3-4mm in length gently tapering to a point. The shape of the leaf is varying between straight to falcate. The base of stem leaves is very slightly decurrent along the stem, which can be an identifying trait of this species in comparison to other Warnstorfia species. It has a strong single costa that extends up two thirds of the leaf in both stem and branch leaves. The alar region is very clearly differentiated and makes two triangular regions of 1-3 rows of cells at the base of the stem leaf. The alar region is made up thin walled rectangular shaped cells that are distinctive from the lamina cells which are more elongate in shape A cross section of stem shows a characteristic double layer of cortical cells that have thick walls and central medullary cells are more thinly walled.\nReproduction\nSporophytes have red-brown seta and brown sporangia lacking an annulus at mouth of sporangium. Sporangium are curved downwards and seta has double twist at base of sporangium. Sporophyte structures are rarely found, this moss more readily reproduces asexually through fragmentation. Species is dioicous.\nVariation\nW. exannulata has a high amount of phenotypic plasticity depending on what kind of habitat it is growing in. Plants that grow submerged in water tend to grow longer in main stem length and have longer leaves than their terrestrial counterparts. This is likely due to increased competition too, of light and  resources with phytoplankton in the water column, whereas terrestrial plants are shorter to avoid herbivory and have greater access to light.\nW. exannulata may be temperature dependent in growth during the summer months in polar regions. Guo et al. found a correlation between summer growth leaf and branch density on specimens in Finland with the ambient temperature during the summer months. There was a higher density of branching and leaves during warmer ambient temperatures of this season.\nRange\nW. exannulata bipolar and mainly found in the Northern Hemisphere. It is readily found from high arctic latitudes and down into temperate regions across Canada, the Northern United States of America, Northern Europe through to the Iberian Peninsula, and Northern Asia. It has also been found in intermediate populations in more southern latitudes but only in alpine environments. These populations are in South America, Asia, Southern Australia, and Southern New Zealand.\nThe high latitude range of this moss has made it the subject of research looking at increasing UV-B effects due to climate change. There was no significant change to W. exannulata after a 3-year exposure experiment to UV-B while it was in a fen environment.\nHabitat\nBogs, fens, swamps, peatlands\nW. exannulata grows in mineral rich fens, swamps, bogs, and peatland environments where soils are slightly acidic. It has also been found to live in fens, lakes, and seepage pools where there is an anthropogenic effect. It frequently grows in a matted pattern which can result in carpeted areas throughout wetlands of a single species, but is also common in multi-species carpets around edges of lakes.\nPools and lakes\nW. exannulata frequently found in freshwater pools that are driven by rain, snowmelt or glacier-melt in arctic and alpine regions. It can grow submerged in pools and attach to muddy pool bottoms which frequently results in longer stemmed individuals. It also grows abundantly along edges of pools and lakes among other bryophyte species like Sphagnum moss.  Pools have low water turnover and few water inputs other than melting water and precipitation, leading to higher eutrophication and establishing a slightly acidic environment.\nReferences"
    }
  ]
}