{
  "content": [
    {
      "type": "text",
      "text": "# Warner Robins High School\n\n| type                    =\n| district                = Houston County Schools\n| grades                  = 9–12\n| principal               = Brett Wallace\n| faculty                 =\n| teaching_staff          = 102.50 (FTE)\n| ratio                   = 17.71\n| enrollment              = 1,815 (2023–2024)\n| athletics               =\n| conference              =\n| colors                  = Cardinal and white\n| mascot                  = Demon\n| streetaddress           = 401 South Davis Drive\n| city                    = Warner Robins\n| state                   = Georgia\n| zipcode                 = 31088\n| country                 = U.S.\n| website                 =\n| coordinates             =\n}}\nWarner Robins High School is a high school in Warner Robins, Georgia, United States. It was established in 1944 and enrolls approximately 1,690 students.\nThe mascot, the Demon, was originally adopted during World War II in honor of the 7th Fighter Squadron at Robins Air Force Base which earned the title \"the Screamin' Demons\" in the South Pacific.\nCampus\nThe campus of Warner Robins High School (WRHS) is divided into four main buildings: the Main, Two-Story, Multi-Purpose, and Vocational buildings. Beside the school is \"Demon Valley,\" an athletic field complex along Demon Valley Road where the WRHS Demons football team practices, as well as another field across Demon Valley Road where additional extracurricular clubs such as the Demon Marching Band and the cross country team practice. The main campus is connected by a bridge that crosses South Davis Drive to the school's parking lot, a school gym, and the approximately 8,000-seat McConnell-Talbert Stadium, colloquially referred to as \"The Mac.\"\nExtracurricular activities\nAthletics\nThe following sports are offered at Warner Robins: baseball, basketball, cheerleading, cross country, flag football, football, golf, boys' and girls' soccer, softball, swimming, tennis, track, volleyball, and wrestling.\nOne-Act Play\nOver the years, WRHS productions have participated in the GHSA One-Act Competition, the Georgia Theatre Conference, Georgia Thespian Conference, and the Southeastern Theatre Conference.\nState Titles\n*Boys' Basketball - 2018(5A)\n*Girls' Basketball - 1965(3A)\n*Football - 1976(3A), 1981(4A), 1988(4A), 2004(4A), 2020(5A), 2021 (5A)\n*Boys' Golf - 1991(4A)\n*Slow Pitch Softball - 1986(4A), 1997(4A)\n*Boys' Track - 1986(4A)\nOther GHSA State Titles\n*Literary - 1980(4A tie), 1993(4A)\n*One Act Play - 2020(5A), 2021(5A)\nNotable alumni\n* Eddie Anderson, football safety who played for the Seattle Seahawks and the Oakland Raiders\n* Willie Blade, former NFL defensive tackle for the Dallas Cowboys\n* James Brooks, former NFL running back for the San Diego Chargers, Cincinnati Bengals, Cleveland Browns, and Tampa Bay Buccaneers; played in four Pro Bowls\n* Marquez Callaway, wide receiver for the New Orleans Saints\n* Isiah Canion, college football wide receiver for the Georgia Tech Yellow Jackets\n* George Collins, former professional football player for the St. Louis Cardinals\n* Travis Denning,  American country music singer and songwriter signed to UMG Nashville's Mercury Nashville label.\n* Mark Johnson, former professional baseball player (Chicago White Sox, Oakland Athletics, Milwaukee Brewers, St. Louis Cardinals) and current manager of the Tennessee Smokies\n* Amanda Kozak, Miss Georgia 2006, second runner-up in the Miss America pageant, Miss Georgia USA 2008, Georgia Teacher of the Year 2015\n* Sonny Perdue, former Governor of Georgia and United States Secretary of Agriculture\n* Kevin Porter, former professional football player for the Kansas City Chiefs and New York Jets and coach for the Arena Football League, Avila, Point and Fort Valley State\n* Victoria Principal, actress\n* Willie Reid, former wide receiver and KR/PR for the Pittsburgh Steelers; ACC championship MVP in 2005; MVP of the Orange Bowl in 2006 vs Penn State\n* Mike Richardson, former professional football player for the New England Patriots, Kansas City Chiefs, and Indianapolis Colts\n* Ron Simmons, former nose tackle at Florida State University, member College Football Hall of Fame, played two years for the Cleveland Browns, professional wrestler\n* Ben Smith, #22 overall in the 1990 NFL draft by the Philadelphia Eagles. Played DB for the Philadelphia Eagles, Denver Broncos, and the Arizona Cardinals\n* Greg Tremble, former professional football player for the Dallas Cowboys and Philadelphia Eagles\n* Byron Walker, former professional football player for the Seattle Seahawks\nReferences\nExternal links\n*"
    }
  ]
}