{
  "content": [
    {
      "type": "text",
      "text": "# Warner Classics\n\n| image       = Warner Classics logo.svg\n| image_size  =\n| parent      = Warner Music Group\n| founded     =\n| founder     =  -->\n| distributor = Warner Music GroupAMPED Distribution (select releases)[https://www.ampeddistribution.com/labels AMPED Distribution // Labels]\n| genre       = Classical\n| country     = France\n| location    =\n| url         =\n}}\nWarner Classics is the classical music arm of Warner Music Group. The label began issuing new recordings under the Warner Classics banner in 1991.[http://www.emiclassics.com/various_artists/news/716 Various Artists // News] The company also includes the Erato Records and Teldec Records labels. Based in France,[http://www.billboard.com/biz/articles/news/legal-and-management/6041360/alain-lanceron-named-president-warner-classics-and Alain Lanceron Named President, Warner Classics and Erato; Senior Team Confirmed | Billboard] Warner Classics also distributes the Elektra Nonesuch, Finlandia, Lontano, NVC Arts, Warner Apex, Warner Elatus and Warner Fonit labels.\nHistory\nWhat was then known as Warner Bros.-Seven Arts, which owned Warner Bros. Records and Atlantic Records, acquired Elektra Records in 1969 which included Elektra's Nonesuch Records classical music label. This led to the formation of WEA, the forerunner of Warner Music Group. Nonesuch is now part of Warner Records. WEA acquired Teldec Records in 1988. Warner Classics was formed in 1991. The renamed Warner Music Group acquired Erato Records in 1992. Warner Music Group acquired the classical video company NVC Arts in 1994.\nThe label developed a larger profile in 2013 when it absorbed EMI Classics (including Pye Records' classical music catalogue) with that label's output absorbed into the Warner Classics label and the co-owned Virgin Classics absorbed into Erato Records.[http://www.classicfm.com/music-news/latest-news/emi-classics-and-virgin-classics-join-warners/ EMI Classics and Virgin Classics to join Warners – Classic FM Music News and Features]\nReferences\nExternal links\n*"
    }
  ]
}