{
  "content": [
    {
      "type": "text",
      "text": "# Warner Bros. Pictures\n\n| type = Division\n| industry = Film\n| predecessor = Warner Features Company\n| founded =\n| founders =\n| hq_location = 4000 Warner Boulevard\n| hq_location_city = Burbank, California\n| hq_location_country = United States\n| area_served = Worldwide\n| key_people =\n| products = Motion pictures\n| services =\n| parent = Warner Bros. Entertainment\n| website =\n| footnotes =\n}}\nWarner Bros. Pictures is an American film studio and distribution arm of the Warner Bros. Motion Picture Group division of Warner Bros., both of which are owned by Warner Bros. Discovery. It is headquartered at the Warner Bros. Studios complex in Burbank, California. Animated films produced by Warner Bros. Pictures Animation are also released under the studio banner. The studio was founded on April 4, 1923, by the brothers Harry Warner, Albert Warner, Sam Warner, and Jack L. Warner. In addition to producing its own films, the studio handles filmmaking operations, theatrical distribution, marketing and promotion for films produced and released by other Warner Bros. labels. These labels include Warner Bros. Pictures Animation, New Line Cinema and Castle Rock Entertainment, as well as various third-party producers.\nWarner Bros. Pictures is currently one of four live-action film studios within the Warner Bros. Motion Picture Group, the others being New Line Cinema, Castle Rock Entertainment, and Spyglass Media Group (with a minority stake). The most commercially successful film franchises from Warner Bros. include Harry Potter, DC Universe (formerly DC Extended Universe), The Lord of the Rings, and Monsterverse; Barbie is the studio's highest-grossing film worldwide with $1.4 billion in revenue.\nHistory\nThe studio's predecessor (and modern Warner Bros. Entertainment as a whole) was founded in 1910 as the Warner Features Company in New Castle, Pennsylvania, by filmmaker Sam Warner and his business partners and brothers, Harry, Albert, and Jack. They produced their first film, the Peril of the Plains in 1912, which Sam directed for the St. Louis Motion Picture Company. In 1915, Sam and Jack moved to California to establish a production studio; on July 8 of that year, Albert and Harry set up the New York–based Warner Brothers Distributing Corporation to release the films. In 1918, during World War I, the four Warner brothers produced an adaptation of the book My Four Years in Germany by James W. Gerard as their first full-scale picture; the choice of subject was bold given the sensitivity of the content and the war. The war film was a box office hit, and it helped the brothers to establish themselves as a prestige studio.\nOn April 4, 1923, Warner Bros. Pictures, Inc. was officially established, as the brothers focussed entirely on the motion picture industry. In 1927, Warner Bros. Pictures revolutionized the film industry by releasing its first sound film (or \"talkie\"), The Jazz Singer, starring Al Jolson. Studio co-founder Sam Warner died before the film's premiere, however. When the company diversified during later years, it was eventually rebranded with the current umbrella name; nevertheless Warner Bros. Pictures continued to be used as the name of the company's film-production arm.\nThe studio has released twenty-five films that have been nominated for an Academy Award for Best Picture: Disraeli (1929), I Am a Fugitive from a Chain Gang (1932), 42nd Street (1933), Here Comes the Navy (1934), ''A Midsummer Night's Dream (1935), Anthony Adverse (1936), The Life of Emile Zola (1937), The Adventures of Robin Hood (1938), Four Daughters (1938), Jezebel (1938), and Dark Victory (1939), as well as later nominees.\nIn the aftermath of the 1948 antitrust suit, uncertain times led Warner Bros. to sell most of its pre-1950 films and cartoons to Associated Artists Productions (a.a.p.) in 1956. In addition, a.a.p. also obtained the Fleischer Studios and Famous Studios Popeye'' cartoons, originally from Paramount Pictures. Two years later, a.a.p. was sold to United Artists (UA), which owned the company until 1981, when Metro-Goldwyn-Mayer (MGM) acquired UA.\nIn November 1966, Jack L. Warner acknowledged advancing age and changing times, selling 32% of control of the studio and music business to Seven Arts Productions for $32&nbsp;million. (Seven Arts Productions was run by Canadian investors Elliot and Kenneth Hyman.) Eventually the company, including the studio, was renamed Warner Bros.-Seven Arts on July 14, 1967.\nIn 1982, during their independent years, Turner Broadcasting System acquired Brut Productions; this was the film production arm of the France-based, personal-care company Faberge Inc., which was struggling at the time.\nIn 1986, Turner Broadcasting System acquired MGM. Finding itself in debt, Turner kept the pre-May 1986 MGM film and television libraries and a small portion of the UA library, while spinning off the rest of MGM. (The properties retained by Turner included the a.a.p. library and North American rights to the RKO Radio Pictures library.)\nIn 1989, Warner Communications acquired Lorimar-Telepictures Corporation and merged with Time Inc. to form Time Warner (now known as Warner Bros. Discovery). Lorimar's catalogue included the post-1974 library of Rankin/Bass Productions, as well as the post-1947 library of Monogram Pictures/Allied Artists Pictures Corporation.\nIn 1991, Turner Broadcasting System acquired animation studio Hanna-Barbera and the Ruby-Spears library from Great American Broadcasting. Years later, Turner Broadcasting System also acquired Castle Rock Entertainment on December 22, 1993, and New Line Cinema on January 28, 1994. On October 10, 1996, Time Warner Entertainment acquired Turner Broadcasting System, thus bringing Warner Bros.'s pre-1950 library home. In addition, Warner Bros. owns only Castle Rock Entertainment's post-1994 library.\nWarner Bros. Pictures\nThe studio division was incorporated as Warner Bros. Pictures on March 3, 2003, to diversify film subjects and expand audiences for their film releases. The company became part of the Warner Bros. Pictures Group, which was established in 2008, and Jeff Robinov was appointed the first president of the company. In 2017, longtime New Line executive Toby Emmerich joined as president. In January 2018, he was promoted to chairman. On October 23, 2018, it was announced that Lynne Frank, President of Warner Bros. Pictures Group, would be leaving the company to pursue new opportunities. In June 2019, Warner Bros. Pictures signed an agreement with SF Studios to have their films distributed in Sweden, Denmark, Norway, and Finland.\nLike most other film distributors, Warner Bros. Pictures struggled with releasing films during the 2020 COVID-19 pandemic because of restrictions on opening theaters. After postponing several films planned for 2020 into 2021, Warner Bros. announced in December 2020 that they would take an unusual approach: planning their full slate of 2021 films for both theatrical release and simultaneous one-month availability on the HBO Max streaming service. This approach was similar to the studio's release of Wonder Woman 1984 that month.\nAfter one month, these films would still be shown in theaters and would later become available via home media on typical release schedules. The inclusion of streaming, dubbed \"Project Popcorn\", was criticized by production companies, directors, and actors. The criticism arose because Warner Bros. Pictures announced the streaming plan without informing these groups in advance, and because of concerns about lower payouts due to streaming options. These criticisms led Warner Bros. Pictures to alter compensation rates for the affected films by January 2021, in order to provide larger payouts to their casts and crews.\nIn March 2021, Warner Bros. announced that they would discontinue the model of same-day HBO Max and theatrical release in 2022; instead, they would use a 45-day theatrical exclusivity window. This change is part of an agreement the studio reached with Cineworld (who operates Regal Cinemas).\nand its parent company, Warner Bros. Discovery.]]\nWarner Bros. Discovery (WBD) is the company formerly known as Discovery, Inc. before its acquisition of WarnerMedia in April 2022. On June 1, 2022, WBD announced several changes:\n* Toby Emmerich would step down as head of the Warner Bros. Pictures Group after a transition period.\n* The company would be divided into three units: Warner Bros. Pictures/New Line Cinema, DC Films, and Warner Animation Group.\n* Former MGM executives Michael De Luca and Pamela Abdy would serve as co-chairs of Warner Bros. Pictures. They would also temporarily oversee the other two divisions until new executives were hired.\n* Emmerich would start his own production company; he would also enter into a five-year distribution and funding agreement with Warner Bros. Pictures.\nOn June 8, COO Carolyn Blackwood announced that she was stepping down as well.\nSteve Spira returned as president of business affairs for Warner Bros. in June 2022; De Luca and Abdy took over from Emmerich in July 2022. Former president Alan Horn was appointed as a consultant for WBD President David Zaslav, working with De Luca and Abdy.\nIn August 2022, Warner Bros. Pictures entered into a multi-year contract to distribute MGM films outside the United States, including on home entertainment. This contract included joint participation by both companies in marketing, advertising, publicity, film distribution, and relationship with exhibitors for future MGM titles. That same month, the studio's plans for film distribution were revised, with increased reliance on theatrical releases rather than releases on HBO Max only.\nWalter Hamada, the president of DC Films, stepped down on October 19, 2022. President of Production & Development Courtenay Valenti departed on October 28 and was replaced by Jesse Ehrman. On June 9, 2023, the Warner Bros. Pictures Group was renamed as the Warner Bros. Motion Picture Group.\nFilm library\nMergers and acquisitions have helped Warner Bros. to accumulate a diverse collection of films, cartoons and television programs. As of 2022, Warner Bros. owned more than 145,000 hours of programming, including 12,500 feature films and 2,400 television programs comprising more than 150,000 individual episodes.\nShared universes\nWarner Bros. owns several shared universes. Some of these are based on books and comics, including some of the highest grossing intellectual properties in the movie industry.\n{| class=\"wikitable\"\n|+\n!IP\n!No. Films\n!Notes\n|-\n|DC Extended Universe\n|15\n|Movies based on DC Comics. DCEU was Warner Bros.'s first iteration of a shared universe.\n|-\n|DC Universe\n|1\n|Soft-reboot of the DC Extended Universe, led by  James Gunn and Peter Safran. First movie was released in 2025.\n|-\n|Harry Potter\n|11\n|Film rights sold by J. K. Rowling for 2 million $ and a net % of the profits. This shared universe became the 4th highest grossing IP in movie history. This universe includes 8 movies based on the Harry Potter books and 3 movies based on Fantastic Beasts and Where to Find Them.\n|-\n|The Conjuring Universe\n|9\n|Dramatized horror movies based on real-life cases of paranormal investigators Ed and Lorraine Warren. This shared universe includes movies like Annabelle, The Nun and The Curse of La Llorona.\n|-\n|Monsterverse\n|5\n|Shared Universe based on monster movie characters like Godzilla and King Kong, in addition to other kaiju characters created by Toho, including Mothra, Rodan and King Ghidorah. Made in co-production with Legendary Entertainment.\n|-\n|Middle-earth\n|6\n|Movie series based on the books written by J. R. R. Tolkien, directed by Peter Jackson.\n|-\n|The Lego Movie\n|4\n|Warner Bros owned the rights to Lego films up until the end of 2019. More Lego movies were planned, but were cancelled after Universal Pictures bought the Lego film rights. Cancelled sequels include a sequel to The Lego Batman Movie, called Lego Superfriends.\n|}\n| image2    = Christopher_Nolan,_London,_2013_(crop).jpg\n| width2    = 150\n| caption2  = Christopher Nolan wrote and directed several of Warner Bros.'s most profitable films in the early 21st century. Like Eastwood, Nolan has had a long creative partnership with the studio.\n}}\nFilm series\n{| class=\"wikitable sortable\"\n!Title\n!Release date\n!No. Films\n!Notes\n|-\n| Gold Diggers\n| 1923–51\n| 7\n|\n|-\n| Looney Tunes\n| 1930–present\n| 8\n| 1030+ theatrical shorts\n|-\n| Penrod and Sam\n| 1931–38\n| 2\n|\n|-\n| Perry Mason\n| 1934–37\n| 6\n|\n|-\n| Philo Vance\n| 1933–40\n| 5\n|\n|-\n| Torchy Blane\n| 1937–39\n| 9\n|\n|-\n| Four Daughters\n| 1938–41\n| 4\n|\n|-\n| Nancy Drew\n| 1938–2019\n| 6\n|\n|-\n| Secret Service\n| 1939–40\n| 4\n|\n|-\n| A Star Is Born\n| 1954–2018\n| 3\n| Acquired from Selznick International Pictures; co-production with Transcona Enterprises (1954), First Artists, Barwood Films (both 1976), Metro-Goldwyn-Mayer, Live Nation Productions, Gerber Pictures, Joint Effort and Gerber Pictures (all 2018)\n|-\n| ''Ocean's\n| 1960–present\n| rowspan=2 | 5\n| co-production with Village Roadshow Pictures (2001–present)\n|-\n| Dirty Harry\n| 1971–88\n|\n|-\n| The Exorcist\n| 1973–2005\n| 4\n| co-production with Morgan Creek (3–4)\n|-\n| Oh, God!\n| 1977–84\n| 3\n|\n|-\n| Every Which Way but Loose\n| 1978–80\n| 2\n|\n|-\n| Superman\n| 1978–2006\n| 5\n| co-production with Legendary Pictures (2006); Except for Supergirl, which was distributed by Tri-Star Pictures\n|-\n| Mad Max\n| 1979–present\n| 5\n| co-production with Village Roadshow Pictures\n|-\n| Poseidon\n| 1979–2006\n| rowspan=\"3\" | 2\n|\n|-\n| Friday the 13th\n| 1980–2009\n| co-production with Paramount Pictures and New Line Cinema\n|-\n| The Shining\n| 1980–2019\n|\n|-\n| Arthur\n| 1981–2011\n| 3\n|\n|-\n| Blade Runner\n| 1982–2017\n| 2\n| co-production with Alcon Entertainment and Columbia Pictures (2017)\n|-\n| National Lampoon's Vacation\n| 1983–2015\n| 5\n|\n|-\n| Gremlins\n| 1984–present\n| 2\n| co-production with Amblin Entertainment\n|-\n| Police Academy\n| 1984–94\n| 7\n|\n|-\n| Sesame Street\n| 1985–present\n| rowspan=2 | 2\n| co-production with Sesame Workshop\n|-\n| The Color Purple\n| 1985–2023\n| co-production with Amblin Entertainment (1984–2023), The Guber-Peters Company (1984), OW Films, SGS Pictures and Quincy Jones Productions (all 2023)\n|-\n| Lethal Weapon\n| 1987–98\n| 4\n|\n|-\n| The Lost Boys\n| 1987–2010\n| 3\n|\n|-\n| Beetlejuice\n| 1988–present\n| 2\n|\n|-\n| Batman\n| 1989–97\n| 4\n| co-production with Polygram Pictures (1989–95)\n|-\n| Pure Country\n| 1992–2017\n| 3\n|\n|-\n| Under Siege\n| 1992–95\n| rowspan=\"4\" | 2\n| co-production with Regency Enterprises\n|-\n| Unforgiven\n| 1992–2013\n|\n|-\n| Grumpy Old Men\n| 1993–95\n|\n|-\n| The Fugitive\n| 1993–98\n|\n|-\n| Free Willy\n| 1993–2010\n| 4\n| co-production with Regency Enterprises\n|-\n| Major League\n| 1994–98\n| 2\n| rowspan=\"2\" | distribution only; produced by Morgan Creek\n|-\n| Ace Ventura\n| 1994–2009\n| 3\n|-\n| Eraser\n| 1996–2022\n| rowspan=2 | 2\n|\n|-\n| Twister\n| 1996–2024\n| co-production with Universal Pictures, Amblin Entertainment (both 1996–2024) and The Kennedy/Marshall Company (both 2024)\n|-\n| The Dukes of Hazzard\n| 1997–2007\n| rowspan=2 | 4\n| co-production with Kudzu Productions (both 1997–2000) and Gerber Pictures (both 2005–2007)\n|-\n| The Matrix\n| 1999–present\n| co-production with Village Roadshow Pictures\n|-\n| Analyze\n| 1999–2002\n| 2\n| co-production with Village Roadshow Pictures and TriBeCa Productions\n|-\n| Pokémon\n| 1999–2019\n| 4\n| US distribution only; co-production with The Pokémon Company\n|-\n| Deep Blue Sea\n| 1999–2020\n| 3\n| co-production with Village Roadshow Pictures\n|-\n| The Whole Yards\n| 2000–04\n| rowspan=\"2\" | 2\n| distribution only; co-production with Morgan Creek (2000) and Franchise Pictures\n|-\n| Miss Congeniality\n| 2000–05\n| co-production with Castle Rock Entertainment and Village Roadshow Pictures\n|-\n| Tom and Jerry\n| 2001–present\n| 16\n| co-production with Turner Entertainment\n|-\n| Cats & Dogs\n| 2001–20\n| 3\n| co-production with Village Roadshow Pictures (1–2)\n|-\n| Harry Potter\n| 2001–present\n| 11\n|\n|-\n| Scooby-Doo\n| 2002–present\n| 6\n|\n|-\n| Kangaroo Jack\n| 2003–04\n| rowspan=\"2\" | 2\n| co-production with Jerry Bruckheimer Films\n|-\n| Terminator\n| 2003–09\n| US distribution only; co-production with Columbia Pictures\n|-\n| A Cinderella Story\n| 2004–present\n| rowspan=\"2\" | 6\n|\n|-\n| Laura's Star\n| 2004–21\n| co-production with Rothkirch Cartoon-Film, produced in Germany\n|-\n| The Sisterhood of the Traveling Pants\n| 2005–08\n| 2\n| co-production with Alloy Entertainment\n|-\n| The Dark Knight trilogy\n| 2005–12\n| 3\n| co-production with Legendary Pictures\n|-\n| Willy Wonka\n| 2005–present\n| rowspan=\"3\" | 2\n| rowspan=\"2\" | co-production with Village Roadshow Pictures\n|-\n| Happy Feet\n| 2006–11\n|-\n| 300\n| 2006–present\n| rowspan=\"2\" | co-production with Legendary Pictures\n|-\n| The Hangover\n| 2009–13\n| 3\n|-\n| Final Destination\n| rowspan=\"2\" | 2009–present\n| rowspan=\"2\" | 2\n| co-production with New Line Cinema and Practical Pictures\n|-\n| Sherlock Holmes\n| co-production with Village Roadshow Pictures\n|-\n| Watchmen\n| 2009–24\n| 3\n| US distribution only; co-production with Paramount Pictures, DC Films (both 2009–24) and Legendary Pictures (2009)\n|-\n| Top Cat\n| 2011–15\n| rowspan=\"2\" | 2\n| International distribution only; co-production with Anima Estudios, Illusion Studios (2011),  Discreet Art Productions and Prana Studios (both 2015)\n|-\n| Dolphin Tale\n| 2011–14\n| co-production with Alcon Entertainment\n|-\n| The Hobbit\n| 2012–14\n| rowspan=\"2\" | 3\n| co-production with Metro-Goldwyn-Mayer, New Line Cinema and WingNut Films; Co-owned with Metro-Goldwyn-Mayer\n|-\n| Magic Mike\n| 2012–23\n|\n|-\n| DC Extended Universe\n| 2013–23\n| 15\n| co-production with DC Entertainment (2013–16), DC Films (2016–23) and RatPac Entertainment (2016–17)\n|-\n| The Conjuring Universe\n| 2013–present\n| 7\n| co-production with Atomic Monster, The Safran Company and New Line Cinema\n|-\n| The Lego Movie\n| 2014–19\n| 4\n| co-production with Warner Bros. Pictures Animation, Village Roadshow Pictures (2014) and Lego System A/S\n|-\n| Monsterverse\n| 2014–present\n| 5\n| co-production with Legendary Pictures\n|-\n| Creed\n| 2015–present\n| 3\n| co-production with Metro-Goldwyn-Mayer and New Line Cinema (1–2)\n|-\n| IT\n| 2017–present\n| rowspan=\"2\" | 2\n| distribution only; produced by New Line Cinema, Rideback, Vertigo Entertainment and KatzSmith Productions\n|-\n| The Meg\n| 2018–present\n|-\n| Detective Pikachu\n| 2019–present\n|1\n| co-production with Legendary Pictures, The Pokémon Company and Toho\n|-\n| Joker\n| 2019–24\n| rowspan=\"2\" | 2\n| co-production with Village Roadshow Pictures, DC Films (1) Bron Creative and Joint Effort.\n|-\n| Dune\n| 2021–present\n| co-production with Legendary Pictures\n|-\n| The Batman\n| 2022–present\n| rowspan=\"3\" | 1\n| distribution only; produced by DC Films (1), 6th & Idaho, Dylan Clark Productions and DC Studios.\n|-\n| A Minecraft Movie\n| rowspan=\"2\" | 2025–present\n| co-production with Legendary Pictures, Mojang Studios, Vertigo Entertainment and On the Roam.\n|-\n| DC Universe\n| distribution only; produced by DC Studios\n|}\nHighest-grossing films\n: .|text=}}\n{|\n|-\n|\n{| class=\"wikitable sortable\" style=\"margin:auto; margin:auto;\"\n|+Highest-grossing films in North America\n|-\n! Rank !! Title !! Year !! Gross\n|-\n! 1\n| Barbie\n| 2023\n| $636,238,421\n|-\n! 2\n| The Dark Knight\n| 2008\n| $534,987,076\n|-\n! 3\n| The Dark Knight Rises\n| 2012\n| $448,149,584\n|-\n! 4\n| A Minecraft Movie\n| 2025\n| $423,949,195\n|-\n! 5\n| Wonder Woman\n| 2017\n| $412,845,172\n|-\n! 6\n| Harry Potter and the Deathly Hallows – Part 2\n| 2011\n| $381,447,587\n|-\n! 7\n| The Batman\n| 2022\n| $369,345,583\n|-\n! 8\n| Superman\n| 2025\n| $354,184,465\n|-\n! 9\n| American Sniper\n| 2014\n| $350,159,020\n|-\n! 10\n| Joker\n| 2019\n| $335,477,657\n|-\n! 11\n| Aquaman\n| 2018\n| $335,104,314\n|-\n! 12\n| Batman v Superman: Dawn of Justice\n| 2016\n| $330,360,194\n|-\n! 13\n| It\n| 2017\n| $328,874,981\n|-\n! 14\n| Suicide Squad\n| 2016\n| $325,100,054\n|-\n! 15\n| Harry Potter and the Sorcerer's Stone\n| 2001\n| $317,871,467\n|-\n! 16\n| The Hobbit: An Unexpected Journey\n| 2012\n| $303,030,651\n|-\n! 17\n| Harry Potter and the Half-Blood Prince\n| 2009\n| $302,334,374\n|-\n! 18\n| Harry Potter and the Deathly Hallows – Part 1\n| 2010\n| $296,374,621\n|-\n! 19\n| Beetlejuice Beetlejuice\n| 2024\n| $294,100,435\n|-\n! 20\n| Inception\n| 2010\n| $292,587,330\n|-\n! 21\n| Harry Potter and the Order of the Phoenix\n| 2007\n| $292,382,727\n|-\n! 22\n| Man of Steel\n| 2013\n| $291,045,518\n|-\n! 23\n| Harry Potter and the Goblet of Fire\n| 2005\n| $290,469,928\n|-\n! 24\n| Dune: Part Two\n| 2024\n| $282,144,358\n|-\n! 25\n| The Matrix Reloaded\n| 2003\n| $281,576,461\n|}\n|\n{| class=\"wikitable sortable\" style=\"margin:auto; margin:auto;\"\n|+Highest-grossing films worldwide\n|-\n! Rank !! Title !! Year !! Gross\n|-\n! 1\n| Barbie\n| 2023\n| $1,447,038,421\n|-\n! 2\n| Harry Potter and the Deathly Hallows – Part 2\n| 2011\n| $1,342,359,942\n|-\n! 3\n| Aquaman\n| 2018\n| $1,148,528,393\n|-\n! 4\n| The Dark Knight Rises\n| 2012\n| $1,081,153,097\n|-\n! 5\n|Joker\n| 2019\n| $1,074,445,730\n|-\n! 6\n| Harry Potter and the Philosopher's Stone\n| 2001\n| $1,028,492,855\n|-\n! 7\n| The Hobbit: An Unexpected Journey\n| 2012\n| $1,017,030,651\n|-\n! 8\n| The Dark Knight\n| 2008\n| $1,009,057,329\n|-\n! 9\n| Harry Potter and the Deathly Hallows – Part 1\n| 2010\n| $977,070,383\n|-\n! 10\n| The Hobbit: The Desolation of Smaug\n| 2013\n| $959,027,992\n|-\n! 11\n| A Minecraft Movie\n| 2025\n| $957,949,195\n|-\n! 12\n| The Hobbit: The Battle of the Five Armies\n| 2014\n| $956,019,788\n|-\n! 13\n| Harry Potter and the Order of the Phoenix\n| 2007\n| $942,201,710\n|-\n! 14\n| Harry Potter and the Half-Blood Prince\n| 2009\n| $934,483,039\n|-\n! 15\n| Harry Potter and the Goblet of Fire\n| 2005\n| $896,730,264\n|-\n! 16\n| Harry Potter and the Chamber of Secrets\n| 2002\n| $879,793,867\n|-\n! 17\n| Batman v Superman: Dawn of Justice\n| 2016\n| $873,637,528\n|-\n! 18\n| Inception\n| 2010\n| $836,848,102\n|-\n! 19\n| Wonder Woman\n| 2017\n| $822,854,286\n|-\n! 20\n| Fantastic Beasts and Where to Find Them\n| 2016\n| $814,037,575\n|-\n! 21\n| Harry Potter and the Prisoner of Azkaban\n| 2004\n| $796,907,323\n|-\n! 22\n| The Batman\n| 2022\n| $770,962,583\n|-\n! 23\n| Interstellar\n| 2014\n| $758,690,230\n|-\n! 24\n| Suicide Squad\n| 2016\n| $746,846,894\n|-\n! 25\n| The Matrix Reloaded''\n| 2003\n| $741,847,937\n|}\n|}\n— Includes theatrical reissue(s)\nNotes\n#  co-owned by New Line Cinema and Metro-Goldwyn-Mayer Pictures (the film's producers)\nReferences\nExternal links\n*"
    }
  ]
}