{
  "content": [
    {
      "type": "text",
      "text": "# Warner elevator row\n\n|location_town=Warner, Alberta\n|location_country=Canada\n|architect= Companies (builders)United Grain GrowersX.C. Hadford CompanyAlberta Farmers Co-operative Elevator Co.Alberta Pacific Grain Co.Federal Grain LTD.Ogilvie Flour MillsEllison Milling & Flour Co.\n|client= Current owner(s)Viterra\n|engineer=\n|construction_start_date= 1913–1960s\n|completion_date= 1960s\n|date_demolished= X. C. Hadford Company (1950–2001)  Ogilvie Flour Mills (1929–2000)  Ellison Milling & Flour Co. (1939–2000)  Alberta Farmers' Co-operative Elevator Company (1913-2014)  Alberta Wheat Pool (1951-2014)  Alberta Pool elevator (1928-2014)\n|cost=\n|structural_system=Wood-crib\n|style=\n|size=\n}}\nThe Warner elevator row is a group of four historic wood-cribbed grain elevators standing in a row from south to north alongside the Canadian Pacific Railway line from Great Falls, Montana to Lethbridge, Alberta at the east entrance of the village of Warner, Alberta, Canada.  At one time, the row had at least seven elevators.\nHistory and significance\ntakeover (photo circa 1920)]]\nMany once-common wood-crib grain elevators in Western Canada have been torn down. Warner has four elevators, and the Inglis elevator row in Manitoba has five. Warner's elevators are not protected.  In 2014, two of the elevators were demolished.\nBefore 1911, Warner had two elevators: one a  house built by the Alberta Pacific Elevator Company, and the other a  elevator built by Jones and Dill. In 1913, the first elevator in the remaining group was built by the Alberta Farmers' Co-operative Elevator Company. The structure and history of each elevator was influenced by developments in the grain industry and its companies from before World War II to the 1980s.\nThe Warner elevators date from 1913 to 1960. The row included an early example of the Alberta Farmers' Co-operative Elevator Company design and examples of complex component arrangements: elevator and twin, elevator and annexes and original and replacement offices. The 1939 elevator built by the Ellison Milling and Elevator Company is an architecturally-significant example of an essentially-unchanged 1940s complex consisting of an elevator, two balloon annexes and a track-side office and warehouse (usually from an earlier period). A small number of late-1930s elevators remain in Alberta, a reminder that few were built for some time after 1934. This elevator was demolished in the early 2000s. The Warner elevator row is included in Jim Pearson's book, Grain Elevators of Eastern Saskatchewan.\nGrain elevators\nWith the exception of the United Grain Growers elevator, Warner's elevators were little-modified and several have small scales and air dumps on site. The first elevator was built in 1911, when the Canadian Pacific Railway reached Warner.\nDemolitions\nFrom 1999 to 2014, 5 elevators were demolished, bringing the total elevator count down to 4.\nHistory\nThe United Grain Growers elevator and annex were built between 1957 and 1960, and the complex was licensed for  in 1960. It was UGG's second elevator at Warner; the first was sold to Alberta Pool Elevators in 1928. The elevator was upgraded during the late 1980s, including the installation of a new leg which required raising part of the cupola; the metal bin annexes on the south side and drag auger date from that time. A cyclone dust collector and truck-loading spout have been installed, and a roofed track-side warehouse on the north side was probably built at the same time as the elevator.\nA demolished 1950 elevator built by X. C. Hadford Company was licensed as a  seed elevator in 1952. In 1992, it was licensed as a 240-tonne primary elevator.\nThe ,  Alberta Farmers' Co-operative elevator was built in 1913. Before its demolition, it was one of the two oldest examples of standard Alberta Farmers' Elevator Company 1913–1917 design. It had a pyramidal roof, with a gable-roofed cupola housing the head of the leg. Archival photographs of other Alberta Farmers' Co-operative Elevator Company facilities suggest that this elevator originally had a track-side office and warehouse next to the elevator.\nIn 1913, the United Farmers of Alberta proposed the establishment of the Alberta Farmers' Elevator Company as a solution to producer problems in the province. Shares were issued to farmers at $60 each, payable in four annual installments. The Alberta government provided loans of 85 percent of the share sum. To market their grain and guarantee their loans during rapid wartime expansion, the Alberta Farmers' Co-operative Elevator Company relied on the experience of the Grain Growers Grain Company of Manitoba. In 1917 the companies merged to form the United Grain Growers, headquartered in Winnipeg, Manitoba.\nIn 1928 the UGG sold their 1913 Warner elevator to the Alberta Pool Elevator Company. A coal shed associated with the elevator since 1926 was sold in 1940 and removed from the site.\nIn 1940 a  balloon annex, built by the F. W. McDougall Construction Company, was added to the elevator and later removed. In 1951, the elevator was twinned with a new ,  elevator built by the pool; a new driveway was also built at this time. Both elevators have been demolished.\nThe 1928 Alberta Wheat Pool elevator was built by Voss Bros for the Alberta Pool Elevator Company in accordance with the standard  plan at a cost of $15,300. It measured ; a balloon annex built on the south side in 1940 was removed in 1995. The elevator has been demolished.\nA  elevator was built in 1918 by the Alberta Pacific Grain Company, replacing a pre-1911 Alberta Pacific Elevator Company structure. It may have had an annex, since it was licensed in 1918 for  and for  in 1922. In 1953 a  annex (removed in 1997) was attached to the elevator's north side, and a second annex was added six years later. In 1967, the elevator was taken over by Federal Grain; the following year Federal built a new elevator, twinning it with the 1918 structure and moving the 1959 annex to the south side of the new elevator. A driveway the length of both elevators was also built at this time. In 1972 the complex was sold to Alberta Wheat Pool, and in the summer of 1997 it was the AWP No. 4 house.\nThe 1968  Federal Grain elevator measures , with an electronic scale and an exterior loading spout for trucks. It was among the last elevators built according to the traditional design, before the single composite design came into widespread use.\nA  elevator was built by Ogilvie Flour Mills in 1929. A  balloon annex was added in 1940, followed by a  annex twelve years later. One annex was removed in 1997, and the elevator has been demolished.\nA  elevator was built by the Ellison Milling and Flour Company in 1939, with annexes probably built during World War II as temporary storage. In 1974 it was sold to Parrish & Heimbecker, and to UGG in 1985. The elevator has been demolished.\nReferences"
    }
  ]
}