{
  "content": [
    {
      "type": "text",
      "text": "# Warner Bros. Water Tower\n\nshield logo in 2022]]\nThe Warner Bros. Water Tower is a historic water tower located at the Warner Bros. Studios in Burbank, California. Built in 1927, it stands  tall. The tank, which had a capacity of , is no longer used to hold water. It is decorated with the WB shield logo on either side and serves as a company icon.\nHistory\nmerged with Discovery to form WBD.]]\nThe tower was previously located next to the Warner Bros. Fire Department, and was moved following the 1933 Long Beach earthquake, when the Warners realized that if the tower fell onto the Fire Department, it would disrupt emergency assistance. Towers such as these were a common feature of Hollywood studios of the era, as they provided an emergency water supply in case of fire. Similar towers can be found at the Walt Disney Studios, Paramount and Sony Pictures Studios (formerly MGM) lots.\nUsage in media\nThe tower has appeared in a number of productions of the company, including any that showed the studio lot, whether live action or animated. For instance, it serves as the home for Yakko, Wakko, and Dot Warner in the Warner Bros. animated series Animaniacs, starting in-universe from the 1930s until their escape in the 1990s, with them moving back into the tower in the 2020 reboot. The tower, as depicted in the Animaniacs reboot, is featured as a stage in MultiVersus.\nThe water tower (including the Kids' WB logo adorning the tower since 1999) and its studio backdrop were used in interstitials for Kids' WB, a children's programming block that primarily ran from 1995 to 2006 on The WB network, and later on The CW network from 2006 to 2008.  The tower is also the basis for the name and logo of the company's record label, WaterTower Music.\nAn inspired version was built in Warner Bros. Park Madrid in 2002, and another one has been built in 2018 at the front entrance of the Warner Bros. World theme park in Abu Dhabi, UAE.\nOccasionally, the water tower has been repainted to promote the 90th anniversary of the studio, the release of The Lego Batman Movie and Barbie, and the launch of HBO Max, and again to reflect the formation of Warner Bros. Discovery. The water tower was repainted once again to promote the studio's 100th anniversary.\nStarting with the HBO Max original film, Locked Down (2021), the repainted water tower is featured in the then-new Warner Bros. Pictures opening logo for the first time and is now the focal point of the studio lot (now rendered in photorealistic CGI) portion of the sequence. The entire opening sequence was rendered as CGI by Devastudios to show the studio lot at magic hour, with the sun rising over the Cahuenga Pass to the south, using Terragen for the sky and clouds, along with the studio's blueprints from the Warner Bros. Studio Facilities and the available photography and videography from Warner Bros. Studio Tour Hollywood and Google Maps, all in order to reconstruct it in CGI, with a new fanfare composed by Ludwig Göransson.  In real life, the sun rises in the east, over the Forest Lawn cemetery and the Walt Disney Studios. Starting with Wonka (2023), the logo was updated to feature the redesigned shield with the company name sash and banner. Furthermore, the CG elements were re-rendered using the Academy Color Encoding System (ACES), while the texture for the studio's water tower was updated using Adobe Substance 3D Painter and starting with Under Parallel Skies (2024), the logo featured a new fanfare entitled \"Classic Reflection\", a new rendition of the fanfare from the 1999 and 2020 logos, composed, arranged and conducted by Jacob Yoffee, co-conducted by Anthony Parnther, orchestrated by Nolan Markey, and mixed by Jason LaRocca, originally it was expected to be debuted in the UK and Ireland print of The Boys in the Boat (2023) but it was dismissed.\nGallery\nFile:Gate 4 Warner Bros. Studios.jpg\nFile:Warner Bros studios Burbank -water tower.jpg\nFile:Water tower WB (2).jpg\nFile:Warner Bros. Studios Water Tower 2020.jpg\nSee also\n* Earffel Tower, a faux water tower at Disneyland Paris' Walt Disney Studios Park and formerly at Disney's Hollywood Studios in Walt Disney World\nReferences"
    }
  ]
}