{
  "content": [
    {
      "type": "text",
      "text": "# Warners Bay, New South Wales\n\n| pop_footnotes =\n| elevation = 11\n| area      = 8\n| est       =\n| parish    = Kahibah\n| stategov  = Charlestown\n|stategov2=Lake Macquarie| fedgov    = Shortland\n| coordinates =\n| alternative_location_map = Australia Hunter Central Coast\n| dist1     = 15\n| dir1      = WSW\n| location1 = Newcastle\n| dist2     = 5\n| dir2      = W\n| location2 = Charlestown\n| dist3     = 54\n| dir3      = N\n| location3 = The Entrance\n| dist4     = 77\n| dir4      = N\n| location4 = Gosford\n| dist5     = 147\n| dir5      = N\n| location5 = Sydney\n| near-nw   = Speers Point\n| near-n    = Lakelands\n| near-ne   = Cardiff South\n| near-w    = Lake Macquarie\n| near-e    = HillsboroughCharlestown\n| near-sw   = Eleebana\n| near-s    = Eleebana\n| near-se   = Mount Hutton\n}}\nWarners Bay is a suburb of the City of Lake Macquarie in New South Wales, Australia, and is located  from Newcastle's central business district on the eastern side of Lake Macquarie. It is often regarded as a part of the Greater Newcastle district. It was named after Jonathan Warner, who settled the area.\nWarners Bay is the second-largest population centre in Lake Macquarie with over 7,000 residents (2016), and more than 615 businesses operating in the area.\nHistory\nThe Awabakal people are the first people of the area.\nAreas of interest\nThere are two main areas where most of the businesses in Warners Bay are situated.\nNear the lake foreshore there is a variety of local businesses such as cafés and restaurants with alfresco dining. There is an indoor shopping centre, known as Warners Bay Village. There is also an Australia Post post office in the area.\nThe other is a large-sized industrial estate situated along Hillsborough and Macquarie roads. Here there is an ice rink, a ten pin bowling alley, a laser tag complex, indoor go-karting, multiple gymnasiums and many bulk item stores including furniture stores and gardening centres, many of which are located in the Warners Bay Home homemaker complex.\nThe lakeshore has become a hub for recreational activity, both onshore and water based. Picnics, sailing and paddle-boating are all popular activities. A shared bike and walking path, which runs from the Art Gallery in Booragul to Green Point traverses the lake foreshore.\nSport\nWarners Bay is home to a number of local sporting clubs including the Warners Bay Bulldogs (Australian rules football), Warners Bay Panthers (Football/Soccer) and Warners Bay/Cardiff Junior Cricket Club. The home ground for these sporting clubs is Feighan Park.\nThe Hunter Ice Skating Stadium is located in Warners Bay, and hosted the IIHF 2008 Division II World Championships. The Hunter Ice Skating Stadium is home to the 3 times Australian Champions Newcastle North Stars Ice Hockey team, and the Newcastle Ice Skating Club, boasting several NSW and Australian champion skaters.\nImage gallery\nFile:PLJohnson Warners Bay NSW 2.jpg|Foreshore walk and shopping strip\nFile:PLJohnson Warners Bay, NSW, 3..jpg|Foreshore walk, viewing south\nFile:PLJohnson Warners Bay NSW 1.jpg|Foreshore and public jetty, viewing north\nReferences\nExternal links\n*[http://history.lakemac.com.au/page-local-history.aspx?pid=1085&vid=20&tmpt=narrative&narid=88 History of Warners Bay] (Lake Macquarie City Library)"
    }
  ]
}