{
  "content": [
    {
      "type": "text",
      "text": "# Waro Limestone Scenic Reserve\n\nThe Waro Limestone Scenic Reserve is a conservation area near Waro near Hikurangi,  north of Whangārei on the North Island of New Zealand.\nHistory\nThe Maori tribes of Ngāti Hau, Ngāti Kahu O Torongare and Ngāti Wai used the rocks for ritual purposes and now declare them as waahi tapu (holy sites). Since the late 19th century, the rocks became an attraction for locals and tourists. The privet plants, daffodils and peppermint plants, which grow now in the area, originate probably from the early European settlers.\nCoal mining and narrow gauge railways\nIn the area were up to 60 or 70 coal mines, which have produced about 4.2 million tons of coal in total. The largest mines were run by the Hikurangi Coal Company, the Wilson Colliery Company and the Northern Coal Mine Company. The coal was discovered in the 1860s, but the first coal mine was opened only in 1889. The coal was transported by several narrow gauge railways.\nWaro Horse Tramline\nThe Waro Horse Tramline was a horse drawn industrial railway on steel rails. It was built between 1894 and 1905. The earliest known testimony of its existence is a 1905 survey plan. From the (A) Kerr & Wyatt's Mine coal mine, the (B) Eastern Field Railroad led to the lime kilns at the (C) railway siding on the 1889 established Hikurangi Kamo State Railroad as well as a (D) older, at this time already disused field railway, as can be seen on a map from 1907.\nWaro Horse Tramline.png|Waro Horse Tramline\nWaro Horse Tramline on 1907 survey map.png|Route, 1907\nHikurangi Coal Company\nThe Hikurangi Coal Company operated from 1913 a coal mine underneath the limestone cliffs. It was closed during the First World War and reopened in 1921 by the Wilson Collieries to extract fuel for the cement works in nearby Portland. The colliery was finally closed in 1933 due to a flooding.\nNorthern Colliery Company\nThe Northern Colliery Company procured in September 1904 a steam locomotive, which had been built in 1904 at Orenstein & Koppel in Berlin with the factory number 1411. The locomotive had a gauge of 560&nbsp;mm (22 inches) and an output of 20&nbsp;hp. It was sold to New Zealand Cement Co. on Limestone Island in the 1910s, and from there in 1918 to Wilson's Portland Cement Co. of Portland, where it was operated as Bertha. Later, it was acquired by Museum of Transport and Technology in Auckland, where it is still preserved in operational condition. A garden railway model was manufactured and distributed by LGB.\nSteam locomotive, built by Orenstein and Koppel, Germany (maker's no. 1411). ATLIB 337813.png|O&K steam locomotive, works No 1411 of 1907\nThe \"tip\" at the Northern Colliery Co., Waro ATLIB 337803.png|The tip of the Northern Colliery Co.\nThe Incline on the Northern Colliery Co. line, at Waro. ATLIB 287793.png|Funicular of the Northern Colliery Co.\nTipping coal into hopper wagons at Waro. ATLIB 337808.png|Tipping coal into hopper wagons at Waro, 1911\nMarble Quarries\nBetween Waro Rocks and the railway, a lake fills a flooded quarry, where Whangarei Limestone (called Waro,) was quarried from the 1920s to 1940s. It was a shelly, dull yellow, cream or pink-tinted limestone. The quarry was next to Waro railway station, allowing easy transport for many government buildings, including the foyer of Wellington Railway Station, Auckland Railway Station, Napier Post Office; Wellington Central Library, Dunedin Post Office and Dunedin Town Hall. The quarry was then used by Wilson’s Cement (later Golden Bay Cement) as a source of high grade limestone, until Wilsonville Quarry, over the road, opened in 1974 and the old quarry was given to Whangarei District Council as a reserve.\nLiterature and external links\n* [http://nzetc.victoria.ac.nz/tm/scholarly/tei-Cyc02Cycl-t1-body1-d2-d11-d4.html Hikurangi Coal Company.] In: The Cyclopedia Company, Limited, 1902, Christchurch\n* [https://nzhistory.govt.nz/media/photo/hikurangi-mine Hikurangi Coal Mine. Foto von Frederick George Radcliffe, Alexander Turnbull Library, Reference no:1/2-006294-F]\nReferences"
    }
  ]
}