{
  "content": [
    {
      "type": "text",
      "text": "# Warota People\n\n| recorded   =\n| studio     =\n| venue      =\n| genre      = J-pop\n| length     = 4:29\n| label      = laugh out loud records\n| composer   =\n| lyricist   =\n| producer   =\n| prev_title = Boku Igai no Dareka\n| prev_year  = 2016\n| next_title = Yokubomono\n| next_year  = 2018\n| misc       =\n}}\nis the 17th single by Japanese idol girl group NMB48. It was released on 27 December 2017. It reached number-one on the weekly Oricon Singles Chart with 273,499 copies sold. It also reached the first place on the Billboard Japan Hot 100.\nTrack listing\nType A\n| title1          = Warota People\n| title2          = Jibun no Iro\n| title3          = Doko ka de Kiss wo\n| title4          = Warota People\n| title5          = Jibun no Iro\n| title6          = Doko ka de Kiss wo\n}}\nType B\n| title3          = Hontou no Jibun no Kyokaisen\n| title4          = Warota People\n| title5          = Jibun no Iro\n| title6          = Hontou no Jibun no Kyokaisen\n}}\nType C\n| title3          = Futsuu no Mizu\n| title4          = Warota People\n| title5          = Jibun no Iro\n| title6          = Futsuu no Mizu\n}}\nType D\n| title3          = Which one\n| title4          = Warota People\n| title5          = Jibun no Iro\n| title6          = Which one\n}}\nTheater version\n| title3          = Mou Ichido, Hashiridashite Miyou ka?\n| title4          = Warota People\n| title5          = Jibun no Iro\n| title6          = Mou Ichido, Hashiridashite Miyou ka?\n}}\nPersonnel\n\"Warota People (Senbatsu)\"\nThe performers of the main single are:\n*Team N: Ichikawa Miori, Tanigawa Airi, Yamamoto Ayaka, Yamamoto Sayaka\n*Team M: Iwata Momoka, Kato Yuuka, Shibuya Nagisa, , Yoshida Akari\n*Team BII: Uemura Azusa, Ota Yuuri, Okita Ayaka, Jo Eriko, Jonishi Rei, Murase Sae, Yagura Fuuko\n'' is the song center}}\n\"Jibun no Iro\"\n\"Jibun no Iro\" was performed by NMB48 2nd Generation members, consisting of:\n*Team N: Azuma Yuki, Koga Narumi, Tanigawa Airi, Hayashi Momoka, Mita Mao\n*Team M: Ishida Yuumi, Uno Mizuki, Nishizawa Rurina\n*Team BII: Jo Eriko, Murase Sae, Yagura Fuuko\n\"Doko ka de Kiss wo\"\n\"Doko ka de Kiss wo\" was performed by Team N members, consisting of:\n*Team N: Azuma Yuki, Ichikawa Miori, Umeyama Cocona, Kusaka Konomi, Koga Narumi, Kojima Karin, Tanigawa Airi, Naiki Kokoro, Hayashi Momoka, Hori Shion, Hongou Yuzuha, Matsumura Megumi, Mizokawa Mirai, Mita Mao, Yamao Rina, ,\n\"Hontou no Jibun no Kyokaisen\"\n\"Hontou no Jibun no Kyokaisen\" was performed by Team M members, consisting of:\n*Team M: Ishida Yuumi, Iso Kanae, Iwata Momoka, Uno Mizuki, Odan Mai, Kato Yuuka, Kawakami Chihiro, Kawakami Rena, Shibuya Nagisa, , Nakano Reina, Nishizawa Rurina, Yasuda Momone, Yamada Suzu, Yoshida Akari\n\"Futsuu no Mizu\"\n\"Futsuu no Mizu\" was performed by Team BII members, consisting of:\n*Team BII: Akashi Natsuko, Ishizuka Akari, Ijiri Anna, Uemura Azusa, Ota Yuuri, Okita Ayaka, Kushiro Rina, Shimizu Rika, Jo Eriko, Jonishi Rei, Takei Sara, Nakagawa Mion, Mizuta Shiori, Murase Sae, Morita Ayaka,\n\"Which one\"\n\"Which one\" was performed by 5 members:\n*Team M: Shibuya Nagisa,\n*Team BII: Uemura Azusa, Ota Yuuri, Murase Sae\n\"Mou Ichido, Hashiridashite Miyou ka?\"\n\"Mou Ichido, Hashiridashite Miyou ka?\" was performed by Jo Eriko:\n*Team BII: Jo Eriko\nReferences"
    }
  ]
}