{
  "content": [
    {
      "type": "text",
      "text": "# Warpspace\n\n}}\nWarpspace is a private Japanese company developing an inter-satellite communication system based on laser communication. Warpspace is developing a medium Earth orbit satellite, WarpHub InterSat, which will communicate with other satellites in low Earth orbit using optical communication, then pass on the received data to ground stations.\nHistory\nWarpspace was founded in 2016 as a spin-off company of Tsukuba University. In 2017, the company tested a mobile ground control station, receiving data from Tsukuba University's ITF-2 CubeSat in low Earth orbit. In July 2018, Warpspace announced a 'space bridal service' in which wedding plaques were to be sent to space, by placing them on a satellite and releasing it from the International Space Station (ISS). According to media reports, astronauts staying on the ISS were to take photographs of the satellite during its deployment. The company signed a contract to deploy a satellite from the ISS's Kibo Module on 24 August 2018.\nIn February 2020, Warpspace's first satellite, WARP-01 was unveiled during an event in Tsukuba city. WARP-01 was launched and carried to space on board Cygnus NG-15, and was deployed from the ISS on 14 March 2021.\nWarpspace's second satellite, WARP-02 will be the first to become part of the WarpHub InterSat satellite constellation. As of June 2023, WARP-02 is planned to be launched in 2025.\nIn 2023, Warpspace was included in the Japanese government's small business innovation research (SBIR) program.\nWarpHub InterSat\nWarpHub InterSat is a satellite constellation for inter-satellite data relay planned by Warpspace. Each satellite will have an optical communication terminal. As of 2022, Warpspace plans to launch three satellites for WarpHub InterSat.\nWarpspace contracted ReOrbit to manufacture the satellite bus, and each of the satellites will be equipped with a Mynaric CONDOR Mk 3 terminal. The terminals follow the Space Development Agency's Transport Layer Tranche 1 standard.\nThe first WarpHub InterSat satellite is nicknamed LEIHO, which means sacred mountain in Japanese, in reference to Mount Tsukuba which is regarded as sacred in Shinto. LEIHO is planned to be launched in 2025.\nSee also\n* Private spaceflight\nReferences\nExternal links\n*\n* [https://v2.warpspace.jp/ Warpspace]"
    }
  ]
}