{
  "content": [
    {
      "type": "text",
      "text": "# Warped Passages\n\n}}\n'Warped Passages: Unraveling the Mysteries of the Universe's Hidden Dimensions' is the debut non-fiction book by Lisa Randall, published in 2005, about particle physics in general and additional dimensions of space (cf. Kaluza–Klein theory) in particular. The book has made it to top 50 at amazon.com, making it the world's first successful book on theoretical physics by a female author. She herself characterizes the book as being about physics and the multi-dimensional universe. The book describes, at a non-technical level, theoretical models Professor Randall developed with the physicist Raman Sundrum, in which various aspects of particle physics (e.g. supersymmetry) are explained in a higher-dimensional braneworld scenario. These models have since generated thousands of citations.\nOverview\nShe comments that her motivation for writing this book was her \"thinking that there were people who wanted a more complete and balanced vision of the current state of physics.\" She has noticed there is a large audience that thinks physics is about the bizarre or exotic. She observes that when people develop an understanding of the science of particle physics and the experiments that produce the science, people get excited. \"The upcoming experiments at the Large Hadron Collider (LHC) at CERN near Geneva will test many ideas, including some of the warped extra-dimensional theories I talk about.\" Another motivation was that she \"gambled that there are people who really want to understand the physics and how the many ideas connect.\"\nBackground\nRandall is currently a professor at Harvard University in Cambridge, Massachusetts, focusing on particle physics and cosmology. She stays current through her research into the nature of matter's most basic elements, and the forces that govern these most basic elements. Randall's experiences, which qualify her as an authority on the subject of the book, are her original \"contributions in a wide variety of physics studies, including cosmological inflation, supersymmetry, grand unified theories, and aspects of string theory\". \"As of last autumn, she was the most cited theoretical physicist in the world during the previous five years.\" In addition  her most recent work involved extra dimensions.\nHer background research for the book, on the theories and experiments of extra dimensions and warped geometries, was published in the peer-reviewed Science magazine in 2002.\nSee also\n*Euclidean space\n*Fourth dimension in art\n*Four-dimensionalism\n*Fifth dimension\n*Sixth dimension\nSimilar books on dimensions\n*Flatland, a book by Edwin A. Abbott about two- and three-dimensional spaces, to understand the concept of four dimensions\n*Sphereland, an unofficial sequel to Flatland\n*Hiding in the Mirror by Lawrence Krauss\nReferences\nFurther reading\n*\n*\n*"
    }
  ]
}