{
  "content": [
    {
      "type": "text",
      "text": "# Warren Covington__disambig_1\n\n| birth_place     = Philadelphia, PA, U.S.\n| death_date      =\n| death_place     = New York City, NY, U.S.\n| genre           = Jazz\n| occupation      = Musician\n| instrument      = Trombone\n| years_active    =\n| label           =\n| associated_acts =\n}}\nWarren Covington (August 7, 1921 &ndash; August 24, 1999) was an American big band trombonist. He was active as a session musician, arranger, and bandleader throughout his career.\nBiography\nCovington, who was born in Philadelphia, played early on with Isham Jones (1939), then with Les Brown in 1945-46 and Gene Krupa later in 1946. Following this he became a staff musician for CBS radio. With Ralph Flanagan in 1949 and again in 1955-56. He played briefly with Tommy Dorsey in 1950. In 1956, he replaced Eddie Grady as leader of the Commanders, a Decca recording and touring band which lasted until the middle of 1957.  Covington recorded two albums and one single with this band. After Tommy Dorsey died suddenly in November 1956, the Dorsey band continued under the direction of Jimmy Dorsey.  However, the Tommy Dorsey estate soon took back Tommy's arrangements and approached Covington to form a new Tommy Dorsey band, which he led, touring and recording for Decca, into 1961. Among his hits with the Dorsey band was \"Tea for Two Cha Cha\", which sold over one million copies, and was awarded a gold disc. The track peaked at #3 in the UK Singles Chart in 1958.\nA player who also occasionally played, with a variety of the baritone horn, baritone and tenor saxophone, Covington participated in the big bands of Charles Mingus, Randy Weston, Bobby Hackett, and George Benson on recordings, and also a number of film soundtracks.\nHe died in 1999 in New York.\nDiscography\nAs leader\n* Shall We Dance? (Decca, 1956)\n* Teenage Hop (Decca, 1957)\n* Latin Si! (Decca, 1962)\n* Dancing Trombones (Decca, 1962)\n* Everybody Twist (Decca, 1962)\n* ''Let's Dance Latin (Decca, 1964)\n* Golden Trombones Favorites (Decca, 1966)\n* Latin Dance Party (Vocalion, 1967)\nWith Tommy Dorsey\n* The Fabulous Arrangements of Tommy Dorsey in Hi-Fi (Brunswick, 1958)\n* Tea for Two Chas Chas (Decca, 1958)\n* More Tea for Two Cha Chas (Decca, 1959)\n* The Swingin Era (Decca, 1959)\n* Dance and Romance (Decca, 1960)\n* Tricky Trombones (Decca, 1960)\n* It Takes Two (Decca, 1960)\n* Dance to the Songs Everybody Knows (Decca, 1961)\n* Golden Trombones Favorites (Decca, 1966)\nAs sideman\n* George Benson, Bad Benson (CTI, 1974)\n* Les Brown, The Uncollected Les Brown and His Orchestra 1944–1946 (Hindsight, 1976)\n* Chris Connor, Chris Connor Sings the George Gershwin Almanac of Song (Atlantic, 1957)\n* Giora Feidman, The Art of the Klezmer (Star, 1979)\n* Astrud Gilberto, Beach Samba (Verve, 1967)\n* Eartha Kitt, That Bad Eartha (RCA Victor, 1953)\n* Eartha Kitt, Thursday's Child (RCA Victor, 1957)\n* Gene Krupa, The Gene Krupa Orchestra (Durium, 1974)\n* Yusef Lateef, Part of the Search (Atlantic, 1973)\n* Betty Madigan, The Jerome Kern Songbook (Coral, 1958)\n* Van McCoy, Love Is the Answer (Avco, 1974)\n* Houston Person, Harmony (Mercury, 1977)\n* Don Sebesky, Giant Box (CTI, 1973)\n* George Segal, A Touch of Ragtime Featuring the Music of Scott Joplin (Signature, 1974)\n* Phil Silvers, Phil Silvers and Swinging Brass (Columbia, 1957)\n* The Spinners, Dancin' and Lovin' (Atlantic, 1979)\n* Randy Weston, Blue Moses'' (CTI, 1972)\nReferences\nExternal links\n*[ Warren Covington] at Allmusic\n* [https://adp.library.ucsb.edu/names/202173 Warren Covington recordings] at the Discography of American Historical Recordings."
    }
  ]
}