{
  "content": [
    {
      "type": "text",
      "text": "# Warriors of the Year 2072\n\nor  -->\n| director = Lucio Fulci\n| producer = }}\n| screenplay = }}\n| story = }}\n| starring =\n| narrator =\n| music = Riz Ortolani\n| cinematography = Giuseppe Pinori\n| editing = Vincenzo Tomassi\n| studio = Regency Productions\n| distributor = Titanus\n| released =\n| runtime = 89 minutes\n| country = Italy\n| language =\n| budget =\n| gross =\n}}\nWarriors of the Year 2072 () is a 1984 Italian science fiction film directed by Lucio Fulci. The film is set in the 21st century, where Romans have found a new way to handle criminals: by having them fight each other like gladiators on motorcycles on national television. The film was based on a trend of Italian cinema to develop stories of futuristic barbarians after the popularity of the films Mad Max and Escape from New York.\nPlot\nIn 2072, set in a dystopian Rome, Italy, WBS TV's chief of programming, Cortez, is fuming at the consistently high ratings enjoyed by a rival American TV show called 'Kill-Bike.' The show features gladiatorial fights to the death on motorcycles and has made a hero of Drake, the unbeaten champion. Cortez is all the more bitter because he discovered Drake in the first place. WBS's current answer to the American show is 'The Danger Game,' a simulation game showing the hallucinations of a contestant experiencing the approach of violent death. Fear, panic, and screaming at the incredibly realistic simulations increase the intensity further. Unfortunately for the station, even this spectacle fails to compete against the American show.\nCortez and his two female assistants, Sybil and Sarah, receive a video message from the mysterious station boss, Sam, demanding that they recreate the formula of the gladiatorial contest and set them back to where they began: in the Coliseum. Sam orders the WBS station, a flying saucer controlled by a computer system called Junior, to fly over there and initiate training of the future contestants who will be chosen from the Death Rows around the world. Meanwhile, Drake has been imprisoned for the murder of three men who killed his wife Susan after they broke into his house, and he (conveniently for WBS) is now under the sentence of death for taking the law into his own hands.\nDrake is brought to the training compound, and a detector strip is seared into his wrist. There, he has to contend with the sadistic Chief of the Praetorian Guard, Raven, and the hostility of the other future contestants. Abdul is an African-American Muslim extremist; Akira is a notorious Japanese serial killer; Kirk is a German-born robber/killer; and Tango is a Latin American terrorist. Drake also meets an old friend from his WBS days, a deformed employee with a fiber-optic eye called Monk, who offers Drake some reassurance.\nThe next day, Drake is strapped into a 'hate stimulator' device, designed to measure the point when man can be provoked into murder. Despite the machine's best efforts, which creates holographic images of his wife's killers taunting him, Drake does not crack. Cortez's assistant, Sarah, is perturbed by this and becomes attracted to the prisoner. Drake soon earns the respect of the other prisoners after facing off in a battle of wits with the vicious Raven, who is impotent to harm the prisoners because of the upcoming TV show. Sarah meets and befriends Drake and shows him videotape evidence she has discovered that proves he was set up for his wife's murder merely to get him on the show. A strangely powerful microprocessor smuggled in by Monk facilities an escape attempt. When it fails, footage of Drake and the other prisoners in their escape attempt turns up immediately on the TV news. Raven is given limited access to torture the prisoners with electric shocks. But the harrowing experience bonds the principle gladiators even more. Meanwhile, Cortez is becoming more enraged by Sarah's investigation of Drake.\nThe following evening, Sarah visits Professor Towman (Cosimo Cinieri), the inventor of Junior, the WBS computer system, looking for a way to gain access to the restricted files. The professor has become a mystic and talks about his invention's soul. Professor Towman gives Sarah a pass-chip to access the computer when an unseen assailant suddenly murders him. But before Sarah can try to capture Sybil, she too is shot and killed by an unseen assailant.\nMeanwhile, the WBS Gladiator Contest commences, with each contesting racing around the modified arena in modified motorcycle carts fighting in a chariot-like run. Many contestants are killed, including Tango. Suddenly, Sarah interrupts the games by riding into the stadium on a motorcycle. She has discovered from the computer chip that Junior will trigger the bracelet devices of all the surviving gladiators to kill them all 20 minutes after the show ends. Revealing this information to Drake and the rest of the men, they mount an attack on the control tower, killing all the guards, including Raven. But most of the gladiators, including Akira, are killed in the assault. Drake, Sarah, Abdul, and Kirk break into the central control room and discover that Cortez is found to have plotted the death of the survivors to discredit Sam and take over as station head. Cortez is killed by Abdul, who shoots him. Then, a computer screen image of the company boss, Sam, appears and informs them that 'Sam' is just a video projection of the computer, emanating from a space satellite orbiting 200,000 miles above the Earth. The computer knew Cortez's plan but let it happen to a point.\nThe four surviving rebels force entry into the main terminal of 'Sam' with the aid of Sarah's passkey. But Kirk is killed when he unwisely tries to remove his bracelet himself. Then, the three surviving rebels are attacked in the control room by Monk, who is revealed to be the traitor who filmed the escape attempt with a mini-camera built into his eye. After a bitter fight, Drake kills him, and Sarah uses some of the information stored on his camera chip to access the destruction codes. Sam is blown up in the nick of time, and the deadly bracelets are deactivated. With the battle won, Drake and Sarah fly off together in a hover-vehicle to start a new life for themselves.\nCast\n* Jared Martin as Drake\n* Fred Williamson as Abdul\n* Howard Ross as Raven\n* Eleonora Brigliadori as Sarah\n* Cosimo Cinieri as Professor Towman\n* Claudio Cassinelli as Cortez\n* Valeria Cavalli as Susan\n* Donald O'Brien as Monk\n* Penny Brown as Sybil\n* Al Cliver as Kirk\n* Mario Novelli as Tango\nProduction\nThe film was part of a cycle of dystopian science fiction films inspired by the popularity of films like George Miller's Mad Max and John Carpenter's Escape from New York. Following the release of these films, Italian cinema produced films such as Enzo G. Castellari's 1990: The Bronx Warriors and The New Barbarians, Ruggero Deodato's The Raiders of Atlantis and Bruno Mattei's Rats: Night of Terror.\nThe story for the film was devised by the husband and wife team of Dardano Sacchetti and Elisa Briganti. Fulci felt the story by Sacchetti was strong, but was not happy with producers' suggestions. The suggestions included adding skyscrapers to scenes where Fulci had envisioned a futuristic Rome covered by gigantic Plexiglas domes. The production was originally planned to be part of a two film deal, with Fulci's next project to be Blastfighter. Sacchetti explained that Fulci had had an argument with the production and had been taken to court. The title of the film had been sold, and they were no longer able to use the script, which led to Blastfighter having its title but a completely different story.\nThe completed script of Warriors of the Year 2072 was edited further by Cesare Frugoni and Fulci himself. The film would mark the last time Sacchetti would work with Fulci. Fulci claimed Sacchetti had stolen his idea for a film to be titled Evil Comes Back. Sacchetti denied these allegations, stating that Fulci was originally excited over his drafts and had it read to a producer who commissioned him for a script. The film would later be made by Lamberto Bava under the title Until Death.\nRelease\nWarriors of the Year 2072 was released in Italy on January 28, 1984. It was released on DVD as The New Gladiators by Troma Video on August 7, 2001, and on Blu-ray by Severin Films on June 25, 2021.\nThe film has been released under several titles, including Rome 2072 A.D.: The New Gladiators, Fighting Centurions and Rome 2033 - The Fighter Centurions.  Troy Howarth, in his biography on Fulci stated the film is often referred to as The New Gladiators.\nReception\nThe film was reviewed by a critic credited as \"Lor.\" in Variety who reviewed the film on December 23, 1987. \"Lor.\" critiqued the film, criticising \"inadequate model shots of a futuristic cityscape cribbed from the Blade Runner style\", that it was a \"boring film\", and that \"Fulci's fans are bound to be disappointed\", noting that the film \"focuses on the preparations and arguments concerning the game, which actually does not begin until one hour into the picture\".  An additional complaint was that the computer program known as \"Junior\" did not work in the story.\nSee also\n* Knightriders\n* List of Italian films of 1984\n* Mad Max series legacy and influence in popular culture\nFootnotes\nReferences\n*\n*\n*\nExternal links\n*"
    }
  ]
}