{
  "content": [
    {
      "type": "text",
      "text": "# Warrenton, North Carolina\n\n| area_magnitude           =\n| area_total_km2           = 2.81\n| area_land_km2            = 2.81\n| area_water_km2           = 0.00\n| area_total_sq_mi         = 1.09\n| area_land_sq_mi          = 1.08\n| area_water_sq_mi         = 0.00\n| population_as_of         = 2020\n| population_footnotes     =\n| population_total         = 851\n| population_density_km2   = 302.83\n| population_density_sq_mi = 784.33\n| timezone                 = EST\n| utc_offset               = -5\n| timezone_DST             = EDT\n| utc_offset_DST           = -4\n| elevation_footnotes      =\n| elevation_ft             = 384\n| coordinates              =\n| postal_code_type         = ZIP code\n| postal_code              = 27589\n| area_code                = 252\n| blank_name               = FIPS code\n| blank_info               = 37-71100\n| blank1_name              = GNIS feature ID\n| blank1_info              = 2406832\n| website                  =\n| footnotes                =\n| pop_est_as_of            =\n| pop_est_footnotes        =\n| population_est           =\n}}\nWarrenton is a town in and the county seat of Warren County, North Carolina, United States. The population was 862 at the 2010 census. Warrenton, now served by U.S. routes 158 and 401, was founded in 1779. It became one of the wealthiest towns in the state from 1840 to 1860, being a trading center of an area of rich tobacco and cotton plantations. It has a large stock of historic architecture buildings. More than 90 percent of its buildings are listed in the National Register of Historic Places and its National Historic District encompasses nearly half its area.\nHistory and attractions\nWarrenton was founded at the time when Bute County was divided to form Warren and Franklin counties. Named for Dr. Joseph Warren, a patriot and soldier who fell at the Battle of Bunker Hill during the American Revolutionary War, it was incorporated in 1779. William Christmas platted and surveyed the streets and lots, and public squares that year. He established one hundred lots of one-half acre each, convenient streets and squares, and a common area for the use of the town.\nThe area was developed as tobacco and cotton plantations. Warrenton served as a regional center for trade and entertainment.\nMany early and mid-19th century houses have been preserved. The planters chartered private academies to educate their children, one of the earliest being The Warrenton Male Academy, formed in 1788. A girls' school was founded by Jacob Mordecai, a Sephardic Jew, whose son Moses became a prominent lawyer in Raleigh. Commercial and government structures in the town date to the late 19th century and early 1900s.\nIn the 1850s, the town became a busy center of commerce when the railroad was built to improve shipping of the commodities of the rich tobacco and cotton fields to markets; it became the wealthiest town in North Carolina of the time. The well-known builder Jacob Holt lived here; he built Greek Revival style houses throughout the region and his workshop supplied millwork to builders even farther afield.\nWarrenton became one of the wealthiest towns in North Carolina from 1840 to 1860, with property owners building fine residences and commercial buildings, forming the core of its current historic architecture. They employed the prominent architects Jacob W. Holt and Albert Gamaliel Jones, who designed and built houses in the Federal, Greek Revival, and Italianate styles.\nThe Warrenton Historic District was listed on the National Register of Historic Places in 1976, and includes over 200 contributing buildings.  The Coleman-White House, Elgin, Liberia School, Reedy Rill, Shady Oaks, Sledge-Hayley House, Mansfield Thornton House, and John Watson House are also listed on the National Register of Historic Places.\n}}\n2020 census\n{| class=\"wikitable\" style=\"text-align:right\"\n|+Warrenton racial composition\n!scope=\"col\"| Race\n!scope=\"col\"| Number\n!scope=\"col\"| Percentage\n|-\n!scope=\"row\"| White (non-Hispanic)\n| 400\n| 47.0%\n|-\n!scope=\"row\"| Black or African American (non-Hispanic)\n| 352\n| 41.36%\n|-\n!scope=\"row\"| Native American\n| 8\n| 0.94%\n|-\n!scope=\"row\"| Asian\n| 1\n| 0.12%\n|-\n!scope=\"row\"| Pacific Islander\n| 9\n| 1.06%\n|-\n!scope=\"row\"| Other/Mixed\n| 32\n| 3.76%\n|-\n!scope=\"row\"| Hispanic or Latino\n| 58\n| 6.82%\n|}\nAs of the 2020 United States census, there were 851 people, 555 households, and 256 families residing in the town.\nNotable people\n*Richard Alston, former NFL and CFL player\n*Josiah Bailey, Democratic U.S. Senator from 1931 to 1946\n*Braxton Bragg, senior officer in the Confederate States Army\n*George Freeman Bragg, African-American priest, journalist, social activist and historian\n*Thomas Bragg, the 34th Governor of the U.S. state of North Carolina from 1855 to 1859\n*Eleanor Kearny Carr, the wife of N.C. Governor Elias Carr\n*Saxby Chambliss, Republican U.S. Senator representing the state of Georgia from 2003 to 2015\n*John O. Crosby, American educator who served 1874 as the minister for the first Colored Baptist church in Warrenton\n*Micajah Thomas Hawkins, a U.S. Congressman from North Carolina from 1831 to 1841\n*David Henderson, former NBA player\n*Laura Montgomery Henderson (1867–1940), clubwoman; president, Alabama Federation of Women's Clubs\n*Rick Hendrick, businessman, NASCAR team owner\n*Jacob W. Holt, early to mid-19th century carpenter and builder-architect of Warrenton\n*John Adams Hyman, politician, state senator, and congressman; the first African American to represent North Carolina in the U.S. House of Representatives\n*Randy Jordan, former NFL player and current NFL coach\n*Caroline Katzenstein, suffragist and author\n*John H. Kerr, American jurist and politician\n*John H. Kerr Jr., served in the North Carolina State Legislature (both chambers)\n*John H. Kerr III, Democratic member of the North Carolina General Assembly\n*Rachel Mordecai Lazarus, American educator and correspondent with the children's writer Maria Edgeworth\n*Anne Carter Lee, daughter of Robert E. Lee, died in Warrenton\n*Nathaniel Macon, former U.S. Senator and Speaker of the House\n*Chandler Owen, writer and editor\n*William C. Rivers, US Army major general\n* Lucy Henderson Owen Robertson, academic and college president\n*Chuck Rowland, former MLB player\n*Mary Tannahill, painter, printmaker, embroiderer and batik maker\n*Corey Terry, American former professional football linebacker who played in the NFL for the Jacksonville Jaguars and New Orleans Saints from 1999 to 2000\n*Marvin Townes, American football running back\n*Panthea Twitty, photographer, ceramist, and historian\n*Sallie Duke Drake Twitty, teacher and principal\n*Joel Whitaker, ophthalmologist and college football player and coach\nReferences\nExternal links\n*[http://www.discoverwarrencounty.com Discover Warren County]\n*[http://www.ncgenweb.us/ncwarren/warrenton/toc.htm History of Warrenton]"
    }
  ]
}