{
  "content": [
    {
      "type": "text",
      "text": "# Warrant (film)\n\n| runtime        =\n| country        = India\n| language       = Hindi\n| budget         =\n}}\nWarrant is a 1975 Hindi-language action crime film directed by Pramod Chakravorty. It stars Dev Anand, Zeenat Aman, Dara Singh, Pran, Ajit in the pivotal roles. The soundtrack was composed by R. D. Burman. It was a box office hit.\nPlot\nDuring a jail riot instigated by jailed convict Jaggu, the life of the Jailor, Arun Mehra is threatened and another convict Dinesh, risks his life to save Arun. Arun and his mother, Mrs. Mehra find out that Dinesh is on death-row for killing noted Professor Ashok Verma. Arun does not believe that Dinesh is guilty and so he arranges his escape and as a result he has not only the police, including his very own father, Inspector General of Police Mehra after him on a manhunt, but also underworld don Master and his men; and a cold-hearted female assassin Rita who has reserved just two bullets in her gun for Arun and Dinesh.\nCast\n* Dev Anand as Jailor Arun Mehra\n* Zeenat Aman as Rita Verma\n* Dara Singh as Pyara Singh\n* Pran as IG Mehra\n* Ajit as Master\n* Sujit Kumar as Thomson\n* Madan Puri as Professor Ashok Verma / Ashok's Brother (Double Role)\n* Jagdish Raj as Inspector Sharma\n* Sulochana Latkar as Mrs. Mehra\n* Lalita Pawar as Rosie\n* Arpana Choudhary as Guddo\n* Seema Kapoor as Rekha\n* Satish Kaul as Dinesh\n* Jankidas as Das\nFacts\n* Pran who acts as father of Dev Anand here is only three years older than Dev Anand in real life; Pran was born in 1920 and Dev Anand in 1923.\n* Pran had also earlier acted as Dev Anand's older brother in the 1970 blockbuster film Johny Mera Naam.\n* While Dev Anand was born in 1923, the films' leading lady, Zeenat Aman (who was introduced in Bollywood by Dev Anand) was born in 1951, making her some 28 years his junior.\nSoundtrack\nAll the songs were composed by Rahul Dev Burman and lyrics were penned by Anand Bakshi.\n{| class=wikitable\n!#\n! Title\n! Singer(s)\n! Duration\n|-\n|1\n|\"Sun Bhai Baarati\"\n|Kishore Kumar\n|04:45\n|-\n|2\n|\"Ladi Najariya Ladi\"\n|Kishore Kumar, Lata Mangeshkar\n|04:59\n|-\n|3\n|\"Ruk Jana O Jana Humse\"\n|Kishore Kumar\n|03:38\n|-\n|4\n|\"Mein Tumse Mohabbat\"\n|Lata Mangeshkar\n|03:59\n|}\nReferences\nExternal links\n*"
    }
  ]
}