{
  "content": [
    {
      "type": "text",
      "text": "# Warren Hull\n\n| birth_place               = Gasport, New York, U.S.\n| death_date                =\n| death_place               = Waterbury, Connecticut, U.S.\n| resting_place             = North Cemetery\n| other_names               = J. Warren Hull\n| alma_mater                = New York UniversityEastman School of Music\n| occupation                = Actor, singer, radio and television personality\n| years_active              = 1923–1964\n| known_for                 =\n| spouse                    =\n*\n*\n*\n}}\n| partner                   =\n| children                  = 4\n}}\nJohn Warren Hull (January 17, 1903 – September 14, 1974), known professionally as Warren Hull, was an American actor, singer and television personality active from the 1930s through the 1960s. He was one of the most popular serial actors in the action-adventure field.\nEarly years\nBorn in Gasport, New York, Hull was one of three children born to John and Laura (nee Shafer) Hull. Both of his parents were Quakers. Hull attended Lockport High School, graduating in 1922. He then attended New York University with the intention of pursuing a career in business. He later decided to pursue a career in music and enrolled at the Eastman School of Music, where he studied voice. After completing his studies, he moved to New York City, where he became a chorus boy in Shubert operas and operettas. This eventually led to Hull working in two Broadway musicals; starring as Jack Negly in My Maryland (1927) and as Jack Wayne in Rain or Shine (1928).\nIn 1923, Hull began working as a radio announcer. He was the master of ceremonies for the first Your Hit Parade radio program and also worked as an announcer for The Beatrice Lillie Show.\nCareer\nFilms\nIn the mid-1930s, Hull pursued a screen career. He made his screen debut in 1934 for Educational Pictures, a short-subject studio. He co-starred opposite singer Sylvia Froos in the Young Romance series of musical comedies filmed in New York; Hull often joined Froos in song. In 1935 Hull was signed to a contract by Warner Bros., and spent the next few years playing leading men both in dramas and musicals.\nWhen his Warners contract expired, Hull had no trouble finding work at other studios. He teamed with Patricia Ellis, one of his leading ladies at Warners, for the Republic Pictures musical Rhythm in the Clouds (1937). He also played romantic leads in a string of features for Monogram Pictures. Two of Hull's better-known appearances of this period were opposite Boris Karloff, in The Walking Dead (1936) and Night Key (1937). Some of Hull's early appearances have him billed as \"J. Warren Hull.\"\nIn 1938, Columbia Pictures terminated its association with the Weiss Brothers, independent producers who had been making adventure serials for Columbia release, and decided to make its own cliffhangers. Warren Hull was signed for Columbia's second (and perhaps best) serial production, ''The Spider's Web (1938), based on a popular magazine character. Hull played three parts: criminologist Richard Wentworth, his masked-and-caped alter ego The Spider, and, in a second masquerade, lowlife mobster Blinky McQuade. The personable Hull brought a breezy sense of humor to his serial roles; he is probably the only serial hero who ever laughs'' on screen. Hull kept audiences following the Spider's thrilling exploits, making ''The Spider's Web the most popular and profitable serial of the year, outstripping such worthy cliffhangers as Buck Rogers and Dick Tracy Returns by a wide margin, according to a tally published in the Motion Picture Herald and The Film Daily''.\nPleased with Hull's performance, Columbia cast him as Mandrake the Magician in its 1939 serial. Universal Pictures starred the now-established serial hero in The Green Hornet Strikes Again! (1941) and Columbia put him back in the mask and cloak for The Spider Returns (1941).\nRadio and television\nIn the mid-1940s, Hull returned to radio announcing, appearing with frequency on such programs as Your Hit Parade and Vox Pop. During World War II, Hull traveled about the country and in Canada, putting on Vox Pop before servicemen at camps and bases. After the War, he did Vox Pop broadcasts from France, Britain, Alaska, and Puerto Rico. In 1947, he hosted The Warren Hull Show, for CBS radio. During this time, Hull also hosted Cavalcade of Bands for Dumont radio.\nIn 1948 he replaced Todd Russell as the host of the radio game show Strike It Rich. Hull continued as host when the show was adapted for television in 1951. This is the TV series for which Warren Hull is best known and he remained its host until the series ended in 1958.\nOn July 4, 1948, Hull debuted as emcee of a new show called Spin to Win, the second game show created by Mark Goodson and Bill Todman, in which he quizzed call-in contestants about popular records. If the contestant failed the initial questions, they could appoint someone in the live studio audience to take over. If the appointed stand-in player answered enough questions correctly, the call-in player could return for the final jackpot, either answering it alone (and keeping the entire jackpot for themself) or with their partner's help (and splitting the winnings). In 1953–54, former Miss America Bess Myerson co-hosted a game show called \"The Big Payoff\"; Hull occasionally substituted for regular co-host Robert Paige. During the next two decades he hosted TV programs such as Top Dollar, Beat the Odds, and Public Prosecutor. By the early 1960s, Hull was largely retired and was living in Virginia Beach, Virginia. In 1962, he came out of retirement to host the game show Who in the World.\nPersonal life\nHull was married four times and had four children. His first three marriages ended in divorce. His fourth marriage to Susan Fossum Stevens lasted until his death in 1974.\nDeath\nOn September 14, 1974, Hull died of congestive heart failure at Waterbury Hospital in Waterbury, Connecticut, at the age of 71. His funeral was held on September 18 at the Church of the Epiphany in Southbury, Connecticut, after which he was buried at the New North Cemetery in Woodbury, Litchfield County, Connecticut.\nFor his contributions to the radio and television industry, Warren Hull has two stars on the Hollywood Walk of Fame. His star for radio is located at 6270 Hollywood Boulevard, and the star for television is located at 6135 Hollywood Boulevard.\nFilmography\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n|rowspan=2 | 1935|| ''Personal Maid's Secret || Jimmy ||\n|-\n| Miss Pacific Fleet || Sgt. Tom Foster ||\n|-\n|rowspan=7 | 1936|| Freshman Love || Bob Wilson ||\n|-\n| The Walking Dead || Jimmy ||\n|-\n| The Law in Her Hands || Asst. Dist. Atty. Robert Mitchell ||\n|-\n| The Big Noise || Ken Mitchell ||\n|-\n| Bengal Tiger || Joe Larson ||\n|-\n| Love Begins at 20 || Jerry Wayne ||\n|-\n| Fugitive in the Sky || Terry Brewer ||\n|-\n|rowspan=6 | 1937|| Her Husband's Secretary'' || Barton 'Bart' Kingdon ||\n|-\n| Night Key || Jim Travers ||\n|-\n| ''Michael O'Halloran || Dr. Douglas Bruce ||\n|-\n| Rhythm in the Clouds || Bob McKay ||\n|-\n| Paradise Isle || Kennedy ||\n|-\n| A Bride for Henry || Henry Tuttle ||\n|-\n|rowspan=3 | 1938|| Hawaii Calls || Cmdr. Milburn ||\n|-\n| The Spider's Web || Richard Wentworth / The Spider / Blinky McQuade || Serial\n|-\n| Smashing the Spy Ring || Phil Dunlap ||\n|-\n|rowspan=5 | 1939|| Star Reporter || John Randolph / John Charles Benton ||\n|-\n| Mandrake the Magician || Mandrake the Magician || Serial\n|-\n| Should a Girl Marry? || Dr. Robert Benson ||\n|-\n| Girl from Rio || Steven Ward ||\n|-\n| Crashing Thru || Constable Kelly ||\n|-\n|rowspan=8 | 1940|| Yukon Flight || Bill Shipley ||\n|-\n| Hidden Enemy || Bill MacGregor ||\n|-\n| The Lone Wolf Meets a Lady || Bob Penyon ||\n|-\n| The Last Alarm || Frank Rogers ||\n|-\n| Marked Men || Bill Carver ||\n|-\n| Ride, Tenderfoot, Ride || Donald Gregory ||\n|-\n| Remedy for Riches || Tom Stewart ||\n|-\n| The Green Hornet Strikes Again! || Britt Reid / Green Hornet || Serial\n|-\n|rowspan=2 | 1941|| The Spider Returns || Richard Wentworth / The Spider / Blinky McQuade || Serial\n|-\n| Bowery Blitzkrieg'' || Tom Brady ||\n|}\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}