{
  "content": [
    {
      "type": "text",
      "text": "# Warrington Academy__disambig_2\n\n| other_name              =\n| former_name             =\n| type                    = Dissenting academy\n| religious_affiliation   =\n| established             =\n| founder                 =\n| closed                  =\n| local_authority         =\n| oversight               =\n| principal               =\n| head                    =\n| staff                   =\n| gender                  =\n| age_range               =\n| enrolment               =\n| capacity                =\n| campus_size             =\n| campus_type             =\n| houses                  =\n| colours                 =\n| accreditation           =\n| publication             =\n| newspaper               =\n| yearbook                =\n| affiliation             =\n| website                 =\n| footnotes               =\n}}\nWarrington Academy, active as a teaching establishment from 1756 to 1782, was a prominent dissenting academy, that is, a school or college set up by those who dissented from the established Church of England. It was located in Warrington (then part of Lancashire, now within Cheshire), a town about half-way between the rapidly industrialising Manchester and the burgeoning Atlantic port of Liverpool. Formally dissolved in 1786, the funds then remaining were applied to the founding of Manchester New College in Manchester, which was effectively the Warrington Academy's successor, and in time this led to the formation of Harris Manchester College, Oxford.\nA statue of Oliver Cromwell stands in front of the academy.\nHistory\nIt was called \"the cradle of Unitarianism\" by Arthur Aikin Brodribb writing in the Dictionary of National Biography, who went on to say that it \"formed during the twenty-nine years of its existence the centre of the liberal politics and the literary taste of the county of Lancashire\". It was planned in 1753, to replace other training schools in northern England having funding from the English Presbyterians: Caleb Rotheram of the Kendal academy died in 1752, and Ebenezer Latham of the Findern and Derby academy in 1754. It was not, however, formally constituted until June 1757, when funds had been raised by John Seddon of Warrington, associated with the Octagon Chapel, Liverpool. The first site was the Cairo Street Chapel; subsequently the building was a large red brick house.\nThree tutors were chosen initially: John Taylor taught divinity; John Holt,  natural philosophy (i.e. science); and John Aikin, classics. Henry Willoughby was the first president of the academy. Soon a fourth tutor was appointed. On the death of Dr. Taylor, in 1761, Aikin became tutor in divinity, and was succeeded in his old duties by Joseph Priestley. Among the other tutors who at some point joined the staff of the academy were Anna Barbauld (née Aikin), Johann Reinhold Forster, William Enfield, George Walker, Nicholas Clayton, and Gilbert Wakefield.\nThe academy hit difficulties, with falling rolls and financial problems leading to its closure in 1782. The disciplinary issues, coupled with unsettled debates over the principles of education, had led to a loss of confidence from the direction of the financial backers. It was formally dissolved in 1786, with the funds being divided in application to the successor Manchester Academy and the New College at Hackney, after a plan to amalgamate with the Daventry Academy of Thomas Belsham had come to nothing.\nBuildings\nIn 1981, the listed Academy building on Bridge Street was lifted from its foundations and moved 19&nbsp;m north. It was subsequently demolished and rebuilt with no original features retained.\nAlumni, staff, supporters\nWhen the academy was dissolved in 1786, 393 pupils, many of whom entered the legal and medical professions, had been on the books.\nPeople associated with it include:\n;Students\n* Thomas Barnes\n* William Bruce\n* John Prior Estlin\n* John Goodricke\n* Samuel Heywood\n* Thomas Malthus\n* Thomas Percival\n* Francis Peirson\n* Archibald Hamilton Rowan\n* John Simpson (Unitarian)\n* Georg Forster\n* William Vaughan\n;Staff\nIn addition to those mentioned above:\n* Joseph Priestley\n* Gilbert Wakefield\n* Anna Laetitia Barbauld and her brother John Aikin were the children of the tutor John Aikin\n* Johann Reinhold Forster\n;Financial supporters\n*Thomas Bentley, Trustee\n*William Russell\nNotes\nReferences\n* P. O'Brien, Warrington Academy 1757-86, its predecessors & successors. Wigan: Owl Books\n;Attribution\nExternal links\n* [http://dewey.library.upenn.edu/sceti/smith/imagedetail.cfm?PictureID=2350&position=8&keywords=priestley&subcoll= Photograph of Warrington Academy], Edgar Fahs Smith Collection Schoenberg Center for Electronic Texts and Image, Accessed 05/10/2006."
    }
  ]
}