{
  "content": [
    {
      "type": "text",
      "text": "# Warrior (Basquiat)\n\nWarrior is a painting created by American artist Jean-Michel Basquiat in 1982. It is interpreted as \"a semi-autobiographical work championing his creative vision as a black artist.\" In March 2021, the painting sold for $41.8 million at Christie's in Hong Kong, becoming the most expensive Western artwork sold at auction in Asia.\nHistory\nJean-Michel Basquiat painted Warrior in 1982, a milestone year in his career. He had his first individual American exhibition at the Annina Nosei Gallery in New York, and he became the youngest artist ever to take part in documenta in Kassel. Basquiat later recalled that he \"made the best paintings ever\" in 1982, which is considered his most valuable year.\nBasquiat painted Warrior on a wooden panel in his studio in the basement of the Annina Nosei Gallery. The painting depicts a commanding gladiator brandishing a sword, representing the eponymous warrior, on a backdrop of yellow and blue patches. It is reminiscent of Renaissance depictions of court knights such as Young Knight in a Landscape (1510) by Vittore Carpaccio.\nWarrior first appeared in an exhibition of his work at the Akira Ikeda Gallery in Tokyo in 1983. In the coming decades it traveled to exhibitions in Paris, Vienna, and Milan. It sold at Sotheby's for $1.8 million in 2005 and $5.6 million in 2007. In 2012, German-American real estate developer and art collector Aby Rosen purchased the painting for $8.7 million at Sotheby's. In March 2021, Warrior sold for $41.7 million at a live-streamed Christie's auction in Hong Kong, which set a new auction record for the highest price paid for a Western artwork in Asia.\nExhibitions\nWarrior has been exhibited at major art institutions worldwide, which include:\n* Jean-Michel Basquiat: Paintings at Akira Ikeda Gallery in Tokyo, November–December 1983.\n* Jean-Michel Basquiat at Galerie Enrico Navarra in Paris, April–June, 1996.\n* Jean-Michel Basquiat: 1980-1988 at Quintana Gallery in Coral Gables, December 1996–February 1997.\n* Jean-Michel Basquiat: Paintings and Works on Paper at Kunsthaus in Vienna, February–April 1999.\n* The Mugrabi Collection: Jean-Michel Basquiat at Museum Würth in Künzelsau, September 2001–January 2002.\n* The Jean-Michel Basquiat Show at Fondazione La Triennale in Milan, September 2006–January 2007.\n* Jean-Michel Basquiat at Gagosian Gallery in New York, February–April 2013.\n* Jean-Michel Basquiat at The Brant Foundation Art Study Center in New York, March–May 2019.\nSee also\n* List of paintings by Jean-Michel Basquiat\n* 1982 in art\nReferences"
    }
  ]
}