{
  "content": [
    {
      "type": "text",
      "text": "# Warrior (Kesha album)__disambig_1\n\n| recorded     = January–August 2012\n| studio       =\n| genre        = * Electropop\n* rock\n| length       =\n| label        = * Kemosabe\n* RCA\n| producer     = * Ammo\n* Benny Blanco\n* Billboard\n* Cirkut\n* Dr. Luke\n* Greg Kurstin\n* Kool Kojak\n* Matt Squire\n* Max Martin\n* Shellback\n* Stardeath and White Dwarfs\n* Steven Wolf\n* The Flaming Lips\n| prev_title   = I Am the Dance Commander + I Command You to Dance: The Remix Album\n| prev_year    = 2011\n| next_title   = Deconstructed\n| next_year    = 2012\n| misc         =\n}}\nWarrior is the second studio album by American singer and songwriter Kesha, released on November 30, 2012, by Kemosabe and RCA Records. Its music incorporates a wide range of genres, including pop, EDM, rock, punk, rap, country, and folk. Kesha described the album as more personal than her previous material in addition to mentioning it was her attempt at reviving the rock genre, calling it a \"cock pop\" record. Its theme is said to be magic. Writing for Warrior began in late 2011 and ended in early 2012, with recording taking place from January through August 2012. Kesha wrote the majority of the album while touring internationally and during her spiritual journey.\nContributions to the album's production came from longtime collaborators Dr. Luke (who was also the executive producer of the project), Max Martin, Shellback, Ammo and Benny Blanco. It features guest vocals from American rock singer Iggy Pop, who has been cited as a major influence on the album, as well as writing contributions from Nate Ruess from American indie rock trio Fun, American rapper will.i.am, American singer-songwriter Bonnie McKee, the Black Keys drummer Patrick Carney, American rock bands the Strokes and the Flaming Lips and Kesha's own mother, Pebe Sebert.\nThe album's lead single \"Die Young\" achieved commercial success, peaking at number two on the Billboard Hot 100 chart in the United States, while also charting in multiple countries worldwide. \"C'Mon\" initially served as a promotional single and peaked at number 27 in the US after its release as the album's second single. An acoustic extended play (EP), Deconstructed (2012), was released exclusively through Kesha's website to promote the fan edition of the album and features rerecorded songs from her previous releases as well as a cover of \"Old Flames Can't Hold a Candle to You\" (1980) by American country recording artist Dolly Parton and cowritten by Kesha's mother, Pebe. \"Crazy Kids\" was released as the third and final single from Warrior. In total, the album spawned three Top 40 hits in the US, Canada, and Australia.\nUpon its release, Warrior received generally favorable reviews from music critics, who commended its rock-influenced material, lyrical content, and collaborations, whilst others criticized its use of Auto-Tune and formulaic content. The album reached number six on the Billboard 200 albums chart in the United States, while also charting in Australia, Canada, Japan, the United Kingdom, and other countries. The album has been certified Platinum by the Recording Industry Association of America (RIAA). To promote the album, Kesha embarked on two concert tours: the first was the North American Tour 2013, coheadlined with American rapper Pitbull, and the second one was the Warrior Tour (2013–2015).\nBackground\nIn June 2010, Kesha discussed her second studio album with MTV News. During the interview she revealed that she was already beginning to think about her second album and explained that it was going to differ from her first record, specifically commenting that it would reflect her growth: \"There's definitely going to be a difference. I'm always changing and evolving and because I write all of my own music it will be reflective of the record. It'll still stay fun and young and irreverent.\" After the release of her first album Kesha embarked on her first worldwide tour, the Get Sleazy Tour throughout 2011. While touring she began writing songs for her second album but recording and other work on the album was not commenced until she had completed the tour. The album was slated for a release in late 2011 but got delayed. It was then slated for a May 2012 release but ultimately got delayed again due to Kesha still recording songs.\nIn 2011, the singer took a hiatus from music to embark on other ventures. She was hired by the Humane Society and became their first global ambassador, which consumed her time as she made a documentary for National Geographic that revolved around \"animals being abused and how to stop that, or animals that are going extinct and how to help those animals\". The album includes a variety of different musical participants, which was explained by the singer: \"The range of artists I want to work with is so vast it's bizarre. If someone is a real artist, you can't confine them to a particular genre. It's my mission to make it all make sense somehow.\" Along with expanding her collaborations, the singer expanded her musical repertoire, as she began playing the guitar significantly more with the plans of incorporating it into her new material. In February 2012, while being interviewed by Glamour, Kesha stated that while she was currently in the process of writing songs for her album, she was also taking a variety of instrument lessons, emphasizing specifically that she was taking guitar lessons. In the years since, Kesha alluded to a disdain for the record due to her limited creative control while making it. During an Instagram live on July 5, 2024, she seemingly references the album, saying, \"I don't hate any of my albums; there's just one album that's not my favorite child.\". However, in 2025, she claimed to have fallen back in love with the album after listening to it again with some distance.\nTitle and concept\nIn March 2011, Kesha revealed in an interview with Beatweek Magazine that she had already chosen the title for the record, naming it Spandex on the Distant Horizon. However, in a publication in May 2012, Billboard stated that the project was untitled. The album's underlying theme stems around embracing a person's inner warrior, which the singer elaborated on: \"I've seen how many people my music can reach, and I've realized that I have somewhat of a social responsibility to make sure everything I say is positive. The underlying theme of this next record is warrior, with the positive message being that everyone has a warrior inside.\" On September 18, 2012, via her Twitter and Instagram accounts, Kesha began announcing letters, believed to be from the title of the album, alluding to the name of the album title, Warrior. This was later confirmed when she tweeted the release date of the album.\nProduction\nKesha worked with Lukasz Gottwald and Max Martin on a variety of tracks. She also expressed interest in enlisting the production duo, the Dust Brothers, who are known for producing tracks for the Rolling Stones, the Beastie Boys and Beck, however no recording dates were ever penned. Her friend Paul Nicholls, a DJ, was also named as a potential participant in construction of the album. However, no recording dates with him have been recorded either. According to MTV, Kesha entered the studio with Luke in January 2012. Both Kesha and Luke had been working on material for the upcoming project separately but had yet to start studio sessions prior to January. Kesha reported via Twitter in March 2012 she was in the midst of recording the album with Luke and Benny Blanco. In the recording studio together, they created a track described by the singer as a \"cock-pop\" influenced song. This track was revealed to be \"Thinking of You\".\nof American rock band the Flaming Lips contributed to the album after learning Kesha was a fan of his work and after she worked on his band's album Flaming Lips and Heady Fwends (2012).]]\nWayne Coyne from the Flaming Lips first expressed interest in working with Kesha in January 2012. Coyne said he knew she was a fan of his work and felt that a collaboration between the two would be a \"perfect match\". The duo reportedly collaborated at the Lips' studio in January 2012. A track called \"2012\" was created during a February recording session in Nashville and was released on the Lips' album, The Flaming Lips and Heady Fwends. In March 2012, Coyne told Rolling Stone that he was in the development stages of talking to Kesha about working with her on her new material. Along with \"2012\", Wayne and Kesha's first collaboration created three other songs, all of which belonged to Kesha. Coyne was later asked if he still intended to contribute to her album he responded, stating: \"I'm trying to. I think we're getting together right before Easter. We've already done three songs-- they're hers\". According to Twitter messages by Coyne, recording between the duo continued in April 2012 and a track that discussed \"futuristic sex toys\" was created. Coyne and Kesha revealed via Twitter that a song titled \"You Control My Heart\" was created. Coyne announced that he was in the process of mixing the song. \"Past Lives\", a track described by Coyne as a \"stellar track\" was confirmed to be another collaboration between the pair. Altogether, Coyne and Kesha's collaboration yielded between six and seven tracks.\nIn mid April 2012, Billboard published an article claiming that Scottish producer Calvin Harris had contributed several tracks to the upcoming album. Their specific recording date was unknown. In May 2012, Kesha continued to record with Dr. Luke and artist Sia, although this track did not make the final track listing. Rock singer Iggy Pop was also revealed as a collaborator, when the singer tweeted a picture in May 2012 saying that the singer would feature on the record. Billboard later confirmed Iggy Pop would feature on \"Dirty Love\", produced by Dr. Luke. Kesha continued to work with Dr Luke and Benny Blanco, and with new collaborators Henry Walter and Fun. lead singer Nate Ruess – the four created a track described by Blanco as \"old hippie rock\". That track was later revealed as \"Die Young\". Kesha revealed that she and Dr Luke had created 17 incomplete songs, including \"Last Goodbye\", \"Die Young\" and \"Supernatural\". She commented on the sound, \"I want it to be a mix of what works on the radio and what I listen to in my spare time\", she says. \"I'm on a steady diet of T. Rex and Iggy Pop.\"\nComposition\n's debut solo album The Idiot (1977), was cited as one of the album's main musical influences when Kesha was constructing the album's sound.]]\nIn contrast to her debut album Animal (2010), Kesha stated her second album would also incorporate rock genres, inspired from the music of the 1970s. 1970s rock singers Led Zeppelin, AC/DC and Iggy Pop's album, The Idiot, were cited as musical inspirations for the next record. Kesha stated in press that she intended to incorporate a confluence of genres, including blues music, saying, \"I definitely want the next record to be experimental and I would love to play with all the different sounds of the music I listen to. I really want some dirty guitar and I wouldn't mind if there were elements of blues.\" On her first record Kesha imposed a restriction on her producers limiting their use of guitars. To encompass \"visceral\" energy on the record she lifted this restriction and instead has chosen to focus on the inclusion of guitars to try and capture the sound of the 1970s and '80s. Commenting on the album before its release, she said: \"Some people will be shocked [by it]. Some will also be excited to know that I don't just do silly white-girl rap. I'm from the South, I have a lot of soul. But trust me—it's not going to be some avant-garde jazz record. I innately write pop songs. That's just what I do.\"\nKesha began recording the album in 2011, after traveling the world; she went on a spiritual journey. Recalling experiences of feeding baby lions and swimming with great white sharks, Kesha said, \"I got hypnotized, and I just really wanted this record to be really positive, really raw, really vulnerable and about the magic of life.\" \"Supernatural\" contains dubstep elements and explores erotic experiences Kesha encountered with ghosts. The track \"Dirty Love\" was inspired by Iggy Pop's music and draws from garage rock and punk rock. \"Wonderland\" is a country rock song that explores Kesha's past with her broke friends. The tracks \"Wherever You Are\", \"Die Young\", \"C'Mon\" all contain elements of technopop, whereas tracks like \"Only Wanna Dance With You\" and \"Gold Trans Am\" draw from electronic rock. \"C'Mon\" and \"Crazy Kids\" are electronic rap songs. Overall, Kesha said the theme of Warrior is magic. She further explained the main inspiration behind the album's change of sound:\n\"I feel like I don't necessarily agree, but people say that rock and roll is dead, and it is my mission and my goal to resurrect it in the form of my pop music, [...] that's the goal. We'll see what happens. That's a very ambitious and lofty goal, but that's my goal.\"\nSongs and lyrics\nKesha has said the songs are inspired by her experiences during her tours. In contrast to her first record which featured music described by the singer as \"very brash and very sassy and very unapologetic and irreverent\", she says the second album makes a lyrical departure and explores a more vulnerable side in its lyrics. She explained: \"I have learned over the past three years of doing this that being vulnerable doesn't mean you're weak. I very much want to be seen as a strong woman, but I realize that vulnerability can also be a strength. So on my next record, you are going to hear probably a little more of that.\" Kesha commented, in an interview with Rolling Stone, \"The first two records talked more about partying, which is a great, magical part of life, but some songs on the new record are more personal and vulnerable. And you can hear more of the music I listen to when I'm lying in my bed. I'm not claiming that it's a rock record – but as long as it's fucking good, you can call it whatever you want.\" Co-written by her mother, Pebe Sebert, the song titled \"Gold Trans Am\" doubles as a metaphor for her vagina and alludes to her actual automobile. Of the song, Kesha said: \"It began as a song about my car, which is a gold Trans Am, and it works about 40 per cent of the time. I don't have another car because I love that one so much. But then like all great pop it became a metaphor for something else – my pussy.\"\n\"C'Mon\", the second single, serves as one of the album's many pop rap songs. In it, Kesha raps: \"Saw you leaning against that old record machine/ Saw the name of your band written on the marquee/ It's a full moon tonight so we gettin' rowdy/ Yeah, we gettin' rowdy, get-get-gettin' rowdy\". Billboard called \"C'Mon\" a YOLO dance jam about taking hookups from the dance floor to the bedroom,\" adding that the lyrics were on par with Kesha's \"Your Love is My Drug\" fecklessly juvenile attitude. A ballad, \"Love into the Light\", depicts Kesha at her most vulnerable, beginning with a string of confessions and culminating in a hopeful anti-bullying anthem. Billboard praised the song for contrasting Kesha's trademark \"glitter and Auto-Tune\" persona, before highlighting \"Past Lives\" as the album's best track lyrically. \"Last Goodbye\" tributes Neil Young's \"For the Turnstiles\", while \"Only Wanna Dance With You\" received accolades for being a collaboration with members of the Strokes' music.\nMarketing\nThe album was tentatively due to be released in May 2012, but was later announced with an official release date of December 4, 2012. It was originally expected to be released near the end of 2011 but the delay between albums was because Kesha wanted to try to make an album that could shift the sound of pop music into a more rock direction. While being interviewed by the Calgary Herald she explained the delay and elaborated on this, stating: \"I want to take enough time to make sure it's the reinvention of pop music. That's the ultimate goal, to reinvent pop music. So I'm planning on taking as much time as I need, but May sounds about right.\"\nTouring\nIn the summer of 2013, Kesha embarked on a co-headlined tour with Pitbull. The tour, North American Tour 2013, travelled across North America, hitting venues in the United States and Canada. Since the joint tour did not cover any places outside of the US and Canada, Kesha decided to extend her tour and add more dates in other countries. The Warrior Tour covers many places in Europe, venues throughout the US, and select places in Asia. Many of the dates are parts of festivals and fairs such as Live at the Marquee Festival in Cork, Ireland, the Wireless Festival in London, England, and the Illinois State Fair in Springfield, Illinois. Before the main tour, Kesha performed many promotional tour dates throughout late 2012 and early 2013.  Those dates include stadium and TV concerts in Europe, America, Australia, and Asia in August, October, and November 2012, music festival performances in America in December 2012, more TV concerts, special music festival performances, and normal concerts in January, and February 2013 in Asia and America.\nPromotional Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:150px;\"| Date\n! style=\"width:150px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:250px;\"| Venue\n|- style=\"background:#ddd;\"\n| colspan=\"7\" style=\"text-align:center;\"| Asia\n|-\n|August 18, 2012\n|Tokyo\n|rowspan=\"3\"|Japan\n|QVC Marine Field\n|-\n|August 19, 2012\n|Osaka\n|Maishima Summer Sonic Site\n|-\n|August 21, 2012\n|Tokyo\n|Studio Coast\n|- style=\"background:#ddd;\"\n| colspan=\"7\" style=\"text-align:center;\"| Australia\n|-\n|November 6, 2012\n|rowspan=\"2\"|Sydney\n|rowspan=\"2\"|Australia\n|UNSW Roundhouse\n|-\n|November 7, 2012\n|Seven News Centre\n|- style=\"background:#ddd;\"\n| colspan=\"7\" style=\"text-align:center;\"| North America\n|-\n|November 17, 2012\n|Los Angeles\n|rowspan=\"2\"|United States\n|Nokia Theatre L.A. Live\n|-\n|November 20, 2012\n|New York City\n|Times Square\n|- style=\"background:#ddd;\"\n| colspan=\"7\" style=\"text-align:center;\"| Europe\n|-\n|November 30, 2012\n|Stad\n|Sweden\n|Sweden XFactor Lot\n|-\n|December 1, 2012\n|London\n|England\n|London Studios\n|- style=\"background:#ddd;\"\n| colspan=\"7\" style=\"text-align:center;\"| North America\n|-\n|December 3, 2012\n|Los Angeles\n|rowspan=\"10\"|United States\n|Nokia Theatre L.A. Live\n|-\n|December 4, 2012\n|Burbank\n|Warners Brothers Studios\n|-\n|December 6, 2012\n|Los Angeles\n|The X Factor Cbs Studio 36\n|-\n|December 8, 2012\n|Tampa, Florida\n|Tampa Bay Times Forum\n|-\n|December 11, 2012\n|Fairfax\n|Patriot Center\n|-\n|December 12, 2012\n|Atlanta\n|Philips Arena\n|-\n|January 1, 2013\n|New York City\n|Times Square\n|-\n|January 10, 2013\n|Las Vegas\n|Haze Night Club\n|-\n|January 21, 2013\n|Washington DC\n|930 Club\n|-\n|January 26, 2013\n|Park City\n|Park City Live\n|- style=\"background:#ddd;\"\n| colspan=\"7\" style=\"text-align:center;\"| Asia\n|-\n|February 4, 2013\n|Tokyo\n||Japan\n|Harajuku Astro Hall\n|}\nSingles\nThe album's lead single, \"Die Young\" was released on September 25, 2012. The track was soon uploaded to Kesha's BMI following the Kesha's announcement of the single, and was co-written by Fun. lead singer Nate Ruess. Co-producer Benny Blanco described the track as \"old hippie rock\", while Kesha described the track as \"her favourite of the album\". A 35-second music video teaser was uploaded on September 12, 2012, onto her YouTube page. A second 29-second snippet, featuring Kesha's vocals, was uploaded on September 17, 2012. The same day, Kesha published the single's artwork onto her Twitter. The song premiered and impacted US radio on September 25, 2012. It was released in Europe on November 18, 2012, and the United Kingdom on November 25, 2012, debuting in the UK at 10. The music video for the song premiered on November 8, 2012.\n\"C'Mon\", which was previously released as the album's first promotional single, was also released as the official second single from the album. It officially impacted U.S. mainstream radio in January 2013 and peaked at 27 on the US Billboard Hot 100, ultimately ending Kesha's string of consecutive top 10 hits. It was further released in the United Kingdom on March 3, 2013, and peaked at number 70 on the UK Singles Chart. The official lyric video was released on December 7, 2012, followed by an official music video on January 11, 2013.\n\"Crazy Kids\" was released as the third single from Warrior. The song was released in a remixed form and features a guest verse by will.i.am, who is listed as one of the writers on the original solo version of the song. It officially impacted contemporary hit radio on April 29, 2013, and rhythmic contemporary radio on May 7, 2013. Crazy Kids peaked at number 40 on the Billboard Hot 100 and Number 19 on Mainstream Top 40 becoming Kesha's least successful single at the time. Crazy Kids also charted within Australia, United Kingdom, Belgium, South Korea, Canada, and others. It was made available for purchase as a digital download on April 30, 2013. The official music video for this version debuted on May 30, 2013. There are also two other official remixes: One featuring rapper Pitbull and one featuring rapper Juicy J. In May 2013, the Juicy J remix reached U.S. rhythmic airplay and became available for purchase through digital venues.\nAlthough not released as a single, \"Dirty Love\" (featuring Iggy Pop) was released to Kesha's YouTube channel, with an accompanying music video, on New Year's Eve 2013. \"Dirty Love\", alongside all of the non-single tracks on the album, outside of \"Only Wanna Dance with You\" and \"Love Into the Light\", would also chart.\nCritical reception\n| rev1 = AllMusic\n| rev1Score =\n| rev2 = The A.V. Club\n| rev2Score = B\n| rev3 = Entertainment Weekly\n| rev3Score = B\n| rev4 = The Guardian\n| rev4score =\n| rev5 = Los Angeles Times\n| rev5Score =\n| rev6 = PopMatters\n| rev6Score =\n| rev7 = Rolling Stone\n| rev7Score =\n| rev8 = Slant Magazine\n| rev8Score =\n| rev9 = Spin\n| rev9Score = 7/10\n| rev10 = USA Today\n| rev10Score =\n}}\nWarrior received mostly positive reviews from music critics. On Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album received an average score of 71 based on 19 reviews, indicating \"generally favorable reviews\". Melissa Maerz of Entertainment Weekly gave it a positive review, graded it with a (B) and said: \"Ke$ha's filthy jokes may be what separates her from her peers who practice ghost abstinence.\" Drowned in Sound rated the album as eight-out-of-ten, called it \"a party album on a mission\" and mentioned: \"Warrior is never dull, always fun, and frequently a thrillingly unpredictable ride.\" BBC Music reviewer Nick Levine, was also positive on the album and wrote: \"Taken as a whole, this is another surprisingly enjoyable album from a pop singer who has managed to broaden her approach without losing her USP.\"\nSlant Magazine gave a mixed review to the album, rated it as three-stars-out-of-five and said: \"Most of Warrior sticks to Ke$ha's tried-and-true formula.\" The Guardian reviewer went more critical on the record, blaming the artist for \"decided not to fix what ain't broke\", rated it two-stars-out-of-five and said: \"auto-Tune, deployed all over the record, turns Kesha's voice into a robo-squawk, and not in a good way\". However, Elysa Gardner of USA Today felt that the release was \"full of catchy, cannily produced tunes that promote self-indulgence as if it were a civil right, and either shrug off or embrace the risks posed by living in the moment\".\nStephen Thomas Erlewine of AllMusic went deeper to the album and praised the artist for picking up the best direction for her sophomore set, gave it four-stars-out-of-five and said: \"It's a wall-to-wall party for the freaks, burnouts, outcasts, and misfits and if you don't get it that's your fault, not hers.\" New York Times reviewers were also positive on the album and linked the influences to \"drinking, sex, swearing, hard nights at the club\" and confessed that \"furtive surprise at the center of her project is sweetness, as it always was\", suggesting that she can be a country star with \"an option for her in five years or so, when she turns 30\" and described the whole record as: \"no revelation here, only strong fun\".\nCommercial performance\nIn the United States, Warrior debuted at number six on the Billboard 200, selling 86,000 copies in its first week. The album underperformed compared to her debut LP, Animal, which debuted at number one and sold 152,000 copies in its first week. In 2024, the album received a Platinum certification in the United States by the Recording Industry Association of America (RIAA) for sales in excess of 1 million album-equivalent units. The album debuted at number 66 on the UK Albums Chart and peaked at number 60.\n\"Die Young,\" the album's lead single, was an international hit, peaking at number 2 on the Hot 100. The single dropped down to number 4, suffering massive airplay and sales cuts after the Sandy Hook Elementary School shooting caused the lyrics to be negatively interpreted by critics. Second single \"C'Mon\" debuted at number 99 on the Hot 100, peaking at 27 ending Kesha's string of top-ten hits that had accumulated since her debut single \"Tik Tok\". \"Crazy Kids\" was released as the third single off Warrior and it charted in a number of countries including the United States, Australia, United Kingdom, South Korea, and others. \"Thinking of You\" and \"Warrior\" sold less well, rising only to the Bubbling Under Hot 100 Singles chart.\nTrack listing\nCredits adapted from the liner notes of Warrior.\n| extra1       =\n}}\n| length1      = 4:00\n| title2       = Die Young\n| writer2      =\n| extra2       =\n| length2      = 3:32\n| title3       = C'Mon\n| writer3      =\n| extra3       =\n}}\n| length3      = 3:34\n| title4       = Thinking of You\n| writer4      =\n| extra4       =\n}}\n| length4      = 3:04\n| title5       = Crazy Kids\n| writer5      =\n| extra5       =\n| length5      = 3:50\n| title6       = Wherever You Are\n| writer6      =\n| extra6       =\n| length6      = 3:58\n| title7       = Dirty Love\n| note7        = featuring Iggy Pop\n| writer7      =\n| extra7       =\n| length7      = 2:44\n| title8       = Wonderland\n| writer8      =\n| extra8       =\n}}\n| length8      = 3:42\n| title9       = Only Wanna Dance with You\n| writer9      =\n| extra9       =\n}}\n| length9      = 3:31\n| title10      = Supernatural\n| writer10     =\n| extra10      =\n| length10     = 4:10\n| title11      = All That Matters (The Beautiful Life)\n| writer11     =\n| extra11      =\n| length11     = 3:37\n| title12      = Love into the Light\n| writer12     = K. Sebert\n| extra12      = Greg Kurstin\n| length12     = 4:46\n| total_length = 44:27\n}}\n| extra_column  = Producer(s)\n| title17       = Die Young\n| note17        = Dallas K extended mix\n| writer17      =\n| extra17       =\n| length17      = 5:49\n| title18       = Die Young\n| note18        = My Digital Enemy remix\n| writer18      =\n| extra18       =\n| length18      = 5:46\n| title19       = Die Young\n| note19        = remix; featuring Juicy J, Wiz Khalifa and Becky G\n| writer19      =\n| extra19       =\n| length19      = 4:03\n| total_length  = 74:21\n}}\n| extra_column  = Producer(s)\n| title20       = Old Flames Can't Hold a Candle to You\n| note20        = Deconstructed mix\n| writer20      =\n| extra20       =\n| length20      = 3:40\n| title21       = Blow\n| note21        = Deconstructed mix\n| writer21      =\n| extra21       = Kurstin\n| length21      = 3:12\n| title22       = The Harold Song\n| note22        = Deconstructed mix\n| writer22      =\n| extra22       =\n| length22      = 4:55\n| title23       = Die Young\n| note23        = Deconstructed mix\n| writer23      =\n| extra23       = Kurstin\n| length23      = 3:22\n| title24       = Supernatural\n| note24        = Deconstructed mix\n| writer24      =\n| extra24       =\n| length24      = 4:27\n| total_length  = 93:17\n}}\n| extra_column  = Producer(s)\n| title1        = Old Flames Can't Hold a Candle to You\n| note1         = Deconstructed mix\n| writer1       =\n| extra1        =\n| length1       = 3:40\n| title2        = Blow\n| note2         = Deconstructed mix\n| writer2       =\n| extra2        = Kurstin\n| length2       = 3:12\n| title3        = The Harold Song\n| note3         = Deconstructed mix\n| writer3       =\n| extra3        =\n| length3       = 4:55\n| title4        = Die Young\n| note4         = Deconstructed mix\n| writer4       =\n| extra4        = Kurstin\n| length4       = 3:22\n| title5        = Supernatural\n| note5         = Deconstructed mix\n| writer5       =\n| extra5        =\n| length5       = 4:27\n| total_length  = 18:56\n}}\n;Notes\n*  signifies a vocal record producer\n*  signifies an additional record producer\n*\"Supernatural\" contains a portion of the composition \"Wouldn't It Be Good\" (1984), written and performed by Nik Kershaw, published by Irving Music (BMI).\n*\"Only Wanna Dance with You\" contains a sample of \"Last Nite\" (2001), written by Julian Casablancas and performed by the Strokes.\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Weekly chart performance for Warrior\n! scope=\"col\" | Chart (2012)\n! scope=\"col\" | Peakposition\n|-\n! scope=\"row\"| Australian Albums (ARIA)\n| 12\n|-\n! scope=\"row\"| Austrian Albums (Ö3 Austria)\n| 44\n|-\n|-\n|-\n|-\n|-\n|-\n! scope=\"row\"| French Albums (SNEP)\n| 156\n|-\n|-\n|-\n! scope=\"row\"| Irish Albums (IRMA)\n| 64\n|-\n! scope=\"row\"| Italian Albums (FIMI)\n| 79\n|-\n! scope=\"row\" | Japanese Albums (Oricon)\n| 17\n|-\n! scope=\"row\"| Japanese Top Album Sales (Billboard)\n| 20\n|-\n! scope=\"row\"| New Zealand Albums (RMNZ)\n| 30\n|-\n|-\n|-\n|-\n! scope=\"row\"| South Korean Albums (Circle)Deluxe edition\n| 17\n|-\n! scope=\"row\"| South Korean Albums (Circle)\n| 24\n|-\n! scope=\"row\"| South Korean International Albums (Circle)Deluxe edition\n| 1\n|-\n! scope=\"row\"| South Korean International Albums (Circle)\n| 4\n|-\n! scope=\"row\"| Spanish Albums (PROMUSICAE)\n| 50\n|-\n! scope=\"row\"| Swiss Albums (Schweizer Hitparade)\n| 63\n|-\n! scope=\"row\"| Taiwan International Albums (G-Music)\n| 10\n|-\n! scope=\"row\"| UK Albums (OCC)\n| 60\n|-\n|-\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|+ Year-end chart performance for Warrior\n! scope=\"col\" | Chart (2013)\n! scope=\"col\" | Position\n|-\n!scope=\"row\"| US Billboard 200\n| 92\n|}\nCertifications\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|+ Release dates and formats for Warrior\n|-\n! scope=\"col\" | Region\n! scope=\"col\" | Date\n! scope=\"col\" | Format(s)\n! scope=\"col\" | Edition(s)\n! scope=\"col\" | Label(s)\n! scope=\"col\" |\n|-\n! scope=\"row\" | Australia\n| rowspan=\"2\" | November 30, 2012\n| rowspan=\"4\" |\n| rowspan=\"3\" |\n| rowspan=\"3\" | Sony Music\n| align=\"center\" |\n|-\n! scope=\"row\" | New Zealand\n| align=\"center\" |\n|-\n! scope=\"row\" | United Kingdom\n| December 3, 2012\n| align=\"center\" |\n|-\n! scope=\"row\" | United States\n| December 4, 2012\n|\n|\n| align=\"center\" |\n|-\n! scope=\"row\" | Philippines\n| December 7, 2012\n| rowspan=\"2\" | CD\n| Deluxe\n| Ivory\n| align=\"center\" |\n|-\n! scope=\"row\" | Japan\n| January 30, 2013\n| Limited deluxe\n| rowspan=\"2\" | Sony Music\n| align=\"center\" |\n|-\n! scope=\"row\" | Various\n| 2022\n| Vinyl\n| Expanded\n| align=\"center\" |\n|}\nDeconstructed EP\nDeconstructed EP is the second extended play (EP) by Kesha, released digitally on November 30, 2012, alongside the album Warrior. The EP was also released as a bonus disc with the fan edition of the album, available only through her website in the United States. Deconstructed contains five tracks, four of which are new versions of Kesha's previous songs, and one being a cover of Dolly Parton's \"Old Flames Can't Hold a Candle to You\" (1980), co-written by Kesha's mother, Pebe Sebert.\nThe EP's version of \"Die Young\" (2012) has been described as a form of relaxed psychedelic pop. The new mix of \"The Harold Song\" (2010) includes relaxed vocals with a sawtooth wave bass synthesizer side-chained to a kick drum over a piano synth. Also included in the release are the techno-based mixes of \"Blow\" (2011) and \"Supernatural\" (2012). This version of \"Supernatural\" and \"Old Flames Can't Hold a Candle to You\" were released through Kesha's promotional scavenger hunt for Warrior on her website on November 30, 2012. Prior to this, the new mix of \"Die Young\" was released through Kesha's YouTube account and as a promotional digital download on November 23, 2012.\nTrack listing\n| extra1        =\n| length1       = 3:40\n| title2        = Blow\n| writer2       =\n| extra2        = Kurstin\n| length2       = 3:12\n| title3        = The Harold Song\n| writer3       =\n| extra3        =\n| length3       = 4:55\n| title4        = Die Young\n| writer4       =\n| extra4        = Kurstin\n| length4       = 3:22\n| title5        = Supernatural\n| writer5       =\n| extra5        =\n| length5       = 4:27\n}}\nReferences"
    }
  ]
}