{
  "content": [
    {
      "type": "text",
      "text": "# Warren Boland\n\n|birth_place    = Sydney, New South Wales, Australia\n|height         =\n|weight =\n|position       =\n|club1          = Balmain\n|year1start     = 1976\n|year1end       = 78\n|appearances1   = 22\n|tries1         = 2\n|goals1         = 0\n|fieldgoals1    = 0\n|points1        = 6\n|club2          = Western Suburbs\n|year2start     = 1979\n|year2end       = 83\n|appearances2   = 97\n|tries2         = 28\n|goals2         = 0\n|fieldgoals2    = 0\n|points2        = 90\n|updated        =  3 July 2009\n|source         =  [http://stats.rleague.com/rl/scorers/players/Warren_Boland.html Rugby League Statistics]\n}}\nWarren James Boland (born 11 February 1955, in Sydney) is an Australian former science teacher and professional footballer (rugby league) with the Western Suburbs Magpies & Balmain Tigers. He presented weekend radio shows called \"Weekends with Warren\" on ABC Local Radio stations across Queensland, Australia, broadcasting from the studios of 612 ABC Brisbane. Boland's radio broadcasts could be heard from 9am–midday (10am–midday outside Brisbane) on Saturdays and from 10am–midday on Sundays. Warren's contract at 612ABC was not renewed at the end of 2013 and he was replaced in the lineup.\nRugby league career\nA halfback in high school, Boland recalled being rejected due to his small stature. \"After I had gone to try out for the school side in Year 11, I was told to go away and grow some more,\" he said.\nBoland won an under-23s premiership with St George before travelling overseas in 1975. Upon his return to Australia, he signed for the Balmain Tigers and was a member of the Tigers' Amco Cup-winning side in 1976. From 1979, he played five seasons with the Western Suburbs Magpies. He often captained the side from his position of , including in the 1980 semi-final campaign.\nA broken leg suffered in the 1981 pre-season saw some questioning whether his career was over, but he returned to first grade in late July. He was again captaining the side in the 1982 semi-finals appearance, before retiring in 1983 at the relatively young age of 28. He was later named as winger and captain of Western Suburbs Magpies Team of the Eighties.\nWarren Boland was considered an anomaly in the tough Western Suburbs teams of his time which had a strong reputation as being working class \"battlers\" and included such players as Tommy Raudonikis, Les Boyd and John \"Dallas\" Donnelly. He was described as, \"well-educated, articulate, ambitious, and deeply concerned with social issues.\" An arts graduate of Macquarie University, Boland hosted a \"social issues\" radio show on 2SM during his time as a player.\nMedia\nDuring the late 1980s and early 1990s, Warren Boland commentated on the ABC-TV's Saturday afternoon New South Wales Rugby League / Australian Rugby League matches, generally alongside co-caller David Morrow until becoming chief caller in 1990 with Morrow's move to Channel 10. He also commentated with fellow ex-players David Wright, John Peard and Arthur Beetson, as well as Debbie Spillane. Boland also covered the 1990 Kangaroo Tour of Great Britain and France for the ABC, calling the two tests the Australian Kangaroos played against France on the French leg of the tour.\nFollowing this, he worked for Fox Sports in 1997–98. During the football season these days, he co-hosts the ABC-TV coverage of Queensland Cup rugby league matches. These telecasts are broadcast within Queensland on ABC-TV and across Australia on both Fox Sports and digital channel ABC2 (free-to-air channel 21, pay TV channel 126). In addition to rugby league, Boland has also commentated on a range of other sports, including cricket, golf, and numerous Olympic Games, Asian Games and Commonwealth Games events for the ABC and the Asia-Pacific Broadcasting Union[ABU]. On 29 April 2010, Warren was named the inaugural 612 ABC Brisbane Employee of the Week.\nWell known for his intelligent sense of humour, Boland played \"Pete the French Polisher\" on the ABC-TV show Club Buggery in the mid-1990s. Boland is also famous for his trademark moustache.\nReferences\n* Whiticker, Alan and Hudson, Glen; The Encyclopedia of Rugby League Players; published 2005 by BAS publishing, f16/171 Collins St, Melbourne, Vic., 3000\nExternal links\n*[http://stats.rleague.com/rl/scorers/players/Warren_Boland.html Warren Boland: Rugby League Statistics]\n*[http://www.yesterdayshero.com.au/PlayerProfile_Warren-Boland_1088.aspx Warren Boland at yesterdayshero.com.au]\n*[https://www.abc.net.au/profiles/content/s1857326.htm?site=tropic Warren Boland at abc.net.au]"
    }
  ]
}