{
  "content": [
    {
      "type": "text",
      "text": "# Warren Group – Studio Deluxe\n\n}}\nWarren Group | Studio Deluxe is a graphic design firm located in the Beacon Laundry Building, which is part of the Helms Bakery Complex, in Culver City, California. The firm was founded by creative director Linda Warren in 1984.\nWarren Group | Studio Deluxe won awards in various design competitions, including the American Center of Design 100 Show, Annual Report 100, and Art Directors Clubs of New York and California. Its work has been mentioned in online and print venues, such as Apple, Graphics Inc., Communication Arts, How and Print Magazine, and selected for the U.S. Library of Congress Permanent Design Collection. The firm's annual report for Junior Blind of America is included in Designing for the Greater Good: \"The Best in Cause-Related Marketing and Nonprofit Design.\"\nDesign background\nWarren Group | Studio Deluxe’s work focuses on print and online formats, and includes corporate identities, branding systems, print campaigns, publications and websites. For its efforts on behalf of clients in the fields of education and healthcare, the firm has been recognized by the Association of American Medical Colleges, Council for Advancement and Support of Education, University and College Designers Association, and the Healthcare Public Relations and Marketing Association.\nLinda Warren is a former president of the Art Director’s Club of Los Angeles and a member of the AIGA, the nation’s largest design organization. She is a graduate of Occidental College, Los Angeles, and attended the Ecole de Cuisine, Ritz Escoffier, Paris. She is also an adjunct professor in the graphic design department of Santa Monica College, Los Angeles.\nWarren Group | Studio Deluxe’s clients include The Aquarium of the Pacific, Aramark, The California Avocado Commission, The Capital Group Companies, Carnegie Mellon University Press, Children's Hospital Los Angeles, The Coffee Bean & Tea Leaf, The Doheny Eye Institute, Keck Graduate Institute of Applied Life Sciences, The Information Sciences Institute at USC, Junior Blind of America, Loyola High School, Manet Community Health Center, Marymount College, St. Paul the Apostle Catholic Community, Occidental College, Outer Cape Health Services, The Saban Research Institute, The University of Southern California, and The Walt Disney Company.\nPhilosophy\nIn an interview on Apple.com, firm leader Warren said, \"On a creative level, everything we do here depends on collaboration. Among ourselves, the photographers and illustrators and writers we work with and with our clients. The better we collaborate, the better our final product is.\"\nAlong the same theme, when asked by Designer Magazine, \"What’s the key to your success?\" she answered: \"Teamwork. You have to like and respect the people you’re working with, enjoy the process and truly believe that each person is part of the inspiration of a project.\"\nReferences\nPublications\n* Peleg Top, Jonathan Cleveland, ‘’Designing for the Greater Good: The Best in Cause-Related Marketing and Nonprofit Design’’, HarperCollins, 2010 ()\n* B. Martin Pederson, ‘’Designers USA’’, Graphics, 2005 ()\n* ‘’Hot California Graphics 2’’, Madison Square Press, 2002 ()\nExternal links\n* [http://www.studiodeluxe.com Warren Group | Studio Deluxe website]\n* [http://www.lindysues.com Lindy Sue’s for Clean Living website]\n* [http://www.studiodeluxe.com/WG_Apple.pdf Apple.com]\n* [https://www.nytimes.com/interactive/2008/04/06/realestate/20080406_MOSTWANTED_GRAPHIC.html The New York Times]\n* [http://www.helmsbakerydistrict.com Helms Bakery District]"
    }
  ]
}