{
  "content": [
    {
      "type": "text",
      "text": "# Warri–Itakpe Railway\n\n| operator                        = Nigerian Railway Company\n| linelength_km                   = 326\n| tracks                          = 1\n| gauge                           =\n| electrification                 = None\n| speed_km/h                      = 150\n}}\nThe Ujevwu–Itakpe Railway is a standard-gauge railway in Nigeria that connects the port city of Warri to the inland town of Itakpe. Construction began in 1987 on an industrial railway to supply the Ajaokuta Steel Mill with iron ore and coal. After a protracted construction period of more than 30 years, the railway was finally inaugurated in 2020 as a mixed freight and passenger line. Construction is underway on an extension to Abuja, where it will connect to the Lagos–Kano Standard Gauge Railway.\nConstruction\nOrigin\nWhen Nigeria became independent from Great Britain in 1960, it imported most of its steel from Britain and other foreign suppliers. Pursuing industrialisation and greater self-sufficiency, Nigerian leaders reached an agreement with the Soviet Union to build the Ajaokuta Steel Mill, a vast complex that would be larger than all the oil refineries in Nigeria combined. The steelworks were located on the Niger River, about 60&nbsp;km from the iron ore deposits at Itakpe. A contract was awarded to Julius Berger in 1987 to build an industrial railway from Ajaokuta to Itakpe to supply the steelworks with iron ore. Since the railway did not have to connect to Nigeria's Cape gauge railway network, it was decided to build it as Nigeria's first standard-gauge railway.\nSince Nigeria lacked metallurgical coal of sufficient quality, it would be necessary to import metallurgical coal by sea. Several forms of transport were considered. The coal could be brought up the Niger River directly to Ajaokuta, but the Niger River was only seasonally navigable and would have to be dredged to be navigable year-round. The coal could also be loaded at Port Harcourt on the Eastern Line, but Nigeria's Cape gauge railways had insufficient capacity. To handle the heavy industrial traffic, plans were drawn up to build a standard-gauge railway from Port Harcourt to Otukpo, where it would branch off for Ajaokuta. However, the railway from Port Harcourt was shelved due to lack of funding. It was decided to extend the Itakpe–Ajaokuta Railway to the Atlantic Ocean port of Warri, which would also make it possible to transport iron ore to the Delta Steel Plant in Aladja, across the river from Warri.\nAlthough the railway was completed from Itakpe to Ajaokuta, progress was slow on the extension to Warri. Only 254&nbsp;km of the 276&nbsp;km extension to Warri had been completed by 2009, when the Nigerian government awarded a ₦33 billion contract to Julius Berger and TEAM Nigeria to complete the remaining 22&nbsp;km by 2013. However, the railway was still incomplete in 2017, and the Ajaokuta Steel Mill was also incomplete. Although construction had begun in 1979, the steelworks had not produced a single sheet of steel by the end of 2017.\nCompletion\nIn the meantime, the China Civil Engineering Construction Corporation had begun work on the Abuja–Kaduna segment of the Lagos–Kano Standard Gauge Railway in 2011. Despite difficulties with theft of construction materials and land acquisition, CCECC completed the 187&nbsp;km segment in 2016 as Nigeria's first standard-gauge railway. Passenger trains quickly became a vital transport link in the capital region as the parallel Abuja–Kaduna Expressway was besieged by robbers and armed kidnappers. Fearing for their safety, travelers packed the trains beyond their seating capacity, forcing some passengers to stand for two hours.\nIn 2017, the Nigerian government contracted CCECC to help complete the Warri–Itakpe Railway. Julius Berger would finish the work that it had already begun, while CCECC would build stations to support passenger trains and rebuild the Itakpe–Ajaokuta section, which had been vandalised for the steel. Although the government hoped that the railway could begin operating in June 2018, CCECC faced the usual construction difficulties. Gunmen attacked two Nigerian employees at Igueben-Ekekhen station in April 2018, and seven gunmen ambushed a Chinese engineer at Uromi in September 2018.\nOn 29 September 2020, the Warri–Itakpe Railway was officially inaugurated by President Muhammadu Buhari in a virtual ceremony. Passenger trains began running in October 2020, and freight service began in April 2021.\nFuture extension to Abuja\nIn 2019, the Nigerian government awarded a contract to the China Railway Construction Corporation to extend the Warri–Itakpe Railway to Abuja and build a new port at Warri. The railway and port would cost a total of $3.9 billion, with 15% of the funds coming from the Nigerian government, 10% from CRCC, and 75% from a Chinese bank. Upon completion, CRCC will receive a concession to operate the port and railway for 30 years. Once the railway extension to Abuja is completed, this would reduce the travelling time from Abuja to Warri and would open up huge economic activities between the two cities. The railway is expected to run through the [https://urbanreality.com.ng/fcda-approved-land-in-kuje-abuja-urban-reality/ FCDA approved land] in  Kuje, Gwagwalada and end at Idu. A visit at the Itakpe train station, show huge travellers from Abuja on a daily basis.\nSee also\n* Rail transport in Nigeria\n* Railway stations in Nigeria\nReferences"
    }
  ]
}