{
  "content": [
    {
      "type": "text",
      "text": "# Warren Street tube station\n\n| map_type         = Central London\n| years1           = 22 June 1907\n| events1          = Opened\n| years2           = 1 December 1968\n| events2          = Victoria line opened\n| interchange      =\n| interchange_note =\n}}\nWarren Street () is a London Underground station, located at the intersection of Tottenham Court Road and Euston Road in the northernmost part of Fitzrovia,  and named after adjoining Warren Street. It is served by the Northern and Victoria lines. Even though it is relatively used less than a number of neighbouring stations, it provides an interchange between the two lines as well as access to the University College Hospital.\nThe station opened in 1907 as Euston Road, and was designed by Leslie Green. It was refurbished in the 1930s by Charles Holden, when escalators were first installed. An extensive refurbishment took place in the late 1960s to accommodate the Victoria line, when it briefly acted as a temporary terminus. It was the first station on the underground to have a dedicated Wi-Fi surface in 2012.\nName and location\nThe premises adjoins Warren Street, Euston Road and Tottenham Court Road; Warren Street is named after the 18th-century naval officer Sir Peter Warren. The station is on the Charing Cross branch of the Northern line between Euston and Goodge Street stations, and on the Victoria line between Oxford Circus and Euston stations. It is located in London fare zone 1 and is the nearest tube station to University College Hospital, being opposite the main building. It is also a  walk to  on the Circle, Hammersmith & City and Metropolitan lines, which is at the other side of the hospital building.\nLondon Buses routes 18, 24, 27, 29, 30, 73, 134, 205 and 390 and night routes N5, N20, N29, N73, N205, N253 and N279 serve the station.\nThe station has a relatively low footfall for Victoria line stations in the area. In 2020, the annualised total for Warren Street was around 7.7 million, lower than Euston (8.8 million), Green Park (9.4 million), Oxford Circus (14.6 million), Kings Cross St Pancras (18.8 million) and Victoria (23 million).\nHistory\nNorthern line\nThe station was part of the original Charing Cross, Euston and Hampstead Railway, running from Charing Cross to Camden Town. Work started on the station in 1902, designed by Leslie Green. It was opened along with the rest of the line on 22 June 1907 by the President of the Board of Trade, David Lloyd George, under the name \"Euston Road\". This name can still be seen in the Northern line platform tiling. The station's name changed to \"Warren Street\" the following year, on 7 June 1908.\nIn the early 1930s, Charles Holden designed a refurbishment for the station, including the surface building. In September 1933, the station was rebuilt, with escalators installed in place of the original lifts. Tripod gates were fitted to the station entrance in July 1968.\nVictoria line\nWarren Street was not in the original proposals for the Victoria line, but was added by the time work began in 1962. This was done to break up a lengthy section of tube between Euston and Oxford Circus, and provide an additional public transport access point to the local area.\nThe Victoria line platforms opened on 1 December 1968 as a temporary southern terminus of the line. Trains ran into the southbound platform and reversed; the northbound platform was not originally used. The interchange with the Northern Line was cumbersome as it involved a staircase and two escalators. The extension southwards towards Victoria officially opened on 7 March 1969, though through trains had been running since 24 February. Along with other Victoria line stations, the new complex was originally decorated with tiles showing an illustration relating to the station's name – in this case, a maze (signifying a warren).\nLater history\nOn 27 April 2012, Warren Street station became the first London Underground Wi-Fi enabled tube station.\nIncidents\nOn 23 November 1984, a fire broke out in a maintenance compound near Oxford Circus. The Victoria line was part-suspended, with trains terminating at Warren Street. The line reopened on 17 December. The fire was believed to be caused by a discarded cigarette, which led to a smoking ban on all below-ground components of the Underground, including trains, platforms and stations.}}\nOn 23 July 2018, a woman died after being hit by a Victoria line train at the station. The police did not believe there were any suspicious circumstances.\nCultural references\nThe Northern line northbound platform of the station was used for location filming in the 1972 horror film Death Line, featuring a group of cannibals living underground.\nGallery\nFile:Warren Street stn Northern northbound look north.JPG|Northern line northbound platform looking north, July 2008\nFile:Warren Street Tube Station.jpeg|Northern line northbound platform, looking south, February 2018\nFile:Warren Street stn Northern tiling.JPG|Tiling on Northern line southbound platform, revealing the former station name, Euston Road\nFile:Warren street stn Northern roundel.JPG|Station roundel\nFile:Warren Street stn Victoria northbound looking north.JPG|Victoria line northbound platform looking north, July 2008. After a few years, the station was renovated\nFile:Warren Street Station and BT Tower.jpg|Warren Street station viewed from the north-east across Euston Road\nReferences\nNotes\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://www.ltmuseum.co.uk/collections/collections-online/photographs/ London Transport Museum Photographic Archive]\n**\n**\n**"
    }
  ]
}