{
  "content": [
    {
      "type": "text",
      "text": "# Warrender Baths Club\n\nWarrender Baths Club is a swimming club which originated at Warrender Baths in Edinburgh, Scotland, established in 1888. In 2013 the club had 600 members with an active membership of 350 swimmers training at nine swimming pools across Edinburgh. Their swimmers compete in a wide range of international and national competitions including the Olympic and Commonwealth Games.  Warrender has been called the premier swimming club in Scotland and claims to be one of the oldest, most successful swimming clubs in the UK.\nHistory of the club\n1888 to 1918 – Early years\nIn 1886 the Warrender Private Baths Company Ltd. built a private swimming baths in Edinburgh. The land was bought from Sir George Warrender, MP and the baths opened on 17 December 1887. Warrender Baths Club (Warrender) was established in 1888.\nGeorge M. Paterson was first Warrender champion swimmer in 1892, but initially, most of Warrender's activities centred around water polo. In 1896, Frank Marshall was Warrender's first water polo internationalist. In 1900 Stanley Bell captained the Scottish team in a Water Polo International against Wales held at Warrender Baths and in 1901 Warrender won the first Scottish National Water Polo Championship organised by the Scottish Amateur Swimming Association (SASA).\nIn 1906 Warrender Baths closed for economic reasons but the Club carried on at Portobello swimming pool. In 1908, Edinburgh Corporation purchased the site and opened the baths to the public. Warrender Baths Club returned to its original location and in 1910 a ladies section was formed.\nThe club wound down activities during World War I as all senior club members joined the forces.  A plaque in the front lobby of Warrender Baths commemorates those who died in this war – one, David McGregor, was awarded Britain's highest award for valour, the Victoria Cross.\n1919 to 1945 – Successful years\nAfter the war, the club returned to its former strength and in 1919 won the Scottish Championships.\nIn 1924, Warrender produced Ellen King, one of Scotland's greatest ever swimmers. Aged 15 she came sixth in the 100 yards Backstroke in the Paris Olympic Games. She won all Scottish Championship titles for women (except Graceful Diving) and was the only swimmer then, male or female, to have won three British Championships at different strokes. However, the male-dominated Warrender Baths Club of the time, prevented Ellen and other female swimmers from holding a ladies gala event.  So Ellen and several other women left the club in 1925 and formed Zenith Ladies Swim Club. Ellen then won two silver medals at the 1928 Summer Olympics and silver and bronze medals at the 1930 British Empire Games. She was inducted into the Scottish Sports Hall of Fame in 2002.\nWarrender's Jean McDowell came fourth in the 100 yards Freestyle in the 1928 Amsterdam Olympics in an extremely close finish. In 1927 and 1928 she won all Scottish freestyle championships. At the 1930 British Empire Games in Hamilton, Canada, Jean and fellow Warrender swimmer Jessie McVey both won bronze medals as part of the Scottish relay team. Jean also won two won bronze medals at the 1934 Empire Games in London.  Jean later remarked that female competitive swimmers had great difficulty training in the 1920s and 30s as mixed bathing was forbidden and training times for women were often restricted – in Warrender's case only on Saturday mornings when schools were there, leaving little room for Olympic hopefuls to swim.\nIn 1932 Warrender won the Scottish men and women's swimming team race championships and the Scottish Water Polo championships, the first time a Scottish club had done this. In 1938, the Edinburgh Evening News noted at the club's 50th anniversary that between 1888 and 1938, the Warrender men won the Scottish Team Swimming Championships seven times and the East of Scotland Team title 22 times. The Warrender women won the Scottish Team Swimming Championships three times, were runners up seven times and won the East of Scotland title 11 times. The Warrender Water Polo teams won the Scottish Cup eight times, the East of Scotland Championship 14 times and the Edinburgh Corporation Trophy 17 times. Club members had also won over 100 Scottish and Eastern individual championships.\nAt the start of World War II in 1939, the club wound down its activities but had two charity galas in 1942 and 1943.\n1946 to 1967 – Postwar rebuilding of the club\nThe club resumed officially in 1946, its teams being rebuilt from scratch. Once the swimming teams were re-established, in 1951, Warrender became East District Team Race Champions and three swimmers and two divers represented Scotland in the 1958 British Empire and Commonwealth Games at Cardiff.\n1968 to 1989 – Supremacy in Scottish swimming\nFrom 1968 to 1989 Warrender was supreme in Scottish swimming. It was one of the top clubs in British swimming and its swimmers won in European, Commonwealth and World competitions  – including David Wilkie who has been described as Scotland's greatest ever swimmer. Ten Warrender swimmers, represented Scotland in the 1970 Commonwealth Games including David Wilkie and Sally Hogg who represented Great Britain in the 1970 European Aquatics Championships in Barcelona. In 1971 Warrender were second to Southampton in the unofficial club championships of Britain.\nDavid Wilkie won a bronze medal at the 1970 Commonwealth Games, a silver at the 1972 Summer Olympics, won the 200 metres breaststroke World Championship in world record time in 1973 and won two golds and a silver at the 1974 Commonwealth Games. In 1976, while at the University of Miami, he won a gold medal in the 200m Breaststroke in World Record time and another silver medal at the Montreal Olympic Games. Warrender swimmers Gordon Downie and Alan McClatchey (then studying at the University of Michigan) also won Olympic bronzes as part of the 4 × 200 m Freestyle Relay team. Over 300 Warrender members attended a reception in 1976 for Wilkie in Edinburgh where he paid tribute to Warrender coaches Frank Thomas and John Ashton for their contributions to his success. Wilkie was voted European Male Swimmer of the Year and also awarded the MBE.\nPaul Easter represented Great Britain in the European Cup in Gothenburg and Scotland in the Brisbane 1982 Commonwealth Games winning bronze in the 4 × 200 m Freestyle Relay and the 4 × 100 m Medley Relay. He also represented Great Britain in the 1982 World Aquatics Championships in Ecuador.  At the 1984 Olympic Games in Los Angeles, Easter (who was then studying at Arizona State University) won a bronze medal swimming for Britain in the 4 × 200 m Freestyle Relay.\nIn 1986 Paul Easter, Colin Bole and Andrew Smith swam in the Scottish Commonwealth Games team. In 1987 Warrender won both the Robertson (Scottish National Open Championship) and the Waldie (Scottish National Age Group Championships) Trophies, the first time a club had won both championships in the same season.\nIn 1988, Warrender's Men's and Women's team won the Scottish heats of the British Swimming Club Team Championships. Warrender again won the Waldie and Robertson Trophies and its swimmers won over 40 individual championships and broke over 30 championship records. Warrender also regained the Wainwright Trophy at the Scottish National Short Course Championships. The Club held a Centenary Gala in Dunfermline and other social events to celebrate the 100 years of its existence.\n1990 to 1999 – Barren years\nIn the mid-1990s the club had financial difficulties, declining membership and several short lived changes to its coaching staff. A few top level senior swimmers remained – in particular Fraser Walker who won silver in the men's 200 m individual medley at the inaugural 1993 FINA Short Course World Championships in Spain and bronze at the 1994 Commonwealth Games in the 200 Metres Individual Medley.\nWarrender was no longer the dominant age group and youth force in Scotland that it once was. In 1996, the club had shrunk to less than 100 registered swimmers and was only rated 5th best club in the East District and way down the National rankings. At the end of 1996, Scottish Swimming formed the City of Edinburgh Swimming programme to cater for elite swimmers wanting to train in the capital. Warrender was one of six Edinburgh Clubs working in partnership to ensure the new 'City' programme became established. For several years Warrender became the main contributor of swimmers to the scheme.\n2000 to 2014 – Resurgence\nIn the early 2000s, the support for training Edinburgh swimmers was reduced and the City of Edinburgh programme became a separate swimming club. Warrender decided to train its own elite swimmers and won the Solripe Trophy (East District Swimming Championship) in 2000 and for the next 12 years,. In the early 2000s, Warrender formed partnerships with SwimEasy (a swimming lessons business started by Gail Smith and Ian Write, two former Warrender coaches) to recruit promising young swimmers. Merchiston Castle School allowed Warrender swimmers to use their pool in exchange for swimming lessons and training to schoolchildren. Club swimmers trained in Barcelona, Spain, Eger, Hungary, Castres, France, Fort Lauderdale, USA, Bühl (Baden), Germany and Reykjavík, Iceland. Between 2005 and 2013, Warrender won the top club award most years at the Scottish National Age Group Championships, several times won the top club award at the Scottish National Short Course and Open Championships and with swimmers were regularly winning medals at Scottish and British national meets.\nAt the 2006 Commonwealth Games in Melbourne, Fiona Booth from Warrender swam for Scotland. Lewis Smith won gold at the 2008 Tri-Nations Swimming Contest with France and Canada in Quebec. Warrender had 12 swimmers at the British Olympic Trials in 2008. One, Sean Fraser, won bronze in the Beijing 2008 Paralympics. Ewan Johnston won two bronze medals and Andrew Haslett a bronze for Scotland at the 2008 Commonwealth Youth Games in Pune, India. Warrender came second at the 2008 British National Championships at Sheffield.\nSmith competed at the 2009 World Aquatics Championships in Rome, Italy Craig Hamilton swam at the 2009 European Open Water Swimming Championships in Eilat and Craig Benson competed at the 2009 European Youth Olympic Festival in Tampere. Smith won a silver medal, Fraser won bronze and Craig McNally swam at the 2010 Commonwealth Games in Delhi. In 2011, Dan Wallace and Benson won silver medals at the 2011 European Junior Swimming Championships in Belgrade. At the 2011 FINA World Junior Swimming Championships in Lima, Peru, Benson won gold in the 100m Breaststroke in championship world record time and a silver in the 50m Breaststroke. Benson also won all breaststroke events at the 2011 Commonwealth Youth Games in the Isle of Man and was awarded Athlete of the Games. Smith was a finalist at the 2011 World University Games.\nFour Warrender swimmers swam at the 2012 London Olympic Trials. At the 2012 Olympics, Benson swam in the 100 m breaststroke and in the British Medley Relay team. Smith swam for Great Britain in the European Open Water Championships in Piombino, Italy. Benson swam in the 2012 European Short Course Swimming Championships in Chartres, France, and was part of the Medley relay squad that broke the British record. In 2012 Olympic silver medallist Keri-Anne Payne joined Warrender. Craig McNally broke the Scottish record in the finals of the 200 m backstroke in the 2013 World Aquatics Championships in Barcelona, Spain and Smith won a bronze medal in the 400 m individual medlay at the 2013 World University Games in Kazan, Russia.\nSix Warrender swimmers were selected to swim for Scotland at the 2014 Commonwealth Games in Glasgow.  Dan Wallace (then studying at University of Florida) won a gold medal in the 400 m individual medley and two silver medals; Craig Hamilton (then studying at Louisiana State University) won a silver with the Scottish 4 × 200 m men's relay team; Craig Benson was 4th in the 100 m breastroke; Fiona Donnelly (then studying at the Virginia Tech University) was in the Scottish 4 × 100 m medley relay team which came 4th; Lewis Smith was 5th in the 400 m individual medley and Craig McNally was 5th in the 200 m backstroke.\nLocations\nWarrender Baths Club was originally based at Warrender Baths (now Warrender Swim Centre), on Thirlestane Road in Edinburgh. This grade B listed building has a 25yd indoor pool, gym and a sauna. With 350 swimmers and 600 members (in 2013) Warrender has had to use many many other Edinburgh venues for training – in particular the Olympic-sized Royal Commonwealth Pool.  From 2009 to 2012 this 50 m pool was closed for renovations. and Warrender used up to 12 different Edinburgh swimming pools to train its 13 swimming squads. In 2013, Warrender swimmers were training in the Royal Commonwealth Pool, Warrender Baths, Merchiston Castle School pool, Leith Academy pool, Craigroyston School pool, Forrester High School pool, Ainslie Park Swimming and Leisure Centre, Glenogle Baths and Leith Victoria public baths.\nOlympic swimmers\nOlympic gold medallist David Wilkie, silver Olympic medallists Ellen King and Keri-Anne Payne, Olympic bronze medallists Paul Easter, Gordon Downie and Alan McClatchey, Olympic finalist Jean McDowell and Olympic semi-finalist Craig Benson all swam for Warrender Baths Club.\nScott Quin won Silver and George Simpson and Sean Fraser won bronze medals at the Paralympics.\nNotable administrators and coaches\nGeorge Patterson was the first President of the Club in 1894 and secretary of the SASA in 1895. George W Ferguson, a Warrender Baths Club President and SASA President, was appointed Team Manager for the Scottish team at the 1930 Empire Games and Commandant for the 1934 Empire Games.\nInstrumental in rebuilding the club after 1945 were Jean McDowell, the pre-war Olympic finalist and Mae Cochrane, later the first female President of Warrender in 1976 and President of SASA in 1981,. In 1982 Mae Cochrane was awarded the OBE for her outstanding services to swimming.\nFrank Thomas was Warrender coach from 1965 to 1970 and has been described as one of the leading coaches in Britain. Frank developed ten swimmers to represent Scotland at the Commonwealth games including David Wilkie who achieved an Olympic gold medal, added various new swimming training venues and recruited assistant coaches.\nIan McGregor was Chief Coach from 1980 and was awarded the Scottish Coach of the Year in 1987. Ian Wright was appointed Warrender head coach in 1996 and helped Warrender recover from a period of decline.  Wright was British swimming team coach at the 2005 European Junior Swimming Championships and 2006 European Aquatics Championships and was appointed by Scottish Swimming as a Performance Coach at the Scottish National Swimming Academy in Stirling in 2009. In 2009 Australian-born Laurel Bailey was appointed Warrender head coach. She was awarded Performance Coach of the Year by Sportscotland, the National sports agency in 2012.\nNotes\nSources\n*"
    }
  ]
}