{
  "content": [
    {
      "type": "text",
      "text": "# Warren Lambert Wagner\n\nWarren Lambert Wagner (born February 8, 1950, in Las Cruces, New Mexico) is an American botanist, a curator of botany, and a leading expert on Onagraceae and plants of the Pacific Islands, especially plants of the Hawaiian Islands.\nBiography\nWagner attended New Mexico State University from 1968 to 1972 and then transferred to the University of New Mexico. There he graduated in 1973 with  a bachelor of science degree in biology and in 1977 with a master's degree in botany, after working as a herbarium curatorial assistant and a research assistant supported by a series of grants. His master's thesis is on the flora of the Animas Mountains in southwestern New Mexico. From 1977 to 1981 he was a graduate student at Washington University in St. Louis. His 1981 doctoral dissertation, supervised by Peter Raven, is entitled \"A systematic and evolutionary study of the Oenothera caespitosa species group, Onagraceae\". From 1981 to 1982 Wagner was a postdoc at Missouri Botanical Garden. In 1982 despite never having visited the Hawaiian Islands and never having studied the flora of those Islands, he was appointed to a position at Honolulu's Bishop Museum to work on a comprehensive, new flora of the Hawaiian Islands. In 1983 he became the leader of the project. In 1990 the University of Hawaii Press published the flora in two volumes with the title ''Manual of the Flowering Plants of Hawai'i''. The lead author was Wagner, but he had two coauthors and 50 contributors.}}\nSince 1988 when he was hired as curator of Pacific botany, Wagner has worked at the Department of Botany of the Smithsonian Institution's National Museum of Natural History. From 1992 to 1997 he was the department chair. He has done botanical research in the Hawaiian Islands, the Marquesas, and Taiwan, as well as Mexico, Canada, and the mainland U.S.A. He is the author or coauthor of over 100 scientific articles. His articles have been published in the Annals of the Missouri Botanical Garden, the American Journal of Botany, Biochemical Systematics and Ecology, the Botanical Journal of the Linnean Society, Brittonia, Ecology and Evolution, Frontiers in Plant Science, the International Journal of Plant Sciences, the Journal of Biogeography, Novon, PhytoKeys, Selbyana, Systematic Botany, and Taxon.\nIn June 1993 in Boulder, Colorado, he married Lucy Carol Julian. They have a son and a daughter.\nAwards and honors\n* 1990 — Engler Medal in Silver (shared with D. R. Herbst and S. H. Sohmer) from the International Association for Plant Taxonomy for the book ''Manual of the Flowering Plants of Hawai'i''\n* 1995 — Robert Allerton Award from the National Tropical Botanical Garden for his services in the field of tropical botany and horticulture\n* 2008 — Merit Award of the Botanical Society of America\n* 2015 — Asa Gray Award of the American Society of Plant Taxonomists\nSelected publications\n*\n*\n*  (1st edition published in 1990)\n*\n*\n*\n*\n*\nReferences\nExternal links\n*\n*"
    }
  ]
}