{
  "content": [
    {
      "type": "text",
      "text": "# Warrongo language\n\nWarrongo (or War(r)ungu) is an Australian Aboriginal language, one of the dozen languages of the Maric branch of the Pama–Nyungan family. It was formerly spoken by the Warrongo people in the area around Townsville, Queensland, Australia. Its last native speaker was Alf Palmer, who died in 1981.\nBefore his death, linguists Tasaku Tsunoda and Peter Sutton worked together with Palmer to preserve the language (Warrungu proper); thanks to their efforts, the language is beginning to be revived. Classes have been held by Tsunoda since 2002.}}\nOne of the notable feature of the language is its syntactic ergativity.\nAs noted by Ethnologue, the language is currently dormant meaning that there are no native/proficient speakers left.\nAlternative names for the language include Warrangu, Warrango, War(r)uŋu, War-oong-oo, Gudjala and Gudjal.\nThe Warungu language region includes areas from the Upper Herbert River to Mount Garnet.\nSociolinguistic situation\nNowadays people identifying themselves as Warrongo live both within traditional Warrongo territory (Mount Garnet) and outside it (Palm Island, Townsville, Ingham, Cardwell, and Cairns). The language has been extinct since the last speaker, Alf Palmer, died in 1981. In the late 1990s or early 2000s a language revival movement started by a community of people, most of them grandchildren of the last speakers, the central figure being Rachel Cummins, the granddaughter of Alf Palmer. The community had contacted Tsunoda, the linguist who worked with the last speakers in the 1970s, and between 2002 and 2006 he conducted 5 sessions of lessons, of 4–5 days each. As a result, the language seems to have acquired a limited set of symbolic functions. It has begun to be used in teasing between children, and as a source of personal names.\nClassification\nThere appear to have been at least two mutually intelligible dialects. Warrongo belongs to the Pama-Nyungan (macro)family. The most closely related languages are Gugu Badhun (90% lexical sharing in terms of Hale's 99-item vocabulary) and Gujal (94% lexical sharing). The intermediate level classification of this group seems uncertain: the evidence from phonological correspondences, pronouns and verb roots suggests it belongs to the Maric group (alongside Bidjara, Gungabula, Marganj, Gunja, Biri and Nyaygungu), while the verbal inflectional morphology is akin to that of the Hebert River group (which includes Dyirbal, Warrgamay, Nyawaygi and Manbarra). It has been suggested that the verbal inflectional suffixes might have been the result of massive borrowing.\nPhonology\nConsonants\n{| class=\"wikitable\" style=\"text-align: center;\"\n|+ style=\"font-weight: normal\"|Warrongo consonants (spelling representation is in angle brackets)\n|-\n!\n!bilabial\n!lamino-dental\n!apico-alveolar\n!retroflex\n!lamino-palatal\n!dorso-velar\n|-\n!stop\n|\n|( )\n|\n|\n|\n|\n|-\n!nasal\n|\n|( )\n|\n|\n|\n|\n|-\n!rhotic\n|\n|\n|\n|\n|\n|\n|-\n!lateral\n|\n|\n|\n|\n|\n|\n|-\n!semivowel\n|\n|\n|\n|\n|\n|\n|}\n# Only in Gugu-Badhun.\nThe sound  appears only in the interjection  'Hi!' and the exclamation of surprise  (or ) Dentalized consonants tend to appear in the Gugu-Badhun dialect. An alveolar approximant  is stated to appear in the Gugu-Badhun dialect as well. The retroflex approximant  in syllable-final position can infrequently be realised as a retroflex tap .&nbsp; The lamino-palatal stop is in most instances phonetically an affricate  or .\nVoicing is not distinctive for stops . The rules for voicing are fairly complex, but still it is impossible to predict it in all instances . The factors involved are the place of articulation (the more front the stop, the more likely it is to be voiced), the phonetic environment, position with respect to word boundaries, and possibly also the length of the word, the number of syllables that follow the stop and the location of stress.\nVowels\nThere are three vowels: ,  and  (orthographically ). Length is distinctive only for , its long counterpart is orthographically represented as .  has two allophones: , and  (neither of which involve significant lip rounding), depending on the preceding consonant. Both are possible after ,  and , while after all other consonants only  appears. The allophony of  seems to be governed by more complex rules but generally,   is the sole allophone after ˌ ˌ  and , while after almost all other consonants both  and  can be observed.\nWord classes\nWarrongo is analysed as having five word classes: nouns, (personal) pronouns, adverbs, verbs and interjections. Most of these contain interrogative and demonstrative members; example of an interrogative noun is  'what',  'there' is a demonstrative adverb, an interrogative verb is  'to do what', and a demonstrative one is  'to do thus'. Almost all words belong exclusively to a word class, while change of word class is achieved through derivational suffixes. Adjectives do not form a separate class as they share the morphology and syntactic behaviour of nouns. There are also about a dozen enclitics, with a range of functions: emphasis, focus, intensification, or meanings like 'only', 'enough', 'too', 'I don't know', 'counterfactual'.\nNominal morphology\nNouns generally do not distinguish number or gender, while pronouns have different forms for number (singular, dual and plural) and person (first, second and third). All of them do, however, inflect for case. The case suffixes have allomorphs according to the final phoneme of the stem, with some peculiarities exhibited by pronouns and by vowel-final proper and kin nouns . There are also a few irregular nouns.\nCases\nNouns have a single form, unmarked by a suffix, for the nominative case (used for the subject of an intransitive verb) and the accusative case (used for the object of a transitive verb), while the ergative case (used for the subject of a transitive verb) is marked by a suffix. In pronouns, on the other hand, the nominative and the ergative coincide in the bare stem form, while the accusative is marked by a suffix. Exceptionally, the third person dual and plural pronouns, as well as vowel-final proper and kin nouns, receive separate marking for each of these three cases. The ergative, if used with inanimate nouns, may also mark an instrument.\nThe locative case describes path or destination of movement, location, duration in time, instrument (and means),  company ('together with'), and cause or reason. The dative case marks purpose, cause and reason, possession (rarely), goal and direction of movement, recipient, temporal duration or endpoint, a core argument in some syntactic constructions, and a complement of intransitives verbs or nouns like 'fond (of)', 'good (to)', 'know', 'forget'. The genitive is used only with animate nouns and marks, besides the typical possessor and related functions, also a beneficiary, recipient, or complement of some verbs and nouns. The ablative most commonly marks reason or a temporal or spatial starting point. The comitative seems to have a wide range of meanings, some of them idiomatic, but the most typical seem to correspond to English 'with'.\nGenitive, ablative and comitative suffixes may be followed by other case suffixes.\nSome adverbs can take case suffixes: locative (optionally for adverbs of place), dative (with the sense 'to', optionally for adverbs of place, obligatory for adverbs of time), or ablative (obligatory for both if the meaning is 'from, since'). Adverbs of manner cannot take case suffixes – this distinguishes them from nouns that express similar meanings (as these nouns must agree in case with the nouns they modify).\nVerbal morphology\nVerbs belong to one of three conjugation classes, which are characterised by the presence of a 'conjugational marker' (-l-, -y- or none) which appears in certain verb forms. Verbs take suffixes for change of valency or for tense/mood (future tense, between two and three non-future tenses, imperatives, apprehensional). There are also purposive forms, which signal intention when used as the predicate of a non-subordinate clause, or mark verbs in subordinate clauses for purpose, result or successive actions.\nSyntax\nWord order\nWord order is free and does not seem to be governed by information structure. Constituents of a single phrase need not be contiguous. There are however some tendencies. Numeral nouns usually follow the head noun, while adjective-like modifiers tend to precede it. Arguments tend to precede verbs, while the agent-like argument of a transitive verb more often than not precedes the patient-like argument, although more frequently only one of them is expressed.\nComplex sentences and coreferentiality\nThe three most common means of joining clauses are sentence-sequence (juxtaposed clauses that have separate intonation contours), coordination (juxtaposed clauses with one intonation contour and sharing of conjugational categories such as tense) and subordination. The most common type of subordination is the purposive.\nIf there are shared arguments, they are more likely to be deleted from the second clause if it is subordinate, and least likely if it is sentence-sequence. The restrictions on the syntactic function of the shared argument are typical of syntactically ergative languages. The shared argument has to have the same function in both clauses, or be an intransitive subject (S) in one and a transitive patient-like argument (O) in the other:\n|man-ERG woman.ABS tell-NF go-PURP\n|\"The man told the woman to go.\" (main clause O coreferential with deleted S of the subordinate clause)}}\nIn case the shared argument is a transitive agent-like argument (A) in one of the clauses, antipassivisation will be involved. It is signalled by a verbal suffix and affects the case marking of the arguments of this verb. In comparison with the basic verb, which marks the A with ergative/nominative and the O with nominative/accusative, the antipassivised verb marks the A with nominative and the O with either ergative or dative. The agent-like argument then becomes available to be coreferential with a patient of a transitive verb or a subject of an intransitive one:\n|husband-ERG wife.ABS tell-NF cook-ANTIP-PURP\n|\"[The] husband told [his] wife to cook.\" (main clause O coreferential with A of subordinate clause, therefore antipassive is necessary)}}\nReferences\nBibliography\n*\n*\n*\n*\n*\n*  |author=|date=|title=Warungu |website=Queensland Aboriginal and Torres Strait Islander languages map |url=https://maps.slq.qld.gov.au/iyil/view/141 |access-date=5 February 2020}}\nExternal links\n* [http://www.dnathan.com/language/warrungu/ Stories from Alf Palmer]\n* [http://aiatsis.gov.au/sites/default/files/gugu_badhun.pdf Bibliography of Gugu Badhun people and language resources] , at the Australian Institute of Aboriginal and Torres Strait Islander Studies\n* [http://www.tooyoo.l.u-tokyo.ac.jp/Australia/Warrungu.html Warrungu] (in Japanese)\n* [http://www.dnathan.com/language/warrungu/warrunguConc.htm Warrungu Stories and Concordance] (recorded sentences together with a transcription, an interlinear translation, and a smooth translation)\n* [http://aiatsis.gov.au/explore/culture/topic/language-map A map of Australia showing where various languages, including Warrungu, are spoken]\n* [http://www.rferl.org/features/2003/08/15082003160729.asp World: Dying Words -- Linguists Express Concern Over Fate Of Endangered Languages (Part 1)]"
    }
  ]
}