{
  "content": [
    {
      "type": "text",
      "text": "# Warrenben Conservation Park\n\n| coordinates     =\n| map             = South Australia\n| map_alt         =\n| map_width       = 200px\n| relief          =\n| label           = Warrenben Conservation Park\n| label_position  =\n| location        = South Australia\n| established     = 9 January 1969\n| area_ha         =\n| area_km2        = 40.58\n| area_ref        =\n| visitation_num  =\n| visitation_year =\n| visitation_ref  =\n| nearest_city    = Marion Bay.\n| nearest_town    =\n| governing_body  = Department for Environment and Water\n| website         =\n}}\nWarrenben Conservation Park (formerly Warrenben National Park) is a protected area located in the Australian state of South Australia on the Yorke Peninsula of  about  north-east of Marion Bay.\nThe conservation park consists of land in section 97 in the cadastral unit of the Hundred of Warrenben.   The land first received protected area status as the Warrenben National Park proclaimed on 9 January 1969 under the National Parks Act 1966.  On 27 April 1972, the national park was reconstituted as the Warrenben Conservation Park under the National Parks and Wildlife Act 1972.   As of 2018, it covered an area of .\nThe following statement of significance appears in the conservation park's management plan:Together with nearby Innes National Park, it conserves a substantial proportion of the natural habitat remaining on southern Yorke Peninsula.  The park comprises an area of undulating limestone plains and low, stabilised dunes that remain well vegetated with mallee and tea-tree scrub and some sheoak woodlands.  It provides habitat for a number of threatened species including the nationally and state vulnerable Annual Candles, state rare Goldsack’s Leek-orchid (Prasophyllum goldsackii), and the nationally and state vulnerable Malleefowl and Western Whipbird (Psophodes nigrogularis leucogaster).\nThe conservation park is classified as an IUCN Category Ia protected area. In 1980, it was listed on the now-defunct Register of the National Estate.\nSee also\n*Protected areas of South Australia\n* Southern Yorke Peninsula Important Bird Area\nReferences\nExternal links\n*[http://www.protectedplanet.net/warrenben-conservation-park Warrenben Conservation Park webpage on protected planet]"
    }
  ]
}