{
  "content": [
    {
      "type": "text",
      "text": "# Warren Whitside\n\n|branch=  United States Army\n|serviceyears= 1898–1939\n|rank=  Colonel Quartermaster Corps\n|commands=Fort Apache 89th Division Trains and Military Police  Aleshire Quartermaster Remount Depot\n|unit=  5th Cav Regt\n10th Cav Regt\n15th Cav Regt\n89th Division\n|battles=\nSpanish–American War\nSpanish Campaign\nCuban Occupation\nCuban Pacification\nMexican Revolution\nPancho Villa Expedition\nWorld War I\nSaint-Mihiel\nMeuse-Argonne\nOccupation of Germany\n|awards=  Distinguished Service Medal\nQuartermaster Hall of Fame\n|relations= Brig. Gen. Samuel M. Whitside (father) Lt. Col. Archie Miller (brother-in-law) Capt. Warren W. Whitside, III, USN (son)\n|laterwork=\n}}\nWarren Webster Whitside was a career U.S. Army colonel who served as a Cavalry and Quartermaster officer. He was posthumously inducted into the Quartermaster Hall of Fame in 2010.\nEarly life\nColonel Whitside was born in Toronto, Ontario, Canada on November 2, 1875, the son of a career cavalry officer, Brig. Gen Samuel M. Whitside. He spent the first fifteen years of his life among soldiers and Indians on the Western plains. He was educated at Kemper Military School, Boonville, Missouri, and the Washington and Lee University, Lexington, Virginia.\nMilitary career\nIn May 1898 Colonel Whitside left college just before graduating in answer to President William McKinley’s call to service during the Spanish–American War. He was commissioned a Second Lieutenant of Cavalry in 1899, and served for the next seven years as a lieutenant in the 10th Cavalry and 15th Cavalry Regiments. In 1906 he was promoted to Captain of Quartermaster Corps, and for the next 33 years he served in a variety of command and key leadership positions within the Quartermaster field.\nColonel Whitside served on numerous campaigns including the Spanish–American War in 1898; the Cuban Occupation from 1899 to 1902 with service as the aide-de-camp to his father, the Commanding General of the District of Santiago Cuba; the Army of Cuban Pacification from 1906 to 1909 serving as a troop commander in the 15th Cavalry Regiment; the Punitive Expedition along the Mexico–U.S. border in 1916 serving as the Commander of Motor Truck Company No. 11; and World War I during the Battle of Saint-Mihiel and  Meuse-Argonne Offensive serving as the Commander of the 89th Division Trains and Military Police, a regimental level command for which he was awarded what was then the U.S.'s highest decoration for service, the Distinguished Service Medal.\nFrom 1912 to 1915 he was instrumental in the establishment and construction of the Aleshire Quartermaster Remount Depot, Front Royal, Virginia, serving as one of its first commanders. Following his return from the Punitive Expedition, he was the commander of Fort Apache from 1916 to 1917.\nFrom 1920 to 1925 he served as the Fort Riley Post Quartermaster where he was singularly responsible for modernizing much of the post including training sites for the National Guard, one of which was named in his honor and to this day is recognized as Camp Whitside.  From 1925 to 1930 he served as the Department Quartermaster for the Panama Canal Division.\nIn 1930 he served as the Post Quartermaster of West Point, New York, followed by an assignment in Washington, D.C., as the Chief of Storage and Distribution in the Office of the Quartermaster General (OQMG). While assigned to OQMG, Colonel Whitside was featured on the cover of the July–August 1934 edition of the Quartermaster Review. From 1934 until his retirement in 1939 he returned to Front Royal as the Commander of the Remount Depot, which had evolved into the largest remount depot in the Army and served as a vital economic enterprise throughout the lower Shenandoah Valley of Virginia.\nColonel Whitside retired from the military and started an apple cider business that ultimately failed.  He was married for over 63 years to the former Miss Lillian Rigney of Bridgeport, Connecticut. He died in 1964 and was laid to rest at Arlington National Cemetery. He was buried at Arlington National Cemetery, in Arlington, Virginia.\nDecorations and honors\n* Distinguished Service Medal (U.S. Army): For exceptionally meritorious and distinguished services.  As Division Quartermaster and later Commander of the 89th Division Trains, he rendered services of great value to the American Expeditionary Forces.  By his sound judgment and his ability as an organizer the system of supply and evacuation of his Division functioned efficiently, which contributed greatly to the success of the 89th Division during the St. Mihiel and Meuse-Argonne offensives.\n* Spanish Campaign Medal\n* Army of Cuban Occupation Medal\n* Army of Cuban Pacification Medal\n* Mexican Service Medal\n* World War I Victory Medal (United States) with three battle clasps (St. Mihiel, Meuse-Argonne, and Defensive Sector)\n* Army of Occupation of Germany Medal\n* French Croix De Guerre with two stars: During the preparation for the St. Mihiel attack in August 1918 he displayed the most brilliant qualities of organization and in some particularly dangerous reconnaissances he gave proof of the highest courage.\n{|class=\"wikitable\"\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|}\nDates of rank\n{|class=\"wikitable\" style=\"background:white\"\n|-\n| No Insignia in 1899\n| Second Lieutenant of Infantry United States Army: April 10, 1899, accepted May 1. Transferred to 10th Cavalry May 10.\n|-\n|\n| First Lieutenant of Cavalry U.S Army: February 2, 1901, transferred to 15th Cavalry November 4, 1903.\n|-\n|\n| Captain of Cavalry U.S. Army: August 20, 1906; Quartermaster April 16, 1912; assigned to 15th Cavalry December 15, 1912; Capt. Quartermaster Corps (Q.M.C.) March 4, 1913; assigned 10th Cavalry April 4, 1916.\n|-\n|\n| Major of Cavalry U.S. Army: May 15, 1917; Q.M.C July 25 to August 19, 1917.\n|-\n|\n| Lieutenant Colonel of Field Artillery, National Army (USA): August 5, 1917, accepted August 20.\n|-\n|\n| Colonel of Cavalry, U.S. Army (other than permanent establishment): July 30, 1918; honorably discharged June 30, 1920.\n|-\n|\n| Lieutenant Colonel of Cavalry, U.S. Army: July 1, 1920; transferred to Q.M.C. August 23, 1920.\n|-\n|\n| Colonel of Q.M.C., U.S. Army: March 26, 1924\n|}\nColonel Whitside was posthumously inducted into the Quartermaster Hall of Fame on June 18, 2010, at a ceremony at Fort Lee, Virginia.\nReferences"
    }
  ]
}