{
  "content": [
    {
      "type": "text",
      "text": "# Warrensville Heights City School District\n\nThe Warrensville Heights City School District is a public school district based in Warrensville Heights, Ohio (USA).\nIn addition to Warrensville Heights, the district also serves the villages of Highland Hills and North Randall.\nSchools\nHigh school\n*Grades 9-12\n**Warrensville Heights High School\nMiddle school\n*Grades 6-8\n**Warrensville Heights Middle School\nElementary School\n*Grades K - 5\n**Warrensville Heights Elementary School\nEnrollment\n*2006-07 School Year: 2,536 students\n*2005-06 School Year: 2,859 students\n*2004-05 School Year: 2,828 students\n*2003-04 School Year: 2,821 students\n*2002-03 School Year: 2,996 students\nDistrict during the 2010-2011  There Were A Total Of 5,579\nThere were a total of 2,536 students enrolled in the Warrensville Heights City School District during the 2006-2007 school year. The gender makeup of the district was 48.06% female and 51.94% male. The racial makeup of the district was 98.82% African American, 0.39% White, 0.24% Hispanic, 0.47% Multiracial, and 0.08% Asian/Pacific Islander.\nAthletics\nWarrensville Heights High School has won 2 OHSAA State Championships.\nBoys Track and Field 1976\nBoys Basketball 2000\nState Runner Up in Boys Basketball 2001 Girls Track & Field 2007 and Boys Track and field 1981\nNotable alumni\n* Arsenio Hall, TV personality\n* Sal Bando, Former MLB player (Oakland Athletics, Milwaukee Brewers) and Brewers general manager\n* Darnell Sanders, Former Ohio State Buckeye, Former NFL Tight End, Cleveland Browns, Atlanta Falcons, Chicago Bears\n* Brad Sellers, Former Ohio State Buckeye, NBA player, Chicago Bulls, current mayor of Warrensville Heights, Ohio\n* Yvette Nicole Brown, Actress, singer, comedian\n* David Patterson, American football player for the Atlanta Falcons\nSee also\n*List of school districts in Ohio\nReferences\nExternal links\n*[http://www.warrensville.k12.oh.us/ Warrensville Heights City School District]"
    }
  ]
}