{
  "content": [
    {
      "type": "text",
      "text": "# Warrington Township, Bucks County, Pennsylvania\n\n| subdivision_type = Country\n| subdivision_name = United States\n| subdivision_type1 = State\n| subdivision_name1 = Pennsylvania\n| subdivision_type2 = County\n| subdivision_name2 = Bucks County\n| subdivision_type4 = Municipality\n| established_title =\n| established_date =\n| leader_party =\n| leader_title = Mayor\n| leader_name =\n| unit_pref = Imperial\n| area_total_sq_mi = 13.79\n| area_land_sq_mi = 13.70\n| area_water_sq_mi = 0.09\n| elevation_footnotes =\n| elevation_ft = 338\n| population_footnotes =\n| population_total = 23418\n| population_as_of = 2010\n| population_density_sq_mi = auto\n| timezone1 = EST\n| utc_offset1 = -5\n| timezone1_DST = EDT\n| utc_offset1_DST = -4\n| postal_code_type = Postal code\n| postal_code = 18976 and 18914\n| area_code_type =\n| area_codes = 215, 267 and 445\n| website =\n|pop_est_as_of = 2016\n|pop_est_footnotes =\n|population_est = 24227\n|blank_name = FIPS code\n|blank_info = 42-017-81048\n|area_footnotes =\n}}\nWarrington Township is a township in Bucks County, Pennsylvania, United States. Warrington Township is a northern suburb of Philadelphia. The population was 25,639 at the 2020 census.\nHistory\nWarrington Township was founded in October 1734, and is named after the town of Warrington in Cheshire, England or, possibly, after the hamlet of Warrington in Buckinghamshire, England. The early township consisted of four villages: Warrington, Neshaminy, Tradesville, and Pleasantville.  Warrington was located at the intersection of Bristol Road and the Doylestown-Willow Grove Turnpike, now known as Easton Road (Pennsylvania Route 611).\nNeshaminy, originally known as Warrington Square, was centered at Street Road and the Turnpike (PA 611), but became known as Neshaminy because of its proximity to the Little Neshaminy Creek.  The Village of Tradesville was near Lower State Road and was originally known as Stuckert's Corner because of a store operated by a man named Stuckert.\nThe Village of Pleasantville (or Eureka) was located near Lower State Road and County Line Road.  It was the location of the first church in the township, The Reformed Church of Pleasantville, founded in 1840.\nIn 2010, Teva Pharmaceutical Industries proposed to build the largest warehouse facility in Pennsylvania near residential neighborhoods in Warrington, leading to vocal community opposition. Teva eventually chose a less controversial site in Northeast Philadelphia.\nDemographics\n}}\nAs of the 2010 census, the township was 86.3% Non-Hispanic White, 2.1% Black or African American, 0.2% Native American, 6.1% Asian, and 1.4% were two or more races. 4.2% of the population were of Hispanic or Latino ancestry. Much alike the rest of Bucks County, Warrington has seen a surge in its Indian and Mexican populations.\nAs of the census of 2000, there were 17,580 people, 6,124 households, and 4,807 families residing in the township.  The population density was .  There were 6,314 housing units at an average density of .  The racial makeup of the township was 94.16% White, 1.93% African American, 0.07% Native American, 2.50% Asian, 0.07% Pacific Islander, 0.53% from other races, and 0.75% from two or more races. Hispanic or Latino of any race were 1.56% of the population.\nThere were 6,124 households, out of which 42.7% had children under the age of 18 living with them, 67.9% were married couples living together, 7.5% had a female householder with no husband present, and 21.5% were non-families. 16.6% of all households were made up of individuals, and 4.7% had someone living alone who was 65 years of age or older.  The average household size was 2.86 and the average family size was 3.26.\nIn the township, the population was spread out, with 29.1% under the age of 18, 6.2% from 18 to 24, 34.5% from 25 to 44, 21.6% from 45 to 64, and 8.5% who were 65 years of age or older.  The median age was 35 years. For every 100 females, there were 100.2 males.  For every 100 females age 18 and over, there were 96.4 males.\nThe median income for a household in the township was $66,364, and the median income for a family was $76,065 (these figures had risen to $86,754 and $100,678 respectively as of a 2007 estimate). Males had a median income of $49,643 versus $34,175 for females. The per capita income for the township was $25,810.  About 1.8% of families and 2.6% of the population were below the poverty line, including 2.1% of those under age 18 and 4.5% of those age 65 or over.\nEducational institutions\nWarrington Township is located in the Central Bucks School District.  Educational institutions include:\n*Barclay Elementary School\n*Mill Creek Elementary School\n*Titus Elementary School\n*Tamanend Middle School\n*Central Bucks High School South\nGeography\nWarrington is located at  (40.239722, −75.141667). According to the United States Census Bureau, the township has a total area of 13.8&nbsp;square miles (35.7&nbsp;km), all  land. The town takes nameship after Warrington, England. Its villages include Eureka (also in Montgomery County,) Frog Hollow, Neshaminy, Palomino Farms, Tradesville (also in Doylestown Township,) and Warrington.\nNatural features include Fretz Valley, Griers Hill, Little Neshaminy Creek, Mill Creek, Park Creek, and Prospect Hill. Warrington is in the Delaware River watershed.\nNeighboring municipalities\n*New Britain Township (northwest)\n*Doylestown Township (north)\n*Warwick Township (east)\n*Warminster Township (southeast)\n*Horsham Township, Montgomery County (south)\n*Montgomery Township, Montgomery County (southwest)\nClimate\nAccording to the Köppen climate classification system, Warrington Township, Pennsylvania has a hot-summer, wet all year, humid continental climate (Dfa). Dfa climates are characterized by at least one month having an average mean temperature ≤ 32.0&nbsp;°F (≤ 0.0&nbsp;°C), at least four months with an average mean temperature ≥ 50.0&nbsp;°F (≥ 10.0&nbsp;°C), at least one month with an average mean temperature ≥ 71.6&nbsp;°F (≥ 22.0&nbsp;°C), and no significant precipitation difference between seasons. During the summer months, episodes of extreme heat and humidity can occur with heat index values ≥ 100&nbsp;°F (≥ 38&nbsp;°C). On average, the wettest month of the year is July which corresponds with the annual peak in thunderstorm activity. During the winter months, episodes of extreme cold and wind can occur with wind chill values }}\nEcology\nAccording to the A. W. Kuchler U.S. potential natural vegetation types, Warrington Township, Pennsylvania would have an Appalachian Oak (104) vegetation type with an Eastern Hardwood Forest (25) vegetation form.\nTransportation\nAs of 2019 there were  of public roads in Warrington Township, of which  were maintained by the Pennsylvania Department of Transportation (PennDOT) and  were maintained by the township.\nMajor roads in Warrington Township include U.S. Route 202, which runs southwest–northeast through the western part of the township along a two-lane expressway-grade parkway; Pennsylvania Route 611, which passes north–south through the eastern section of Warrington Township on Easton Road; Pennsylvania Route 152, which heads north–south through the western portion of the township on Limeklin Pike; Street Road, which runs northwest–southeast through the middle of the township and is designated Pennsylvania Route 132 east of Pennsylvania Route 611; County Line Road, which runs northwest–southeast along the southwestern border with Montgomery County; Bristol Road, which runs northwest–southeast along the northeastern boundary of the township; Lower State Road, which runs southwest–northeast in the western part of Warrington Township; and Upper State Road, which runs southwest–northeast along the northwestern border of the township.\nSEPTA provides bus service to Warrington Township along the SEPTA City Bus Route 55 line, which follows Pennsylvania Route 611 and heads north to Doylestown and south to Willow Grove and Olney Transportation Center in North Philadelphia. Bucks County Transport operates the DART South bus that serves Warrington Township, which runs weekdays along the PA 611 corridor to a connection with the Doylestown DART bus to Doylestown at the Doylestown Point Shopping Center.\nEducation\n]]\nWarrington Township is in the Central Bucks School District. Central Bucks High School South is in the township.\nNotable people\n* Josh Adams, football player (RB) at Notre Dame and Philadelphia Eagles\n* Mike McGlinchey, football player at Notre Dame and the San Francisco 49ers\n* Margaret Livingston, actress\n* Bryan Scott, National Football League player\n* Al Holbert, racing driver\nReferences\nExternal links\n* [http://www.warringtontownship.org/ Warrington Township]"
    }
  ]
}