{
  "content": [
    {
      "type": "text",
      "text": "# Warren Bolster__disambig_1\n\nWarren Edward Bolster (June 11, 1947 in Arlington, Virginia – September 6, 2006 in Mokuleia, Hawaii) was an American skateboard photographer during the mid-1970s rebirth of skateboarding.\nHe was responsible for reviving Skateboarder Magazine, considered \"the bible\" of skate magazines, and his skateboarding photojournalism helped popularize and define the wheeled sport during its explosive rebirth in the 1970s.  Later in his career, he became an accomplished surfboard photographer in Hawaii.\nBiography\nHis father was a U.S. foreign service officer and travelled extensively as a diplomat.  Bolster moved with his parents and sister to Sydney, Australia in 1963 when his father was appointed US Consul General.  He attended The Scots College. It was here that he learned to surfboard  and skateboard for the first time, at South Bondi in 1965. He was notable for driving a pillarless Ford Galaxie piled with surfboards around the Sydney beaches looking for good waves. This car had consular plates which meant that the toll collectors on the Sydney Harbour Bridge were required to salute as he went through at no charge, to the delight of all the surfers piled inside.\nBolster had been interested in cameras and photography from an early age.  This was especially nurtured by his parents' regular slideshows of family holidays and the many hand-down cameras they gave to him.\nIn 1967, he moved to Cocoa Beach, Florida, attended Brevard Community College and earned a reputation as one of the state's top surfers.  He also began photographing surfing while in Florida.\nBy 1970, Bolster had migrated to San Diego and made skateboards out of old water skis to ensure there was \"a surfboard-like alternative for the few days lacking surf,\" he later recalled.\nIn 1972, he started to be published in and became an associate editor at Surfer Magazine, from 1976-77. During his time at Surfer Magazine, he was given the task of resurrecting Skateboarder Magazine by Steve Pezman, at the time publisher and editor of Surfer. Skateboarder Magazine had released only four quarterly issues in 1964-65, and then ceased publication.  When the skateboard craze subsided, the magazine was dropped due to low sales.\nIn 1976, with the advent of the urethane wheel revolution in skateboarding, which provided greater traction and speed, Bolster had six months to get Skateboarder Magazine running again. As an associate editor, he teamed up with Kurt Ledterman, the other associate editor at Surfer Magazine. Secretary Chris Maxwell (nicknamed Max Criswell by Kurt) made the final member of a trio that would become the re-creators of Skateboarder Magazine.\nPhotographically, Bolster was among the first to use fish-eye lenses, motor-drive sequences and strobes while documenting California's skateboarding culture. For example, Ty Page's multi-faceted, rapid-fire technique and footwork were nothing short of incredible. After trying many times to photograph his footwork, Bolster was forced to purchase a new $3,000 high-speed camera to catch him on film to publish in the August and September 1977 issues of Skateboarder Magazine. Superstar professional skateboarder Tony Hawk said the magazine was the only one worth reading at the time. \"The pictures were always dreamy and left me full of disbelief…. If it weren't for SkateBoarder, I would have never realized what was really possible on my four-wheeled plank,\" Hawk said in the book The Legacy of Warren Bolster: Master of Skateboard Photography.\nBolster remained a staff photographer for Surfer Magazine until 1992.\nHe moved to Hawaii in 1978, where he established himself as an accomplished and widely published freelance surf photographer.  Bolster was constantly on the lookout for new angles, shooting from helicopters and often using a deck-mounted camera to get spectacular photos from behind the surfer, or photos from in front of the surfer’s board. However, for non-surfers, one of Bolster's best known images is the unbroken wave that formed the cover image of Ride's classic shoegazing album Nowhere.\nAs a free-lance photographer, Bolster often struggled financially between assignments.  He was known for putting himself dangerously close to the action he was photographing, often colliding with his subjects or their speeding platforms. He had endured at least a dozen surgeries and many broken bones participating in and documenting surfing activities.  As a result, Bolster battled chronic pain and addiction to a painkiller.\n\"I almost destroyed myself to give a larger life to the sport,\" he wrote in The Legacy of Warren Bolster: Master of Skateboard Photography, a 2004 book.\nHe also suffered from long bouts of depression. Nonetheless, despite his health issues, Bolster remained on the cutting edge of surf photography.\nNine days before his death, Bolster was injured when his car was rear-ended in a serious collision. He died at the age of 59 on September 6, 2006, of a self-inflicted gunshot wound.\nStacy Peralta, a filmmaker, featured Bolster's work in Riding Giants (2004) and Dogtown and Z-Boys (2001).\nBolster's sister, Janet Barnes Tramonte, was the administrative assistant to Chief Justice of the United States William Rehnquist for many years.\nReferences\nFurther reading\n*Gesmer, Daniel (2004) The Legacy of Warren Bolster: Master of Skateboard Photography\n*Marcus, Ben (2006) The Surf World Loses a Legend: Warren Bolster - 1947-2006 [http://surfermag.com/features/onlineexclusives/warrenbolster/index.html obituary]\nExternal links\n*[https://images.google.com/images?q=warren+bolster&hl=en  Miscellaneous Photos by Warren Bolster]\n*[http://starbulletin.com/2002/12/23/features/story1.html  Warren Bolster Surfing Shoot]\n*[http://surfermag.com/features/onlineexclusives/warrenbolster/#loop  Surfer Magazine Obituary]\n*[http://www.skateboardermag.com/skateboarder-news-features/news/wrnblstr/index.html  Skateboarder Magazine Obituary]\n*[http://www.warrenbolster.com/  Personal website]"
    }
  ]
}