{
  "content": [
    {
      "type": "text",
      "text": "# Warren Motte\n\nWarren F. Motte is a Professor of French and Comparative Literature at the University of Colorado Boulder. His focus is contemporary writing, with an emphasis upon experimental, avant-garde, or other subversive forms of both fiction and poetry. Motte has authored or edited many volumes of literary criticism, including the first book-length study of the renowned French writer Georges Perec, an authoritative book on the experimental writing group known as Oulipo, and major studies of other writers such as Edmond Jabès, Marie NDiaye, Christine Montalbetti, Antoine Volodine, and Jean Rolin. Motte's recent books include Mirror Gazing (Dalkey Archive Press, 2014), a study of over 12,000 mirror scenes in literature, and French Fiction Today (Dalkey Archive Press, 2017), devoted to the contemporary French novel. In 2015 Motte was named a Knight in the Ordre des Palmes Académiques by the French Republic. In 2016 he was named a College Professor of Distinction by the University of Colorado Boulder, and in 2018 he was named a Distinguished Professor, the highest honor the University of Colorado awards to its faculty members.\nHe is married to a Frenchwoman with whom he has two sons: Nicholas Motte, a graphic designer, and musician Nathaniel Motte, one half of the American electronic music duo 3OH!3.\nEducation\nMotte received a Bachelor of Arts in English Literature as well as an A.M. and Ph.D. in French literature from the University of Pennsylvania. His doctoral dissertation on Georges Perec was the first book-length study of the now-famous experimental writer. Motte also received a Maîtrise in Anglo-American Literature from the Université de Bordeaux.\nWorks\nBooks\n*The Poetics of Experiment: A Study of the Work of Georges Perec (Lexington: French Forum Monographs, 1984)\n*Questioning Edmond Jabès (Lincoln: University of Nebraska Press, 1990)\n*Playtexts: Ludics in Contemporary Literature (Lincoln: University of Nebraska Press, 1995)\n*Small Worlds: Minimalism in Contemporary French Literature (Lincoln: University of Nebraska Press, 1999)\n*Fables of the Novel: French Fiction Since 1990 (Champaign: Dalkey Archive Press, 2003)\n*Fiction Now: The French Novel in the Twenty-First Century (Champaign: Dalkey Archive Press, 2008)\n*Mirror Gazing (Champaign: Dalkey Archive Press, 2014)\n*French Fiction Today (Victoria: Dalkey Archive Press, 2017)\n*Pour une littérature critique (Lincoln: Zea Books, 2021)\n*Reading Contemporary French Literature (Lincoln: Zea Books, 2022)\nEdited Volumes\n*Oulipo: A Primer of Potential Literature (Lincoln: University of Nebraska Press, 1986, revised edition: Normal: Dalkey Archive Press, 1998, rpt. 2007)\n*Literary Ludics (special issue of L’Esprit Créateur, 31.4, 1991)\n*Alteratives (Lexington: French Forum Monographs, 1993, with Gerald Prince)\n*Jacques Jouet (special issue of SubStance, 96, 2001)\n*Pereckonings: Reading Georges Perec (special issue of Yale French Studies, 105, 2004, with Jean-Jacques Poucel)\n*The French Novel Now (special issue of SubStance, 111, 2006)\n*The Editions P.O.L (special issue of The Review of Contemporary Fiction, 30.3, 2010)\n*Marie NDiaye’s Worlds/Mondes de Marie NDiaye (special issue of L’Esprit Créateur, 53.2, 2013, with Lydie Moudileno)\n*Christine Montalbetti (Special issue of Review of Contemporary Fiction, 35.1, 2015)\n*Experimental Writing (special issue of American Book Review, 37.5, 2016, with Jeffrey Di Leo)\n*Experimental Literature: A Collection of Statements (Aurora: JEF Books, 2018, with Jeffrey Di Leo)\n*Lydie Salvayre, maintenant même (Lincoln: Zea Books, 2021)\nReferences"
    }
  ]
}