{
  "content": [
    {
      "type": "text",
      "text": "# Warren Lewis\n\n| birth_place        = Belfast, Ireland\n| death_date         =\n| death_place        = Oxford, England\n| relatives          = C. S. Lewis (brother)\n| module             =\n}}\nWarren Hamilton Lewis (16 June 1895 – 9 April 1973) was an Irish historian and officer in the British Army, best known as the elder brother of writer and professor C. S. Lewis. Warren Lewis was a supply officer with the Royal Army Service Corps of the British Army during and after the First World War. After retiring in 1932 to live with his brother in Oxford, he was one of the founding members of the Inklings, an informal Oxford literary society. He wrote on French history, and served as his brother's secretary for the later years of C.&nbsp;S. Lewis's life.\nEarly life\nC. S. Lewis referred to his older brother Warren (\"Warnie\") as \"my dearest and closest friend\". Their lifelong friendship was formed as the boys played together in their home on the outskirts of Belfast, Little Lea, writing and illustrating stories for their fantasy world of Boxen (a combination of India and a previous invention called Animal-Land). In 1908, their mother died from cancer and as their father mourned her, C.&nbsp;S. (\"Jack\") and Warren Lewis had only each other for comfort and support. Soon after their mother's death, Jack was sent across the North Channel to join Warren at an English boarding school named Wynyard in Watford, Hertfordshire, just northwest of London, where they suffered under a harsh, mentally ill headmaster named Robert Capron.  Warren had been taken there by his mother Flora on 10 May 1905. In 1909, Warren transferred to Malvern College in Worcestershire, where his brother was also sent a few years later.  Warren completed his education at Malvern in 1913.\nMilitary service\nOn 10 September 1913, Warren Lewis began studying privately with William T. Kirkpatrick for four months in preparation for the entrance examination of the Royal Military College, Sandhurst. He finished 22nd of 201 candidates, winning him a prize cadetship, with which he entered the college on 4 February 1914. This gave him a reduction in the fees payable for his attendance. He passed out of the Royal Military College, after only nine months of training due to wartime need; the normal course of study was 18 months to two years. On 1 October 1914, he was commissioned as a second lieutenant in the Royal Army Service Corps.\nHe was sent to France on 4 November 1914 to serve with the 4th Company 7th Divisional Train in the British Expeditionary Force. He was made a temporary captain on 24 September 1916.\nAfter the end of the First World War, Warren served in such postings as Belgium (1919), Aldershot (November 1919), Sierra Leone (9 March 1921 to 23 March 1922), Colchester (4 October 1922 to December 1925), Woolwich (January 1925 until April 1927), and China (two tours of duty, the first beginning on 11 April 1927 in the British colony of Hong Kong, then later in Shanghai, and ending in April 1930; the second beginning on 9 October 1931 and ending on 14 December 1932). He retired on 21 December 1932 with the rank of captain, after 18 years of active service. He was granted the temporary rank of major when recalled to active service on 4 September 1939.\nAfter World War II, he took up residence with his brother at a house named The Kilns at Headington, near Oxford, where he lived until the death of C. S. Lewis in November 1963.\nWritings\n]]Soon after his first retirement in 1932, Warren Lewis edited the Lewis family papers. During his final retirement, he began researching a topic of his lifelong interest: the history of 17th-century France. He published seven books on France during the reign of Louis XIV under the name W.&nbsp;H. Lewis, including The Splendid Century: Some Aspects of French Life in the Reign of Louis XIV and ''Levantine Adventurer: The travels and missions of the Chevalier d'Arvieux, 1653–1697. An excerpt from The Splendid Century appeared first in Essays Presented to Charles Williams'', a volume edited by his brother as an informal Festschrift to benefit Williams's widow.\nAfter C.&nbsp;S. Lewis died in 1963, Warren edited the first published edition of his brother's letters (1966), adding a memoir of his brother as a preface to the letters.  Later editions of these letters were edited by Walter Hooper.\nBefore his death, Warren deposited many of the Lewis family papers in the Marion E. Wade Collection of Wheaton College, including surviving papers of C.&nbsp;S. Lewis and himself.  In 1982, selections from Warren Lewis's diary were published under the title Brothers and Friends.\nPersonal life\nWarren Lewis renewed his Christian faith beginning in May 1931. He was a frequent participant in weekly meetings of the Inklings and recorded comments about them in many of his diary entries. During the 1930s, the Lewis brothers undertook eight annual walking tours of as many as 50 miles (80&nbsp;km), which Warren years later recalled with fondness, saying, \"And jolly good fun they were too.\"\nAccording to Douglas Gresham, his step-nephew, and his brother's letters to Arthur Greeves, Warren Lewis was an alcoholic.\nWarren Lewis was buried in the churchyard of Holy Trinity Church, Headington, Oxford, where he is interred in his brother's grave.\nPublications\n* The Lewis Papers: Memoirs of the Lewis Family. Printed privately in 1933.\n* \"The Galleys of France.\" In Essays Presented to Charles Williams. Oxford University Press. Oxford. 1947.\n* The Splendid Century: Some Aspects of French Life in the Reign of Louis XIV. Eyre & Spottiswoode. London. 1953.\n* The Sunset of the Splendid Century: The Life and Times of Louis Auguste de Bourbon, Duc de Maine. Eyre & Spottiswoode. London. 1955.\n* Assault on Olympus: The Rise of the House of Gramont between 1604 and 1678. Andre Deutsch. London. 1958.\n* Louis XIV: An Informal Portrait. Andre Deutsch. London. 1959.\n* ''The Scandalous Regent: A Life of Philippe, Duc d'Orleans, and of his family. Andre Deutsch. London. 1961.\n* Levantine Adventurer: The Travels and Missions of the Chevalier d'Arvieux. Andre Deutsch. London. 1962.\n* Memoirs of the Duc de Saint-Simon. B. T. Batsford. London. 1964.\n* Letters of C. S. Lewis (as editor). Geoffrey Bles Ltd. London. 1966.\nFurther reading\n* Finding Narnia: The Story of C. S. Lewis and His Brother'' by Caroline McAlister; illustrated by Jessica Lanan. Roaring Brook Press, 2019. (Children's picture book biography of the brothers.)\nReferences\nSources\n* Diana Glyer.  The Company They Keep: C. S. Lewis and J. R. R. Tolkien as Writers in Community. Kent State University Press. Kent Ohio. 2007.\n* Joel D. Heck. Warren Hamilton Lewis: His Brother’s Brother. The Chronicle of the Oxford University C. S. Lewis Society, Vol. 6, No. 3 (2009):3-22.\n* Clyde S. Kilby and Marjorie Lamp Mead. Brothers and Friends: The Diaries of Major Warren Hamilton Lewis. Harper & Row Publishers. San Francisco. 1982.\n* Warren H. Lewis. The Lewis Papers: Memoirs of the Lewis Family . Unpublished manuscripts housed in the Marion E. Wade Center. Wheaton, Illinois.\n* John Smyth. Sandhurst: The History of the Royal Military Academy, Woolwich, the Royal Military College, Sandhurst, and the Royal Military Academy, Sandhurst 1741–1961. London: Weidenfeld & Nicolson, 1961.\n* Hugh Thomas. The Story of Sandhurst. London: Hutchinson & Co., 1961.\n*A. N. Wilson, C. S. Lewis: A Biography. W. W. Norton, 1990. ISBN\n*  }}\nExternal links\n*  (chiefly as 'Lewis, W. H. (Warren Hamilton), 1895–' without '1973', see previous page of browse report)"
    }
  ]
}