{
  "content": [
    {
      "type": "text",
      "text": "# Warrior Run School District\n\nWarrior Run School District region in Northumberland County\nWarrior Run School District region in Montour County\nWarrior Run School District is a small, rural, public school district that covers . It spans townships in three different counties: Gregg Township in Union County, Delaware Township and Lewis Township in Northumberland County, and Anthony Township, and Limestone Township in Montour County in central Pennsylvania, US. It also serves the residents of the boroughs of Turbotville, McEwensville and Watsontown. In 2010, the US Census Bureau reported that the District's population increased to 17,278 people. According to 2000 federal census data, Warrior Run School District served a resident population of 16,542. The educational attainment levels for the Warrior Run School District population (25 years old and over) were 81.8% high school graduates and 11.2% college graduates. The district is one of the 500 public school districts of Pennsylvania. It is one of nine public school districts in Pennsylvania that cross three or more county lines.\nAccording to the Pennsylvania Budget and Policy Center, 48.6% of the District's pupils lived at or below the Federal Poverty level as shown by their eligibility for the federal free or reduced price school meal programs in 2012. In 2009, the residents' per capita income was $15,727, while the median family income was $43,010. In Northumberland County, the median household income was $38,387. In the Commonwealth, the median family income was $49,501 and the United States median family income was $49,445, in 2010. By 2013, the median household income in the United States rose to $52,100.\nFor the 2011–12 school year, the district had 1,664 pupils. It employed: 140 teachers, over 100 full-time and part-time support personnel, and 13 administrators. The District received $9,282,738 in state funding in the 2011–12 school year. According to District officials, in school year 2009–2010, Warrior Run School District provided basic educational services to 1,672 pupils. The District employed: 141 teachers, 102 full-time and part-time support personnel, and 13 administrators. WRSD received more than $8.7 million in state funding in school year 2009–2010.  Per district officials, in school year 2005–06, the Warrior Run School District provided basic educational services to 1,802 pupils through the employment of 144 teachers, 111 full-time and part-time support personnel, and 14 administrators.\nWarrior Run School District operates Turbotville Elementary School, Warrior Run Middle School, and Warrior Run High School. The school district was formed from the combination of the former Turbotville-Lewis Township School District and Watsontown School District. High school students may choose to attend Lycoming Career and Technology Center for training in the building trades. The Central Susquehanna Intermediate Unit IU16 provides the District with a wide variety of services like specialized education for disabled students and hearing, speech and visual disability services and professional development for staff and faculty.\nExtracurriculars\nThe Warrior Run School District offers a variety of extracurriculars, including clubs, activities and an extensive sports program.\nSports\nThe District funds:\n;Boys:\n*Baseball - Varsity and JV teams AAA\n*Basketball- AAA\n*Cross Country - Class AA\n*Football - Varsity and JV teams AA\n*Golf - AA\n*Soccer - AA\n*Track and Field - AA\n*Wrestling - AA\n;Girls:\n*Basketball - AAA\n*Cross Country - A\n*Field Hockey - A\n*Golf - AA\n*Soccer (Fall) - A\n*Softball - Varsity and JV teams AAA\n*Track and Field - AA\n;Middle School Sports:\n;Boys:\n*Basketball\n*Cross Country\n*Football\n*Soccer\n*Wrestling\n;Girls:\n*Basketball\n*Cross Country\n*Field Hockey\n*Soccer\n*According to PIAA directory July 2012  Updated per 2017 Directory\nReferences"
    }
  ]
}