{
  "content": [
    {
      "type": "text",
      "text": "# Warralong Community\n\n| pushpin_label_position   =\n| map_alt                  =\n| pop                      = 174\n| pop_year                 =\n| pop_footnotes            =\n| poprank                  =\n| density                  =\n| density_footnotes        =\n| established              =\n| established_footnotes    =\n| abolished                =\n| gazetted                 =\n| postcode                 = 6760\n| elevation                =\n| elevation_footnotes      =\n| area                     =\n| area_footnotes           =\n| timezone                 =\n| utc                      =\n| timezone-dst             =\n| utc-dst                  =\n| dist1                    = 120\n| dir1                     = SE\n| location1                = Port Hedland\n| lga                      = East Pilbara\n| region                   =\n| county                   =\n| stategov                 = Pilbara\n| fedgov                   = Durack\n| url                      =\n| maxtemp                  = 35.3\n| maxtemp_footnotes        =\n| mintemp                  = 19.9\n| mintemp_footnotes        =\n| rainfall                 = 361.7\n| rainfall_footnotes       =\n| near-n                   =\n| near-ne                  =\n| near-e                   =\n| near-se                  =\n| near-s                   =\n| near-sw                  =\n| near-w                   =\n| near-nw                  =\n| near                     =\n| footnotes                =\n}}\nWarralong is a small Aboriginal community, located  south east of Port Hedland and  north of Marble Bar in the Pilbara region of Western Australia, within the Shire of East Pilbara. The community lies between the Shaw and De Grey Rivers.\nHistory\nIndigenous Australians have lived in the area for thousands of years. The first European to arrive in the area was Francis Thomas Gregory, who travelled through as part of his expedition in 1861. Pastoralists soon followed and established both sheep and cattle stations throughout the area displacing the Indigenous inhabitants but employing them as cheap labour leading to the 1946 Pilbara strike.\nThe community was established as an offshoot of the Strelley Station, a pastoral lease that operated as a sheep station and later became a cattle station. An Indigenous group, the Nomads, which remained connected to Don McLeod until his death in 1999, acquired a number of pastoral leases including those at Coongan and Strelley in 1972. The Aboriginal community at Strelley had more than 800 residents until social problems caused by alcohol from the nearby town in Port Hedland led to the group's mass exodus from Strelley to other locations including Warralong. The pastoral leases continued to operate despite following brucellosis outbreak and were never abandoned or relinquished.\nAn alcohol ban was formally imposed on the community in 2013 following a spate of alcohol-induced violent incidents.\nNative title\nThe community is located within the Nyamal native title determination.\nEducation\nA school was originally established at Strelley in 1976 and later one at a Warralong and another at Woodstock. Children of school age attend the Strelley Community School (Warralong campus and Strelley campus), which specialises in traditional languages and on-country learning. The school at Strelley was badly damaged by Cyclone George in 2007 and reopened in 2009. Woodstock campus was closed in 2008 due to a decline in students.\nThe school is the centre of community life and is actively combating many community problems through education, such as the littering issue.\nGovernance\nThe community is the subject of a Housing Management Agreement between the Western Australian Government Housing Authority and the owners of the Coongan Pastoral Lease. The community school at Warralong is operated by The Nomads Charitable & Educational Foundation, which was established by Don McLeod and Ray Butler in 1971. The Nomads group also operate a remote Aboriginal community school at Strelley; the school is the oldest continuously operational school of its type in Australia.\nTown planning\nWarralong Layout Plan No.1 has been prepared in accordance with State Planning Policy 3.2 Aboriginal Settlements. Layout Plan No.1 was endorsed by the community on 1 March 2006 and the Western Australian Planning Commission on 31 October 2006.\nReferences\nExternal links\n* [http://register.oric.gov.au/document.aspx?concernID=101877 Office of the Registrar of Indigenous Corporations]\n* [http://www.nntt.gov.au/Applications-And-Determinations/Search-Applications/Pages/Application.aspx?tribunal_file_no=WC95/61 Native Title Claimant application summary]"
    }
  ]
}