{
  "content": [
    {
      "type": "text",
      "text": "# Warren Cole Smith\n\n| birth_place = Memphis, Tennessee\n| occupation  = President of MinistryWatch\n| education   = University of Georgia\n| spouse      = Missy Smith\n| children    = 4\n}}\nWarren Cole Smith (born July 11, 1958) is an American author and journalist. He is the president and editor-in-chief at MinistryWatch. He is the author or co-author of more than a dozen books and more than 3000 magazine and newspaper articles, many of them for WORLD Magazine.\nCareer\nUpon graduation, Smith worked for the Georgia House of Representatives as an attaché and the editor of the House Journal, an archive of the proceedings of the 1981 session. He then moved to Alaska to work for Wien Air Alaska, where he managed a fishing lodge, Brooks Lodge, owned by Wien.\nAfter three years in Alaska, he returned to the University of Georgia, where he completed a Master of Arts in English in 1985. He then taught high school English for a year at Athens Academy, a private college preparatory school in Athens, Georgia. He then served as the editor of North Fulton Magazine, a lifestyle magazine serving the affluent Atlanta suburbs of Roswell and Alpharetta. He also served for seven years as a marketing manager for the global accounting and consulting firm PricewaterhouseCoopers.\nSmith left PwC in 2000 to serve as president of World Newspaper Publishing, a company that owned seven Christian newspapers, mostly in the Southeastern United States, as well as the Evangelical Press News Service, which at the time was used by more than 100 Christian newspapers around the country. He served as vice president and associate publisher for WORLD Magazine, an evangelical news magazine, from 2010 through 2015. He also served as the vice president of mission advancement for the Colson Center for Christian Worldview from 2015 until 2019.\nSmith has served as the president and editor-in-chief of MinistryWatch since 2019.\nControversies\nMars Hill Church\nWhile writing for WORLD Magazine, Smith was the first to report on significant aspects of the scandal at and ultimate demise of Mars Hill Church.\nShepherds for Sale\nSmith found himself at the center of a controversy regarding the book Shepherds for Sale, by Megan Basham. The book made The New York Times Best Seller list despite being criticized for inaccuracies. A number of people mentioned in the book have publicly contested its assertions. Smith, writing for The Dispatch, suggested that the book was not journalism but propaganda.\nRick Pidcock of Baptist News Global cited Smith and said that Basham \"resorts to lies and conspiracy theories to make her case.\" According to Smith, the \"fundamental flaw\" of Basham's book is that \"corrupting money is not on the evangelical left, as she claims, but on the populist right.\" Smith went on to suggest that the book \"has many villains, but it has only one true hero: Donald J. Trump. He is mentioned more than 30 times in the book, all positively or defensively.\" Smith argued that Shepherds for Sale \"purports to fight for the Gospel against heretics, but Basham is waging a proxy war, defending Trump against his evangelical critics.\"\nAslan International\nMinistryWatch’s coverage of Aslan International Group became a national story, resulting in Smith being interviewed by NBC News.\nPersonal life\nHe lives with his wife Missy in Charlotte, North Carolina.\nSelected bibliography\nBooks\n*\n*\n*\n*\n*\n*\nArticles\n*\n*\n*\nReferences"
    }
  ]
}