{
  "content": [
    {
      "type": "text",
      "text": "# Warri Crisis__disambig_1\n\nThe Warri Crisis was a series of conflicts in Delta State, Nigeria between 1997 and 2003 between the Itsekiri and the Ijaw ethnic groups. Over 200,000 people were displaced by the Warri conflict between 1999 and 2006. Over 700,000 people were displaced during this period by violence in Delta State overall.\nThe conflict broke out following the Ijaws refusal to accept the location of the Headquarters of the Warri South West Local Government Council (LGA) in Ogidigben, an Itsekiri community. The Council headquarters was eventually moved to Ogbe Ijoh, an Ijaw community by the State Govt; however it remains Ogidigben in Nigeria’s constitution.\nThe Warri Crisis is part of a broader conflict over oil in the Niger Delta. Human Rights Watch determined that \"although the violence has both ethnic and political dimensions, it is essentially a fight over the oil money.\" Ongoing armed conflict in the Niger Delta region, and the appearance of the Movement for the Emancipation of the Niger Delta (MEND) in 2005 are continued expressions of these tensions.\nScholars have warned that the conflict is complex and not amenable to \"quick fixes\".\nBackground\nEthnic tensions around control of the Warri region pre-date European presence, but colonisation exacerbated these tensions by introducing power imbalances. This power imbalance was drastically accelerated during the British colonial process of \"reorganization\" that took place between 1928 and 1938 after an \"anti-government movement\" which British colonial officials termed the 1927 boycott. The intention of the reorganization process was to create a better indirect rule system that was based on what the British colonial officers at the time referred to as \"native authority\", however, the result of the reorganization in the Warri Province was a zero-sum ethic consolidation, as the more ethinically discrete a governing unit was the more access it had to state resources from tax revenues.\nThe Itsekiri were first in the area to make contact with European traders in the 15th century, and they established dominance in the region by monopolising the European trade in slaves and later palm oil. The Itsekiri also established control of land through early legal documents during the British Empire.\nOil-related conflict\nThe discovery of large oil reserves in the Niger Delta in the early 1960s further destabilised the region, as control of land and local government became connected to benefits from oil contracts, jobs, and development by the oil companies.\nThe Warri crisis is a complex case where ethnic tensions are exacerbated by conflict between local communities and oil companies (notably Chevron Nigeria and Shell Petroleum Development Company). There is also conflict between the communities and the state. Access to oil revenue is a major factor. Oil bunkering is the theft of crude oil by various parties including militant groups, and has been increasingly important in the area with annual losses between 50 and 300 million barrels between 2001 and 2003. Oil money also feeds the arms trade and the further militarisation of all aspects of civic and corporate behavior.\nThere are extensive environmental issues in the Niger Delta resulting from oil activities. Millions of barrels of oil were spilled in a 50-year period following the discovery of oil – an amount equal to an Exxon Valdez oil spill every year. People in the region also receive few benefits from the enormous wealth extracted from the region: the area is plagued by administrative neglect, unemployment, crumbling infrastructure, poverty, and endless conflict. The pollution has made people more reliant on income from oil companies, as traditional modes such as farming and fishing are no longer possible in the polluted environment. Many services traditionally provided by governments, such as local security, are delegated to the oil companies with little accountability.\nViolence (1997–2003)\nIn 1997, the federal government under General Sani Abacha created several Local Government Areas (LGAs), including Warri South-West. The headquarters of this LGA is Ogidigben. The Ijaw-Itsekiri conflict in Delta State, including time period, causes, whether the authorities intervened, whether the police support the Ijaw or Itsekiri and the current situation ]  [NGA29098.E], 06. April 1998 (referenced 20 August 2017) Riots ensued, hundreds died, and six Shell Nigeria (SPDC) installations were taken over, leading to a drop in oil production. Thousands were injured in these initial clashes.\nFighting renewed in 1999 and continued intermittently. Hundreds of people were killed over a period of several months in early 2003 when conflict broke out between the Itsekiris and the Urhobos during primary elections for state and federal governments. The dispute arose from disagreements about the number of wards making up the district and their boundaries. The Nigerian Red Cross reported more than 6,000 internally displaced people.\nThe 2003 unrest involved the biggest military operation against civilians in Nigeria at the time. Some military personnel were killed, and there were reports of indiscriminate reprisals against civilians.\nThe headquarters was relocated to Ogbe Ijoh by the Delta State House of Assembly, a decision that brought relative peace back to the city by 2005.\nImpact and legacy\nOver 200,000 people were displaced by the Warri conflict between 1999 and 2006; over 700,000 people were displaced by violence in Delta State overall.\nThe 2003 conflicts interrupted oil production. Chevron Texaco lost about 140,000 barrels of crude oil per day, and Shell Petroleum lost about 60,000 barrels per day. The Escravos pipeline was blown up by militant youths.\nOngoing armed conflict in the Niger Delta region, and the appearance of the Movement for the Emancipation of the Niger Delta (MEND) in 2005 are continued expressions of these tensions.\nSee also\n* Environmental justice\n* Environmental racism\n* Oil theft in Nigeria\nReferences\nExternal links\n* [https://www.hrw.org/reports/2003/nigeria1103/index.htm The Warri Crisis: Fueling Violence] , 2003 report by Human Rights Watch\n* [https://www.hrw.org/legacy/reports/1999/nigeria/nigeria0199.pdf THE PRICE OF OIL Corporate Responsibility and Human Rights Violations in Nigeria’s Oil Producing Communities]. 1999 report by Human Rights Watch\n* [http://wikileaks.org/plusd/cables/03ABUJA718_a.html Nigeria: Warri Crisis Coming to a Head], wikileaks.org. Date:2003 April 17, 22:26\n* [http://waado.org/Organizations/UNF/Itsekiri_StateDept.html Letters to State Department on Warri Crisis] ; Urhobo Historical Society"
    }
  ]
}