{
  "content": [
    {
      "type": "text",
      "text": "# Warren Hawke\n\n| birth_date =\n| birth_place = Durham, England\n| position = Striker\n| years1  = 1988–1993\n| years2  = 1991\n| years3  = 1992\n| years4  = 1993\n| years5  = 1993\n| years6  = 1993\n| years7  = 1993–1995\n| years8  = 1995–1999\n| years9  = 1999–2001\n| years10 = 2001–2005\n| clubs1  = Sunderland\n| clubs2  = → Chesterfield (loan)\n| clubs3  = → Carlisle United (loan)\n| clubs4  = → Northampton Town (loan)\n| clubs5  = Raith Rovers\n| clubs6  = Scarborough\n| clubs7  = Berwick Rangers\n| clubs8  = Greenock Morton\n| clubs9  = Queen of the South\n| clubs10 = Greenock Morton\n| caps1  = 25\n| caps2  = 7\n| caps3  = 8\n| caps4  = 7\n| caps5  = 2\n| caps6  = 1\n| caps7  = 55\n| caps8  = 145\n| caps9  = 55\n| caps10 = 64\n| goals1  = 1\n| goals2  = 1\n| goals3  = 2\n| goals4  = 1\n| goals5  = 0\n| goals6  = 0\n| goals7  = 28\n| goals8  = 34\n| goals9  = 7\n| goals10 = 9\n| totalcaps = 369 | totalgoals = 83\n}}\nWarren Robert Hawke (born 20 September 1970) is an English former footballer who played for Sunderland, Berwick Rangers, Greenock Morton and Queen of the South. Although he never started more than three games in a season during his time at Sunderland he is remembered for playing in the 2-0 play-off semi-final win at Newcastle United in 1990, while one of his 19 substitute appearances was in the 1992 FA Cup Final.\nPost football\nSince retiring from football, Hawke has taken up endurance events and bespoke challenges. Completing the Regensburg IronMan Triathlon on 7 August 2011 and Copenhagen 2016 both sub 12 hours .\nHe also swam the full length (24 miles) of Loch Lomond in 2014 and completed numerous one and multi day cycling challenges.\nHawke took up the post of consultant for club development at his former club Greenock Morton in January 2012. In June 2015, Hawke was co-opted onto the club's board of directors. On 9 January 2017, Hawke was appointed chief executive of Morton, replacing Gillian Donaldson who previously held the role.\nHe was appointed director at SPFL in 2017 as the Championship representative\nResigning from Greenock Morton in 2019 he has now set up his own company Strenua Ltd who deliver sports consultancy services to clubs, charities and individuals.\nFamily\nHawke's son Lewis (born 1993) also played for Morton as a forward.\nHe also has two daughters named Ruby and Leni\nExternal links\n*\nReferences"
    }
  ]
}