{
  "content": [
    {
      "type": "text",
      "text": "# Warren Miller (West Virginia congressman)__disambig_1\n\n| birth_place  = Apple Grove, Ohio, US\n| death_date   =\n| death_place  = Ripley, West Virginia, US\n| spouse       =\n| children     =\n| religion     =\n| occupation   = Attorney\n| residence    =\n| alma_mater   = Ohio University\n}}\nWarren Miller (April 2, 1847 &ndash; December 29, 1920) was a lawyer and Republican politician from West Virginia who served as a United States representative in the 54th and 55th United States Congresses, as well as both houses of the West Virginia legislature Senate and on the West Virginia Supreme Court of Appeals.\nEarly and family life\nMiller was born at Apple Grove in Meigs County, Ohio. Around 1850, his family moved to Millwood, Virginia in Jackson County, in what later became West Virginia, and he received a private education suitable for his class, since Virginia had no public schools at the time. He graduated from the Ohio University at Athens.\nCareer\nMiller taught school and studied law.\nHe was admitted to the bar and commenced practice in Ripley, West Virginia the county seat, in 1871. He also served as mayor of Ripley in 1871. He became prosecuting attorney for Jackson County and nearby Wirt and Roane counties in 1878 and served until 1890. He was chosen to be a delegate to the 1884 Republican National Convention. He was a member of the West Virginia House of Delegates in 1890 and 1891.\nin 1892, his bid to become a judge of the State Supreme Court failed. However, three years later Miller won election to the Fifty-fourth and Fifty-fifth Congresses (March 4, 1895 &ndash; March 3, 1899), he was not a candidate for renomination in 1898. He returned to the practice of law and also farmed.\nJudge Miller was appointed to the Fifth Judicial Circuit Court of West Virginia, then elected to the court in 1902 and 1903 and 1904 served on  the West Virginia Supreme Court of Appeals. He won election to the West Virginia Senate and served from 1914  to 1918.\nDeath and legacy\nJudge Miller died in Ripley, and was buried in Cottageville Cemetery in Cottageville, West Virginia, both in Jackson County.\nSee also\n*United States congressional delegations from West Virginia\nReferences\nExternal links\n*  Online. September 11, 2007\n* [http://politicalgraveyard.com/geo/WV/JA-buried.html The Political Graveyard]\n* [http://www.govtrack.us/congress/members/warren_miller/407739 GOvtrack.us]"
    }
  ]
}