{
  "content": [
    {
      "type": "text",
      "text": "# Warren Weinstein\n\n| birth_place   =\n| death_date    =\n| death_place   = Waziristan, Pakistan\n| nationality   = American\n| other_names   =\n| alma_mater    = Columbia University\n| occupation    = Aid worker\n| years_active  =\n| known_for     = contributions to the field of economic development\n| notable_works =\n}}\nWarren Weinstein (July 3, 1941 – January 15, 2015) was an American contractor, and director in Pakistan for J.E. Austin Associates, a firm which increases business competitiveness and growth in developing economies.\nHe was kidnapped by eight al-Qaeda members on August 13, 2011, in Lahore, Pakistan. He was unintentionally killed in a January 2015 US drone strike on the Afghanistan-Pakistan border, as announced by U.S. President Barack Obama at a White House press conference on April 23, 2015.\nLife\nHe earned an MA in international relations, and a PhD degree in international law and economics, from Columbia University.\nIn the 1970s, he was a professor in the political science department at the State University of New York at Oswego, leaving in 1979 to work on economic development with USAID. In the 1980s, he was  the Peace Corps director in Togo.\nAt the time of his kidnapping, Weinstein was living in Lahore, Pakistan and working as a Country Director of Operations for the Virginia-based development company J.E. Austin Associates. His work reportedly involved supervising a four-year $11-million \"competitiveness project\", funded by the American government, which was involved in dairy, horticulture, furniture and medical equipment projects. He spoke six foreign languages and had 25 years of experience in international development projects.\nEight armed kidnappers arrived at his house on the morning of August 13, 2011, just when his guards were having food and starting their Ramadan fasting. According to one of them, the kidnappers knocked and when he opened the door, he saw three men standing; they offered meals to him and when he politely refused, five more men stormed the house from the back door and overpowered all the guards, tying their hands behind their backs. They then made Weinstein's driver knock on his bedroom door, and grabbed Weinstein when he opened it.\nKidnapping for ransom is common.\nThree guards and his driver were being held.\nOn November 1, 2011, arrests were made in the case.\nOn December 1, 2011, al-Qaeda leader Ayman al-Zawahiri claimed to be holding him.\nIn January 2012, he was reported held in North Waziristan, by Lashkar-e-Jhangvi.\nIn May 2012, al-Qaeda released a proof-of-life video of Weinstein. Two more followed that September, and a fourth was released in December 2013.\nDeath\nOn January 15, 2015, Weinstein was accidentally killed in one of a series of unmanned aircraft strikes in Waziristan, Pakistan, along with an Italian hostage, Giovanni Lo Porto, and American al Qaeda leaders Ahmed Farouq and Adam Gadahn, the White House announced on April 23, 2015. The White House said it was unaware that any of the victims were present at the sites targeted. They were killed by a \"signature strike\", one that is launched based on behavioural evidence around a site suggesting a high-value target is inside, without knowing who is actually inside.\nFollowing the announcement, his wife, Elaine, called the government's assistance during Weinstein's years in captivity \"inconsistent and disappointing\",  echoing criticism similar to that expressed by the parents of other killed prisoners, including James Foley and Kayla Mueller. \"We hope that my husband’s death and the others who have faced similar tragedies in recent months will finally prompt the U.S. Government to take its responsibilities seriously and establish a coordinated and consistent approach to supporting hostages and their families,\" she said in a media statement.\nWorks\n*Warren Weinstein, John J. Grotpeter, The pattern of African decolonization: a new interpretation, Program of Eastern African Studies, Syracuse University, 1973,\n*Chinese and Soviet aid to Africa, Praeger Publishers, 1975,\n*Warren Weinstein, Robert A. Schrire, Political conflict and ethnic strategies: a case study of Burundi, Maxwell School of Citizenship and Public Affairs, Syracuse University, 1976\n*Soviet and Chinese aid to African nations, Praeger, 1980,\n*A sea of troubles: decolonization in Burundi, 1958-1962, University Microfilms International, 1985\n*Ellen K. Eggers, Warren Weinstein, Historical dictionary of Burundi, Scarecrow Press, 1997,\nSee also\n*Foreign hostages in Pakistan\n*List of kidnappings\n*List of solved missing person cases\nReferences\nExternal links\n*\n*\n*\n*\n*http://articles.cnn.com/2011-08-13/world/pakistan.kidnapping_1_security-guards-lahore-police-embassy?_s=PM:WORLD\n*http://articles.cnn.com/2011-08-23/world/pakistan.american.kidnapped_1_security-guards-senior-lahore-police-kidnapping?_s=PM:WORLD\n*[https://web.archive.org/web/20111121082314/http://openchannel.msnbc.msn.com/_news/2011/08/19/7417629-us-remains-puzzled-by-abduction-of-popular-development-expert MSNBC]\n*\n*\n*\n*"
    }
  ]
}