{
  "content": [
    {
      "type": "text",
      "text": "# Warren Allmand\n\n| image            = Warren Allmand greyscale photo.jpg\n| office2          = Solicitor General of Canada\n| term_start2      = November 27, 1972\n| term_end2        = September 13, 1976\n| primeminister2   = Pierre Trudeau\n| predecessor2     = Jean-Pierre Goyer\n| successor2       = Francis Fox\n| riding8          = Notre-Dame-de-Grâce\n| parliament8      = Canadian\n| term_start8      = November 8, 1965\n| term_end8        = February 2, 1997\n| predecessor8     = Edmund Tobin Asselin\n| successor8       = Marlene Jennings\n|office5=Minister of Indian Affairs and Northern Development\n|term_start5=September 14, 1976\n|termend5=September 15, 1977\n|primeminister5=Pierre Trudeau\n|predecessor5=Judd Buchanan\n|successor5=Hugh Faulkner\n|office4=Minister of Consumer and Corporate Affairs\n|term_start4=September 16, 1977\n|termend4=June 3, 1979\n|primeminister4=Pierre Trudeau\n|predecessor4=Tony Abbott\n|successor4=Allan Lawrence\n| birth_name       = William Warren Allmand\n| birth_date       =\n| birth_place      = Montreal, Quebec, Canada\n| death_date       =\n| death_place      = Montreal, Quebec, Canada\n| spouse           =\n| relations        =\n| children         = 3\n| party            = LiberalUnion Montreal\n| residence        = Montreal, Quebec\n| alma_mater       =\n| profession       =Lawyer\n| cabinet          =\n}}\nWilliam Warren Allmand  (September 19, 1932 – December 7, 2016) was a Canadian politician who served as a Member of Parliament in the Parliament of Canada from 1965 to 1997. A member of the Liberal Party, he represented the Montreal riding of Notre-Dame-de-Grâce and served in the cabinet of Prime Minister Pierre Trudeau from 1972 to 1979. As Solicitor General, Allmand introduced legislation that successfully abolished the death penalty in Canada in 1976.\nAfter leaving federal politics, Allmand took on the role of human rights activist, and led the International Centre for Human Rights and Democratic Development and the World Federalist Movement-Canada. He briefly returned to politics by serving a term from 2005 to 2009 as a Montreal city councillor under Gérald Tremblay's Union Montreal party, becoming vice president of the city council. Allmand died on December 7, 2016, from terminal brain cancer.\nEarly life and career\nWilliam Warren Allmand was born in Montreal on September 19, 1932, and was raised in the Mile End neighbourhood. He had a Jesuit education at Loyola College in Montreal. He attended St. Francis Xavier University in Antigonish, Nova Scotia, and graduated in 1954 with a bachelor's degree in economics.\nAllmand studied civil law at McGill University, and graduated in 1957 with a bachelor of civil law degree. During his time at McGill, he was the chairman of the faculty of education in 1956–57. He was also a member of the university's Newman Club and played three years of varsity ice hockey for the McGill Redmen. After graduation, Allmand was admitted into the Quebec bar in 1958. He also earned certificates in comparative law at the University of Paris and at the Institute of Comparative Law.\nFederal politics\nIn the 1965 federal election, Allmand ran for the Liberal Party of Canada in the Montreal riding of Notre-Dame-de-Grâce, and was elected to the Parliament of Canada. He would serve his constituency for over 30 years, being re-elected in every subsequent election before stepping down in 1997.\nAs a backbencher, Allmand was a strong advocate for stronger gun laws in Canada, supporting regulations on all Canadian gun owners and limiting access to all guns, including those for hunting. In 1971, he proposed a bill to only permit government stores to sell guns. The bill also proposed an application process which included a waiting period during which the gun purchase was publicly listed to allow anyone to object. Allmand also proposed requiring gun owners to compile annual reports on their gun use and the condition of the gun, and to return their guns to the government when no longer used. Allmand continued to advocate for gun control laws upon his appointment to cabinet.\nIn 1967, after Charles de Gaulle said \"Vive le Québec libre\" while on a state visit to Canada during Expo 67, Allmand sent a message to Paul Martin Sr., the External Affairs Minister, that the rest of the trip must be cancelled.\nSolicitor General\nAllmand was sworn into the Privy Council on November 27, 1972 when he succeeded Jean-Pierre Goyer as Solicitor General for Pierre Trudeau, a post he held until September 13, 1976. Serving in the aftermath of the October Crisis, he testified before the Keable commission, which examined police misconduct.\nIn 1976, Allmand signed a warrant requested by Michael Dare, the Director-General of Royal Canadian Mounted Police Security Service, to authorize them to intercept the mail of a Toronto couple. The couple were suspected of conspiring with the Japanese Red Army, possibly to attack the upcoming 1976 Summer Olympics. After the Department of Justice advised Allmand it was a violation of the Post Office Act, it was cancelled in December 1976, nine months after it had been granted.\nIn December 1976, Allmand was Solicitor General when Leonard Peltier was extradited to the United States. According to Allmand, the Federal Bureau of Investigation submitted false information to the Canadian government, including an affidavit from a woman with mental disorders who claimed to be Peltier's girlfriend.\nIn 1977, after Allmand was no longer Solicitor General, he testified before the Royal Commission of Inquiry into Certain Activities of the RCMP (the McDonald Commission) that the RCMP had advised him that it was legal for them to break into buildings to conduct warrantless searches as long as they did not take anything. Allmand would later state that the RCMP had been dishonest in withholding information from him and other solicitors general.\nAbolishing the death penalty\nAfter Trudeau's Liberals upgraded their minority government to a majority in the 1974 federal election, they had more leeway to act on abolishing capital punishment. In 1973, Liberals had renewed the provisions of Bill C-168, passed by Lester B. Pearson's minority government in 1968, which imposed a five-year moratorium on the use of the death penalty. With a majority behind them, Allmand and Trudeau, both ardent abolitionists, prepared to go further than Pearson had gone and decided to try and abolish the death penalty altogether.\nAllmand felt it was hypocritical to have the law on the books when Parliament had commuted every death sentence since 1962. He also felt that it was illegitimate to grant the Cabinet and the judiciary the power over an individual person's ultimate fate, noting that it is not in line with the values held by Canadian society. Because of these views, Canada's official hangman called for his resignation.\nIn 1976 Allmand tabled Bill C-84, An Act to Amend the Criminal Code in Relation to the Punishment for Murder and Certain Other Serious Offences, the bill that would remove the death penalty from the Criminal Code and abolish its use in Canada. A sentence of life imprisonment with no chance of parole for a minimum of 25 years was substituted instead. 119 parliamentarians spoke for or against the bill over the course of the debate, with members of both the Liberal and Progressive Conservative parties divided in their support of the bill.\nOpponents of the bill cited recent polling that 70% of Canadians supported capital punishment and called on the government to call a national referendum on the issue. Other opponents accused Allmand and Trudeau of proposing the bill now so that it would not expire before the next federal election in 1979 and risk costing the Liberals votes. Almost all opponents thought that the death penalty was a necessary response to terrorism, insurrection, and other serious crimes. Former Progressive Conservative Prime Minister John Diefenbaker argued that after the Munich massacre, passing Bill C-84 was sending the wrong message in the lead-up to the 1976 Summer Olympics in Montreal. In response to the calls for referendum, including a motion for a national plebiscite by Alberta MP Gordon Towers, Allmand argued that the role of MPs was to deliberate in the House of Commons, make up their own minds, and then vote. He also argued that representative democracy necessarily excluded plebiscites, because then it would open the door to plebiscites on a variety of serious and controversial issues.\nIn order not to risk the fall of the government over the bill given its contentious nature, Allmand and Trudeau agreed that the final vote would be a free vote. Despite the Liberal majority in the House of Commons, it only narrowly passed Bill C-84, 131 to 124.\nA year after the vote, Allmand remarked in a speech delivered to Amnesty International, that \"Capital punishment, simply because it is immoral and useless, must be fought and defeated if we are to become a world society in which our descendants can live in peace and justice.\"\nMinister of Indian Affairs and Northern Development\nAfter being Solicitor General, Allmand continued to serve in the cabinet of Pierre Trudeau as Minister of Indian Affairs and Northern Development from September 14, 1976 to September 15, 1977. While the Minister of Indian Affairs, Allmand was seen as particularly sensitive to the need to use appropriate language and have equitable relations with Indigenous Peoples in Canada. By taking the treaties with Indigenous Peoples at face value and extending the benefit of doubt to the people subject to the treaties, Allmand extended the rule of law to Indigenous witnesses in a largely unprecedented manner.\nUnlike his predecessor Judd Buchanan, who referred to the land claims and demands for Indigenous self-government proposed by the Dene people in the Dene Declaration in the aftermath of the Mackenzie Valley Pipeline Inquiry as \"goobledegook\", Allmand expressed public sympathy for their political demands of the Dene and the Métis. He was seemingly about to reach a land claim settlement agreement which would have granted much of the desired political autonomy when he was replaced by Hugh Faulkner in fall 1977. Faulkner backed away from the concessions that Allmand had made such as control over natural resources, instead proposing a cash settlement and land allotments similar to Indian reserves. This new position was criticized by the Dene and Métis leaders, and talks would not resume until 1981.\nHis final cabinet post was as Minister of Consumer and Corporate Affairs from September 16, 1977 until June 3, 1979, when the Liberals were defeated and Progressive Conservative Joe Clark formed government after the 1979 federal election.\nOpposition and return to backbenches\nIn October 1979, Allmand was forced to borrow a tie from an NDP MP when the Speaker of the House of Commons refused to recognize him to ask a question because he was \"improperly dressed\" in a turtleneck sweater with his suit instead of a tie. Allmand unsuccessfully challenged the ruling.\nDuring the negotiations leading up to the patriation of the Constitution of Canada, Allmand, frequently suggested to his caucus colleagues, including those on the committee overseeing patriation, that the rights of Indigenous Peoples should be explicitly protected in any new constitution. Allmand's support lent credibility to the Indigenous cause, since he was a former Indian Affairs minister and longtime cabinet minister. Ultimately, Allmand voted against the Constitution Act, 1982 because of his opposition to the inclusion of the notwithstanding clause in Section 33 of the Charter of Rights and Freedoms that allowed certain rights to be overridden by the national and provincial legislatures. He opposed Section 59 of the act, which delayed the implementation of Section 23 minority language education rights in the Charter of Rights and Freedoms in Quebec until a time chosen by the Quebec National Assembly. After this vote, Allmand would never hold a Liberal cabinet position again.\nDuring Brian Mulroney's tenure as prime minister, Allmand held numerous Official Opposition critic portfolios. He was critic for Employment from October 1984 to September 1990. In 1988, conservative Catholics attacked Allmand for being \"anti-life\" for voting against amendments to the Criminal Code that would have criminalized abortion in Canada. Allmand, himself a Catholic, defended himself, saying that while he personally opposed the act of abortion, he did not believe abortion should be included in criminal law. Allmand was critic for arms control and disarmament as well as critic for Official Languages from 1990 to 1992, and critic for Immigration from 1992 to 1993. During this time, Allmand, who was the chair of the Parliamentary Friends of Tibet, hosted the 14th Dalai Lama's first visit to Canada in 1990.\nIn 1995, he gained notoriety for voting against Minister of Finance Paul Martin's budget, as he was opposed to spending cuts that were deeper than promised during the 1993 election and because it did not cancel the Goods and Services Tax. As a result, Prime Minister Jean Chrétien removed him from his position as chair of the House of Commons Standing Committee on Justice, a position he held from January 17, 1994 to February 2, 1996, although he remained in the Liberal caucus. Allmand said that Martin's budget cuts \"broke traditional Liberal principles\" and his willingness to vote against his own party's majority government emboldened other Liberal MPs to follow suit, such as John Nunziata and Dennis Mills.\nHe retired before the 1997 election after Chrétien appointed him president of the Montreal-based International Centre for Human Rights and Democratic Development (later renamed Rights and Democracy) to replace Ed Broadbent, its first president.\nHuman rights activism\nAllmand served as the second president of the International Centre for Human Rights and Democratic Development from 1997 to 2002. During the 3rd Summit of the Americas, held in Quebec City in 2001, Allmand encouraged social activists boycotting the event to speak with governmental actors in order to collaboratively develop better policy. During his time at the centre, Allmand supported the work done on the International Declaration on the Rights of Indigenous People.\nIn the leadup to the signing of the Good Friday Agreement, Allmand was an active participant in the negotiations via the Coalition for Peace in Ireland. During the negotiations, Allmand met Rosemary Nolan, whom he married in 2002.\nHe also served as the international president of Parliamentarians for Global Action. In 2004, Allmand was elected President of the World Federalist Movement–Canada, a position he held until his terminal illness led to his replacement in August 2016 by Walter Dorn. Allmand also served as a director of the Newman Centre of Montreal and CANADEM.\nIn 2004, Allmand taught at McGill University as a visiting scholar at the Institute of Canadian Studies.\nIn 2005, Allmand served as counsel for the International Civil Liberties Monitoring Group during the Commission of Inquiry into the Actions of Canadian Officials in Relation to Maher Arar, and argued that Canada's national security agencies, especially the Royal Canadian Mounted Police, chose security over rights and were largely unaccountable when they did so.\nMontreal municipal politics\nIn November 2005, Allmand was elected to the Montreal city council seat as a member of the Union Montréal party to represent Loyola, in the Côte-des-Neiges–Notre-Dame-de-Grâce borough. Allmand's primary motivation for joining was to help oversee the city's implementation of its charter of rights that he had helped draft.\nAlthough Allmand had been recruited by then mayor Gérald Tremblay for his party, he was not afraid to publicly criticize the mayor if he disagreed with city policy. Allmand voted against Tremblay's motion to change the name of Park Avenue to Avenue Robert Bourassa. During his time on the council, he criticized the lack of transparency in urban planning for projects in his seat of Notre-Dame-de-Grâce, while Michael Applebaum was mayor.\nAlthough he had risen to become the Vice President of the Montreal City Council, he did not choose to run again in the 2009 Montreal municipal election.\nLater activities and death\nIn 2011, Allmand supported the Canadian Boat for Gaza, part of the Freedom Flotilla II that sought to deliver supplies to Palestinians. In Fall 2013, Allmand joined Foundation Board of Canadians for Justice and Peace in the Middle East.\nIn 2014, Allmand defended a legal argument, on behalf of the World Federalist Movement – Canada, that challenged the Canadian government's implementation bill for the Convention on Cluster Munitions. He argued that a clause of the bill which gave Canada an explicit exemption in certain cases while participating in combined military operations with non-signatory allies such as the United States undermined the purpose of the convention. Allmand noted that Australia and New Zealand, two other American allies, had passed similar legislation without this exemption. Allmand was concerned that signing a treaty with the exception would encourage other countries to create their own exceptions.\nAllmand was diagnosed with a brain tumour in February 2016, and his condition worsened in October 2016. He then entered a palliative care centre at the Centre hospitalier de l'Université de Montréal's Hôpital Notre-Dame, where he died on December 7, 2016, at the age of 84. Allmand's funeral was held at St. Patrick's Basilica on December 19.  Allmand was survived by his wife, a son and two daughters.\nHonours, awards, and legacy\nIn 1977, Allmand was appointed Queen's Counsel for his contributions to the legal field. In 1990, the World Federalist Movement–Canada honoured Allmand with its World Peace Award. In 2000, he was made an Officer of the Order of Canada for being \"committed to democracy and the pursuit of justice and fundamental freedoms.\" In June 2006, Bishop's University granted him a Doctor of Civil Law honoris causa at its convocation ceremony.\nIn 1999, in a list that Allmand submitted to the Great Canadian Book of Lists, he listed abolishing the death penalty as one of Canada's twelve most significant political events.\nAfter his death, Denis Coderre, the Mayor of Montreal, announced that the flags at Montreal City Hall would be flown at half-mast in his honour. Prime Minister Justin Trudeau released a statement on Twitter saying that Allmand's \"legacy will live on in the enormous contributions he made to Canada as an MP and Minister.\"\nIn 2018, the Queen Elizabeth Health Complex, a non-profit in the Notre-Dame-de-Grâce neighbourhood that Allmand represented, for which he served as a board member from 2001 until his death, renamed its urgent care waiting room in his honour as part of a fundraising initiative with the Warren Allmand Memorial Fund.\nIn January 2020, Montreal city councilors Marvin Rotrand and Lionel Perez submitted a motion requesting a public place to be renamed to honour Montreal. In August 2021, Somerled Park, near Royal Vale School in Notre-Dame-de-Grâce, part of the constituency that he represented federally and municipally, was chosen to be renamed. In May 2023, the park was inaugurated under the new name of Warren Allmand Park.\nPublished works\nAllmand published at least three books during this career:\n* Is there a future for progressive policies in Canada? Montréal : McGill Institute for the Study of Canada; 1997.\n* Trading in human rights: the need for human rights sensitivity at the World Trade Organization. Montréal : International Centre for Human Rights & Democratic Development; 1999.\n* Troquer ou respecter les droits humains? Pour une Organisation mondiale du commerce soucieuse des droits humains. Montréal : Centre international des droits de la personne et du développement démocratique; 1999.\nArchives\nThere is a Warren Allmand fonds at Library and Archives Canada.\nReferences\nExternal links\n*\n*\n* [http://v1.theglobeandmail.com/servlet/story/LAC.20161220.OBALLMAND/BDAStory/BDA/deaths/?pageRequested=all A passionate defender of human rights – Globe and Mail  obituary by Sue Montgomery]"
    }
  ]
}