{
  "content": [
    {
      "type": "text",
      "text": "# Warren Hinckle\n\n| birth_place  = San Francisco, California, US\n| death_date   =\n| death_place  = San Francisco, California, US\n| occupation   = journalist, editor\n| alma_mater   = University of San Francisco\n| years_active = 1964–2016\n| children     = 3\n}}\nWarren James Hinckle III (October 12, 1938&nbsp;– August 25, 2016) was an American political journalist based in San Francisco. Hinckle is remembered for his tenure as editor of Ramparts magazine, turning a sleepy publication aimed at a liberal Roman Catholic audience into a major galvanizing force of American radicalism during the Vietnam War era. He also helped create Gonzo journalism by first pairing Hunter S. Thompson with illustrator Ralph Steadman.\nBiography\nHinckle was born in San Francisco to Warren James Hinckle Jr., a dockworker, and Angela Catherine DeVere, who survived the 1906 San Francisco earthquake. He graduated from Archbishop Riordan High School in 1956.\nAs a student at the University of San Francisco, Warren Hinckle wrote for the student newspaper, the San Francisco Foghorn. After college, he worked for the San Francisco Chronicle.\nFrom 1964 to 1969, he was executive editor of Ramparts. Under his leadership, it became a widely circulated muckraking magazine that was based in San Francisco and heavily involved in antiwar New Left politics. In 1966, the magazine won the prestigious George Polk Award for Magazine Reporting.\nHinckle wrote the cover story, \"The Social History of the Hippies,\" for the March 1967 issue. Contributing editor Ralph J. Gleason resigned in protest and turned his attention to a new magazine, Rolling Stone, which he co-founded with former Ramparts staffer Jann Wenner; its first issue appeared later that year.\nIn 1967, Hinckle was among more than 500 writers and editors who signed the \"Writers and Editors War Tax Protest\" pledge, vowing to refuse to pay the 10% Vietnam War Tax surcharge proposed by president Johnson.\nAfter leaving Ramparts in 1969, Hinckle co-founded and edited the magazine ''Scanlan's Monthly with New York journalist Sidney Zion. There he matched illustrator Ralph Steadman with Hunter S. Thompson to produce \"The Kentucky Derby Is Decadent and Depraved\" (1970), the first work of Gonzo journalism.\nAfter Scanlan's'' folded in 1971, Hinckle was involved with a number of publications, including editing Francis Ford Coppola's ambitious City magazine, which ceased publication in 1976. In 1991 he revived The Argonaut, and was its editor and publisher and also of its online version, Argonaut360.\nHinckle wrote or co-wrote over a dozen books, including a 1974 autobiography, If You Have a Lemon, Make Lemonade.\nAfter working for both major San Francisco dailies, the Chronicle and The San Francisco Examiner, Hinckle went to work as a columnist for the San Francisco Independent, founded in 1987. Hinckle used his post at the Independent to advocate for his personal political beliefs. During his time at the Independent Hinckle also wrote campaign literature for various politicians.\nHinckle wore a black patch to cover an eye that was lost in his youth due to an archery accident. (The San Francisco Chronicle said it was an auto accident). He was the father of the journalist Pia Hinckle. He died of pneumonia on August 25, 2016, at the age of 77 at a hospital in San Francisco.\nWorks\nBooks\n* Guerilla-Krieg in USA [Guerrilla War in the USA], with Steven Chain and David Goldstein. Stuttgart: Deutsche Verlagsanstalt (1971). .\n* If You Have a Lemon, Make Lemonade. New York: Putnam (1974). .\n* The Richest Place on Earth: The Story of Virginia City, and the Heyday of the Comstock Lode, with Fredric Hobbs. Boston: Houghton Mifflin (1978). .\n* The Fish is Red: The Story of the Secret War Against Castro, with William W. Turner. New York: Harper & Row (1981). .\n* Gayslayer! The Story of How Dan White Killed Harvey Milk and George Moscone & Got Away with Murder. Silver Dollar Books (1985). .\n* The Agnos Years, 1988-1991. San Francisco Independent (1991). .\n* J. Parker Whitney: Frontier Conservationist & Versatile Man of the West. San Francisco: Argonaut Press (1993). .\n* The Fourth Reich: The Menace of the New Germany (1993).\nBooks edited\n* Who Killed Hunter S. Thompson?: The Picaresque Story of the Birth of Gonzo. Last Gasp of San Francisco (2017). .\nReferences\nFurther reading\n* Richardson, Peter (2009). A Bomb In Every Issue: How the Short, Unruly Life of Ramparts Magazine Changed America. New York: New Press. .\n* Rubens, Lisa (2013). [https://digitalassets.lib.berkeley.edu/roho/ucb/text/hinckle_warren_2013.pdf Warren Hinckle: Journalist, Editor, Publisher, Iconoclast] (oral history). Interviews conducted in 2009–2012. The Bancroft Library, University of California, Berkeley.\n* Staff writer (Aug. 26, 2018). [https://archive.today/20210605234608/https://www.nytimes.com/2016/08/26/business/media/warren-hinckle-dead.html \"Warren Hinckle, 77, Ramparts Editor Who Embraced Gonzo Journalism, Dies\"] (obituary). New York Times.\nExternal links\n* [http://www.argonaut360.com/ Argonaut360]\n* FBI file: HINCKLE, Warren at Internet Archive"
    }
  ]
}