{
  "content": [
    {
      "type": "text",
      "text": "# Warrensville–Shaker station\n\n| owned              = City of Shaker Heights\n| operator           = Greater Cleveland Regional Transit Authority\n| line               = Shaker Boulevard\n| platform           = 2 side platforms\n| tracks             = 2\n| connections        =  RTA: 41, 41F\n| structure          = At-grade\n| parking            = 112 spaces\n| bicycle            = Racks\n| accessible         =  Yes\n| website            =\n| opened             = December 6, 1928\n| rebuilt            = 1980, 2016\n| original           = Cleveland Railway\n| services           =\n| mapframe = yes\n| mapframe-custom =  |zoom=15 }}\n| location_state = collapsed\n}}\nWarrensville–Shaker station is a station on the Green Line of the RTA Rapid Transit in Shaker Heights, Ohio, located in the median of Shaker Boulevard (Ohio State Route 87) on the west side of Warrensville Center Road.\nHistory\nThe Cleveland Interurban Railroad (CIRR), the predecessor of the Green Line, was extended  from Courtland station to Warrensville Road in 1928 using track removed from the Coventry Road connection between Shaker Boulevard and Fairmount Boulevard. University School had moved to its nearby 36-acre (15-hectare) campus two years earlier, and CIRR had made a promise to school officials to extend the line. The extension, which was originally a single track, was double-tracked in 1930. A turnaround loop was built just east of the Warrensville Center Road overpass.\nFurther extensions east of Warrensville Road were planned. The right-of-way continued in a broad median of Shaker Boulevard with room for four rapid transit tracks as well as a high-speed automobile parkway. This right-of-way extended along Shaker Boulevard to Brainard Road and from there along Gates Mills Boulevard all the way to near Mayfield Road, where it ended in a large loop suitable for use as a streetcar yard.\nIn 1936 the line was further extended  east to Green Road station. This extension was also originally a single track, and a second track was added to the extension in 1942 when increased ridership during World War II made single track operation no longer feasible.\nWarrensville station was rebuilt as part of the renovation of the entire Green Line in 1980. Two concrete stairways with tinted acrylic glass canopies extended down to the platforms from the west side of the overpass carrying Warrensville Center Road over the tracks, and new platforms and parking lots were constructed. The renovated line opened on October 11, 1980.\nIn 2014, the station underwent another renovation. The concrete stairways were removed and replaced by two concrete ramps leading up the grade on either side of the tracks to entrance plazas to access Warrensville Road or either side of Shaker Boulevard. Additionally, ramps were added on each platform to allow people with disabilities to board from the low-level platforms. The renovated station reopened on November 22, 2016.\nStation layout\nThe station comprises two side platforms. Two concrete walkways, each from the west side of Warrensvile Road at the intersections of Shaker Boulevard East and Shaker Boulevard West, extend down to the platforms. Bus stops are located near each ramp. There is a parking lot along the westbound platform. Access to the parking is from westbound Shaker Boulevard. The Warrensville Center Road overpass is the only grade separation on the Green Line east of Shaker Square station.\nNotable places nearby\n* University School\n* Shaker Heights Middle School\nGallery\nWarrensville-Shaker sign (2).jpg\nWarrensville-Shaker stairs.jpg\nWarrensville-Shaker sign.jpg\nWarrensville-Shaker sign (3).jpg\nWarrensville-Shaker sign (4).jpg\nWarrensville-Shaker sign (5).jpg\nWarrensville-Shaker sign - platform.jpg\nReferences\nExternal links\n* [https://www.riderta.com/facilities/warrensvilleshaker Warrensville – Shaker Rapid Station (GCRTA)]"
    }
  ]
}