{
  "content": [
    {
      "type": "text",
      "text": "# Warren Zevon\n\n|birth_date =\n|birth_place = Chicago, Illinois, U.S.\n|death_date =\n|death_place = Los Angeles, California, U.S.\n|genre =\n|occupation =\n|instrument =\n|years_active = 1965–2003\n|label =\n|website =\n}}\nWarren William Zevon (; January 24, 1947&nbsp;– September 7, 2003) was an American rock singer and songwriter. His most famous compositions include \"Werewolves of London\", \"Lawyers, Guns and Money\" and \"Roland the Headless Thompson Gunner\". All three songs are featured on his third album, Excitable Boy (1978), the title track of which is also well-known. He also wrote major hits that were recorded by other artists, including \"Poor Poor Pitiful Me\", \"Mohammed's Radio\", \"Carmelita\" and \"Hasten Down the Wind\". Per The New York Times, \"Mr. Zevon had a pulp-fiction imagination\" which yielded  \"terse, action-packed, gallows-humored tales that could sketch an entire screenplay in four minutes and often had death as a punchline. But there was also vulnerability and longing in Mr. Zevon's ballads, like 'Mutineer,' 'Accidentally Like a Martyr' and 'Hasten Down the Wind'.\"\nZevon had early music industry successes as a session musician, jingle composer, songwriter, touring musician, musical coordinator and bandleader. However, he struggled to break through with a solo career until Linda Ronstadt performed his music on her 1976 album Hasten Down the Wind. It launched a cult following that lasted 25 years, with Zevon making occasional returns to album and single charts until his death from mesothelioma in 2003. He briefly found a new audience by teaming up with members of R.E.M. in the blues rock outfit Hindu Love Gods for a 1990 album release, although no tour followed. In 2025, Zevon was inducted into the Rock and Roll Hall of Fame in the Musical Influence Award category.\nKnown for his dry wit and acerbic lyrics, he was a frequent guest on Late Night with David Letterman and the Late Show with David Letterman. On  Zevon's last appearance, Letterman asked him if he had learned anything about matters of life and death. Zevon said he'd learned \"How much you're supposed to enjoy every sandwich.\"\nEarly life\nZevon was born in Chicago, the son of Beverly Cope (nee Simmons) and William Zevon. His father was a Jewish immigrant from Ukraine, whose original surname was Zivotofsky. William Zevon worked as a bookie who handled volume bets and dice games for the notorious Los Angeles mobster Mickey Cohen. He worked for years in the Cohen gang, in which he was known as Stumpy Zevon, and was best man at Cohen's first wedding. Warren's mother was from a Latter-day Saint family and of English descent. They later moved to Fresno, California, and by the age of 13, Zevon was an occasional visitor to the home of Igor Stravinsky, where he briefly studied modern classical music alongside Robert Craft. Zevon's parents divorced when he was 16 years old. He soon quit high school and, driving a sports car William won in a card game, moved from Los Angeles to New York City to become a folk singer.\nCareer\nEarly years\nZevon turned to a musical career early, forming a musical duo with his high school friend Violet Santangelo, called lyme & cybelle (the lack of capitalisation was a deliberate styling move). Bones Howe produced their first single, the minor hit \"Follow Me\", which was written by Zevon and Santangelo and reached number 65 on the Billboard pop charts in April 1966. A follow-up single, a cover of Bob Dylan's \"If You Gotta Go, Go Now\" flopped, and Zevon left the duo. A third single without Zevon and another session that included him but was not previously released were included on the 2003 compilation The First Sessions.\nZevon spent time as a session musician and jingle composer. He wrote several songs for his White Whale labelmates The Turtles (\"Like the Seasons\" and \"Outside Chance\"), though his participation in their recording—if any—is unknown. Another early Zevon composition, \"She Quit Me\", was included in the soundtrack for the film Midnight Cowboy (1969); to suit its place in the film, the song was re-recorded by Leslie Miller as \"He Quit Me\".\nZevon's debut solo album, Wanted Dead or Alive (1970), was spearheaded by 1960s cult figure Kim Fowley but received almost no attention and did not sell well. Though Zevon continued to play occasional live dates as a solo artist, the next several years of his career were dominated by session work with other musicians.\nDuring the early 1970s, Zevon toured regularly with The Everly Brothers as keyboard player, band leader, and musical coordinator. Later that decade, he toured with Don Everly and Phil Everly separately as they tried to launch solo careers after their breakup. He worked particularly closely with Phil, arranging and playing keyboards on his solo albums Star Spangled Springer (1973) and Mystic Line (1975) and co-writing tracks on ''Phil's Diner (1974) and Mystic Line''. Zevon's song \"Carmelita\" was also recorded by Canadian singer Murray McLauchlan on his self-titled album of 1972.\nThese small successes were not particularly rewarding financially, and Zevon's dissatisfaction with his career (and a lack of funds) led him to briefly move to Spain in the summer of 1975. He lived and played in the Dubliner Bar, a small tavern in Sitges, near Barcelona, owned by mercenary David Lindell. Together they composed \"Roland the Headless Thompson Gunner\".\nReturn to L.A. and major-label debut\nas the opener for Jackson Browne in 1976. He toured solo.]]\nBy September 1975 Zevon had returned to Los Angeles, where he roomed with Stevie Nicks and Lindsey Buckingham of Fleetwood Mac. There he collaborated with Jackson Browne, who produced and promoted Zevon's self-titled major-label debut in 1976. Contributors to the album included Nicks, Buckingham, Mick Fleetwood, John McVie, members of the Eagles, Carl Wilson, Linda Ronstadt and Bonnie Raitt. Ronstadt elected to record many of his songs, including \"Hasten Down the Wind\", \"Carmelita\", \"Poor Poor Pitiful Me\" and \"Mohammed's Radio\". Zevon's first tour, in 1977, included guest appearances in the middle of Jackson Browne concerts, one of which is documented on a widely circulated bootleg recording of a Dutch radio program under the title The Offender Meets the Pretender.\nProduced by Browne, Warren Zevon (1976) was his first album to chart in the United States, peaking at No. 189. The first edition of the Rolling Stone Record Guide (1979) called it \"a masterpiece\". The guide's latest edition (2004) calls it Zevon's \"most realized work\". Representative tracks include the junkie's lament \"Carmelita\"; the  Copland-esque outlaw ballad \"Frank and Jesse James\"; \"The French Inhaler\", a scathing look at life and lust in the L.A. music business (which was actually about Marilyn Livingston, his long-time girlfriend and mother of his son,  Jordan); and \"Desperados Under the Eaves\", a chronicle of Zevon's increasing alcoholism.\nSuccess\nIn 1978, Zevon released Excitable Boy (produced by Jackson Browne and guitarist Waddy Wachtel) to critical acclaim and popular success. The title tune is about a juvenile  sociopath's murderous prom night and referred to \"Little Susie\", the heroine of the song \"Wake Up Little Susie\" made famous by his former employers The Everly Brothers. Other songs, such as \"Roland the Headless Thompson Gunner\" and \"Lawyers, Guns and Money\", used deadpan humor to wed geopolitical subtexts to hard-boiled narratives. The single \"Werewolves of London\", featuring McVie, Fleetwood, and Zevon's signature macabre humor, reached No. 21 on the charts.\nDave Marsh called Zevon \"one of the toughest rockers ever to come out of Southern California\". Rolling Stone record reviews editor Paul Nelson called the album \"one of the most significant releases of the 1970s\" and placed Zevon alongside Jackson Browne, Neil Young, and Bruce Springsteen as the four most important new artists to emerge in the decade. On May 11, 1980, Zevon and Willie Nile appeared on the King Biscuit Flower Hour.\nhelped popularize Zevon's songs in the 1970s.]]\nZevon followed Excitable Boy with Bad Luck Streak in Dancing School (1980). The album was dedicated to Ken Millar, better known under his nom-de-plume as the detective novelist Ross Macdonald, one of Zevon's literary heroes. Millar and Zevon first met in an intervention organized by Nelson, which helped Zevon temporarily curtail his addictions. Featuring a modest hit with the single \"A Certain Girl\" (Zevon's cover of an R&B record by Ernie K-Doe) which reached No. 57 on the Billboard Hot 100 singles chart, the album sold briskly but was uneven, and represented a decline rather than commercial and critical consistency. It contained a collaboration with Springsteen on \"Jeannie Needs a Shooter\". The ballad \"Empty-Handed Heart\" (featuring a descant sung by Linda Ronstadt), is about Zevon's divorce from his wife, Crystal, the mother of his daughter Ariel. (Zevon was in a long-term relationship with Marilyn \"Tule\" Livingston, the mother of his son,  Jordan, but they never married.) Later in 1980, he released the live album Stand in the Fire, recorded over five nights at The Roxy Theatre in Los Angeles and dedicated to Martin Scorsese.\nPersonal crisis and first comeback\nZevon's 1982 release The Envoy returned to the high standard of Excitable Boy but was not a commercial success. It was an eclectic but characteristic set that included such compositions as \"Ain't That Pretty at All\", \"Charlie's Medicine\", and \"Jesus Mentioned\", the first of Zevon's two musical reactions to the death of Elvis Presley. The album also contains the first of Zevon's writing collaborations with respected writers of fiction: \"The Overdraft\", co-written with Thomas McGuane. The title track was dedicated to Philip Habib, U.S. special envoy to the Middle East during the early 1980s. Zevon stated that after the song came out, Habib sent him \"a very nice letter of appreciation on State Department stationery\".\nIn 1983 Zevon, who was recently divorced, became engaged to Philadelphia disc jockey Anita Gevinson and moved to the East Coast. After The Envoy was poorly received by critics, Asylum Records ended their business relationship with Zevon, citing poor sales, which Zevon discovered only when he read about it in the \"Random Notes\" column of Rolling Stone''. Following these career setbacks, he relapsed into drug and alcohol abuse. In 1984, he voluntarily checked himself into a rehab clinic in Minnesota. His relationship with Gevinson ended shortly thereafter. Zevon retreated from the music business for several years, except for playing live solo shows; during this time he finally overcame severe alcohol and drug addictions.\nBill Berry, Peter Buck and Mike Mills of R.E.M. were the core of Zevon's next studio band when he re-emerged in 1987 by signing with Virgin Records and recording the album Sentimental Hygiene. The release, hailed as his best since Excitable Boy, featured a thicker rock sound and taut, often humorous songs like \"Detox Mansion\", \"Bad Karma\" (featuring R.E.M. lead singer Michael Stipe on backup vocals) and \"Reconsider Me\". Included were contributions from Neil Young, Bob Dylan, Flea, Brian Setzer and George Clinton, as well as Berry, Buck and Mills. Also on hand were Zevon's longtime collaborators Jorge Calderón and Waddy Wachtel.\nOn the last day of the Sentimental Hygiene sessions, Zevon also participated in an all-night jam session with Berry, Buck, and Mills and backup vocalist Bryan Cook as they worked their way through rock and blues numbers by artists including Bo Diddley, Muddy Waters, Robert Johnson and Prince. Though the sessions were not initially intended for release, they eventually were as Hindu Love Gods' sole album. The group had previously released the non-charting single \"Gonna Have a Good Time Tonight\"/\"Narrator\" for IRS Records in 1986.\nThe immediate follow-up to Sentimental Hygiene was 1989's Transverse City, a futuristic concept album inspired by Zevon's interest in the work of cyberpunk science fiction author William Gibson. It featured guests including Little Feat drummer Richie Hayward, Jefferson Airplane and Hot Tuna bassist Jack Casady, noted jazz keyboardist Chick Corea and various guitarists, including Wachtel, David Lindley, Jerry Garcia, Jorma Kaukonen, David Gilmour and Neil Young. Key tracks include the title song, \"Splendid Isolation\", \"Run Straight Down\" (which had a promotional video that featured Zevon singing in a factory while Gilmour played guitar solos), and \"They Moved the Moon\" (one of Zevon's eerier ballads).\nLater years and second comeback\nTransverse City was a commercial disappointment, and Zevon was dropped by Virgin Records soon after the album's release. He almost immediately contracted, however, with Irving Azoff's new label Giant Records. The first release under Zevon's contract with his new distributor was the album Hindu Love Gods, recorded during the Sentimental Hygiene sessions. The album included a cover of Prince's \"Raspberry Beret\", which became a number 23 Modern Rock hit in the United States.\nIn 1991, Zevon, once again a solo artist, released Mr. Bad Example. The album featured the modest pop hit \"Searching for a Heart\" and the rocker \"Things to Do in Denver When You're Dead\", later used as the title of Gary Fleder's  film of the same name; after some skirmishing over the unauthorized use of Zevon's song title, the Zevon track was licensed to play over the film's end credits. Zevon also sang lead vocals on the song \"Casey Jones\" from the Grateful Dead tribute album Deadicated, with regular collaborator David Lindley.\nZevon toured the United States (with the Odds), Europe, Australia, and New Zealand during this period. Owing to his reduced circumstances, his performances were often true solo efforts with minimal accompaniment on piano and guitar; the live album Learning to Flinch (1993) documents such a tour. Zevon often played in Colorado to allow for an opportunity to visit with his longtime friend Hunter S. Thompson.\nA lifelong fan of hardboiled fiction, Zevon was friendly with several well-known writers, who also collaborated on his songwriting during this period, including Thompson, Carl Hiaasen and Mitch Albom. Zevon also served as musical coordinator and occasional guitarist for the ad-hoc rock music group the Rock Bottom Remainders, a collection of writers performing rock-and-roll standards at book fairs and other events. The group included Stephen King, Dave Barry, Matt Groening and Amy Tan, among other popular writers; it has continued to perform one benefit concert per year since Zevon's death. Zevon played on and wrote liner notes for Stranger Than Fiction (1998), a two-CD set attributed to the Wrockers, containing rock covers and originals by many of the Remainders authors plus such notables as Norman Mailer and Maya Angelou.\nZevon oversaw music for the short-lived revival of the NBC series Route 66 (1993), contributing that show's main title theme, \"If You Won't Leave Me I'll Find Somebody Who Will\". His music was also featured in the four William Shatner TekWar movies in 1994. Zevon is listed as \"theme music composer\" in the opening credits. His song \"Real or Not\" was used as the show's end credit theme song. The song appeared on Zevon's 2-CD set, ''I'll Sleep When I'm Dead (An Anthology). In the accompanying booklet, Zevon wrote, \"I wrote this song for the William Shatner TV movies based on his novels. He is'' Captain Kirk, rest assured. He'd call me at home and demand to hear the song in progress, then he'd say \"We need more guitars! More driving guitars!\" It was cool. The track reflected my secret fondness for sleazy English techno records.\"\nOccasionally between 1982 and 2001, Zevon filled in for Paul Shaffer as bandleader on Late Night with David Letterman and later the Late Show with David Letterman.\nIn 1995, Zevon released the self-produced Mutineer. The title track was frequently covered by Bob Dylan on his U.S. fall tour in 2002. Zevon's cover of cult artist Judee Sill's \"Jesus Was a Crossmaker\" predated the wider rediscovery of her work a decade later. The album, however, had the worst sales of Zevon's career, in part because of lack of promotion from his label, Giant. Rhino Records released a Zevon \"best-of\" compilation in 1996, ''I'll Sleep When I'm Dead. Zevon also appeared on the Larry Sanders Show on HBO, in 1993, playing himself promoting Learning to Flinch. Zevon also played himself on two episodes of Suddenly Susan'' in 1999, along with singer and actor Rick Springfield.\nwas credited by Zevon as \"being the best friend my music ever had\".]]\nAfter another five-year layoff, Zevon signed with industry veteran Danny Goldberg's Artemis Records and again rebounded with the mortality-themed 2000 release ''Life'll Kill Ya'', containing the hymn-like \"Don't Let Us Get Sick\" and an austere version of Steve Winwood's 1980s hit \"Back in the High Life Again\". With record sales brisk and music critics giving Zevon his best notices since Excitable Boy, ''Life'll Kill Ya is seen as his second comeback. He followed with the album My Ride's Here (2002), with its morbid prescience of things to come; the album included \"Hit Somebody! (The Hockey Song)\" (co-written by Albom and featuring Shaffer, the Late Night'' band and a spoken vocal from Letterman); and the ballad \"Genius\", written with Pulitzer Prize-winning poet Paul Muldoon.\nAt about this time, he and the actor Billy Bob Thornton formed a close friendship, catalyzed by their common experiences with obsessive-compulsive disorder and the fact they lived in the same apartment building. Zevon saw Thornton taking his mail in and out of his mailbox, and said: \"Oh, so you have that too.\" Zevon appeared with Thornton in Dwight Yoakam's movie South of Heaven, West of Hell (2000).\nCancer and The Wind\nIn interviews, Zevon described a lifelong phobia of doctors and said he seldom consulted one. He had started working out, and he looked physically fit. Shortly before playing at the Edmonton Folk Music Festival in 2002, he started feeling dizzy and developed a chronic cough. After a period of suffering with pain and shortness of breath, Zevon was encouraged by his dentist to see a physician; he was diagnosed with pleural mesothelioma, a cancer (usually caused by exposure to asbestos) that affects the pleura, a thin membrane around the lungs and chest lining. Zevon was deeply shaken by the news and began drinking again after 17 years of sobriety.\nAlthough Zevon never revealed where he may have been exposed to asbestos, his son Jordan suggests that it came from Zevon's childhood, playing in the attic of his father's carpet store in Arizona. Refusing treatments he believed might incapacitate him, Zevon instead began recording his final album, The Wind, which includes performances by close friends including Springsteen, Browne, Lindley, Thornton, Yoakam, Timothy B. Schmit, Don Henley,  Joe Walsh, Emmylou Harris and Tom Petty. At the request of VH1, documentarian Nick Read was given access to the sessions and made the television film Inside Out: Warren Zevon.\nreunited with Zevon for his final album]]\nOn October 30, 2002, Zevon was featured alone on an episode of the Late Show with David Letterman. The band played \"I'll Sleep When I'm Dead\" as his introduction. Zevon performed several songs and spoke at length about his illness. He noted, \"I might have made a tactical error in not going to a physician for 20 years.\" It was during this broadcast that, when asked by Letterman if he knew something more about life and death now, he first offered his oft-quoted insight that people need to \"enjoy every sandwich.\" He also thanked Letterman for his years of support, calling him \"the best friend my music's ever had\". For his final song of the evening, and his final public performance, Zevon performed \"Roland the Headless Thompson Gunner\" at Letterman's request. In the green room after the show, Zevon presented Letterman with the guitar that he always used on the show, with a single request: \"Here, I want you to have this, take good care of it.\"\nDeath and legacy\nZevon died of mesothelioma on September 7, 2003, aged 56, at his home in Los Angeles. His body was cremated, and his ashes were scattered into the Pacific Ocean near Los Angeles.\nZevon's friend Stephen King says: \"His albums are dense with stories and brilliant images.\" King dedicated his novel Doctor Sleep to Zevon. Carl Hiaasen recalls Zevon's friendship with Hunter S. Thompson: \"Warren was close to Thompson, and their work shared a certain twisted energy. But Warren was very much his own writer, and he was more disciplined than Hunter. Warren was meticulous. Even when he was young and high as a kite, he agonised over his lyrics.\" Bruce Springsteen says Zevon \"would write something that had real meaning, and it was funny, too. I always envied that part of his ability and talent.\" David Crosby says: \"He was and remains one of my favorite songwriters. He saw things with a jaundiced eye that still got the humanity of things.\" Paul Muldoon collaborated with Zevon on his last album, and paid homage to him with his poem \"Sillyhow Stride.\"\nZevon said that, with his last recordings, he wanted to remind people that \"This was a nice deal: life.\"\nPosthumous releases and awards\nA tribute album titled Enjoy Every Sandwich: The Songs of Warren Zevon was released October 19, 2004. Zevon's son, Jordan Zevon, was the executive producer of the album and performed \"Studebaker\", a previously unfinished composition by his father. A second tribute album, Hurry Home Early: The Songs of Warren Zevon (\"hurry home early\" is from the song \"Boom Boom Mancini\", on the album Sentimental Hygiene) was released by Wampus Multimedia on July 8, 2005.\nOn February 14, 2006, VH1 Classic premiered a music video from a new compilation, Reconsider Me: The Love Songs. The video, titled \"She's Too Good for Me\", aired every hour on the hour throughout the day.\nRe-issues of the albums Stand in the Fire and The Envoy were released on March 27, 2007, by Rhino Records, alongside a re-issue of Excitable Boy, with the three CDs having four unreleased bonus tracks each. Noteworthy rarities include the outtakes \"Word of Mouth\" and \"The Risk\" from the Envoy sessions and \"Frozen Notes (Strings Version)\", a melancholy outtake from Excitable Boy performed on acoustic piano with a string quartet.\nAmmal Records was a new label started up as a partnership with New West Records by Zevon's former boss at Artemis, Danny Goldberg. On May 1, 2007, Ammal released Preludes: Rare and Unreleased Recordings, a two-disc anthology of Zevon demos and alternate versions culled from 126 pre-1976 recordings that had been kept in a suitcase. The album contains five previously unreleased songs: \"Empty Hearted Town\", \"Going All the Way\", \"Steady Rain\", \"Stop Rainin' Lord\", and \"The Rosarita Beach Cafe\", along with Zevon's original demo of \"Studebaker\". Selections from an interview of Zevon by the Austin-based radio personality Jody Denberg are blended with about 40 minutes of music on the collection's second disc.\nThe Wind was certified gold by the RIAA in December 2003, and Zevon received five posthumous Grammy nominations, including Song of the Year for the ballad \"Keep Me in Your Heart\". The Wind won two Grammys, with the album itself receiving the award for Best Contemporary Folk Album, while \"Disorder in the House\", Zevon's duet with Bruce Springsteen, was awarded Best Rock Performance by a Duo or Group with Vocal. These posthumous awards were the first Grammys of Zevon's thirty-plus year career.\nIn 2025, Zevon was inducted into the Rock and Roll Hall of Fame in the category of Musical Influence. David Letterman inducted Zevon into the hall during the November 8, 2025 induction ceremony, with The Killers and Waddy Watchel performing \"Lawyers, Guns and Money.\" Killers guitarist Dave Keuning performed the song with the guitar Zevon had gifted Letterman before his death.\nPersonal life\nZevon was married to Crystal, and their daughter Ariel Zevon was born in 1976. Ariel Zevon is a singer-songwriter and former café owner in Vermont. Warren Zevon and Marilyn Livingston Dillow had a son, Jordan Zevon, in 1969. Jordan Zevon is a singer, musician, and songwriter.\nHe was a friend of United States Representative Steve Cohen, at the time a State Senator; the two attended the 2000 Democratic National Convention together.\nBiographical works\n''I'll Sleep When I'm Dead: The Dirty Life and Times of Warren Zevon'', a biography by his ex-wife, Crystal Zevon, was published in 2007 by Ecco Books. The book is largely an oral history that consists of interviews with Zevon's friends, relatives and associates, as well as excerpts from his diaries.\nIn 2012, George Gruel, a photographer who worked as Zevon's aide-de-camp from 1978 to 1983, published a book of photos of Zevon. Entitled Lawyers, Guns & Photos, it was extended and re-released in 2020.\nGeorge Plasketes, a professor at Auburn University, wrote a critical study of Zevon's music in 2016, Warren Zevon, Desperado of Los Angeles.\nNothing’s Bad Luck: The Lives of Warren Zevon by C. M. Kushins followed in 2019.\nDiscography\nStudio albums\n* Wanted Dead or Alive (1970)\n* Warren Zevon (1976)\n* Excitable Boy (1978)\n* Bad Luck Streak in Dancing School (1980)\n* The Envoy (1982)\n* Sentimental Hygiene (1987)\n* Transverse City (1989)\n* Hindu Love Gods (1990), with members of R.E.M. (excluding Michael Stipe)\n* Mr. Bad Example (1991)\n* Mutineer (1995)\n* ''Life'll Kill Ya (2000)\n* My Ride's Here (2002)\n* The Wind'' (2003)\nReferences\nFurther reading\n*\n*\n*\n*\nExternal links\n*\n*[https://web.archive.org/web/20240419083515/https://warrenzevon.org/ Warren Zevon semi-official site] (Archived)\n*\n*[https://web.archive.org/web/20091118171741/http://warrenzevon.humanarchives.org/ Warren Zevon's] personal archive at Human Archives\n*\n*\n*\n}}"
    }
  ]
}