{
  "content": [
    {
      "type": "text",
      "text": "# Warriston Park LTC Tournament\n\n| editions    =\n| ended       =\n| event name  =\n| location    = Edinburgh, Midlothian, Scotland\n| venue       = Warriston Park Lawn Tennis Club\n| tour        =\n| surface     =Clay Grass\n}}\nThe Warriston Park LTC Tournament was a tennis tournament played on both clay courts and grass courts. This annual tournament was established by the Warriston Park Lawn Tennis Club, Edinburgh, Lothian, Scotland in 1886. The event was staged through to 1908.\nHistory\nThe Warriston Park Open was a tennis tournament played on both clay courts and grass courts organised by the Warriston Park Lawn Tennis Club, Edinburgh, Lothian, Scotland. It was staged from 1886 to 1908. The organisers lost the use of the tennis courts at Warriston Park sometime towards the end of 1908 and 1909, thus ending the tournament.\nVenue\nThe Warriston Park Lawn Tennis Club, founded in the early 1880s, was located at the  Warriston Park (later known as the Warriston Recreation Grounds), Inverleith Row Edinburgh. It was one of the first tennis clubs to be established in Scotland. The tennis club lost the use of its courts at Warriston between 1908 and 1909.  No further records of the club survived beyond this date. Sources state that it moved to Inverleith Place, and became the Inverleith Lawn Tennis Club.  The original club where this event was held had eight tennis courts, three of cinder and five of grass.\nFinals\nMen's Singles\n(Incomplete roll)\n{|class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! style=\"width:60px;\"|Year\n! style=\"width:200px;\"|Winner\n! style=\"width:200px;\"|Runner-up\n! style=\"width:160px;\"|Score\n|-\n|1886 || Herbert Bowes-Lyon || J.P. Smythe || 6-3 6-0 ret.\n|-\n|1894 || Henry Lawrence Fleming|| Andrew Duncan||6-1, 6–1.\n|-\n|}\nMixed Doubles\n(Incomplete roll)\n:Incomplete Roll\n{|class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! style=\"width:60px;\"|Year\n! style=\"width:200px;\"|Winner\n! style=\"width:200px;\"|Runner-up\n! style=\"width:160px;\"|Score\n|-\n|1886 || J.P. Smythe  Jane Meikle|| Richard Millar Watson  Mabel Boulton||5-7 6-2 6–2.\n|-\n|}\nSee also\n*Tennis in Scotland\nReferences"
    }
  ]
}