{
  "content": [
    {
      "type": "text",
      "text": "# Warrumbungles\n\n| coordinates =\n| length_km = | length_orientation =\n| width_km = | width_orientation =\n| area_km2 =\n| formed_by = Shield volcano\n| orogeny =\n| period = Cenozoic\n| map = Australia New South Wales\n| map_caption = Location of the Warrumbungle Range in New South Wales\n}}\nThe Warrumbungles is a mountain range in the Orana region of New South Wales, Australia. The nearest town is Coonabarabran. The area is easiest accessed from the Newell Highway which is the major road link directly between Melbourne, Victoria and Brisbane, Queensland and cuts across inland New South Wales from the north to the south.\nAs the range is between the moist eastern coastal zone and the dryer plains to the west, it has provided protection for flora and fauna suited to both habitats.  There are over 120 bird species identified on the range, including lories and lorikeets, rosellas and parrots.  The centre of the range has served as an area of protection for a healthy and content colony of grey kangaroos.  These animals have become fairly tame due to constant visitor attention and are easily approached.\nThe Siding Spring Observatory is located on Mount Woorut, an eastern peak.  The area has little to no light pollution to disturb astronomical viewing. In 2016, the International Dark-Sky Association declared the Warrumbungle National Park as Australia's first International Dark Sky Park.\nThe Warrumbungles hosted the 2006 World Rogaining Championships.\nGeology\nThe base of the region was formed 180 million years ago. At that time a lake was formed that allowed sediment to slowly compress into sandstone. The Warrumbungles are the remnants of a large heavily eroded shield volcano which was active from 13 to 17&nbsp;million years ago. The volcano is estimated to have been  high and  wide. It formed as volcanic explosions occurred over millions of years. The remaining complex rocky formations are what is left after millions of years of erosion.\nPhysiography\nThis area is also known as the Warrumbungle-Liverpool Basalt Ranges, which is a distinct physiographic section of the larger Hunter-Hawkesbury Sunkland province, which in turn is part of the larger East Australian Cordillera physiographic division.\nFormations\nThe main features of the Warrumbungle mountains are a series of huge jagged outcrops in a roughly circular pattern, surrounded by hilly bush and woodland forest.  Dykes, plugs and domes are common and mostly made from trachyte. The Grand High Tops is a section of the range where volcanic remnants are especially clustered. These vents and rocky formations are all named - Belougery Spire, Belougery Split Rock, Crater Bluff, Bluff Mountain, The Breadknife and Mount Exmouth.  Pyroclastic rock is found in this area. The Breadknife, a straight wall of jagged rock nearly  high, is particularly rare. There is an extensive network of nine walking tracks across the central peaks.\nTowards the southeast a broad belt of basalt outcrops extends towards the Liverpool Range. Near Chalk Mountain are outcrops of diatomite.  Outer stretches of the volcano are made up of hawaiite and mugearite.\nHistory\nThe first European to sight and explore the area was John Oxley in 1818 on second expedition through New South Wales. Oxley named the range the Arbuthnot Range. The Gamilaroi name Warrumbungles which means 'crooked mountains' became the most common name.\nBelougery Spire was first ascended by Eric Dark and Osmar White in 1932, and Crater Bluff by Dark and Dorothy English (better known by her later married name, Dorothy 'Dot' Butler) in 1936. The Breadknife was not ascended until 1954, by Russ Kippax and Bill Peascod.  Climbing on the Breadknife has since been banned, to protect the walking track along its base from rockfall. Lieben, on Crater Bluff, was the most difficult rock climb in Australia for many years after its first ascent by Bryden Allen and Ted Batty in 1962.  It was graded 17 – the hardest grade in the Ewbank system at the time – but is generally agreed to be much harder.\nBy 1953,  of the range was recognised for its natural heritage and preserved as Warrumbungle National Park. In 2011, it was reported that the national park is contained within .\nSee also\n}}\n* List of mountains in Australia\n* List of volcanoes in Australia\nReferences\n*\nExternal links"
    }
  ]
}