{
  "content": [
    {
      "type": "text",
      "text": "# Warren Ost\n\nWarren William Ost (June 24, 1926 in Mankato, Minnesota &ndash; November 6, 1997 in New York City) was the Presbyterian minister who founded A Christian Ministry in the National Parks (ACMNP) in 1952.\nEarly life\nBorn in Minnesota, Ost earned his undergraduate degree from the University of Minnesota. He graduated from Princeton Theological Seminary.\nMinistry\nOst was a bellhop at the Old Faithful Inn, a hotel in Yellowstone National Park, in 1945. He believed then that the National Parks needed a more organized Christian Ministry. As a Princeton Seminarian, Ost started a Bible study and choir. After being ordained by the Presbyterian Church, Ost founded, with the permission of the National Park Service, ACMNP. ACMNP is the United States largest and oldest ecumenical ministry serving the national parks.\nWhen Ost retired as the Executive Director for ACMNP, Michael Forbes, a New York House Representative, placed a commendation in the Congressional Record for the 45 years of service Ost had provided to the National Park system. Forbes said, For nearly half a century, Reverend Ost has led this dynamic program, not merely by overseeing its activities, but by actively participating in every facet of the movement. A Christian Ministry in the National Parks has been Warren and Nancy’s life work and faith, and they live their faith each and every day. In quiet and often unnoticed ways, they have touched the lives of millions, crossing denominational lines and demonstrating God’s love through their actions and relationships.\nTourism\nIn addition to founding ACMNP, Ost was involved in the Vatican's Congress on the Spiritual Values of Tourism in 1967.  He later help found the Tourisme Oecumenique, an organization dedicated to religious and leisure tourism in Europe and the Caribbean.\nPersonal life\nHe was married to Nancy Nesbitt Ost for 43 years. They had a daughter, Laura.\nReferences"
    }
  ]
}