{
  "content": [
    {
      "type": "text",
      "text": "# Warren Lee (pianist)\n\nWarren Wai On Lee is a Hong Kong-born pianist, Steinway Artist, a regular featured artist of the Hong Kong Philharmonic Orchestra, composer and a music educator. He was awarded the Ten Outstanding Young Persons Award (Hong Kong) in 2012, elected an Associate of the Royal Academy of Music in 2015  and awarded the Ian Mininberg Distinguished Alumni Award by the Yale University in 2017 in recognition of his achievements in the performing arts and contribution to the community.\nAt the age of six, he made his début with the Hong Kong Philharmonic Orchestra. Following his Macau début with the Macau Chamber Orchestra at the age of ten, the South China Morning Post wrote,\n“Warren Lee's performance bore out the insight… that exceptional artists are not so much people to be praised as phenomena to be treasured, bearers of a power altogether greater than the poor vessels that contain it.” He went on to become the first prize winner of the 1995 Stravinsky Awards International Piano Competition and the Grand Prix Ivo Pogorelich. In 2000, he graduated from the Royal Academy of Music and Yale School of Music with the highest of honors.\nAs a music educator, he released in 2008 his educational CD album, “From Bach To Gershwin: A Musical Journey”  (Universal Music Hong Kong 480102-0). The Audio Land Magazine calls it a \"rare successful album that Hong Kong can be proud of.\" He has also been appointed a guest professor  by the Central Conservatory of Music EOS Orchestra Academy and an Honorary Artist-in-Residence by the Hong Kong Institute of Education. He is also co-currently serving as the Music Director of his alma mater, St. Paul's Co-educational College in Hong Kong.\nHis discography includes a total of 11 albums, 10 of which released on the Naxos label. The American Record Guide calls him a \"first-rate artist\".\nAs a composer, his choral works are published by Pavane Publishing (USA), Profiri & Horvath (Germany); and his series of Piano Sight-reading Method is due for release by Brio Music Press (Hong Kong). His a cappella choral work, \"House Rules\" won the Second Prize of the Gianni Bergamo Awards in 2013 in Switzerland.\nLee also holds an MBA degree from the Hong Kong University of Science and Technology and is elected to the Beta Gamma Sigma. He also holds a Master in Law from the University of London, specialising in Intellectual Property Law.\nAs a renowned pianist, Lee was hailed by critics as a pianist:\n}}\nReferences\nExternal links\n*[http://www.warren-lee.com/ Warren Lee website]\n*[https://www.naxos.com/Bio/Person/Warren_Lee/133418 Warren Lee discography] at Naxos Records\n*[http://www.umg.com.hk/minisite/warren_lee/ Universal Music Group - Warren Lee]"
    }
  ]
}