{
  "content": [
    {
      "type": "text",
      "text": "# Warren Fury\n\n| birth_place    = Swansea, Wales\n| height         = 6 ft 1 in\n| weight         = 14 st 4 lb\n| ru_currentteam =\n| position       = Scrum-half\n| years1         = 2004–2007\n| years2         = 2006–2007\n| years3         = 2007–2009\n| years4         = 2009–2010\n| years5         = 2010–2011\n| years6         = 2012\n| years7         = 2012–2015\n| clubs1         = London Wasps\n| clubs2         = London Welsh (loan)\n| clubs3         = London Irish\n| clubs4         = London Wasps\n| clubs5         = Leeds Carnegie\n| clubs6         = Bath Rugby\n| clubs7         = Newcastle Falcons\n| apps1          = 9\n| apps2          = 15\n| apps3          = 26\n| apps4          = 32\n| apps5          = 25\n| apps6          = 1\n| apps7          = 66\n| points1        = 0\n| points2        = 5\n| points3        = 15\n| points4        = 5\n| points5        = 0\n| points6        = 0\n| points7        = 25\n| ru_clubupdate  = 27 February 2024\n| repyears1      = 2008\n| repteam1       = Wales\n| repcaps1       = 2\n| reppoints1     = 0\n| ru_ntupdate    = 14 June 2008\n}}\nWarren Llewellin Fury (born 10 December 1985) is a Welsh former professional rugby union player who plays as a scrum-half.\nA product of the Wasps Academy, he first came to attention in the 2004–05 season with a number of fine performances for the first team, not least in a friendly match against Western Stormers. Fury made a positive impact in his first year at the Wasps Academy. He made his debut for the 1st XV against Bath in January, aged just 18, and playing on the big stage did not daunt him as he went on to appear as a replacement in the Zurich Premiership semi and final. Fury missed three months in the early season through injury, making his rapid progress even more remarkable. This prompted the coaches' decision to send him to New Zealand for the summer where he gained more match time and experience playing for Auckland team.\nThe early part of his career was blighted by injuries which saw him briefly loaned to London Welsh to regain match fitness while at Wasps.\nFollowing his return to fitness he transferred to London Irish in 2007 in search of regular first team action which culminated in him winning two caps for Wales on the 2008 tour of South Africa. During the 2009 Six Nations campaign, Fury was once again called into the Wales squad as scrum-half cover.\nShaun Edwards described Wales' scrum-half rookie Fury as \"one of the toughest kids I have ever coached physically and mentally\".\nOn 19 May 2009, it was announced he would re-sign for Wasps. In July 2010 Fury joined Leeds Carnegie.\nAfter release by Leeds following a knee injury and the club's demotion from the Premiership, in January 2012 after completing rehabilitation on his right knee he was signed by Bath for three months as cover for long-term injury Mark McMillan.\nHaving left Bath, Fury spent the summer on the international Sevens circuit and was included in the Wales squad that travelled to the Las Vegas leg of the series.\nFury returned to the 15-man code with Newcastle Falcons in the RFU Championship and aided them in the promotion back to the Aviva Premiership. Fury started the play-off semi-final matches against Leeds before injuring his shoulder in first leg of the play-off final against Bedford. Fury signed an extension with Newcastle in 2014, but departed the club at the end of the 2014–15 Premiership Rugby season.\nReferences\nExternal links\n* [http://www.london-irish.com/Team/1st_XV/Warren_Fury.html London Irish profile]\n* [http://www.london-irish.com/PlayerDisplaySS.ink?skip=9&season=08/09&squadno=1154&seasonl=2008/2009&Playertype=P London Irish player detail]\n* [http://www.chroniclelive.co.uk/pa-feeds/pa-sport/2009/03/11/super-fury-animal-backed-to-rock-italy-84229-23118712/ Fury versus Italy]\n* [http://www.wasps.co.uk/news/Wasps9055.ink Wasps news]\n* [https://www.telegraph.co.uk/.../Warren-Fury-more-than-ready-for-Six-Nations-debut-says-Shaun-Edwards.html]\n* [http://www.southwalesargus.co.uk/sport/4193128.print]\n* [http://www.express.co.uk/sport/.../Super-Fury-animal-backed-to-rock-Italy]"
    }
  ]
}