{
  "content": [
    {
      "type": "text",
      "text": "# Warren J. Clear\n\n| branch        =\n| rank          = Colonel\n| battles       =\n*World War II\n**Battle of Bataan\n| awards        =\n| alma_mater    = Boston College\n| spouse        =\n}}\nWarren Joseph Clear (April 17, 1895 - March 17, 1980) was a lifelong American military diplomat and soldier. His relationship with Japan was complicated. Stationed as a military attaché at the American Embassy in Tokyo in the 1920s, Clear also became a member of the staff of the War Department during World War II, where he was devoted to an American victory over Japan. He was deployed to the Philippines when they got invaded, and had to survive in the jungles of Bataan. In 1934, Clear found a message in a bottle which he did not read for fifteen years, surprised to later discover that it was possibly the original 1578 land claim of Francis Drake, claiming California in the name of England before Spain.\nEarly life\nClear attended a Catholic high school in Newton, Massachusetts. In January 1915, Clear attended Boston College where he studied international relations as an honors student. He was also a writer and assistant editor of the Boston College school magazine, and was set to become the Senior Editor of the magazine before his education was interrupted by World War I.\nIn the summer of 1917, Clear was ordered to attend Reserve Officers' Training Corps on the grounds of Harvard University. He lived during this time in the infantry barracks at Cambridge, Massachusetts.\nIn the fall of 1917, Clear commissioned as First lieutenant in the United States Army and was given command of E. Company, 22nd Infantry Regiment (United States), stationed throughout New York and New Jersey.\nWhen World War I ended, Clear was deployed by the Army to China, where he was stationed in Peking from June 28, 1919, to June 5, 1921. In these two years, Clear learned Mandarin Chinese. His assignment while in China was to map the Chinese railroad network.\nAt some point during this time, Clear was returned to New York, where he spent time in the United States Army Recruiting Command, but was quickly re-deployed to Asia. He became a student of the Japanese language while on assignment to the American Embassy in Tokyo.\nIn 1922, Clear was embedded with the Imperial Japanese army as a student Japanese language attache and military observer, learning Japanese customs and trading American knowledge. During that time, as a \"young man,\" Clear was \"tricked\" into an arranged fight with a jiu-jitsu fighter in the Japanese Army. Clear knocked the man out with a haymaker. After the bout, General Kazushige Ugaki arranged for Clear to teach 300 of his men the basics of American boxing.\nUgaki later wrote to Clear:\nRKO made a film in 1943 called Behind the Rising Sun starring Robert Ryan, portraying the role of Warren Clear. The film recreated the boxing incident.\nOn 1 September 1923, Clear was living in Tokyo when the Great Kanto Earthquake stuck. It was followed by a devastating fire that swept through the city. This remains the deadliest earthquake in Japanese history. While Clear was in the city rendering first aid and assistance to the Japanese, his apartment burned down, with all of his possessions inside. It took seven years for Clear's claim of $737 to be approved and paid out by the United States government due to a misspelling of Clear's middle initial: his original travel orders spelled his name with the letter \"G\" instead of \"J.\"\nOn 25 January 1925, Clear engaged to Harriet Agnes Aldridge while he was still stationed at the American Embassy in Tokyo. This engagement did not last long. On November 18, 1925, Clear married Mary McIntosh Davis, from Ohio. Clear and Mary met each other while she was travelling around the world after the death of her first husband.\nIn 1928, Clear returned to the United States and got stationed at the Presidio of San Francisco, where he gave speeches to the San Francisco Club and other organizations on the lessons he had learned in his time with the foreign army.\nAlso in 1928, Clear and his wife built a house together in Pebble Beach, California and joined the Monterey Peninsula Country Club. Clear won the 1929 New Year's Day Golf tournament in Del Monte.\nIn 1929, Clear was briefly transferred to the War Department in Washington, D.C., where he reported to the G-2. It was here where he first met Millard Preston Goodfellow.\nIn the summer of 1931, Clear returned to the Presidio in San Francisco, where he instructed ROTC programs in the San Francisco Bay Area. Clear officially retired in 1935, and moved full time to the Monterey Peninsula. Clear spent his retirement playing golf, and helping with the elevation and transition of Camp Ord into Fort Ord. This retirement did not last long.\nActivities during World War II\nIn March 1940, Clear was briefly ordered back to Washington, D.C., where the soldier was turned spy for a new agency called the Office of the Coordinator of Information (COI), having been recruited by his old coworker at G-2, Preston Goodfellow, and William J. Donovan, who was the head of the new agency. Shortly afterward, he was awarded the rank of Major, and returned to his home in California.\nIn August 1940, the Salinas, California Chamber of Commerce made Clear their staff assistant secretary in charge of military affairs.\nIn April 1941, Clear was ordered back to Washington, D.C., to report directly to Henry L. Stimson, the United States Secretary of War.\nGoodfellow then sent Clear to the Philippines to report on Japanese movements in the Pacific region. He was in the islands in this capacity during the invasion by the Imperial Japanese military, having to resort to eating horses and pack mules to stay alive for several months in the jungles with his men.\nThe quote, \"There are no atheists in foxholes,\" was attributed to Clear, among other soldiers. The phrase became popular after an article Clear wrote in ''Reader's Digest'' discussing the invasion of the Philippines by the Japanese and the defence of the Bataan Peninsula; where he attributes it to a Sergeant. Clear also read this line during a national radio broadcast.\nClear was ordered to protect the vital military intelligence he had gathered above all else. When he escaped the Philippines, he had to leave most of his possessions behind. This included President Roosevelt's beloved stone lions. Clear escaped the Philippines by meeting the submarine USS Trout on a rubber dinghy and sailed on board to another location. However, the airplane carrying him to Australia was shot down by Japanese bombers, and Clear had to compose his entire mission report to the COI from memory.\nIn his famous recounting of the events at Bataan in ''Reader's Digest'', Clear wrote:\nOn April 11, 1942, Clear gave a national radio broadcast on NBC's \"Army Hour,\" where he again recounted the events of the invasion of the Philippines to the American people, and this is where many Americans first heard the quote: \"We prayed, and after the attack, the sergeant observed that there are no atheists in foxholes.\"\nIn August 1942, Clear received the Distinguished Service Medal.\nIn 1943, Clear narrated the documentary \"Divide and Conquer.\"\nClear returned to duty at the War Department, and then was assigned as an instructor at the United States Army Command and General Staff College at Fort Leavenworth for the rest of the war.\nLater life\nClear retired in Monterey and Pebble Beach, California, where played golf and participated in many tournaments.\nThe Francis Drake Document\nIn 1949, with the help of a friend and art dealer named Myron Oliver, Clear opened and read the contents of a message in a bottle which he had found on the beach fifteen years earlier – and the pair of men were startled to discover that this was the original land claim of Francis Drake, which officially claimed the Californian coastline in the name of Elizabeth I.\nThe land claim read:\n\"IN NOMINE ELIZABETH HIB ET BRITANNA RIARUM REGINA\nI DO CLAIM THIS GREAT LAND AND THE SEAS THEREOF\nTHERE BEING NO INHABITANTS IN POSSESSION.\nIN WITNESS THERTO THIS BOTTLE AT GREAT TREE BY SMALL RIVER AT LAT 36d. 30m. BEYOND ALTA HISP.\nFOR OUR MOST FAIRE AND PUISSANT QUEENE AND HERRE HEIRRS AND SUCCESSIRS FOREVER UNTO THEIRR KEEPING.\nBY GODS GRACE THIS FIRST DAY OF MAY 1579.\nFRANCIS DRAKE GENERALI\nFRANCIS FLETCHER Scri\"\nClear took the bottle and its contents to the Smithsonian Institution, where it was also studied by experts from the British Museum. However, no expert was able to verify its authenticity using any dating method that existed then, so the claim still remains in question. In 1965, Clear reported that the land claim was stolen in a home invasion – and it has never resurfaced.\nClear died in 1980, at the age of 84, in Monterey, California. He is buried at Arlington National Cemetery, where his coverstone mistakenly labels his rank as \"2nd Lieutenant.\"\nReferences"
    }
  ]
}