{
  "content": [
    {
      "type": "text",
      "text": "# Warren Ashby\n\nDr. Warren Ashby (May 15, 1920&nbsp;– October 1, 1985) was an American philosopher, born in Newport News, Virginia.\nBiography\nAshby graduated with a bachelor of arts from Maryville College, Tennessee, in 1939 and earned B.D. (1942) and Ph.D. (1947) degrees from Yale University. Following graduation, Ashby taught at the University of North Carolina at Chapel Hill, 1947–1949, then joined the faculty of Woman's College (now The University of North Carolina at Greensboro) where he taught philosophy until his retirement in 1983. Ashby, who specialized in western ethics, originated and served as head of the Department of Philosophy for twenty years. In 1970 he founded a residential college on the campus, later named Warren Ashby Residential College at Mary Foust in his honor. He was the recipient of the UNCG Alumni Teaching Excellence Award in 1967. His book, Frank Porter Graham: a Southern Liberal, was published in 1980 after more than twenty years of research.  His book, \"A Comprehensive History of Western Ethics:  What Do We Believe?\" was published posthumously in 1997.\nIn addition to his scholarly pursuits, Ashby participated in efforts to improve race relations in Greensboro. In 1955, Ashby wrote a letter to the editor of the Greensboro Daily News encouraging integrated public education, and he served on a number of local committees, including the Greensboro Human Relations Commission. From 1964 to 1966, Ashby served as the Associate Director of the international affairs division of the American Friends Service Committee in Delhi, India. He is a recipient of the February One Society Award and has a lecture series named in his honor at UNCG. He died on October 1, 1985.\nSee also\n*American philosophy\n*List of American philosophers\nReferences\n*[http://library.uncg.edu/dp/crg/personBio.aspx?c=16 Civil Rights Greensboro]\n*[http://library.uncg.edu/depts/archives/mss/html/Mss052.htm Finding Aid for the Warren Ashby Papers] at The University of North Carolina at Greensboro\n*[http://library.uncg.edu/depts/archives/civrights/index.asp Greensboro VOICES Oral History]"
    }
  ]
}