{
  "content": [
    {
      "type": "text",
      "text": "# Warren Schaeffer\n\n| birth_place        = Vandergrift, Pennsylvania, U.S.\n| bats               = Right\n| throws             = Right\n|statleague  =         MLB\n|statyear    =         September 21, 2025\n| stat1label         = Managerial record\n| stat1value         = 36–86\n| stat2label         = Winning percentage\n| stat2value         =\n| teams              =\n;As manager\n*Colorado Rockies (–present)\n;As coach\n*Colorado Rockies (–)\n}}\nWarren James Schaeffer (born January 28, 1985) is an American former professional baseball infielder and coach who is currently the interim manager for the Colorado Rockies of Major League Baseball (MLB), having previously served as the team's third base coach.\nCareer\nSchaeffer is from Vandergrift, Pennsylvania. He attended Greensburg Central Catholic High School in Greensburg, Pennsylvania, where he played on the school's baseball team as a shortstop and he led the Centurions to the PIAA Class A title and a runner-up finish in the WPIAL. He enrolled at Virginia Tech and played for the Virginia Tech Hokies. The Colorado Rockies selected Schaeffer in the 38th round of the 2007 MLB draft. He played in Minor League Baseball for the Rockies organization for six seasons.\nAfter he retired, Schaeffer remained in the Rockies organization as a coach. Schaeffer was named the manager of the Asheville Tourists for the 2015 through 2017 seasons, and the Hartford Yard Goats for the 2018 and 2019 seasons. He was named the manager of the Albuquerque Isotopes for the 2020 season, which was cancelled due to the COVID-19 pandemic. He returned to manage Albuquerque in the 2021 and 2022 seasons.\nOn November 7, 2022, the Rockies promoted Schaeffer to their major league coaching staff as their third base and infield coach for the 2023 season. Following their game on May 11, 2025, the Rockies, with a record of 7–33, named Schaeffer interim manager for the remainder of the 2025 season after firing Bud Black.\nManagerial record\n{| class=\"wikitable\" style=\"font-size: 95%; text-align:center;\"\n|-\n! rowspan=\"2\"|Team !! rowspan=\"2\"|Year !! colspan=\"5\"|Regular season !! colspan=\"4\"|Postseason\n|-\n!Games!!Won!!Lost!!Win %!!Finish!! Won !! Lost !! Win % !! Result\n|-\n!COL||2025\n||122||36||86||||5th in NL West||  || ||  ||  |\n|-\n! colspan=\"2\"|Total||122||36||86|||| ||  ||  ||  ||\n|-\n|}\nPersonal life\nSchaeffer's wife, Callie (née Rhodes), played softball at Virginia Tech. They have two children.\nReferences\nExternal links"
    }
  ]
}