{
  "content": [
    {
      "type": "text",
      "text": "# Warren Fales Draper (publisher)\n\n|birth_place = Dedham, Massachusetts\n|death_date =\n|death_place = Andover, Massachusetts\n|resting place =\n|occupation = Publisher, educator, philanthropist\n|education = B.A., Amherst College, 1847\n|spouse = Irene Patience Rowley\n}}\nWarren Fales Draper (1818–1905) was a publisher in Andover, Massachusetts for nearly 50 years.  A descendant of early Roxbury settler James Draper, he was born and raised in West Dedham, Massachusetts (later named Westwood), and graduated from Phillips Academy and Amherst College.  His plans to go into the ministry did not materialize, and he became a book seller and publisher in his adopted town of Andover, in a close professional relationship with the Andover Theological Seminary.  Through frugality and industry, he and his wife, Irene (a graduate of Abbot Academy in Andover) amassed a considerable estate, and having no children they made sizable philanthropic contributions, and offered academic prizes and scholarships to aspiring students.  Draper Hall (1890) at Abbot Academy, of which he was a trustee (now a part of Phillips Academy), was donated by the Drapers, as was Draper Cottage (1892) at Phillips.\nLife\nBorn on 12 December 1818 in Dedham, Massachusetts, Warren Fales Draper was the oldest child of Martin Draper and Sally Fisher of that town.  His father had been a deacon of the First Congregational Church of Dedham, and a member there for 44 years.  At the urging of his father's pastor, Dr. Ebenezer Burgess, Draper attended Phillips Academy in Andover, Massachusetts, graduating in 1843, then attended Amherst College, from which he graduated in 1847.  He then entered the Andover Theological Seminary to become a minister, but failing eyesight compelled him to leave the school.  During his many years of schooling, he partially supported himself by teaching in the public schools of Andover, Holliston, Medfield, and Canton.\nIn 1849 Draper returned to Andover, and began a career in the book selling and publishing business by going to work for the publishers Allen, Morill, and Wardwell.  In 1854 he became the proprietor of this business, and for nearly 40 years he was the leading publisher, printer and book seller in Andover.  During his tenure there, he published more than 600 volumes, some of them reaching quite large sales. In addition, Draper published periodicals for Andover Theological Seminary and was, from 1855 through the Civil War, owner-publisher of the Andover Advertiser, a non-partisan [but strongly pro-Republican] local weekly. Through thrift and enterprise he accumulated a considerable estate.  Having no children, Draper and his wife, Irene—a graduate of Abbot Academy in the same year Draper graduated Phillips Academy—dispensed more than $100,000 to institutions in Andover.  They were large benefactors of Abbot Academy (now a part of Phillips Academy). Abbot's Draper Hall (1890) was built by the Drapers.  Warren Draper served for more than 20 years as the treasurer of Abbot, was one of the school's trustees, and also acted as general superintendent of the material interests of the school.  The Drapers also established a prize fund and a scholarship at Phillips Academy, and built Draper Cottage for the academy in 1892.  This cottage was given to the school, provided an annuity be given his wife until her death, which occurred on 27 December 1916 when she was in her 93rd year.\nAfter disposing of his business, Draper continued to devote himself to publishing works for the use of theological students and clergymen.  He died on 8 January 1905 in Andover, and was survived by his wife.  Claude Fuess wrote that he was an example of \"the old New England type of a Christian business man.\"\nFamily\nDraper married on 24 May 1848 Irene Patience Rowley of Wrentham, Massachusetts, the daughter of Reuben Rowley, but the couple had no children.  She graduated from Abbot Academy in 1843. His younger brother, Daniel Fisher Draper, was a dentist, and had a grandson, Warren Fales Draper, named in honor of the subject, who became the Deputy Surgeon General of the United States Public Health Service and served on General Dwight Eisenhower's staff in Europe during World War II.\nAncestry\nBesides being descended from James Draper, Warren Draper also descends from William Wentworth.  The Draper ancestors of Warren Fales Draper are documented in the book Drapers in America, by Thomas W. Draper.  The remaining members are found in Descendants of John Dean, The Fisher Genealogy, The Cheney Genealogy, and The Wentworth Genealogy.\nSee also\n*Phillips Academy\n*Abbot Academy\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[http://www.pa59ers.com/map/key/history/050.html Draper Hall at Phillips Academy]\n*[https://books.google.com/books?id=L9xRgiUbAKIC&dq=draper+hall+andover&pg=PA101 Draper Hall]\n*[https://archive.org/details/anoldnewengland00fuesgoog  History of Phillips Academy]\n*[https://archive.org/details/sequeltoannalsf01mckegoog  Sequel to Annals of Abbot Academy]\n*[http://www3.amherst.edu/~rjyanco94/genealogy/acbiorecord/1847.html Amherst College Biographical Record, 1847]"
    }
  ]
}