{
  "content": [
    {
      "type": "text",
      "text": "# Warroo, Queensland\n\n| pop                 = 39\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4387\n| area                = 381.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 41.1\n| dir1                = SE\n| location1           = Inglewood\n| dist2               = 67.8\n| dir2                = WNW\n| location2           = Stanthorpe\n| dist3               = 100\n| dir3                = SW\n| location3           = Warwick\n| dist4               = 133\n| dir4                = SW\n| location4           = Goondiwindi\n| dist5               = 255\n| dir5                = SW\n| location5           = Brisbane\n| lga                 = Goondiwindi Region\n| stategov            = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Oman Ama\n| near-ne             = Terrica\n| near-e              = Pikedale\n| near-se             = Pikes Creek\n| near-s              = Glenlyon\n| near-sw             = Silver Spur\n| near-w              = Greenup\n| near-nw             = Greenup\n}}\nWarroo is a rural locality in the Goondiwindi Region, Queensland, Australia. In the , Warroo had a population of 39 people.\nGeography\nThe Stanthorpe - Inglewood Road enters the locality from the north-east (Terrica) and exits to the north-west (Greenup).\nWarroo has the following mountains:\n* Mount Bullaganang in the north of the locality (), rising to  above sea level\n* Mount You You in the east of the locality ()\n* Fish Hole Mountain in the south of the locality ()\nThe land use is predominantly grazing on native vegetation.\nHistory\nCopper was discovered in 1897. The Ashton Copper Mine operated until about 1900, yielding copper and silver.  The Commodore Mine operated from 1905 to 1913. The Warroo Mine operated from 1910 to 1913, reopening in 1931, and again from 1990 to 1992.\nDemographics\nIn the , Warroo had a population of 25 people.\nIn the , Warroo had a population of 39 people.\nEducation\nThere are no schools in Warroo. The nearest government primary schools are Inglewood State School in Inglewood to the north-west, Greenlands State School in Greenlands to the east, and Texas State School in Texas to the south-west. The nearest government secondary schools are Inglewood State School (to Year 10), Texas State School (to Year 10), and Stanthorpe State High School (to Year 12) in Stanthorpe to the east, but some students in Warroo would be too distant to attend these secondary schools; the alternatives are distance education and boarding school.\nReferences"
    }
  ]
}