{
  "content": [
    {
      "type": "text",
      "text": "# Warren Parry\n\n| birth_place = Wreys Bush, New Zealand\n| death_date =\n| death_place =\n| hometown = Invercargill, New Zealand\n| since = 1987\n| darts = 21 Gram Shot Signature\n| laterality = Right-handed\n| music = \"Roadhouse Blues\" by The Doors\n| BDO = 1993–2005\n| PDC = 2005–\n| WDF = 2020–\n| currentrank =\n| BDO World =\n| World Masters =\n| World Darts Trophy =\n| Int. Darts League =\n| PDC World = Last 64: 2006, 2008, 2010\n| Matchplay =\n| Grand Prix =\n| UK Open =\n| Vegas =\n| Premier League =\n| results =\n| achievement =\n| medaltemplates =\n}}\n| updated =\n}}\nWarren \"Wazza\" Parry (born 9 January 1964) is a New Zealand professional darts player who played in World Darts Federation (WDF) events. He is widely considered the greatest New Zealand player of all time.\nCareer\nParry reached the final of the 1999 WDF World Cup Men's Singles event, beating Marko Kantele in the last 16, Andy Fordham in the quarter-finals and fellow New Zealander Herbie Nathan in the semis before losing to Raymond van Barneveld 4–1. Parry then went on to win the 2000 WDF Asia-Pacific Cup. Despite losing his opening group game to Australia's Tony David, Parry won his next two group games to secure qualification for the knockout stage. He defeated Malaysia's Tengku Hadzali Shah 4–3 to win the trophy. During that time, Warren won the New Zealand Open back to back in 1999 and 2000. He went on to win it again in 2005.\nParry won the 2005 Oceanic Masters beating Russell Stewart 6–2 in the final. This earned him a place in the 2006 PDC World Championship at the Circus Tavern in Purfleet. He lost in the first round 3–0 to Mark Walsh. Parry reached the final of the 2006 WDF Asia-Pacific Cup, but lost 4–3 to Amin Abdul Ghani and beat Neville Moss 5–3 to claim the 2007 New Zealand Masters. Also in 2007, Parry claimed his second Oceanic Masters title and made his second appearance in the PDC World Championship in 2008 which moved from the Circus Tavern to the larger Alexandra Palace. He was drawn against Alex Roy in the first round, narrowly losing by three sets to two.\nParry won the 2009 Oceanic Masters and won a spot in the World Championship for the third time. He played five-time world champion Raymond van Barneveld in the first round, but was beaten 3–0.\nIn 2013, Parry won the Southland Masters by defeating Stephen Padget 5–2 in the final. Later in the year he won the DartPlayers New Zealand Qualifier for the inaugural Sydney Darts Masters, a tournament which formed the new World Series of Darts. He faced Paul Nicholson in the first round and lost 6–4. Parry also won the Wainuiomata Open courtesy of a 7–5 victory over Greg Moss.\nIn 2014, Parry participated in the inaugural Perth Darts Masters and lost 6–1 against Nicholson in the first round. A week later he qualified for the Sydney Darts Masters as New Zealand's number one player and recorded the biggest win of his career by coming back from 5–1 to beat world number one and reigning world champion Michael van Gerwen 6–5. Parry played James Wade in the quarter-finals and was defeated 8–2.\nParry won through to the final of the 2015 South Island Masters, where he lost 6–2 to Peter Hunt. Parry played with Rob Szabo in the 2015 World Cup and they secured New Zealand's first win in the event since 2010 by knocking out Canada 5–4. They faced Northern Ireland in the second round with Szabo losing 4–1 to Brendan Dolan and Parry losing 4–0 to Mickey Mansell to exit the tournament. Parry qualified for his third Sydney Darts Masters, but was whitewashed 6–0 by Gary Anderson in round one. He won through to the final of the Oceanic Masters, but lost 8–4 to Koha Kokiri.\nIn 2016, Parry secured the South Island Masters title by beating Graeme Ryder in the final. Parry and new partner Cody Harris moved 3–1 up on Scotland in the first round of the World Cup, but they lost 5–3. Parry and Harris contested the final of the DPA Australian Matchplay, with Harris prevailing 6–5. He was also edged out in the final of the Alan King Memorial 5–4 by Mark McGrath.\nParry won the New Zealand Qualifier for the 2017 World Championship with a 7–3 success over Rob Szabo in the final. He lost 2–0 in the preliminary round to Jerry Hendriks with both sets going to deciding legs.\nWorld Championship results\nPDC\n* 2006: First round (lost to Mark Walsh 0–3) (sets)\n* 2008: First round (lost to Alex Roy 2–3)\n* 2010: First round (lost to Raymond van Barneveld 0–3)\n* 2017: Preliminary round (lost to Jerry Hendriks 0–2)\nReferences\nExternal links\n*[http://www.shotdarts.com/SHOT+AMBASSADORS/WARREN+PARRY.html Profile on Shot! Darts]\n* [http://www.shotdarts.com/shop/Darts/Steel+Tip+Darts/Darts+By+Range/Shot+Ambassadors+Darts/-SDWPST-22.html 22gm Steel Tip Dart from Shot! Darts]\n* [http://www.DartsDatabase.co.uk/PlayerDetails.aspx?playerKey=1412 Profile and stats on Darts Database]"
    }
  ]
}