{
  "content": [
    {
      "type": "text",
      "text": "# Warren H. Carroll\n\n| death_date                =\n| birth_place               = Maine, U.S.\n| death_place               = Manassas, Virginia, U.S.\n| body_discovered           =\n| death_cause               =\n| resting_place             = Christendom College, Front Royal, Virginia\n| resting_place_coordinates =\n| monuments                 =\n| other_names               =\n| known_for                 = Founder of Christendom College  Author of A History of Christendom series\n| television                =\n| education                 = Bates College (BA)Columbia University (MA, PhD)\n| alma_mater                =\n| employer                  =\n| organization              = Christendom College\n| notable_works             =\n| style                     =\n| occupation                =\n| years_active              =\n| height                    =\n| title                     = President of Christendom College\n| term                      = 1977-1985\n| predecessor               =\n| successor                 = Damian Fedoryka 1985-1992\n| party                     = Republican\n| movement                  = Reform of Catholic higher education\n| opponents                 =\n| boards                    =\n| criminal_charge           =\n| criminal_penalty          =\n| criminal_status           =\n| spouse                    = Anne W. Carroll, author\n| partner                   =\n| children                  =\n| parents                   =\n| relations                 =\n| callsign                  =\n| awards                    =\n| signature                 =\n| signature_alt             =\n| website                   =\n| footnotes                 =\n}}\nWarren Hasty Carroll (March 24, 1932 – July 17, 2011) was the founder and first president of Christendom College in Front Royal, Virginia. He authored multiple works of Roman Catholic church history.\nEarly life and education\nCarroll was born on March 24, 1932, in Maine, the son of Herbert Allen Carroll and Gladys Hasty Carroll, a writer. He received his B.A. in history from Bates College in 1953. He received his M.A. and Ph.D. in history from Columbia University. His younger sister, Sarah Watson, who died one month after Warren in 2011, and both of their parents were also Bates College graduates.\nCareer\nCarroll served at one time in the Central Intelligence Agency's anti-communism division as a Communist propaganda analyst. From 1967 to 1972, he served on the staff of California State Senator and later U.S. Congressman, John G. Schmitz.\nA year after his marriage to Anne Westhoff, Carroll converted from Deism to Catholicism in 1968 and began working for the Catholic magazine Triumph. In 1977, he founded Christendom College with the help of other Catholic laymen, in particular, William H. Marshner, Jeffrey A. Mirus, Raymund P. O'Herron, and Kristin M. Burns. He served as the first president of the college, until 1985, and chairman of its History Department until his retirement in 2002.\nHe helped his wife author Christ the King, Lord of History, Christ in the Americas, a job that would later prove most beneficial when writing his comprehensive study of international communism, and Seventy Years of the Communist Revolution, updated and re-released as The Rise and Fall of the Communist Revolution.\nCarroll lived in Manassas, Virginia, with his wife Anne, founder of Seton School and Seton Home Study School.\nBefore his death, he returned to Christendom College each month during the school year to deliver public lectures on select historical topics, ranging from the history of Malta, to Genghis Khan, to the French Revolution, and topics from the 20th century, with lectures on Emperor Karl of Austria and the Russian Revolution in 1917. Carroll remained a member of the board of directors and played an active role in helping to guide the college through the years.\nDeath\nCarroll died on July 17, 2011, in Manassas, Virginia, at the age of 79, after a number of years of dealing with the effects of numerous strokes. He was interred at Christendom College in a grave overlooking the Shenandoah River behind the college's Regina Coeli Hall. On September 16, 2012, Carroll's Celtic cross headstone, which is inscribed with \"Truth exists. The Incarnation happened\", was blessed by college chaplain Fr. Donald Planty.\nAwards\nChristendom College, the school he founded, awarded Carroll with an honorary doctorate in humane letters in 1999, its Pro Deo et Patria Award for Distinguished Service to God and Country in 2007, and its inaugural Queen Isabel Catholic Vision of History Award in 2007. The Society of Catholic Social Scientists, an organization of which he was a board member, named him its inaugural recipient of the Pius XI Award in history in 1995.\nHe published articles through the society's periodical, the Catholic Social Science Review. Carroll is also known for his major work, the multi-volume \"History of Christendom\".  At the time of his death, only five volumes had been published; Anne Carroll helped complete the sixth volume, published in the summer of 2013.  The series presents a narrative account of Western Civilization and Catholic history from antiquity around 2000 BC through 2010.\nBooks\nNon-fiction\n*Reasons for Hope (1978), co-written with William Marshner, Jeffrey A. Mirus, and Kristin Popik Burns\n*1917: Red Banners, White Mantle (1981)\n*Our Lady of Guadalupe and the Conquest of Darkness (1983)\n*A History of Christendom\n# The Founding of Christendom [to 324] (1985)\n# The Building of Christendom [324–1100] (1987)\n# The Glory of Christendom [1100–1517] (1993)\n# The Cleaving of Christendom [1517–1661] (2000)\n# The Revolution against Christendom [1661–1815]  (2005), co-written with Anne Carroll\n# The Crisis of Christendom [1815–2005] (2013), co-written with Anne Carroll\n*The Guillotine and the Cross (1986)\n*Seventy Years of the Communist Revolution (1989)\n*Isabel of Spain: The Catholic Queen (1991)\n*The Rise and Fall of the Communist Revolution (1995)\n*The Last Crusade: Spain 1936 (1996)\n*2000 Years of Christianity (2000), co-written with Gloria Thomas\nFiction\n*The Tarrant Chronicles\n**The Book of Victor Tarrant\n**The Book of Victor & Valerie Tarrant (Amazon Kindle e-book only)\n**The Book of Star Tarrant (Kindle only)\n**The Book of Rex Tarrant (Kindle only)\n**The Book of Dan Tarrant (Kindle only)\n**The Book of All The Tarrants (Kindle only)\nReferences\nExternal links\n* [https://www.christendom.edu/about/warren-h-carroll/ Warren H. Carroll – Founder of Christendom College] (christendom.edu)\n*"
    }
  ]
}