{
  "content": [
    {
      "type": "text",
      "text": "# Warriston School\n\nWarriston School was a private preparatory school for boys in Moffat, Scotland.  From September 1963 the school catered for pupils from ages 9–18.\nWarriston School was ultimately owned and run by Brian Larmour and his wife. Age group was from 10 to 18 years old. Warristonschool.com.\nHistory\nWarriston School was established by F.W. Gardiner in 1899 and named after Archibald Johnston, Lord Warriston.  The school was situated at 'Holmpark' in Ballplay Road and started with 5 boys.  In 1932 Mr and Mrs Gardiner retired after 33 years.\nFormer students at the school included the Smith brothers. In December 1919, Captain Ross Smith and his brother Keith, flying with two companions became the first people to fly from England to Australia.  There were three Smith brothers educated at Warriston, Colin having fallen during the war.  The Scotsman reported:\nFrom 1932-1935 the Essex cricketer and Walker Cup golfer, Leonard Crawley, was the headmaster of Warriston.  On 5 July 1933 Sir Jack Hobbs the Surrey and England cricketer played in a match at Warriston School sports grounds for an L.G. Crawley XI v H.B. Rowan XI.  Hobbs and Crawley put on 140 for the first-wicket partnership but lost the match by 26 runs.\nThe Edinburgh Evening News reported in 1933 that the former Wales rugby union scrum-half D. E. A. Roberts was teaching at Warriston.\nIn April 1935 Crawley relinquished the headmastership of Warriston, but the school remained his property.  Furthermore, a board of governors was appointed.  The board included General Sir Archibald Cameron General Officer Commanding-in-Chief, Scottish Command; Admiral J. E. Cameron, late Commander-in-Chief, Rosyth; Mr Angus Forsyth, hon. secretary of Old Warristonians; Dr Stanley Honeyman; Mr Finlay Ramage, W.S.; Mr G. B. Smith, headmaster Sedbergh School; Mr L. G. W. Wilkinson, chairman of the governors of Tynemouth School; and Mr Crawley.  Crawley was succeeded as headmaster by Mr A.B. Carter.\nOn 13 July 1984 Warriston School was advertised for sale as a going concern in The Times by Arthur Young McClelland Moores and Co, Glasgow.\nNotable alumni\n*Professor Ian Donald (1910-1997), Scottish physician who pioneered the use of diagnostic ultrasound in medicine.\n*Hugh Fraser, 1st Baron Fraser of Allander (1903-1966), owner and chairman of House of Fraser.\n*Bill Nicholson (1909-2001), Scottish cricketer and president of the Scottish Rugby Union from 1968-1969.\n*Ken Oliver (1914-1999), racehorse trainer with over 1,000 winners.\n*Sir Keith Macpherson Smith (1890-1955), Australian aviator who with his brother and two other men became the first people to fly from England to Australia.\n*Sir Ross Macpherson Smith (1892-1922), Australian aviator.\n*Sir Victor Warren (1903-1953), Lord Provost of Glasgow from 1949-1952.\n*Sir James Henderson (1901–1993), British diplomat.\nReferences"
    }
  ]
}