{
  "content": [
    {
      "type": "text",
      "text": "# Warren Brown (actor)\n\n| birth_place        = Warrington, Cheshire, England\n| death_date         =\n| death_place        =\n| othername          =\n| occupation         = Actor\n| yearsactive        = 1994–present\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| website            =\n| awards             =\n}}\nWarren Martin Brown (born 11 May 1978) is an English actor, widely known for his roles as Donny Maguire in Shameless and Andy Holt in Hollyoaks, DS Justin Ripley in the BBC crime drama Luther and as Sergeant Thomas \"Mac\" McAllister in the British-American action television series Strike Back, starting with Strike Back: Retribution.\nEarly life\nWarren Brown was born in Warrington, England. He studied at the University of Salford.\nCareer\nAfter appearing in two episodes of the television series Shameless, Warren played the evil Andy Holt in Channel 4's  Hollyoaks. Brown was nominated for a number of awards for his performance in the show including Best Villain, Best Actor, Most Spectacular Scene and Best Exit at the 2006 British Soap Awards. Brown's character Holt met his demise in February 2006.\nBrown won a role in the short-lived ITV show Jane Hall in the summer of 2006. This was followed in March 2007 by his role as Tommo in ITV's Mobile. Also in 2007 he starred as Chris in one episode of Casualty. In September 2007 he starred in the second series of BBC Three's Grownups, playing barman Alex Salade and has played the part since. In the 2009 Comic Relief Special of Two Pints of Lager and a Packet of Crisps, which was a crossover between Grownups, Two Pints and Coming of Age, he played Alex again.\nIn 2008, Brown performed the voiceover for the film trailer of Gomez: A True Story, based on the life of boxer Michael Gomez and starring ''Emmerdale's'' Kelvin Fletcher. In October 2008, Brown played the role of Marky in E4's zombie drama Dead Set. In November 2008, he appeared in Casualty, but not playing the same character as he did in 2007. In 2009 Brown appeared in the three part BBC Iraq war drama Occupation, alongside James Nesbitt and Stephen Graham Brown has appeared in two episodes of The Bill playing Jake Clegg, who was a part of the operation of trafficking young girls illegally. These episodes were titled \"The Forgotten Child\".\nFrom May 2010, he appeared as the regular character of DS Justin Ripley in the BBC drama Luther, a role that he reprised in June 2011 in the second series of Luther. Brown left the series in 2013.\nBrown appears in the deadmau5 music video for the song \"I Remember\", also starring Stephen Graham, Aston Kelly (Graham's brother), Greg Walsh and ex-Coronation Street actress Emma Edmondson. In October 2010, Brown appeared as Matt in the BBC drama Single Father. In February 2012, he played one of the main characters in the BBC drama series Inside Men. He appeared as a member of Bane's Mercenary Security in The Dark Knight Rises, the third instalment of Christopher Nolan's Batman trilogy.\nFirst broadcast in August 2012, Brown starred as PC John-Paul Rocksavage in the four-part BBC police drama Good Cop.\nFrom 2017, he plays Sergeant Thomas \"Mac\" McAllister in Retribution,  the British-American action television series, in the sixth series and second revamp of Strike Back opposite Daniel MacPherson.  The eighth series finished filming and aired in February 2020.\nBrown has appeared in many audio dramas for the company Big Finish Productions, the most notable of which including a recurring role in their UNIT series, a spin-off based around the military organisation that regularly appeared in Doctor Who, since 2016, and playing Keith Burrow in Big Finish's original eight-part thriller Transference. In 2020, Brown would make his debut appearance in the television series, in the episode \"Praxeus\", albeit as a different character, former police officer Jake Willis, who was looking for his husband.\nIn 2023, Brown featured as a main cast member in BBC One drama Ten Pound Poms. For his portrayal of Terry Roberts, he was awarded the Best Actor trophy in the Fiction portion of the Golden Nymph Awards at the Monte-Carlo Television Festival.\nKickboxing\nBrown has competed at world-level in Muay Thai (Thai kickboxing) and is a two-time World Champion.\nFilmography\nFilm\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Role\n|-\n| 2008\n| Gomez: A True Story\n| Voice over\n|-\n|rowspan=4|2012\n| The Dark Knight Rises\n| Mercenary Security 1\n|-\n| Byzantium\n| Wee Gareth\n|-\n| Borrowed Time\n| Nigel Petite\n|-\n| Up There\n| Slab Boy Joey\n|-\n|rowspan=2|2014\n| Get Some\n| Hunter\n|-\n| The Great Englishman\n| Captain Matthew Webb\n|-\n| 2015\n| Kicking Off\n|Little Wigsy\n|-\n| 2017\n| The Hatton Garden Job\n| Trotter\n|-\n|rowspan=2|2018\n| Genesis\n| Secretary Jordan Bruce Ainsney\n|-\n| Blood, Sweat And Terrors\n| Hunters (segment \"Get Some\")\n|}\nTelevision\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Role\n! class=\"unsortable\" | Notes\n|-\n| 2004–2005\n| Shameless\n| Donny Maguire\n| 2 episodes\n|-\n| 2005–2006\n| Hollyoaks\n| Andy Holt\n| 20 episodes\n|-\n| 2006\n| Jane Hall\n| Policeman 2\n| 2 episodes\n|-\n| 2007–2009\n| Grownups\n| Alex\n| 12 episodes\n|-\n|rowspan=2|2007\n| Casualty\n| Chris Ryder\n| Episode: \"Warren's Too Short\"\n|-\n| Mobile\n| Tiny Tommo\n| 2 episodes\n|-\n|rowspan=5|2008\n| Casualty\n| John Fullman\n| Episode: \"The Line of Fire\"\n|-\n| Coming Up\n| Campbell\n| Episode: \"And Kill Them\"\n|-\n| Spooks: Code 9\n| Luke Blackwell\n| Episode #1.4\n|-\n| Dead Set\n| Marky\n| 5 episodes\n|-\n| The Bill\n| Jake Clegg\n| 2 episodes\n|-\n|rowspan=3|2009\n| Two Pints of Lager and a Packet of Crisps\n| Alex\n| Episode: \"Comic Relief Special: When Janet Met Michelle\"\n|-\n| Occupation\n| Lee Hibbs\n| 3 episodes\n|-\n| Criminal Justice\n| PO Paul Gibby\n| 3 episode\n|-\n|rowspan=2|2010\n| Single Father\n| Mattress\n| 4 episodes\n|-\n| Accused\n| David Dinky Wade\n| Episode: \"Alison's Story\"\n|-\n| 2010–2015\n| Luther\n| DS Justin Ripley\n| 16 episodesNominated—Crime Thriller Award for Best Supporting Actor on TelevisionNominated—Critics' Choice Television Award for Best Supporting Actor in a Movie/Miniseries\n|-\n|rowspan=2|2011\n| Walk Like a Panther\n| Ricky Rickson\n| Episode #1.1\n|-\n| Moving On\n| Frank\n| Episode: \"Donor\"\n|-\n|rowspan=3|2012\n| Inside Men\n| Marcus\n| 4 episodes\n|-\n| Homefront\n| Joe Mancetta\n| 6 episodes\n|-\n| Good Cop\n| John Paul Rocksavage\n| 4 episodes\n|-\n|rowspan=2|2013\n| ''Agatha Christie's Marple\n| Arthur Jackson\n| Episode: \"A Caribbean Mystery\"\n|-\n| By Any Means\n| Jack Quinn\n| 6 episodes\n|-\n| 2015–2017\n| X Company\n| Neil Mackay\n| 28 episodes\n|-\n|2017–2020\n| Strike Back''\n|Sergeant Thomas 'Mac' McAllister\n| 27 episodes\n|-\n|2017\n|Liar\n|Tom Bailey\n| 6 episodes\n|-\n|2020\n|Doctor Who\n|Jake Willis\n|Episode: \"Praxeus\"\n|-\n|2021\n|GamesMaster\n|Himself\n|Episode 2\n|-\n|2022-2024\n|The Responder\n|Raymond Mullen\n| 5 episodes\n|-\n|2022\n|Trigger Point\n|Karl Maguire\n| 5 episodes\n|-\n| 2023-2025\n|Ten Pound Poms\n|Terry\n|Main cast\n|-\n| 2023\n|Desperate Measures\n|Patrick\n|Main cast\n|-\n| 2024\n| The Gathering\n| Paul\n| Main cast\n|}\nVideo games\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Role\n! class=\"unsortable\" | Notes\n|-\n| 2020\n|Watch Dogs: Legion\n|Dalton Wolfe\n|Voice\n|-\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}