{
  "content": [
    {
      "type": "text",
      "text": "# Warren McClendon\n\n| birth_place  = Brunswick, Georgia, U.S.\n| height_ft    = 6\n| height_in    = 4\n| weight_lb    = 317\n| high_school  = Brunswick (GA)\n| college      = Georgia (2019–2022)\n| draftyear    = 2023\n| draftround   = 5\n| draftpick    = 174\n| pastteams    =\n* Los Angeles Rams (–present)\n| status       = Active\n| highlights   =\n* 2× CFP national champion (2021, 2022)\n* First-team All-SEC (2022)\n| statweek     =\n| statseason   = 2024\n| statlabel1   = Games played\n| statvalue1   = 19\n| statlabel2   = Games started\n| statvalue2   = 5\n| pfr          = McClWa00\n}}\nWarren Christopher McClendon (born April 11, 2001) is an American professional football offensive tackle for the Los Angeles Rams of the National Football League (NFL). He played college football for the Georgia Bulldogs.\nEarly life\nMcClendon grew up in Brunswick, Georgia and attended Brunswick High School. He was rated a four-star recruit and committed to play college football at Georgia.\nCollege career\nMcClendon played during his true freshman season before redshirting the year. As a redshirt freshman, he started nine of Georgia's ten games and was named a Freshman All-American by the Football Writers Association of America. McClendon started all 15 of Georgia's games at right tackle as the Bulldogs won the 2022 College Football Playoff National Championship. He was named first team All-Southeastern Conference (SEC) as a redshirt junior. McClendon suffered a knee injury in the 2022 SEC Championship Game and missed the 2022 Peach Bowl.\nProfessional career\n}}\nMcClendon was selected by the Los Angeles Rams in the fifth round, 174th overall, of the 2023 NFL draft. As a rookie, he appeared in six games in the 2023 season.\nPersonal life\nMcClendon's uncle, Willie McClendon, played running back at Georgia and in the NFL for the Chicago Bears. His cousin, Bryan McClendon, also played at Georgia and for the Bears and is currently the Tampa Bay Buccaneers wide receivers coach. He was previously the Bulldogs' passing game coordinator and wide receivers coach.\nReferences\nExternal links\n*[https://www.therams.com/team/players-roster/warren-mcclendon-jr/ Los Angeles Rams bio]\n*[https://georgiadogs.com/sports/football/roster/warren-mcclendon/6441 Georgia Bulldogs bio]"
    }
  ]
}