{
  "content": [
    {
      "type": "text",
      "text": "# Warrick Brownlow-Pike\n\n| birth_place = London, England\n| death_date  =\n| death_place =\n| other_names =\n| occupation  = Puppeteer\n| known_for = Sesame StreetCBeebies\n}}\nWarrick Brownlow-Pike (born 28 January 1985) is a British puppeteer. He is best known for performing the character \"Gonger\" on Sesame Street and its spinoff series The Furchester Hotel and Dodge T. Dog on the CBBC channel.\nAs a CBBC presenter\nWarrick was half of the 'Ed and Oucho' presenter duo for CBBC. Ed Petrie and Oucho T. Cactus presented live afternoon continuity for the CBBC Channel on weekdays, from 15:25 to 19:00 from on 3 September 2007 until January 2010.\nIn April 2010 he returned to present CBBC continuity performing 'Dodge T Dog', Hacker the Dog's half brother.\nEd Petrie spoke about Oucho on his Twitter social networking page on 16/6/10. \"Q: What have u done with Oucho?!! A: Nothing! He's taking it easy, but we have lots of ideas for shows with him. Maybe in 2011.\" When Warrick was asked on his Twitter on 18/6/10 about if Oucho is back soon he says: \"Hopefully! Lets cross all of our fingers, toes and things!\"\nCBBC shows\nEd and Oucho's first CBBC programme, ''Ed and Oucho's Excellent Inventions debuted on 5 January 2009 at 4:30pm on the CBBC Channel. A second series of the show was filmed in Summer 2009 and premièred at the beginning of 2010\nEd and Oucho had their own Weekend show from 16 May – 9 August 2009 called Transmission Impossible with Ed and Oucho where they flew a blimp, taking over Weekend Transmission on BBC 2 and CBBC. It ended on Sunday 9 August 2009 so they could start filming Series 2 of Ed and Oucho's Excellent Inventions''.\nOucho T Cactus\nOucho T Cactus is Ed Petrie's puppet companion, operated and voiced by Warrick Brownlow-Pike.  Oucho speaks in the language \"Cactinian\" and his favourite food is bananas.  He fears dogs, lawn mowers, water, Basil Brush and Anne Robinson. He has an unashamed love of Dolly Parton. Oucho often dresses up in a blonde wig and mimes to her music. Oucho says he's from Bracknell.\nOucho left CBBC in January 2010, according to CBBC as he was going to be working in another office at the BBC. This was because his puppeteer Warrick Brownlow-Pike was leaving the channel to film for BBC 3, although he returned to puppeteer Dodge T Dog, temporarily retiring Oucho until further notice.\nEd Petrie and Oucho were briefly reunited on TMi on 26 November 2010, their first appearance together since January.\nEd and Oucho were last seen together in November 2011.\nOucho made a guest appearance on CBBC for New Year's Eve 2011: for the first time, his Cactinian speech was translated via subtitles on screen as a gag where no one can understand what he is saying.\nOn 11 March 2011, Chris Johnson was asked via his Formspring account if Oucho T Cactus would be returning. Johnson replied: \"Since Oucho's puppeteer, Warrick, is still with us as Dodge, it's likely that the little cactus will keep popping up from time to time. However it seems unlikely he'll return as a presenter. The times, they are a changin!\"\nPetrie and Brownlow-Pike later reunited to create new short comedy sketches featuring Ed and Oucho on YouTube in 2019.\nDodge T Dog\nDodge T Dog is a character operated by Brownlow-Pike. Dodge was first seen on 30 March 2010. Dodge is Hacker T Dog's half brother.\nDodge started in April 2010 by presenting the afternoons with Iain Stirling, while Hacker T Dog was away filming series 2 of Scoop. When Hacker returned to the CBBC Office, Ed Petrie left continuity. This left Chris Johnson with no co-host, so Dodge stepped in to present with Chris. Hacker then returned to weekdays with Iain.\nOver the 2010 summer holidays, Johnson and Dodge presented the weekday mornings. In late August 2010 Hacker left to film Scoop series 3, Dodge took on the Weekday Afternoons with Iain Stirling.\nChris has presented with London Hughes since the beginning of September 2010 leaving Dodge without a co-host.  Dodge presented with Iain Stirling while Hacker the Dog was filming Hacker Time in Spring 2011. Dodge would later star in Hacker Time with Hacker.\nOn 24 March 2011 Dodge left CBBC, according to the BBC he was \"Travelling The World\", to let Brownlow-Pike film series two of Mongrels. Dodge returned to CBBC on 19 July 2011 and his shift was Holiday Morning with Chris Johnson and London Hughes. Dodge went back to presenting with Johnson after Hughes' departure.\nSince 2014, Dodge has been a panelist on The Dog Ate My Homework. He has appeared in five episodes.\nIn November 2014, Dodge became a part-time presenter for the channel CBeebies whilst continuing to present CBBC full-time. In 2016, Dodge became a full-time presenter for CBeebies. He continues to be a part-time presenter on CBBC, however he now presents less frequently than Hacker, with his most recent appearance being 28 March 2025.\nBL1NK BOT 3\nOn 24 October 2016, a new, unnamed robot was revealed on CBBC. On 28 October 2016, his name was announced as BL1NK BOT 3 (pronounced Blink Bot 3).\nMongrels\nMongrels is an adult comedy puppet show on BBC Three. Warrick Brownlow-Pike performs Marion the Cat and various other characters including a stud dog, drugged hamster and Laddie a suicidal sheepdog.\nThe Dark Crystal: Age of Resistance\nBrownlow-Pike puppeteered the conniving Skeksis Chamberlain skekSil in the 2019 Netflix series The Dark Crystal: Age of Resistance. Additionally, Brownlow-Pike puppeteered a Red-Haired Paladin, Podling Servant #1, Lath'N and Maudra Laesid. He followed up on Frank Oz's performance as skekSil in The Dark Crystal by incorporating the same \"snaky\" movements.\nFilmography\n{| class=\"wikitable\"\n|-\n! Year !! Role(s) !! Title !! Notes\n|-\n| 2007-2008 || Additional Puppeteer || Space Pirates || Assistant to Sarah Burgess\n|-\n| 2008 || Assistant to Dave Chapman || ''Carrie and David's Popshop || Three Episodes\n|-\n| 2007-2011 || rowspan=\"3\"| Oucho T. Cactus || CBBC || presenting in the CBBC Office with Ed Petrie\n|-\n| 2008-2009 || Ed and Oucho's Excellent Inventions ||\n|-\n| 2009 || Transmission Impossible with Ed and Oucho ||\n|-\n| 2009-2011 || Marion || Mongrels || puppetry only, voiced by Dan Tetsell\n|-\n| 2010-2016 || Dodge T. Dog || CBBC || presenting in the CBBC Office/CBBC HQ\n|-\n| 2010, 2011, 2012 || Assistant Puppeteer || Milkshake! presentation || assistant to Kevin Clash and Leslie Carrara-Rudolph for Elmo and Abby Cadabby\n|-\n| 2011, 2016 || Dodge T. Dog, additional puppeteer || Hacker Time ||\n|-\n| 2012–present || Jobi || Get Well Soon || with Ranj Singh\n|-\n| 2013 || Additional Puppeteer || That Puppet Game Show ||\n|-\n| 2014-2017 || Gonger (series 2 only), additional characters || The Furchester Hotel ||\n|-\n| 2014 || Baby, Additional Muppets || Muppets Most Wanted\n|-\n| 2014, 2015 || Dodge T. Dog || All Over the Place ||\n|-\n| 2015 || Additional Puppeteer || Spot Bots ||\n|-\n| 2015–present || Dodge T. Dog || CBeebies || Presenting in the CBeebies House\n|-\n| 2015 || Dodge T. Dog, Oucho T. Cactus, Gordon the Gopher || Hacker's Birthday Bash: 30 Years of Children's BBC || Television special celebrating the 30th anniversary of the launch of the CBBC brand.\n|-\n| 2016 || Dodge T. Dog || All Over the Workplace ||\n|-\n| 2017–present || Gonger || Sesame Street'' ||\n|-\n| 2019 || Chamberlain Skeksis (puppetry only), \"Freckles\" the Red Haired Paladin, Male Podling Servant, Lath'n, additional characters || The Dark Crystal: Age of Resistance || Simon Pegg provided the voice of the Chamberlain Skeksis.\n|-\n| 2019 || Gonger, additional Muppets || ''Sesame Street's 50th Anniversary Celebration || A television special celebrating the 50th anniversary of Sesame Street.\n|-\n| 2020-2021 || rowspan=\"3\" | Dodge T. Dog ||  Mister Maker at Home || Appears in 2 episodes with Phil Gallagher\n|-\n| rowspan=\"2\"| 2020 || Andy and the Band: Live at Home! ||\n|-\n| Pointless Celebrities || Appeared as a contestant alongside Hacker\n|-\n|2021\n|Dodge T. Dog, Oucho T. Cactus, Gordon the Gopher, Marion\n|Children in Need\n|Puppet Aid skit, Marion voiced by Dan Tetsell\n|-\n| 2022\n| rowspan=\"2\" |Dodge T. Dog|| Andy and the Band || Appears in series 2 episode 8; BBC Shutdown\n|-\n| 2024 || Dodge's Pup School'' ||\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}