{
  "content": [
    {
      "type": "text",
      "text": "# Warren C. Dickerson\n\n| significant_buildings = Hotel del Coronado\n| significant_projects =\n| birth_date = 1853\n| birth_place = Long Island, New York, U.S.\n| death_date = Unknown\n| death_place =\n}}\nWarren C. Dickerson (1853 – unknown) was an American architect who worked in the Bronx in the early 20th century.\nWarren Dickerson was born in 1853 on Long Island, New York; he attended Cooper Union and had private tutors.  He entered into private practice on November 15, 1893, when he opened an office in New York City.  He subsequently opened practices in San Diego and San Francisco but moved back to New York in 1893.  He has been described as \"among the more prominent architects of the city\"; by 1898 his practice took in $2,500,000 ().  His work was mostly in high-end houses and apartments, with it being said that \"Probably no architect in New York has a larger practice in these lines of buildings than Mr. Dickerson.\"  Dickerson was noted by the New York City Landmarks Preservation Commission as being \"responsible for many of the finest rowhouses erected in the 1890s and the first years of the twentieth century in the Bronx.\"\nDickerson is known for having designed many of the houses in several historic districts in the borough of the Bronx in New York City.  The Longwood Historic District (on the National Register of Historic Places) includes a row of his paired Neo-Renaissance and Romanesque Revival townhouses on Beck Street.  Significant features include \"bay windows, arched windows, peaked roofs and ornamental iron gates\" with the buildings being described as \"some of the best examples of turn-of-the-20th-century architecture that transformed the Bronx into an urban extension of Manhattan.\" The Clay Avenue Historic District includes twenty-eight semi-detached houses which, like those in Longwood, featured Neo-Renaissance and Romanesque Revival features.  He also worked in what is now the Mott Haven Historic District.  In 1900, Dickerson drew up plans for eleven houses near Valentine Avenue and 181st Street; it was estimated these would sell for $3,000 () each.\nDickerson's firm also spawned other noted architects.  Frank L. Landsiedel, Dickerson's head draftsman, formed a partnership with Fred W. Moore in 1900.  Moore & Landsiedel had offices in both Manhattan and the Bronx, and was known for three apartment buildings in what is now the Morningside Heights Historic District in Manhattan.\nNotes\nReferences"
    }
  ]
}