{
  "content": [
    {
      "type": "text",
      "text": "# Warri Wolves F.C.\n\nWarri Wolves Football Club (formerly NPA) is a Nigerian football club. Formerly run by the Nigeria Port Authority, the club is based in Warri, but was based in Lagos from 2003-2007, after promotion to the Nigerian Premier League.\nHistory\nAfter making the 2001 Super Four play-offs, NPA FC was relegated by three points in the next season after winning only 10 of their 34 league games. They were promoted again in 2003 after finishing second in Division 2. NPA FC ended their 2004/05 season near the bottom of the table and it was announced that 16 of their 40 players would be laid off. The team was relegated again after the 2005–06 season, and moved back to Warri in April 2007 after a deal with the government of Delta State.\nThe team was renamed \"Warri Wolves\" at the start of the season and won promotion to the 2009 Premier League season as champions of Division 1B. Wolves finished with 59 points from 18 wins, five draws and seven losses, scoring 42 goals and conceded 16. They were involved in an incident on March 8, 2008, when a pitch invasion after a goalless draw at First Bank FC left seven players and officials injured. They played the first part of the 2008–09 season in Oleh because of renovations to the Warri Stadium.\nThey are fondly back in Warri City and now play home matches at the Warri Township Stadium.\nPerformance in CAF competitions\n*CAF Champions League: 1 appearance\n::2016&nbsp;– First Round\n*CAF Confederation Cup: 3 appearances\n::2010&nbsp;– First Round of 16\n::2012&nbsp;– Second Round\n::2014&nbsp;– Second Round\n*CAF Cup: 1 appearance\n::2002&nbsp;– First Round (as NPA)\nStaff\n* Peter Nieketien (Technical Adviser)\n* Moses Etu (chairman)\n* Azuka Chiemeka (Media Officer)\n* Onoriode Joshua Oborevwori (Chairman of Delta Sports Commission)\n* Napoleon Aluma (Head Coach)\nCoaching history\n* Maurice Cooreman (Jan 2005 – Jan 2006)\n* Solomon Ogbeide (2008–2009)\n* Paul Aigbogun (Jan 2010 – Feb 2012)\n* Maurice Cooreman (Feb 2012 – Sept 2012)\n* Edema Fuludu (2012)\n* Solomon Ogbeide (2013)\n* Paul Aigbogun (Jan 2014 – Jan 2016)\n* Sam Okpodu (Jan 2016 – Jun 2016)\n* Ard Sluis (2016)\n* Mansur Abdullahi (2016)\n* Ngozi Elechi (Aug 2019 – Sept 2019)\n* Evans Ogenyi (Sept 2019 – 2022)\n* Jolomi Atune (2022 – 2024)\n* Napoleon Aluma (2024 – present)\nReferences"
    }
  ]
}