{
  "content": [
    {
      "type": "text",
      "text": "# Warren Archibald\n\n| birth_place = Point Fortin, Trinidad and Tobago\n| height = 1.75 m\n| position = Inside left\n| currentclub =\n| youthyears1 =\n| youthclubs1 = Christian Brothers College\n| years1 = 1964–1965\n| years2 = 1966\n| years3 = 1967–1968\n| years4 = 1970–1971\n| years5 = 1972\n| years6 = 1973–1976\n| years7 = 1976\n| years8 = 1977\n| years9 = 1978\n| years10 = 1979\n| clubs1 = Shell FC\n| clubs2 = T&T All-Stars\n| clubs3 = New York Generals\n| clubs4 = Washington Darts\n| clubs5 = → Miami Gatos\n| clubs6 = → Miami Toros\n| clubs7 = Rochester Lancers\n| clubs8 = Malvern\n| clubs9 = Toronto Blizzard\n| clubs10 = K&SI Phoenix\n| caps1 =\n| caps2 =\n| caps3 = 39\n| caps4 = 43\n| caps5 = 14\n| caps6 = 60\n| caps7 = 14\n| caps8 =\n| caps9 = 0\n| caps10 =\n| goals1 =\n| goals2 =\n| goals3 = 16\n| goals4 = 14\n| goals5 = 6\n| goals6 = 21\n| goals7 = 1\n| goals8 =\n| goals9 = 0\n| goals10 =\n| nationalyears1 = 1968–1976\n| nationalteam1 = Trinidad and Tobago\n| nationalcaps1 = 15\n| nationalgoals1 = 8\n}}\nWarren \"Laga\" Archibald (born 1949) is a Trinidadian former soccer player who played as an inside left. He spent one season in the United Soccer Association and nine in the North American Soccer League, earning 1973 MVP honours.  He also played professionally in Mexico and Haiti and was a mainstay of the Trinidad and Tobago national team from 1968 to 1976.\nClub career\nArchibald attended Saint Benedict's College in Trinidad.  In 1967, he signed with the New York Generals of the National Professional Soccer League.  In 1968, the NPSL merged with the United Soccer Association to form the North American Soccer League.  The Generals folded after the 1968 NASL season.  Archibald left the NASL at this point and may have then played for San Luis F.C. in Mexico and Victory Sportif Club in Haiti before signing with the Washington Darts of the NASL in 1970. During his time with the Darts, he was selected as a second-team NASL All-Star in both 1970 and 1971.  In 1972, the Darts moved to Florida to become the Miami Gatos.  In 1973, the team was renamed the Toros. That season, Archibald was voted NASL MVP and a first- team All-Star.  He was a second-team All-Star again in 1974.  In 1976, Archibald began the season with the Toros but was traded after three games to the Rochester Lancers.  He netted only once in fourteen games in Rochester.  In April 1977, the Lancers released Archibald.\nInternational career\nArchibald was a member of the Trinidad and Tobago national team for the 1973 CONCACAF Championship to qualify for the 1974 FIFA World Cup when Trinidad and Tobago defeated Mexico by four goals to nil. The Trinidad and Tobago team had five goals controversially disallowed against Haiti and fell two points short of qualifying. He was first a regular with the Trinidad and Tobago national team from at least 17 November 1968/9 when it lost 4–0 to Guatemala in World Cup qualifying until 28 November 1976 when it tied Surinam 2–2.\nReferences\nExternal links\n* [http://nasljerseys.com/Players/A/Archibald.Warren.htm NASL stats]"
    }
  ]
}