{
  "content": [
    {
      "type": "text",
      "text": "# Warren Snowdon\n\n| birth_place         = Canberra, Australian Capital Territory, Australia\n| death_date          =\n| death_place         =\n| nationality         = Australian\n| spouse              = Elizabeth Verstappen\n| party               = Australian Labor Party\n| relations           =\n| children            = 4\n| residence           = Alice Springs\n| alma_mater          = Australian National University,University of Western Australia\n| occupation          = Politician\n| profession          = Teacher\n| religion            =\n| signature           =\n| footnotes           =\n}}\nWarren Edward Snowdon (born 20 March 1950) is an Australian former politician who served as a member of the House of Representatives from July 1987 to March 1996, and again from October 1998 until May 2022. Initially representing the Division of Northern Territory, and later the Division of Lingiari, his constituents consisted of all the residents of the Northern Territory located outside Darwin, as well as Christmas Island and the Cocos (Keeling) Islands in the Indian Ocean. He was the last sitting MP who was first elected in the 1980s, and the last who served in Old Parliament House.\nSnowdon was the Minister for Defence Science and Personnel, Minister for Veterans' Affairs, Minister for Indigenous Health, and Minister Assisting the Prime Minister on the Centenary of ANZAC in the second Rudd ministry. Snowdon is a member of the left faction of the Labor Party.\nSnowdon did not contest the 2022 federal election and retired from politics.\nEarly life and career\nSnowdon was born in Canberra and was educated at St Edmund's College, the Australian National University and the University of Western Australia.\nHe worked as a teacher with the Northern Territory teaching service before entering politics. He was a senior project officer with the Central Land Council in Alice Springs 1983–87 and was founding president of the Central Australian Regional Trades and Labour Council, then assistant secretary of the Northern Territory Trades and Labour Council.\nPolitical career\nSnowdon was Parliamentary Secretary to the Minister for Transport and Communications 1990–92, Parliamentary Secretary to the Minister for Employment, Education and Training 1992–96, Parliamentary Secretary to the Minister for Environment, Sport and Territories 1993 and 1994–96 and Parliamentary Secretary (Territories) 1993–94.\nDefeated at the 1996 federal election, Snowdon returned to parliament two years later. He served as Parliamentary Secretary to the Shadow Minister for Regional and Urban Development, Transport and Infrastructure (Northern Australia and the Territories) 2001–04. From 2004 to 2007 he was Shadow Parliamentary Secretary for Northern Australia and Indigenous Affairs.\nSnowdon was sworn in as Minister for Defence Science and Personnel in the first Rudd ministry on 3 December 2007. Following a reshuffle of the Ministry on 9 June 2009 as a result of the resignation of the Defence Minister, Joel Fitzgibbon, Snowdon was promoted to Minister for Indigenous Health, Rural and Regional Health and Regional Service Delivery. On 14 September 2010, he gained the portfolio of Veterans' Affairs and regained Defence Science and Personnel, while losing responsibility for Rural and Regional Health and Regional Service Delivery, but retaining Indigenous Health. On 12 September 2011 he was given the added responsibility of Minister Assisting the Prime Minister on the Centenary of ANZAC.\nSnowdon narrowly retained his seat at the 2013 federal election, largely due to his winning all but five booths. However, Snowdon was not appointed to the shadow ministry.\nSnowdon was re-elected in the 2016 federal election with a seven-point swing towards him, becoming the longest-serving MP in the House, and the only member who was first elected in the 1980s. Snowdon was however not the Father of the House due to his continuous service only beginning from 1998. Kevin Andrews, whose continuous service began from 1991, became Father of the House instead. Snowdon again retained his seat at the 2019 federal election.\nHe sat on the \"Inquiry into the destruction of 46,000-year-old caves at the Juukan Gorge in the Pilbara region of Western Australia\" from June 2020.\nIn reference to his service from Old Parliament House, Snowdon said:\n\"I'm a bit of a relic. I'm the only one left in this parliament - Senate or House of Reps - from the Old Parliament House.\"\nSnowdon did not contest the 2022 federal election and retired from politics.\nSee also\n* First Rudd Ministry\n* First Gillard Ministry\n* Second Gillard Ministry\n* Second Rudd Ministry\nReferences\nExternal links\n*\n}}\n|-\n|-\n}}\n|-\n|-\n|-\n|-"
    }
  ]
}