{
  "content": [
    {
      "type": "text",
      "text": "# Warren Goldfarb\n\nWarren David Goldfarb (born 1949) is Walter Beverly Pearson Professor of Modern Mathematics and Mathematical Logic, emeritus, at Harvard University. He specializes in the history of analytic philosophy and in logic, most notably the classical decision problem.\nEducation and career\nHe received his A.B. and philosophy Ph.D. from Harvard University under the supervision of Burton Dreben, and has been a member of the Harvard faculty since 1975.  He received tenure in 1982, the only philosopher to be promoted to tenure at Harvard between 1962 and 1999.\nProf. Goldfarb is also one of the founders of the Harvard Gay & Lesbian Caucus and was one of the first openly gay Harvard faculty members.\nPhilosophical work\nGoldfarb was an editor of volumes III–V of Kurt Gödel's Collected Works.  He has also published articles on important analytic philosophers, including Frege, Russell, Wittgenstein's early and later work, Carnap and Quine.\nSelected publications\nBooks\n*The Decision Problem: Solvable Classes of Quantificational Formulas, Addison-Wesley, 1979.  (with Burton Dreben).\n*Deductive Logic, Hackett, 2003.\nArticles\n*\"Logic in the Twenties: the Nature of the Quantifier,\" The Journal of Symbolic Logic (1979)\n*\"I want you to bring me a slab: Remarks on the opening sections of the Philosophical Investigations,\" Synthese (1983)\n*\"Kripke on Wittgenstein on Rules,\" The Journal of Philosophy (1985)\n*\"Poincare Against the Logicists,\" in History and Philosophy of Modern Mathematics (University of Minnesota Press, 1987)\n*\"Wittgenstein on Understanding,\" Midwest Studies in Philosophy (1992)\n*\"Frege's Conception of Logic,\" in Future Pasts:  The Analytic Tradition in the 20th Century, Juliet Floyd and Sanford Shieh, editors (Oxford University Press, 2001)\n*“Rule-Following Revisited,\" in Wittgenstein and the Philosophy of Mind, Jonathan Ellis and Daniel Guevara, editors (Oxford University Press, 2012).\n*\nReferences\nExternal links\n* [http://philosophy.fas.harvard.edu/people/warren-goldfarb Goldfarb's web page at Harvard University]\n* Works by Warren Goldfarb at [http://philpapers.org/s/Warren%20Goldfarb PhilPapers]"
    }
  ]
}