{
  "content": [
    {
      "type": "text",
      "text": "# Warren Cole (rower)\n\n| birth_place      = Palmerston North, New Zealand\n| death_date       =\n| death_place      = Hamilton, New Zealand\n| education        =\n| alma_mater       =\n| occupation       =\n| years_active     =\n| spouse           =\n| height           =\n| weight           =\n| country          = New Zealand\n| sport            = Rowing\n| club             = Whakatane Rowing Club\n| medaltemplates   =\n}}\n}}\nWarren Joseph Cole (12 September 1940 – 17 July 2019) was a New Zealand rower who won an Olympic gold medal at the 1968 Summer Olympics in Mexico City.\nCareer\nCole was born in 1940 at Palmerston North, New Zealand, and was educated at Hamilton Boys' High School. He later lived in Whakatāne, and was a member of the Whakatane Rowing Club.\nFor the 1968 Summer Olympics, New Zealand qualified an eight and had a pool of four rowers and a cox as a travelling reserve; Cole was part of this reserve. Preparations were held in Christchurch at Kerr's Reach on the Avon River. The reserve rowers were unhappy with the \"spare parts\" tag and felt that they were good enough to perhaps win a medal if put forward as a coxed four. The manager, Rusty Robertson, commented about them that they were \"the funniest looking crew you've ever seen\". There were stern discussions with the New Zealand selectors. In a training run, the coxed four was leading the eight over the whole race. In the end, the reserve rowers got their way and New Zealand entered both the coxed four and the eight. Cole won the Olympic coxed four event along with Dick Joyce, Dudley Storey, Ross Collinge and Simon Dickie (cox); this was New Zealand's first gold medal in rowing. At the time, Cole was living in Whakatane with his wife and two young children, and selling milking shed equipment. The crew's winning boat was later sold to a rowing club to recoup costs, and ended up in splinters after a road crash.\nAt the 1970 World Rowing Championships in St. Catharines in Canada, he won a bronze medal with the eight. At the 1972 Summer Olympics in Munich he competed again in the coxed four which finished sixth.\nCole worked for the National Dairy Association in marketing and sales. He later moved to Hamilton and sold equipment for the dairy industry.\nCole died in Hamilton on 17 July 2019.\nReferences\nExternal links\n*  ([https://web.archive.org/web/20190717182539/http://www.worldrowing.com/athletes/athlete/2080/ archive])\n*\n*\n*"
    }
  ]
}