{
  "content": [
    {
      "type": "text",
      "text": "# Warren Sweetser House\n\n| locmapin     = Massachusetts#USA\n| area         =\n| architect    =\n| architecture = Greek Revival\n| added        = May 26, 2005\n| mpsub        = Stoneham MRA\n| refnum       = 05000466\n}}\nThe Warren Sweetser House is a historic house at 90 Franklin Street in Stoneham, Massachusetts.  It is one of the finest Greek Revival houses in Stoneham, recognized as much for its elaborate interior detailing as it is for its exterior features.  Originally located at 434 Main Street, it was moved to its present location in 2003 after being threatened with demolition.  The house was found to be eligible for listing on the National Register of Historic Places in 1984, but was not listed due to owner objection.  In 1990 it was listed as a contributing resource to the Central Square Historic District at its old location.  It was listed on its own at its new location in 2005.\nDescription and history\nThe Sweetser House is located at the northeast corner of Franklin Street and Dale Court, a short way east of the center of Stoneham.  Franklin Street is a major east–west through street connecting Stoneham to neighboring Melrose.  The house is a -story wood-frame structure, with a front-facing gable roof and a modern concrete foundation.  Most of the house is sheathed in tongue-and-groove siding, but the front and right side portions under the porch are entirely finished in flushboarding.  The corners of the building are pilastered, with an entablature that encircles the building.  The front facade, facing south, has a single-story hip-roof porch extending across its width and around to the right, supported by Ionic columns.  The facade is four bays wide, with full-length windows on the ground floor and smaller sash windows above.  There are two sash windows in the fully pedimented gable end.  The porch on the right side ends in a projecting section that houses the main entrance and a stairwell.  Each side of the roof has a single gable-roofed dormer.\nThe interior of the house consists of a mix of Greek Revival elements overlaid by Victorian and Colonial Revival alterations, most of which date to the buildings conversion to a duplex in the 1890s.  A room divider with leaded glass was added to the downstairs (street level) great room, and spindled screens were also added to some doorways and windows but later removed.\nThe house originally stood at 434 Main Street, a short way south of Stoneham's Central Square.  It was built on that site in 1842 by Warren Sweetser, a prominent figure in the town's economic life in the 19th century.  Sweetser owned a local dry goods retail store, and served for many years as the town postmaster.  He was also involved in a small scale in the town's cottage shoemaking industry, which dominated its economy.  Because Stoneham's economy grew slowly during the time the Greek Revival was in vogue, this house is one of its few high-style houses in that style.\nAfter Warren Sweetser died in 1890, his heirs converted his house to a duplex, adding the entrance tower to the right, the dormers on the roof, and a modern service ell to the rear.  The house was sold out of the Sweetser family in 1929, and was eventually converted to commercial use, given its proximity to Central Square.  In 1999 it was purchased by a developer, who announced plans to raze the building and redevelop the site.  The town located a preservationist will to buy and move the structure, which was moved to a temporary location later that year.  It was moved to its present location in 2000, although the lot is too small to accommodate the 1890s service ell, which was demolished.\nSee also\n*Skip Sweetser\n*National Register of Historic Places listings in Stoneham, Massachusetts\n*National Register of Historic Places listings in Middlesex County, Massachusetts\nReferences"
    }
  ]
}