{
  "content": [
    {
      "type": "text",
      "text": "# Wars of the Roses (air race)\n\nThe Wars of the Roses was an air race organized by the Yorkshire Evening News between the Yorkshire-built Blackburn Type I monoplane and the Lancashire-built Avro 504 biplane which was staged around Leeds on 2 October 1913.\nThe challenge\nIn the summer of 1913 the Lancashire firm of A. V. Roe designed an advanced biplane called the Avro 504. The machine was built in secret and entered into the Aerial Derby, causing a sensation when it arrived at Hendon for the race on 20 September. Piloted by F. P. Raynham, the untried 504 finished fourth in the Derby only two days after its maiden flight.\nFollowing the Derby, Yorkshire's Blackburn Aeroplane and Motor Co. Ltd. challenged Avro to a race between the 504 and the Blackburn Type I, a monoplane which had itself only made its first flight on 14 August 1913. Avro accepted the challenge and on 29 September Raynham flew the 504 from Brooklands to Leeds in preparation for the race.\nPrelude to the race\nOn 2 October 1913, Henri Salmet displayed his Blériot XI-2, and operated passenger flights during the preparation for the race. The Avro 504 was piloted by Raynham with Avro co-founder Humphrey Verdon Roe (brother of A. V. Roe) as passenger. The Blackburn Type I was piloted by Harold Blackburn (no relation of aircraft designer Robert Blackburn) with the machine's owner, Grahame Christie, as passenger. The 100-mile course began and ended at Moortown, near Leeds, with control stations at York, Doncaster, Sheffield and Barnsley, at which points the competitors were required to land for 20 minutes. A crowd estimated at 20,000 gathered at Moortown, where both machines made trial flights. There was little wind but mist set in during the course of the race.\nThe race\nThe two contestants took off side by side at 2:14 with the Avro 504 gaining an immediate height advantage. Raynham was first to reach the York control at Bootham Stray, landing at 2:38, with Blackburn one minute behind. Blackburn's departure from York was delayed when a terrier got between the wheels of the monoplane, costing the Yorkshire team a further 10 seconds. However Blackburn recovered to land at the Doncaster control at 3:33, three seconds ahead of Raynham.\nBlackburn was again first to land at the Sheffield control, arriving at 4:19, but Raynham landed in the wrong field. By the time the Lancashire team reached the Sheffield control they were four minutes in arrears. Blackburn however was three minutes late taking off from Sheffield, cutting his advantage to one minute as they headed for Barnsley.\nBlackburn landed at Barnsley at 4:55 but, in deteriorating conditions, the Avro crew flew past the control and came down at Dewsbury. Conceding the race, Raynham returned to Leeds, arriving ahead of Blackburn who completed the race at 5:48. The Yorkshire crew received a great ovation and Harold Blackburn was carried shoulder-high from his machine by the partisan crowd.\nSpeaking after the race, Roe stated that up to Sheffield the two machines “kept pretty well together” while Harold Blackburn admitted they had a geographical advantage over their Lancashire rivals. The silver trophy donated by the Yorkshire Evening News was presented to Dr. Christie who in turn awarded it to Harold Blackburn.\nPostscript\nA return match in Lancashire was mooted for later in October 1913 with further plans for making the Wars of the Roses air race an annual event. Neither of these came to fruition.\nReferences\n*\n*\n*  }}"
    }
  ]
}