{
  "content": [
    {
      "type": "text",
      "text": "# Warsztaty Szybowcowe SG-21 Lwów\n\nThe D.W.L. SG-21 Lwów  was a Polish high performance sailplane built for the Polish government. Though both it and a development, the SG-28, were one-offs, they set several national records and led to the batch-produced Warsztaty Szybowcowe SG-3.\nDesign and development\nAlong with the Czerwiński CW 5 bis the Lwów was he result of a Ministry of Transport call for a high performance competition sailplane. It was designed by Szczepan Grzesczyk and its construction by DWL at Okęcie began in July 1931. The Lwów made its first flight, piloted by Grzesczyk, on 16 October 1931, well before its rival.\nIt was an all-wood, single-seat, high wing aircraft. Its wing was in two parts, rectangular in span inboard but trapezoidal over most of the span. Each part was built around a single spar with plywood covering from it forwards around the leading edge forming a torsion-resistant D-box. Behind the spar the wings were fabric-covered. They were connected together centrally on a streamlined fuselage pylon. The ailerons, also fabric-covered, operated differentially.\nThe Lwów's fuselage was a semi-monococque ply shell of oval cross-section with its open cockpit was ahead of the wing-pylon. Aft of the pylon the fuselage became slimmer back to a tall, ply-covered fin, integral with the fuselage and carrying broad, mostly fabric-covered balanced rudder. There was no tailplane as the narrow, tapered elevator was of the all-flying type. It was mounted on top of the fuselage and forward of the rudder.\nLanding gear was a rubber-sprung skid and small tailskid.\nThough only one SG-21 was built its distinguished career, described below,  prompted a development, the SG-28, built by P.Z.L. The chief improvements were in the wing, with a span increased to , a higher aspect ratio of 17.6 and an aerofoil section which varied over the span. The fuselage was cleaned up, the cockpit provided with a detachable enclosure, initially ply-framed then a tubular structure with windows, and pneumatic shock-absorbers replaced the rubber springs of the landing skid. As a result of these changes the SG-28 had an improved glide ratio (22.5) and lower sink rate ).\nOperational history\nOn the day after its first flight on 16 October 1931, the SG-21 made the first cross-country towed flight in Poland, leaving Okęcie to reach Bezmiechowa, a well-known glider centre  away. Grzeszczyk piloted the glider behind a RWD 4 flown by Drezwwiecki. On 19 October Grzeszczyk set a new Polish national endurance record of 7 h 52 m 45 s. A number of other national records were set in the next three years: on 7 August 1932 Bolesław Łopatniuk made the first true cross-country flight in Poland, setting a new distance record of , and on 1 September 1934 Michał Offierski greatly extended this to  and set a new altitude record at  on the same flight. On 5 October 1934 Masria Younga set a record altitude for women at .\nThe SG-21 also took part in the February 1933 First Course of Towing Flights.\nThe SG-28 was flight tested in the summer of 1932. Its outstanding flight was made the following year when on 21 June Bolesław Baranowski set two national records on one flight which lasted for 10 h 40 m and reached , though this altitude was surpassed by Offierski's later flight.\nThe two gliders flew on into the mid-1930s. Though only one of each type was built, they provided Grzeszczyk with experience that was incorporated into the design of the batch-built Warsztaty Szybowcowe SG-3  which became Poland's most popular and successful high performance sailplane in the mid-1930s.\nVariants\n;SG-21 Lwów: One only, as described\n;SG-28: Revised design with new, longer span wing of varying section and aerodynamically cleaned-up fuselage with enclosed cockpit. One only.\nSpecifications (SG-21)\n|lift to drag=\n|sink rate ms=0.7\n|sink rate ftmin=\n|sink rate note= minimum at\n|wing loading kg/m2=\n|wing loading lb/sqft=\n|wing loading note=\n|more performance=\n*Minimum speed:\n}}\nReferences\n}}\nExternal links\n* [http://www.samolotypolskie.pl/samoloty/1139/126/SG-28 samolotypolskie.pl]\n* [https://www.j2mcl-planeurs.net/dbj2mcl/planeurs-machines/planeur-fiche_0int.php?code=1320 j2mcl-planeurs.net]"
    }
  ]
}