{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw Downtown County\n\nWarsaw County\n|s1          = Warsaw County (1867–1952)Warsaw County\n|s2          = Warsaw\n|s3          =\n|s4          =\n|image_flag  =\n|flag        =\n|image_coat  =\n|symbol_type =\n|image_map   = POL powiat śródmiejsko-warszawski map.svg\n|image_map_caption = Location within Warsaw in 1931.\n|capital      = Warsaw\n|government_type = County\n|title_leader =\n|leader1      =\n|year_leader1 =\n|leader2      =\n|year_leader2 =\n|leader3      =\n|year_leader3 =\n|leader4      =\n|year_leader4 =\n|legislature  =\n|stat_year1        = 1931\n|stat_area1        =\n|stat_pop1         = 218 100\n|stat_year2        = 1939\n|stat_area2        = 10\n|stat_pop2         =\n|stat_year3        = 1946\n|stat_area3        =\n|stat_pop3         = 58 719\n|stat_year4        = 1947\n|stat_area4        = 21.03\n|stat_pop4         =\n|membership_title1 = Country\n|membership1       = Second Polish Republic (1928–1939)Provisional Government of the Republic of Poland (1944–1945)Provisional Government of National Unity (1945–1947)Polish People's Republic (1947–1960)\n|membership_title2 = Voivodeship\n|membership2 = Capital City of Warsaw (1928–1939)Warsaw (1944–1960)\n}}\nThe Warsaw Downtown County was a county within the city of Warsaw. It existed from 1931 to 1939, and from 1944 to 1960, as a county of Warsaw, that functioned as the voivodeship. From 1931 to 1939, it was under the administration of the Second Polish Republic, from 1944 to 1945, under the Provisional Government of the Republic of Poland, from 1945 to 1947, under the Provisional Government of National Unity, and from 1947 to 1960, under the Polish People's Republic.\nHistory\nIt was established on 1 April 1931, from the parts of the counties of North Warsaw, and South Warsaw. It was one of the counties of the Capital City of Warsaw, a voivodeship of the Second Polish Republic. It ceased to exist in 1939, following the Invasion of Poland by Nazi Germany, and subsequent occupation of the county. As such, it was incorporated into then established Warsaw County. In 1931, it had 218 100 inhabitants, and in 1939, it had an area of 10&nbsp;km2.\nIt was reestablished in 1944, from the part of the Warsaw County, as one of the counties of the Warsaw, that functioned as the separate voivodeship. From 1944 to 1945, it was within the territory under the administration of the Provisional Government of the Republic of Poland, which then was replaced by the Provisional Government of National Unity. In 1947, the government had been replaced by the Polish People's Republic.  The county existed until 1960, when the counties were replaced by the city districts. In 1946 it had 137 536 inhabitants, and in 1947 it had an area of 21.03&nbsp;km2.\nCitations\nNotes\nReferences"
    }
  ]
}