{
  "content": [
    {
      "type": "text",
      "text": "# Warsteiner\n\nin 2015\n| active_beers   =\n| seasonal_beers =\n| other_beers    =\n|key_people=Eva-Catharina Cramer (CEO)}}\nWarsteiner brewery\nWarsteiner hot air balloon manufactured by [[Ultramagic]]\nWarsteiner () beer is brewed in the Arnsberg Forest Nature Park outside of Warstein, North Rhine-Westphalia, Germany.  Warsteiner has been owned by the Cramer family since 1753. Warsteiner is Germany's largest privately owned brewery; its best selling beer is Warsteiner Premium Verum.\nWarsteiner ranks fifth among Germany's best selling breweries.\nHistory\nAccording to Inc Magazine, \"In 1753, the farmer Antonius Cramer from the town of Warstein, Germany [laid] the foundation for a German beer dynasty.\"\nThe earliest mention of the brewing company is a tax record from 1753, when Antonius Cramer paid 1 thaler, 19 guilders on beer he brewed and sold himself.\nHis son Johannes Vitus followed in his footsteps and brought the selling of home-brewed beer into his house, in the heart of Warstein. His company benefited from its central location. However, in 1802 a devastating fire left Warstein in ruins and ashes - the business of the Cramers fell victim to the flames.\nAt the same time, they rebuilt their house as a guest accommodation and became through the establishment of the St. Pancras Church the centre of the town.\nThe headquarters of the Warsteiner Brewery, the Domschänke, still stands today in the historic core of Warstein.\nBreweries in the Rhine valley were bombed during World War II, and the Warstein brewery sustained some damage.\nBeers\nAll beers are brewed in strict accordance with the Bavarian Purity Law of 1516.\nWarsteiner Premium Verum\nPremium Verum, a pilsener style beer, is Warsteiner's flagship beer, and is exported to over 60 countries. The alcohol content is 4.8%.\nWarsteiner Premium Dunkel\nPremium Dunkel is Warsteiner's second most popular beer. Dunkel is a traditional style, dark beer with an alcohol content of 4.8%.\nWarsteiner Premium Fresh\nWarsteiner's only non-alcoholic beer, brewed exactly like the Premium Verum and then having the alcohol extracted.  The beer contains 80 calories per 12 oz. bottle.\nKönig Ludwig Weissbier - Royal Bavarian Hefeweizen\nRoyal Bavarian is a golden hefeweizen style beer. It is brewed with natural yeast and Bavarian ingredients, and has an alcohol content of 5.5%.\nExport and licensing\nWarsteiner has been exporting its beers internationally since the 1980s. Furthermore, Warsteiner founded and acquired shares in other international breweries like Isenbeck brewery in Argentina and breweries in Africa.\nAll North American Warsteiner products are brewed, bottled, kegged and canned at the brewery in Warstein, Germany.\nIn some international markets, Warsteiner and Koenig Ludwig beers are license brewed by Mahou-San Miguel Group.\nIn the UK the beer is imported by James Clay & Sons.\nSee also\n* List of brewing companies in Germany\nReferences\nExternal links\n*[http://www.warsteiner.com Warsteiner International]\n*[http://www.warsteiner-usa.com Warsteiner USA]"
    }
  ]
}