{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw Babice Airport\n\n| nativename-a =\n| nativename-r =\n| image        = LotniskoBabice.jpg\n| image-width  =\n| image_alt    =\n| caption      = Aerial view of the airport to the southwest. The photo draws attention to Powstańców Śląskich Street which is a street on the path of the former second runway. The paved runway 10R/28L in use is only a part of its former length.\n| image2       =\n| image2-width =\n| image2_alt   =\n| caption2     =\n| IATA         = QPB\n| ICAO         = EPBC\n| FAA          =\n| TC           =\n| LID          =\n| GPS          =\n| WMO          =\n| type         = Civil, sports, Interior Ministry\n| owner-oper   =\n| owner        =\n| operator     =\n| city-served  = Warsaw\n| location     = Warsaw\n| opened       =\n| closed       =\n| passenger_services_ceased =\n| hub          =\n| focus_city   =\n| built        =\n| used         =\n| commander    =\n| occupants    =\n| timezone     = UTC +1\n| utc          =\n| summer       =\n| utcs         =\n| elevation-m  = 106.1\n| metric-elev  =\n| coordinates  =\n| website                = [http://www.lotnisko-babice.pl/index_en.html Official site's English page]\n| image_map              =\n| image_mapsize          =\n| image_map_alt          =\n| image_map_caption      =\n| pushpin_map            =\n| pushpin_mapsize        =\n| pushpin_map_alt        =\n| pushpin_map_caption    =\n| pushpin_relief         =\n| pushpin_image          =\n| pushpin_label          =\n| pushpin_label_position =\n| pushpin_mark           =\n| pushpin_marksize       =\n| r1-number    = 10R/28L\n| r1-length-f  =\n| r1-length-m  = 1300 x 90&nbsp;m\n| r1-surface   = Concrete\n| r2-number    = 10L/28R\n| r2-length-f  =\n| r2-length-m  = 1000 x 150&nbsp;m\n| r2-surface   = Grass\n| metric-rwy   =\n| h1-number    =\n| h1-length-f  =\n| h1-length-m  =\n| h1-surface   =\n| stat1-header =\n| stat1-data   =\n| stat-year    =\n| footnotes    =\n}}\nYak-40 now used for training by the Military University of Technology in Warsaw]]\nWarsaw-Babice  is an airport in Warsaw, located in the residential district of Bemowo, near the border with the district of Bielany. It is also unofficially known as Bemowo.\nThe airport is administered by the Centre for Logistics \"Warsaw-Babice\" (Centrum Usług Logistycznych \"Lotnisko Warszawa-Babice\") and organisations based there include: the Warsaw Aero Club (Aeroklub Warszawski) and Polish Air Rescue (Lotnicze Pogotowie Ratunkowe).\nIt has been used for various events and celebrity arrivals including Michael Jackson (1996), Madonna (2009), AC/DC (2010), and the Sonisphere Festival (2010, 2011, 2012).\nInfrastructure\nThe airport has a concrete runway 10R/28L, measuring 1,300&nbsp;m x 90&nbsp;m, and, parallel to it, a grass runway 10L/28R, measuring 1,000&nbsp;m x 150&nbsp;m.\nThe airport was established at the former military airport in Bemowo. It had two concrete runways 5/23 measuring 2,000&nbsp;m x 80&nbsp;m and 10R/28L measuring 2,500&nbsp;m x 90&nbsp;m. One of the former runways was used as an extension to the residential Powstańców Śląskich Street. Only part of the second, longer runway was used for the new airport.\nRadio frequencies\n* 119.180&nbsp;MHz - Babice Informacja (Babice Information for English speakers)\n* 126.555&nbsp;MHz - Babice Radio for glider flights\nHistory\nThe site of the current airport was used as a landing strip for Russian and German airplanes. In 1918, it was one of the bases for the Research Institute of Aviation Technology (Instytutu Badań Techniki Lotniczej - IBTL) which then changed into the Technical Institute of Aviation (Instytut Techniczny Lotnictwa - ITL).\nThe airport was reestablished after World War II, at \"Szwedzkie Górki\" (Swedish Hills) between Fort P (part of the Warsaw Fortress) and Boernerowo outside Warsaw (during this period, it was in the municipality of Gmina Blizne based in Old Babice, hence the name of the airport).\nIn 1959, a Boeing 707 transporting U.S. Vice-President Richard Nixon, used the airport.\nSinger Michael Jackson performed at Bemowo on 20 September 1996 during his HIStory World Tour in front of 120,000 people.\nDue to the heavy urbanization around the airport, to ensure safety and to ease the burden of airport operations for locals, a custom procedure (the only one of its kind in Poland) to circulate traffic was introduced, which caused controversy among pilots and instructors. There still is a conflict between the airport and local residents.\nBibliography\n* [http://ais.pansa.pl/aip/ AIP Polska]  (registration required)"
    }
  ]
}