{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw–Kunowice railway\n\n| close         =\n| owner         =\n| operator      =\n| character     =\n| depot         =\n| stock         =\n| linelength_km = 475\n| linelength_mi =\n| linelength    =\n| tracklength_km=\n| tracklength_mi=\n| tracklength   =\n| tracks =\n| gauge         =\n| old_gauge =\n| load_gauge =\n| minradius     =\n| racksystem    =\n| routenumber   = 3\n| linenumber    =\n| electrification = 3000 V DC\n| speed_km/h    = 160\n| speed_mph     =\n| speed         =\n| elevation_m   =\n| elevation_ft  =\n| elevation     =\n| website       =\n| map           =\n| map_state     = collapsed\n}}\nThe Warsaw–Kunowice railway is a 475-kilometer long railway line in Poland connecting Warsaw, Poznań through Łowicz, Kutno and further to the Polish-German border at Frankfurt an der Oder.\nThe line is one of the longest and most important routes in Poland and is part of the European E20 (Berlin – Moscow) route.\nHistory\nThe present day line consists of parts of different railways constructed during the 19th century when Poland was divided between the Russian Empire, Prussia and Austria.\nThe first calls for a railway between Poznań, which at the time as the capital of the Prussian controlled Grand Duchy of Poznań, and Frankfurt (Oder) were made in 1842 when an appeal was made to landowners along the route. However, the line did not come to fruition, due to the deposition of a decision on the matter by the government of Prussia. Eventually the line was built in stages from 1870 by the Margraviate-Poznań Railway company under concession from the Prussian government.\nIn 1862 the Warsaw-Bydgoszcz Railway was opened running from Łowicz in the Russian controlled Congress Poland, where it connected with a branch line of the Warsaw–Vienna railway, through Kutno, Aleksandrów Kujawski on the Russian-Prussian border, to Prussian controlled Toruń and Bydgoszcz. This line created a connection between Warsaw and Poznań through Toruń on the present day PKP line 353.\nBetween 1900 and 1902 the Russian broad gauge Warsaw–Kalisz Railway was built connecting Warsaw through Łowicz with Kalisz near the Prussian border and in 1906 extended with a dual-gauge segment to Prussian controlled Ostrów Wielkopolski through which a standard gauge line ran to Poznań.\nAfter Poland regained independence in 1918 in the aftermath of World War I the Warsaw-Kalisz Railway was rebuilt to standard gauge and in 1921 the first new line built in Poland was a missing link from Kutno through Konin to Strzałkowo from where a local line reached Poznań, significantly improving the connection between Warsaw and Poznań.\nBetween 1925 and 1930 the course of the section Chlastawa – Dąbrówka Zbąska changed in connection with the construction of the station in Zbąszynek. The original section of the line, built in 1870, remained active until the reconstruction of the Zbąszynek–Gorzów Wielkopolski railway as a temporary course of the line to Gorzów Wielkopolski. In Poznan and Września the course of the line has also been changed over the years.\nRoute\nThe town of Września has a bypass which is used by express trains, with a number of services leaving the line to serve the station in Września and rejoin the main line again afterwards.\nModernization\nBetween 1998 and 2007 the route underwent considerable modernization because of its importance as part of route E20. The work made it possible for passenger trains to travel at 160&nbsp;km/h, freight trains at 120&nbsp;km/h. This involved improving the track, catenary, stations, level crossings and signalling.\nUsage\nThe line sees trains of all categories (EuroCity, EuroNight, Express InterCity, Intercity, TLK and regional services).\n*EuroCity services from Warsaw to Berlin and Gdansk to Berlin\n*EuroNight services from Moscow to Paris and from Warsaw to Cologne\n*Express Intercity, Intercity and TLK services along the route between Warsaw and Zbąszynek\n*Regional services\n**Polregio between Łowicz and Kutno, between Poznań and Zbąszynek, between Zbąszynek and Rzepin and between Rzepin and Frankfurt (Oder)\n**Koleje Mazowieckie between Warsaw and Kutno\n**Koleje Wielkopolskie between Kutno, Poznań and Zbąszynek\nSee also\n* Railway lines of Poland\nReferences\nExternal links"
    }
  ]
}