{
  "content": [
    {
      "type": "text",
      "text": "# Wars of Liège__disambig_1\n\nThe Wars of Liège were a series of three rebellions by the Prince-Bishopric of Liège, in the town of Liège in modern-day Belgium, against the expanding Burgundian State between 1465 and 1468. On each occasion, the rebels were defeated by Burgundian forces commanded by Charles the Bold and the city was twice burned to the ground.\nCauses\n, dating to 1465.]]\nPhilip the Good, Duke of Burgundy had become ruler of large parts of the Low Countries in the first half of the 15th century, to that extent that these were now called the Burgundian Netherlands.\nIn 1456, Philip tried to expand his influence to the Prince-Bishopric of Liège. Through his excellent relations with Pope Callixtus III, he had Prince-Bishop John of Heinsberg deposed, and replaced by his 18-year-old nephew Louis de Bourbon. De Bourbon continued his studies at the University of Leuven for 7 more years, while Philip ruled de facto over Liège.\nWars\nFirst Liège war (1465)\nIn the meantime, the resistance to the Burgundians in the Prince-Bishopric grew. The leader was Raes van Heers, bailiff of Heers. He contacted King Louis XI of France, who pledged his support. When Louis de Bourbon finally took up his functions in the Prince-Bishopric in 1465, he was immediately deposed by the States of Liège. Raes van Heers was unable to control the rebellious populace, which plundered Lands of Overmaas which belonged to the Duke of Burgundy.\nPhilip the Good sent an army, under command of his son Charles the Bold, to Liège to restore his authority. Raes van Heers assembled an army of 4,000 men, mostly civilians and confronted Charles the Bold at the Battle of Montenaken on 20 October 1465. The battle was a clear victory for the Burgundians. Burgundian forces went on to occupy Sint-Truiden, where the Peace of Sint-Truiden was signed. Under the terms of the agreement, Liège lost all its rights and Louis of Bourbon was reinstated as Prince-Bishop.\nSecond Liège war (1467)\nThe unrest in Liège did not abate. In 1466, the city of Dinant, to the south-west, rebelled and Philip the Good again sent troops, commanded by Charles the Bold, who punished the city by casting 800 burghers into the river Meuse and burnt the city.\nWhen Philip died in 1467, unrest broke out in the city of Liège and Louis of Bourbon was forced to flee to Huy, to the west. Even there, his position was not secure and he was forced to flee the Prince-Bishopric together with all the Burgundians. Again, Raes van Heers and Count Jan de Wilde of Kessenich raised an army to confront Charles the Bold. The reinforcements promised by Louis XI of France again didn't materialise, and the troops of Liège were decisively defeated in the Battle of Brustem on 28 October 1467.\nAfter the battle, Charles moved on Liège and forced the city to surrender on 12 November. The Prince-Bishopric became a Burgundian protectorate under Guy of Humbercourt, and all cities in the County of Loon were forced to tear down their defences.\nThird Liège war (1468)\n(1842)]]\nStill, the people of Liège refused to accept Burgundian rule. In October 1468, 240 rebels, under Jean de Wilde, Vincent de Bueren, and Gosuin de Streel, invaded the city. In the confusion, Guy of Humbercourt and the entire Burgundian garrison fled. Liège was free again and Jean de Wilde occupied the Prince-Bishops' palace.\nOne night, a Liège militia attacked Tongeren and killed all Burgundians there. After this, Jean de Wilde opened negotiations with Guy of Humbercourt. But Charles the Bold had other plans: he led an army towards Liège to deal once and for all with the rebellious city. He was accompanied by Louis XI of France. Several cities on their path were plundered, including Tongeren.\nOn 22 October, a 500-strong militia that tried to stop the Burgundians at the village of Lantin were driven into the church and burned alive.\nVincent de Bueren organised the defence of the city of Liège and achieved some successes with hit-and-run sorties. Jean de Wilde was mortally wounded during the raid of 26 October and died two days later. Best known is the attack by the six hundred Franchimontois in the night of 29–30 October, who sneaked out of the city and attacked the sleeping Burgundians, with the aim of killing the Duke and the King. The plan failed and all 600, including Vincent de Bueren and Gosuin de Streel, were killed.\nThe next day, Liège surrendered, and at the command of Charles the Bold, hundreds of Liègois were tied together and thrown into the Meuse river. The city was set alight and is said to have burned for seven weeks.\nEnd of Burgundian rule\n, the symbol of local autonomy, in 1478 after the end of Burgundian rule.]]\nIn 1477, Charles the Bold was killed in the Battle of Nancy and was succeeded by his only heir, his nineteen-year-old daughter Mary of Burgundy. Mary was immediately attacked by France and turned for help to the States-General of the Netherlands. The help was given, but Mary had to concede the Great Privilege, abandoning the centralized policies of her father and grandfather. Liège also benefited from this, and Mary renounced her rights to the Prince-Bishopric on 19 March 1477.\nLouis of Bourbon remained Prince-Bishop until he was murdered on 30 August 1482 by William de La Marck, who was supported by Louis XI of France.\nLegacy\nThe Wars of Liège were re-worked in later historiography to reflect a struggle for local freedoms and autonomy, reflected in the Perron of Liège and its inclusion into the coat of arms of the town.\nThe failed attack of the 600 Franchimontois was later mythologized and celebrated as an example of Walloon heroism, equivalent to the Flemish defeat of the Kingdom of France at the Battle of the Golden Spurs in 1302.\nSee also\n*Couque de Dinant – a biscuit said to have originated in the 1466 sacking of Dinant.\nReferences\nBibliography\n*\nExternal links\n*[http://www.zum.de/whkmla/military/15cen/liege1468.html WHKLMLA: Burgundian War on the Princebishopric of Liege, 1465–1468]\n*[http://www.vilters-vanhemel.be/jean_de_wilde.html Jean de Wilde (in Dutch)]\n*[https://www.vertetente.be La compagnie de la Verte Tente (in French) go to archives > Les batailles du XVe siècle]"
    }
  ]
}