{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw Conference of 1850\n\n}}\nThe Warsaw Conference of 1850 was a conference attended by representatives of the Kingdom of Prussia, the Austrian Empire and the Russian Empire on 28 October 1850, in Warsaw, Congress Poland. The aims of the conference were to re-establish order in the German states following the revolutions of 1848, and also to prevent war between Austria and Prussia over the so-called Hessian Question. The conference resulted in Russian support for Austria as well as the restoration of the German Confederation.\nBackground\nIn 1848 the Elector of Hesse, Frederick William, granted his subjects a constitution in order to prevent open revolt. After the failure of the German National Assembly to create a united German state, the nationalist and revolutionary movement lost momentum, thus resulting in many German Princes retracting their liberal constitutions. The Electorate of Hesse was no exception.\nIn 1850, Frederick William summoned the reactionary Hans Daniel Hassenpflug to be his head of government. Hassenpflug soon threw himself into the struggle against the constitution, leading to him becoming highly unpopular amongst all classes within the electorate. Eventually the constitution was retracted, leading to the resignation of the army, and subsequently forcing Frederick William and his government to flee the capital of Kassel when the people rose up to restore the liberal constitution.\nBy virtue of the Treaty of Vienna, Frederick William called for the German Diet to restore order in his states. However, the call subsequently gave rise to a split between Austria and Prussia over the Hessian Question.\nOn the one hand, Prussia refused to even acknowledge the existence of the Diet and stated that it had abdicated its function in 1848 when the Frankfurt Parliament was established to replace it. Subsequently, Prussia declared that it would resist the self-styled Diet by arms if it marched troops into the Electorate of Hesse.\nConversely, Austria upheld the existence of the Diet, of which it held the presidency and was supported by Bavaria, Württemberg, Saxony, Baden and several other small German states. The Kingdom of Hanover was somewhat on the fence over the issue, but most other northern German states supported Prussia.\nAt a conference held at Bregenz on 12 October 1850, the Emperor of Austria and the Kings of Saxony, Württemberg and Bavaria resolved to comply with the requests of the Elector of Hesse and advance federal troops into the electorate. Both sides then immediately began to amass their forces in preparation for a large scale war, with Prussia sending troops to the Electorate of Hesse with the orders to shoot upon Federal troops should they attempt an invasion.\nWar seemed inevitable when Nicholas I of Russia, offered to be a mediator in the dispute, which subsequently led to the conference held at Warsaw.\nWarsaw Conference\nAt the conference, Prussia was aware that Russia would likely support Austria, which had a more conservative nature and had recently allied with Russia to crush the Revolutions of 1848. Unable to resist the combined might of Austria and Russia, Prussia stepped down and allowed the intervention of the Diet in those states that recognised it. Subsequently, the Russian Tsar gave only his \"moral\" support to Austria.\nThe very next day, a combined force of 12,000 Austrian and Bavarian soldiers entered the electorate at Hanau, accompanied by a Federal Commissary, the Count of Rechberg. The electorate was declared under martial law, the citizens called upon to deliver up their arms; and a harsh proclamation issued by Count Rechberg, in the name of the Diet, accompanied by another from the elector to his \"faithful and loyal subjects\", called upon them to submit to Federal forces. Control of the Electorate of Hesse was quickly restored, and war between Austria and Prussia was successfully averted.\nA month later Prussia signed the Punctation of Olmütz, rejoining the German Confederation and accepting Austria's leadership of that body.\nSources\n*"
    }
  ]
}