{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw Half Marathon\n\n| location      = Warsaw, Masovian Voivodeship, Poland\n| type          = Road\n| iaaf_category =\n| distance      = Half marathon\n| sponsor       =\n| beneficiary   =\n| est           =\n| record        =\n| homepage      = https://polmaratonwarszawski.com/\n| participants  =\n}}\nRunners during the 2010 race\nThe Warsaw Half Marathon (}}) is an annual road-based half marathon hosted by Warsaw, Poland, since 2006.  The marathon is a World Athletics Label Road Race and a member of the Association of International Marathons and Distance Races.  A 5K race is also held on the same day, before the half marathon.\nThe half marathon is the second-largest footrace in Poland by number of finishers, after the Polish Independence Run in Warsaw.  The one in Warsaw alone has more finishers than the Warsaw Half Marathon.}}\nHistory\nThe inaugural event was held on .  Nearly 1,100 people took part in the half marathon, which was won by Kenyan runner Michael Karonei and Polish runner Małgorzata Jamróz, with finish times of 1:04:12 and 1:14:47, respectively.\nCourse\n}}\nThe half marathon runs on a point-to-point course that begins and ends outside Stadion Narodowy.  The course starts at the eastern end of Poniatowski Bridge south of the stadium, and ends near the Warszawa Stadion railway station north of the stadium.\nRunners first head west to cross the bridge over the Vistula River.  The course then heads north, past Castle Square, up to the northern border of the neighbourhood of Marymont, around where the halfway point is crossed.  Runners then head back south and pass the Warsaw Citadel before crossing the Vistula again, at Gdańsk Bridge.  The course then continues south, passing the Warsaw Zoo before finishing outside the stadium.\nSee also\n* Warsaw Marathon\n* Warsaw Marathon (Orlen)\nNotes\nReferences\n}}\nExternal links\n* [https://www.polmaratonwarszawski.pl Official site]"
    }
  ]
}