{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw Security Forum\n\nThe Warsaw Security Forum (WSF) (Polish: Warszawskie Forum Bezpieczeństwa) is one of Europe’s top security conferences, dedicated to strengthening transatlantic cooperation and addressing the security and defense challenges of Central and Easter Europe (CEE). Held annually in Warsaw, Poland, the two-day event gathers 1,500 leading government, industry, and civil society representatives from more than 90 countries. It serves as a key platform for discussions on foreign affairs, defense policy, and security---not only military but also business and energy strategy. Through high-level bilateral meetings and Chatham House Rule-based roundtables, the Forum fosters collaboration among politicians, experts, and business leaders to develop joint security strategies and address global challenges in an increasingly interconnected world.\nFounded in 2014 by Zbigniew Pisarski, president of the Casimir Pulaski Foundation, the Forum is chaired by prof. Katarzyna Pisarska. It maintains strategic partnerships with NATO, Poland’s National Security Bureau, and the President of the Republic of Poland. Since 2020, it has been co-organized with the German Marshall Fund of the United States.\nIn 2020, despite the challenges posed by the COVID-19 pandemic, the Warsaw Security Forum maintained its continuity in a hybrid format, effectively combining virtual and in-person events.\nInternational Advisory Council\nThe WSF International Advisory Council is a group of prominent security and foreign experts, providing strategic advice and guidance to the Forum. Notable members of the Advisory Board include:\n* Baroness Catherine Ashton, UK\n* Jacek Czaputowicz, Minister of Foreign Affairs (2018–2020), Poland\n* Gen. (R) Sir Mark Carleton-Smith, Chief of the General Staff (2018–2022), UK\n* LTG (R) Ben Hodges, NATO Senior Mentor for Logistics and Former Commander, US Army Europe\n* Hanna Hopko, Co-Founder, International Center for Ukrainian Victory, Ukraine\n* Linas Linkevičius, Ambassador of Lithuania to Sweden, Minister of Foreign Affairs (2012–2020) Minister of National Defense (1993–1996, 2000-2004), Lithuania\n* General (R) David H. Petraeus, Director of the Central Intelligence Agency, (2011–2012), Commander of the International Security Assistance Force (2010-2011), Commander of US Central Command (2008–2010), USA\n* Norbert Röttgen, Member of the Bundestag, Germany\nKnight of Freedom Award\nSince 2006, as part of the Warsaw Security Forum, the Casimir Pulaski Foundation has annually presented the “Knight of Freedom Award.” This prestigious award — a handmade replica of Casimir Pulaski’s sabre — is given to individuals and institutions that have advanced the values of General Pulaski, such as freedom, justice, and democracy. Among the more recent recipients include Adm. Rob Bauer, Chair of NATO’s Military Committee; Olena Zelenska, First Lady of Ukraine; the late opposition leader Alexei Navalny; and Thorbjørn Jagland, Secretary General of the Council of Europe.\nPartners\nThe Warsaw Security Forum is supported by a broad network of Polish and international partners, encompassing state entities, non-governmental organizations, media outlets, private sector companies, and annually designated partner countries for its cultural program.\nThe partners include, but are not limited to:\n* NATO, National Security Bureau (Strategic Partners)\n* European Commission (Institutional Partner)\n* Google (Strategic Resilience Partner)\n* Accenture (Founding Industrial Club Partner)\n* Orlen (Supporting Energy Partner)\n* European Council of Foreign Relations, Munich Security Conference (Program Partner)\n* TVN24, TVN24BiS (Main Media Partners)\n* TVP World, Rzeczpospolita, Onet, Polskie Radio (General Media Partners)\nReferences"
    }
  ]
}