{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw Institute\n\n|leader_title=President\n|leader_name=Krzysztof Kamiński\n|registration_id=0000527487\n|website=\n}}\nThe Warsaw Institute is a Polish nonprofit think tank specializing in geopolitics and international affairs. Founded in 2014, the institute's primary goal is to strengthen the relationship between the United States and Poland. Topics of interest include national security, energy, history, culture, as well as other issues which are seen as being of strategic importance to Poland along with Central and Eastern Europe.\nThe Warsaw Institute supports policy making decisions by publishing analysis and making practical recommendations. The analysis serves governmental organizations and agencies, NGOs, research institutes, academic society, the media and experts. In addition to publishing, the Warsaw Institute organizes and participates in international conferences, meetings and seminars in Poland and abroad. The Warsaw Institute has participated in joint projects with Heritage Foundation, Századvég Foundation, European Values and SNSPA. Warsaw Institute supports the Three Seas Initiative and transatlantic relations.\nThe Warsaw Institute is an independent, non-profit, nonpartisan organization supported by contributions from individuals.\nMission\nThe main goals are:\n* strengthening the position of the Polish state by preparing and providing its partners with analyses and studies concerning economic policy, international relations, security policy, as well as the use of soft power.\n* supporting the international cooperation of states, societies and NGOs,\n* supporting the development of democracy, the economy and entrepreneurship,\n* strengthening the energy security and military security,\n* cultivating and promoting Poland's national and state traditions while developing national, civic and cultural awareness.\nThe Warsaw Institute Review\nThe Warsaw Institute is the publisher of \"The Warsaw Institute Review\" quarterly (ISSN 2543-9839). It presents a broad spectrum of topics concerning Poland, among the most populous East-Central European states, in the form of analytical articles on political, legal, economic, social, historical and institutional issues. The authors of the articles in The Warsaw Institute Review are, on the one hand, analysts and experts, and on the other hand, people who bear an active and practical influence on Poland's political, economic, and cultural life.\nPrograms\nWarsaw Institute runs 6 regular online programs presenting experts' analysis on current issues.\nRussia Monitor\nRussia Monitor is a review of the most important events relating to Russian security. Warsaw Institute experts monitor and analyze the Kremlin's activities and those of its subordinate services to anticipate their short-term and long-term consequences, not only for Russia, but particularly for neighboring countries and the Western world. The subject of these analyses are both events and phenomena closely related to the internal situation in Russia, as well as its foreign policy. Experts focus on Russian politics behind-the-scenes, changes in security forces and special forces, and the conditions surrounding offensive activities, including military operations. Publications in this program are available online on the website and mobile app.\nSpecial Reports\nRegular analysis published in a booklet form concerning current international issues written by associates and non-resident fellows.\nUkraine Monitor\nUkraine Monitor aims to present current situation in Ukraine and to monitor the threats resulting from the tense international situation near its borders. This program despite providing information on recent issues concerning politics, social and economic issues explains their impact on the rapprochement with Europe.\nBaltic Rim Monitor\nBaltic Rim Monitor is the analysis of current problems in the Baltic Sea basin in the context of economy, military, and social issues. It is also aimed to observe Nordic-Baltic cooperation and monitor Russian activity in the region.\nRomania Monitor\nRomania Monitor is an analytical program that explains the main course of political, economical and social developments in Romania and Moldova it aims to predict possible changes and threats. Because of strategic importance of Romania as a border country of both the EU and the NATO Warsaw Institute experts monitor recent news concerning security and energy.\nDisinformation\nThis program involves carrying out professional analyses on the identification and creation of methods for combating organised disinformation. Within the project there was a special issue of \"The Warsaw Institute Review\" quarterly issued. It reported on the topic of organized, planned disinformation in the region of Central East Europe and Eastern Europe with focus on V4 countries, Ukraine and Baltic states.\nFootnotes"
    }
  ]
}