{
  "content": [
    {
      "type": "text",
      "text": "# Warsaw airlift\n\nRoyal Air Force\n* No. 148 Squadron\n* No. 178 Squadron\n* No. 624 Squadron\n* No. 301 Polish Bomber Squadron\nSouth African Air Force\n* 31 Squadron\n* 34 Squadron\nUS Army Air Force\n* 8th Air Force\nSoviet Air Forces\n| combatant2        =  Warsaw Garrison\n*  Luftwaffe\n* Numerous anti-air guns\n| commander1        =\n| commander2        =\n| commander3        =\n| strength1         =\n| strength2         =\n| casualties1       = 41 aircraft destroyed360 aircrew killed\n| casualties2       = Unknown\n| casualties3       =\n| campaignbox       =\n}}\nThe Warsaw airlift or Warsaw air bridge was a British-led operation to re-supply the besieged Polish resistance Home Army (AK) in the Warsaw Uprising against Nazi Germany during the Second World War, after nearby Soviet forces chose not to come to its aid. It took place between 4 August and 28 September 1944 and was conducted by Polish, British, Canadian, Australian, New Zealand and South African airmen flying from Celone and Brindisi in Italy and was denied flyover rights from their Soviet allies, who shot at them when the planes entered Soviet airspace. On 18 September, in the final stages of the Nazis crushing the uprising, one United States airdrop was launched from Great Britain and landed at Poltava in Soviet Ukraine as the distance to the drop-zone precluded the aircraft returning to base. The flights from Italy were night operations with low level cargo drops, conducted without fighter escort while the single United States Army Air Forces mission of 18 September 1944 was a high-altitude (and therefore largely inaccurate), daylight operation consisting of 107 B-17s protected by P-51 fighters. From the night of 13/14 September, Soviet aircraft flew some supply drops, dropping about 130 tons in total until 27/28 September. Initially, this cargo was dropped without parachutes, resulting in much of the payload being damaged or destroyed.\nAllied aircraft dropped a total of 370 tons of supplies in the course of the two months of operations, of which at least 50% fell into German hands. The airlift proved to be ineffective and could not provide sufficient supplies to sustain the Polish resistance, who were overrun by Nazi forces on 2 October 1944. The airlift was further hampered by the Soviet Union not allowing Western Allies the use of its airfields for several weeks, forcing flights to operate at extended ranges from Italy and Britain and in so doing, reducing payload and limiting the number of sorties. An estimated 360 airmen and 41 British, Polish, South African and American aircraft were lost.\nBackground\nBy the beginning of July 1944, Soviet forces had repelled the German formations over a wide front, from Lithuania in the north to the Black Sea in the south.  Vilnius capitulated to the Russians on 13 July and thereafter the main Soviet spearhead was headed towards the Vistula River.  Over the next two weeks, Brest-Litovsk as well as Lvov had fallen to the Soviets and then the Red Army swung north towards Warsaw.  By 1 August Soviet troops had entered the suburb of Praga east of the Vistula River.  In their rush towards Warsaw, the Soviets had neglected intelligence collection, flank protection and had over-extended their supply lines - to such an extent that a deliberate attack launched by General Walter Model stopped the Red Army's advance just short of Warsaw, preventing them from crossing the Vistula - this was after Hitler had finally consented to releasing four experienced and fresh panzer divisions to Model.  This action caused the Soviets to pause in order to re-group and bought Army Group Centre the time needed to deal with the resistance encountered within Warsaw itself.\nIn accordance with plans initiated by the London Poles, General Tadeusz Bór-Komorowski launched the Polish Home Army insurrection on 1 August 1944 in an attempt to seize Warsaw from the Germans before it was overrun by the Red Army. They managed to occupy large areas of downtown Warsaw but failed to secure the four bridges over the Vistula and were therefore unable to hold the eastern suburbs of the city.  With the Red Army stalled on the Vistula, German counterattacks and insurrection suppression operations lead to the Polish Home Army (as well as the city) being  systematically destroyed.  The plight of the Poles captured the imagination of the Western Allies and the British Royal Air Force (RAF), South African Air Force (SAAF) and United States Army Air Forces (USAAF) were ordered to fly supplies in to the beleaguered Polish resistance.\nSupplies were to be dropped in special waterproofed metal containers,  long and   in diameter, weighing   each.  Each aircraft could carry 12 containers (a load of ) and with 20 aircraft per mission, it was hoped to deliver    of supplies per night.  Missions from Italy would follow the route along the Vistula, accessing Warsaw from the south along the river using the four bridges across the river as their aiming reference points. Supplies were to be released from a height of   at an airspeed of   (the slow speed to avoid separation of parachutes from their containers).\nAirlift operations\nMissions from Italy\nWarsaw lay  north east from the Allied bases in Apulia and Brindisi in Italy.  The route from Italy was planned to take the aircraft north east from their home airfields over the Adriatic and Croatia at sunset to reach the Danube in Hungary in darkness.  They would then climb north east over the Carpathians and into Soviet held territory, to approach Warsaw from the south east.  The return leg was routed over eastern Germany and eastern Austria with the aircraft arriving back at their point of origin by mid morning the following day.  These aircraft flew without fighter escort and had to rely on their on-board armament to ward off German night fighters, who were able to vector in on their flight-paths with information from German ground-based controllers.  A Luftwaffe night-fighter training school at Kraków presented a continual problem as did ground-based AAA along the route.  Aircraft also reported having been attacked by Russian fighters as well as Russian AAA close to Warsaw.   Major General Jimmy Durrant of No. 205 Group RAF was in command of operations from Italy and assigned No. 334 Special Operations Wing RAF (No. 148 and No. 624 Squadron RAF, each equipped with 14 Halifaxes and 1586 Polish Special Duty Flight equipped ten aircraft being a mixture of Halifaxes and B-24 Liberators) to supply Warsaw.  No. 178 Squadron RAF was later also assigned to support the airlift.|group=\"Note\"}}    2 Wing SAAF contributed 31 and 34 Squadrons for operations, both equipped with Liberators.\nThe first air-drops from Italy were conducted by 1586 Polish Special Duty Flight accompanied by seven Halifaxes from No. 148 Squadron RAF, successfully delivering their cargo to Krasiński Square and to Vola on the night of 4/5 August.  Flights continued through August and into early September when all flights were suspended due to bad weather.  This time was used to test a new bomb-sight which would allegedly have permitted more accurate supply delivery from a higher altitude.  An aborted mission took place on 10/11 September with the last sorties taking place on 21/22 September, flown by 31 and 34 Squadrons SAAF as the Polish resistance was nearing total suppression by the Germans. A night mission on 13–14 August capt. Van Eissen's Liberator aircraft was shot down by German artillery, however he and some his crew members managed to parachute over the Soviet territory, they were surveyed by the Soviet side.\nUSAAF mission\nAt the Tehran Conference in November 1943, the Allied leaders had devised a new bombing strategy whereby American heavy bombers stationed in Britain and Italy would fly strike missions into central Germany and occupied Eastern Europe and would then land at secret American air bases (to be defended by the Soviets) located inside Soviet Russia.  Here the aircraft would be re-armed and fueled and would return to their home bases attacking second targets on the way home.  These operations went under the name of Operation Frantic.  However, on the night of 21/22 June 1944, German and Hungarian He 111 bombers had conducted a raid on one such airfield (Poltava in occupied Ukraine), destroying 43 B-17 Flying Fortresses on the ground. This raid left the Soviets \"smarting and sensitive\" and left the Americans determined to send their own anti-aircraft defenses as protection for the future. With these preceding events, the request for landing facilities issued by President Roosevelt on 14 August 1944 met with a brusque Soviet reply that the re-supply operations were a British and American affair to which the Soviet government could not object, but that no landing facilities would be granted to British or American aircraft once they had completed their mission over Warsaw. Only after three weeks of negotiation by both Churchill and Roosevelt, was the final Soviet reply delivered to the British Ambassador in Moscow on 9 September 1944, stating that the Soviet Union would take no responsibility for what was happening in Warsaw, that they themselves would commence with their own air-supply missions and that American and British aircraft would be granted landing rights with prior arrangement.   The single mission flown by the USAAF took place on 18 September and due to the high altitude of the drop as well as strong prevailing winds, only 288 of the 1,284 containers dropped, reaching the besieged Polish forces.\nThere was a strong disposition in Allied circles to approve a second USAAF mission; the Polish premier in exile in London, Stanisław Mikołajczyk appealed to Churchill who telephoned the United States Strategic Air Forces in Europe on 27 September to request a second mission after which Roosevelt, too, ordered a second Frantic delivery to Warsaw.  The second supply mission was never cleared by the Russians and Stalin formally refused permission on 2 October 1944.\nSoviet missions\nOn the night of 13 September 1944, Soviet aircraft commenced their own re-supply missions, dropping arms, medicines and food supplies. Initially these supplies were dropped in canisters without parachutes which lead to damage and loss of the contents - also, a large number of canisters fell into German hands. Over the following two weeks, the Soviet Air Forces flew 2535 re-supply sorties with small bi-plane Polikarpov Po-2's, delivering a total of 156 50-mm mortars, 505 anti-tank rifles, 1478 sub-machine guns, 520 rifles, 669 carbines, 41 780 hand grenades, 37 216 mortar shells, over 3 mln. cartridges, 131.2 tons of food and 515&nbsp;kg of medicine.Доклад командования 1-го Белорусского фронта Верховному главнокомандующему И.В. Сталину о масштабах помощи повстанцам Варшавы от 02.10.1944 № 001013/оп (секретно)цит. по: Зенон Клишко. Варшавское восстание. Статьи, речи, воспоминания, документы. М., Политиздат, 1969. стр.265-266.\nResults and aftermath\n, Poland]]\nEven if the air-supply missions had delivered their full consignment of supplies, and these had reached their intended recipients, it is unlikely that it would have altered the outcome of the Warsaw Uprising. However, the Red Army did not move against Warsaw, even when the resistance was crushed and instead they cleared their flanks in the Balkans and the Baltic, waiting for the total destruction of the non-Communist Poles.\nThe RAF and SAAF lost one aircraft for every ton of supplies delivered and a total of forty one allied aircraft were destroyed out of 306 dispatched.  In 1992, 67 ex-members of the SAAF 31 and 34 Squadrons were awarded the Polish Warsaw Cross of the Uprising for their role in the relief operations.\nAir Forces involved\n{|class=\"wikitable\"\n|style=\"background:#EBEBEB;\" colspan=\"10\"  align=\"center\"|Forces and Equipment committed\n|- valign=\"top\"\n!Air Force\n!Attached Formation\n!Squadron / Flight\n!Aircraft\n!Sorties\n!Mission Type\n!width=160pt|Mission Dates\n!Aircraft Losses\n|- valign=\"top\"\n|Polish Air Force\n|rowspan=\"5\"|No. 205 Group\n| 1586th Special Duty Flight\n|Consolidated Liberator Mk VHandley Page Halifax\n|rowspan=\"5\" align=right|186(attempted)92(considered successful)\n|rowspan=\"7\"|Re-supply\n|4/5 August 1944 8/9 August 1944 16/17 August 1944 26/27 August 194427/28 August 1944 1/2 September 1944\n|rowspan=\"5\"|39\n|- valign=\"top\"\n|Royal Air Force\n|No. 148 Squadron RAF\n|Handley Page Halifax  Consolidated Liberator\n| 4/5 August 1944 14/15 August 194416/17 August 1944\n|- valign=\"top\"\n|Royal Air Force\n|No. 178 Squadron RAF\n| Consolidated Liberator Mk. VI\n|13/14 August 1944 14/15 August 1944 16/17 August 1944 10/11 September 1944\n|- valign=\"top\"\n|South African Air Force\n|31 Squadron SAAF\n|Consolidated Liberator\n|13/14 August 1944 14/15 August 1944  15/16 August 1944  16/17 August 1944   21/22 September 1944\n|- valign=\"top\"\n|South African Air Force\n|34 Squadron SAAF\n|Consolidated Liberator\n|16/17 August 194410/11 September 194415/16 September 1944   21/22 September 1944\n|- valign=\"top\"\n|United States Army Air Forces\n|8th Air Force\n|Aircraft from:95th Bombardment Group (Heavy) 100th Bomber Group  390th Bomber Group355th Fighter Group\n|Boeing B-17 Flying Fortress\n|align=right|1+2\n|18 September 1944\n|2\n|- valign=\"top\"\n|- valign=\"top\"\n|Soviet Air Forces\n|\n|\n|Polikarpov Po-2\n|align=right|2,000+\n|13–27 September 1944\n|Unknown\n|- valign=\"top\"\n|Royal Air Force\n| Mediterranean Allied Air Forces\n|No. 267 Squadron RAF\n|Douglas Dakota\n|align=right|3\n|Agent infiltration\n|September 1944\n|None\n|- valign=\"top\"\n|}\nSee also\n* Lack of outside support during the Warsaw Uprising\n* Military history of the Warsaw Uprising\n* Operation Frantic\n* Prelude to the Warsaw Uprising\n* Warsaw Uprising\nNotes and references\n;Footnotes\n;Citations\n;Bibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20121014213548/http://www.nationalmuseum.af.mil/factsheets/factsheet_media.asp?fsID=1653 Operation Frantic Soviet-American Photos]\n* [http://samilitaryhistory.org/vol131pm.html South African Military History Society: The Warsaw Airlift, A Triumph of SA Bravery by Dr Moller] and [http://samilitaryhistory.org/vol062ve.html The Warsaw Airlift: Major J.L. van Eyssen, DFC]\n* [http://www.warsawuprising.com/res.htm Warsaw Uprising website]"
    }
  ]
}