{
  "content": [
    {
      "type": "text",
      "text": "# Warship (2010 TV series)\n\n| last_aired           =\n| related              = Warship\n}}\nWarship is a British documentary series produced by Channel 5 about the Royal Navy. The series features two Navy ships and documents the daily routines of the crew on board during a deployment or exercise. The first series focused on the lives of the crew on board the aircraft carrier . The second series was filmed on the amphibious warfare ships  and  during a six-month exercise in 2009.\nEpisodes\nTwelve episodes of the series aired:\nSeries 1 (2010)\n|ShortSummary= is due to depart HMNB Portsmouth on an exercise but her departure is hampered by some problems.\n|LineColor= ADD8E6\n}}\n|ShortSummary= The sailors on Illustrious are subjected to a \"battle-readiness\" inspection. After much hassle, Illustrious finally sets sail.\n|LineColor= ADD8E6\n}}\n|ShortSummary= Illustrious navigates the treacherous Suez Canal. Meanwhile, a sailor goes missing.\n|LineColor= ADD8E6\n}}\n|ShortSummary= The crew hosts a dinner for naval royalty. The awesome Harrier jump jets arrive and love is in the air.\n|LineColor= ADD8E6\n}}\n|ShortSummary= The ship has reach the Indian Ocean and the resident RAF pilots practice landing on the ship's flight deck.\n|LineColor= ADD8E6\n}}\n|ShortSummary= Illustrious has reached the easternmost point of its journey. They are joined by a nuclear submarine in the exercise.\n|LineColor= ADD8E6\n}}\n}}\nSeries 2 (2010)\n|ShortSummary= and her 300-strong crew depart HMNB Devonport for the Far East via the Bay of Bengal for exercise Taurus 09 Task Force.\n|LineColor= FE9A2E\n}}\n|ShortSummary=The Marines try to cope with the hostile conditions while training in the jungles of Malaysia.\n|LineColor= FE9A2E\n}}\n|ShortSummary= takes over Bulwark as flagship of the deployment and are joined by fellow warships and sailors from the United States, France and other allies.\n|LineColor= FE9A2E\n}}\n|ShortSummary=Ocean joins an international fleet of warships for a simulated air-to-sea battle.\n|LineColor= FE9A2E\n}}\n|ShortSummary=Ocean leads the exercise task force through the South China Sea to Brunei as 500 Marines prepare for jungle training.\n|LineColor= FE9A2E\n}}\n|ShortSummary=Marines from the assault squadrons launch a training exercise in the steamy jungles of Brunei. They are joined by their American counterparts in team-building exercises.\n|LineColor= FE9A2E\n}}\n}}\nReferences\nExternal links\n*[http://www.royalnavy.mod.uk/sitecore/content/home/the-fleet/ships/assault-ships/hms-bulwark HMS Bulwark] – Royal Navy official website"
    }
  ]
}