{
  "content": [
    {
      "type": "text",
      "text": "# Warthog\n\n| type_species_authority = Pallas, 1766\n| subdivision_ranks = Species\n| subdivision =\nPhacochoerus aethiopicus\nPhacochoerus africanus\n|synonyms=\n* Aper Pallas, 1766\n* Dinochoerus Gloger, 1841\n* Eureodon G. Fischer von Waldheim, 1817\n* Macrocephalus Frisch, 1775\n* Macrocephalus Palmer, 1904\n* Phacellochaerus Hemprich & Ehrenberg, 1832\n* Phacellochoerus Hemprich & Ehrenberg, 1832\n* Phacochaeres Gray, 1821\n* Phacocherus Fleming, 1822\n* Phacochoerus G. Cuvier, 1816\n* Phascochaeres Cretzschmar, 1828\n* Phascochaerus Desmarest, 1822\n* Phascochoeres Ranzani, 1821\n* Phascochoerus Ranzani, 1821\n}}\nPhacochoerus is a genus in the family Suidae, commonly known as warthogs (pronounced wart-hog). They are pigs who live in open and semi-open habitats, even in quite arid regions, in sub-Saharan Africa. The two species were formerly considered conspecific under the scientific name Phacochoerus aethiopicus, but today this is limited to the desert warthog, while the best-known and most widespread species, the common warthog (or simply warthog), is Phacochoerus africanus.\nDescription\nSkull\nAlthough covered in bristly hairs, a warthog's body and head appear largely bare, from a distance, with only a crest of hair along the back and the tufts on the face and tail being obvious. The English name \"wart\"-hog refers to their facial wattles, which are particularly distinct in males. The males also have very prominent tusks, which reach a length of ; females' tusks are always smaller. They are largely herbivorous, but, like most suids, opportunistically eat invertebrates or small animals, even scavenging on carrion. While both species remain fairly common and widespread, and considered to be of Least Concern by the IUCN, the nominate subspecies of desert warthog, commonly known as the Cape warthog (P. a. aethiopicus) was extinct by around 1865.\nSpecies in taxonomic order\nThe genus Phacochoerus contains two species. The two species emerged from ecological barriers. P. africanus were found with a lack of upper incisors, while P. aethiopicus were found with a full set.\n, and shoulder height from . Females, at , are smaller and lighter than males, at .\n|habitat=\n|hunting=\n|iucn-status= LC\n|population=\n|direction=\n|subspecies=\n}}\nand weight of  with males being larger than females.\n|habitat=\n|hunting=\n|iucn-status= LC\n|population=\n|direction=\n|subspecies= Database entry includes a brief justification of why this species is of least concern. |bullets=on\n|†P. a. aethiopicus (Pallas, 1766)\n|P. a. delamerei'' Lönnberg, 1909\n}}\n}}\nReferences\nExternal links\n*\n*\n* d'Huart, J.P. & Grubb, P. (2005). [http://data.iucn.org/themes/ssc/sgs/pphsg/Suiform%20soundings/Newsletter%205(2).pdf A photographic guide to the differences between the Common Warthog (Phacochoerus africanus) and the Desert Warthog (Ph. aethiopicus).] Suiform Soundings 5(2): 4–8."
    }
  ]
}