{
  "content": [
    {
      "type": "text",
      "text": "# Wartislaw V\n\n| birth_place =\n| death_date = 1390\n| death_place =\n| burial_place = Monastery at Pudagla\n}}\nWartislaw V. (c. 1 November 1326 &ndash; 1390) was a duke of Pomerania from the House of Griffin. He initially ruled Pomerania-Wolgast jointly with his elder brothers Barnim IV and Bogislaw V. He stood in their shadow and after 1368, he ruled his own part of the Duchy: the Land of Neustettin. Neustettin is now called Szczecinek.\nLife\nWartislaw V was the youngest, posthumous son of Duke Wartislaw IV, who reigned in the Duchy of Pomerania Pomerania-Wolgast, and his wife Elisabeth of Silesia. Wartislaw IV died on 1 August 1326; Wartislaw V was born around 1 November 1326.\nAfter Wartislaw IV, his older sons Barnim IV and Bogislaw V jointly ruled Pomerania-Wolgast, initially under guardianship. Wartislav is first mentioned in a document from 1338, which he did not seal. From 1341, the three brothers ruled jointly and independently. Bogislaw was the most active ruler initially, later Barnim was most active. Wartislaw always remained in the shadow of his brothers.\nBarnim IV died in 1365. His sons Wartislaw VI and Bogislaw VI inherited his share in the government. They supported Wartislaw V against Bogislaw V. The dispute degenerated into a civil war and Emperor Charles IV intervened. He authorized a committee of arbitration, which included the Lübeck City Council. On 25 May 1368, the dukes agreed on a preliminary division of Pomerania-Wolgast, in which Wartislaw V received the Land of Neustettin. The final division was made on 8 June 1372.\nWartislaw V died in 1390. He was probably buried in the monastery at Pudagla.\nWartislaw V was, according to the historian Martin Wehrmann (1861–1937), unmarried and reports to the contrary by some genealogists are incorrect.\nSee also\n* House of Griffins\n* List of Pomeranian duchies and dukes\nReferences and sources\n* Klaus Conrad: Herzogliche Schwäche und städtische Macht in der zweiten Hälfte des 14. und im 15. Jahrhundert, in: Werner Buchholz (ed.): Deutsche Geschichte im Osten Europas. Pommern, Siedler Verlag, Berlin, 1999, , pp.&nbsp;127–202.\n* Martin Wehrmann: Geschichte von Pommern, vol 1, second edition, Verlag Friedrich Andreas Perthes, Gotha 1919, reprinted: Augsburg, 1992,\n* Martin Wehrmann: Genealogie des pommerschen Herzogshauses, Leon Sauniers Buchhandlung, Stettin, 1937, p.&nbsp;82."
    }
  ]
}