{
  "content": [
    {
      "type": "text",
      "text": "# Wartime Elections Act__disambig_1\n\nThe Canadian Wartime Elections Act () was a bill passed on September 20, 1917, by the Conservative government of Robert Borden during the Conscription Crisis of 1917 and was instrumental in pushing Liberals to join the Conservatives in the formation of the Canadian Unionist government. While the bill was an explicit attempt to get more votes for the government, it was also the first act giving women the vote in federal elections.\nThe Act gave the vote to the wives, widows, mothers, and sisters of soldiers serving overseas.  They were the first women ever to be able to vote in Canadian federal elections and were also a group that was strongly in favour of conscription. The act also disenfranchised \"enemy-alien\" citizens naturalized after March 31, 1902 (unless they had relatives serving in the armed forces); this meaning primarily German, Ukrainian, and Polish Canadians (former subjects of the German and Austro-Hungarian Empires). Doukhobors, only in British Columbia, were partially disenfranchised for 37 years — 1919 to 1956 — first in provincial and then in 1934 in federal elections, but not in municipal or school board elections, because politicians feared their leader could dictate them to vote en bloc to influence an election. At the time the act was passed, it was justified through the patriotic fever surrounding World War I. While it was opposed by those who were disenfranchised and other opponents of the government, it was widely supported by the majority of Canadians.\nThe act was coupled with the Military Voters Act that further skewed the vote in favour of the Unionists. The two laws were effective in helping the government be re-elected in the 1917 election, but the Unionists were elected by a large enough margin that they would have won anyway. In the long run, however, the laws so alienated French-Canadians and recent immigrants that they would vote Liberal for decades, greatly hurting the Conservative Party.\nAfter the war, the Act was repealed by the Dominion Elections Act of 1920, which was enacted on June 29 and assented to on July 1, 1920. Most women (notably not Aboriginal women or those without property) were enfranchised as of 24 May 1918.\nReferences"
    }
  ]
}