{
  "content": [
    {
      "type": "text",
      "text": "# Wartau\n\n| postal_code                = 9476-9479\n| municipality_code          = 3276\n| area                       = 41.74\n| elevation                  = 468\n| elevation_description      =\n| population                 =\n| populationof               =\n| popofyear                  =\n| website                    = www.wartau.ch\n| mayor                      = Andreas Bernold\n| mayor_asof                 =\n| mayor_party                =\n| mayor_title                =\n| list_of_mayors             =\n| places                     =\n| demonym                    =\n| neighboring_municipalities = Balzers (LI), Flums, Mels, Sargans, Sevelen, Triesen (LI), Walenstadt\n}}\nWartau is a municipality in the  Werdenberg constituency of the Swiss canton of St. Gallen. The municipality consists of a number of villages on the eastern flank of the Alvier group, along the left shore of the Alpine Rhine.\nGeography\n(), looking west-northwest towards Walensee.]]\nWartau municipality consists of the villages of Azmoos (), Trübbach (), Weite () along the Rhine, Oberschan (), Malans (), Gretschins () and Fontnas () in the foothills of the Alvier chain, the hamlets of Plattis () and Murris (), and Matug () and environs, historically a Walser Streusiedlung.\nWartau has an area, (as of the 2004/09 survey) of .  Of this area, about 45.8% is used for agricultural purposes, while 38.4% is forested.   Of the rest of the land, 6.8% is settled (buildings or roads) and 9.0% is unproductive land.  In the 2004/09 survey a total of  or about 4.1% of the total area was covered with buildings, an increase of  over the 1984 amount.  About 0.19% of the total area is recreational space.  Of the agricultural land,  is used for orchards and vineyards,  is fields and grasslands and  consists of alpine grazing areas.  Since 1984 the amount of agricultural land has decreased by .  Over the same time period the amount of forested land has increased by .  Rivers and lakes cover  in the municipality.\nThe highest point of the municipality is Alvier peak, at , the lowest point is the Rhine Valley at .\nDemographics\nWartau has a population (|lc=on}}) of .  , 28.6% of the population are resident foreign nationals.  In 2015 a small minority (321 or 6.1% of the population) was born in Germany a small minority (273 or 5.2% of the population) was born in Italy.  Over the last 5 years (2010-2015) the population has changed at a rate of 3.73%.  The birth rate in the municipality, in 2015, was 10.5, while the death rate was 8.6 per thousand residents.\n, children and teenagers (0–19 years old) make up 22.5% of the population, while adults (20–64 years old) are 61.1% of the population and seniors (over 64 years old) make up 16.4%.  In 2015 there were 2,179 single residents, 2,443 people who were married or in a civil partnership, 243 widows or widowers and 366 divorced residents.\nIn 2015 there were 2,176 private households in Wartau with an average household size of 2.38 persons. In 2015 about 67.1% of all buildings in the municipality were single family homes, which is greater than the percentage in the canton (60.5%) and greater than the percentage nationally (57.4%).  Of the 1,446 inhabited buildings in the municipality, in 2000, about 69.3% were single family homes and 14.2% were multiple family buildings.  Additionally, about 29.6% of the buildings were built before 1919, while 11.0% were built between 1991 and 2000.  In 2014 the rate of construction of new housing units per 1000 residents was 7.66.  The vacancy rate for the municipality, , was 0.82%.\n, about 23.3% of the population was made up of foreign nationals.  Of the foreign population, (), 84 are from Germany, 176 are from Italy, 424 are from ex-Yugoslavia, 53 are from Austria, 25 are from Turkey, and 155 are from another country.  Most of the population () speaks German (88.5%), with Albanian being second most common (3.2%) and Italian being third (2.9%).  Of the Swiss national languages (), 4,161 speak German, 9 people speak French, 135 people speak Italian, and 11 people speak Romansh.\nThe historical population is given in the following chart:\nColors=\nid:lightgrey value:gray(0.9)\nid:darkgrey  value:gray(0.8)\nImageSize  = width: auto height:200 barincrement:45\nPlotArea   = top:20 left:40 bottom:20 right:35\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:6000\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:1200 start:0\nScaleMinor = gridcolor:lightgrey increment:300 start:0\nPlotData=\ncolor:yellowgreen width: 35   mark:(line,white) align:center\nbar:1850 from:start till:2097 text:\"2,097\"\nbar:1860 from:start till:2297 text:\"2,297\"\nbar:1870 from:start till:2573 text:\"2,573\"\nbar:1880 from:start till:2870 text:\"2,870\"\nbar:1888 from:start till:3191 text:\"3,191\"\nbar:1900 from:start till:3149 text:\"3,149\"\nbar:1910 from:start till:3045 text:\"3,045\"\nbar:1920 from:start till:3238 text:\"3,238\"\nbar:1930 from:start till:3200 text:\"3,200\"\nbar:1941 from:start till:3443 text:\"3,443\"\nbar:1950 from:start till:3316 text:\"3,316\"\nbar:1960 from:start till:3284 text:\"3,284\"\nbar:1970 from:start till:3604 text:\"3,604\"\nbar:1980 from:start till:3692 text:\"3,692\"\nbar:1990 from:start till:4103 text:\"4,103\"\nbar:2000 from:start till:4704 text:\"4,704\"\nbar:2010 from:start till:5034 text:\"5,034\"\nbar:2015 from:start till:5231 text:\"5,231\"\nHistory\nThere are a number of Mesolithic, Neolithic and Bronze Age traces, as well traces of an early medieval estate.\nThe name Wartau is taken from that of Wartau Castle, built in 1225 (overlooking Gretschins). The center of the medieval manor was at Gretschins, with a church first mentioned in 1273.\nThe lordship of Wartau passed to the counts of Werdenberg-Heiligenberg in 1399, and further to Lucerne in 1485 and to Glarus in 1517. In the 14th century, the higher parts of the territory of the modern municipality (Matug,  Walserberg, Palfris) were settled by Walser.  High justice lay with the county of Sargans from 1483 until 1798.  There was a Rhine ferry between Trübbach and Balzers in the medieval period.  The Swiss Confederacy constructed a road along the Rhine to Sargans in 1491/2.\nThe church at Gretschins was dedicated to Saint Martin in 1494, but the parish adopted the Swiss Reformation at an early time, in the 1520s. Attempts to re-introduced the Catholic mass in 1694/4 resulted in the \"Wartau conflict\" (Wartauerhandel), which almost triggered a larger religious war in the Swiss Confederacy. A second church was built in Azmoos in 1736.\nThe municipal coat of arms is attested on a stained glass panel dated 1632. It shows a grapevine below a gold star in a red field (Gules a Vine Stump Vert leaved issuant from Coupeaux of the same and in chief a Mullet Or).  An unrelated municipal coat of arms, showing the castle ruins, was designed in 1939.\nThis was replaced in favour of the historical coat of arms in the 1970s.\nIn 1802, a short-lived \"Republic of Wartau\" was proclaimed, before the modern municipality was formed as part of the Swiss canton of St. Gallen in 1803. The Walser population which now found itself on the territory of the municipality was naturalized only in 1827, under pressure from the cantonal authorities.\nRailway stations at Trübbach and Weite were built in 1858. The Rhine ferry was replaced by a bridge in 1872. The A13 motorway dates to 1967.\nThe prehistoric settlement and sacrifice site at Gretschins-Herrenfeld and Ochsenberg, as well as the nearby medieval castle ruins and the Walser Rathaus (council house) auf Palfries are listed as Swiss heritage sites of national significance.\nThe villages of Azmoos and Oberschan as well as the hamlets of Fontnas and Gretschins are designated as part of the Inventory of Swiss Heritage Sites.\nPolitics\nIn the 2015 federal election the most popular party was the SVP with 38.3% of the vote.  The next three most popular parties were the FDP (21.3%), the SP (15.6%) and the CVP (7.5%).  In the federal election, a total of 1,405 votes were cast, and the voter turnout was 46.3%.\nIn the 2007 federal election the most popular party was the SVP which received 42.3% of the vote.  The next three most popular parties were the FDP (23.2%), the SP (15.7%) and the CVP (7.3%).\nEducation\nIn Wartau about 70.2% of the population (between age 25–64) have completed either non-mandatory upper secondary education or additional higher education (either university or a Fachhochschule).  Out of the total population in Wartau, , the highest education level completed by 991 people (21.1% of the population) was Primary, while 1,759 (37.4%) have completed their secondary education, 440 (9.4%) have attended a Tertiary school, and 232 (4.9%) are not in school.  The remainder did not answer this question.\nEconomy\nWartau is an industrial community, a municipality where manufacturing provides over a quarter of all jobs.\n, there were a total of 1,886 people employed in the municipality.  Of these, a total of 194 people worked in 49 businesses in the primary economic sector.  There was one mid sized primary section business with a total of 71 employees.  The secondary sector employed 771 workers in 67 separate businesses.  Finally, the tertiary sector provided 921 jobs in 229 businesses.\nIn 2015 a total of 7.7% of the population received social assistance.  In 2011 the unemployment rate in the municipality was 2%.\nIn 2015 local hotels had a total of 5,594 overnight stays, of which 13.4% were international visitors.\nIn 2015 the average cantonal, municipal and church tax rate in the municipality for a couple with two children making  was 4.8% while the rate for a single person making  was 19.4%.  In 2013 the average income in the municipality per tax payer was  and the per person average was , which is less than the cantonal average of  and  and less than the national per tax payer average of  and the per person average of .\nthere were 1,017 residents who worked in the municipality, while 1,407 residents worked outside Wartau and 926 people commuted into the municipality for work.\nReligion\nThe parish of Gretschins was probably established in the early 13th century (first mention 1273). The church of Gretschins was rebuilt in 1494 and dedicated to Saint Martin.\nThe Swiss Reformation was adopted still in the 1520s, and the population resisted attempts made by Glarus in the 17th century of re-introducing Roman Catholicism.\nAzmoos-Trübbach was established as a separate parish in 1743.\nA Catholic church was built in Azmoos 1892, and Catholic population gradually increased, reaching parity by the later 20th century.  As of the , 42% of population were  Catholic and 38% belonged to the Swiss Reformed Church.\nWartau has received a significant immigrant population since the later 20th century, reflected by 7.8% (367 individuals) identifying as Muslim in the 2000 census.  5.5% (261 individuals) identified as non-religious (atheist or agnostic).\nHeritage sites of national significance\nThe Gretschins-Herrenfeld and Ochsenberg prehistoric settlement and sacrifice site as well as the ruins of Wartau Castle and the so-called Walser Rathaus (town council house) auf Palfries are listed as Swiss heritage sites of national significance.  The villages of Azmoos and Oberschan and the hamlets of Fontnas and Gretschins are part of the Inventory of Swiss Heritage Sites.\nReferences\nExternal links\n* [http://www.wartau.ch Official website]"
    }
  ]
}