{
  "content": [
    {
      "type": "text",
      "text": "# Warwick Brookes\n\nyacht Tuiga, pictured in 2008, was owned by Brookes in the 1920s]]\nWarwick Brookes (1875 – August 1935)\nwas an English businessman, yachtsman and Conservative Party politician. As his retail and other businesses prospered, he was elected to the House of Commons in 1916, but after an electoral defeat in 1918 he returned to commerce and prospered in amusements catering. However, excessive spending and a series of business difficulties and led to him being made bankrupt in 1931.\nEarly life\nBrookes was born in Chorlton, Manchester, the son of Warwick Brookes.\nHis youngest brother Gordon was an actor who served in World War I as a captain in the Duke of Cornwall's Light Infantry.\nGordon was killed in action on 16 September 1916.\nBusiness\nBrookes had a variety of business interests. Before World War I he had an iron foundry in Essex, and was also involved in Eugen Sandow's Institute of Physical Culture, an early gymnasium for body builders.\nBrookes and his father were both directors of the Piccadilly-based company, Sandow (Limited), which was wound up in 1916.\nAt the start of the war he became managing director (MD) of the Junior Army & Navy Stores;\nlater he set up a factory which manufactured equipment for the British Army, such as canvas buckets and groundsheets. He was also MD of the Civil Service Co-operative Society (based in Haymarket) and of Booth & Brookes Ltd and T.T. Nethercoat & Co. Ltd. In the autumn of 1917 he visited the United States to promote the Junior Army & Navy Stores, where he launched an advertising campaign which led to a big increase in custom from American servicemen based in the United Kingdom.\nHis various ventures made him a wealthy man, and by 1918 he was registered as the joint owner of No. 145 Oxford Street,\nand lived in Park Lane, which was then one of the city's most fashionable streets.\nWhen the Civil Service Co-op merged with the Junior Army & Navy in July 1919,\nBrookes was offered £250,000 for his stake in the former, but declined the offer.\nHe became MD of the Army & Navy, on a salary of £7,500 a year,\nand a few years later in the slump after the end of the Great War, he sold his stake for £25,000.\nIn the 1920s, he won the concession to establish the amusement park at the British Empire Exhibition in Wembley, and later secured the same rights at the Paris Exhibition. However, the Paris project failed entirely after an accident on the park's scenic railway. He was also involved with promoting British Controlled Oil Fields Limited, but his various joint ventures with James White ran into difficulties after White's death. At this point he was in grave financial difficulties, but began working to develop the British interests of a group of American investors who promised him substantial reward. However those ventures did not proceed as the Great Depression took hold, and the promised payments never materialised. Debts and loss of income combined with an extravagant lifestyle to force him into bankruptcy in October 1931,\nwith liabilities of £50,000. When he sought a discharge from bankruptcy in 1932, only £39 had been realised in assets, with hopes of a further £252.\nPolitics\nNewington\nIn June 1908, Brookes was selected as the Conservative candidate for the Newington West constituency, in South London.\nHe campaigned for the Conservative candidate at the by-election in Chelmsford in November that year\nbut at the general election in January 1910 he lost in Newington West to the sitting Liberal Party MP Captain Cecil Norton, by a margin of 412 votes (5.0%)\nAt the December 1910 election, Norton, by now Assistant Postmaster-General,\nsaw off Brookes again, this time with a majority of 540 votes (7.2%).\nNorton was elevated to the peerage in 1916 as Baron Rathcreedan,\ntriggering a by-election in Newington West. Norton had already indicated his intention to stand down from the Commons at the next general election, and the City of London merchant J. D. Gilbert had already been selected as the Liberal prospective parliamentary candidate.\nIn ordinary circumstances this would have led to a by-election contested both by Gilbert and by Brookes, who had been adopted as the prospective Conservative candidate, but the war had brought a different logic. The parties in the coalition government led by H. H. Asquith had agreed an electoral pact for the duration of the war: when a vacancy arose in a seat held by the Conservatives, the Liberals would not contest the resulting by-election, and vice versa.\nIt soon became clear that some sort of contest was likely. The Unionist Labour Party invited Lambeth Borough Councillor W. A. Perkins to contest the seat on its behalf,\nand the London Trades Union Protest Committee selected Joe Terrett to stand on a platform of opposition to the recently introduced drink orders introduced on liquor traffic by the Central Control Board. At this point Brookes was still considering whether to stand, so Terrett offered to step down if Brookes would agree to stand and oppose the drink orders. Meanwhile, the Executive of the Liberal Association in Portsmouth made a counter-offer: if Brookes stepped aside, it would agree not to contest the Portsmouth by-election which had been triggered by the ennoblement of the Conservative MP Lord Charles Beresford.\nBrookes did step aside, in the interests of preserving the truce between the parties.\nMile End\nBrookes waited less than a week for another chance to enter Parliament.\nOn 9 January, two days after the close of nominations in Newington West, a vacancy arose in the East London, in the Mile End division of Tower Hamlets.\nMile End's Conservative MP Colonel Harry Lawson succeed to the peerage as Baron Burnham, on the death of his father, and on 12 January Brookes was selected as the Conservative candidate. Noel Pemberton-Billing, who had resigned from the Royal Naval Air Service to campaign for greater use of air power in World War I, stood as an independent candidate, promising that when the defence of London was in the hands of \"practical airmen\" the city would be safe from air raids by zeppelins.\nCanvassing on behalf of Brookes began immediately. J. D. Gilbert, who had won the Newington West by-election, sent him a letter of support asking Mile End's Liberals to support Brookes,\nand B.S. Straus, who had been the prospective Liberal candidate in Mile End, offered to sign Brookes's nomination papers.\nCampaigning in support of an intensified war effort, Brookes supported the \"economic strangulation\" of Germany, and backed Military Service Bill which would introduce conscription.\nHe also supported the development of air defences, and advocated an air force given the same pre-dominance then held by the Royal Navy. The writ for the by-election was issued on 17 January, and with the campaign well underway The Times newspaper commented the next day that it would be \"unwise to speculate on the result\".\nMany of Mile End's 6,000 electors were unable to vote, since they were away serving in the war. Some 2,000 of the voters were Jewish, and their support was seen as critical; many of them were shopkeepers, and The Times speculated that they might be attracted to Billings' commitment to end the blackout. Billings made his speeches from the cockpit of an aeroplane\nand both candidates advocated similar policies for strengthening air defences. Nominations closed on 21 January,\nand the First Lord of the Admiralty, Arthur Balfour, intervened to denounce the \"criminality\" of an implication by Billings that the air defence of the East End had been neglected because the people there were poor.\nPolling took place on 25 January, and Brookes was declared the winner with a majority of 376 votes (10.4%) over Billings.\nLater that week, as a new Member of Parliament (MP), Brookes joined a delegation of London MPs who visited Lord Kitchener at the War Office to discuss the protection of London from raids by aircraft.\nPreston\nAt the post-war general election in December 1918 Brookes did not stand again in Mile End, which was held with a huge majority by the Coalition Conservative candidate Walter Preston. Instead he stood as a Coalition Conservative for the borough of Preston, where he won neither of the two seats.\nThe Times observed that the \"transference of an old London member to Preston did not suit local tastes\".\nYachting\nFor two decades, Brookes was a regular competitor at yachting events in England. His 6 Metre-class yacht The Alien competed regularly in events at the Eastern of England Yacht Club in Burnham-on-Crouch in 1908,\n1909\nalthough he does not appear to have won any major races.\nBy 1920 he was sailing Susanne, a 154-Thames Ton schooner built in 1904 to the designs of William Fife,\nand competing against the King's yacht Britannia at Deal\nand in Cowes Week.\nIn 1922 Brookes raced in a 15-metre class yacht Tuiga\nand in 1925 he competed at Cowes Week in a 51-ton cutter Hispania.\nIn 1928 he bought the steam yacht Sea Fay.\nReferences\nExternal links\n*\n* Brookes's yacht [http://www.classicyacht.info/modules/yachts/Tuiga-TYearBuilt-yachts_detail-676.html Tuiga]"
    }
  ]
}