{
  "content": [
    {
      "type": "text",
      "text": "# Warwick Allerton - Chicago\n\n|status             =\n|start_date         = 1922\n|completion_date    = 1924\n|opening            = 1924\n|building_type      = hotel\n|antenna_spire      =\n|roof               =\n|top_floor          =\n|floor_count        = 25\n|elevator_count     =\n|cost               = $4 million\n|floor_area         =\n|architect          = Murgatroyd & Ogden, with Fugard & Knapp\n|structural_engineer=\n|main_contractor    =\n|developer          = Allerton Hotels\n|owner              = Andre Williams\n|embedded           =\n|references         =\n}}\nThe Warwick Allerton - Chicago (formerly Allerton Hotel and Warwick Allerton Hotel Chicago and Allerton Crowne Plaza Hotel) is a 25-story  hotel skyscraper on the Magnificent Mile in the Near North Side community area of Chicago, Illinois.   It was the first building in the city to feature pronounced setbacks and towers resulting from the 1923 zoning law. The building was designated a Chicago Landmark on May 29, 1998.\nWhen the Allerton Hotel first opened, it had fourteen floors of small apartment-style rooms for men and six similar floors for women, with a total of 1,000 rooms.  The hotel also boasted social events, gold, sports leagues, a library, solarium, and an in-house magazine. An early resident was Louis Skidmore, founder of the architectural firm Skidmore, Owings & Merrill.\nIn the 1940s and 1950s, the hotel housed a swanky lounge on its top floor, called the \"Tip Top Tap\".  Although the lounge closed in 1961, the sign proclaiming its existence is still displayed on the building's exterior. By 1963, the room was home to a new restaurant, the Cloud Room, when Don McNeill moved his broadcast of ''Don McNeill's Breakfast Club'' to the location. While the show was broadcast from the Allerton, McNeill's guests included regular Fran Allison.\nAfter the Allerton Hotel was declared a Chicago landmark, it closed in August 1998 through May 1999 for a $40 million renovation. The firm of Eckenhoff Saunders Architects oversaw restoration work which restored the hotel's bygone grandeur and upgraded mechanical systems.  When the hotel reopened as the Allerton Crowne Plaza Hotel, the twenty-third floor, which previously housed the Tip Top Tap and the Cloud Room, became the Renaissance Ballroom and a lounge opened on the second floor called Taps on Two featuring one of the Tip Top Tap's signature drinks, a Moscow mule.\nIn November 2006, a partnership of Oxford Lodging and Perry Capital purchased the hotel from FelCor Lodging for $70 million. The new owners ended the affiliation with Crowne Plaza and on February 2, 2007, the property was re-christened The Allerton Hotel.  Shortly after the purchase, Oxford announced further renovations to the property.\nIn March 2014, Warwick International Hotels, a New York–based hotel chain, purchased the Allerton and renamed it the \"Warwick Allerton Hotel\".  Warwick acquired the Allerton from New York–based hedge fund manager Petra Capital Management LLC, which won a 2012-battle for control of the property in bankruptcy court.  They announced renovation plans which included a possible reopening the Tip Top Tap on the hotel's 23rd floor.\nReferences\nExternal links\n*\n* [http://warwickhotels.com/allerton-hotel-chicago Warwick Allerton Hotel Chicago official website]"
    }
  ]
}