{
  "content": [
    {
      "type": "text",
      "text": "# Warwick Watkins\n\nWarwick Arthur Watkins (1950–2019) was a disgraced senior New South Wales public servant and former member of the Australia national rugby union team, the Wallabies.\nEarly life\nWatkins was born in Newcastle, New South Wales on 8 February 1950. He was educated at Grafton High School and Hawkesbury Agricultural College.\nAustralian Rugby\nWatkins was selected in the Australian Rugby team, the Wallabies, and was a reserve in the three Test match Bledisloe Cup series against New Zealand in 1980 held in Australia.\nNew South Wales government career\nWatkins held a range of senior New South Wales public service positions including:\n* Commissioner of the NSW Soil Conservation Service\n* Director-General of the Department of Lands 2003–11\n* Chief Executive of the Land and Property Management Authority (LPMA), 2000–11\n* Surveyor-General of New South Wales 2000–11\n* Registrar-General, 2003–11.\nHe also held a range of inter-governmental appointments including Deputy Commissioner of the Murray Darling Basin Commission 1992–95, Chair of the Total Catchment Management Coordinating Committee and Deputy Chair of the CSIRO Water for a Healthy Country Flagship Board. Watkins was Chairman of the Australian New Zealand Land Information Council, 2000–2011.\nWith a career of 41 years, Watkins was dismissed from the NSW Public Service in July 2011, after having been stood down in March 2011.  In the week prior to his dismissal, Watkins resigned from his positions as NSW surveyor-general, registrar-general and commissioner of the soil conservation service. The NSW Independent Commission Against Corruption (ICAC) in delivering its official findings in December 2011 reported that Watkins acted corruptly. Watkins admitted to ICAC he had used a letter backdated by former planning minister Tony Kelly to mislead investigators.\nCurrawong land deal – ICAC investigation (Operation Napier), Prosecution and Convictions\nOn 20 June 2011, ICAC announced that it would hold a public inquiry into matters arising from the purchase of property at Currawong, Pittwater by the NSW Government. Specifically, purchase involved four properties at Currawong, Pittwater, were purchased for $12.2 million on 15 March 2011 by Watkins on behalf of the NSW Government from the owner, Eco Villages Australia Pty Limited. The properties were previously owned by a NSW union. ICAC held a public inquiry over 11 days during June and July 2011. The ICAC Commissioner, the Hon. David Ipp AO QC, presided at the public inquiry. Twenty-one witnesses gave evidence. ICAC concluded its investigation in mid-December. ICAC found that the Minister for Lands Tony Kelly engaged in corrupt conduct with respect to the purchase of the property by the NSW Government. Specifically, ICAC found that Kelly, authorised the purchase even though he knew he was not authorised to do so, and that he backdated a letter to before the caretaker period of government commenced, knowing that it would be used by a public servant to falsely represent that written authority had been given to authorise the purchase. That public servant was Watkins, Director General of the Department of Lands.\nThe property purchase was undertaken during the caretaker period of government – that period of time between the announcement of the calling of the state elections and the forming of the government after the elections. The NSW state elections were held on 25 March 2011. As the property purchase should not to be undertaken during the caretaker period, the legitimacy of authorisation was quickly raised within the senior levels of the public service. On 17 March 2011 the Director General of the Department of Premier and Cabinet NSW requested the Internal Audit Bureau (IAB) to investigate Watkins' authority to purchase the site and on 18 March 2011 Watkins was stood down from the public service. Subsequently, Watkins contacted Kelly and asked if he would sign a letter, backdated to 28 February 2011, that would authorise Watkins to purchase the Currawong property. The effect of the backdating of the letter was to convey that prior authority had been given by the NSW Premier Kristina Keneally on 25 February 2011, in her letter to Minister Kelly. Watkins claimed the letter to Kelly dated 25 February 2011 from Premier Keneally authorised the purchase of the site, and he acted on the direction of Minister Kelly's letter dated 28 February 2011. However, ICAC found that the Premier's letter only authorised negotiations and did not actually authorise Watkins to purchase the site. Further, ICAC's investigations confirmed that Kelly's letter to Watkins had been fraudulently backdated. ICAC also produced evidence that Watkins organised a secret rendezvous with staffer, Costello where he discussed his evidence. This action by Watkins took place despite ICAC warning Watkins not to discuss evidence and meet with other witnesses. This was also a breach of ICAC by Costello. ICAC's opinion was that the matter be referred to the Director of Public Prosecutions with respect to the prosecution of Watkins, Kelly and Costello for various criminal offences.\nArising from ICAC's investigation and DPP advice, it is significant that only Watkins would face criminal charges and be convicted. Watkins faced criminal charges in the NSW Local Court where it was reported he could have received 10 years imprisonment. Keneally testified that she only authorised Watkins to start negotiating with the developer who owned the property. She testified that he was not authorised to complete the purchase by agreeing to the $12 million deal. Keneally confirmed that Watkins proceeded without the authorisation from the executive level of government and it occurred when the government was in caretaker mode. Watkins faced court in December 2013. Two of the charges were dismissed by the Court.  However, Watkins was convicted on the further two charges of misleading ICAC, to which he had pleaded guilty and was placed on a 12-month good behaviour bond.\nANZLIC\nWatkins was Chairman of ANZLIC, the Australian New Zealand Land Information Council, 2000–2011, when he was dismissed from the NSW Public Service. ANZLIC labels itself as the Spatial Information Council and claims to be  \"the peak intergovernmental organisation providing leadership in the collection, management and use of spatial information in Australia and New Zealand.\"\nANZLIC chair appointments are typically only for two years, but Watkins held the chair for more than eleven. Drew Clarke immediately replaced Watkins as Chair of ANZLIC, after Watkins was stood down from the NSW government in March 2011 and formally sacked in July 2011. Clarke remained as Chair until mid 2015.\nSpatial Information Industry Action Agenda\nANZLIC, under Watkins’ chairmanship, instigated the national Spatial Information Industry Action Agenda and received federal ministerial endorsement. The objectives of the Action Agenda were to identify opportunities and impediments to the progress of the spatial information industry and to develop a policy framework that would underpin growth through a commercially successful and internationally competitive Australian industry.  Watkins during 1998-2000 worked closely with Gary Nairn, Member for Eden Monaro 1996-2007 and subsequently Special Minister of State 2006-07 to advocate federal government support for the agenda. Further, the Australian Spatial Information Business Association (ASIBA), now known the Spatial Information Business Association (SIBA), was active in lobbying and securing Nairn's and Watkins' support for the agenda. Nairn advocated the agenda to the Prime Minister and the Cabinet and was supported by ASIBA and ANZLIC  throughout. Arising from these efforts, Warren Entsch, then Parliamentary Secretary to the Minister for Industry, Science and Resources, launched the establishment of a steering group to drive the Spatial Information Industry Action Agenda in November 2000.\nThe Action Agenda was released in September 2001. Under the Spatial Information Industry Action Agenda, on 25 September 2001, then Minister for Industry, Science and Resources, Senator Nick Minchin announced a $2&nbsp;million Grant to a consortium of private \"spatial firms\" to increase the effectiveness of spatial information. ASIBA was identified as the industry body to lead most of the responsibility under the action agenda. Minchin also identified the key intergovernmental roles of ANZLIC under the Action Agenda. Nairn continued his support for the agenda until he lost his federal seat in November 2007 election.  Thereafter, he remained engaged through ASIBA.\nElizabeth O'Keeffe, the ANZLIC delegate for Victoria, represented Watkins on the steering committee for the Spatial Information Industry Action Agenda until July 2002, when she was reportedly sacked from her position as Executive Director, Land Victoria. It was also reported that O’Keeffe had approved an illegal $100,000 contract with ASIBA to “lobby her own Minister” Sherryl Garbutt to promote the Spatial Information Industry Action Agenda.  However, it was also disclosed in the Victorian Parliament that O'Keeffe's primary agenda in engaging the ASIBA lobbyist was to discredit the Surveyor-General as well as the professional and industry bodies, the Institution of Surveyors Victoria and the Association of Consulting Surveyors Victoria.  The contract was agreed between O'Keeffe and ASIBA and presumedly with the concurrence of O'Keeffe's superiors, Minister Garbutt and Department Secretary Chloe Munro.  Following adverse media and Opposition reporting, the contract was found to not be appropriate and was cancelled after the first tranche of $25,000 was paid to ASIBA.\nThe Cooperative Research Centre, CRC for Spatial Information (CRC-SI)\nUnder the national Spatial Information Industry Action Agenda, CRC-SI was established in 2003 and launched by Nairn after significant advocacy by ANZLIC led by Watkins and also ASIBA.  In its, 2011-12 Annual Report (page 12), CRC-SI reported that Watkins, a Director of CRC-SI since inception, had resigned from the CRC-SI Board following his retirement from the NSW Public Service.  The CRC-SI reporting was false as Watkins was officially sacked  by the NSW government.\nThe Australian Spatial Consortium (ASC)\nOn 14 August 2007, Nairn, in his role as Special Minister of State, announced the establishment of ASC, with initial membership including ANZLIC, ASIBA and CRC-SI.  Watkins was designated as Chairman of the ASC Steering Committee.  ASC was reported as being established “to accelerate the unlocking of the potential of spatial information for economic, environmental and social benefit for Australia within key industries, and the development of tools, new technologies and capabilities relating to the fundamental future needs of the nation.”  The actual role and achievements, if any of ASC, remain vague.\nHonours and awards\nWatkins was awarded the Member of the Order of Australia in the 2010 Australia Day Honours \"for service to spatial information and natural resource management through leadership roles within a range of public sector agencies\". He was also made an Honorary Fellow of the Institution of Surveyors NSW (ISNSW) in 2005. Other awards included Fellow of the Australian Property Institute, the Royal Institution of Chartered Surveyors and the Australian Academy of Technology and Engineering. However, his criminal convictions following the ICAC investigations led to him being stripped of some of the awards. On 23 October 2014, the Royal Institution of Chartered Surveyors expelled Watkins from the Institution and he automatically lost his Fellowship. The Commonwealth of Australia Gazette, 29 February 2016, issued notice that the Governor-General of Australia, Sir Peter Cosgrove, had terminated Watkins appointment as a Member of the Order of Australia. ISNSW suspended Watkins' Honorary Fellowship in 2019.\nDeath\nWatkins's died from cancer on 12 November 2019. The media reporting of his death reiterated his sacking from the NSW Public Service and his criminal convictions.\nReferences"
    }
  ]
}