{
  "content": [
    {
      "type": "text",
      "text": "# Warwick Senators\n\nWarwick Senators is an NBL1 West club based in Perth, Western Australia. The club fields a team in both the Men's and Women's NBL1 West. The club is a division of the Churches of Christ Sport & Recreation Association (CCSRA) and serves as the major administrative basketball organisation in the City of Stirling. The Senators play their home games at Warwick Stadium.\nClub history\nBackground\nThe creation of the Stirling Basketball Association began in the late 1960s when a group of 15–17-year-old boys from the Tuart Hill Junior Basketball Club formed a new club because there was no clear pathway for them to continue their basketball careers in the Western Australian Senior District Basketball Competition. Introduced to the sport of basketball at Tuart Hill High School, the boys dominated the state's junior competitions through the 1960s and provided the bulk of the Western Australian junior state team representatives. At that time, Tuart Hill was a feeder club for the Perth Basketball Club, the leading senior club in Western Australian basketball. Limited selection meant that many boys would be left with the prospect of not having a senior career in basketball after dominating the sport in the junior ranks. Led by Alan Simmonds, a number of boys from Tuart Hill approached the state association and proposed that a new district association be formed called the Stirling Basketball Association. The Stirling proposal was based on the incorporation of the Tuart Hill Boys and Norths Girls junior basketball clubs. The proposal was accepted and the Stirling Basketball Association was formed in 1971, providing a pathway for all Tuart Hill boys' and Norths girls' basketball players to enter the Western Australian Basketball Association senior competitions under the Stirling name.\nNicknamed the Senators, the inaugural Stirling 'A' Grade District men's team competed for the first time in the 1972 season. While Simmonds became the first Club President and team captain, Colin James from New South Wales became the team's first head coach. In 1974, the Senators men reached the grand final, where they lost to Swan Districts by 13 points. The following year, the team again made the grand final, this time winning 69–68 over Perth to claim their maiden premiership. Between 1974 and 1987, the Senators men competed in ten A-Grade grand finals, where they won four premierships (1975, 1978, 1981 and 1982). Additionally, the Senators women competed in eight A-Grade grand finals, where they won five premierships (1974, 1981, 1984, 1985 and 1988).\n1978 proved a milestone year as the club was selected to represent Western Australia in the National Australian Club Championships. This competition was a precursor to the NBL. At the 1978 Australian Club Championships in Adelaide, the Senators were the surprise team of the championships. While expected to lose early in the qualifying rounds, the team reached the final to become the first Western Australian team to do so. There they lost to the highly-credentialed Nunawading Spectres led by Bill Palmer and Alan Black, despite leading by a point at half time.\nSBL and NBL1 West\n1989 saw the formation of the State Basketball League (SBL) with both a men's and women's competition. Stirling, trading as the Senators, entered a team into both the Men's SBL and Women's SBL.\nIn 1990, the men's team played in their first and only SBL Grand Final, losing 114–91 to the Perth Redbacks. The women's team claimed the minor premiership in 1990 with a first-place finish a 20–4 record before going on to lose the SBL Grand Final 70–67 to the Wanneroo Wolves. In 1993, the women returned to the SBL Grand Final, where they lost 68–51 to the Swan City Mustangs.\nIn 1994, the women's team played in their third SBL Grand Final and won their maiden championship with a 72–59 win over the Perry Lakes Hawks. The team was led by coach Kim Redshaw and centre Fiona Robinson.\nIn 2007, the women's team won their second minor premiership with a 20–2 record before reaching their fourth SBL Grand Final, where they lost 66–40 to the Perry Lakes Hawks.\nIn 2012, Stirling Basketball Association came under the umbrella of the Churches of Christ Sport & Recreation Association (CCSRA). In 2019, the club rebranded from the Stirling Senators to the Warwick Senators.\nIn the 2019 season, the women's team reached the SBL Grand Final, where they lost 85–56 to the Rockingham Flames.\nIn 2020, the men's team finished as minor premiers in the amateur-based West Coast Classic. They reached the grand final, where they defeated the Perry Lakes Hawks 96–81. It marked the men's team's first-ever title.\nIn 2021, the SBL was rebranded as NBL1 West.\nIn 2022, the women's team finished as minor premiers with an 18–2 record and reached the NBL1 West Grand Final, where they defeated the Willetton Tigers 87–61 to win their first championship in 28 years. At the NBL1 National Finals, the Senators went undefeated and won the NBL National championship after defeating the Ringwood Hawks 83–75 in the grand final. The team was led by coach Jonelle Morley, guard Stacey Barr and forward Leonie Fiebich.\nIn 2025, the Senators men and women both reached the NBL1 West Grand Final, marking the men's team first appearance in an SBL / NBL1 West Grand Final since 1990. Both teams went on to finish runners-up, with the men losing 81–78 to the Geraldton Buccaneers and the women losing 91–71 to the Cockburn Cougars.\nNotable club figures\nIn July 2014, the Senators retired Mike Ellis' No. 6 jersey. Ellis began playing for Stirling in 1974 at the age of 17, going on to contribute at every level including coaching and serving in leadership roles.\nIn July 2018, the Senators retired Carmie Olowoyo's No. 42 jersey. Olowoyo played over 260 games for the Senators, beginning his career in 1995 before ending his career in 2010.\nAccolades\nWomen\n*Championships: 2 (1994, 2022)\n*Grand Final appearances: 7 (1990, 1993, 1994, 2007, 2019, 2022, 2025)\n*Minor premierships: 3 (1990, 2007, 2022)\nMen\n*Championships: Nil\n*Grand Final appearances: 2 (1990, 2025)\n*Minor premierships: Nil\nReferences\nExternal links\n*[https://warwicksenators.com.au/ Official website]\n*[https://nbl1.com.au/news/senators-bloodlines-run-strong \"Senators' bloodlines run strong\"] at nbl1.com.au"
    }
  ]
}