{
  "content": [
    {
      "type": "text",
      "text": "# Warwick Parkway railway station\n\n| grid_name           = Grid reference\n| grid_position       =\n| manager             = Chiltern Railways\n| platforms           = 2\n| code                = WRP\n| classification      = DfT category D\n| years               = 25 October 2000\n| events              = Opened\n| mpassengers =\n0.612 million}}\n52,272}}\n0.271 million}}\n0.377 million}}\n0.443 million}}\n| footnotes           = Passenger statistics from the Office of Rail and Road\n|mapframe=yes\n|mapframe-zoom = 13\n}}\nWarwick Parkway is a railway station with park and ride facilities on the western outskirts of Warwick in Warwickshire, England.  It also serves the village of Budbrooke. Unusually, the station is not owned by Network Rail but by Warwickshire County Council.\nWarwick is also served by the older Warwick railway station in the town centre.\nHistory\nWarwick Parkway was opened on 25 October 2000. It was opened with park and ride facilities alongside the A46 and A4177 roads in order to encourage commuters to use the train, and to compensate for the lack of parking spaces at the nearby  and  stations. It was financially supported by Warwickshire County Council. Planning permission was given for the station in March 1999, following a public inquiry in October 1998.\nFacilities\nEach platform at the station has a real-time electronic information departure screen.\nThe station is staffed for much of the day and there are self-service ticket machines as well as a permit to travel machine just inside the entrance to the station. A subway links northbound and southbound platforms. Also there is a small cafe selling drinks and snacks.\nThere is also a National Express coach stop outside the station with regular links to Heathrow and Gatwick airports. The nearest village to the station is Hampton Magna, about  from the station.\nThe station originally had 737 car parking spaces. Another 222 places were added in 2012 at a cost of £2.5&nbsp;million. Work on the project started on 25 June 2012. Additional spaces were made available in phases from 29 October 2012 with an official opening in late November 2012.\nServices\nThe station is served by Chiltern on its London Marylebone to Birmingham (Moor Street or Snow Hill) service, which usually calls at half hourly intervals, this is augmented by a few West Midlands Trains services between Birmingham and Leamington at peak periods.\nReferences\nExternal links\n* [http://railwaystations.fpic.co.uk/c1027018.html Photos of Warwick Parkway Station]\n*[http://www.railaroundbirmingham.co.uk/Stations/warwick_parkway.php Rail Around Birmingham and the West Midlands: Warwick Parkway station]\n}}\n|next=Warwick|route=Chiltern RailwaysChiltern Main Line fast services|col=}}\n|route=Chiltern RailwaysLeamington Spa to Stratford-upon-Avon|col=}}\nLimited Service |route=West Midlands RailwayLeamington-Worcester |col= }}"
    }
  ]
}