{
  "content": [
    {
      "type": "text",
      "text": "# Warya\n\n| languages              = Kutchi, Rajasthani, Sindhi, Punjabi\n| country                =\n| region                 = Punjab, Sindh, Gujarat, Rajasthan\n| India_migration        =\n| population             =\n| family_names           =\n| feudal_title           =Rana, Malik, Khan, Chaudary\n| heraldic_title         =\n| lineage                =\n| subdivisions           =\n| related                =\n}}\nThe Warya (also known as Varya and Varah) is a Rajput and Jat clan found predominantly in the Punjab and Sindh provinces of Pakistan and in the state of Gujarat in India.\nIn the 9th century C.E, Varah and Panwar Rajputs of Bathinda attacked Tanot, the then capital of Bhati dynasty in western Rajasthan. This resulted in the fall of Tanot and the death of its ruler.\nOrigins\nThe Varya or Baria had a number of origin myths . They generally place themselves within the Suryanvanshi division of the Rajputs. It seems that there original settlement was in Patiala. The name Baria / Varya is very likely  derived from the Sanskrit word Varaha which means boar, which was very likely their totem. Another form of the name appears to be Warah, which is used by those of Jalandhar.\nThere is general agreement that the ancestor of the tribe was Binepal of Bhatinda, and had emigrated at a very distant past from Udaipur. The Varya are descendants of Warah, whose grandson Rājā Banni Pāl, is said to have founded Bhatinda, after conquering Bhatner and marrying the daughter of its Rajā. Banni Pāl's son Udasi was defeated by a king of Delhi but received a jagir. His son Sundar had seven sons, of whom the eldest founded Badhar in Nabha. (Cf. Barian).\nAccording to another tradition, the tribe is descended from a Warah, whose grandson Rajah Banni Pal, who is said to have founded Bhatinda, after conquering Bhatner and marrying the daughter of the Raja. In Jallandhar, the Varya had a tradition that their ancestor Mal, a descendent of Raja Karan of the Mahabharata, came from Jal Kahra in Patiala in around 1500. Most Varya Rajputs consider themselves to be Rajputs of the Suryanvashi lineage. The Varya may be connected with the Barhaiya Rajputs of Azamgarh and Ghazipur districts in Uttar Pradesh, who also connect themselves with Udaipur.\nHistory\nRai Kalu of Kakra near Bhawanigarh was said to be the first Varya chief to have embraced Islam in the reign of the Emperor Akbar. Different groups of Varya then  began to convert, but there are many Varyas who are still Hindus such as those of Bakhtri in what is now Sangrur District. In the Patiala State, the Varya, both Hindu and Muslim owned nearly 30 villages in the tehsils of Sunam, Bhawanigarh and Amargarh. At the beginning of the 20th century, they were organized along chhats or villages of the first rank and makans or villages of the second rank, other villages being inferior to these in social status. The author of the Patiala Gazetteer wrote the following:\n}}\nAccording to another tradition, the tribe is descended from a Warah, whose grandson Rajah Banni Pal, who is said to have founded Bhatinda, after conquering Bhatner and marrying the daughter of the Raja. Banni Pal's son Udasi was defeated by a Sultan of Delhi but latter received a jagir. His son Sundal had seven sons, of whom the eldest founded Badhar in Nabha.\nMalwa Ithass states that Raja Vineypal Variah, who was a descendant of Vikramaditya, built the fort of Bhim Garh, that evolved into the town of Bathinda on the banks of the Sutlej in 655 CE and established his rule. This rule contained property from Bhatner, Lahore, Sarhind, Mandlik, Licchabadi, Thanesar, Bhadhaur, Dango, Peshawar, and most of Punjab. This kingdom had two capitals, one at Batthinda and one at Lahore. It also states that Variah was a son of Varga, 26th generations down from Bikarmaditya. Variah's descendants were Taskmas, Ajaypal, Abhaiypal, Vineypal, Lakhanpal, Rattanpal, Naiyapal, Nainpal, Vijaypal, Jashpal, Satpal and Gunpal. During the reign of Emperor Aurangzeb, most of the Varya tribe converted to Islam.\nPopulation\nAfter the partition of Punjab in 1947, a large population of  Muslim Varyas migrated to western Punjab in Pakistan, where they are found in various districts such as Faisalabad and Sahiwal.\nAccording to the 1901 Census of India: }}\nSee also\n*Muslim Rajputs\n*Sindhi tribes\n*Punjabi tribes\nReferences"
    }
  ]
}