{
  "content": [
    {
      "type": "text",
      "text": "# Washington State Department of Agriculture\n\n| jurisdiction         = Washington\n| headquarters         = Olympia, Washington\n| coordinates          =\n| motto                =\n| employees            = 755 (2013)\n| budget               = US$151 million (2013)\n| chief1_name          = Derek Sandison\n| chief1_position      = Director\n| chief2_name          = Patrick Capper\n| chief2_position      = Deputy director\n| chief3_name          = Dr. Brian Joseph\n| chief3_position      = State veterinarian\n| website              =\n| footnotes            =\n}}\nThe Washington State Department of Agriculture (WSDA) is a cabinet-level agency in the government of Washington which regulates, advocates, and provides services for the state's agricultural industry. The agency was established in 1913 and is headquartered in Olympia, Washington. The current director of the WSDA is Derek Sandison.\nHistory\nThe Washington State Department of Agriculture (originally known as the Washington Agriculture Commission) was established in 1913.\nIn 1915, the state legislature granted the WSDA authority to create and enforce grading standards for apples and other tree fruit packed in the state. The grading system for apples was the first of its kind in the United States. The United States Department of Agriculture adopted national grade standards for apples in 1923.\nIn 1980, the WSDA began an apple maggot control program in order to prevent the pest from establishing itself in eastern Washington, an important apple-growing region. The program consists of an Apple Maggot Quarantine Area, which establishes a pest-free area. The agency also deploys apple maggot traps to a selection of sites in the state. The boundaries of the quarantine area are altered when the apple maggot is discovered in the pest-free area.  , the apple maggot has never been detected in fruit packed commercially in the state.\nFollowing the passage of Washington Initiative 502 in 2012, the WSDA provides services for the state's recreational cannabis industry. The agency inspects cannabis edible processing facilities and maintains a list of pesticides which are allowed to be used by cannabis growers in Washington. In coordination with the state Liquor and Cannabis Board, the WSDA tests retail cannabis for pesticides. Over 40% of samples tested by the agency contain illegal levels of pesticide. Washington does not require all cannabis to be tested, instead the WSDA conducts random tests and investigates complaints. The WSDA plans to provide a service similar to organic certification for cannabis beginning in 2019.\nSee also\n*Washington Apple Commission\nReferences\nExternal links\n*"
    }
  ]
}