{
  "content": [
    {
      "type": "text",
      "text": "# Wayne Warga__disambig_1\n\n| birth_place = Los Angeles, California\n| death_date  =\n| death_place = Los Angeles, California\n| education   = University of Southern California (1960)\n| occupation  = Author, journalist, and Foreign Correspondent\n| credits     = Life magazineLos Angeles TimesUSA Today: The Television ShowEntertainment TonightReturn to Earth (novel, written with Buzz Aldrin), 1986Natalie: A Memoir by Her Sister (with Lana Wood) (novel), Hardcover (novel), 1986Fatal Impressions (novel), 1989Singapore Transfer (novel), 1991\n}}\nWayne Philip Warga (January 26, 1938 – April 27, 1994) was an American author, journalist, and foreign correspondent who wrote largely about entertainment and penned several novels.\nWarga was a foreign correspondent for Life magazine, covering hotspots from Cuba to East Berlin, was assistant editor of the \"Calendar\" section of the Los Angeles Times in the 1970s, wrote for the television program USA Today: The Television Show, and was the head writer for Entertainment Tonight/Entertainment This Week.\nHe later turned to books, writing both non-fiction and fiction. His nonfiction works included Return to Earth (1973) with astronaut Buzz Aldrin, which was later made into a movie, and Natalie: A Memoir by Her Sister (1984) with actress Natalie Wood's sister Lana Wood. Warga also wrote three mysteries: Hardcover (1986), for which he earned a Shamus Award, Fatal Impressions (1989), and Singapore Transfer (1991).\nPersonal life\nWarga was born to Wayne Arlington Warga, a studio employee, and Alma Joyce Warga Kelsey (Smith), a homemaker. Warga married Carol Reese, an artist and editor, on November 27, 1965, and was the father of writer, lecturer, and radio producer, Jake Warga. Warga was a collector of contemporary art and an avid fan of flying.\nIllness and death\nIn 1990, Warga fell ill from a contaminated batch of L-tryptophan manufactured by a Japanese company and distributed in the United States and eventually died after prolonged battle with cancer and several rounds of chemotherapy.\nAward\n*Shamus Award for Best First P. I. Novel, \"Hardcover\" (1986)\nReferences"
    }
  ]
}