{
  "content": [
    {
      "type": "text",
      "text": "# Wayward Souls\n\nPC\n| platforms =\n| image     = Wayward Souls logo.png\n| caption   =\n| alt       =\n| publisher = Rocketcat Games\n}}\nWayward Souls is a 2014 action-adventure video game developed by Rocketcat Games. It is a follow-up and spiritual successor to their Mage Gauntlet and was released for iOS and Android. A Windows version was later released in 2019. The gameplay resembles that of The Legend of Zelda: A Link to the Past crossed with the randomly generated dungeons of a roguelike and the escalating challenge of the Dark Souls series. Rocketcat has continued to update the game since its launch, adding new playable characters and increasing the base price of the game. Currently, the game has six playable characters.\nGameplay\nFor each session the player chooses one of six characters: the Warrior, Mage, Rogue, Adventurer, Spellsword, or Cultist. Each character has a unique attack style and set of special abilities. The player enters a procedurally generated two-dimensional dungeon divided into several floors, each containing rooms full of enemies. The player is frequently locked into a room upon entry and must kill all enemies in the room to continue. Combat involves striking enemies with basic melee or ranged attacks, \"power attacks\" that must be recharged, and consumable items; all while positioning oneself to minimize damage from enemies. Floors can also contain traps, treasure chests, forges to upgrade the player's weapons, and story-related encounters. At the end of each floor, the player regenerates a small amount of health.\nIf the player is killed, all items and upgrades found in the current run through the dungeon are lost, and the player must start again on the first floor. However, any coins found are retained and can be used to purchase permanent upgrades for a particular character. The final upgrade for each character provides a unique benefit to all six characters.\nAt the end of the final floor, the player faces a boss. Defeating the boss unlocks a new, more difficult dungeon. The bosses and related overarching story are the same for all characters: the tower the player explores has become cursed after its occupants unearthed certain magical artifacts. However, each character has a unique story as well, revealed through text interludes and scripted encounters at milestones in the dungeon.\nCritical reception\n| rev1 = TouchArcade\n| rev1Score = iOS:\n}}\nThe game has a Metacritic rating of 87/100 based on 19 critic reviews. Wayward Souls was TouchArcade 2014 Game of the Year. At the 2014 National Academy of Video Game Trade Reviewers (NAVGTR) awards the game was nominated for the Game, Original Role Playing category.\nReferences"
    }
  ]
}