{
  "content": [
    {
      "type": "text",
      "text": "# Wayward Angel\n\n| recorded   = Australia\n| studio     =\n| genre      = Country\n| length     = 54:13\n| label      = Essence, Warner Bros.\n| producer   = Nash Chambers\n| prev_title = Barricades & Brickwalls\n| prev_year  = 2001\n| next_title = Carnival\n| next_year  = 2006\n| misc       =\n}}\n}}\nWayward Angel is the third studio album by Australian singer Kasey Chambers, released by Essence Records in Australia on 31 May 2004. Chambers wrote most of the album, three songs co-written by her then husband Corey Hopper and her brother Nash Chambers produced the album – who had previously produced her first two solo albums. The album differs from her previous two because Chambers became a mother and she states it is the \"most life changing things that you go through\" and she did not feel any pressure recording the album. It debuted on the Australian ARIA Albums Chart at number-one making it Chambers second number-one album but the sales did not match up to her previous album Barricades & Brickwalls (2001) which was certified seven times platinum by ARIA.\nThe singles released from the album gave Chambers minor success in Australia. \"Hollywood\" was the first single released and became Chambers fifth top forty hit in Australia. \"Pony\" was released at the start of 2005 and became Chambers third top ten single in Australia. The last single released was \"Saturated\" and was a minor hit peaking in the top one hundred. The album saw Chambers nominated for four ARIA Awards including Best Cover Art, Album of the Year, Best Country Album and Best Female Artist in 2004.\nWriting and content\nThe album saw Chambers co-write with her then husband Corey Hopper. These tracks include \"Follow You Home\", \"Guilty as Sin\" and \"More Than Ordinary?\" about a rejected lover. She states \"It was good fun writing with him [Hopper] because I don't normally co-write. I have tried to do it in the past. I've done a little bit of songwriting with my dad and one of my mates. I found it a lot more comfortable writing with someone I know really well. You are pouring your heart out and giving them your deepest darkest secret and feelings. It is hard to sit down with a total stranger and do that. None of the songs I wrote with Corey were planned moments. We just sat down and they feel out.\" Chambers recorded seventeen songs for the album and only fourteen made it onto the album Since most of her favourite albums contained twelve tracks she wanted that many tracks on the album but then realised  she could not part with any of them.\nThe title track \"Wayward Angel\" was written about Chambers son Talon Jordi and states the song's meaning is she will not always be perfect but she will always be there for him. The song \"Paper Aeroplane\" was about a man losing his wife to cancer, she states \"I was watching television one night and there was an interview with an old man who had lost his wife to cancer. It was just a really beautiful story in the way he told it and remembered her. It was just moving enough for me to sit down and write that song.\" The first track \"Pony\" features baritone guitar by Steuart Smith who has also worked with the Eagles and Shawn Colvin.\nReception\nThe album debuted at number-one on the Australian ARIA Albums Chart on 7 June 2004 with sales of 25,885 copies, knocking Under My Skin by Avril Lavigne off the top spot. It was certified platinum by ARIA on its first week and also topped the Australian Country Chart, knocking her previous album off number-one. The album went to spend five weeks at number-one being knocked off to number five by ''For All You've Done by Hillsong Church and it spent thirty-six weeks in the top fifty, re-entering five times. Wayward Angel spent fifty-four weeks in the albums top one hundred, certified triple platinum by ARIA, was the twentieth highest selling album in Australia for 2004 and the eighty-second highest selling album in Australia for 2005. The album failed to chart on the Billboard'' 200 but peaked at number thirty-one of the Top Country Albums spending eight weeks in the charts.\nAllMusic stated that Chambers \"manages the not-unremarkable accomplishment of splitting the difference between Emmylou Harris's crystalline purity and Lucinda Williams's rough-hewn emotional honesty\". They also state that her \"songwriting is no less remarkable, and connects in much the same way, chronicling matters of the heart and soul in a manner that achieves a genuine and unaffected beauty with just a dash of the truthful messiness that comes with being human\".\nAccolades\nThe album and its tracks received four ARIA Award nominations. All of the ARIA Awards were at the 2004 awards:\n*Album of the Year – awarded to Get Born by Jet\n*Best Female Artist – won\n*Best Country Album – won\n*Best Cover Art\" – awarded to The Dissociatives by the Dissociatives\nThe album and its tracks received two APRA Award nominations. All of the APRA Awards were at the 2005 awards:\n*\"Most Performed Country Work\" (Like a River) – won.\n*\"Most Performed Country Work\" (Hollywood) – awarded to \"Like a River\" by herself.\nTrack listing\nPersonnel\n*Mick Albeck – fiddle\n*Kerry Buchanan – drums\n*Bill Chambers – dobro, lap steel guitar, harmony\n*Kasey Chambers – harmony\n*Nash Chambers – producer, engineer, mixing, harmony\n*Sunil DeSilva – percussion, tambourine\n*Clayton Doley – Hammond organ\n*Glen Hannah – acoustic guitar, harmony\n*Ian Jennings – photography\n*Bob Ludwig – mastering\n*Mathematics – design\n*Jeff McCormack – bass, engineer, mixing\n*R. McCormack – acoustic guitar, banjo, guitar, mandolin, mandocello, harmony, guitar (resonator), papoose\n*Mark Punch – electric guitar, harmony\n*Bill Risby – piano\n*Kieran Darcy Smith – photography\n*Steuart Smith – acoustic guitar, electric guitar, baritone guitar\n*Kym Warner Mandolin – mandolin\n*John Watson – drums\n*Carol Young – harmony\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\"\n|+Weekly chart performance for Wayward Angel\n! scope=\"col\"| Chart (2004–2006)\n! scope=\"col\"| Peakposition\n|-\n|\n|-\n!scope=\"row\"|US Billboard Top Country Albums\n|align=\"center\"|31\n|-\n!scope=\"row\"|US Billboard Top Heatseekers\n|align=\"center\"|15\n|}\nYear-end charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+Year-end chart performance for Wayward Angel\n! scope=\"col\"| Chart (2004)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Australian Albums (ARIA)\n| 20\n|-\n! scope=\"row\"| Australian Country Albums (ARIA)\n| 1\n|-\n! scope=\"col\"| Chart (2005)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Australian Albums Chart\n| 82\n|-\n! scope=\"row\"| Australian Country Albums Chart\n| 2\n|-\n! scope=\"col\"| Chart (2006)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Australian Country Albums Chart\n| 46\n|}\nCertifications\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|+Release history and formats for Wayward Angel\n! scope=\"col\"| Country\n! scope=\"col\"| Date\n! scope=\"col\"| Label\n! scope=\"col\"| Format\n! scope=\"col\"| Catalog\n|-\n! scope=\"row\"| Australia\n| 24 May 2004\n| Essence\n| CD\n| 5713982\n|-\n! scope=\"row\"| United States\n| 14 September 2004\n| Warner Bros.\n| CD\n| 48811\n|}\nReferences"
    }
  ]
}