{
  "content": [
    {
      "type": "text",
      "text": "# Weewarrasaurus\n\n| taxon = Weewarrasaurus\n| image = Weewarrasaurusholotype.jpg\n| image_caption = Photos and 3D renders of the holotype\n| authority = Bell et al., 2018\n| type_species = Weewarrasaurus pobeni\n| type_species_authority = Bell et al., 2018\n}}\nWeewarrasaurus is a genus of ornithopod dinosaur from the Late Cretaceous of the Griman Creek Formation near Lightning Ridge, in New South Wales, Australia. The type and only species is W. pobeni, known from the holotype, an isolated  preserved in opal, as well as a secondary referred dentary. It is thought to have co-existed with multiple other ornithopods of different sizes and lineages.\nDiscovery and naming\n, where the only known fossils of Weewarrasaurus were found]]\nThe type specimen (the specimen on which the species was first recognised), specimen number LRF 3067, consists of two sections of a jawbone with teeth. It was first discovered in 2013 by miners. They found the specimen in a mine at the Wee Warra geologic locality of the Griman Creek Formation, near the town of Lightning Ridge, New South Wales, Australia during a routine mining run, and it was broken during excavation. Opal dealer Mike Poben, from Adelaide, first recognised it as a fossil, after acquiring it in a bag of rough opals received from the miners. The specimen was noted for being preserved in green-blue opal, a gemstone for which the region is well known. Palaeontologist Phil Bell was shown the specimen in 2014 and remarked upon its significance, and so Poben donated it to the Australian Opal Centre, which has the world's largest collection of opal fossils.\nBell and colleagues later named it as a new genus and species in a study published on December 4, 2018, which reviewed the ornithopod fossil record for the Griman Creek Formation, which includes the mine. The generic name Weewarrasaurus refers to the Wee Warra fossil locality where the fossils were found, and the Greek word saurus, meaning lizard. The specific name, W. pobeni, honours Poben. The opal banding on the fossil was used to confirm that both parts of the dentary, which do not form a continuous sequence, were from the same individual. These bands also allowed investigation of how far apart in the jawbone the two sections were originally. In addition to the opal type specimen, or holotype, the researchers assigned a second partial jawbone, specimen LRF 766, to the new species, due to the similar tooth morphology. It was found in the Holden's locality on the Three Mile opal field, also near Lightning Ridge and part of the Griman Creek Formation.\nReferences"
    }
  ]
}