{
  "content": [
    {
      "type": "text",
      "text": "# Welfare colonialism\n\nWelfare colonialism is a form of colonialism where investments by the colonizer in the native population, ostensibly intended to improve their quality of life, contribute to the dissolution of indigenous institutions thus perpetuating dependency and creating a permanent underclass. Though usage of the term dates from the 1950s, the concept is often associated with anthropologist Robert Paine, who expanded and developed it while observing the failed economic integration of the native population in Northern Canada.\nIn welfare colonialism, subjugated peoples typically remain impoverished despite huge sums invested nominally for their welfare while their standard of living declines. The concept has been used to explain the ongoing poverty and low living standards of native populations in many countries, particularly those that have been subject to settler colonialism.\nFeatures\n, formed to combat policies associated with Welfare Colonialism.]]\nThe features of welfare colonialism are:\n# A reversal of the traditional colonial model, so that funds flow from the colonizer to the native population rather than the reverse; these funds support development of the social institutions of the colonizer in native communities.\n# Forced integration of the native population into the society of the colonizer in ways that radically undermine traditional livelihoods and social structures;\n# Attempts to remedy the resulting social disintegration of the native population through welfare, unemployment and other systems of benefits, as well as introducing the colonizer’s education, health and housing systems which further erode traditional native society.\nAccording to anthropologist Robert Paine,\nExamples\nCanada\nMuch of the work on welfare colonialism is based on the experience of the Inuit in the 1960's and 70's as the Canadian government sought to simultaneously engage, control and support native communities, a change from prior policies of forced relocation and residential schools. Though the new policies involved the community in policymaking, it was clear to both government representatives and native leaders that the old relationship of colonizer to subject was still in effect, in particular the overhanging notion of 'civilizing' and 'Canadianizing' the Inuit. Teachers, nurses and counselors sent to Inuit communities were trained in Canadian, not native, institutions and frequently had little awareness of Inuit language and traditions, leading to detrimental outcomes.\nSome social welfare and health issues which colonial culture typically sees as medical problems are, in indigenous communities, more successfully addressed through non-medical responses involving the community as a whole. Youth suicide and alcoholism in indigenous communities are examples of issues where substantial investments by the colonial government to replicate treatments used in their society have not yielded favorable results while community responses based on traditional structures and practices have been more effective.\nUnited States\nThe term Welfare Colonialism was used to critique Great Society anti-poverty programs in the 1960's and 70's, often by community activists though also by government officials charged with implementing these programs. Welfare colonialism in this context often referred specifically to the introduction of social workers and other professionals from outside the community rather than to the creation of new colonial institutions.\nRelatively little has been written about the role Welfare Colonialism played in the debasement of Native American tribal institutions and by extension their quality of life. Two studies have been published on the Seminole tribe. More attention has been paid to the ways in which provision of medical care to native communities in Alaska has been undercut by a lack of awareness as to how the communities actually operate, which can exacerbate life-threatening conditions such as youth suicide\nAustralia\nIn Australia, aboriginal people have long been subjected to forms of welfare colonialism. Although granted full citizenship in 1962, Aboriginal people often live in circumstances described as 'shocking' despite the investment of hundreds of millions of dollars in efforts to promote their welfare. Understanding why this investment had so little effect on Aboriginal quality of life is a major issue for Australian policymakers. According to anthropologist Nicolas Peterson, \"the concept that both addresses this problem directly and proposes an explanation is that of welfare colonialism. The central proposition of welfare colonialism is that the granting of the social rights of citizenship to indigenous people in first world nation-states is, unintentionally, as debilitating as it is beneficial because of the social and political dependencies it creates.\"\nAnthropologist Jeremy Beckett spent decades working with the Torres Strait Islanders, an aboriginal group, and observed that \"another contradictory feature of welfare colonialism is its need to secure the assent of the subjects as evidence of their political enfranchisement ... Ironically, the subjects are often so politically weak and fragmented that the state itself is obliged to create channels of political expression and articulate indigenous' aspirations. In other words, political incorporation of the indigenous minority within the nation state can be effected only through special structures, which institutionalize colonial distinctions, while creating a political constituency which has to be simultaneously maintained and controlled.\" This closely mirrors the experiences of the Inuit, supporting the contention that this phenomenon is not unique but rather a recognizable facet of colonialism worldwide.\nRelated concepts\nInvestments by the colonizer in native communities in colonies without substantial settler populations can be referred to as Development Colonialism. Development Colonialism focuses not on improving the health and welfare of the native population directly but rather on large-scale infrastructure projects such as electrification and road-building. These activities are often undertaken in advance of decolonization, such as in areas of Africa following the Second World War.\nSee also\n* Civilizing mission\n* Internal colonialism\n* Settler colonialism in Canada\nReferences"
    }
  ]
}