{
  "content": [
    {
      "type": "text",
      "text": "# Wen Yanbo (Tang dynasty)\n\n| death_place =\n| other_names =\n| relations =\n| children =\n| occupation = Statesman\n}}\nWen Dalin (574 – 1 July 637), courtesy name Yanbo, better known as Wen Yanbo, posthumously known as Duke Gong of Yu, was a Chinese official who lived in the early Tang dynasty. He was a key advisor to the Tang dynasty's founding emperor, Emperor Gaozu, and served as a chancellor during the reign of Gaozu's successor, Emperor Taizong. He was captured by the Göktürks and lived among them for years. After he was freed, he drew on his experiences to provide advice to Emperor Taizong on the Tang Empire's policies towards the Göktürks.\nDuring the Sui dynasty\nWen Yanbo was born in 574, during the waning years of Northern Qi. His father Wen Junyou (溫君攸) was one of the literary talents retained by the last Northern Qi emperor to wield power over the entire realm, Gao Wei. Later, after Northern Zhou destroyed Northern Qi in 577 and was in turn itself overthrown in favor of the Sui dynasty in 581, Wen Junyou served as the military assistant for the governor of Si Province (泗州, roughly modern Suzhou, Anhui), but retired under the excuse of illness when he believed that Sui rule was not proper.\nWen Yanbo had at least one older brother, Wen Daya (溫大雅), and at least one younger brother, Wen Dayou (溫大有; died 618). All three became known for their abilities, and the Sui official Xue Daoheng (薛道衡), after once meeting the three, remarked, \"All three are capable of becoming imperial advisors or chancellors.\" Wen Yanbo himself was particularly considered a capable scribe, and was said to be also alert and capable of debating. Toward the end of the Kaihuang era (581-600) of Emperor Wen, he entered the imperial examinations and was rated highly. He became a junior official at the legislative bureau of the government (內史省, Neishi Sheng''). It is not known exactly how he ended up at Zhuo Commandery (涿郡, roughly modern Beijing) near the end of the reign of Emperor Wen's son Emperor Yang, but he, like most imperial officials, might have accompanied Emperor Yang there on one of Emperor Yang's campaigns against Goguryeo (as Zhuo Commandery served as the headquarters for the overall operation) and stayed there. After the general Luo Yi rebelled against Emperor Yang in 617 and took over Zhuo Commandery (renaming it You Prefecture (幽州)) and the surrounding area, Wen joined Luo's headquarters and served as Luo's military assistant.\nDuring Emperor Gaozu's reign\nIn 618, news arrived at You Prefecture that Emperor Yang had been killed in a coup at Jiangdu (江都, in modern Yangzhou, Jiangsu) led by the general Yuwen Huaji. Yuwen sent messengers to Luo Yi suggesting that he submit to the new regime that Yuwen led after Yuwen declared Emperor Yang's nephew Yang Hao the Prince of Qin emperor. Luo, although he himself had rebelled against Emperor Yang, stated, \"I am still a Sui subject.\" He executed Yuwen's messengers and then also rejected overtures from agrarian rulers Dou Jiande the Prince of Xia and Gao Kaidao the Prince of Yan. Instead, apparently with Wen Yanbo's advocacy, he decided to submit to another former Sui general, Li Yuan, who had also rebelled against Emperor Yang in 617 but who by now had taken over the western parts of the empire and established Tang dynasty at Chang'an as its Emperor Gaozu. Emperor Gaozu accepted Luo's submission and created him the Prince of Yan, granting him the imperial clan name of Li (and he thereafter became known as Li Yi) and making him the commandant at You Prefecture. As Wen had supported Li Yi's decision to submit, Emperor Gaozu made Wen the secretary general of You Prefecture and created him the Duke of Xihe, and soon summoned him to Chang'an to serve as a Zhongshu Sheren (中書舍人), a mid-level official at the legislative bureau (by this point renamed 中書省, Zhongshu Sheng). At that time, Wen Yanbo's older brother Wen Daya served as the deputy head of the legislative bureau, and the two brothers lived close by. This was considered an unusual honor. When Goguryeo offered tributes to Emperor Gaozu, Emperor Gaozu considered declining the tributes and not treating Goguryeo as a subject but as an equal (to endear himself to Goguryeo's King Yeongnyu). Wen Yanbo opposed, stating:\n:The Liaodong region was originally the domain of Jizi during Zhou dynasty, and Xuantu Commandery during the Han dynasty. If you do not treat it as a vassal, how would the other barbarian tribes be willing to submit to you?\nEmperor Gaozu thus accepted Goguryeo's tributes, effectively treating King Yeongnyu as a subject.\nIn 625, Eastern Tujue's Jiali Khan Ashina Duobi attacked Ling Prefecture (靈州, roughly modern Yinchuan, Ningxia). Emperor Gaozu sent the general Zhang Jin (張瑾) to resist Ashina Duobi, with Wen serving as Zhang's secretary general. When Zhang engaged Ashina Duobi, however, he suffered a major defeat, and Wen was captured. As Wen was an important official, Ashina Duobi put him under interrogation and asked him about the strengths and weaknesses of the Tang state. Wen refused to answer, and Ashina Duobi moved him to the Yin Mountains region.\nDuring Emperor Taizong's reign\nIn 626, Emperor Gaozu's son and major general Li Shimin the Prince of Qin ambushed his brothers Li Jiancheng the Crown Prince and Li Yuanji the Prince of Qi (who supported Li Jiancheng) at the Incident at Xuanwu Gate, and then effectively forced Emperor Gaozu to yield the throne to him (as Emperor Taizong). Wen Yanbo's brother Wen Daya was a supporter of Emperor Taizong, and in fall 626, Emperor Taizong, who had just made peace with Eastern Tujue, made a demand to Ashina Duobi that he return the Chinese people that Tujue had seized and Wen Yanbo. Soon thereafter, Ashina Duobi returned Wen Yanbo, and Emperor Taizong made him the secretary general of the capital prefecture, Yong Prefecture (雍州), and then the assistant minister of civil service affairs. Wen wanted to carry out a major reduction of the civil service system to reduce waste, and this brought many accusations of unfairness from officials as well as criticism that he was overly obsessed with details. However, Emperor Taizong soon made him the deputy head of the legislative bureau, and then made him, in addition, the imperial censor.\nIn 627, when the important official Wei Zheng was accused of nepotism, Emperor Taizong ordered Wen to investigate. After Wen's investigation turned up no evidence of wrongdoing on Wei's part, Wen nevertheless stated to Emperor Taizong, \"Wei did not care about public perception or appearance of conflict of interest. Even though he had no wrongful intent, he should still be rebuked.\" Emperor Taizong agreed and rebuked Wei, but Wei bluntly refused to accept the rebuke, and Emperor Taizong later retracted the rebuke after concluding that Wei was correct.\nIn 628, there was an incident where Emperor Taizong had the official Zu Xiaosun (祖孝孫) teach his ladies in waiting music, and when the ladies in waiting could not learn it well, rebuked Zu. Wen and the chancellor Wang Gui spoke against the rebuke, stating that it was not appropriate for Emperor Taizong to have had an important official become a music teacher for ladies in waiting in the first place. Emperor Taizong became angry and rebuked Wen and Wang. Wen bowed and begged for forgiveness, but Wang refused to do so, stating to Emperor Taizong that the rebuke to him and Wen was not warranted as they were reporting what was true. Emperor Taizong was surprised, but the next day indicated to the high level officials that he was rash and improper in rebuking Wen and Wang.\nIn 630, Wen was made Zhongshu Ling (中書令), the head of the legislative bureau and a post considered one for a chancellor. He was also created the Duke of Yu. Earlier that year, the general Li Jing had inflicted a heavy blow to Ashina Duobi's forces, and later that year, after Ashina Duobi was captured, Eastern Tujue chieftains submitted to Tang. Emperor Taizong requested opinions on what to do with Eastern Tujue's people. There were many different opinions, but the two opinions that Emperor Taizong appeared to consider the most were the ones by Wen and Wei, who debated extensively before Emperor Taizong. Wen argued that, pursuant to precedents of what Eastern Han dynasty did with the Xiongnu, the Eastern Tujue people should be placed within Tang borders but organized in tribal form, to serve as a defense perimeter on the northern border. Wei advocated that the Eastern Tujue people be placed north of Tang borders, believing that they would pose a threat if placed within Tang borders. Wen, however, argued that the Eastern Tujue people could eventually be assimilated and become an asset to the Tang state, and Emperor Taizong agreed with Wen. He established 10 prefectures to settle the Eastern Tujue people and made the major chieftains the prefects, while inviting a number of Eastern Tujue nobles to serve as generals at Chang'an.\nIn 636, Emperor Taizong made Wen a Pushe (僕射), a head of the important executive bureau (尚書省, Shangshu Sheng), and a post also considered one for a chancellor.\nIn 637, Wen died. It was said that during the time that Wen served in important positions, he refused to accept guest visits, believing that it was easy to leak imperial secrets if he had too many guests. He also often discussed important matters of state whenever he entered the palace. After his death, Emperor Taizong was said to state in lament:\n:Wen Yanbo paid so much attention to the important affairs of state that he wore himself out. I have believed for several years that his body was beginning to deteriorate, and I regret not allowing him to live out his years in leisure, but ending his life early.\nIt was said that Wen's household was not wealthy, and there was no main hall where his wake could be held. Emperor Taizong ordered the imperial architect to quickly construct a main hall for Wen's house. Wen was buried near the tomb of Emperor Taizong's wife Empress Zhangsun, where Emperor Taizong would eventually be buried himself.\nNotes and references\n* Old Book of Tang, vol. 61.[http://ef.cdpa.nsysu.edu.tw/ccw/02/tan08.htm]\n* New Book of Tang, vol. 91.[http://ef.cdpa.nsysu.edu.tw/ccw/02/ntan14.htm]\n* Zizhi Tongjian, vols. 186, 191, 192, 193, 194, 195."
    }
  ]
}