{
  "content": [
    {
      "type": "text",
      "text": "# Wesley King\n\n-->\n| education =\n| nationality =\n| honorific_prefix =\n| native_name_lang =\n| name = Wesley King\n| honorific_suffix =\n| image =\n| image_size =\n| image_upright =\n| alt =\n| caption =\n| native_name =\n| pseudonym =\n| birth_name = Wesley Thomas King\n| birth_date =\n| birth_place =\n| death_date =\n| death_place =\n| resting_place =\n| occupation = Writer\n| language =\n| portaldisp =\n}}Wesley King is a Canadian author of young adult fiction books. Both his novels with Kobe Bryant debuted at #1 on The New York Times Best Seller list. He currently resides in Lake Echo, Nova Scotia.\nBiography\nKing was born in Ajax, Ontario and graduated with a journalism degree from Carleton University. He began working on his first novel soon after, The Vindico, and has written 13 novels as of 2022.\nIn 2016, King was approached by Kobe Bryant to collaborate on a new children series. The first installment, Training Camp, was released in 2019 and debuted as a #1 New York Times bestseller. The second installment, Season One, was released in March 2020 after Bryant's death and also became a #1 New York Times bestseller.\nKing publicly discusses his struggle with mental health, specifically surrounding obsessive–compulsive disorder and generalized anxiety disorder. He wrote the bestselling novel OCDaniel in 2016 which described his experiences growing up and won an Edgar Award. He published a prequel to the series in 2020.\nPublished works\n* Butt Sandwich & Tree (Paula Wiseman Books, 2022)\n* Hello (from here) (Dial Books, 2021)\n* Sara and the Search for Normal (Paula Wiseman Books, 2020)\n* The Wizenard Series: Season One (Granity Studios, 2020)\n* The Wizenard Series: Training Camp (Granity Studios, 2019)\n* A World Below (Paula Wiseman Books, 2018)\n* Laura Monster Crusher (Penguin Canada, 2017)\n* Enemy of the Realm (Razorbill, 2017)\n* OCDaniel (Paula Wiseman Books, 2016)\n* Dragons vs. Drones (Razorbill, 2016)\n* The Incredible Space Raiders (from Space!) (Paula Wiseman Books, 2015)\n* The Feros (G.P Putnam's Sons, 2014)\n* The Vindico (G.P Putnam's Sons, 2014)\nReferences\nExternal links\n*"
    }
  ]
}