{
  "content": [
    {
      "type": "text",
      "text": "# West Haldon, Queensland\n\n| pop                 = 63\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4359\n| area                = 95.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 31.1\n| dir1                = NE\n| location1           = Clifton\n| dist2               = 37.5\n| dir2                = SW\n| location2           = Gatton\n| dist3               = 52.6\n| dir3                = SSE\n| location3           = Toowoomba\n| dist4               = 129\n| dir4                = WSW\n| location4           = Brisbane\n| lga                 = Toowoomba Region\n| lga2                = Lockyer Valley Region\n| stategov            = Condamine\n| stategov2           = Lockyer\n| fedgov              = Groom\n| fedgov2             = Wright\n| near-n              = FordsdaleMount Whitestone\n| near-ne             = Mount Sylvia\n| near-e              = Woodbine\n| near-se             = Junction View\n| near-s              = Hirstglen\n| near-sw             = Budgee\n| near-w              = Ramsay\n| near-nw             = Ramsay\n}}\nWest Haldon is a locality split between Toowoomba Region and Lockyer Valley Region in Queensland, Australia. In the , West Haldon had a population of 63 people.\nGeography\nThe locality is bounded by the south-west and south by the Main Range, part of the Great Dividing Range. The terrain varies from  with the lower elevations generally in the east of the locality, rising higher toward the ridgeline of the Great Dividing Range. There are three named peaks:\n* Tipsy Point in the north-west of the locality ()\n* Townley Point in the north-west of the locality ()\n* Paradise Mountain in the north-east of the locality ()\nThe land use is almost entirely grazing on native vegetation.\nThe Gatton–Clifton Road enters the locality from the north (Fordsdale) and exits to the south (Hirstglen).\nHistory\nIn March 1892, local residents met to establish a school.  Mr Young offered  of land and others offered to raise funds. West Haldon Provisional School opened on 7 April 1896 with 17 students under head teacher Bernard MacGinley. On 1 January 1909, it became West Haldon State School. It closed on 18 September 1949 due to low student numbers. It was on the south-east corner of Gatton Clifton Road and MacGinley Road (approx ).\nThe West Haldon Polo Club was established in 1913 and operated until 1969 at 3380 Gatton-Clifton Road ().\nDemographics\nIn the , West Haldon had a population of 62 people.\nIn the , West Haldon had a population of 63 people.\nEducation\nThere are no schools in West Haldon. The nearest government primary schools are:\n* Mount Whitestone State School in neighbouring Mount Whitestone to the north\n* Mount Sylvia State School in neighbouring Mount Sylvia to the north-east\n* Pilton State School in Pilton to the south\n* Emu Creek State School in East Greenmount to the west\n* Ramsay State School in neighbouring Ramsay to the north-west\nThe nearest government secondary schools are:\n* Lockyer District State High School in Gatton to the north-east\n* Clifton State High School in Clifton to the south-west\n* Centenary Heights State High School in Centenary Heights to the north-west\nReferences\nFurther reading\n*  — includes Pilton Upper State School; Hirstvale School; Hirstglen School; Manapouri School; Headington Hill; West Haldon; Pilton State School\n*  —  including the closed schools of Budgee and West Haldon"
    }
  ]
}