{
  "content": [
    {
      "type": "text",
      "text": "# West Coast Historical and Mechanical Society\n\nwith a train at Shantytown station]]\nThe West Coast Historical and Mechanical Society is based at the Shantytown Heritage Park. The society has three steam locomotives and one diesel. One loco, Kaitangata (otherwise known as \"Katie\") is a 0-6-0st steam locomotive built by Sharp, Stewart & Co. in 1896. It is an improved version of the 88 F class locomotives.\nLocomotives and rolling stock\nThe society has 5 steam locomotive plus a diesel shunter:\n* An 'A' class locomotive class locomotive (otherwise known as \"Opossum\")\n* Heisler 1494\n* Climax 1203\n* Kaitangata 4270 \"Katie\"\n* L 508 \"Gertie\"\n* TR 107 \"Rosie\"\nThey also have in care of the remains of A 65 and two bush diesel locos from the Dispatch Foundry. Plus two other locos from the foundry with one on static display and one awaiting restoration. TR 38 was once preserved by the Society, but was on-sold to The Plains Railway on 4 January 1982.\nLocomotives\n{| class=\"wikitable\"\n!Key:\n|bgcolor=#F5D26C|In service\n|bgcolor=#89E579|In service, Mainline Certified\n|bgcolor=#f4a460|Under overhaul/restoration\n|bgcolor=#DED7B6|Stored\n|bgcolor=#B7A4EB|Static display\n|bgcolor=#cecece|Scrapped\n|}\n{| class=\"sortable wikitable\" border=\"1\"\n|-\n! Number\n! Builder\n! Builder's number\n! Year built\n! Arrived at Shantytown\n! Notes\n|- style=\"background:#B7A4EB;\"\n| Opossum\n| E.W. Mills\n| n/a\n| 1875\n| 1986\n| Built for the NZR in 1875. When it arrived it was placed into storage at Foxton. It was then sold to Butler & O\\'Connor, GM in 1877. It only lasted a year there until being on-sold Public Works Department, Harbour Works. Then to the Greymouth Harbour Board in 1884 and Ogilvie\\'s, Gladstone in 1911. Stored in Greymouth from 1958 until 1986 when it was purchased by the society. Stored until 2009 when restoration commenced for it to be placed on static display. This was complete in 2012.\n|- style=\"background:#DED7B6;\"\n| Climax 1203\n| Climax Manufacturing Co.\n| 1203\n| 1913\n| 1971\n| Built for Patate Timber Company for their Matapuna plant in 1913. In 1916 it was the sold to Pukuweka mills at Mananu, who were agents for the Patate firm. i. In 1939 it was then on-sold to Ellis & Burnand for their Mananui (1939), Mangapehi (1944) and Ongarue (1953) plants. In 1963 it was then stored at Ongarue then at Mangapehi (1968) and Greymouth (1971). In 1968 it was purchased by John Melse. In 1971 it was then leased to the society and stored until 1973 when restoration commenced. It was recommissioned in 1980. In 1988 Melse donated it to the society. It was withdrawn from service in 2002 and has been in storage since.\n|- style=\"background:#B7A4EB;\"\n| Heisler 1494\n| Heisler – Stearns\n| n/a\n| 1494\n| 1969\n| Built for Midland Saw Milling, Camerons in 1924. It was then sold to New Forest Sawmills, Ngahere in 1929. Then to Unused, Kangaroo Creek in 1958. In 1966 it was placed into storage. In 1969 it was purchased by the society. Stored until 2010 when restoration commenced for it to be placed on static display. This was complete in 2012.\n|- style=\"background:#f4a460;\"\n| Kaitangata 4270\n| Sharp, Stewart & Co\n| 4270\n| 1897\n| 1971\n| Built for the Kaitangata Coal & Railway Company in 1896. Entered service a year later and was withdrawn in 1971. Purchased by the society in the same year and stored until the 1979 where restoration commenced. Recommissioned a year later. It was placed in its first 10-year overhaul from 1990 to 1991. Serviceable until 2004 when it was withdrawn for another 10-year overhaul. Serviceable again from 2005. In 2014 it was withdrawn from service for another 10-year overhaul. It has been named \"Katie\" in preservation.\n|- style=\"background:#F5D26C;\"\n| L 508\n| Avonside Engine Co.\n| 1206\n| 1877\n| 1998\n| Entered NZR service in 1877 as L 208. Withdrawn in 1901 and sold to the Public Works Department and reclassified as PWD 508. On-sold to Portland Cement and reclassified as PC 7. It was then purchased by the now defunct Tauranga Historic Village in 1974. Purchased by the society in 1998 and recommissioned in 2004. It has been named \"Gertie\" in preservation. The locomotive's boiler ticket will expire in 2014.\n|- style=\"background:#F5D26C;\"\n| TR 107 (TMS: TR 396)\n| A & G Price\n| 176\n| 1957\n| 2005\n| Entered NZR service in May 1957. During this time it was reclassified as WW 4733 by the Ways and Works Department at Middleton. It was later reclassified back as TR 107. Renumbered as TR 396 in 1978 and withdrawn in 2005. Purchased by the society in the same year. It was used until 2007 when withdrawn from service for a restoration. This was completed in 2008 and it now wears a green livery with \"Infants Creek Tramway\" written above the long hood. It has named \"Rosie\" in preservation.\n|}\nReferences\nExternal links\n* [http://www.shantytown.co.nz/ Shantytown Heritage Park's official website]"
    }
  ]
}