{
  "content": [
    {
      "type": "text",
      "text": "# West Kingdom\n\nArms of the West Kingdom\nThe West Kingdom (also known as The Kingdom of the West) is the oldest kingdom (or branch) of the historical reenactment organization, the Society for Creative Anachronism. It comprises Northern California (including the San Francisco area), Nevada, Alaska, Japan, Korea and the Pacific Rim.\nHistory\nThe Kingdom of the West was the first SCA group, founded in 1966. An initial party with David Thewlis, Steve Henderson, Ken de Maiffe, and author Diana Paxson (at the time a medieval history major at the University of California, Berkeley) and others was held in Paxson's backyard. Many of the attendees were at Berkeley, and were history buffs and science fiction fantasy fans. They held the first party as an outdoor sword fighting tournament using leather armour with some steel. Everyone enjoyed the event, and another was planned. From this first event, the group began to expand. After three years, part of this new group on the East Coast split off and the East Kingdom was founded, distinguishing it from the West Kingdom. In subsequent years, other regions previously operating under the auspices of the West Kingdom have also split off to form their own kingdoms, generally when the population is deemed large enough and the local culture distinct enough to warrant the split.\nActivities\nThe main activities within the West Kingdom include tournaments, feasts and revels, universities and collegiums (classes on subjects dealing with modern living history issues, or straight history is taught). The group is also active with the arts and sciences. These events emphasize the exhibition and/or competition of various artistic skills and research of SCA members. The kingdom has guilds and other groups, which regularly hold meetings to teach such subjects as dance, cooking, armourmaking, needlework, music and other interests.\nLike other parts of the SCA, the Kingdom of the West uses rattan weapons, generally of a standard authentic weight. The combat blows deal a heavy, though not an edged, attack. Members also make armour.\nThe kingdom has a wide range of heraldic devices, and has even had a book published dedicated to them.\nIn Japan (known in the SCA as the \"Palatine Barony of the Far West\"), its members combine to create larger scale combat with another group, the realm of Avalon, an independent Tokyo-based group of recreationists and fighters and with a number of local Japanese people among its members. In Japan, the SCA, having largely been imported from the U.S., has long revolved around U.S. military bases.\nReferences"
    }
  ]
}