{
  "content": [
    {
      "type": "text",
      "text": "# Western Heritage Center\n\nThe Western Heritage Center is a regional museum located in historic downtown Billings, Montana, United States. The museum is housed in the historic Parmly Billings Memorial Library, built in 1901. The building is a stately Richardsonian Romanesque structure with twin towers, listed on the National Register of Historic Places. The Western Heritage Center displays original exhibits about south-central Montana and the Northern Plains and houses oral histories and artifacts about the history of the Yellowstone River Valley. The museum celebrated its fiftieth anniversary in 2021.\nThe Western Heritage Center, a former affiliate of the Smithsonian Institution, is accredited by the American Alliance of Museums. The museum opened in 1971 after a organized group of leading citizens prevented the building from being torn down. The founders established the museum as an interpretive center with an emphasis on changing exhibits, outreach programming, and the incorporation of new technologies.\nIn 2001, the Western Heritage Center received the Montana Governor's Humanities Award, the second organization to receive an honor usually reserved for individual contributions to the Humanities. In 2002, the WHC became the first Smithsonian Institution affiliated museum in the Northern Plains. Beginning in 2004, and running through 2009, WHC received federal appropriations from the United States Department of the Interior for the American Indian Tribal Histories Project, a program contributing to the preservation of Crow and Northern Cheyenne tribal histories. The museum is one of six museums in Montana accredited by the American Alliance of Museums.\nThe Western Heritage Center programs include a monthly High Noon lecture and video series, a walking tour program (Hoof It with a Historian), fourteen traveling exhibits, partnerships with regional museums, schools, and businesses, and active participation in local events. The WHC displays six to seven exhibits annually, most based on original research. The Western Heritage Center publishes books, video materials, and education kits relating to regional history. The museum cares for 40,000 artifacts illustrating and documenting Yellowstone River Valley history. The museum is open to the public between early March and late December, Tuesday-Saturday, 10-5. The museum receives annual funding and support from Yellowstone County.\nReferences\nFurther reading\n*\nExternal links\n*\n*[http://www.ywhc.org/  Western Heritage Center]"
    }
  ]
}