{
  "content": [
    {
      "type": "text",
      "text": "# Western Queensland\n\nWestern Queensland encompasses the three western regions in the Australian state of Queensland:\n* North West Queensland, often known as Gulf Country;\n* Central West Queensland; and\n* South West Queensland.\nHistory\nKaruwali (also known as Garuwali or Dieri) is a language of far-western Queensland. The Karuwali language region includes the landscape within the local government boundaries of the Diamantina Shire Council, including the localities of Betoota and Haddon Corner.\nKuungkari (also known as Kungkari and Koonkerri) is an Australian Aboriginal language of Western Queensland. The Kuungkari language region includes the landscape within the local government boundaries of the Shire of Longreach and Blackall-Tambo Region.\nPitta Pitta (also known as Bitha Bitha, Pitapita, and Bitta bitta) is an Australian Aboriginal language of the Western Queensland region. The Pitta Pitta language region includes the landscape within the local government boundaries of the Boulia Shire Council, extending from Boulia north towards Mt Isa.\nWaluwarra (also known as Warluwarra, Walugara, and Walukara) is an Australian Aboriginal language of Western Queensland. Its traditional language region is the local government area of the Shire of Boulia, including Walgra Station and Wolga, from Roxborough Downs north to Carandotta Station and Urandangi on the Georgina River, on Moonah Creek to Rochedale, south-east of Pituri Creek.\nYawarrawarrka (also known as Yawarawarka, Yawarawarga, Yawarawarka, Jauraworka, and Jawarawarka) is an Australian Aboriginal language of Far Western Queensland. The traditional language region includes the local government area of the Shire of Diamantina extending into the Outback Communities Authority of South Australia towards Innamincka.\nMedia\nAll three regions are serviced by the ABC Western Queensland radio station.\nSee also\n* Regions of Queensland\nReferences"
    }
  ]
}