{
  "content": [
    {
      "type": "text",
      "text": "# Westward (restaurant)\n\n-->\n| map_alt           =\n| map_caption       =\n| map_size          =\n| established       =\n| closed            =\n| current_owner     =\n| previous_owner    =\n| manager           =\n| head_chef         =\n| chef              =\n| pastry_chef       =\n| food_type         =\n| dress_code        =\n| rating            =\n| street_address    = 2501 N. Northlake Way\n| city              = Seattle\n| county            = King\n| state             = Washington\n| postcode          = 98103\n| country           = United States\n| coordinates       =\n| seating_capacity  =\n| reservations      =\n| other_locations   =\n| other_information =\n| website           =\n}}\nWestward is a restaurant in Seattle, in the U.S. state of Washington. Established in 2013, the restaurant operates on the north end of Lake Union.\nDescription\nWestward is a restaurant on the north end of Seattle's Lake Union, in the Fremont/Wallingford area. The magazine Seattle Metropolitan has said it is \"between the Burke-Gilman, the lake, and a boat storage facility\". The restaurant has a deck with Adirondack chairs and views of the lake and city skyline, as well as a fire pit and parking for boats. The restaurant serves American cuisine and seafood. The New York Times has described the food as \"an intriguing mix of Mediterranean and Northwest dishes\", and Thrillist has said the business is \"where chef and restaurateur Renee Erickson's menu hones in on her specialty—seafood—with a Mediterranean twist\".\nHistory\nThe restaurant opened in 2013. Chef Josh Henderson sold Westward to business partners Chad Dale and Ira Gerlich in 2018. In 2019, Renee Erickson's restaurant group Sea Creatures announced a temporary closure for a remodel, starting in early 2020.\nReception\nIn 2015, Eater Seattle said Westward was among the city's best restaurants with views. Time Out Seattle rated Westward four out of five stars in 2018.\nReferences\nExternal links\n*"
    }
  ]
}