{
  "content": [
    {
      "type": "text",
      "text": "# Wet Gunpowder Award\n\nThe Wet Gunpowder Award () is an Iranian symbolic award that according to organizers, is given to \"ridiculous people whose chaffy character is evident to everyone and when this nature of theirs is accompanied with self-belief turns into an indefinite foolishness for them\".\nThe organizers, who have close ties to Basij and Islamic Revolutionary Guards Corps (The award is unveiled by Basij commander Mohammad Reza Naqdi), claim award winner is \"someone who is against the Islamic Revolution\" and who “against their own wishes, performs a service to the revolution.”\nThe statue of the award is that of brain with dark glasses and hearing aids with a plaque of the Quranic verse: \"Unwilling to hear, unwilling to speak, unwilling to see, then, they will not return to the way.\"\nIn 2015, they awarded a parody of Golden Bear.\nRecipients\nMichelle Obama, pictured here announcing the winner of 2013 Academy Award for Best Picture, Argo, was inaugural winner. The prize was posted to her via Swiss Embassy in Tehran.]]\n{|class=\"wikitable\"\n|-\n! Year\n! Name\n! Nat\n! Org\n! Office holding\n! Rationale\n|- bgcolor=#dddddd\n|2013\n|Michelle Obama\n|align=center colspan=\"2\"|\n|First Lady of the United States\n|For \"showing the truth about the Oscar awards to the world.\"\n|- bgcolor=#dddddd\n|rowspan=\"7\"|2014\n|Catherine Ashton\n|align=center|\n|align=center|\n|High Representative of the Union for Foreign Affairs and Security Policy\n|rowspan=\"2\"|For meeting Sattar Beheshti's mother and handing Sakharov Prize to Nasrin Sotoudeh and Jafar Panahi\n|- bgcolor=#dddddd\n|Tarja Cronberg\n|align=center|\n|align=center|\n|Member of the European Parliament\n|-\n|Benjamin Netanyahu\n|align=center colspan=\"2\"|\n|Prime Minister of Israel\n|-\n|Shimon Peres\n|align=center colspan=\"2\"|\n|President of Israel\n|-\n|Ban Ki-moon\n|align=center|\n|align=center|\n|Secretary-General of the United Nations\n|-\n|John Kerry\n|align=center colspan=\"2\"|\n|United States Secretary of State\n|-\n|Barack Obama\n|align=center colspan=\"2\"|\n|United States President\n|- bgcolor=#dddddd\n|rowspan=\"5\"|2015\n|Manuel Valls\n|align=center colspan=\"2\"|\n|Prime Minister of France\n|\"For disrespecting religious beliefs despite claiming for Free thought in France\"\n|-\n|David Cameron\n|align=center colspan=\"2\"|\n|Prime Minister of the United Kingdom\n|\"For disrespecting Iranian President Hassan Rouhani\"\n|-\n|Benjamin Netanyahu\n|align=center colspan=\"2\"|\n|Prime Minister of Israel\n|\"For killing 578 children in 51 days despite maintaining peaceful face publicly\"\n|-\n|Claudia Roth\n|align=center colspan=\"2\"|\n|Vice-President of the Bundestag\n|\"For publicly showing her ties to Fitna (2009 presidential election protests)\"\n|-\n|John McCain\n|align=center colspan=\"2\"|\n|United States Senator\n|\"For above board support of Islamic State of Iraq and Levant and opposition to terrorism at the same time\"\n|- bgcolor=#dddddd\n|rowspan=\"5\"|2016\n|-\n|- bgcolor=#dddddd\n| Cheryl Boone Isaacs\n|||\n||President of the Academy of Motion Picture Arts and Sciences\n|\"For deliberately removing Muhammad: The Messenger of God from Foreign Language Film nominates in 88th Academy Awards and showing the anti-Islamic nature of Academy Awards\"\n|-\n| Juergen Boos\n|||\n||Director of the Frankfurt Book Fair\n|\"For inviting Salman Rushdie and demonstrating the Zionist and anti-Islamic nature of this festival\"\n|-\n|François Hollande\n|align=center colspan=\"2\"|\n|President of France\n|\"For awarding Legion of Honour to Derayeh Derakhshesh, cultural opposition of Iran\"\n|-\n| Piers Handling\n|||\n||Director of the Toronto International Film Festival\n|\"For screening Septembers of Shiraz and demonstrating the anti-Iranian nature of this festival\"\n|}\nSpecial awards\n{|class=\"wikitable\"\n|-\n! Year\n! Name\n! Nat\n! Office holding\n! Award\n! Rationale\n|-\n|2015\n|Dieter Kosslick\n|\n|Director of the Berlin International Film Festival\n|\"Goldean Bear\"\n|For \"devaluation of Arts\" with awarding an \"anti-Iranian movie\" [Taxi by Jafar Panahi]\n|}\nReferences"
    }
  ]
}