{
  "content": [
    {
      "type": "text",
      "text": "# Whacking Day__disambig_1\n\n| guests         =\n* Barry White as himself\n| blackboard     = \"I will return the seeing-eye dog\"\n| couch_gag      = The Simpsons walk in, while the couch is replaced by a small wooden chair that they all sit on.\n| commentary     = Matt GroeningAl JeanMike ReissJeffrey LynchDavid Silverman\n| prev           = The Front\n| next           = Marge in Chains\n}}\n\"Whacking Day\" is the twentieth episode of the fourth season of the American animated television series The Simpsons. It originally aired on Fox in the United States on April 29, 1993. The episode revolves around the fictional holiday \"Whacking Day\", celebrated annually on May 10th, in which the citizens of Springfield drive snakes into the town square, then fatally club them. After Bart is expelled from school as punishment for injuring Superintendent Chalmers, he applies the knowledge he gains from Marge's homeschooling to help Lisa expose the fraudulent and cruel nature of the holiday.\nThe episode was written by John Swartzwelder and directed by Jeffrey Lynch. Singer Barry White, who had expressed a wish to appear in the show, guest stars as himself. It was pitched by George Meyer, who wanted to create an episode against the mistreatment of snakes.  The episode includes the first appearance of Superintendent Chalmers, and features an Itchy & Scratchy parody of Oliver Stone's film JFK. \"Whacking Day\" won a Genesis Award for \"consciousness-raising on behalf of animal issues\".\nPlot\nDuring an inspection by Superintendent Chalmers at Springfield Elementary School, Principal Skinner lures Bart, Jimbo, Kearney, Dolph, and Nelson into the school's utility basement with the promise of free mountain bikes and locks the door. Bart escapes through a ventilation shaft and takes Groundskeeper Willie's tractor for a joyride, accidentally crashing into Chalmers. Enraged at Bart for costing him a promotion, Skinner promptly expels Bart from the school. After Bart is quickly rejected from a private Christian school, Marge decides to homeschool him. Marge assigns Bart to read Johnny Tremain. Bart is uninterested in the book until Marge tells him the title character has a deformed hand; Bart then reads the book in its entirety and loves it.\nMeanwhile, the local holiday Whacking Day is approaching. Each year on May 10, the people of Springfield drive snakes to the center of town and beat them to death. Lisa is disgusted by the tradition, but none of Springfield's adults sympathize with her, even her own father. After Marge takes Bart on a field trip to Olde Springfield Towne, he deduces that the origin of Whacking Day, which supposedly involved Jebediah Springfield, is false because it conflicts with a major Revolutionary War battle in which Springfield took part. Bart purchases Bob Woodward's book The Truth About Whacking Day.\nOn Whacking Day, Barry White arrives to begin the festivities, but quickly leaves in disgust when he discovers the holiday is dedicated to killing snakes. Bart suggests to Lisa that they lure the snakes to safety by playing music with heavy bass from the stereo speakers. White, who just happens to be walking by, agrees to help by singing \"Can't Get Enough of Your Love, Babe\", attracting hundreds of snakes into the house.\nThe pursuing crowd arrives, but they are soon turned around on the subject of Whacking Day by Bart's newfound knowledge; the first Whacking Day was actually held in 1924 as an excuse to beat up Irish immigrants (the ‘snakes’ banished from Ireland). Lisa also reminds the townspeople of the positive things that snakes have done for them, such as killing rodents. The townspeople agree to give up the tradition.\nSkinner is impressed with Bart's efforts and welcomes him back to the school, but then realizes in horror that he completely forgot about Jimbo, Dolph, Kearney and Nelson, because they are still in the utility basement; they are shown talking about their feelings and comforting each other. Skinner and Willie race to the school with the mountain bikes for the boys to avoid a potential lawsuit.\nProduction\nvoiced himself in the episode, singing an original version of \"Can't Get Enough of Your Love, Babe\".]]\nWriter George Meyer, who was very \"animal conscious\", was interested in writing an episode related to an annual ritual held in a Texan town, where the townspeople would beat rattlesnakes with sticks. Meyer did not have time to pen the episode himself, so the idea was given to John Swartzwelder. The subject matter of \"beating snakes\" worried the staff who thought that many would deem it cruel, even though the episode's message is against the mistreatment of snakes. The episode's first act was one of the shortest the staff had ever written at that time, roughly ten pages in length, but with no ideas to expand, they left it as it was. Due to this, the main plot does not start until the beginning of the second act, as the writers could not come up with much material for it.\nIn order to speed up animation, director Jeffrey Lynch \"begged\" storyboard artists Kevin O'Brien and Steve Markowski to help him with the episode. The three spent several months on the episode. Barry White wanted to guest star on the show, so he was written into the plot. He sang \"Can't Get Enough of Your Love, Babe\" especially for the episode, rather than using a recorded version.\nThe song Grampa was supposed to sing in his flashback, showing how he posed as a German cabaret singer in World War II, was \"Lili Marlene\" by Marlene Dietrich. The staff could not get the rights to it because, according to the people who own the song, \"everybody makes fun of it\". Much of the flashback was pitched by Conan O'Brien.\nThe episode marks the first appearance of Superintendent Chalmers. The staff wanted to introduce a boss for Skinner, and Wallace Wolodarsky pitched his name. Much of the dialogue and interactions between Skinner and Chalmers were ad-libbed by Harry Shearer and Hank Azaria, respectively.\nCultural references\nOver newsreel footage of Whacking Day, Kent Brockman says \"After exposing Alger Hiss, Honorary Grand Marshall Richard Nixon goes after another deadly hiss.\" Marge assigns Johnny Tremain to Bart.  The untitled Itchy & Scratchy short by \"guest director\" Oliver Stone is a parody of the scene where footage is shown of Jack Ruby shooting Lee Harvey Oswald in Stone's film JFK: someone is heard to shout, \"Oh God! Get his gun!\" as the short draws to a close. Bart makes a joke about Oprah Winfrey's appetite for baked ham. In Olde Springfield Towne, an applicant for \"Village Idiot\" says he \"played Panicky Idiot Number Two in The Poseidon Adventure.\" The song \"O Whacking Day\" uses the same tune as the Christmas carol \"O Tannenbaum\", known in English as \"O Christmas Tree\". Bob Woodward is shown to be the author of The Truth About Whacking Day. The song \"Born Free\" plays as the snakes slither off into the sunset.\nReception\nIn its original American broadcast, \"Whacking Day\" finished tied for 25th in the weekly ratings for the week of April 26 – May 2, 1993 with a Nielsen rating of 12.2. It was the highest rated show from the Fox Network that week.\nFor \"consciousness-raising on behalf of animal issues\", the episode was awarded the Genesis Award for \"Best Television Prime Time Animated Series\" in 1994.\nJeffrey Lee Puckett of The Courier-Journal cited \"Whacking Day\" as \"the series' richest episode\". He wrote: \"In 22 remarkable minutes, 'Whacking Day' skewers the quality of America's educational system, self-aggrandizing politicians, greed, the mob mentality, sexuality in the age of political correctness and the whole notion of political correctness, and makes a hero of Barry White.\" Chris Vognar of The Dallas Morning News noted the episode was one of the fourth season's best episodes in his review of the DVD. Andrew Martin of Prefix Mag named White his fifth favorite musical guest on The Simpsons out of a list of ten.\nMatt Groening considers Homer's \"I am evil Homer\" fantasy to be one of the \"all-time great moments\" in the show's history.\nA 2003 article in The Journal News reported that records show genuine \"Whacking Days\" having taken place in Eastchester, New York from 1665 onwards: \"That one day every spring be chosen for the destroying of rattle snakes.\" The article quoted show runner Al Jean as saying: \"I agree with the premise of the episode: leave the snakes alone. They didn't hurt anybody.\" Since 2009, citizens in North Queensland, Australia, have held an annual \"Toad Day Out\" every March 29 in which thousands of cane toads (an invasive and highly destructive species not native to Australia) are captured and humanely destroyed. The event was inspired by the episode.\nIn The A.V. Club, Nathan Rabin writes “'Whacking Day' is arguably the purest and most scathing attack on mob mentality in The Simpsons’ oeuvre, purer and more trenchant even than 'Marge Vs. The Monorail'...By the time Mayor Quimby shows up at the Simpson home—where the snakes have found shelter from the mob after being attracted by the bass in Barry White's voice—to bask in Springfield’s hatred of snakes, he’s surprised and a little disgusted to discover that the angry mob has turned unexpectedly into an aggregation of snake-fanciers. 'You’re nothing but a pack of fickle mush-heads!' he yells in disgust, to which the mob can only add, 'He’s right!' and 'Give us hell, Quimby!'\nIn 'Whacking Day' and The Simpsons, the mob can be a force for good, a force for bad, or, in this case, a force for evil that morphs into a force for good. That’s the duality of mob mentality in The Simpsons: What the mob gives it can also take away and no show has ever spoofed the madness of crowds as adroitly or consistently as The Simpsons, especially in its radiant, God-like prime.\"\nReferences\nExternal links\n*\n*"
    }
  ]
}