{
  "content": [
    {
      "type": "text",
      "text": "# What's Cooking? (film)\n\n| music          = Craig Pruess\n| cinematography = Jong Lin\n| editing        = Janice Hampton\n| studio         = BeCause Entertainment Group\n| distributor    = Redbus Film Distribution (United Kingdom)Trimark Pictures/Lions Gate Films (United States)\n| released       =\n| runtime        = 109 minutes\n| country        = United KingdomUnited States\n| language       = English\n| budget         =\n| gross          = $1,698,759\n}}\n'What's Cooking?' is a 2000 comedy-drama film directed by Gurinder Chadha and starring Mercedes Ruehl, Kyra Sedgwick, Joan Chen, Lainie Kazan, Maury Chaykin, Julianna Margulies, Alfre Woodard, and Dennis Haysbert.\nPlot\nOn Thanksgiving day, four ethnically diverse families -- Vietnamese, Latino, Jewish, and African American — gather for the traditional meal. Each family has its own distinct way of cooking the traditional holiday meal and its own set of problems.\nRuth and Herb Seelig welcome their daughter Rachel home, along with her girlfriend Carla. Ruth and Herb struggle to adjust their expectations for their daughter's future with her current living arrangement. On Thanksgiving, Rachel's older brother, Art, his wife Sarah, and Sarah's brother, Jerry, are in attendance as well as Bea and David, an elderly Jewish couple from a nearby retirement home. Over dinner Bea persistently questions Rachel about her romantic prospects, unaware that Rachel and Carla are lesbians, and Ruth and Herb both attempt to dissuade Bea from talking more, afraid that the truth of their daughter's homosexuality will come out. Eventually Rachel declares she has an announcement to make, much to her parents' chagrin, and states that she is pregnant. Her parents are dumbfounded, and it is revealed that Jerry, himself gay, was the sperm donor for Rachel and Carla. Rachel makes an impassioned plea to her family to accept her for who she is, and Ruth and Herb come to terms with accepting Carla and their new grandchild.\nMrs. Elizabeth \"Lizzy\" Avila is separated from her husband, Javier, after he ran off with Lizzy's cousin, Rosa. Meanwhile, Lizzy has taken a lover of her own, a coworker named Daniel. The day before Thanksgiving, Lizzy and Javier's son, Tony, runs into his father at the grocery store. Finding out that his father would be celebrating Thanksgiving Day alone, Tony invites Javier to Lizzy's house the next day. When Lizzy finds out, she commands Tony to uninvite Javier, but the message is not conveyed. The Avilas' daughter, Gina, drives home from college on Thanksgiving Day with her Vietnamese American boyfriend, Jimmy. Jimmy faces some racist remarks from members of the Avila family, but he takes it in stride. At one point during the day, Lizzy sends Jimmy and Gina to return a video cassette to the store that Jimmy's family owns, and Jimmy witnesses his own family fighting, troubling him. Despite Gina's assurances that he can leave the Avila celebration to go check on his family, Jimmy declines, feeling that he can't be himself around them. Tensions boil over when Javier and Daniel arrive at Lizzy's house, leading to an argument between Lizzy and Javier. Lizzy refuses to give Javier a second chance for his infidelity and he storms out of the house.\nRonald Williams works for the conservative, white governor of California, much to the dismay of his son Michael, who has progressive leanings and a strong sense of pride in his heritage. Michael and some friends attack the governor at a photo-shoot with paint, but Ronald uses his influence to keep Michael out of trouble. Meanwhile, Audrey Williams and her daughter Kristin pick up Ronald's mother, Grace, from the airport. Audrey fields constant criticism and questions concerning Ronald and Michael's whereabouts from Grace, and when Ronald returns home he unsuccessfully tries to keep the peace between Grace and Audrey. On Thanksgiving Day, Ronald's white colleague James Moore, his second wife Paula, and daughter from his first marriage, Monica, join the Williams. Grace gets into an argument with Audrey over the preparation of the food, Audrey choosing to prepare a traditional spread to impress the Moores rather than the usual soul food the Williams clan would enjoy on Thanksgiving. During dinner, Michael returns home and the secrets Ronald and Audrey were trying to hide all come out: Ronald had an affair with his coworker, Michael dropped out of college, and Michael was behind the attack on the governor. Grace, Paula, and Michael comfort Audrey, who has an emotional breakdown, and Grace goes to confront her son. After the Moores leave, Ronald and Audrey reconcile, and Ronald gives his blessing to his son Michael to pursue his dreams.\nTrinh and Duc Nguyen are dealing with multiple problems at their home. Their oldest son, Jimmy, away at college, lies to them saying he cannot come home for Thanksgiving due to a busy midterm schedule where in reality he is across the street at his girlfriend's house, celebrating Thanksgiving with them. Their daughter Jenny is sneaking around with a White boyfriend, and is discovered to have a condom in her coat pocket. Younger son Gary was recently suspended from his school for bad behavior, and later Jenny discovers a gun hidden in Gary's bedroom. When she confronts him over the matter, he claims he's just keeping it for his friend, so Jenny meets her boyfriend at the family's video store for advice. Duc finds Jenny and her boyfriend in an intimate moment and drags Jenny back home to be berated by the family. Jenny's grandmother tries to comfort her after the fight, insisting that Trinh and Duc love her despite the cultural and generational differences in communication. Over a tense, silent Thanksgiving dinner, Jenny reveals to the family that Gary is hiding a gun, and the family now berates Gary, who they suspect is in a gang. As the Nguyen family fights, youngest son Joey sees the gun on the kitchen table and accidentally fires it, breaking a window and getting the attention of the Nguyens' neighbors: the Avilas, the Williamses, and the Seeligs. Hearing the gunshot from his house, Jimmy runs back home and rejoins his family as they recover from the multiple fights they had. Lizzy encourages Gina to introduce herself to the Nguyens, so the Nguyen clan finally sits down to enjoy their Thanksgiving dinner, now with Jimmy and Gina.\nCast\nReception\nRelease\n''What's Cooking?'' was the Opening Night Film of the 2000 Sundance Film Festival, and was the first British script to be invited to the Sundance Institute's Writer's Lab.\nBox office\nThe film was given a limited theatrical release beginning November 17, 2000. It was released in the UK on August 31, 2001. It ultimately grossed $1,698,759 worldwide.\nCritical response\nReview aggregator Rotten Tomatoes gives the film a 52% approval rating based on 66 reviews, with an average rating of 5.51/10 and the consensus that it \"is well-acted, but the scenes sometimes sink into melodrama as characters scream at each other, and the movie as a whole is too lightweight and forgettable.\"\nPositive reviews lauded the film’s ensemble cast and its attention towards cultural and generational differences within families. Roger Ebert awarded the film 3 and 1/2 stars out of four and praised the film’s \"texture and pleasure. There are so many characters, so vividly drawn, with such humor and life, that a synopsis is impossible. What's strange is the spell the movie weaves.\" Jane Crowther of the BBC said, \"Funny but sharply observed, cleverly resolved without being neat, '''What's Cooking?''' provides a quartet of compelling, resonant and superbly acted tales for the price of one, plus a mouth-watering visual feast of culinary delights.\"\nA.O. Scott of The New York Times wrote, \"The issues of race, ethnicity and sexuality that percolate through it are handled with a light, humorous touch.\" He added, ”Sometimes, as is fitting, given the holiday the film observes, it seems like too much -- too many troubled marriages and intergenerational misunderstandings for one movie to sustain. By themselves, one suspects, each of these stories would seem pretty thin, but Ms. Chanda [sic] makes it all feel surprisingly rich and dense. If you place four pieces of paper on top of one another and then fold the stack in half a few times, the result will feel heavy and substantial.\"\nEmanuel Levy of Variety said though the \"old-fashioned, feel-good movie\" can feel \"more sociological than cinematic\", its \"terrific ensemble elevates the proceedings.\" Ty Burr of Entertainment Weekly called the film an actresses’ showcase. Bob Graham of the San Francisco Chronicle said, \"It’s unfair to choose a standout, but here goes anyway: It's the self-possessed Mercedes Ruehl as a woman with a good b.s. detector who also knows when to say no.\"\nAccolades\nThe film was voted a joint audience award winner at the 2000 New York Film Critics Circle Awards (tied with Billy Elliot), and Chadha won the award for Best British Director at the London Film Critics Circle Awards.\nSee also\nList of LGBT-related films directed by women\nReferences\nExternal links\n*\n*"
    }
  ]
}