{
  "content": [
    {
      "type": "text",
      "text": "# When the Emperor Was Divine__disambig_1\n\nWhen the Emperor Was Divine is a historical fiction novel written by American author Julie Otsuka about a Japanese American family sent to an internment camp in the Utah desert during World War II. The novel, loosely based on the wartime experiences of Otsuka's mother's family, is written through the perspective of four family members, detailing their eviction from California and their time in camp. It is Otsuka's debut novel, and was published in the United States in 2002 by Alfred A. Knopf.\nPlot\nThe story follows a Japanese American family; a father, a mother, a son, and a daughter. The family members remain nameless, thus giving their story a universal quality. The novel is divided into 5 sections, each told from a different family member's perspective. The first chapter, the mother's perspective, follows the family's preparations for leaving for the camp. The second chapter, from the girl's perspective, takes place on the train as the family is transported to their internment location. The third chapter, from the boy's perspective, chronicles the three years the family spends at the internment camp in Topaz, Utah. The fourth chapter, told from the combined perspectives of the boy and girl, tells of the family's return home and their efforts at rebuilding their lives as well as their experience in the post war milieu of anti-Japanese discrimination. The final chapter is a confession, told from the father's perspective and structured as a direct address to the reader.\nCharacters\n* Mother: The first section of the novel follows her perspective. She is calm and cool despite the drastic change in her life and ends up becoming the bread winner for her family after the internment camp.\n* Daughter: She is 11 years old with long black hair. Daughter is very inquisitive and can easily make friends with strangers.\n* Son: He is 8 years old and the one in the family who writes to their father the most. He also fantasizes about the supposed glory of his return more than other characters.\n* Father: He is put in an internment camp before the rest of the family. Upon return from the camp he is listless and unable to return to the life he had before.\nReception and awards\nThe book was met with a generally positive reception. Writing for The New York Times, literary critic Michiko Kakutani stated \"though the book is flawed by a bluntly didactic conclusion, the earlier pages testify to the author's lyric gifts and narrative poise\". Sylvia Santiago of Herizons magazine described Otsuka's writing style as \"scrupulously unsentimental\", thus \"creating a contrast to the sensitive subject matter\". O: The Oprah Magazine said the novel was \"a meditation on what it means to be loyal to one's country and to one's self, and on the cost and the necessity of remaining brave and human\".\nWhen the Emperor Was Divine won the American Library Association's Alex Award in 2003 and also won an Asian American Literary Award.\nReferences"
    }
  ]
}