{
  "content": [
    {
      "type": "text",
      "text": "# White House Office of Presidential Correspondence\n\n| seal            = The White House logo under Trump 2.0.jpg\n| seal_width      = 150px\n| formed          =\n| chief1_name     = Desiree Sayle\n| chief1_position = Director\n| parent_department = Office of the Staff Secretary\n| headquarters    = Eisenhower Executive Office BuildingWashington, D.C., U.S.\n| coordinates     =\n| website         = [https://twitter.com/dearpotus46 Official Twitter account]\n}}\nwriting a response to one of the ten letters he received each day as president from the White House Office of Presidential Correspondence.]]\nThe Office of Presidential Correspondence is one of the largest and oldest offices in the White House, and is a component of the Office of the White House Staff Secretary. In the administration of Joe Biden, the Office of Presidential Correspondence was led by Director Eva Kemp. Kemp left the office in September 2021 to become Vice President at Precision Strategies. Deputy Director Garrett Lamm was promoted to take over for Kemp after her departure.\nFunction\nPresidential Correspondence is responsible for processing all mail, email, and parcels addressed to the president of the United States.  The office mission is to listen to the writers' views, experiences, and ideas and coordinate an automated response on behalf of the White House. In addition to full-time staff, the Office of Presidential Correspondence retains dozens of interns and volunteers who assist in correspondence analysis, digital response, and the White House Comment Line.\nCorrespondence from the president includes greetings, intended as recognition of individual milestones such as birthdays, marriages, and graduations, special letters with custom responses, messages written for particular groups or events, and proclamations, intended to mark annual holidays or national occasions in which a ceremonial document from the president is appropriate. Historically, the office has tried to maintain political neutrality.\nIn addition to reviewing mail and email, the office is also responsible for:\n* answering phone calls\n* processing gifts intended for the first family or White House staff\n* drafting letters, messages for special events, and official proclamations\n* tasking constituent casework to federal agencies.\nHistory\nPredecessors\nThe Office of Correspondence formed over the fifty-year White House career of staffer Ira R.T. Smith. He began handling the mail as a part of his duties as a clerk to President William McKinley in 1897. At the time, Smith was one of only twelve White House staffers. President McKinley received about 100 letters per day. That grew to about 800 per day under President Herbert Hoover, and ballooned to about 8,000 per day during President Roosevelt's New Deal. The staff expanded to meet the increased need and Smith was named the first \"chief of mails\" (now director of correspondence). Smith ran the office until his retirement in 1948.\nBeginning with the Eisenhower administration and continuing through the Nixon administration, the chief of the Presidential Correspondence division was an officer selected from the U.S. Foreign Service, a tradition attributed to the corps' reputation for superior drafting skills. The last foreign service officer to serve as Chief of Correspondence was Michael B. Smith, from 1971–1973, who was succeeded by a political appointee. In the Carter administration, Correspondence was moved into the newly created Office of Administration.\nModern OPC created\nThe modern Office of Presidential Correspondence was created when the Reagan administration split the correspondence analysis and response tasks away from the mail logistics tasks. Mail logistics remained with the Office of Administration in the Office of Mail and Messenger Operations, and the Office of Correspondence was re-established in the Office of the Staff Secretary to handle the more political tasks of analysis and processing.\nDuring the Clinton administration, the office annually prepared over 6,000 custom letters, messages and proclamations.\nIn the George W. Bush administration, with the advent of electronic communication, the mail sent to the president increased considerably. The Bush administration also added a calligrapher to the Correspondence Office to prepare official photographs of the president with a visitor or dignitary to then send to that person as a gift. This calligrapher was separate from the calligrapher employed by the chief usher for official functions.\nIn the first year of the Obama administration the White House received tens of thousands of letters, parcels, and emails per day. President Barack Obama requested a representative sample of ten letters from the public every day. His senior aides have acknowledged that the letters played an important role in informing the president's perceptions of how policies were impacting ordinary people. In December 2009, Natoma Canfield wrote to the president detailing her struggles against leukemia after losing her health insurance. The letter became a centerpiece of the White House effort to pass the Patient Protection and Affordable Care Act through Congress in March 2010. After the passage of the law, her letter was framed and hung on the wall outside the president's private office.\nIn the first Trump administration, Presidential Correspondence focused on military veterans and their families, Gold Star families, law enforcement, and first responders. The youth correspondence team identified and escalated letters from children, including 8-year-old Fore Putnam who pled for help for his father with kidney failure and, after the White House called and intervened, received aid from a doctor in New York. In a separate instance, 11-year-old Frank Giaccio offered to mow the White House lawn free of charge and was invited to mow the Rose Garden lawn alongside President Trump.\nDuring the Biden administration, Presidential Correspondence launched an official Twitter account. The office's deputy director, Courtney Corbisiero, and digital anaylst, Rebecca Brubaker, also have Twitter accounts.\nReferences"
    }
  ]
}