{
  "content": [
    {
      "type": "text",
      "text": "# Whitelackington\n\n|official_name=             Whitelackington\n|population=                209\n| population_ref = (2011)\n|unitary_england=          Somerset Council\n|lieutenancy_england =            Somerset\n|region=                  South West England\n|constituency_westminster=      Yeovil\n|post_town=        ILMINSTER\n|postcode_district =       TA19\n|postcode_area=            TA\n|dial_code=      01460\n|os_grid_reference=     ST385155\n}}\nWhitelackington is a village and civil parish on the A303 one mile north east of Ilminster, in Somerset, England. The parish includes Dillington Park and the hamlets of Atherstone and Ashwell.\nToponymy\nThe village's name is from Old English and is composed of two elements: the Old English personal name Hwitlāc and tun meaning \"farm\" but here in the sense of \"estate, village\". The name was recorded as Witelecintone in 1127.\nHistory\nWhitelackington was part of the hundred of Abdick and Bulstone.\nThe village was the main home in the 17th century of the Speke family, including George Speke, Mary Speke and their son Hugh Speke.\nRev. F. C. Johnson was vicar from 1825 to 1874. His wife was the elder sister of James Brooke, Rajah of Sarawak, and their second son, Charles, succeeded him after his elder brother, John Brooke Johnson (later changed to Brooke) was disinherited. John is buried in the churchyard, along with some other family members.\nGovernance\nThe parish council has responsibility for local issues, including setting an annual precept (local rate) to cover the council's operating costs and producing annual accounts for public scrutiny. The parish council evaluates local planning applications and works with the local police, district council officers, and neighbourhood watch groups on matters of crime, security, and traffic.\nThe parish council's role also includes initiating projects for the maintenance and repair of parish facilities, as well as consulting with the district council on the maintenance, repair, and improvement of highways, drainage, footpaths, public transport, and street cleaning. Conservation matters (including trees and listed buildings) and environmental issues are also the responsibility of the council.\nFor local government purposes, since 1 April 2023, the parish comes under the unitary authority of Somerset Council. Prior to this, it was part of the non-metropolitan district of South Somerset (established under the Local Government Act 1972). It was part of Chard Rural District before 1974.\nIt is also part of the Yeovil county constituency represented in the House of Commons of the Parliament of the United Kingdom. It elects one Member of Parliament (MP) by the first past the post system of election.\nChurch\nThe Church of St Mary the Virgin dates from the 14th century, and was built from hamstone. The interior fittings include a 14th-century piscina in the north transept, and in the east wall there is a richly decorated statue niche. Monuments include two defaced effigies on the floor of the south transept, a civilian of around 1350 and a knight in armour of 1375. The tomb of Sir George Speke (died 1583) is in Perpendicular rather than Renaissance style. There is also a monument to John Hanning (died 1807) by J. Richards of Exeter. The church has been designated by English Heritage as a Grade II* listed building.\nFurther reading\n*Collinson, Rev. John, [https://archive.org/details/historyantiqutit01colluoft/page/67  History and Antiquities of the County of Somerset], Vol.1, Bath, 1791, pp.&nbsp;66–70, White-Lackington\nReferences\nExternal links"
    }
  ]
}