{
  "content": [
    {
      "type": "text",
      "text": "# White Dwarf (magazine)\n\nWhite Dwarf is a magazine published by British games manufacturer Games Workshop, which has long served as a promotions and advertising platform for Games Workshop and Citadel Miniatures products.\nDuring the first ten years of its publication, it covered a wide variety of fantasy and science-fiction role-playing games (RPGs) and board games, particularly the role-playing games Advanced Dungeons & Dragons (AD&D), Call of Cthulhu, RuneQuest and Traveller.\nThese games were all published by other games companies and distributed in the United Kingdom by Games Workshop stores. The magazine underwent a major change in style and content in the late 1980s. It is now dedicated exclusively to the miniature wargames produced by Games Workshop.\nHistory\n1970s\nSteve Jackson and Ian Livingstone initially produced a newsletter called Owl and Weasel, which ran for twenty-five issues from February 1975 before it evolved into White Dwarf.\nOriginally scheduled for May/June 1977, White Dwarf was first published one month later. According to Shannon Appelcline, \"Issue #1 ... was a 20-page magazine printed on glossy stock with a two-color cover.\" The magazine had a bimonthly schedule, with an initial (and speculative) print run of 4,000. White Dwarf continued the fantasy and science fiction role-playing and board-gaming theme developed in Owl and Weasel. Due to the increase in available space, there was an opportunity to produce reviews, articles and scenarios to a greater depth than had been possible in Owl and Weasel.\n1980s\nDuring the early 1980s, the magazine focused mainly on the \"big three\" role-playing games of the time: Advanced Dungeons & Dragons, RuneQuest and Traveller.\nIn addition to this a generation of writers passed through its offices and onto other RPG projects in the next decade, such as Phil Masters and Marcus L. Rowland. The magazine included mini-game scenarios, capable of completion in a single night's play, rather than the long games typical of the off-the-shelf campaigns. This would often be in the form of a single task for either existing or new characters to resolve. These could either be added to existing campaign plots, or be used stand-alone, just for an evening, and were easily grasped by those familiar with RPG rules.\nDuring this period the magazine included many features such as the satirical comic strip Thrud the Barbarian and Dave Langford's \"Critical Mass\" book review column, as well as a comical advertising series \"The Androx Diaries\", and always had cameos and full scenarios for a broad selection of the most popular games of the time, as well as a more rough and informal editorial style.\nIn the mid to late 1980s, however, there was a repositioning from being a general periodical covering all aspects and publishers within the hobby niche to a focus almost exclusively on Games Workshop's own products and publications. The last Dungeons & Dragons article appeared in issue 93, with the changeover being complete by issue #102. In this respect it took over some of the aspects of the Citadel Journal, an intermittent publication that supported the Warhammer Fantasy Battle game. The magazine has always been a conduit for new rules and ideas for GW games as well as a means to showcase developments. It often includes scenarios, campaigns, hobby news, photos of recently released miniatures and tips on building terrain and constructing or converting miniatures.\nGrombrindal the White Dwarf is also a special character for the Warhammer Dwarf army, whose rules are published only in certain issues of White Dwarf (being revamped for the most recent edition of the rules). It is never stated who exactly the White Dwarf is, but it is implied that he is the spirit of Snorri Whitebeard, the last king of the Dwarfs to receive respect from an Elf. The image of the White Dwarf has graced the cover of many issues of the magazine. The image was also used on the character sheet for the Dwarf character in HeroQuest.\n2000s\nIn December 2004, White Dwarf published its 300th issue in the United Kingdom, Australia, and North America. Each issue contained many special \"freebies\" as well as articles on the history of the magazine and the founding of Games Workshop.\nThe monthly battle reports are a regular feature. Battle reports detail a battle between two or more forces, usually with their own specific victory conditions. The reports follow the gamers through their army selection, tactics and deployment, through the battle to their respective conclusions. The format varies, ranging from a simplified, generalized style to a more detailed and visual style.\nThe page count of the US and UK publications was substantially different (for example, bearing in mind the US/UK numbering difference: issue US #319, 156 pages; UK #320, 132 pages) with substantial differences in actual amount of content (for example in the same issues: US, 114 pages; UK, 71 pages) and each magazine had substantial overlap with the other as well as unique articles.\n2010s\nIn June 2010, Andrew Kenrick replaced Mark Latham as editor. Kenrick had previously been sub-editor, as well as editing other Games Workshop material such as the most recent edition of Codex: Space Marines.\nAs of the October 2012 issue, White Dwarf was redesigned with a new nine-member production staff with Matthew Hutson, Kris Shield and Andrew Kenrick continuing from the previous version, and six new members, including Jes Bickham as the new editor. Bickham had previously edited the Battle Games in Middle-earth magazine.\nWhite Dwarf continued to be published on a monthly basis until issue #409, January 2014. On 1 February 2014, the magazine moved to a 32-page format, published weekly and renumbered from issue 1. Warhammer Visions, a monthly sister title, was launched at the same time, in a format favouring the imagery over text. The weekly version of White Dwarf lasted for 131 issues. In September 2016, the magazine returned to its monthly format; it also subsumed Warhammer Visions.\nReviews\n*Perfidious Albion #20 (April 1977) p.17\n*Perfidious Albion #25 (February 1978) p.13\n*Perfidious Albion #27 (April 1978) p.17\nSee also\n* Battle Games in Middle-earth\n* Warlock (magazine)\nNotes\nReferences\nBibliography\n*\n*\nExternal links\n* [http://index.rpg.net/display-search.phtml?firstsearch=1&key=magazine&match=loose&value=White+Dwarf Index to White Dwarf] &mdash; browsable index by topic, covers #1-100, The Best of White Dwarf Articles #1 to #3, and The Best of White Dwarf Scenarios #3"
    }
  ]
}