{
  "content": [
    {
      "type": "text",
      "text": "# Why Democracy?__disambig_2\n\n| released =\n| runtime = 10 × 52 minutes\n| language =\n| budget =\n}}\nWhy Democracy? is a documentary film series produced by The Why Foundation, previously named Steps International. The series consists of 10 films depicting independent documentary filmmakers' personal perception of and experience with democracy. The series was broadcast by 42 different broadcasters worldwide between 8 and 18 October 2007. The series was accompanied by a global interactive conversation about \"democracy,\" which took place in real and interactive space.\nBackground\nThe series took almost four years to complete. The Why Democracy? series was launched in November 2004 by a group at the International Documentary Film Festival Amsterdam. Through a democratic process, The Why Foundation working group chose the ten best proposals, from a selection of 700. The filmmakers and movies are diverse in background, representing different experiences of contemporary democracy.\nThe goal is to stimulate a global conversation about democracy. Ten questions have been posed related to the ten documentaries, in order to encourage critical thinking and discussion. Online forums have been developed on a variety of different sites as well as on the Why Democracy? website, as another way for people to share and discuss their ideas of democracy.\nWhy Democracy? is primarily marketed through the Internet and its broadcasting partners to reach a global audience and inspire thoughts on democracy.\nFilms\nThe Why Democracy? series comprises ten feature films and a collection of short films. The ten movies are made by independent award-winning filmmakers from different countries. The films and countries of origin are as follows:\n*Please Vote for Me (China)\n*Looking for the Revolution (Bolivia)\n*Taxi to the Dark Side (United States)\n*In Search of Gandhi (India)\n*Dinner with the President (Pakistan)\n*For God, Tsar and Fatherland (Russia)\n*Iron Ladies of Liberia (Liberia)\n*Egypt: We are Watching You (Egypt)\n* (Denmark), about the Jyllands-Posten Muhammad cartoons controversy\n*Campaign! The Kawasaki Candidate (Japan)\nAwards\n*In June 2007 Please Vote for Me won the Sterling Feature Award at Silverdocs. Festival  Films  PLEASE VOTE FOR ME |access-date=28 May 2010 |archive-date=15 October 2007 |archive-url=https://web.archive.org/web/20071015061145/http://silverdocs.com/festival/films/please-vote-for-me/ |url-status=dead }}\n*Taxi to the Dark Side won\n**Best Documentary Feature award at the 80th Academy Awards.\n**Best Documentary Film Award at the 2007 Tribeca Film Festival.\nBroadcasting history\nThe series was sold to over forty broadcasters. The ten films were broadcast in October 2007 on ORF Austria, SBS Australia, RTBF (Belgium), Canal Futura (Brazil), CBC, Knowledge Canada, HRT Croatia, Czech Television (Czech Republic), DR TV ub Denmark, ETV Estonia, YLE Finland, ARTE France, ARTE G.E.I.E., MDR Germany, WDR Germany, ZDF Germany, ERT Greece, MTV Hungary, Doordarshan India, IBA Israel, RAI Italy, NHK Japan, LRT Latvia, , VPRO The Netherlands, NRK Norway, RTP Portugal, TVP Poland, TVR Romania, RTVSLO Slovenia, SABC South Africa, EBS South Korea, Canal + Spain, SVT Sweden, TSR Switzerland, PTS Taiwan, Al Arabiya Middle East, BBC United Kingdom, PBS USA, and BBC World.\nThe BBC showed them as part of their Storyville strand of documentaries. Avi Lewis hosted in Canada.\nThe Why Democracy? house\nIn June 2007 a group of young people from around the world was set to live and work together, creating and managing the online platform for the series in a real house in Cape Town.\nReferences\nExternal links\n*[http://www.whydemocracy.net Official Homepage]\n*[http://www.dr.dk/presse/Article.asp?articleID=25219 Article from DR - Danish Broadcaster]\n*[http://silverdocs.com/media/pdf/SD_07_Friday_Advisory_FINAL.pdf SilverDocs]\n*[http://www.jedensvet.cz/ow/2007/index_en.php?id=192&idp=459# One World Festival]\n*[http://www.indiewire.com/ots/2007/06/festivals_silve.html Indie Wire]\n*[http://www.team-productions.com/default.aspx?pageID=8593&menuId=7549&submenuId=7150&subsubmenuId=7575 Production Company of the series]\n*[https://news.bbc.co.uk/1/hi/programmes/newsnight/democracy/default.stm BBC \"Why Democracy?\" week]"
    }
  ]
}