{
  "content": [
    {
      "type": "text",
      "text": "# Wildwood Discovery Park\n\nWildwood}}\n|area             =\n|num_species      = 50+\n|num_animals      =\n|largest_tank_vol =\n|total_tank_vol   =\n|annual_visitors  = 100,000\n|members          =\n|exhibits         =\n|website          = [http://www.wildwoodtrust.org www.wildwoodtrust.org]\n}}Wildwood Trust (formerly known as Wildwood Discovery Park) is a woodland discovery park in Herne, near Canterbury in Kent, England. It features over fifty species of native British animals such as deer, badgers, wild boar, wolves and brown bear. It is located on the main road A291 between Herne Bay and Canterbury. They have a second site, Wildwood Devon, located on Escot Park in Ottery St Mary, Devon. They are a smaller collection housing 20 native British species.\nWildwood Trust is a Registered Charity in England, No 1093702, whose aim is to save British Wildlife from extinction and reintroduce recently made extinct animals such as European beaver, wild boar and modern tarpan (konik).\nVisitors to the park can see British animals species past and present, with the animals set in natural enclosures.\nHistory\nWildwood's history can be traced back to the 1970s when Terry Standford, Operations Director of English Woodlands, created a woodland nature reserve which grew into a small wildlife park in a woodland setting. This evolved into a small zoo called Brambles. Following major reinvestment from Terry Standford and his business partners Peter and David Rosling ‘Wildwood Discovery Centre’ started life in 1999 as a visitor centre, with the vision to educate local people about the need to conserve native\nwildlife and their habitats.\nAfter three years of Wildwood being open Derek Gow, its then owner, decided its future was best ensured by it becoming a charitable trust. A Charitable Trust was formed By Kenneth West, a retired company Chairman.  Ken West assumed the overall running of the park in June 2002, officially taking over the park in December of that year. Since then it has been known as The Wildwood Trust.\nThe trust has acquired a second site based at Escot Park in Devon.\nFollowing the death of Kenneth West in 2017, Paul Whitfield, ex Chairman of the Trustees, was appointed to take over the running of the Trust as its Director General. The Trust continues to grow under his guidance and is now one of the largest charities in Kent.\nSite\nA twisting trail winds through  of natural ancient woodland which is attached to the Blean, one of the largest areas of\nancient woodland in southern England. The woods have been managed by humans on a\ncoppice rotation, harvesting trees between 5–20 years, allowing the stools to regenerate. Parts of the Blean woods are a Site of\nSpecial Scientific Interest due to the presence of habitats and species of national importance. Heathy areas provides an\nimportant habitat for the rare heath fritillary butterfly Melitaea athalia, a UK BAP priority species, historically linked with traditional woodland coppicing. The caterpillar’s food plant, common cow-wheat is abundant in the woodland.\nConsisting mainly of sweet chestnut, silver birch and English oak, one area of Wildwood includes a former conifer plantation of\nCorsican pine and Western hemlock. Some timber is used in the park, while much is left to provide suitable habitat for invertebrates\nand small mammals. The natural wildlife in the park includes red foxes, hazel dormice, wood and yellow-necked mice, bank and\nfield voles, common and pygmy shrews, nightingales, woodpeckers (all three species), tawny owls, jays, tits (four species), thrushes, stag beetles, dragonflies, wood ants, bumblebees and butterflies.\nEducation\nWildwood Trust's Education team offers a range of Junior Level, GCSE and A level National Curriculum-linked programmes for local schools which can be tailored to each schools needs, such as adaptation, homes and habitats through to animals in Viking myths and English folklore, as well as running an informal public education programme including daily talks and events. Educators and animal staff work together to host a variety of programmes, from animal talks to training courses.\nThe Trust has recently appointed a Director of Conservation, Laura Gardner and a Director of Zoological Operations, Mark Habben in order to drive forward and expand their conservation work.\nConservation\nOne species that Wildwood is linked with is the breeding of water voles. This species was in recent years tagged ‘the most catastrophically endangered species in the UK’ because of the decline linked to habitat loss and the impact of introduced mink.  Wildwood Trust is now concentrating on reintroducing the species into new or reclaimed habitat through partnerships with other conservation organisations, including the Environment Agency, People's Trust for Endangered Species, WildCRU at Oxford University and the University of Greenwich.\nThere has been a reintroduction of captive-bred hazel dormice, with Wildwood stock transferred to sites in the Midlands and Yorkshire. Other on-going projects include DNA and behavioural research on pine martens with Waterford Institute of Technology in Éire; funding for the pool frog reintroduction with Herpetological Conservation\nTrust/English Nature; water shrew husbandry with Imperial College, London; and in-situ breeding of harvest mice with Chester Zoo.\nThey have been awarded funding from The Postcode Lottery to re-introduce Bison into Blean Woods, a project jointly run with Kent Wildlife Trust.\nTwo species (European beavers and konik polski) are currently used for these purposes on several reserves in Kent. Konik polski (meaning ‘Polish small horses’) are a robust breed closely related to the extinct tarpan and have been used in similar grazing schemes in the Netherlands and Poland. The long-term vision is for Wildwood Trust to manage large tracts of land with large once-native herbivores such as koniks, beavers, wild boar, and heck cattle (re-created aurochs).\nReferences\nExternal links\n*"
    }
  ]
}