{
  "content": [
    {
      "type": "text",
      "text": "# Wild Kingdom (album)\n\n| label        = The Star Apple Kingdom\n| producer     = Robert Harrison\n| prev_title   = Cotton Mather with Nicole Atkins\n| prev_year    = 2016\n| next_title   = Young Life E.P.\n| next_year    = 2017\n}}\n| rev2      = Paste\n| rev2score = 7.6/10\n}}\nWild Kingdom is the fifth full-length studio album by American rock band Cotton Mather. It is the third release in Robert Harrison's \"Songs from the I Ching\" project.\nBackground\nLike with the previous Cotton Mather album, Death of the Cool, these songs were written and recorded between 2013 and 2016. Many were originally published on Harrison's now-defunct Songs from the I Ching blog, although sometimes with different mixes or arrangements.\nTwo of the songs on Wild Kingdom, \"California\" and \"High Society\", were originally released as a digital single in 2013. \"California\" was accompanied by a music video directed by Marc Brown, who had previously been involved with the Kontiki deluxe reissue campaign. Following the release of Death of the Cool, a four-song EP was announced, titled \"Girl with a Blue Guitar\", to be released in December 2016. However, after the announcement and release of its first two tracks, \"Fighting Through\" and \"Girl with a Blue Guitar\", the EP was scrapped. Cotton Mather with Nicole Atkins was released in its place at the beginning of December. Though the full track listing for the planned EP was never revealed, both \"Fighting Through\" and \"Girl with a Blue Guitar\" were used on Wild Kingdom.\nTrack listing\nNote: This track list reflects the CD and LP running orders. Digital releases erroneously swap tracks 9 and 10.\nPersonnel\nMusicians\n* Robert Harrison\n* Whit Williams\n* Darin Murphy\n* George Reiff\n* Dana Myzer\n* Josh Gravelin\n* Conrad Choucroun\n* Billy Harvey\n* Jason Garcia\n* Anthony Farrell\nTechnical\n* Robert Harrison (production, recording)\n* Lars Göransson (recording, mixing, mastering)\n* George Reiff (mixing)\n* Paul Stacey (mixing)\n* Bob Ohlsson (mastering)\nReferences"
    }
  ]
}