{
  "content": [
    {
      "type": "text",
      "text": "# Wilhelm Busch (historian)\n\nWilhelm Busch (18 February 1861 – 23 September 1929) was a German historian who specialised in English sixteenth century history and German nineteenth century history. He later became, in addition, a university rector.\nLife and works\nKarl Eilhard Wilhelm Busch was born into a Protestant family in Bonn, where his father, also known as Wilhelm Busch, had been employed since 1855 as an increasingly senior university professor of surgery.   His mother, born Agnes Sophie Friederike Mitscherlich, was a daughter of the distinguished chemist Eilhard Mitscherlich.   He attended the town's \"Gymnasium\" (secondary)school), transferring half-way through his secondary school career to the Old St Nicholas School in Leipzig.\nHe studied as a student at the University of Bonn between 1880 and 1884, subject to two interludes during the winter term of 1880/81 and the summer term of 1882, when he was sent away to undertake his military service. The focus of his studies at Bonn was on History, Germanistics and Geography.   It was from Bonn that he received his doctorate in August 1884 in return for a dissertation entitled \"Drei Jahre englischer Vermittlungspolitik 1518–1521\" (loosely, \"Three years of English mediation policy ...\"), which concerned England's involvement in western European diplomacy during the years directly following the 1518 Treaty of London.   In the aftermath of unification in 1871, there emerged an intensified interest on the part of German historians in the evolution of highly centralised nation states in France and England during the early modern period.  In that context Henry VIII and his leading ministers were seen as important figures. In 1884 Busch moved to the University of Leipzig where he received his habilitation (higher academic degree) in March 1886. This time his dissertation amounted to a chronological sequel to the doctoral work.  It was entitled \"Cardinal Wolsey und die englisch-kaiserliche Allianz 1522-1525\":  it again addressed the diplomatic endeavours of The Cardinal.   Someone else who had made the transfer from Bonn to Leipzig in 1884 was Professor Wilhelm Maurenbrecher, evidently Busch's most influential teacher during his student years, about whom he later wrote a brief but appreciative biographical obituary.\nThe habilitation opened the way for a life-long teaching career in the universities sector. He remained at Leipzig, employed between 1886 and 1890 as a Tutor (\"Privatdozent\") in Modern History.   On 5 July 1890 he was appointed an extraordinary professor in history. He then, in April 1893, transferred from Leipzig to nearby Dresden, having been offered and accepted a full professorship in history at the \"Royal Saxon Polytechnic Institute\" (as it was known at that time).   In April 1894 he moved again, accepting a full professorship in history at Freiburg University in the extreme south-west of the country. This involved taking the position that had become vacant through the departure of Erich Marcks who had moved east, to the University of Leipzig. Just two and a half years later, in October 1896, Busch moved on again, this time taking a full professorship in history at Tübingen.\nBusch's final career move came in April 1910 when he was offered and accepted a professorship in medieval and modern history at the University of Marburg. The position came with an appointment as director of the university's \"Historical Seminar (department)\". He also took his share of administrative responsibilities, serving during 1913/14 as dean of the entire Philosophy Faculty. During 1919/20 and again during 1926/27 he served a term as university rector.\nOutput (selection)\nNotes\nReferences"
    }
  ]
}