{
  "content": [
    {
      "type": "text",
      "text": "# William Arthur Ward\n\n| birth_place        = Oakdale, Louisiana\n| death_date         =\n| known_for          = Motivational sayings\n}}\nWilliam Arthur Ward (December 17, 1921 – March 30, 1994) was an American motivational writer. He wrote over 4,000 epigrams, or positive sayings, which were published in ''Reader's Digest and on the front page of the Fort Worth Star-Telegram. They were also collected into 13 books including Thoughts of a Christian Optimist, Up Words, Reward Yourself!, and Think It Over''. His sayings have been published extensively in inspirational posters, greeting cards, diaries, and wall plaques, and have appeared in commercials.\nEarly life and education\nWard served in the United States Army in the Philippines during World War II. He graduated from McMurry College in 1948.\nWard received his master's degree in Agriculture and Applied Science at Oklahoma State University in 1949, and continued his studies at the University of Texas and at North Texas State University. In 1962, he was awarded an honorary degree from Oklahoma City University in recognition of his “professional achievement, literary contributions and service to others.”\nCareer\nWriting\nMore than 100 articles, poems and meditations written by Ward were published in such magazines as ''Reader's Digest. Other publications included The Phi Delta Kappan, Science of Mind, and various Christian publications. His column “Pertinent Proverbs” was published by the Fort Worth Star-Telegram and also in American service club publications. He was a frequently quoted writer in Quote, an international weekly digest for public speakers.\nEmployment\nFrom 1949 to 1955, Ward was director of public relations for the Schreiner Institute in Kerrville, Texas.\nWard was an assistant to the president of Texas Wesleyan College (now Texas Wesleyan University) in Fort Worth beginning in 1955. After 25 years, he took an early retirement in 1979, but returned in 1985 as a semi-retired employee.\nChurch\nHe was also the public relations director for Harris Methodist Fort Worth. For two years, he was the director of Methodist men for the Methodist Central Texas Conference, and for four years he taught the 140-member Sigler Bible Class at Polytechnic Methodist Church, where he also served as Sunday School superintendent and a church lay leader.\nAssociations\nWard was a member of the board of directors of the Fort Worth Public Library and Longhorn Council of the Boy Scouts of America. From 1970 to 1971, he was president of the Rotary Club of Fort Worth. He was also chairman of the Tarrant County chapter of the American Red Cross.\nHe was a professional member of the American College Public Relations Association, the Religious Public Relations Council, and Phi Delta Kappa.\nNotable epigrams\nExamples of his most famous epigrams include:\n* If you can imagine it, you can achieve it; if you can dream it, you can become it.\n* We can start each day with apprehension, or anticipation; cynicism, or optimism; apathy, or adventure.\n* No person is strong enough to carry a cross and a prejudice at the same time.\n* Alter your attitude and you will change your life.\n* Every sunrise is a message from God, and every sunset is his signature.\n* The mediocre teacher tells. The good teacher explains. The superior teacher demonstrates. The great teacher inspires.\nHis words appeared at the entrance of the West Library at Texas Wesleyan University:\n* Enter these portals all ye who dare to discover. Who search for enlightenment. Who thirst for knowledge. Who hunger for truth. Who yearn for wisdom.\nWorks\n*Fountains of Faith,\n*For This One Hour, ASIN B000OKBF82\n*Thoughts of a Christian Optimist ASIN B00POEXA5O\n*Prayer Is''\nReferences\nExternal links\n*"
    }
  ]
}