{
  "content": [
    {
      "type": "text",
      "text": "# William Stewart of Monkton\n\nWilliam Stewart of Monkton and Carstairs (died 1588) was a Scottish landowner and courtier.\nCareer\nHe was a son of Andrew Stewart, 2nd Lord Ochiltree and Agnes Cunningham. His elder brother was James Stewart, Earl of Arran and his sister Margaret Stewart married John Knox.\nAccording to the English diplomats Thomas Randolph and Edward Hoby, he was known as \"William the Sticker.\" His estates were at Monkton, Ayrshire and Carstairs.\nRichard Musgave of Carlisle complained about goods sold at Kirkcudbright in 1581, involving Stewart. Stewart went to Ruthven Castle to oppose the Raid of Ruthven in 1583. He lost two fingers in the fighting and was captured.\nIn November 1584 James VI granted him a pension from the lands of Whithorn Priory which had previously been paid to his sister-in-law, Margaret Stewart, Mistress of Ochiltree.\nStewart of Monkton was Provost of Ayr in 1585.\nIn 1585 the former royal favourite James Stewart, Earl of Arran embarked on Robert Jameson's boat carrying royal jewellery including 'Kingis Eitche', the Great H of Scotland, but he was forced to give his treasure up to this William Stewart, or another William Stewart, William Stewart of Caverston, aboard ship in the coastal water known as the Fairlie Road.\nIn 1588 James VI hired a ship from Robert Jameson, probably the James Royall of Ayr, for Stewart to pursue the rebel Lord Maxwell with 120 musketeers or \"hagbutters\". Maxwell escaped but William Stewart of Monkton caught him at Crossraguel. Stewart then joined James VI at the siege of Lochmaben Castle. He negotiated a surrender with David Maxwell, but it is said the king insisted on using cannon borrowed from England against the castle, and David Maxwell and the other commanders were hung.\nStewart was keeping custody of Lord Maxwell in Robert Gourlay's house in Edinburgh, when Francis Stewart, 5th Earl of Bothwell killed him on Blackfriar's Wynd in July 1588. Bothwell stabbed him with his rapier, and Stewart ran and tried to hide in a cellar, where Bothwell's men \"stobbed him with whingers till he was despatched. The murder followed a quarrel in the king's presence in which, according to David Calderwood, Stewart asked to Bothwell to kiss him behind.\nMarriage and family\nHe married Helen Cunningham. Their children included a son William, and a daughter Margaret.\nThis William Stewart killed James Douglas, Lord Torthorwald, a son of George Douglas of Parkhead, in Edinburgh on 14 July 1608, in revenge for the murder of his uncle James Stewart, Earl of Arran.\nOthers called William Stewart\nWilliam Stewart of Monkton can be confused with contemporaries of the same name:\n* William Stewart of Houston known as Colonel Stewart\n* William Stewart, the king's valet\n* William Stewart of Caverston, Captain of Dumbarton Castle, and later Laird of Traquair.\n* William Stewart of Grandtully, known as the \"Ruthless\" for his property deals\n* William Stewart, skipper and captain of the Bruce of Leith\n* William Stewart, a servant of Regent Morton mentioned in Morton's \"Confession\".\nReferences"
    }
  ]
}