{
  "content": [
    {
      "type": "text",
      "text": "# William Edwardes, 1st Baron Kensington\n\n| birth_place  =\n| death_date   = 13 December\n| death_place  =\n| education    =\n| father       = Francis Edwardes\n| spouse       = Rachel Edwardes (d. 1760)\n| children     = 1+, including William\n}}\nWilliam Edwardes, 1st Baron Kensington (c. 1711 &ndash; 13 December 1801) of Johnston Hall, Pembrokeshire, was a British landowner and a long-standing Member of Parliament.\nBiography\nEdwardes was the second surviving son of Francis Edwardes, Member of Parliament for Haverfordwest, and Lady Elizabeth Rich, only daughter of Robert Rich, 5th Earl of Warwick and heiress of her nephew Edward Henry Rich, 7th Earl of Warwick. The Edwardes family owned extensive lands in Pembrokeshire, Carmarthenshire and Cardiganshire and on the death of his cousin the 7th Earl in 1721 and his elder brother in 1738, William inherited the additional estates of the Rich family, which included Holland House in Kensington. In 1776 he was created Baron Kensington in the Peerage of Ireland. This was a revival of the barony held by the Earls of Warwick and Holland which had become extinct on the death of the eighth and last Earl in 1759.\nEdwardes was elected to his father's old seat of Haverfordwest in 1747, a seat he held until 1801, with a brief exception between 1784 and 1786. His tenure as member for Haverfordwest was based on an arrangement with Lord Milford, the member for the Pembrokeshire county constituency, whose family treated Haverfordwest like a pocket borough.\nLord Kensington died in 1801. He had firstly married his cousin Rachel, the daughter of Owen Edwardes of Trefgarn but after her death in 1760 he had married Elizabeth Warren in 1762. He was succeeded in the barony by their only son William, who also succeeded him as member of parliament for Haverfordwest. Lady Kensington died in November 1814.\nReferences\nSources\n*\n*Kidd, Charles, Williamson, David (editors). ''Debrett's Peerage and Baronetage'' (1990 edition). New York: St Martin's Press, 1990,\nSources\n*"
    }
  ]
}