{
  "content": [
    {
      "type": "text",
      "text": "# William de Warenne, 1st Earl of Surrey\n\n|parents           =\n|spouse = Gundred, Countess of Surrey\n|successor = William de Warenne, 2nd Earl of Surrey\n}}\nWilliam de Warenne, 1st Earl of Surrey, Lord of Lewes, Seigneur de Varennes (died 1088), was a Norman nobleman named the first Earl of Surrey under William II Rufus. He is among the few known from documents to have fought under William the Conqueror at the Battle of Hastings in 1066. At the time of Domesday Book in 1086 he held extensive lands in 13 counties, including the Rape of Lewes, a tract now divided between the ceremonial counties of East Sussex and West Sussex.\nEarly career\nWilliam was a son of Rodulf or Ralph de Warenne and Emma and reported to have descended from a sibling of Duchess Gunnor, wife of Duke Richard I. Chronicler Robert of Torigni reported, in his additions to the Gesta Normannorum Ducum of William of Jumièges, that William de Warenne and Anglo-Norman baron Roger de Mortimer were both sons of an unnamed niece of Gunnor. Unfortunately Robert's genealogies are somewhat confused – elsewhere he gives Roger as the son of William and yet again makes both sons of Walter de Saint Martin – while several of Robert's stemmata seem to contain too few generations. Orderic Vitalis describes William as Roger's consanguineus – literally a cousin, more generally a term of close kinship not typically used to describe brothers – and Roger de Mortimer appears to have been a generation older than him.\nCharters report several earlier men associated with Warenne. A Radulf de Warenne appears in two charters, one dating between 1027 and 1035, the other from about 1050 and naming his wife, Beatrice. In 1059, a Radulf and wife Emma appear along with their sons Radulf and William. These occurrences have typically been taken to represent a single Radulf with successive wives, of which Beatrice was the mother of William and hence identical to the Gunnorid niece described by Robert de Torigny, yet the 1059 charter explicitly names Emma as William's mother.\nRe-evaluation of surviving charters led Katherine Keats-Rohan to suggest that Robert of Torigni compressed two generations into one, as he appears to have done elsewhere, with Radulf (I) and Beatrice being parents of Radulf (II) de Warenne and of Roger de Mortimer – a Roger son of Radulf de Warenne appears in a charter dated 1040/1053 – while Radulf (II) in turn married Emma, and as attested by the 1059 charter, they had as sons Radulf (III) as the heir in Normandy, and William. Associations with the village of Vascœuil led to identification of the Warenne progenitrix with a widow Beatrice, daughter of Tesselin, Viscount of Rouen, who appeared there in 1054–1060. Robert of Torigni shows a different Viscount of Rouen to have married a niece of Gunnor, perhaps suggesting that it was through Beatrice that William de Warenne was linked with Gunnor's family.\nWilliam was from the hamlet of Varenne, near Arques-la-Bataille, Duchy of Normandy, now in the canton of Bellencombre, Seine Maritime.\nAt the beginning of Duke William's reign Radulf de Warenne was not a major landholder, whilst William de Warenne as a second son did not stand to inherit the family's small estates. During the rebellions of 1052–1054 the young William de Warenne proved himself loyal to the Duke and played a strong part in the Battle of Mortemer, for which he was rewarded with lands confiscated from his kinsman, Roger of Mortemer, including the Castle of Mortimer and most of its lands.\nAt about the same time he acquired lands at Bellencombre including the castle that became the centre of William de Warenne's holdings in Normandy.\nConquest of England\nWilliam was among the Norman barons summoned to the Council of Lillebonne by Duke William when the decision was made to oppose King Harold II's accession to the throne of England. He fought at Hastings and was rewarded with numerous holdings. Domesday records his lands stretching over 13 counties, including the important Rape of Lewes in Sussex, several manors in Norfolk, Suffolk and Essex, the major manor of Conisbrough in Yorkshire and Castle Acre in Norfolk, which became his headquarters or caput.\nHe is one of few proven companions of William the Conqueror known to have fought at the Battle of Hastings in 1066. He fought against rebels at the Isle of Ely in 1071, where he showed a special desire to hunt down Hereward the Wake, who had killed his brother-in-law Frederick the year before.\nHereward is supposed to have unhorsed him with an arrow shot.\nLater career\nSometime between 1078 and 1082 William and his wife Gundred travelled to Rome, visiting monasteries on the way. In Burgundy they were halted by a war between Emperor Henry IV and Pope Gregory VII. They visited Cluny Abbey in France and were so impressed by the monks and their dedication that they decided to found a Cluniac priory on their own lands in England, for which William restored buildings for an abbey. They sent to Hugh, Abbot of Cluny, to staff their monastery. At first Hugh was reluctant, but he finally sent several monks, including Lazlo, who was to be the first Abbot. The house founded was Lewes Priory, dedicated to St Pancras, which was England's first Cluniac priory.\nWilliam supported the King in the siege of Saint-Suzanne against some rebellious lords. His loyalty to William II led to his creation as Earl of Surrey, probably in early 1088. In the Rebellion of 1088 he was mortally wounded at the First Siege of Pevensey Castle, and died on 24 June 1088 at Lewes, now in East Sussex. He was buried beside his wife, Gundred, in the chapter house of Lewes Priory which he had founded.\nFamily\nWilliam de Warenne married first, before 1070, Gundred, Countess of Surrey, sister of Gerbod the Fleming, 1st Earl of Chester.\nWilliam married secondly a sister of Richard Gouet, who survived him.\nIssue\nBy Gundred, William had:\n*William de Warenne, 2nd Earl of Surrey (died 1138), who married Elisabeth (Isabelle) de Vermandois, widow of Robert de Beaumont, 1st Earl of Leicester\n*Edith de Warenne, who married first Gerard de Gournay, lord of Gournay-en-Bray, and then Drew de Monchy\n*Reynold de Warenne, who inherited lands from his mother in Flanders and died c. 1106–1108\n*A daughter of unknown name, who married Ernise de Coulonces.\nHe had no issue by his second wife.\nWarenne Landholdings in the Domesday Book\n*Aylmerton, County of Norfolk\n*Acre, County of Norfolk\n*Aldborough, County of Norfolk\n*Anmer, County of Norfolk\n*Bagthorpe, County of Norfolk\n*Banham, County of Norfolk\n*Banningham, County of Norfolk\n*Barmer, County of Norfolk\n*Barnham Broom, County of Norfolk\n*Barsham, County of Norfolk\n*Barwick, County of Norfolk\n*Blo' Norton, County of Norfolk\n*Bodney, County of Norfolk\n*Bradenham, County of Norfolk\n*Brampton, County of Norfolk\n*Briston, County of Norfolk\n*Buckenham, County of Norfolk\n*Burnham Thorpe, County of Norfolk\n*Carlton, County of Cambridgeshire\n*Chishill, County of Cambridgeshire\n*Clipstone, County of Norfolk\n*Coltishall, County of Norfolk\n*Colton, County of Norfolk\n*Colveston, County of Norfolk\n*Congham, County of Norfolk\n*Corpusty, County of Norfolk\n*Cranwich, County of Norfolk\n*South Creake, County of Norfolk\n*Croxton near Fakenham, County of Norfolk\n*Denver, County of Norfolk\n*Deopham, County of Norfolk\n*Didlington, County of Norfolk\n*Downham Market, County of Norfolk\n*Elsing, County of Norfolk\n*Filby, County of Norfolk\n*Fincham, County of Norfolk\n*Flitcham, County of Norfolk\n*Foulden, County of Norfolk\n*Fransham, County of Norfolk\n*Fring, County of Norfolk\n*Fulmodeston, County of Norfolk\n*Gayton, County of Norfolk\n*Gimingham, County of Norfolk\n*Great Ryburgh, County of Norfolk\n*Gresham, County of Norfolk\n*Gressenhall, County of Norfolk\n*Grimston, County of Norfolk\n*Griston, County of Norfolk\n*Hackford near Reepham, County of Norfolk\n*Harpley, County of Norfolk\n*Hautbois, County of Norfolk\n*Heacham, County of Norfolk\n*Helhoughton, County of Norfolk\n*Hempton, County of Norfolk\n*Hilborough, County of Norfolk\n*Hilgay, County of Norfolk\n*Hillington, County of Norfolk\n*Hingham, County of Norfolk\n*Hockwold, County of Norfolk\n*Holkham, County of Norfolk\n*Houghton,County of Norfolk\n*Ickburgh, County of Norfolk\n*Illington, County of Norfolk\n*Irmingland, County of Norfolk\n*Itteringham, County of Norfolk\n*Kempstone, County of Norfolk\n*Kerdiston, County of Norfolk\n*Kettlestone, County of Norfolk\n*Kennett, County of Cambridgeshire\n*Knapton, County of Norfolk\n*Larling, County of Norfolk\n*Letton, County of Norfolk\n*Lexham, County of Norfolk\n*Little Barningham, County of Norfolk\n*Little Ellingham, County of Norfolk\n*Little Ryburgh, County of Norfolk\n*Little Snoring, County of Norfolk\n*Mannington, County of Norfolk\n*Marham, County of Norfolk\n*Massingham, County of Norfolk\n*Mattishall, County of Norfolk\n*Methwold, County of Norfolk\n*Morley Saint Botolph, County of Norfolk\n*Mundesley, County of Norfolk\n*Mundford, County of Norfolk\n*North Barningham, County of Norfolk\n*North Barsham, County of Norfolk\n*North Walsham, County of Norfolk\n*Northwold, County of Norfolk\n*Outwell, County of Norfolk\n*Palgrave, County of Norfolk\n*Paston, County of Norfolk\n*Pickenham, County of Norfolk\n*Pangdean, County of East Sussex\n*Patcham, County of East Sussex\n*Plumstead, County of Norfolk\n*Poynings, County of East Sussex\n*Rainthorpe (now Rainthorpe Hall, Flordon), County of Norfolk\n*Repps, County of Norfolk (Southrepps)\n*Repps, County of Norfolk (Northrepps)\n*Rockland, County of Norfolk\n*Rockland St Peter, County of Norfolk\n*Roudham, County of Norfolk\n*Rougham, County of Norfolk\n*Rudham, County of Norfolk (Now East & West Rudham)\n*Saddlescombe, County of East Sussex\n*Salthouse, County of Norfolk\n*Santon, County of Norfolk\n*Scarning, County of Norfolk\n*Sco Ruston, County of Norfolk\n*Shereford, County of Norfolk\n*Shernborne, County of Norfolk\n*Shipdham, County of Norfolk\n*Sidestrand, County of Norfolk\n*Snettisham, County of Norfolk\n*South Acre, County of Norfolk\n*Southburgh, County of Norfolk\n*Stanfield, County of Norfolk\n*Stanhoe, County of Norfolk\n*Stibbard, County of Norfolk\n*Stinton, County of Norfolk (now Stinton Hall, Salle)\n*Sustead, County of Norfolk\n*Syderstone, County of Norfolk\n*Tattersett, County of Norfolk\n*Taverham, County of Norfolk\n*Thompson, County of Norfolk\n*Thorpe Market, County of Norfolk\n*Threxton, County of Norfolk\n*Trumpington, County of Cambridgeshire\n*Thurning, County of Norfolk\n*Thuxton, County of Norfolk\n*Tittleshall, County of Norfolk\n*Toftrees, County of Norfolk\n*Trunch, County of Norfolk\n*Tuttington, County of Norfolk\n*Waterden, County of Norfolk\n*Weeting, County of Norfolk\n*Weston Colville, County of Cambridgeshire\n*West Wickham, County of Cambridgeshire\n*West Wratting, County of Cambridgeshire\n*Welborne, County of Norfolk\n*West Dereham, County of Norfolk\n*West Walton, County of Norfolk\n*Whilton, County of Norfolk\n*Wimsbotsham, County of Norfolk\n*Wisbech, County of Cambridgeshire\n*Witton Nr North Walsham, County of Norfolk\n*Wolterton, County of Norfolk\n*Wood Dalling, County of Norfolk\n*Wood Rising, County of Norfolk\n*Yelverton, County of Norfolk\n}}\nSee also\n*Warenne family\n*Rebellion of 1088\nNotes\nReferences\nSources\n*L. C. Loyd, \"The Origin of the Family of Warenne\", Yorkshire Archaeological Journal'', Vol. xxxi (1933), 97–113"
    }
  ]
}