{
  "content": [
    {
      "type": "text",
      "text": "# William Sanderson (historian)\n\nWilliam Sanderson (c. 1586 – 15 July 1676) was an English historian.\nCareer\nSanderson was secretary to Henry Rich, 1st Earl of Holland, when Holland was chancellor of the university of Cambridge. James Howell describes him as being from his youth bred up at court, and \"employed in many negotiations of good consequence both at home and abroad\". He suffered in the cause of Charles I, and was made a gentleman of the privy chamber by Charles II and knighted. Holland had made him a grant of the Paddock Walk, Windsor Park, which was confirmed at the Restoration. On 7 June 1671 a pension of £200 per annum was granted to Sanderson and his wife jointly. He died 15 July 1676, aged ninety, according to his epitaph, and was buried in Westminster Abbey. John Evelyn attended his funeral and describes him as \"author of two large but mean histories and husband to the mother of the maids\".\nHistorian\nSanderson was author of Aulicus Coquinariæ, or a Vindication in Answer to a Pamphlet entitled “The Court and Character of King James” (1650). This was an answer to the posthumous book of Sir Anthony Weldon.\nIn 1656 his A Compleat History of the Lives and Reigns of Mary, Queen of Scotland, and her son James was published. His A Complete History of the Life and Reign of King Charles from his Cradle to his Grave (1658), devoted much space to answering Roger L'Estrange's History of Charles I and Peter Heylyn's observations upon it. This involved him in a controversy with Heylyn, who published, early in 1658, ''Respondet Petrus, or the Answer of Peter Heylyn, D.D., to Dr. Bernard's Book entitled “The Judgment of the late Primate of Ireland,” to which is added an Appendix in Answer to certain Passages in Mr. Sanderson's “History of the Life and Reign of King Charles”. Pages 139–57 are devoted to disproving Sanderson, and in particular to refuting his account of the passing of the Attainder Bill against the Earl of Strafford.\nSanderson replied in Post Haste, a Reply to Dr. Peter Heylyn's Appendix (25 June 1658). Heylyn rejoined in his Examen Historicum'' (1659), over two hundred pages of which consist of a searching criticism of Sanderson's historical works. Sanderson's defence, entitled Peter Pursued (1658–9), closed the controversy.\nPersonal life\nSanderson married, about 1626, Bridget, daughter of Sir Edward Tyrrell, baronet, of Thornton, Buckinghamshire; she was mother of the maids of honour to Catherine of Braganza, died on 17 January 1682, and was buried in Westminster Abbey.\nWorks\n*Aulicus Coquinariæ, or a Vindication in Answer to a Pamphlet entitled “The Court and Character of King James” (1650).\n*Compleat History of the Lives and Reigns of Mary Queen of Scotland, and of her Son James (1656).\n*An Answer to a Scurrilous Pamphlet Intituled, ‘Observations upon a compleat history of the lives and reignes of Mary, Queen of Scotland, and of her son, King James’ (1656).\n*A Compleat History of the Life and Raigne of King Charles from his Cradle to his Grave (1658).\n*''Post Haste: A Reply to Dr Peter Heylyn's Appendix (25 June 1658).\n*Graphice: the Use of the Pen and Pensil'' (1658).\nNotes"
    }
  ]
}