{
  "content": [
    {
      "type": "text",
      "text": "# William Woodward Sr.\n\n| birth_place   = New York City\n| death_date    =\n| death_place   = New York City\n| death_cause   =\n| education     = Cutler SchoolGroton School\n| alma_mater    = Harvard UniversityHarvard Law School\n| known_for     = Owner of Belair Mansion and Belair Stud\n| occupation    = Banker\n| spouse        =\n| children      = Edith Woodward BancroftEthel Woodward deCroissetElizabeth Woodward CushingSarah Woodward SewallWilliam Woodward Jr.\n| parents       = William WoodwardSarah Abagail Rodman\n}}\nWilliam Woodward Sr. (April 7, 1876 – September 25, 1953) was an American banker and major owner and breeder in thoroughbred horse racing.\n__TOC__\nEarly life\nWoodward was born in New York City on April 7, 1876. He was a son of Sarah Abagail (née Rodman) Woodward (1840–1913) and William Woodward Jr. (1836–1889), who came from a prominent and wealthy Maryland family that dated back to colonial times. The family, who were already well established textile merchants, made their fortune in selling textiles to both the Unionist government and Confederate government, his father was the founder of the New York Cotton Exchange and an important financial backer of Benito Juárez's Liberal government. His uncle, James T. Woodward, was one of the chief financiers who acquired the rights for the Panama Canal from France for the United States.\nHe was educated at the Cutler School in New York before preparing at Groton. He attended Harvard University, graduating in 1898, followed by Harvard Law School, where he graduated in 1901. In 1901, he was admitted to the bar.\nCareer\nFor the next two years Woodward lived in London where he served as secretary to the United States Ambassador to Britain, Joseph Hodges Choate. There, he joined with other members of the political and economic elite including King Edward VII, at fashionable events including thoroughbred horse races, the favorite pastime of English royalty and nobility.\nUpon his return to New York in 1903, Woodward was made vice president of Hanover National Bank in New York City by his uncle, James T. Woodward, who was then president of the bank. Woodward's grandfather had helped James purchase a large portion of the bank years earlier before his death, which the younger Woodward inherited, therefore owning a controlling interest in the bank.\nFollowing his uncle's death, William Woodward Sr. became president of the bank in 1910, serving in that capacity until a 1929 merger with the Central Union Trust Company when he was appointed chairman of the new corporate entity called Central Hanover Bank & Trust, and Central's president, George W. Davison, became president of the new entity. Woodward served as chairman of the board from 1929 until his retirement in 1933.\nWoodward was one of the original directors of the Federal Reserve Bank of New York in 1914 and from 1927 to 1929, he was president of the New York Clearing House.\nBelair and thoroughbred racing\n]]\nWoodward also inherited the historic Belair Mansion and 2,500 acre Stud in Collington, Maryland.  Belair is a very historic estate where Colonial Governor of Maryland Samuel Ogle had brought the first Thoroughbred horses imported to America from England in 1747. His uncle James had acquired it in 1898 for an undisclosed sum of money. Upon inheriting the property, Woodward built the Belair Stud into one of the dominant breeding and thoroughbred horse racing operations in the United States during the 1930s, 40s, and 50s.\nIn 1925, Woodward joined Arthur B. Hancock, Marshall Field III and Robert A. Fairbairn to import the stallion Sir Gallahad III into the United States to stand at Claiborne Farm. Sir Gallahad III would become a four-time leading sire in North America and would sire 60 stakes winners, including nine for Woodward. Sir Gallahad III's most famous offspring was Triple Crown winner Gallant Fox, who would in turn sire Triple Crown winner Omaha, both bred and raced by Woodward.\nHorses bred by Belair won every major stakes race in the U.S. as well as The Oaks, St. Leger Stakes, 1,000 Guineas, and other important races in Britain. Woodward's accomplishments in horse racing led to him making the August 7, 1939 cover of Time magazine.\nWoodward was elected to the United States Jockey Club in 1917 and served as its chairman from 1930 until 1950. One of the main efforts he pursued was the repeal of the Jersey Act, a regulation of the British Thoroughbred stud book that prevented most American-bred Thoroughbreds from being registered in the United Kingdom as purebred Thoroughbreds.\nIn 1950, Woodward was elected an honorary member of the British Jockey Club.\nPersonal life\nIn 1903, Woodward met Elsie Ogden Cryder (1882–1981) at Saratoga Springs, New York, a daughter of tea importer Duncan Cryder and Elizabeth Callender (née Ogden) Cryder and one of the \"famous Cryder triplets\". They were married at Grace Church in New York on October 24, 1904. Elsie's younger sister Edith was the wife of Frederick Lothrop Ames Jr. and her aunt, the former Mary Hone Ogden, was the wife of Charles Francis Adams Jr. (the grandson of president John Quincy Adams). Together, they were the parents of one son and four daughters, including:\n* Edith Woodward (1905–1971), who married Thomas Moore Bancroft in 1929.\n* Elizabeth Ogden Woodward (1907–1986), who married Robert Livingston Stevens (1907–1972) in 1928. They divorced in 1935, and she married John Teele Pratt Jr., a son of John Teele Pratt, in 1935. After his death in 1969, she married Squaw Valley Ski Resort founder Alexander Cochrane Cushing in 1971.\n* Sarah Woodward (1910–1991), who married Charles Arthur Moore III (1909–1989) in 1936. They divorced and she married Marshall Christopher Sewall (1908–1983) in 1949.\n* Ethel Woodward (b. 1914), who married Philippe de Croisset (1912–1965), a son of French playwright Francis de Croisset, in 1941. His nephew was Count Philippe de Montebello and his sister was Marie-Laure, Vicomtesse de Noailles. After having two sons, Ethel and Philippe divorced and he married Jacqueline de la Chaume (after his death in 1965, Jacqueline became the third wife of actor Yul Brynner).\n* William Woodward Jr. (1920–1955), who married Ann Crowell in 1943⁠. In 1955 Ann shot and killed William, reportedly thinking him a burglar. She later committed suicide in 1975, after Truman Capote published a story that \"depicted her as a murderous vamp.\"\nIn 1908, they lived at 11 West 51st Street in New York City and had a summer home in Mount Kisco, New York. Around 1910, they purchased The Cloisters on Ochre Point in Newport, Rhode Island, the former estate of Catherine Lorillard Kernochan, which had been designed by architect J.D. Johnston around 1885. The Woodwards hired New York architects Delano & Aldrich to complete a major renovation, which was completed by 1914. The home was torn down in 1950 and the site was divided into smaller parcels for contemporary homes. The family also relocated from their 51st Street residence to 9 East 86th Street, which Woodward had purchased for $200,000 from William E. Iselin in 1916 and, again, hired architects Delano & Aldrich to design and build him a residence.\nWoodward died on September 25, 1953, aged 77, at his home in Manhattan. After a funeral at St. James Episcopal Church in Manhattan, he was buried at Woodlawn Cemetery, Bronx. He left the estate to his son, William Woodward Jr., whose untimely death two years later in 1955 saw the end of Belair Stud. His widow, considered \"one of the last grandes dames of New York society\", died in her apartment at The Waldorf Towers, where she had lived since 1956, in 1981.\nLegacy\nToday the Belair Stable Museum in Bowie, Maryland, highlights the work of William Woodward Sr. and others connected to the Belair Stud. The Woodward Stakes, a Grade II event now run at Aqueduct, during the Belmont at The Big A meet, is named in his honor.\nIn 2016, Woodward was inducted into the National Museum of Racing and Hall of Fame as a Pillar of the Turf.\nReferences\nExternal links\n* [http://www.horseracinghistory.co.uk/hrho/action/viewDocument?id=1276 A brief biography of William Woodward at the U.K. National Horseracing Museum]\n* The Baltimore Museum of Art. Annual 1 The Museum: Its First Half Century(Baltimore, Maryland: The Baltimore Museum of Art, 1966), 58.\n*"
    }
  ]
}