{
  "content": [
    {
      "type": "text",
      "text": "# William D. Warner\n\n|birth_place          = New Rochelle, New York\n|death_date           =\n|death_place          = Exeter, Rhode Island\n|practice             = William D. Warner; William D. Warner Architects and Planners\n|significant_buildings=\n|significant_design   =\n|awards               =\n}}\nin Woonsocket, completed in 1974.]]\n, completed in 1987.]]\n, completed in 1994, and surrounding buildings.]]\n, completed in 2000.]]\n, completed in 2007, with the Fox Point Hurricane Barrier in the foreground.]]\nWilliam D. Warner  (1929–2012) was an American architect and urban planner in practice in Providence and Exeter, Rhode Island from 1959 to 2012.\nLife and career\nWilliam Diaz Warner was born July 14, 1929, in New Rochelle, New York to Russell E. Warner and Alice C. (Diaz) Warner. He was educated at the Massachusetts Institute of Technology in Cambridge, Massachusetts, earning a BArch in 1956 and an MArch in 1957. While in school he worked for acoustical engineers Bolt, Beranek and Newman and architects The Architects Collaborative. After graduation he joined the staff of the City Plan Commission in Providence, Rhode Island, and was project director for a preservation plan for College Hill executed in association with the Providence Preservation Society. Published in 1959, their report, College Hill: A Demonstration Study of Historic Area Renewal, was influential in both local and national preservation practices.\nAfter the completion of the report Warner opened an architects office in Providence. His interest in historic architecture influenced his own work, which was part of the larger Postmodern architecture movement. He became notable first for a series of schools and churches before being selected architect for larger institutional projects for the Rhode Island School of Design, the University of Rhode Island and the Woonsocket Harris Public Library. An important unexecuted project was a National Endowment for the Arts-funded competition design for the Provincetown Playhouse in Provincetown, Massachusetts. Warner won the competition but the building was never built.\nWhen reviewing Warner's Pierce School in Brookline, Massachusetts, Boston Globe architecture critic Robert Campbell described it as a \"kind of inaccurate imitation of a Bavarian castle\" that is nonetheless a \"relaxed and personal\" design that, rather than following Sullivan's maxim that \"form follows function,\" embraces the \"fact that form also has all kinds of symbolic meanings for all kinds of people.\"\nWarner is best remembered for his role in the reconfiguration of downtown Providence towards the end of the twentieth century. In 1981 a group of three architects, Friedrich St. Florian, Irving B. Haynes and Warner, devised the original scheme for what would become Waterplace Park. This was in response to the recently approved Capital Center plan, which the three saw as offering nothing meaningful to the public realm. This led to a formal study by Warner's firm in 1984 and ultimately Waterplace Park was completed in 1994. For his work at Waterplace Warner was awarded a 1997 Presidential Award for Design Excellence from President Bill Clinton. Warner also had a role in other important elements of Providence's so-called \"Renaissance,\" including the Manchester Street Generating Station repowering, completed in 1996, and the Providence River Bridge, completed in 2007. Warner was active in his practice, William D. Warner Architects and Planners, until his death.\nWarner joined the American Institute of Architects (AIA) in 1963 and was elected a Fellow in 1981. Warner was a 2003 recipient, with Barnaby Evans, of the Kevin Lynch Award and was inducted into the Rhode Island Heritage Hall of Fame in 2004.\nPersonal life\nWarner was married to Margaret Hansen. He had five children from two previous marriages. In the 1970s they purchased Locust Valley Farm in Exeter, where he would live and work for the rest of his life, building a house on the property and moving his practice into Lawton's Mill. He died on August 27, 2012, at the age of 83. In 2013 his work was the subject of a posthumous exhibition organized by the Rhode Island chapter of the AIA.\nArchitectural works\n* Gordon School, East Providence, Rhode Island (1963 and 1970)\n* Westminster Unitarian Church, East Greenwich, Rhode Island (1963)\n* Medical Research Labs, Brown University, Providence, Rhode Island (1964–65)\n* Church of the Messiah, Foster, Rhode Island (1966)\n* Bancroft School, Andover, Massachusetts (1968–69, demolished 2014)\n* North Kingstown Public Safety Building, Wickford, Rhode Island (1971)\n* Moshassuck Square Apartments, Providence, Rhode Island (1972)\n* Mount Hope Court Apartments, Providence, Rhode Island (1972)\n* James N. Byers III house, Providence, Rhode Island (1973)\n* Woonsocket Harris Public Library, Woonsocket, Rhode Island (1973–74)\n* Waterville Valley Elementary School, Waterville Valley, New Hampshire (1974)\n* John R. Pierce School, Brookline, Massachusetts (1974)\n* Watkins Laboratory, University of Rhode Island Narragansett Bay Campus, Narragansett, Rhode Island (1978)\n* St. Augustine Episcopal Church, Kingston, Rhode Island (1982)\n* Marine Resources Building, University of Rhode Island Narragansett Bay Campus, Narragansett, Rhode Island (1983)\n* East Hall and South Hall, Rhode Island School of Design, Providence, Rhode Island (1985–87)\n* Exeter-West Greenwich Regional High School, West Greenwich, Rhode Island (1990)\n* Manchester Street Generating Station repowering, Providence, Rhode Island (1992–95)\n* BankNewport City Center, Providence, Rhode Island (1997–98)\n* John Nazarian Center for the Performing Arts, Rhode Island College, Providence, Rhode Island (1998–2000)\n* Providence River Bridge, Providence, Rhode Island (2006–07)\nNotes\nReferences"
    }
  ]
}