{
  "content": [
    {
      "type": "text",
      "text": "# William King (Maine governor)\n\n| birth_place =Scarborough, Province of Massachusetts Bay, British America\n| death_date =\n| death_place = Bath, Maine, U.S.\n| nationality =\n| spouse =\n| party = Democratic-Republican\n| relations =\n| children =\n| residence =\n| alma_mater =\n| occupation =\n| profession =\n| religion =\n| signature =\n| signature_alt =\n| website =\n| footnotes =\n}}\nWilliam King (February 9, 1768June 17, 1852) was an American merchant, shipbuilder, army officer, and statesman from Bath, Maine. A proponent of statehood for Maine, he became its first governor when it separated from Massachusetts in 1820. He was the half-brother of Rufus King, who was a member of the Confederation Congress from Massachusetts, delegate to the Constitutional Convention of 1787, served as United States Senator from New York (from 1789 to 1796 and again from 1813 to 1825), and as Minister Plenipotentiary to the Court of St. James from 1796 to 1803 and again from 1825 to 1826.\nPersonal and business career\nin the National Statuary Hall Collection at the U.S. Capitol]]\nWilliam King was born to Richard King, a merchant and shipowner, and Mary Black, on February 9, 1768, at Scarborough, then in the Province of Massachusetts Bay. His formal education was limited to local schools (he spent one term at Phillips Academy) and ended when he was thirteen. He was largely self-educated. Starting as a hand in a saw-mill, he went on to open his own mill.\nKing was employed in a wide variety of businesses, including as a shipbuilder, then a ship-owner. He became the largest merchant shipping owner in Maine. He became a successful merchant and a significant real-estate investor. He opened the first cotton mill in Maine, at Brunswick. He founded and was president of the first bank of Bath.\nIn 1812, what is now known as the Stone House, King's summer retreat, was built in rural Bath.\nKing was a Scottish Rite Freemason and later – while he was the Governor of the State – he became the first (Past) Grand Master of Maine, elected in June 1820, by the representatives of twenty-four Lodges which \"met, adopted a Constitution, and elected officers\".\nPolitical career\nKing became active politically in 1795 as a member of the Democratic-Republican Party. He represented Topsham in the Massachusetts House of Representatives in 1795 and 1799. After he moved to Bath, he represented that town in 1804. He served in the Massachusetts Senate for Lincoln County from 1807 to 1811.\nWhen the War of 1812 began, Massachusetts made him major general of the militia, in charge of the District of Maine. He devoted much of his attention to coastal shipping and defenses. He also led recruiting efforts for the regular army, for which he was made a colonel in the United States Army. In 1813 King began a seven-year effort that started with his petition to Massachusetts for separation.\nIn 1816 he was re-elected to the Massachusetts Senate, and finally secured their approval for Maine to become a separate state, in 1818. The Missouri Compromise allowed Maine to be recognized as a state on March 15, 1820. He was shortly thereafter elected governor of the new state.\nIn May 1821, President James Monroe named him as one of three commissioners to settle land claims from the 1819 Adams–Onís Treaty known as the Spanish Claims Commission. King resigned as governor  on May 28, 1821, to take the position of U.S. commissioner, serving until 1824.\nIn 1828 he was appointed by president Andrew Jackson to serve as Customs Collector of Bath.\nWith the shifting of political parties, he ran once more for governor, as a Whig in 1835, but lost.\nLater life\nKing continued as a prominent business man, investor, and ship-owner. Even though he had a very limited education, he served for years as a trustee and overseer of Bowdoin College, and as a trustee of Waterville College (now called Colby College).\nHe died at home, in Bath, Maine, on June 17, 1852, and is buried in the city's Maple Grove Cemetery.\nLegacy\nIn 1878, the State of Maine placed the William King statue by sculptor Franklin Simmons in the National Statuary Hall of the U.S. Capitol Building. In 1902, a descendent placed a plaque on a boulder at the King Burial Ground in Scarborough to memorialize Richard King and his sons, including William. In 2024, the Scarborough Historical Society added an information sign to provide additional information about the family.\nFurther reading\n*\n*\nReferences\nExternal links\n*\n* [http://www.nga.org/cms/home/governors/past-governors-bios/page_maine/col2-content/main-content-list/title_king_william.html National Governors Association]\n* [http://www.aoc.gov/cc/art/nsh/king_w.cfm Architect of the Capitol]"
    }
  ]
}