{
  "content": [
    {
      "type": "text",
      "text": "# William Stewart of Houston\n\nSir William Stewart of Houston (c. 1540 – c. 1605) was a Scottish soldier, politician and diplomat.\nHe is often known as \"Colonel Stewart\", or the Commendator of Pittenweem.\nLife\nWilliam Stewart was a younger son of Thomas Stewart of Galston He began his career as a soldier in the Netherlands, where he became a colonel and entered into communications with Lord Burghley on the progress of affairs. In 1582 he was in Scotland, and James VI made him captain of his guard.\nHe visited the English court in the king's interest in 1583 with John Colville and George Young. The French ambassador Michel de Castelnau described him as a \"poor Scottish adventurer\". Later that year, Stewart helped to free James from William Ruthven, 1st Earl of Gowrie, and to bring back his cousin James Stewart, Earl of Arran to power; these acts largely restored the young King James's position, after the Raid of Ruthven. On 4 September 1583 at Falkland Palace James VI ordered that Colonel Stewart be given some of the jewels that had belonged to his mother Mary, Queen of Scots, including a gold cross previously given to his favourite, Esmé Stewart, 1st Duke of Lennox.\nHe was made a privy councillor and assisted Arran in governing Scotland. In April 1584 he captured Gowrie at Dundee. In 1585 he and Arran lost their power, and Stewart went to Denmark and France on secret errands for the king.\nNorway and Denmark\nColonel Stewart became prominent in the king's marriage negotiations with Denmark, joining an embassy with Peter Young. In February 1588 an informant wrote to Francis Walsingham that Stewart had returned from Denmark with news of agreement that James VI should marry the younger daughter Anne of Denmark, according to the wishes of her mother Sophie of Mecklenburg-Güstrow, because she \"thinks her most meet for him.\" In June 1589, Edinburgh merchants protested against the possibility of James VI marrying Catherine of Bourbon, making \"unreverent speeches\" about her. According to Thomas Fowler, Peter Young and Stewart told James that she was \"old and crooked\".\nHe travelled to Norway in 1589 where the Danish fleet carrying Anne of Denmark rested, and brought back her letters of 3 October to James VI. He then returned to Norway. In December 1590 he sailed to Scotland with instructions for the ruling council from James VI, including orders for ships for the king's return, the reception ceremony for the queen and repairs to Holyrood Palace.  He arrived at Kronborg on 4 April with a letter to James VI from Queen Elizabeth. On 7 April 1590 he wrote from Helsingør to the English diplomat in Edinburgh, Robert Bowes. James VI had a valet in Denmark who was also called \"William Stewart\" and this was also the name of one of the captains of his fleet. He commanded the ships which conveyed James and his bride, Anne, from Denmark in April 1590.\nIn June 1590 James VI of Scotland sent John Skene and Stewart as ambassadors to Denmark and Germany. The mission was to intended to cement a peaceful league in Europe. They met the mother of Anne of Denmark, Sophie of Mecklenburg-Güstrow at Braunschweig, then went on to meet William IV, Landgrave of Hesse-Kassel at Rotenburg an der Fulda and Christian I, Elector of Saxony at Dresden. In April 1591 the English ambassador Robert Bowes joked with Stewart over the lack of written responses the king had received.\nBothwell's rebellions\nStewart was imprisoned in Edinburgh Castle in January 1592. It was suspected that he had helped the rebel Earl of Bothwell try to capture James VI at Holyrood Palace. His wife Erika was also banished from court, for stirring up controversy between the Chancellor, John Maitland of Thirlestane and James VI and Anne of Denmark.\nHe was at court at Falkland Palace in June 1592, and was arrested on suspicion of planning to help the rebel Earl of Bothwell capture the king. He was imprisoned at Burleigh Castle, and then taken to Robert Gourlay's house in Edinburgh. In July 1592 he was questioned by the Chancellor, John Maitland of Thirlestane, the Secretary, Richard Cockburn, John Carmichael, and John Skene, about his dealings with Bothwell. Stewart admitted that he had been in Edinburgh Castle playing cards with the imprisoned Earl of Bothwell shortly before Bothwell escaped on 21 June 1591, and denied that he had secret communications with Bothwell. To gain favour and divert suspicions, Stewart and Sir James Sandilands accused Alexander Lindsay, 1st Lord Spynie of entertaining the rebel Earl of Bothwell at Aberdour Castle in 1592 but he denied this.\nDiplomat and Lieutenant of the Isles\nTwice he went on missions to the Netherlands and States General, seeking confirmation of the Treaty of Binche or Bins. In 1594 he was knighted and was granted lands at Houston in West Lothian. His fee for the lands was used to pay the expenses of ambassadors at the baptism of Prince Henry. John Wemyss of Logie heard in September 1595 that he had been in Mecklenburg and Braunschweig, where Christian IV of Denmark had travelled to meet his future wife, Anne Catherine of Brandenburg.\nJames VI made him Lieutenant of the Isles in 1596, instead of a Gaelic noble from the Western Isles. This caused some resentment, and the Earl of Argyll refused to meet with him and claimed to be unwell.\nWilliam Stewart was sent on an embassy to Denmark in May 1598, escorting Ulrik, Duke of Holstein who had been travelling in England and Scotland, and returned in July. Michael Balfour accompanied them.\nLater life\nIn February 1600 he encountered the Earl of Gowrie in a long gallery or passage in Holyrood Palace. He had arrested the earl's father in 1584. The earl made to move out of Stewart's way then reconsidered. Stewart noted this and complained to the king as an offence to his long service and dignity, warning that Gowrie was a threat to the court. Gowrie was told about this, and said \"Aquila non captat muscus\", meaning the eagle does not catch flies, that Stewart was beneath his attention.\nHe died before 1606.\nFamily and children\nStewart married in 1582, Erica or Erika (1540-1587), Countess of Batenburg in Gelderland and Manderscheid, the widow of Willem van Bronckhorst-Batenburg (1529-1573). They were given lands at the Mains of Tantallon Castle, forfeited by the Earl of Angus, in November 1584.\nOn 7 June 1590 he married Isobel Hepburn, Lady Pitferran, at Holyroodhouse. Anne of Denmark was godmother to his only son, Frederick (1591-1625). Their daughter Anna was baptised in June 1595. Lady Pitferran gave information leading to the arrest of John Wemyss of Logie in 1592.\nWilliam Stewart was created a peer as Lord Pittenweem in 1609, and died in December 1625.\nOthers of this name\nWilliam Stewart of Houston is often confused with other contemporaries of the same name, including:\n* William Stewart of Banchrie and Grandtully (1567-1646), a courtier\n* William Stewart of Monkton (d. 1588), a brother of James Stewart, Earl of Arran, who was killed in a fight in Edinburgh in July 1588\n* William Stewart (courtier), a valet of James VI\n* William Stewart of Caverston and later Laird of Traquair, Captain of Dumbarton Castle\n* William Stewart, skipper of the Bruce of Leith for George Bruce of Carnock\n* William Stewart, a servant of Regent Morton mentioned in Morton's \"Confession\".\nReferences"
    }
  ]
}