{
  "content": [
    {
      "type": "text",
      "text": "# William Bartley (colonial administrator)\n\nWilliam Bartley (3 January 1885 – 21 March 1961) was a British colonial administrative service officer who served in Singapore, Straits Settlements.\nEarly life and education\nBartley was born on 3 January 1885 in Belfast, Northern Ireland. He was educated at St Columb’s College and Trinity College Dublin.\nCareer\nBartley joined the Straits Settlements civil service in 1908, went to Malaya as a cadet, and was attached to the Secretariat. In the following year he went to Java to study Javanese. After he returned from Java he acted in a number of different capacities, and in 1915 took up his first substantive appointment as Director of the War Trade of the Department of Imports and Exports, Straits Settlements.\nIn 1917, he became secretary to the Committee of Food Control, Singapore, in the following year was appointed to the consultative committee, and also served on the Shipping and other committees. He received the thanks of the Secretary of State for his work in connection with problems of food control in Singapore, and in 1919 was rewarded with the honour of MBE.\nHis subsequent appointments were Acting Collector General of Income Tax, 1920; Assistant Adviser of Kelantan, 1922; Commissioner of Lands, Straits Settlements, 1926; Under Secretary to Government, Straits Settlements, 1930; and as President of the Municipal Commissioners, 1931 to 1939, when he also acted as Colonial Secretary. After he became President of the Singapore Municipal Commissioners, succeeding R. J. Farrer in 1931, he proved himself to be an able leader and administrator of the Municipal affairs of the settlement. In his final report for 1938 as Municipal President he said that the accounts were in surplus, and that there were large developments in the water supply, the sewerage system, health services, and the control of mosquitoes had resulted in their number being reduced to a small fraction. In 1944, he was attached to the War Office and the following year was Senior Civil Affairs Officer of the British Military Administration, Singapore. In 1946, he briefly returned to Singapore when asked to advise on certain matters related to the Municipality before he retired later that year.\nPersonal life and death\nBartley married Lesley Marrion Brown from Queensland, and they had a daughter. He died on 21 March 1961.\nHonours\nBartley was appointed Member of the Order of the British Empire (MBE) in the 1919 Birthday Honours. He  was appointed Companion of the Order of St Michael and St George (CMG) in the 1937 Coronation Honours.\nReferences\nExternal links\n[https://www.nas.gov.sg/archivesonline/photographs/record-details/d2b83442-1161-11e3-83d5-0050568939ad Portrait of William Bartley] at the National Archives of Singapore."
    }
  ]
}