{
  "content": [
    {
      "type": "text",
      "text": "# Willie Keil's Grave State Park Heritage Site\n\n| coords_ref       =\n| area             =\n| elevation        =\n| authorized       =\n| created          =\n| established      = 1959\n| designated       =\n| opened           =\n| opening          =\n| closed           =\n| founder          =\n| designer         =\n| etymology        =\n| owner            =\n| administrator    = Washington State Parks and Recreation Commission\n| manager          =\n| operator         =\n| visitation_num   =\n| visitation_year  =\n| visitation_ref   =\n| open             =\n| status           =\n| awards           =\n| camp_sites       =\n| hiking_trails    = None\n| paths            =\n| terrain          =\n| habitat          =\n| water            =\n| plants           =\n| vegetation       =\n| species          =\n| collections      =\n| designation      = Washington state park\n| disturbance      =\n| budget           =\n| parking          = Gravel lot\n| publictransit    =\n| transport        =\n| free_label       =\n| free_data        =\n| other_info       =\n| facilities       = None\n| website          =\n| embedded         =\n| child            =\n}}\n'''Willie Keil's Grave State Park Heritage Site''', part of the Washington State Parks system, is located on Washington State Route 6 north of Menlo, Washington, and 5 miles southeast of Raymond. The park is the burial site of Willie Keil, known as the \"Pickled Pioneer\".\nHistory\nWillie Keil was born January 12, 1836, in Bethel, Missouri, to German-born American immigrants Dr. William Keil and Louisa Reiter. The family was part of a religious community, known as Bethelites, who planned to migrate to the West. Willie had trained to drive an ox wagon and was planned to have been the lead driver for the migration expedition. Before departure, Willie became ill with malaria and died on May 19, 1855, four days before the trek was to leave Missouri. Willie, before his death, asked his father to continue the journey regardless of Willie's illness. Dr. Keil honored his son's wishes, converting a wagon into a hearse and transporting Willie's body during the pilgrimage. Willie's remains were preserved in a whiskey-filled lead-lined tin coffin as the wagon train traveled to the Washington Territory.\nDuring the expedition, members of the Sioux nation came upon the wagon train outside of Fort Kearny and viewed Willie's remains, offering to escort the party to its destination in a swift manner. The entire migration, 34 wagons total, survived the trip to present-day Menlo and Willie was buried on December 26, 1855, on a hill that overlooks the state park. Due to the nature of Willie's embalming, he was given the moniker, the \"Pickled Pioneer\".\nAs Dr. Keil did not find the area suitable for the building of a community, most members of the wagon train resettled at Aurora, Oregon. Other pioneers are also interred at the park. A family descended from the original expedition donated the  for the park in 1959.\nMyths and legends\nReports and retellings of Willie Keil, his body and death, as well as the Bethelites journey, have led to a few myths that are not substantiated. Published accounts claim Willie's illness may have been due to cholera and the casket made of different types of materials, including zinc. Willie's body has been reported to have provided safe passage through Native American lands during the migration, assumed as a manner of respect for the dead during a time of war between settlers and indigenous people. In various accounts, during the readying of the wagon train, the camp of followers suffered severe sickness and many travelers died before the expedition began.\nPark features\nHikers and bicyclists using the Willapa Hills Trail can access the site by making a slight crossing over the highway. The park has a heritage marker and interpretive panels. The gravesite itself is not accessible to the public.\nSignificance\nThe travel of Willie Keil's body was considered to be possibly the longest funeral procession in history by Guinness World Records. In 1993, a wagon train reenactment of the journey took place to celebrate coinciding milestones of the centennial of Aurora and the 150-year anniversary of the Oregon Trail. The event included a mannequin of Willie, colloquially referred to as \"Pickled Willie\", which was laid in a coffin and symbolically buried in Aurora.\nNotes\nReferences\nSources\n*\n*\n*}}\n*\nExternal links\n* at Washington State Parks"
    }
  ]
}