{
  "content": [
    {
      "type": "text",
      "text": "# William Frédéric Edwards__disambig_1\n\nWilliam Frédéric Edwards (1777–1842) was a French physiologist, of Jamaican background, who was also a pioneer anthropologist. He has been called \"the father of ethnology in France\".  He is remembered largely for his principle of the permanency of physical \"types.\"  He was also a leader in the new science of \"linguistique\" and proposed a new branch of comparative philology based on pronunciation.\nLife\nHe was born in Jamaica to English parents, and was a pupil at New College, Hackney, a contemporary of William Hazlitt. Educated also in Bruges, he worked first in the city library there. He went to Paris in 1808 as a medical student. There he studied under François Magendie, wrote a thesis on the physiology of the eye, and became Magendie's assistant.\nEdwards was naturalised in France in 1828, and elected a Fellow of the Royal Society in 1829. He belonged to or contributed to a number of French learned societies; in 1832 he was elected to the Académie des sciences morales et politiques and Académie Royale de Médécine.\nScientific works\nEdwards began independent research in 1815–6, working on manganese oxide compounds with Pierre Chevillot. At the same time he began investigations on asphyxia in animals.\nEdwards was a vitalist who studied the effect of physical forces on processes in living organisms. His work led to the book ''De l'influence des agens physiques sur la vie'' (1824) (English translation by Thomas Hodgkin). Edwards was following a direction in Lavoisier's research on \"animal chemistry\", and addressing questions raised in Magendie's journal. He carried out experimental work at the Collège de France.\nRacial theories\nEdwards was influenced by Amédée Thierry, to whom he addressed his 1829 essay ''Des caractères physiologiques des races humaines considérés dans leurs rapports avec l'histoire. Thierry had studied the backgrounds of the Gauls and Franks of the Late Antique period in France. Edwards took up a theory of \"permanence of types\", influenced also by René Primevère Lesson. As related by Edwards, he had been convinced of such a permanence since the early 1820s, when on a visit to London he was discussing the works of James Cowles Prichard with Hodgkin and Robert Knox. Knox convinced him, with the help of an Ancient Egyptian tomb exhibited by Giovanni Battista Belzoni, that Egyptian and other ethnic \"types\" persisted from antiquity.\nAs Edwards made clear, his notion of \"type\" was flexible; and racial types became fundamental to 19th century debate on ethnology. He followed on from the studies of Johann Kaspar Lavater and Franz Joseph Gall in physiognomy, and pioneered the concept of race as determined by the shape of the face and head. He supplemented his physiological work with a study of the Celtic languages.\nStendhal took his ideas on race from Edwards, who in fact established the concept of ethnologie (ethnology) in France. Another personal contact among writers was Jules Michelet: Edwards became his physician, and Michelet took ideas about \"persistence of races\" from Edwards and Thierry. This theorising applied very much to Europeans and particularly French people, and Edwards believed his own observations confirmed it. Edwards has been called the first anthropologist to discuss race. One of his concerns was justification of French nationalism.\nEdwards came to theorise broadly about human diversity, influenced by polygenism, and argued in favour of fixed types and characters attached to populations. He undermined the environmentalist monogenism of Prichard, in which climate had affected human populations after a single creation: he made a point of discounting the influence of climate on animal physiology in general. A remark he made about cross-bred animal populations, to the effect that one type comes to predominate, was quoted by Charles Darwin in The Variation of Animals and Plants Under Domestication.\nSociété Ethnologique de Paris and its influence\nEdwards followed up his work correlating physiological characteristics with races, and other interests, by the foundation in 1839 of the Société Ethnologique de Paris, with a broader programme including also languages and traditions; its goal was to define human groups and identify their origins. The foundation of the Ethnological Society of New York and Ethnological Society of London followed within a few years. When Paul Broca founded the Société d'Anthropologie de Paris in 1859, he drew on the definition Edwards had given of ethnology.\nNotes\nFurther reading\n* Stewart, Ian B. \"William Frédéric Edwards and the study of human races in France, from the Restoration to the July Monarchy.\" History of Science 58.3 (2020): 275–300.\nExternal links\n* [http://cths.fr/an/prosopo.php?id=2650 French database page]\n*[http://onlinebooks.library.upenn.edu/webbin/book/lookupname?key=Edwards%2c%20W%2e%20F%2e%20%28William%20Fr%26eacute%3bd%26eacute%3bric%29%2c%201777-1842&c=x Online Books page]"
    }
  ]
}