{
  "content": [
    {
      "type": "text",
      "text": "# William Warner (cricketer)\n\n|         death_place = Laverstock, Wiltshire, England\n|             batting = Right-handed\n|             bowling =\n|                role =\n|              family = Townsend Warner (brother)\n|               club1 = Cambridge University\n|               year1 = 1865–1868\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 13\n|               runs1 = 323\n|            bat avg1 = 16.15\n|           100s/50s1 = –/1\n|          top score1 = 50\n|      hidedeliveries = true\n|  catches/stumpings1 = 7/–\n|                date = 25 January\n|                year = 2023\n|              source = https://www.espncricinfo.com/cricketers/william-warner-227492 Cricinfo\n}}\nWilliam Sidney Oke Warner (29 August 1844 – 22 October 1871) was a Welsh-born English cricketer who played in 13 first-class cricket matches for Cambridge University between 1865 and 1868. He was born at Swansea, Glamorgan and died at Salisbury, Wiltshire.\nWarner was educated at home in Devon by his clergyman father and then at Trinity College, Cambridge. He had played a lot of cricket for the Gentlemen of Devon team as a right-handed middle-order batsman, but failed to make much impression on Cambridge cricket in either 1865 or 1866. In 1867, however, he scored 43 in his first match against the Marylebone Cricket Club (MCC). He then retained his place in the first eleven all the way through to the University Match against Oxford University when, top-scoring for his side in each innings with 27 and 34 not out, he played a big part in a Cambridge victory. He played again regularly in 1868 and made his highest first-class score, 50, in the match against Surrey. His final first-class match was the 1868 University Match, though his contribution to another Cambridge victory was limited.\nWarner graduated from Cambridge University with a Bachelor of Arts degree in 1868. He was ordained as a Church of England deacon in 1870 and served as curate at Shalfleet on the Isle of Wight from that year. After a year, however, he died, aged 27.\nWarner's older brother The Reverend George Townsend Warner (1841-1902) was a much less successful cricketer at Cambridge. He was also the great-uncle of Sylvia Townsend Warner (1893-1978), the English novelist, poet and musicologist.\nReferences\nExternal links\n*"
    }
  ]
}