{
  "content": [
    {
      "type": "text",
      "text": "# Willawong, Queensland\n\n| pop                 = 145\n| pop_year            =\n| pop_footnotes       =\n| established         = 1970\n| postcode            = 4110\n| area                = 8.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 17.3\n| dir1                = S\n| location1           = Brisbane CBD\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Brisbane(Moorooka Ward)\n| stategov            = Algester\n| fedgov              = Oxley\n| near-n              = RockleaArcherfield\n| near-ne             = Acacia Ridge\n| near-e              = Acacia Ridge\n| near-se             = Algester\n| near-s              = Pallara\n| near-sw             = Doolandella\n| near-w              = Durack\n| near-nw             = Oxley\n}}\nWillawong is an outer southern suburb in the City of Brisbane, Queensland, Australia. In the , Willawong had a population of 145 people.\nGeography\nWillawong is  by road south of the Brisbane GPO.\nThe suburb's boundary is mostly defined by the course of the two creeks, Oxley Creek and Blunder Creek. The Sydney–Brisbane rail corridor is aligned along the eastern edge of the suburb.\nHistory\nThe suburb of Willawong was officially created and named by the Queensland Places Names Board in 1970. Willawong is an Aboriginal word meaning the junction of two creeks.\nDuring the 1974 Brisbane flood, most of the suburb was inundated. In 1983, local residents in Willawong and nearby suburbs began a campaign to stop sand mining in the area.\nWillawong once contained a toxic waste dump, which was closed in 1998.\nDemographics\nIn the , Willawong had a population of 192 people, 45.8% female and 54.2% male. The median age of the Willawong population was 40 years, 3 years above the Australian median. 59.8% of people living in Willawong were born in Australia, compared to the national average of 69.8%; the next most common countries of birth were Taiwan 9.3%, Vietnam 5.2%, England 4.6%, Indonesia 2.6%, New Zealand 2.6%. 62.1% of people spoke only English at home; the next most common languages were 11.8% Vietnamese, 7.7% Mandarin, 1.5% Urdu, 1.5% Dutch, 1.5% Greek.\nIn the , Willawong had a population of 177 people.\nIn the , Willawong had a population of 145 people.\nEducation\nThere are no schools in Willawong. The nearest government primary schools are Acacia Ridge State School and Watson Road State School, both in neighbouring Acacia Ridge to the east, Durack State School in neighbouring Durack to the west, and Inala State School in Inala to the west. The nearest government secondary schools are Glenala State High School in Durack to the west and Calamvale Community College in Calamvale to the east.\nFacilities\nBrisbane City Council operates a resource recovery centre at 360 Sherbrooke Road (). Residents can dispose of general waste, garden waste, and recyclables this centre.\nThere is a Transport for Brisbane bus depot at 399 Sherbrooke Road. The  site is Brisbane's largest bus depot and can accommodate over 200 buses with facilities for refueling, vehicle maintenance, administration, and staff facilitities for car parking and recreation.\nAmenities\nThe Kingdom Hall of Jehovah's Witnesses is at 174 Learoyd Road ().\nCongregational Christian Church of Samoa is at 228 Learoyd Road (). It is also known as EFKS Southwest Brisbane, where EFKS is an abbreviation of ''Ekalesia Fa'apotopotoga Kerisiano Samoa, which translates as Congregational Christian Church of Samoa. Over the entrance door are the Samoan words Puna O Le Olataga which translate as Source of Salvation''.\nDespite its name, the Archerfield Wetlands is a  greenspace precinct within the suburbs of Durack, Willawong, Rocklea, and Oxley in the Oxley Creek corridor. It borders the Archerfield Airport. The main entry point to the wetlands is via the Archerfield Wetlands District Park at 455 Bowhill Road, Durack. The district park replaces the former Inala wastewater treatment plant and has a number of indoor and outdoor community spaces, playgrounds with water features, and picnic and barbeque facilities. It is also the start of a number of walking and cycling trails through the larger wetlands.\nReferences\nExternal links\n*"
    }
  ]
}