{
  "content": [
    {
      "type": "text",
      "text": "# William Howard Taft IV\n\n| birth_place         = Washington, D.C., U.S.\n| death_date          =\n| death_place         =\n| party               = Republican\n| spouse              =\n| children            = 3\n| relatives           = Taft family\n| education           = Yale University (BA)Harvard University (JD)\n}}\nWilliam Howard Taft IV (born September 13, 1945) is an American diplomat and attorney who served in the United States government under several Republican administrations. He is a son of William Howard Taft III and a great-grandson of President William Howard Taft.\nEarly life and education\nTaft was born on September 13, 1945, in Washington, D.C., the second child of William Howard Taft III and Barbara Bradfield. Taft IV's patrilineal great-grandfather was U.S. President William Howard Taft. He attended St. Paul's School in Concord, New Hampshire graduating in 1962. Taft IV earned his bachelor of arts degree in English from Yale University in 1966 and his Juris Doctor degree from Harvard Law School in 1969.\nPersonal life\nHe married Julia Vadala in 1974. The couple has three children.\nCareer\nAfter researching the  Federal Trade Commission (FTC) as one of the first of \"Nader's Raiders\"; during 1969–1970, he was briefly the attorney adviser to the chairman of the FTC. During 1970–1973, he was the principal assistant to Caspar W. Weinberger, who was deputy director, then director of the Office of Management and Budget in the Executive Office of the President under President Richard Nixon. Taft assisted Weinberger in the management of the budgetary process, policy review, and program oversight for all of the federal government.\nTaft served from 1973 to 1976 as the executive assistant to the United States Secretary of Health, Education, and Welfare. In April 1976 Taft was appointed by President Gerald Ford to serve as general counsel of the Department of Health, Education, and Welfare. In the post, as the chief lawyer for the department and the principal administrator of the Office of the General Counsel, he supervised over 350 lawyers in Washington and 10 regional offices. During the Carter administration, he was an attorney with the Washington, D.C. law firm of Leva, Hawes, Symington, Martin and Oppenheimer.\nIn February 1981, Taft was among President Ronald Reagan first nominations, as General Counsel of the Department of Defense. Taft was appointed Deputy Secretary of Defense and served from January 1984 to April 1989. He served as acting Secretary of Defense from January to March 1989 after George H. W. Bush became president. Bush's initial nominee, John Tower, was not confirmed by the United States Senate after much contentious debate and testimony. The eventual appointee confirmed in March was Dick Cheney (later Vice President of the United States, 2001–2009). Although he was only acting secretary of defense, he became the third member of his family to hold a position as civilian head of a military department, after his great-great-grandfather Alphonso Taft (under President Ulysses S. Grant) and his great-grandfather William Howard Taft (under President Theodore Roosevelt)\nTaft served as U.S. Permanent Representative to NATO, which has the rank of ambassador, from 1989 to 1992, during the Gulf War. In 1992, prior to the Clinton administration taking power, he entered private practice with the Washington, D.C. law firm of Fried, Frank, Harris, Shriver & Jacobson as a partner.\nService in George W. Bush administration\nAfter the election of 2000, George W. Bush appointed Taft to serve as chief legal adviser to the United States Department of State under Secretary of State Colin Powell, with whom he was reportedly friends. The appointment was technically a significantly lower appointment than he had held in other administrations, but it permitted him to work with his wife, Julia Taft, a top State Department official in charge of refugees who also served during the Clinton administration.\nWhile serving as legal adviser, Taft wrote two seminal law journal articles regarding the views of the United States on the legality of the use of military force. First, in connection with the decision of the International Court of Justice in the Oil Platforms case, Taft countered a series of propositions that the court appeared to accept regarding the principles governing the use of force. That included his conclusion that \"There is no requirement in international law that a State exercising its right of self-defense must use the same degree or type of force used by the attacking State in its most recent attack. Rather, the proportionality of the measures taken in self-defence is to be judged according to the nature of the threat being addressed.\" Second, Taft coauthored (with Todd F. Buchwald) an article in the Americal Journal of International Law that set forth the official United States Government view regarding the permissibility under international law of the use of force by the United States and Coalition forces during the 2003 invasion of Iraq. The article concluded that the preemptive use of force in Iraq is lawful where, as in Iraq, \"it represents an episode in an ongoing broader conflict initiated--without question-- by the opponent and where, as here, it is consistent with the resolutions of the Security Council.\nIn 2004, Taft's name surfaced as a dissenter concerning the policy of interrogation techniques for military detainees. In a January 11, 2002, memo, he opposed Department of Justice lawyers to argue that the president could not \"suspend\" U.S. obligations to respect the Geneva Conventions and that a legal argument to do so was \"legally flawed and procedurally impossible.\" This was also the position of Secretary Powell, who attempted to persuade Bush to reconsider. Alberto R. Gonzales, the White House counsel, subsequently advised Bush in a memo that Taft and Powell were wrong and the Justice Department's analysis was \"definitive.\" Gonzales claimed terrorist attacks \"require a new approach in our actions toward captured terrorists,\" and argued that if suspected terrorists had never respected the Geneva Conventions' human rights protections, the U.S. didn't need to do so.\nLeaving government service\nAfter the re-election of President Bush, resignation of Colin Powell and appointment of Condoleezza Rice as secretary of state, Taft resigned to return to private practice, again at Fried, Frank, Harris, Shriver & Jacobson. He is a visiting professor at Stanford Law School, having succeeded Allen Weiner as the Warren Christopher Professor of the Practice of International Law and Diplomacy in 2007. In January 2009 he was named chair of the board of trustees for Freedom House, an independent watchdog organization which supports the expansion of freedom around the world. On September 12, 2006, Taft co-signed (along with 28 other retired military or defense department officials) a letter to the chairman and ranking member of the Senate Armed Services committee in which he stated his belief that the Bush Administration's attempt to redefine Common Article 3 of the Geneva Convention \"poses a grave threat\" to U.S. service members.\nTaft is said to be one of the sources who told journalists David Corn and Michael Isikoff that former Deputy Secretary of State Richard Armitage was the source syndicated columnist Robert Novak had when he made public the fact that Valerie Wilson worked for the CIA. In a review of Corn's and Isikoff's book, Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War, Novak wrote: \"I don't know precisely how Isikoff flushed out Armitage [as Novak's original source], but Hubris clearly points to two sources: Washington lobbyist Kenneth Duberstein, Armitage's political adviser, and William Taft IV, who was the State Department legal adviser when Armitage was deputy secretary.\"\nThough a staunch Republican, Taft opposed the 2016 presidential campaign of Donald Trump, declaring alongside 49 other Republican former national security officials that he would not vote for the candidate. In 2020, Taft again rebuked his party, endorsing Democrat Joe Biden over Trump. In 2020, Taft, along with over 130 other former Republican national security officials, signed a statement asserting that President Trump was unfit to serve another term, and \"To that end, we are firmly convinced that it is in the best interest of our nation that Vice President Joe Biden be elected as the next President of the United States, and we will vote for him.\"\nReferences\nExternal links\n*[https://2001-2009.state.gov/r/pa/ho/po/com/12312.htm United States Department of State: US Ambassadors to NATO]\n*\n|-\n|-\n|-\n|-"
    }
  ]
}