{
  "content": [
    {
      "type": "text",
      "text": "# William Edward Ellis\n\n|death_date    =\n|birth_place   = Burlington, North Carolina, United States\n|death_place   = Norfolk, Virginia\n|nickname      = \"El Gropo\"\n|allegiance    = United States of America\n|branch        = United States Navy\n|serviceyears  = 1926–1968\n|rank          = Vice Admiral\n|unit          = VGF-26,   VF-18,\n|battles       = World War II\n* Operation Torch\n* Philippines campaign\n|awards        = Navy CrossDistinguished Flying CrossAir MedalDistinguished Service Medal\n|relations     =\n|laterwork     =\n|placeofburial = Arlington National Cemetery\n}}\nWilliam Edward Ellis (November 7, 1908&nbsp;– September 26, 1982) was a vice admiral in the U.S. Navy. He ended his 40 year career as Chief of Staff to the Supreme Allied Commander Atlantic (SACLANT). Ellis first distinguished himself as a naval aviator during World War II, during which time he earned commendations for service in the North African Campaign and, later, valor awards for his leadership as Commander Air Group 18 aboard USS Intrepid.\nEllis was promoted to Intrepid's Air Officer in November 1944, beginning his transition to naval command. In the immediate wake of the Korean War he captained the escort carrier USS Badoeng Strait, but his next assignment gave him command of the supercarrier USS Forrestal for its inaugural cruise in 1957. Following his year with Forrestal he was made Chief of Staff to Commander Carrier Division 6. A year later Ellis received a rank promotion to rear admiral and by 1961 he was serving as Commander Carrier Division 2. In 1964, along with another rank promotion to vice admiral, Ellis became Commander Sixth Fleet. Ellis's  promotion to Chief of Staff SACLANT occurred close to his retirement in 1968. Ellis died from cancer on September 26, 1982.\nEarly life\nEllis was born to C.B. and Margaret C. Ellis on November 7, 1908, in Burlington, North Carolina. C.B. Ellis opened a sewing machine shop at the turn of the century which he later transformed into C.B. Ellis Music. The elder Ellis owned and operated the music shop into his late 80s. William plead with his family to consent to his enlistment in the Navy, which was agreed to on the condition that he earn appointment to the United States Naval Academy. After attending nearby Werntz Preparatory School in Annapolis and receiving the backing of his district's congressional representative Charles Manly Stedman, he entered the academy in 1926 and graduated in 1930.\nHis first assignment was to the USS Mississippi, though he soon moved into flight training and was designated a naval aviator by 1932. Ellis served briefly aboard the , his first carrier experience, and in 1937 was an aviation ordinance and landing signal officer aboard the USS Enterprise. His last post before the outbreak of World War II was commanding officer (CO) of a training squadron from 1940 – 1942.\nWorld War II\nBy October 16, 1942, Ellis was serving as CO of VGF-26, the escort fighter squadron aboard USS Sangamon. During Operation Torch Ellis primarily remained on the carrier as fighter director officer, though he did lead one flight over Moroccan territory. For his service he was given an official commendation from the Commander in Chief, Atlantic Fleet, and authorized to wear the Commendation Ribbon.\nFollowing his service on Sangamon, Ellis was advanced from squadron command aboard a \"jeep\" carrier to air group command aboard an Essex-class carrier—specifically USS Intrepid's Air Group 18. He picked up the nickname \"El Gropo,\" which the men cobbled together from his first name, his position as group commander and also his purported shortcomings regarding navigation. His command lasted from August 30, 1943, until November 3, 1944, when he was promoted to air officer. This change moved him out of the air group and into the ship's complement of officers. Ellis was awarded the Air Medal for  \"skillfully directing his group in its first combat operation\" for the month of September 1944, comprising strikes against the Palau's and the Philippines.\nThe group carried out its most intensive strike schedule in October. Ellis received the Distinguished Flying Cross and the Navy Cross for his role as target coordinator that month. The latter was awarded for Ellis's role in the Battle of Leyte Gulf. He flew three consecutive ten-hour days throughout the engagement, confronting two geographically distinct enemy formations both containing capital ships. He was singled out in particular for his role as target coordinator in the initial strikes against the Japanese battleship force and its Yamato-class battleships. Under his leadership, Air Group 18 racked up 187 enemies destroyed airborne, 69 ships sunk and a number of others damaged, including a carrier, a light carrier and five battleships. Ellis served as air officer up until April 1945, when Intrepid suffered its fifth kamikaze crash and had to return to port for extensive repairs.\nPost-war\nAfter the war, Ellis served as CO of the Fleet All Weather Training Unit Atlantic, at Naval Air Station Key West, Florida. He began this duty in 1948 and remained there until 1949, at which time he briefly met President Harry S. Truman. Ellis attended the Naval War College for the term 1950 – 1951. From July 1953 – July 1954 he captained the USS Badoeng Strait, an escort carrier recently modernized to serve in an anti-submarine warfare role.\nIn 1956 Ellis was made captain of the Navy's new supercarrier USS Forrestal. He commanded the ship during its inaugural cruise and subsequently was fleeted up to rear admiral on July 18, 1958. His first post as a two-star admiral was chief of staff to Commander Carrier Division 6. Ellis stepped back into a command role with his appointment as commander of Carrier Division 2 in 1961. On June 2, 1964, he was given a third star and vice admiral rank, and put in charge of the Sixth Fleet. After two years serving in this capacity he was relieved of his command and awarded the Distinguished Service Medal. Specifically recognized in his full citation are Ellis's adroit management of an Atlantic command at a time when the Vietnam War pulled increasing Navy resource to the Pacific; and the swiftness with which he assisted in the recovery of a hydrogen bomb lost off the coast of Spain. Ellis's final position within the Navy was as chief of staff to the Supreme Allied Commander Atlantic, a post he served in during his last year of service, 1968. He died in a Norfolk, Virginia, hospital on September 26, 1982, as a result of cancer.\nAwards and decorations\n{| style=\"margin:1em auto; text-align:center;\"\n| colspan=\"4\"|\n|-\n|colspan=\"3\"|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n!Badge\n|colspan=\"9\"|Naval Aviator Badge\n|-\n!1st Row\n|colspan=\"4.5\"|Navy Cross\n|colspan=\"4.5\"|Navy Distinguished Service Medal\n|-\n!2nd Row\n|colspan=\"3\"|Distinguished Flying Cross\n|colspan=\"3\"|Air Medal\n|colspan=\"3\"|Navy Commendation Medal\n|-\n!3rd Row\n|colspan=\"3\"|Navy Presidential Unit Citation with one bronze service star\n|colspan=\"3\"|American Defense Service Medal with service star\n|colspan=\"3\"|European–African–Middle Eastern Campaign Medal with service star\n|-\n!4th Row\n|colspan=\"3\"|Asiatic–Pacific Campaign Medal with two service stars\n|colspan=\"3\"|World War II Victory Medal\n|colspan=\"3\"|National Defense Service Medal with service star\n|}\nReferences\nCitations\nBibliography\n*\n*\nMilitary documents\n*\n*\nOnline sources\n*\n}}\n*\n}}\n*\n}}\n*\n| author =\n| date = September 30, 1982\n| title = Vice Adm. William Ellis, 74 – Ex-Chief of Staff In Atlantic\n| newspaper = The New York Times\n| url =  https://www.nytimes.com/1982/09/30/obituaries/vice-adm-william-ellis-74-ex-chief-of-staff-in-atlantic.html\n| access-date =   February 20, 2017\n}}\n*\n| author =\n| date = September 30, 1982\n| title = Decorated Pilot, 6th Fleet Commander\n| newspaper = The Washington Post\n| url =  https://www.washingtonpost.com/archive/local/1982/09/30/decorated-pilot-6th-fleet-commander/5d135de5-65a0-4012-af2e-686eafc1cb24/\n| access-date =   February 20, 2017\n}}\n*\n| author =\n| date = July 25, 1968\n| title = Admiral Ellis To Retire From Service In Navy\n| newspaper = The Times-News\n| url =  https://www.newspapers.com/clip/9071539/adm_ellis_to_retire_from_service_in/\n| access-date =   February 20, 2017\n}}\n*\n*\n| author =\n| date = April 21, 1964\n| title = To Head Sixth Fleet: Admiral Ellis To Be Promoted Pt. 1\n| newspaper = The Times-News\n| url =  https://www.newspapers.com/clip/9014851/to_head_sixth_fleet_admiral_ellis_to/\n| access-date =   February 19, 2017\n}}\n*\n*\n*\n| author=\n| date = July 19, 1958\n| title = Ellis Gets Promotion To Rear Admiral Rank\n| newspaper = The Times-News\n| url = https://www.newspapers.com/clip/9070523/ellis_gets_promotion_to_rear_admiral/\n| access-date = February 20, 2017\n}}\n*\n| author=\n| date = May 13, 1966\n| title = Adm. Ellis Is Decorated\n| newspaper = The Times-News\n| url = https://www.newspapers.com/clip/9068761/adm_ellis_is_decorated_daily/\n| access-date = February 21, 2017\n}}\n*\n}}\n*\n}}\n*\n}}"
    }
  ]
}