{
  "content": [
    {
      "type": "text",
      "text": "# William Howard Seth-Smith III\n\nWilliam Howard Seth Smith (23 August 1852 – 30 August 1928) was a British architect. He is best known for his contributions to churches and schools in the Surrey area.\nBiography\nWilliam Howard Seth-Smith was born into a noted Scottish architectural family on 23 August 1852, to William Seth-Smith of Tangley, near Wonersh which is south of Guildford. His grandfather, Seth Smith, was noted for building some of the most wealthy communities in Central London today such as Belgravia and communities such as Eaton Square and Wilton Crescent. These developments included the original pantechnicon from which the name of the van is derived.\nSeth-Smith attended the South Kensington Art School and became a Fellow of the Royal Institute of British Architects in 1892 and was President of the Society of Architects and of the Architectural Association.\nIn 1880 he designed the United Reformed Church in Wonersh, the Kingham Hill School in Oxfordshire in 1886 in the traditional Cotswold style (completed in 1903), Marling School in Stroud from 1889 to 1894 and in 1892 proposed an extension of the Camden Chapel, in Camberwell, Surrey but was rejected. In 1896 he designed a memorial in St Paul's Cathedral for General John Inglis, with bronze reliefs by Derwent Wood. That same year, Seth-Smith drew up plans for the St. Thomas Church in Chilworth and made additions to The Royal Liberty School, on Upper Brentwood Road in Romford; notably the porch, garden rooms and vestibule. Between 1896 and 1897 he worked on the Church of St. Luke in Maidstone and the Wesleyan church at Englefield Green in 1904.\nFrom 1905 until shortly before his death he was in an architectural partnership at 46 Lincoln's Inn Fields, London with William Ernest Monro.\nHe was also a keen water colour painter, and exhibited some of his works at the Royal Academy of London. His half brother, David Seth-Smith (1875-1963) was a noted zoologist.  His half sister E.K.Seth-Smith wrote historical children's fiction.  His sister Ethel Margaret married Alfred Hitchens the painter.\nReferences"
    }
  ]
}