{
  "content": [
    {
      "type": "text",
      "text": "# William R. King\n\n| term_end            = April 18, 1853\n| predecessor         = Millard Fillmore\n| successor           = John C. Breckinridge\n| office1              = 8th Dean of the United States Senate\n| term_start1          = March 4, 1833\n| term_end1            = April 15, 1844\n| predecessor1         = Benjamin Ruggles\n| successor1           = Thomas Hart Benton\n| jr/sr2              = United States Senator\n| state2              = Alabama\n| term_start2         = July 1, 1848\n| term_end2           = December 20, 1852\n| predecessor2        = Arthur P. Bagby\n| successor2          = Benjamin Fitzpatrick\n| term_start3         = December 14, 1819\n| term_end3           = April 15, 1844\n| predecessor3        = Seat established\n| successor3          = Dixon Hall Lewis\n| office4             = President pro tempore of the United States Senate\n| term_start4         = May 6, 1850\n| term_end4           = December 20, 1852\n| predecessor4        = David Rice Atchison\n| successor4          = David Rice Atchison\n| term_start5         = July 1, 1836\n| term_end5           = March 3, 1841\n| predecessor5        = John Tyler\n| successor5          = Samuel L. Southard\n| order6              = 16th United States Minister to France\n| term_start6         = April 9, 1844\n| term_end6           = September 15, 1846\n| president6          = John TylerJames K. Polk\n| predecessor6        = Lewis Cass\n| successor6          = Richard Rush\n| state7              = North Carolina\n| district7           =\n| term_start7         = March 4, 1811\n| term_end7           = November 4, 1816\n| predecessor7        = Thomas Kenan\n| successor7          = Charles Hooks\n| office8             = Member of the North Carolina House of Commons\n| term_start8         = 1807\n| term_end8           = 1809\n| birth_name          = William Rufus DeVane King\n| birth_date          =\n| birth_place         = Sampson County, North Carolina, U.S.\n| death_date          =\n| death_place         = Selma, Alabama, U.S.\n| party               = Democratic-Republican (before 1828)Democratic (1828–1853)\n| education           = University of North Carolina, Chapel Hill (BA)\n| restingplace        = Old Live Oak Cemetery\n| signature           = William R King Signature.svg\n| signature_alt       = Cursive signature in ink\n}}\nWilliam Rufus DeVane King (April 7, 1786 – April 18, 1853) was an American politician and diplomat. He was the 13th vice president of the United States from March&nbsp;4 until his death in April 1853. King had previously served as a U.S. representative from North Carolina and a senator from Alabama. He also served as minister to France under President James K. Polk.\nA Democrat, King was a Unionist and his contemporaries considered him to be a moderate on the issues of sectionalism, slavery, and westward expansion, which contributed to the American Civil War. He helped draft the Compromise of 1850. King is the only United States vice president to take the oath of office on foreign soil, and was inaugurated in Cuba, due to his poor health. He died of tuberculosis 45&nbsp;days later, becoming the third vice president to die in office. Only John Tyler and Andrew Johnson, both of whom succeeded to the presidency, have had shorter tenures. King was the only U.S. vice president from Alabama.\nEarly life\nKing was born on April 7, 1786, in Sampson County, North Carolina, to William King and Margaret DeVane. He graduated from the University of North Carolina at Chapel Hill in 1803, where he was also a member of the Philanthropic Society. Admitted to the North Carolina Bar Association in 1805 or 1806, after reading law with Judge William Duffy of Fayetteville, North Carolina, he began practice in Clinton. He was also a Freemason.\nPolitical career\nKing entered politics and was elected as a member of the North Carolina House of Commons, where he served from 1807 to 1809, and he became city solicitor of Wilmington, North Carolina, in 1810. He was elected to the Twelfth, Thirteenth, and Fourteenth Congresses, serving from March 4, 1811, until November 4, 1816, when he resigned to become Secretary of the Legation for William Pinkney during Pinkney's appointment as Minister to Russia and to a special diplomatic mission in Naples. King was only 24 years old when he became a congressman for the first time. He did not reach the constitutional age of 25 for service in the House of Representatives until after the term began, but the Twelfth Congress did not convene until November 4, 1811, and King was not sworn in until then.\nWhen he returned to the United States in 1818, King joined the westward migration of the cotton culture to the Deep South, purchasing property at what would later be known as \"King's Bend\" between present-day Selma and Cahaba on the Alabama River in Dallas County of the new Alabama Territory, which had been recently separated from Mississippi. He developed a large cotton plantation based on slave labor, calling the property \"Chestnut Hill\". King and his relatives formed one of the state's largest slaveholding families, collectively owning as many as 500 people.\nWilliam Rufus King was a delegate to the convention that organized the Alabama state government. Upon the admission of Alabama as the twenty-second state in 1819, he was elected by the State Legislature as a Democratic-Republican to the United States Senate.\nKing was a follower of Andrew Jackson, and was re-elected to the Senate as a Jacksonian in 1822, 1828, 1834, and 1841, serving from December 14, 1819, until his resignation on April 15, 1844. During this time, from March to April 1824, William R. King was honored with a single vote at the Democratic-Republican Party caucus to be the party's candidate for the office of vice president of the United States in the upcoming 1824 presidential election. Later, he served as President pro tempore of the United States Senate during the 24th through 27th Congresses. King was Chairman of the Senate's Committee on Public Lands and the Committee on Commerce.\nHe was appointed Minister to France and served from 1844 to 1846. After his return, King resumed serving in the Senate and was appointed and subsequently elected to fill the vacancy caused by the resignation of Arthur P. Bagby. He held his seat from July 1, 1848, until his resignation on December 20, 1852, because of ill health and his having been elected vice president of the United States.\nDuring the conflicts leading up to the Compromise of 1850, King supported the Senate's gag rule against debate on antislavery petitions and opposed proposals to abolish slavery in the District of Columbia, which Congress administered. King supported a pro-slavery position, arguing that the Constitution protected the institution of slavery in both the Southern states and the federal territories. He opposed both the abolitionists' efforts to abolish slavery in the territories as well as the Fire-Eaters' calls for Southern secession.\nOn July 11, 1850, two days after the death of President Zachary Taylor, King was appointed Senate President pro tempore. Because Millard Fillmore ascended to the presidency, the vice presidency was vacant, making King first in the line of succession under the law then in effect. He also served as Chairman of the Senate's Committee on Foreign Relations.\nRelationship with James Buchanan\n, 15th president of the United States (served 1857–1861). He shared a Washington boardinghouse with his friend and colleague, William R. King.]]\nThe claim for King's homosexuality has been put forward by biographer Jean Baker. It has been supported (to an extent) by Shelley Ross, James W. Loewen, and Robert P. Watson. It focuses essentially on his close and intimate relationship with President James Buchanan. The two men lived together for 13 years, from 1840 until King's death in 1853. Buchanan referred to the relationship as a \"communion\", and the two often attended official functions together. Contemporaries also noted and commented on the unusual closeness. Andrew Jackson mockingly called them \"Miss Nancy\" and \"Aunt Fancy\" (the former being a 19th-century euphemism for an effeminate man), while Representative Aaron V. Brown referred to King as Buchanan's \"better half\".\nHowever, historian Lewis Saum has pointed out, \"Customs and expressions were different in the mid-1800s than they are today... \"Miss Nancy\" was \"a fairly common designation for people who wore clean clothes and had good manners\". He also noted that Aaron Brown was a political rival of King.\nLoewen has described Buchanan and King as \"Siamese twins\". Sol Barzman, a biographer of vice presidents, wrote that King's \"fastidious habits and conspicuous intimacy with the bachelor Buchanan gave rise to some cruel jibes.\" Buchanan adopted King's mannerisms and romanticized southern culture. Both had strong political ambitions, and in 1844, they planned to run as president and vice president. They spent some time apart while King was on overseas missions in France, and their letters remain cryptic and avoid revealing any personal feelings at all. In May 1844, Buchanan wrote to Cornelia Roosevelt: I am now 'solitary and alone', having no companion in the house with me. I have gone a wooing to several gentlemen, but have not succeeded with any one of them. I feel that it is not good for man to be alone, and [I] should not be astonished to find myself married to some old maid who can nurse me when I am sick, provide good dinners for me when I am well, and not expect from me any very ardent or romantic affection. After King died on April 18, 1853, aged 67, Buchanan described him as \"among the best, the purest, and most consistent public men I have known\".\nBaker concluded that while some of their correspondence was destroyed by family members, the length and intimacy of the surviving letters illustrate \"the affection of a special friendship\" between King and Buchanan, with no way to know for certain whether it was a romantic relationship.\nVice presidency and death (1853)\nThe 1852 Democratic National Convention was held at the Maryland Institute for the Promotion of the Mechanic Arts Hall in Baltimore. Franklin Pierce was nominated for president, and King was nominated for vice president.\nPierce and King defeated the Whig candidates, Winfield Scott and William Alexander Graham. Because King was ill with tuberculosis and had traveled to Cuba in an effort to regain his health, he was not able to be in Washington to take his oath of office on March 4, 1853. By a special Act of Congress passed on March 2, he was allowed to take the oath outside the United States, and was sworn in on March 24, 1853, near Matanzas, by the U.S. consul to Cuba, William L. Sharkey. King is the first and, to date, only vice president or president of the United States to take the oath of office on foreign soil.\nShortly afterward, King made the journey to return to Chestnut Hill. He died within two days of his arrival on April 18, 1853, aged 67, of tuberculosis. He was interred in a vault on the plantation and later reburied in Selma's Old Live Oak Cemetery. King never carried out any duties of the office.\nFollowing King's death, the office of vice president was vacant until John C. Breckinridge was inaugurated with President James Buchanan in March 1857.\nFile:Chestnut Hill King's Bend Alabama.jpg|Engraving of Chestnut Hill, published following King's death in the Illustrated News, New York, April 30, 1853. The house was destroyed by fire during the 1920s.\nFile:Crypt of William R. King.jpg|Crypt of William R. King in Live Oak Cemetery, Selma, Alabama.\nLegacy and honors\nof book of memorial addresses published after King's death]]In 1852, the Oregon Territorial Legislature named King County for him. King County became part of Washington Territory when it was created the following year, and then part of the State of Washington in 1889. In 1985, the King County government amended its designation and its logo to honor instead the late national Civil Rights Movement leader Martin Luther King Jr. The change was made official April 19, 2005, when Governor Christine Gregoire signed into law Senate Bill 5332, effective July 24, 2005.\nThe King Residence Quadrangle at the University of North Carolina at Chapel Hill, his alma mater, is named for him.\nAn 1830 portrait of King is held at New East Hall in the Philanthropic Chambers of the Dialectic and Philanthropic Societies, a debating society which he had joined during college.\nKing was a co-founder of Selma, Alabama, which he named after the Ossianic poem \"The Songs of Selma\". After his death, city officials and some of King's family wanted to move his body to Selma. Other family members wanted his body to remain at Chestnut Hill. In 1882, the Selma City Council appointed a committee to select a new plot for King's body. His remains were then reinterred in the city's Live Oak Cemetery under a white marble mausoleum erected by the city.\nNotes\nReferences\nExternal links\n* [https://web.archive.org/web/20070810123804/http://www.alabamamoments.state.al.us/sec09.html Who is William Rufus King?]\n* [https://archive.org/search.php?query=William%20Rufus%20King%20AND%20mediatype%3Atexts Obituary addresses on the occasion of the death of the Hon. William R. King, of Alabama, vice-president of the United States : delivered in the Senate and House of Representatives of the United States, eighth of December, 1853]"
    }
  ]
}