{
  "content": [
    {
      "type": "text",
      "text": "# William Durward Connor\n\n|birth_place= Newark, Wisconsin, US\n|death_date=\n|death_place=Washington, D.C., US\n|placeofburial= West Point Cemetery\n|allegiance= United States of America\n|branch= United States Army\n|serviceyears= 1897–19381941–1942\n|servicenumber=0-84\n|rank= Major General\n|unit= Corps of Engineers\n|commands= Superintendent of the United States Military AcademyCommandant of the Army War College2nd Infantry DivisionUS Army forces in ChinaUS Army Engineer SchoolAmerican forces in France63rd Brigade\n|battles= Spanish–American WarWorld War IWorld War II\n|awards= Army Distinguished Service MedalSilver Star (2)Order of the Bath (United Kingdom)Commander of the Legion of Honour (France)Croix de guerre (France)\n}}\nWilliam Durward Connor (February 22, 1874 – June 16, 1960) was a career United States Army officer who became a superintendent of the United States Military Academy after originally serving in the Corps of Engineers. While stationed in the Philippines, he participated in the Spanish–American War. He later served with the American Expeditionary Forces during World War I.\nEarly life and education\nConnor, the son of Edward D. Connor and Adeline Powers Connor, was born in Wisconsin on  February 22, 1874; according to his 1925 passport application, he was born in the town of Newark, in Rock County. He received an appointment to West Point from Iowa, graduating first in his class in 1897; his Cullum number is 3742. He received his commission in the Corps of Engineers. Connor graduated from the Army Staff College in 1905 and the Army War College in 1909.\nMilitary career\nHe began his military career as an officer in the Corps of Engineers. During the Spanish–American War, he served in the Philippines as an engineer and was awarded a Silver Star for heroism in combat.\nin July 1929.]]\nFrom 1909 to 1916, he was with the War Department General Staff and was promoted to colonel and appointed Deputy Chief of Staff of the American Expeditionary Forces (AEF) in 1917, following the entry of the United States in World War I in April 1917 (see American entry into World War I). In July 1918, he was promoted brigadier general, and given command of the 63rd Brigade, 32nd Division. He led the brigade at the Battle of Château-Thierry in mid-1918, with his performance resulting in him being awarded a second Silver Star, the citation for which reads:\nFor his World War I service, he was awarded the Army Distinguished Service Medal. The citation for the medal reads:\nHe also received the Order of the Bath from Britain and from France, he received the Croix de guerre and was named a Commander of the Legion of Honour. After the war he served as commanding general of American forces in France until 1920.\n, at the War Department, May 1927. Stood in the back row, second from the right, is Major General William D. Connor, commanding the 2nd Division.]]\nReturning to the United States, Connor served as commandant of the United States Army Engineer School from April to August 1920. He was then the Chief of Transportation Service in 1921, Deputy Chief of Staff, US Army, in 1922 and commanding general of US Army forces in China, 1923 to 1926. Connor was promoted to major general in 1925, serving as commander of the 2nd Infantry Division until 1927, and as commandant of the Army War College until 1932. He served as the Superintendent at West Point from 1932 to 1938.\nLater life\nConnor retired from the US Army on 28 February 1938 but was recalled for service during World War II as Chairman of the Construction Advisory Committee, War Department on May 7, 1941. He remained in that capacity until March 31, 1942, when he reverted to the retired status. He died at the age of 86 at Walter Reed Medical Center. and is buried at the West Point Cemetery, section 18, row G, grave 75.\nNotes\nReferences\n*\n*"
    }
  ]
}