{
  "content": [
    {
      "type": "text",
      "text": "# William Stewart (skipper)\n\nWilliam Stewart (fl. c. 1580-1610) was a Scottish sea captain from Dundee. Stewart was skipper of one of the ships that took James VI to Norway in 1589, when the king sailed to meet Anne of Denmark. James VI gave him a present of 20 dalers from his dowry. He was involved in a complex international shipping incident off the coast of Spain in 1593, as skipper of a ship belonging to George Bruce of Carnock.\nSkipper of the Bruce\n, a well-connected entrepreneur noted for his innovations in mining and shipping, lived at Culross Palace]]\nA wealthy merchant and manager of mines George Bruce of Carnock, builder of Culross Palace, imported Spanish wine to Scotland. He employed William Stewart as skipper of one his ships, the Bruce. In August 1593 the Bruce went to Ferrol for a cargo of wine, figs, and raisins. William Stewart encountered some English merchant ships, the Julian of London and a ship of Southampton, with two pinnaces they had captured.\nThe Julian was a privateer, captained by John Clarke, and cruised the Spanish coast to capture prize cargoes of sugar and Brazilwood dye, at a time when England was at war with Spain. The Julian shot at the Bruce to bring it to. The English ships were overloaded with men captured from Spanish ships. Clerk and Captain Petefer forced Stewart to take 52 men onto the Bruce. These were Portuguese sailors and possibly enslaved African men. The Bruce then sailed towards Portugal, intending to put these new passengers ashore.\nA week later an English Man-of-war, the Fortunatus took the Bruce as a prize of war. The master of the English ship, Captain Thomas Busbrig, thought the Bruce was a Spanish ship because of the number of captives on board. As George Bruce himself wrote in 1598, Busbrig took the Bruce to be Spanish, \"by reason of so manye\" African and Portuguese men. It was not unusual for ships to pretend to be Scottish, to take advantage of their neutrality in the war.\nThe Bruce was taken to Portsmouth. Captain Stewart complained to the Vice-Admiral of Portsmouth. Busbrig became angry and struck Stewart with his sword, wounding his elbow. Back in Scotland, on 11 October 1593 Stewart sought redress by requesting that James VI confiscate an English ship loading salt at Prestonpans, captained by James Keeler, which was the same size as the Bruce. Ludovic Stewart, 2nd Duke of Lennox, as Great Admiral of Scotland, gave Daniel Leyne a warrant to seize Keeler's ship.\nAlthough the Bruce was restored to George Bruce, his original cargo of Spanish wine was lost, drunk by the Portuguese captives or spoilt. When the ship returned to Leith the Provost of Edinburgh, Alexander Home of North Berwick, and the English diplomat Robert Bowes took witness statements from the crew.\n(pictured) gave an opinion on the case for the Scottish ambassador Edward Bruce, after the Union of the Crowns, both Bruce and Caesar became Master of the Rolls]]\nBruce claimed in the London Admiralty Court for the value of the wine from John Clerk, captain of the Julian. Bruce's brother, Edward Bruce, then ambassador in London urged the lawyer Julius Caesar to help. Caesar thought on 21 April 1598 the details of the case were unclear and not yet fit for hearing because the other English captain involved, John Newton of the Spanish Company, a trader with the Barbary Coast and owner of the Julian, had not been questioned.\nAnother partner, John Byrd, a brother of the composer William Byrd owned a half share in the Julian. Byrd and Newton had made voyages to Benin in 1588 and 1590.\nThe fate of the Portuguese and Africans aboard the Bruce was not recorded. Arrangements were made to deport \"Turks and Moors\" from England by Admiralty officials acting under royal authority. In 1601, Elizabeth I made a proclamation that Caspar van Zeuden, a merchant of Lübeck, would transport to Spain and Portugal the African people who had been brought to England during the wars with Spain.\nOther Scottish contemporaries called William Stewart\nThe skipper William Stewart can be confused with several contemporaries:\n* William Stewart of Caverston, Captain of Dumbarton Castle, and later Laird of Traquair.\n* William Stewart of Houston, soldier and diplomat known as Colonel Stewart\n* William Stewart of Monkton, murdered by Francis Stewart, 5th Earl of Bothwell\n* William Stewart of Grandtully, known as the \"Ruthless\" for his property deals\n* William Stewart, the king's valet\n* William Stewart, a servant of Regent Morton mentioned in Morton's \"Confession\".\nReferences\nExternal links\n* [https://research-repository.st-andrews.ac.uk/bitstream/handle/10023/4525/ClaireMcLoughlinPhDThesis.pdf?sequence=4&isAllowed=y 'Scottish Commercial Contacts with the Iberian World, 1581-1730', Claire McLoughlin, University of St Andrews, PhD thesis, 2014, pp. 72-3]"
    }
  ]
}