{
  "content": [
    {
      "type": "text",
      "text": "# William R. Howard\n\n| birth_place        = Wheatland, Wyoming, US\n| death_date         =\n| death_place        =\n| nationality        =\n| alma_mater         = George Washington University\n| occupation         =\n| years_active       = 1956-2001\n| known_for          =\n| notable_works      =\n| children           = 3\n}}\nWilliam R. Howard (May 26, 1922 – January 17, 2009) was an American businessman and airline executive.&nbsp;He was best known as the chairman and CEO of Piedmont Airlines, growing it from a small regional airline to a major US carrier throughout the post deregulation environment of the late 1970s and 1980s. He was also involved in many other business ventures throughout his career.\nEarly life and education\nHoward was born in Wheatland, Wyoming on May 26, 1922, the only son of Albert T and Jane Howard. He spent his childhood years in Scottsbluff, Nebraska.&nbsp;His father was a local businessman, the Mayor of Scottsbluff NE, and also served as the Nebraska Republican state chair.&nbsp;He learned to fly when he was 16 years old, and later served in the Eighth Army Air Corps during World War II.&nbsp;During the war, he trained with the Royal Air Force in England, and served as a senior flight control officer in Europe and the Middle East.\nAfter the end of the war, he served on the staff of US Senator Hugh Butler in Washington D.C., from 1947 to 1955.  During this time he attended George Washington University, earning his undergraduate degree in Political Science and Speech Communications in 1953.&nbsp;In 1956, he received a L.L.B degree from their school of law.\nEarly career\nDespite his involvement in aviation during the war, Howard was not sold on a career as a pilot. In an interview years later, he was quoted as saying \"I had lived, eaten and slept pilots for years. And when I left, I thought being a pilot was like being a truck driver. I was sure there was no money to be made as a pilot, so I became a lawyer.\"\nAfter graduating from Law School in 1956, Howard was hired by the Gambrell Law Firm in Washington DC.&nbsp;While with Gambrell, he was assigned to work with Eastern Airlines in New York City.&nbsp;He worked closely with Eastern Airlines in this capacity for more than ten years.\nEastern Airlines\nIn 1967, Eastern Airlines convinced Howard to come work for them directly.&nbsp;Upon his resignation from Gambrell, he became the Vice President of Legal Affairs at Eastern.&nbsp;During his time there, Howard earned a reputation as a keen negotiator, particularly when it came to dealing with the company's labor unions.&nbsp;Among many responsibilities, he became the head of labor and customer relations, and also oversaw the medical and security departments within the company.&nbsp;Over the course of the next ten years, he would rise to the position of Executive Vice President with Eastern.\nIn May 1972, Eastern became the victim of a DB Cooper style hijacking, when Frederick Hahneman boarded Eastern Airlines Flight 175 and demanded $303,000 from the airline along with a parachute and 2,000 Benson and Hedges cigarettes.&nbsp;Howard, along with several other Eastern officials, scrambled to gather the cash and catalog the serial numbers on the bills in case the money was ever recovered. Once his demands were met, Hahneman had the captain fly to Honduras where he parachuted from the aircraft.&nbsp;\nAfter a 28 day manhunt for the suspect and a $25,000 reward offered by Eastern, an anonymous tip finally led to his capture. Howard, accompanied by a pair of FBI agents, flew to Honduras to retrieve Hahneman and the cash.&nbsp;After being told by Honduran authorities that the FBI had no authority in their country, Howard was forced to negotiate the return of the fugitive himself.&nbsp;The money however, was nowhere to be found. In reference to their flight back to the United States, Howard is quoted as saying that “Hahneman was pleasant, calm, and most talkative, but we did not shake hands when we met.”  The cash was finally recovered a year later after a thorough investigation from the FBI.\nDuring the mid 1970s, Howard was instrumental in negotiating collective bargaining agreements with Eastern's numerous labor unions.&nbsp;This included a wage freeze, and an accompanying plan that tied employee wages with company profits to help the then struggling airline stay afloat.&nbsp;However he sometimes clashed with CEO Frank Borman, who had been promoted to Chief Executive of the company in 1975.&nbsp;Other executives at Eastern reported that Borman was annoyed by Howard's independent ways, and his habit of reporting to work at 9am instead of 7am like he did.\nIn 1977, Borman called Howard to a meeting. According to friends, Howard thought he was being promoted to a position on Eastern's board of directors.&nbsp; Instead, Borman replaced Howard as senior vice president of the company, ending his career with Eastern. &nbsp;\nPiedmont Airlines\nAfter his departure from Eastern, Howard quickly landed another position, with an offer to become an executive vice president of the Robert Hall clothing company.&nbsp;However before he could ever report to work, the company filed for bankruptcy which once again left him looking for a job.\nIt was around this time that Tom Davis, founder and Chief Executive of Piedmont Airlines was looking for a suitable successor.&nbsp;Howard and Davis first met years earlier during industry meetings, and had developed a strong mutual respect for one another.&nbsp;After consulting with the board, Howard was named Senior Vice President of Piedmont in January 1978.\nAttitude towards deregulation\nWith the airline deregulation act looming in Congress, the general consensus amongst Piedmont leadership was that the political connections and expertise offered by Howard would be beneficial in their efforts to lobby against deregulation. As one of the smallest carriers in the US, Piedmont management was afraid that deregulation would allow larger carriers to sweep up desirable routes and crush their less established competition. Upon his arrival at Piedmont, Howard was initially told he would be spending the bulk of his time in Washington D.C. swaying the opinions of state representatives.\nDespite the attitude of Piedmonts other management, Howard had carefully studied the support deregulation had in congress, and was nearly certain it was going to pass. Having just come from Eastern Airlines, one of the larger airlines Piedmont was fearful of, Howard questioned their fervent stance against deregulation. He argued that deregulation would actually allow smaller airlines to compete, by more easily picking up routes in cities that the large airlines overlooked. With the bill almost certain to pass, Howard suggested Piedmont change its tune and instead look at the opportunities offered by deregulation. Although still not totally sold on the idea, Piedmont's founder and CEO Tom Davis relented, instructing Howard to inform congress that the airline no longer opposed deregulation.\nHub Expansion\nAs part of his deregulation strategy, Howard chose to add Piedmont hubs in cities which had otherwise been overlooked by other airlines.&nbsp;He recognized the economic growth that was occurring in Charlotte, North Carolina around that time, and in 1979, chose to make the Charlotte Airport Piedmont's largest hub. By choosing cities not served by other airlines, Piedmont could avoid the fare wars that plagued other carriers, charge more per ticket, and grow at a faster rate. Eventually, smaller hubs in Baltimore, Maryland and Dayton, Ohio would follow. These hub airports were supplied with a constant flow of passengers from feeder cities - many of whom had been abandoned or overlooked by the larger air carriers after deregulation. Flights from feeder routes would arrive at the hubs in the morning and depart for larger cities such as New York, Washington or Miami shortly after. In the afternoon, the process would reverse, bringing travelers from the large cities, through Piedmont's hubs and off to the smaller destinations by the end of the day.  By 1987, 80% of air traffic in and out of Charlotte came from Piedmont.\nNASCAR Sponsorship\nIn 1982, Piedmont became the first airline to sponsor a NASCAR team.&nbsp;Howard was known to be a big fan of auto racing, and worked out a deal to sponsor Ricky Rudd in a car fielded by Richard Childress for the 1982 Winston Cup Series season.&nbsp;Both Piedmont and Childress Racing were based in Winston-Salem, making the partnership a perfect fit for both companies. As a result of their sponsorship deal, Piedmont would later be declared \"NASCAR's Official Airline.\" The team's first win would come on June 5, 1983, at Riverside International Raceway. Not only was it the first win for the Piedmont team, but it was also the first win of both Rudd and Childress' careers.\nPiedmont would drop driver Ricky Rudd in favor of Terry Labonte beginning with the 1984 season. The new team, owned by Billy J. Hagan, was also based in North Carolina near Piedmont's headquarters. This would prove to be an excellent decision, as Labonte would have 17 top five finishes in the Piedmont car in 1984, winning the Winston Cup Championship that year.\nFlorida Shuttle\nFollowing the bankruptcy of Air Florida in 1984, Howard felt that there was a gap in the market within the Sunshine State that needed to be filled.&nbsp;As a result, Piedmont management put together a covert plan known internally as “Project Omaha” to begin inter-state service to the entire state of Florida virtually overnight.&nbsp;\nAt that point in time, Piedmont's fleet consisted of mostly Boeing 727's and 737's, which were too large to efficiently serve the target market.&nbsp;Howard instead set his sights on the Fokker F28 as the aircraft of choice, as he felt it was the perfect size for the job.&nbsp;However negotiations with Fokker failed to materialize, as Howard felt the aircraft was too expensive.&nbsp;Instead, a deal was struck to buy used Fokker F28's from the Indonesian carrier Garuda, have them refurbished at the Fokker factory in the Netherlands to Piedmont's specification, and put them into service in the Sunshine State.&nbsp;This arrangement effectively got Piedmont “like-new” aircraft for a substantially discounted price tag.\nYet another hurdle to introducing the F28 to its fleet was negotiations with the pilot group.&nbsp;Piedmont knew they couldn't afford to pay their pilots the same rate for the F28 as they were for the 737.&nbsp;After discussions between management and the pilots, it was agreed that F28 pilots would be paid 60% of the 737 rates.&nbsp;Many of the new Florida Shuttle pilots came from recently defunct Braniff Airways, and were just happy to be flying again, even if it wasn't in larger aircraft.\nOn October 1, 1985, Piedmont officially began a service known as the Florida Shuttle, which provided “morning in, evening out” service to Florida's major cities.&nbsp;From day one, Piedmont brought 68 intra-Florida departures to the state, expanding to over 100 by 1986.&nbsp;The service proved to be extremely popular in the state, and was profitable just one month after service began.\nUnited Airlines\nThroughout the 1980s, UAL Inc. - the holding company of United Airlines - began to diversify by acquiring the Westin & Hilton hotel chain, as well as the Hertz car rental company.&nbsp;In April 1987, UAL Inc. changed its name to Allegis Corporation, however reaction to the name change was not positive.&nbsp; Wall Street analysts believed the subsidiaries of Allegis were worth more than the parent company, and in June 1987, Allegis Corp ousted its Chairman.\nAllegis’ executive selection committee, headed by director Neil Armstrong, approached Howard about possibly running the company.&nbsp;Separately, he was approached by the United Pilots Union and a group of investment bankers about making a bid to buy the airline from Allegis. In the end, Howard made the decision to work with the Pilots Union, and in August 1987 he stepped down as the head of Piedmont to become chairman and CEO of Airline Acquisition Corp.&nbsp;As part of his agreement with AAC, Howard was to receive $1 Million in compensation if he was not offered employment before August 13, 1988. Ultimately the group was not successful in closing a deal by their deadline.\nEastern Airlines takeover bid\nIn May 1989, Howard led a group of investors in a bid to take over Eastern Airlines, which was in the midst of bankruptcy talks.&nbsp;Donald Trump originally agreed to purchase Eastern Shuttle for $365 million in 1988, however worsening problems at the airline and strikes by its employees since then had devalued it in the eyes of some investors.&nbsp;Howard's group offered up $125 million in cash in return for Eastern's Shuttle, promising full repayment to the airlines creditors in exchange for accepting the lower purchase price.\nIn the end, Trump purchased Eastern's Shuttle for the previously agreed $365 million, although it never turned a profit.&nbsp;By 1992, Trump had defaulted on his loans, and what remained of the shuttle was sold to USAir.\nTrans World Airlines\nFollowing Carl Icahn's disastrous takeover of TWA in the late 1980s, and the airlines subsequent filing for Chapter 11 in 1992, Howard was selected to lead the struggling company out of bankruptcy.&nbsp;He joined the company as chairman and CEO beginning in July, 1993, and appeared confident the company could once again become competitive in the industry.\nTWA emerged from Bankruptcy in November 1993.&nbsp;Despite Howard's best efforts, TWA's new board of directors consisted of members with very different priorities, leading to strained relationships between management.&nbsp;Howard stepped down in 1994, becoming the first of three CEO's to lead the airline over the next three years.\nHeartland Airlines\nIn 1999, Howard joined Dayton Ohio based start-up Heartland Airlines as chairman of its board of directors.&nbsp;Heartland planned to operate upscale first class style air service out of Dayton, a hub which was abandoned by USAir after their merger with Piedmont in 1989.&nbsp;The airline planned to operate Boeing 717 aircraft in an 88 passenger, all business-class configuration. After failing to raise their $55 million first round fundraising goal, and with worsening economic conditions on the horizon, Heartland ceased operation in February 2001.\nPersonal life\nHoward married his college sweetheart, Lucy Moore in 1952, and the couple had three sons.&nbsp;He was known as an avid collector of sports cars, antique automobiles and motorcycles, and continued to fly his own aircraft throughout most of his life.\nAwards and honors\nHoward was the recipient of many personal awards and honors throughout his career, including Alumnus of the Year by George Washington University, and CEO of the year by Financial World Magazine.&nbsp;Aviation Week Magazine nominated him as a significant contributor to aerospace in 1983, for his hub concept which turned Piedmont into one of the success stories of deregulation. In 1984, he was chosen to be the honorary starter of the Daytona 500.\nHoward also served as a board member for many companies and organizations throughout his career, including the Air Transport Association, Embry Riddle Aeronautical University, Wachovia Bank, Republic Steel, and First Travel Corp.\nDeath\nHoward died at Northeast Georgia Medical Center in Gainesville, Georgia on January 17, 2009.\nReferences\nExternal links\n*[https://www.youtube.com/watch?v=0gi_UjPpxwU Newscast covering Howard's resignation from Piedmont] YouTube"
    }
  ]
}