{
  "content": [
    {
      "type": "text",
      "text": "# William Warrick Cardozo\n\nWilliam Warrick Cardozo (1905–1962) was an accomplished private physician and pediatrician who also served as an instructor at the Howard University College of Medicine and as a school medical inspector for the District of Columbia Board of Health. He is best known for his research on sickle cell anemia, but also published articles about Hodgkin's disease, the gastrointestinal health of children, and the physical development of African American children. Cardozo was an early African-American contributor in the healthcare profession.\nEarly life and education\nWilliam Warrick Cardozo was born and raised in Washington, D.C. Cardozo's father was Frederick Lewis Cardozo, and his mother was Blanche Warrick Cardozo. Frederick Lewis Cardozo worked for the Washington, D.C. public school system and became the superintendent of the Colored School system. He also served as the president of the Bethel Literary and Historical Society.\nWilliam Warrick Cardozo graduated high school from the Hampton Institute in Virginia and attended the Carnegie Institute of Technology prior to becoming a student at Ohio State University. As a college senior he was ranked 7th in his class of 90 students and was awarded an internship at the City Hospital in Cleveland, Ohio, where he was only the fourth African American to hold such a position. He graduated from Ohio State University with a B.A. in 1929 and received an M.D. from Ohio State University in 1933.\nCareer\nIn 1935, Cardozo was awarded a two-year pediatrics fellowship at two hospitals in Chicago: Provident Hospital and Children's Memorial Hospital. During this time, he began his research on sickle cell anemia with financial support from the Alpha Phi Alpha fraternity. This culminated in his most influential publication, \"Immunologic Studies in Sickle Cell Anemia\". This work concluded that sickle cell anemia is most common among people of African heritage, that not all people with sickle cell anemia are anemic, that not all sickle cell cases are fatal, and that sickle cell anemia is a Mendelian trait.\nAfter the completion of the two-year fellowship in 1937, Cardozo joined the staff at the Howard University Department of Pediatrics as a part-time instructor, where he was later promoted to clinical assistant professor and clinical associate professor of pediatrics. Cardozo also worked at Freedmen's Hospital of Howard University, where he was especially active in the gastroenterology clinic. In addition to this, Cardozo worked as a school medical inspector for the District of Columbia Department of Health for 24 years. During this time, Cardozo published works on Hodgkin's disease, the gastrointestinal health of children, and the growth and development of African American children. In 1942 Cardozo was officially certified as a pediatrician by the American Board of Pediatrics.\nCardozo was very active both in the medical community and as a volunteer in Washington, D.C. He was a member of the American Academy of Pediatrics, the Medical Society of the District of Columbia, the Advisory Committee of the District of Columbia Crippled Children's Society, the National Medical Association, Alpha Phi Alpha, and the Alpha Omega Alpha Honor Medical Society. Cardozo was elected the western vice president of Alpha Phi Alpha in 1930, while he was still a student at Ohio State University. He also founded the Howard University branch of the Alpha Omega Alpha Honor Medical Society and was serving as its secretary and treasurer at the time of his death. Cardozo's volunteer activities included serving as a medical staffer at the Ionia R. Whipper Home for Unwed Mothers, as a council member on the D.C. Health and Welfare Council, and as an advisor on the Rock Creek East Neighborhood League.\nPersonal life\nCardozo was an Episcopalian. One of his hobbies was photography.\nCardozo had a heart attack and died on August 11, 1962. Cardozo was married to Mrs. Julia Manly Cardozo and was survived by a daughter, Judy Cardozo.\nRelatives\nWilliam Warrick Cardozo's father was Frederick Lewis Cardozo, and his mother was Blanche Warrick Cardozo. William Warrick Cardozo's paternal grandfather was Francis L. Cardozo, who became the first African American to hold a statewide office as the Secretary of State in South Carolina during 1868, before he became the State treasurer in 1872. The Cardozo Education Campus in Washington, D.C., is named in his honor. Francis L. Cardozo's father was Isaac Nuñez Cardozo, a Sephardic Jew whose family had been expelled from Spain during the 17th century; Francis L. Cardozo's mother was Lydia Williams, a woman of Native American and African descent. Francis L. Cardozo and his siblings were born free because of their mother's status as a free woman.\nAnother relative of William Warrick Cardozo was his cousin Eslanda Cardozo Goode Robeson, a chemist and renowned anthropologist who married the singer and political activist Paul Robeson.\nPublications\n\"Immunologic studies in sickle cell anemia\" in the Archives of Internal Medicine\n\"Hodgkin's disease with terminal eosinophilia occurring in a negro child with sicklemia\" in The Journal of Pediatrics\n\"Growth and development of negro infants\" in The Journal of Pediatrics\n\"Trichobezoar as an expression of emotional disturbance: Report of two cases in children\" in the American Journal of Diseases of Children\nReferences"
    }
  ]
}