{
  "content": [
    {
      "type": "text",
      "text": "# William King-Noel, 1st Earl of Lovelace\n\n| death_date         =\n| parents            =\n| spouse             =\n*\n}}\n| children           =\n}}\nWilliam King-Noel, 1st Earl of Lovelace,  (21 February 1805 – 29 December 1893), styled The Lord King from 1833 to 1838, was an English nobleman and scientist. He was the husband of Lord Byron's daughter Ada, today remembered as a pioneering computer scientist.\nEarly life\nLovelace was the eldest son of Peter King, 7th Baron King, and his wife, Lady Hester Fortescue, granddaughter of George Grenville. The politician the Hon. Peter John Locke King was his younger brother.\nEducated at Eton and Trinity, he entered the diplomatic service and became secretary to Lord Nugent. He succeeded in the barony in 1833 when his father died. He performed architectural work in his houses.\nFirst marriage\nby British painter Margaret Sarah Carpenter (1836)|alt=Ada Lovelace, painted portrait circa 1836]]\nIn 1835, Lord King (as he then was) married as his first wife Ada Byron, the only daughter of the poet Lord Byron and his wife Anne Isabella Milbanke. He was created Viscount Ockham and Earl of Lovelace in 1838, and appointed Lord Lieutenant of Surrey in 1840, a post he held until his death. The Lovelace title was chosen to mark the fact that Ada was, through the families of Byron, Milbanke, Noel and Lovelace, a descendant of the extinct Barons Lovelace. The couple had three children: Byron (born 1836), Anne (born 1837), and Ralph (born 1839). Lady Lovelace died in 1852, leaving her husband, in his forties, a widower.\nIn 1860, the Earl's eldest son, Byron, succeeded his maternal grandmother to become 12th Baron Wentworth according to its special remainder. However, he died, still unmarried, just two years later, and his brother Ralph became 13th Baron Wentworth. In 1861, Ralph assumed by Royal licence the surname of Milbanke in lieu of Noel.\nHonorary positions\nLord Lovelace was appointed Colonel of the 2nd Royal Surrey Militia on 14 August 1852. He resigned this command on 11 April 1870, when he was appointed Honorary Colonel of the regiment (which became the 3rd Battalion, Queen's (Royal West Surrey Regiment), a position he held until his death. By Royal licence, in 1860 he assumed the additional surname and arms of Noel, as well as the arms of Wentworth.\nSecond marriage\nIn 1865 he remarried, to the widow Jane Crawford Jenkins. They had one child, Lionel (1865–1929), who would eventually succeed as 3rd Earl of Lovelace in 1906.\nPossessions\nLord Lovelace had three homes: Ockham Park, Surrey; Ben Damph Estate on Loch Torridon in Ross-shire; and a house in London.\nHorsley Towers\nLord Lovelace acquired Horsley Towers (now a hotel) in East Horsley and was patron of the parish church funding the rebuilding of the chancel and the nave in 1869. He also rebuilt the wall of the churchyard which included a number of architectural features such as the gazebo and its family crest-engraved walls. He planned for his death 20 years before he died when he began work on a mausoleum in another corner of the churchyard. This mausoleum has recently been restored.\nHe had fifteen bridges, known as the Lovelace Bridges, constructed on his estate in East Horsley to facilitate the transport of timber by horse-drawn carts. The bridges were built where the tracks crossed existing bridleways or roads. Ten bridges still exist.\nBen Damph Estate\nIn 1886, the Earl purchased Ben Damph Lodge and its surrounding 12,000 acre sporting estate at the east end of Loch Torridon, in Ross-shire, Scotland. In 1889, he became a promoter of the Aultbea Railway.\nDeath and succession\n]]\nAt his death on 29 December 1893, his titles as Earl of Lovelace, Viscount Ockham and Baron King passed to his second (and eldest surviving) son Ralph, who was already the 13th Baron Wentworth. The first Earl of Lovelace was buried in his mausoleum in the churchyard of Martin's Church, East Horsley, which still contains his tomb and that of his second wife.\nReferences\nCitations\nBooks\n* ''Burke's Peerage, Baronetage and Knightage, 100th Edn, London, 1953.\n* [https://books.google.com/books?id=QlUysmzX-goC Capt John Davis, Historical Records of the Second Royal Surrey or Eleventh Regiment of Militia'', London: Marcus Ward, 1877.]"
    }
  ]
}