{
  "content": [
    {
      "type": "text",
      "text": "# William Richard Waring\n\n| death_place        = Savannah, Georgia, U.S.\n| resting_place      = Laurel Grove Cemetery, Savannah, Georgia, U.S.\n| alma_mater         =\n| occupation         = Physician\n| years_active       =\n| known_for          =\n| notable_works      =\n| boards             =\n| spouse             = Anne Johnston (1825–1836; her death)\n}}\nWilliam Richard Waring (July 4, 1787 – January 2, 1843) was a 19th-century American physician. He was described as one of the \"most illustrious physicians\" in Savannah, Georgia. The William Waring Property, the oldest extant building in that city's Wright Square, is now named for him.\nHe server two terms as mayor of Savannah (1830–1832).\nHis son was fellow physician James Johnston Waring.\nLife and career\nin Savannah, Georgia, Waring's family home]]\nWaring was born in 1787 in South Carolina. His father was William Waring Sr. He graduated South Carolina College in 1808, later studying medicine in Charleston, South Carolina.\nAfter further studies at the University of Pennsylvania (graduating in 1813), he served during the War of 1812 as surgeon of the 8th Regiment Infantry, stationed in Savannah, Georgia. He remained in the city for the rest of his life, initially living at 12 West State Street, which was built in 1825.\nIn 1821, he wrote Report to the City Council of Savannah on the Epidemic Disease of 1820.\nIn 1825, he married Anne Johnston, with whom he had four known children: William (born 1827), James (1829), George (1833) and Anna Mary (1836).\nAs his family expanded, Waring purchased a home at 121–123 West Oglethorpe Avenue in 1832, toward the end of his stints as mayor of Savannah.\nWaring was an 1833 co-founder of Savannah's Temperance Society.\nDeath\nWaring died in 1843, aged 55. He was interred beside his wife, who preceded him in death by seven years, in Savannah's Laurel Grove Cemetery.\nBibliography\n* Report to the City Council of Savannah on the Epidemic Disease of 1820 (1821)\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=KJSo3flZ6Lk \"Report to City Council - Dr. William R. Waring. 1820 House - Davenport House Museum\"] – James Credle, YouTube, October 5, 2020"
    }
  ]
}