{
  "content": [
    {
      "type": "text",
      "text": "# William John Warburton Hamilton\n\nWilliam John Warburton Hamilton (April 1825 – 6 December 1883), who generally signed as J. W. Hamilton, was an administrator, explorer, and politician in New Zealand.\nEarly life\nHamilton was born in 1825 at Little Chart, Kent, England. His father was Rev John Vesey Hamilton, and Richard Vesey Hamilton was his younger brother. He was educated in England, Paris, Brussels, and at Harrow School. He emigrated aged 18 on the Bangalore with Sydney in Australia as his destination, but he met Robert FitzRoy on the journey and became his private secretary; FitzRoy was travelling to take up the role of Governor of New Zealand.\nEarly time in New Zealand\nHamilton served for FitzRoy until the latter was recalled, and then worked under the next governor, George Grey. Hamilton returned to England in 1846. He returned on  in 1848 as a survey officer. From inland explorations, geographic features were named for him, including Hamilton Plains (now known as Hanmer Plain) on the Waiau Uwha River, and the nearby Mount Hamilton. In 1849, he attempted the first known ascent of Mount Tapuaenuku in the Kaikōura Ranges. He was with Edward John Eyre, Lieutenant-Governor of New Munster, and seven Māori. They came within a short distance of the summit but were forced to turn back.\nIn 1850, Governor Grey appointed Hamilton resident magistrate for Wanganui, which was a significant responsibility for a person aged 25.\nLife in Canterbury\nHamilton held the post in Wanganui for about half a year only before he took on another role at Port Cooper (now known as Lyttelton). At Lyttelton, he was appointed collector of customs for Canterbury in August 1853.\nOn 6 November 1855, Hamilton married Frances Townsend, daughter of James Townsend of Ferrymead. She was the eldest sister of the artist Mary Townsend.\nIn the first elections for the Canterbury Provincial Council on 31 August 1853, five people contested the three available positions in the Town of Lyttelton electorate. Hamilton came a close second, and was thus returned; the other successful candidates were Isaac Cookson and Christopher Edward Dampier (the solicitor of the Canterbury Association). In November 1853, he was appointed onto the first Executive Council (comparable to a cabinet) as Provincial Auditor under Henry Tancred. During a day of low attendance in October 1854, Richard Packer secured a suspension of the council's standing orders, which allowed him to have the first two readings of a bill to enlarge the council's membership by 12 additional members passed. Whilst there was justification for such a measure due to the long session lengths, the Executive Council consisting of Tancred, Henry Godfrey Gouland, Charles Simeon, and Hamilton regarded the matter as a vote of no confidence and resigned. He was a member of Tancred's second Executive Council (July 1855 – February 1857) and on the Executive led by Packer (February – June 1857). He retired at the end of his term as provincial councillor in July 1857 and did not seek re-election.\nHe was appointed resident magistrate of Christchurch in February 1856. When he left the customs service, he became receiver of land revenue. He retired in 1874. For some time, he was manager of the Union Bank in Lyttelton. In 1861, Charles Bowen sold his interest in the Lyttelton Times to William Reeves and Hamilton. He was a governor of Christ's College, and was on the board of Canterbury College (1875–1883).\nAs a resident magistrate, he was widely respected for his fair dealings. His contribution to the provincial government was regarded as valuable, especially his understanding of finances.  As a government official, he was perceived by William Ellison Burke, the avid recorder of Canterbury personalities in the 1850s and 1860s, as \"crotchety official – a wearisome magistrate\". Burke wrote:\nMr. H. was notoriously the most perfect embodiment of red tape who ever held office in Canterbury. His memos and questions upon documents were masterpieces and calculated to try the patience of the most saintly. As a magistrate he was a drawler and doubter and questioner who ever sat on the Bench of Christchurch. He had a supercilious style when he chose to be offensive and was very inquisitive.\nHamilton died on 6 December 1883 at his home in Latimer Square. Colleagues from the Lyttelton Times were pall bearers and carried the coffin from his home to Barbadoes Street Cemetery. His wife died in 1889.\nNotes\nReferences\n*\n*\n*\n*\n*"
    }
  ]
}