{
  "content": [
    {
      "type": "text",
      "text": "# William Warda\n\n| native_name_lang    = aii\n}}\nWilliam Warda () is an Iraqi Assyrian journalist and human rights campaigner. He is a former leading member of Iraq's Assyrian Democratic Movement and former general manager of Ashur TV before co-founding the Hammurabi Human Rights Organization with his wife, Pascal Esho Warda, who was a former Minister of Immigration and Refugees in the Iraqi Interim Government.\nCareer\nWarda was born in Mosul, Iraq in 1961 and studied Civil Engineering at the University of Mosul, with additional certification in International Studies and Political Science from the University of Baghdad. Warda had been involved with Assyrian activism early on, joining the Assyrian Democratic Movement (Zowaa) from the early 1990s. In 2000 he became the editor-in-chief of the newspaper Bahra and the CEO of Ashur TV in Nohadra.\nIn 2005, Warda and his wife, Pascale Warda, led in the founding of the Hammurabi Human Rights Organization, a non-profit group that monitors and opposes human rights violations against members of Iraq's minority groups. Warda served as the president of the organization from 2007 to 2013, and during his tenure, the organization received the 2012 Human Rights Award from the U.S. Department of State. Since 2015, Warda has served as chairman of the Alliance of Iraqi Minorities, a coalition of civil society groups working to forge better cooperation among Iraq's disparate, and often divided, minority communities—including Assyrian Christians, Shabaks, Mandaeans, Yarsanis (Kaka'is), Baha'is, Faili Kurds and Yazidis. He is also the webmaster of a number of websites including christiansofiraq.com.\nWarda has continuously focused on amplifying the voices of Iraq's minority communities, particularly its Christian groups, where he estimated that as much as half of them fled the country as a result of the U.S. Invasion and sectarian attacks.   Warda has also spoken on the plight of Yazidis during the Yazidi genocide, and has been critical of the lack of democracy and progress in the political scene of Iraq post-ISIS.\nIn 2019, the U.S. State Department awarded William and Pascale Warda one of its inaugural International Religious Freedom Awards. In the same year, Warda was chosen to be the spokesperson for then Iraqi prime minister, Adel Abdul Mahdi, and has spoken about the developments of Iraq on numerous occasions during Mahdi's tenure.\nPersonal life\nWarda, alongside his wife Pascal, have two daughters, named Shlama and Neshma. They both continue to reside over the Hammurabi Human Rights Organization, where Warda has overseen most of its projects.\nWarda is also fluent in 4 different languages, namely his native Assyrian, alongside Arabic, English, and Kurdish.\nReferences"
    }
  ]
}