{
  "content": [
    {
      "type": "text",
      "text": "# Willie Rockward\n\nWillie S. Rockward is a physics professor and has served as the chair of the department of physics and engineering physics at Morgan State University since August 2018. His research interests include Micro/Nano Optics Lithography, Extreme Ultraviolet Interferometry, Metamaterials, Terahertz imaging, Nanostructure Characterization, and Crossed Phase Optics. From 2018 to 2020 he was the president of the National Society of Black Physicists.\nEarly life and education\nRockward grew up in Louisiana. He attended South Terrebonne High School. He played American football at college (for the South Terrebonne High School Gators) and was a member of the varsity team. He also took part in track and field. He was offered football scholarships at Duke University and Louisiana State University, but was interested in Grambling State University because of the coach Eddie Robinson. Rockward achieved high scores in his ACT and was offered a physics scholarship at Grambling State. At Grambling State, Rockward served as President of the Omega Psi Phi fraternity. He graduated with a B.S. degree cum laude in Physics in 1988. Rockward joined University at Albany, SUNY for his graduate study and earned an M.S. degree in physics in 1991. He moved to Georgia Institute of Technology where he received an M.S. degree in physics in 1994, and a Ph.D. degree in physics in 1997, this under the supervision of Donal O'Shea. Together they worked on diffractive optics and quadrature microscopy. Whilst completing his doctorate he worked as a research physicist at the Air Force Research Laboratory. He developed laser radar and guided munitions.\nCareer\nRockward joined the faculty of Morehouse College in 1998. He was research director of the Materials and Optics Research & Engineering (MORE) Laboratory. He worked on nanolithography, terahertz imaging and physics education. He developed a range of research experiences for undergraduates and the Scholarly Mentorship in Laboratory Experiences (SMILE) program. He also established the Nuclear, Materials, and Space Sciences (NuMaSS) Summer School (NuMaSS) which introduced middle and high school students to a physics career. He was awarded tenure in 2008.\nIn 2011 Rockward was appointed chair of the department of physics and dual degree engineering, resulting in Morehouse College having the most underrepresented minority Bachelor of Science graduates. As Chair of Department, Rockward investigated the barriers for HBCU physics departments. Rockward is an advocate for mentoring as a method to support students from underrepresented groups in physics. He launched \"We C.A.R.E\" (Curriculum, Advisement, Recruitment/ Retention/ Research, and Extras) a pedagogical approach that combines sessions on culture, collaboration and career, alongside the Innovative Technology Experiences for Students and Teachers program. He was made the Society of Physics Students Outstanding Chapter Advisor in 2012.\nIn 2017 Rockward was appointed president of Sigma Pi Sigma. He joined Morgan State University in 2018. Working with Associated Universities, Inc. to secure support from the National Science Foundation to deliver the National Society of Black Physicists conference. He has delivered the keynote talk at the Conference for Underrepresented Minority Physicists (CU2MiP).\nHis current work focuses on extreme ultraviolet laser light and spectroscopic analysis of binary star systems.\nPersonal life\nRockward has served a combination of 23 years as Pastor of the Divine Unity Missionary Baptist Church in East Point Georgia and Associate Minister of Antioch Baptist Church North in Atlanta, Georgia. Rockward is married to mathematician Michelle Rockward.\nReferences"
    }
  ]
}