{
  "content": [
    {
      "type": "text",
      "text": "# William F. Allen (Delaware politician)\n\n| birth_place      = Seaford, Delaware\n| death_date       =\n| death_place      = Lewes, Delaware\n| spouse           = Mary Addie Davis\n| party            = Democratic\n| alma_mater       =\n| occupation       = Businessman\n| profession       =\n}}\nWilliam Franklin \"Love Bird Bill\" Allen (January 19, 1883 – June 14, 1946) was an American businessman and politician. He was a Democratic member of the Delaware General Assembly and the United States House of Representatives.\nEarly life and family\nAllen was born in Seaford, Delaware, son of Willard Franklin (\"Frank\") Allen and Mollie (Smith) Allen. His father was a foreman on the Pennsylvania Railroad for 40 years, retiring in 1921. Frank's oldest brother, William Asbury Allen, served in the Confederate army, 1861-1863.\nAllen married Mary Addie Davis on April 16, 1906, in Marydel, Maryland. Her father, Robert A. Davis, ran a store and was postmaster of the now-defunct town of Slaughter, Delaware. He served a term as a Republican in the General Assembly.  Allen and his wife had three children; Franklyn, Robert, and Doris. They belonged to St. John's Methodist Episcopal Church in Seaford.\nWhile still in school Allen began working for the Pennsylvania Railroad as a carpenter, and later advanced to become a ticket agent, telegrapher, and train dispatcher. From ca. 1905 until 1909 he was the station master at Marydel, Maryland. He returned to Seaford in 1909 and later left the railroad to begin a real estate brokerage business specializing in farmland. In 1914 he began the Allen Package Company to make shipping containers for fruit, vegetables, and oysters. He also formed a brokerage firm to buy fruit and produce throughout the Delmarva Peninsula. In 1927 he was granted a franchise by the Pure Oil Company of New York for the Delmarva Peninsula.\nIn 1915 Allen purchased one of Seaford's most distinguished residences. Located on High Street, the large frame house had been constructed in 1886 by Willie M. Ross, a son of Governor William H. Ross, a successful businessman, a one-term state senator (1890-1894), and a Delaware state treasurer (1896-1898). Allen paid $5,250 for the house that Ross reportedly had spent $17,000 to build. After ten years, Allen removed the Queen Anne style porches and replaced them with spacious Colonial Revival porches with Ionic columns. The alterations were begun in April 1925 and were completed five months later.\nPolitical career\nIn 1914, during his first political campaign, Allen sought his party's nomination for representative to the General Assembly; he lost by 54 votes. Two years later he was elected to the Seaford Board of Education. That same year he ran for a seat in the state senate, but lost to Edward M. Brown by one vote. In 1920 he was a delegate to the Democratic National Convention in San Francisco.\nAllen's third bid for statewide office proved successful: he was elected to the Delaware state senate in 1924. He served from 1925 to 1929, and was elected President pro tempore in 1927\nA strong supporter of U.S. President Franklin D. Roosevelt and the New Deal, Allen sought his party's nomination for U. S. Senate in 1936. When his vigorous efforts failed at the state convention, the party nominated him instead for the state's lone seat in the U. S. House of Representatives. He was elected to Congress in 1936, defeating incumbent Republican U.S. Representative J. George Stewart. Allen lost his bid for a second term in 1938 to Republican George S. Williams, a businessman from Millsboro, Delaware. During his term, Allen was a member of the Democratic majority in the 75th Congress and served from January 3, 1937, until January 3, 1939, during the second administration of President Roosevelt.\nWhile a member of Congress Allen supported efforts to construct a bridge over the Delaware River just below Wilmington. This project was opposed by Philadelphia shipping interests, which warned such a structure would restrict the size of ships entering the port of Philadelphia. In a committee hearing, Allen claimed he would never harm Philadelphia, that he loved Philadelphia, and that his wife did her shopping there--and he loved his wife. Yet, despite his love for Philadelphia he loved little Delaware more and this bridge was vital to its economic interests. With so many references to \"love\" during these brief remarks, Allen was soon nicknamed \"Love Bird Bill.\" Pundits and cartoonists happily latched onto Allen's catchy new nickname.\nAt the end on his single term in the House, Allen resumed full-time work in his various businesses. In 1940, however, he again tried to secure the Democratic nomination for U. S. Senate. When that effort failed, he hastily formed a third party, the so-called \"Liberal Democratic Party,\" on which to run. In that election Allen received only 2,547 votes, not enough to affect the outcome. This was his final run for public office.\nDeath\nAllen died at Beebe Hospital in Lewes and is interred at the Odd Fellows Cemetery in Seaford, Delaware.\nElectoral history\nFurther reading\n*\nReferences\nExternal links\n*[http://bioguide.congress.gov/scripts/biodisplay.pl?index=A000151 Biographical Directory of the United States Congress ]\n*[http://www.russpickett.com/history/sentbio6.htm#allen Delaware's Members of Congress ]\n*\n*[http://politicalgraveyard.com/bio/allen9.html#R9M0INRKG The Political Graveyard ]\n*[http://www.lib.udel.edu/ud/spec/findaids/allen_w.htm William F. Allen Scrapbooks, 1830-1946 ]\nPlaces with more information\n*Delaware Historical Society; [http://www.hsd.org/ website] ; 505 North Market Street, Wilmington, Delaware 19801; (302) 655-7161.\n*University of Delaware; [http://www.lib.udel.edu/ Library website]; 181 South College Avenue, Newark, Delaware 19717; (302) 831-2965."
    }
  ]
}