{
  "content": [
    {
      "type": "text",
      "text": "# William de Warenne, 2nd Earl of Surrey\n\n| resting_place = Lewes Priory, Sussex, England\n| title = The Earl of Surrey\n| CoA =\n| tenure = 1088–1101 and 1103–1138\n| nationality = Norman\n| predecessor = William de Warenne, 1st Earl of Surrey\n| successor = William de Warenne, 3rd Earl of Surrey\n| spouse = Elizabeth of Vermandois\n| issue-link = #Family\n| issue = William de Warenne, 3rd Earl of SurreyReginald de WarenneAda de Warenne\n| father = William de Warenne, 1st Earl of Surrey\n| mother = Gundred\n}}\nWilliam de Warenne, 2nd Earl of Surrey (died 11 May 1138) was the son of William de Warenne, 1st Earl of Surrey and his wife Gundred. He was more often referred to as Earl Warenne or Earl of Warenne than as Earl of Surrey.\nLife\nHis father, the 1st Earl, was one of the Conqueror's most trusted and most rewarded barons who, at his death in 1088, was the third- or fourth-richest magnate in England. In 1088 William II inherited his father's lands in England and his Norman estates including the castles of Mortemer and Bellencombre in Haute-Normandy. But William II was not as disposed to serve the king as his father was. In January 1091, William assisted Hugh de Grandmesnil (died 1094) in his defence of Courcy against the forces of Robert de Belleme and Duke Robert of Normandy. In 1093 he attempted to marry Matilda (or Edith), daughter of king Malcolm III of Scotland. She instead married Henry I of England, and this may have been the cause of William's great dislike of Henry I, which motivated him in the following years.\nWhen Robert Curthose, Duke of Normandy invaded England in 1101 William joined him. But when Curthose promptly surrendered to Henry I, William lost his English lands and titles and was exiled to Normandy. There he complained to Curthose that he had expended great effort on the duke's behalf and in return lost all of his English possessions. Curthose's return to England in 1103 was apparently made to convince his brother, the king, to restore William's earldom. This was successful, though Curthose had to give up his 3,000-mark annual pension he had received after the 1101 invasion, after which William's lands and titles were restored to him.\nTo further insure William's loyalty Henry considered marrying him to one of his many illegitimate daughters. Archbishop Anselm of Canterbury forbade the marriage based on the couple being related in the fourth generation on one side, and in the sixth generation on the other. William was one of the commanders on Henry's side (against Robert Curthose) at the Battle of Tinchebray in 1106. Afterwards, with his loyalty thus proven, he became more prominent in Henry's court.\nIn 1110, Curthose's son William Clito escaped along with Helias of Saint-Saens, and afterwards Warenne received the forfeited Saint-Saens lands, which were very near his own in upper Normandy. In this way king Henry further assured his loyalty, for the successful return of Clito would mean at the very least Warenne's loss of this new territory. He fought for Henry I at the Battle of Bremule in 1119. William, the second Earl of Surrey was present at Henry's deathbed in 1135. After the king's death disturbances broke out in Normandy and William was sent to guard Rouen and the Pays de Caux.\nWilliam was a donor to a number of priories, with his donations being mentioned in charters issued between 1130 and 1138 to Longueville Priory near Rouen, Normandy and to the priory of Bellencombre (also near Rouen) in 1135. His sons and his wife were witnesses to many of these charters.\nWilliam's death is recorded as 11 May 1138 in the register of Lewes Priory and he was buried at his father's feet at the chapter house there. His wife, the countess Elizabeth, survived him, dying before July 1147.\nFamily\nIn 1118, William finally acquired the royal-blooded bride he desired when he married Elizabeth of Vermandois. She was a daughter of Hugh I, Count of Vermandois and granddaughter of Henry I, King of France, as well as the widow of Robert de Beaumont, 1st Earl of Leicester.\nCoat of arms of the capetian counts of Vermandois\nBy his wife Elizabeth, he had three sons and two daughters:\n* William de Warenne, 3rd Earl of Surrey\n* Reginald de Warenne, who inherited his father's property in upper Normandy, including the castles of Bellencombre and Morteme. He married Alice de Wormegay, daughter of William de Wormegay, Lord of Wormegay in Norfolk, by whom he had a son, William de Warenne (founder of the priory of Wormegay), whose daughter and sole heir, Beatrice de Warenne, married, firstly, Doun, Lord Bardolf, and, secondly, Hubert de Burgh. Reginald was one of the persecutors of Archbishop Thomas Becket in 1170.\n* Ralph de Warenne\n* Gundred de Warenne, who married, firstly, Roger de Beaumont, 2nd Earl of Warwick, and, secondly, William de Lancaster, Lord of Kendal, and is most remembered for expelling King Stephen's garrison from Warwick Castle.\n* Ada de Warenne, who married Henry of Scotland, 3rd Earl of Huntingdon, and was the mother of two Scottish kings. She made many grants to the priory of Lewes.\nAncestry\nReferences\nSources\n*\nExternal links\n*"
    }
  ]
}