{
  "content": [
    {
      "type": "text",
      "text": "# William G. Stewart\n\n| birth_place = Lancaster, England\n| death_date=\n| yearsactive = 1960s–2017\n| spouse =\n*\n*\n}}\n| children = 5\n}}\nWilliam Gladstone Stewart (15 July 1933 – 21 September 2017) was an English television producer, director, and television presenter. He presented and produced the Channel 4 quiz show Fifteen to One from 1988 to 2003.\nEarly life\nStewart was born on 15 July 1933 in Lancaster. He was orphaned as a child before the age of three, and he was raised in a children's home in Sidcup, Kent until the age of 17. After leaving Shooters Hill Grammar School (now called Shooters Hill Sixth Form College) in 1950, Stewart was employed in jobs working in an office and enrolled at Woolwich Polytechnic. He undertook his National Service in Kenya and worked as a teacher in the Royal Army Educational Corps from 1952 to 1955 as part of his attachment to the King's African Rifles.\nIn 1958, Stewart ventured to Southampton to join the Merchant Navy, though an industrial action prevented him from doing so. Instead, he applied to be a redcoat with the seaside resort chain Butlins at Butlin's Pwllheli in North Wales. Stewart said of the opportunity, \"I thought I'd have a great time and perhaps work in the kitchens. But, while I was having an interview, a chap asked if I wanted to be a redcoat. He must have seen something in me.\" There, he organised a talent contest won by Jimmy Tarbuck and led the teenager to become a redcoat and a stand-up comedian.\nBroadcasting career\nStewart went to a talk organised by the producer T Lesley Jackson about a career in television at the YMCA in Brixton in south-west London in 1958. It encouraged him to speak to Jackson and apply for the job of a call-boy for the BBC's Light Entertainment output. He later became an assistant floor manager and a stage manager, before ending up as a production assistant. After the 1959 general election, Stewart began working as private secretary to Tom Driberg, the Labour Member of Parliament. Driberg taught Stewart about art, classical music and literature, and broadened his social circle.\nHe was encouraged by the comedian Eric Sykes to enrol on a television director's course in 1965. Stewart was advised his best career path would be to remain in the entertainment industry, and Sykes recommended Stewart to his fellow light entertainment comedian Frank Muir. The same year, he directed episodes of the sitcoms Call It What You Like and Sykes and a... Stewart moved to the rival broadcaster ITV in 1967, working for the Associated Television, London Weekend Television and Thames Television franchises. He was a director on 54 episodes of The Frost Programme, and The Frost Report for Associated-Rediffusion.\nAmong the many shows he produced or directed were Father, Dear Father, Love Thy Neighbour, Bless This House, My Good Woman, ''Spooner's Patch, The Rag Trade, Family Fortunes, Don't Forget Your Toothbrush, Thirty Minutes Worth, My Name Is Harry Worth, The Reg Varney Show, The Many Wives of Patrick, and The Price Is Right. He also presented the short-lived 1992 quiz show Famous People, Famous Places, made by his company, Regent Productions (which also produced Fifteen to One) that he founded in 1982, for Thames Television and shown only in the London region (although repeated towards the end of 1992 on Channel 4). He later sold Regent to Pearson Television (which also purchased Thames) in 1999, and they have now been amalgamated (along with the likes of Grundy Productions) into Talkback Thames, the UK arm of FremantleMedia.\nIn 1998, he successfully sued the Fifteen to One contestant Trevor Montague, who had lied to reappear on the programme. He made a documentary of Tom Driberg in 2009. Stewart was a frequent contributor of media matters articles to the Broadcast, Evening Standard, Impact, RTS Journal, The Independent, The Listener, The Producer and Televisual publications. He was made a Fellow of the Royal Television Society in 1996 and was president of The Media Society from 2003 to 2005.\nPersonal life and death\nStewart married three times, firstly to Audrey Harrison from 1960 until 1976 with whom he had a son.\nFrom 1976 until 1986 he was married to actress Sally Geeson, with whom he had two children. From 1997 until his death he was married to Laura Calland, with whom he had a further two children. Calland was the voice-over on the programme Fifteen to One.''\nStewart was a long-standing supporter of the campaign to return the Elgin Marbles to Greece. He once said that if, on an episode of Fifteen to One, too few contestants survived the first round to continue the game, he would give a speech on the Marbles to fill the time. This happened in a 2001 episode, where he gave a lengthy presentation stating the case to return them, for which the channel was criticised.\nStewart died on 21 September 2017, aged 84, following a brief illness.\nReferences\nExternal links\n*\n*[http://www.ukgameshows.com/ukgs/William_G._Stewart UK Gameshows Page: William G. Stewart]"
    }
  ]
}