{
  "content": [
    {
      "type": "text",
      "text": "# Wilsonton Heights, Queensland\n\n| local_map           = yes\n| zoom                = 13\n| pop                 = 2747\n| pop_year            =\n| pop_footnotes       =\n| established         = 2006\n| postcode            = 4350\n| area                = 1.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 5.1\n| dir1                = NW\n| location1           = Toowoomba CBD\n| dist2               = 133\n| dir2                = W\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Toowoomba Region\n| stategov            = Toowoomba North\n| fedgov              = Groom\n| near-n              = Cranley\n| near-ne             = Cranley\n| near-e              = Rockville\n| near-se             = Rockville\n| near-s              = Wilsonton\n| near-sw             = Wilsonton\n| near-w              = Wilsonton\n| near-nw             = Cranley\n}}\nWilsonton Heights is a residential locality of Toowoomba in the Toowoomba Region, Queensland, Australia. In the , Wilsonton Heights had a population of 2,747 people.\nGeography\nWilsonton Heights is located  northwest of the Toowoomba central business district.\nThe locality is mostly residential, and contains Wilsonton State High School.\nHistory\nThe locality is named after James T. Wilson, a Toowoomba businessman. He was involved with the Toowoomba Agricultural Society and unsuccessfully contests the Queensland Legislative Assembly seat of Darling Downs in 1878.\nIn 2006 the suburb of Wilsonton Heights was split from the suburb of Wilsonton.\nThe Wilsonton campus of Toowoomba State High School opened in 1998 as the fourth secondary campus for Toowoomba's youth. As at 2015, the campus catered for approximately 840 students (2015) in Years 7 to 12.\nOn 9 August 2016, Education Minister Kate Jones announced that the Wilsonton campus would be separated from the Toowoomba State High School. The new Wilsonton State High School opened on the first school day in 2017 (23 January 2017). The new name for the school was decided  through a community consultation process.\nDemographics\nIn the , Wilsonton Heights had a population of 2,669 people.\nIn the , Wilsonton Heights had a population of 2,747 people.\nEducation\nWilsonton State High School is a government secondary (7–12) school for boys and girls at 275 North Street (). In 2017, the school had an enrolment of 678 students with 69 teachers (65 full-time equivalent) and 37 non-teaching staff (28 full-time equivalent). It includes a special education program and an agricultural centre.\nThere are no primary schools in Wilsonton Heights. The nearest government primary schools are Rockville State School in neighbouring Rockville to the east, Wilsonton State School in neighbouring Wilsonton to the south, and Fairview Heights State School, also in Wilsonton, but to the south-west.\nThere are numerous non-government schools in Toowoomba and its suburbs.\nAmenities\nToowoomba Wesleyan Methodist Church is at 267 North Street (). It is part of the Wesleyan Methodist Church of Australia.\nReferences\nExternal links"
    }
  ]
}