{
  "content": [
    {
      "type": "text",
      "text": "# Windeward Bound\n\n{|\n|+Windeward Bound\n|Ship name=\n|Ship owner=\n|Ship ordered=\n|Ship builder=\n|Ship original cost=\n|Ship laid down=June 1992\n|Ship launched=1996\n|Ship acquired=\n|Ship commissioned=\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship identification=*\n*Callsign: VJT5691\n|Ship honours=\n|Ship honors=\n|Ship captured=\n|Ship fate=\n|Ship status=Active\n|Ship notes=\n}}\n|Ship beam=\n|Ship draught=\n|Ship draft=\n|Ship hold depth=\n|Ship propulsion=\n|Ship sail plan=Brigantine\n|Ship complement=16\n|Ship armament=\n|Ship notes=\n}}\n|}\nWindeward Bound is a two-masted brigantine-rigged vessel based in Hobart, Tasmania, Australia. The vessel is named after Lewis Winde, the builder of an 1848 Boston schooner on which Windeward Bound was modelled. It is constructed almost entirely of Tasmanian eucalypt, huon pine and Oregon pine, recycled from old boats and buildings. The hull is constructed of 5&nbsp;cm hardwood strip planks, over epoxy-laminated douglas fir frames, spaced 38&nbsp;cm (15 inches) apart. The stem, sternpost and keel are of epoxy-laminated Tasmanian blue gum and the decks are of huon and New Zealand kauri pines.\nWindeward Bound is rigged with four square sails, three headsails, three staysails between the masts, a gaff mainsail and gaff topsail, totalling 12 sails in all. The total sail area is  and the windage lever of the sails from the centre of lateral resistance is 9.87 m.\nShe is commonly used for training youth (of any age) to sail, offering training and voyages that last from anywhere between an hour or two to many weeks. In 2002–2003, the ship and her crew embarked on a successful circumnavigation voyage around Australia to celebrate the 200th anniversary of the first circumnavigation, charting and naming of the continent of Australia by Matthew Flinders. During this voyage, the crew docked in most Australian ports and coastal communities, with the help of Coastcare, to spread the message for individuals and organisations to become actively involved in ground works to protect and manage coastal and marine environments.\nThe ship was also able to connect with local schools and community groups by performing a play recounting the adventures of Flinders in his circumnavigation through the play Roundabout, written by Les Winspear and performed by Theatre Alfresco.\nOn 3 June 2004 Windeward Bound was subject to knockdown about 30 miles south of Gabo Island off the Victorian coast when a gust of near-hurricane-force wind heeled the vessel about 68 degrees to starboard. This resulted in the loss of electrical power and damage to the engine which prevented communication with the ship resulting in a successful aircraft search for the ship. The ship berthed at HMAS Creswell at 2200 on the 5th. Both the main engine and the generator were replaced before sailing again.\nIn October 2013 Windeward Bound participated in the International Fleet Review 2013 in Sydney, Australia.\nReferences\nExternal links\n* [http://www.windewardbound.com/ Windeward Bound Trust]\n* [http://www.culture.com.au/virtual/flinders.htm 360 degree panorama of the ship]"
    }
  ]
}