{
  "content": [
    {
      "type": "text",
      "text": "# Windmills in Leeuwarden\n\nThe city of Leeuwarden, Friesland, the Netherlands has had at least 130 windmills over the centuries. Only one, the Froskepôlemolen survives today within Leeuwarden. Six other mills which have stood in Leeuwarden survive elsewhere in the Netherlands. The mills had a wide range of industrial and agricultural uses. The industrial uses include the processing of bark for tanning leather, the fulling of cloth, the production of cement, the production of dyes, the extraction of oil (including the production of paints),  the grinding of tobacco to produce snuff, the production of gunpowder, and the sawing of timber. Agricultural uses include the milling of buckwheat, oats, rye and wheat, the processing of chicory, the production of pearl barley, and the pumping of water.\nSurviving windmills\nFroskepôlemolen\nThe grondzeiler Huizumer en Goutum Nieuwlandmolen was moved to a new site within Leeuwarden in 1962. It now stands on the island known as Froskepôlle at . The mill is a drainage mill, and is maintained in working order.\nWindmills with surviving remains\nDe Haan\nThe stellingmolen De Haan () was built before 1685. It stood on the south side of the Zuidvliet at . It was a fulling mill. In 1749 it was converted to a barley mill. In 1832 it was converted to an oil mill, at which time it was known as De Haan. After 1848 it was also a cement mill. The mill was standing in 1878, but had been demolished by 1903 leaving the base which survives, having survived a threat of demolition in 2003.\nDe Eendracht, (oil and barley mill)\nDe Eendracht () was a stellingmolen which built before 1786 as a barley and oat hulling mill. It was later converted to an oil mill. The mill stood on the Dokkumer Trekweg at . In 1888, the smock was moved to Anjum, where it was erected on a new brick base. The mill stands today, known as De Eendracht. At Leeuwarden, the original base of De Eendracht survives. Following a fire in 2014, a proposal was made in November 2015 to build a new smock on the existing base. The building would be used for residential purposes. The new steel-framed smock and cap, with dummy sails, was lifted onto the base on 6 March 2018.\nWindmills formerly in Leeuwarden which survive elsewhere\nDe Phenix\nDe Phenix () stood on the site of De Hersteller, to the south of the Zuidvliet between the Looiersbrug and the Bakkersbrug at . The mill was a sawmill. In 1917 it was moved to Marrum, where it stands today known as De Phenix, converted to a drainage mill.\nDe Jonge\nDe Jonge () was a stellingmolen which was built in 1871. It stood on the Harlinger Trekvaart to the west of De Kat at . It was an oil mill. A steam engine was installed in 1878. In 1887, the mill was moved to Marle, Overijssel, where it was converted to a corn mill. The mill survives and is known as De Vlijt.\nHimriksmolen\nThe Himriksmolen was a spinnenkopmolen which was built in 1830 close to the Woudmansdiep at . It was a drainage mill. Replaced by a pumphouse in 1948, the mill was moved to Ryptsjerk in 1952, where it stood at . On 13 November 1972, the mill was badly damaged in a storm. It was moved to Tytsjerk in 1976, where the mill stood to the south of the Lytse Wielen at . Due to boundary changes the mill's location became part of Leeuwarden, and then reverted to Tytsjerk. On 30 June 1995, the mill was burnt down in an arson attack. The mill was restored in 1996, and is known as De Himriksmole or De Groene Ster.\nHuizumer en Goutumer Nieuwlandmolen\nThe Huizumer en Goutumer Nieuwlandmolen was a grondzeiler which was built in 1850 to drain the Huizumer en Goutumer Nieuland polders, which had a combined area of . The mill stood about  to the south west of Leeuwarden railway station at . In 1962, the mill was moved to a new site within Leeuwarden, where it is known as the Froskepôlemolen.\nMolen aan de Nieuwe Kanaal\nA stellingmolen was built in 1732 by the Nieuwe Kanaal, which is now known as the Emmakade, at . It was a barley mill, and later an oil mill and bark mill. Last recorded at Leeuwarden in 1786, the mill was later moved to Heerenveen, where it was known as De Fortuyn. The mill was moved to Hankate, Overijssel in 1892, taking the name Molen van Kappert. In 1916, the mill was moved to Veenoord, Drenthe, and took the name Nooitdgedacht. The mill still stands in Veenoord.\nVanished windmills\nCammingha-Buurstermolen\nThe Cammingha-Buurstermolen was a grondzeiler which was built in 1850 along the Kalverdijkje at . The mill was working until 1947 when a  electric motor was installed. In 1958, the mill was bought by the Gemeente Leeuwarden for ƒ5. It was restored by millwright De Roos of Leeuwarden. The sails were removed the early 1990s. On 11 May 1994, the mill was the victim of an arson attack. The remains of the mill were demolished in 2000.\nDe Arend (standerdmolen)\nThe first mill on this site was a standerdmolen which was moved from the Noordvliet in 1621. Located on the city walls at Vrouwenpoortsdwinger, . It was still standing in 1664.\nDe Arend (stellingmolen)\nThe standerdmolen was later replaced by a stellingmolen on the same site () which served as a corn mill. It was called De Arend (). The mill was purchased by the Gemeente Leeuwarden in 1895 and demolished in 1901. It was the last windmill to stand on the city walls.\nDe Basuin\nDe Basuin was a stellingmolen which was built in 1849 to the south of the railway station at the junction of Hollanderwijk and Wassenberghstraat, . The mill was a corn and barley mill. It was demolished in 1913, leaving the base standing. This was demolished in September 1978.\nDe Boer, De Hersteller\nDe Boer (), also known as De Hersteller () stood to the south of the Zuidvliet between the Looiersbrug and the Bakkersbrug at . The mill was built in 1672. it was known as De Boer until 1823, then  De Hersteller until 1848, when it burnt down. It was replaced by a new stellingmolen which was  named De Phenix or De Phoenix.\nDe Drie Gouden Kronen\nDe Drie Gouden Kronen () was a stellingmolen which was built in 1770. It was an oil mill. The mill stood on the east side of the Dokkumer Ee at . A steam engine was added in 1881 and the mill was demolished in 1891. The foundation stone of the mill has been preserved.\nDe Eendracht (1st sawmill)\nThe first sawmill named De Eendracht was a  stellingmolen which was built between 1718 and 1739. The mill stood on the Schenkenschans, to the south side of the Harlinger Trekvaart at . The mill burnt down on 18 May 1878.\nDe Eendracht (2nd sawmill)\nThe second sawmill named De Eendracht was a stellingmolen which originally stood at Zaandam-Oost, North Holland where it had been built in 1787 and was a sawmill known as De Bakker (). It replaced the earlier mill which had burnt down, standing on the same site, . It was demolished in 1919.\nDe Eenhorn, Wijninghahornster Mollen, Dye Molen voor Wirdumerpoerte\nDe Eenhorn ) was a standerdmolen. The first mention of a mill on this site was in 1496, when it was known as the Wijninghahornster Mollen In 1516, the mill was in use as a dye mill, then being known as the Dye Molen voor Wirdumerpoerte.  By 1582, the mill was in use as a corn mill. It stood to the east of De Rosenboom at . The rye and wheat mill De Eenhorn was sold in June 1837, this being the last evidence of its existence.\nDe Fortuin (standerdmolen)\nA standerdmolen originally stood on this site, which lies on De Wirdumerpoortsdwinger at . It was a corn mill built between 1580 and 1603. The mill was demolished c1760 and replaced with a stellingmolen.\nDe Fortuin (stellingmolen)\nThe stellingmolen known as De Fortuin (}) was also a corn mill. It was moved within Leeuwarden in 1873, taking the name Het Fortuin at its new site.\nDe Herderin, De Blauwe Molen\nThis stellingmolen was moved from Zaanstreek, North Holland in 1830. There, it was a paper mill known as De Herderin (). The mill was also known as De Blauwe Molen () due to it having been moved to Leeuwarden by a millwright by the name of De Blauwe. Its site is to the west of the Cambuur Stadion at . The mill was an oil mill, it was moved c1892 to Minnertsga, where it was a corn mill known as De Welkomst (). The mill was demolished in 1947.\nDe Hersteller\nDe Hersteller () was a stellingmolen which was built in 1819. It was a saw mill which stood on the Schenkenschans, on the west side of De Zwette at . The mill was demolished in 1903.\nDe Hoop, Groote Weijdmolen, 's Pinsenweitmolen\nThe first mill on this site was a standerdmolen which had been moved from Het Schravernek in 1624. De Hoop was a stellingmolen which was a corn mill. It was also known as Groote Weijdmolen or s Prinsenweitmolen. The mill stood behind the De Arend theatre at . It was demolished  in 1885.\nDeinumerpoldermolen\nThe Deinumerpoldermolen or Deinumer Nieuwmanspoldermolen was a grondzeiler which was built in 1774 by millwright Frans Beernts of Leeuwarden to drain the approximately  Deinumer Nieumanspolder. The mill stood on the Zwette,  to the east of the church on the Snekervaart at . in 1916, an electric motor was installed. The mill was demolished in 1918 and an electrically driven pump was erected in its place.\nDe Jong Fenix (forerunner)\nA standerdmolen was moved from within Leeuwarden c1642. It stood on the Zuidvliet at . The mill was a corn mill, it burnt down in 1752.\nDe Jong Fenix, De Stenen Molen\nDe Jong Fenix () was a stellingmolen which served as a bark mill, and oil mill and a cement mill. The mill was built in 1752 on the site of the post mill which had burnt down (). It was also known as De Stenen Molen (). The mill was demolished in 1904, but the foundation stone has been preserved and can be seen in the Fries Museum, Leeuwarden.\nDe Kat\nDe Kat () was a stellingmolen which was built in 1699 as a barley mill. It stood on the Harlinger Trekvaart at . In 1739, the mill was rebuilt as an oil mill. It was demolished in 1903.\nDe Kroon\nDe Kroon () was a stellingmolen which was built in 1760 as a snuff and paint mill. It stood near the mouth of the Nieuw Kanaal at . The mill was converted to a gunpowder and oil mill. In 1822 it was used only as an oil mill. It was demolished in 1914.\nDe Kroon, De Steenbikmolen\nDe Kroon or De Steenbikmolen was a stellingmolen which was built between 1884 and 1887. It stood on the Hollanderdijk close to De Schrans at . The mill was probably a drainage mill originally, but was later converted to a stamping mill. The mill was standing in 1896 but was struck by lightning at an unknown date, losing its sails. The mill was then demolished, it had gone by 1905.\nDe Leeuw (standerdmolen)\nThe first mill on the site occupied by De Leeuw was a standerdmolen built in 1622. The mill stood on the Oldhoofsterdwinger at . It burnt down in 1689.\nDe Leeuw (stellingmolen)\nIn 1690, a stellingmolen was erected in the place of the mill which had burnt down (). This mill was known as De Leeuw; (). The mill was bought by the Gemeente Leeuwarden in 1882 and demolished that same year.\nDe Morgenster\nDe Morgenster () was a stellingmolen which was built in 1842 to replace a horse mill. It stood on the Zuidvliet at . The mill was a chicory, rye, and barley mill, as well as a drainage mill. It was demolished in 1861, and probably moved to an unknown location.\nDe Paltrok, De Poltrok\nThe eponymous De Paltrok or De Poltrok was a paltrokmolen which was built between 1718 and 1735. It stood on De Schenkenschans, along the Harlinger Trekvaart at . The mill was a sawmill it was demolished in 1812.\nDe Rosenboom (standerdmolen)\nThe first mill on the site later occupied by De Rosenboom was a standerdmolen which was marked on a map dated 1664. It stood on the west side of the Rijksweg at . The mill was demolished c1750, and replaced by an achtkantmolen, which was built in 1751.\nDe Rosenboom (achtkantmolen)\nDe Rosenboom () was an achtkantmolen, which stood on the west side of the Rijksweg at . The mill was demolished in 1862 as it lay on the route of the railway that was being built between Leeuwarden and Groningen. The mill was moved to Hantum, where it was known as De Rosenboom. On 1 March 1949, the cap and sails were blown off the mill. In 1958, the smock was placed on the ground and used as a garage and store. It was demolished in 1970. A millstone from De Rosenboom is preserved in De Hoop, Holwerd.\nDe Visser, De Visker, Molen de Van de Wint, Molen van Timmermans\nA windmill was built on this site in 1662. This mill had a wooden windshaft. It was probably replaced in 1740 by a new mill. De Visser or De Fisker () was a stellingmolen. It was named after its owners, who were the Fiske family in the mid-nineteenth century. It stood in Oldegalileën, along the Dokkummer Ee at . The mill was later owned by De Wint from 1871. The mill was dismantled in 1910, and a  electric motor installed. The smock was left standing. De Wint died in 1933, and the mill was owned by Timmermans in 1947. On 16 January 1964, the mill was burnt down, although at the time there were plans to demolish it as it stood on the route of a bypass that was planned to be built around Leeuwarden.\nDe Vrijheid, De Hoop, Het Haantje\nDe Vrijheid () was a stellingmolen which was standing in 1664. It stood to the north of the Noordvliet at . Originally a sawmill, it was rebuilt as an oil mill in 1798, and was then known as Het Haantje (). The mill was also known as De Hoop (). A  steam engine was installed in 1871. The mill burnt down in 1884.\nEekmolen van het Gild de Groote Looijers\nThis windmill stood on the Noordvliet at approximately . Built before 1664, this bark mill was standing in 1680 but had been demolished by 1718. The mill was owned by Het Gild de Groote Looijers () in 1680.\nHet Fortuin\nHet Fortuin () was a stellingmolen that was moved here in 1873. It stood along the Harlinger Trekvaart between De Kat and De Jong at  and was a corn mill. A  steam engine was installed in 1883. The mill burnt down on 24 March 1886, leaving the base standing. In 1888, a steam-powered factory was erected, but the windmill was not replaced. The base survived until c1900.\nHet Fortuin, Oude Molen\nA windmill was marked on a map of 1685 in the position later occupied by Het Fortuin. It was then known as the Oude Molen (), and possibly was of sixteenth century date. The mill stood close to Emmakade on the Nieuwe Kanaal at. Originally an oil mill, in 1786 the mill was a bark mill. The stellingmolen was standing in 1895.\nHet Lam (1st site, standerdmolen)\nA standerdmolen stood on this site in 1595. It was a corn, rye and buckwheat mill. It stood on the Hoeksterdwinger at . The mill was demolished c1790.\nHet Lam (1st site, stellingmolen)\nHet Lam () was a stellingmolen which was built in 1791 on the site of the standerdmolen demolished c1790 (). Het Lam was a corn and buckwheat mill. The mill was badly damaged in a storm in 1829. It was moved to a new site within Leeuwarden in 1830.\nHet Lam (2nd site)\nHet Lam was rebuilt at a new site in 1830. it stood on the Westerbuitensingel at . A gas engine was installed in 1898, and in 1901 the mill was one of the first in Friesland equipped with Patent sails, which were fitted by millwright J H Westra of Franeker. The mill was a corn and barley mill. It was demolished in 1919, leaving the lower part of the base standing. This was demolished in 1988.\nKleijne Weijdemolen\nThe Kleijne Weijdemolen was a standerdmolen which stood on the Amelandsdwinger at . The mill was a corn mill. It was demolished in 1752.\nKorenmolen aan het Vliet\nThis standerdmolen was built before 1565 on the Noordvliet at . It was a corn mill, which was moved to Vrouwenpoortsdwinger in 1621, where it stood on the site later occupied by De Arend.\nKorenmolen van de Leeuwarder Blokhuis\nA mill of unknown type was built in 1547 to replace a horse mill. The mill was a corn mill, it stood on the Oosterkade at approximately .\nLeermolen aan het Vliet\nAn achtkantmolen was standing in 1685 to the south of Het Vliet. The mill was a bark mill, it stood to the south of Het Vliet at . It was advertised for sale in 1841, described as suitable to be moved. The base was standing in 1887.\nLeermolen van Claas Feddes\nThis mill was probably an achtkantmolen. It was standing in 1685. Located on the Noordvliet at , the mill was a bark mill originally, but was an oil mill in 1786. It was standing in 1832 but had gone by 1850.\nMolen op het Schravernek\nA standerdmolen was standing in 1565 on the Schravernek at . It was moved in 1624 to a site in Leeuwarden later occupied by De Hoop.\nMolen van Baron Rengers\nThis spinnenkopmolen stood on Kalverdijkje at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nMolen van Cornelis Westra (I)\nThis spinnenkopmolen stood on the corner on Insulidestraat and Timorstraat at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nMolen van Cornelis Westra (II)\nThis spinnenkopmolen stood to the north of Esdoornstraat at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nMolen van Dirk Jonker\nThis spinnenkopmolen stood to the north of Schilkampen at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nMolen van Douwe van der Kooi\nThis mill of unknown type stood to the north of Jonkersleane at . It was a drainage mill. The first mention of the mill was in 1832 and it was demolished c1850.\nMolen van Hermanus Wesselius\nThis mill of unknown type stood to the south of Sleutelbloem at . It was a drainage mill. The first mention of the mill was in 1832 and it was demolished c1880.\nMolen van Justinus Rengers\nThis Spinnenkopmolen stood to the south of Canadezenlaan at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1930.\nMolen van Klaas Tigler\nThis mill of unknown type stood to the west of Neptunusweg at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nMolen van Pieter Cats\nThis Spinnenkopmolen stood to the north of Kalverdijkje at . It was a drainage mill. The first mention of the mill was in 1832 and it had been demolished by 1850.\nMolen van Tiete Tromp\nThis Spinnenkopmolen stood to the east of Lekkumerweg at . It was a drainage mill. The first mention of the mill was in 1832 and it had been demolished by 1850.\nMolen van Tjeerd Kastra\nThis mill of unknown type stood to the east of Rietgras at . It was a drainage mill. The first mention of the mill was in 1832 and it may have been still standing in 1850.\nPelmolen van Gerrit Gorter\nThis mill was probably an achtkantmolen. It stood to the east of the Dokkumer Ee at . It was a barley mill. The mill was built between 1685 and 1700. In 1856 it was converted to a corn mill. A steam engine was installed in 1872 and it was demolished c1885.\nPelmolen van Jentje Wijbrandt\nThis mill was a wipstellingmolen. It stood to the west of the Dokkumer Ee at . It was a barley mill. The mill was built between 1685 and 1718. In 1882 it was demolished as a steam-powered mill had been erected.\nPelmolen van Tiede Dijkstra\nThis mill was a wipstellingmolen. It stood to the east of the Dokkumer Ee at . It was a barley mill. The mill was built in 1742. In 1847 it was converted to an oil mill, and then to a corn mill in 1855. It burnt down in 1889.\nPoldermolen Het Wirdumer Nieuwland\nPoldermolen Het Wirdumer Nieuwland was a grondzeiler which was built to the west of the Barrahusterdyk at . The mill was built before 1832. It was still standing in 1929.\nPoldermolen Nr.10\nThis spinnenkopmolen stood on the south side of the Jelsumer Feart at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr.11\nThis grondzeiler stood to the south of the Jelsumervaart at . It was a drainage mill. The first mention of the mill was in 1832 and it was demolished in 1949.\nPoldermolen Nr.12\nThis Spinnenkopmolen stood to the south of Vierhuisterweg at . It was a drainage mill. The first mention of the mill was in 1832 and had been demolished by 1850.\nPoldermolen Nr.12a\nThis mill of unknown type stood to the west of Havanklaan at . It was a drainage mill. The first mention of the mill was in 1854 and had been demolished by 1926.\nPoldermolen Nr. 15\nPoldermolen Nr. 15 was a spinnenkopmolen which was built to the south east of the Gronigerstraatweg at . The mill was built before 1832 and had been demolished by 1928.\nPoldermolen Nr. 16\nPoldermolen Nr. 16  was a spinnenkopmolen which was built to the north of Iepenstraat at . The mill was built before 1832 and was demolished by 1933.\nPoldermolen Nr. 16a\nPoldermolen Nr. 16a  was a spinnenkopmolen which was built to the east of Vogelkersstraat at . The mill was built before 1832 and was still standing in 1928.\nPoldermolen Nr.17\nThis mill of unknown type stood to the south of Koopmansstraat at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr.18\nThis Spinnenkopmolen stood to the west of Cederstraat at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1930.\nPoldermolen Nr. 19\nPoldermolen Nr. 19 was a spinnenkopmolen which was built to the south of Kalverdijkje at . The mill was built before 1832 and was still standing in 1930.\nPoldermolen Nr.19a\nThis mill of unknown type stood to the west of Schieringerweg at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 20\nPoldermolen Nr. 20 was a spinnenkopmolen which was built to the west of Anne Vondelingweg at . The mill was built before 1832. It was badly damaged in a storm on 1 March 1949.\nPoldermolen Nr. 21\nPoldermolen Nr. 21 was a monniksmolen which was built to the north of DE Merodestraat at . The mill was built before 1832. It was demolished in 1894.\nPoldermolen Nr.21a\nThis Spinnenkopmolen stood to the south of Emmakade at . It was a drainage mill. The first mention of the mill was in 1832 and it probably demolished c1894 when the Nieuwe Vaart was constructed.\nPoldermolen Nr.21b\nThis mill of unknown type stood on the east side of Schouwstraat at . It was a drainage mill. The first mention of the mill was in 1832 and it was demolished  prior to 1930.\nPoldermolen Nr. 22, Cammingasterpoldermolen\nPoldermolen Nr. 22 or the Cammingasterpoldermolen was a spinnenkopmolen which was built alongside the Kalverdijkje at . The mill was built before 1832 and burnt down c1948. It latterly worked with on pair of Common sails and one pair of Patent sails.\nPoldermolen Nr.23\nThis mill of unknown type stood to the sest of Neptunusweg at . It was a drainage mill. The first mention of the mill was in 1832 and it had been demolished by 1926.\nPoldermolen Nr.24\nThis mill of unknown type stood to the south of Mercuriusweg at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 25, Molen van de Potmargepolders\nPoldermolen Nr. 25 or the Molen van de Potmargepolders was a spinnenkopmolen which stood on the north side of the Oude Potmarge at . The mill was built before 1832 and was demolished in August 1929.\nPoldermole Nr.26\nThis mill of unknown type stood to the south of Planetenlaan at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1930.\nPoldermolen Nr.27, Boonstra's Polder Molen\nPoldermolen Nr.27 or ''Boonstra's Polder Molen was a grondzeiler which was built before 1832 to the north of Holstmeerweg at . The mill was dismantled in 1937 after an  electric motor had been installed. The remains of the mill were still standing in May 1978, but had been cleared by 1995, when Friese Molens was published.\nPoldermolen Nr. 27a\nPoldermolen Nr. 27 was a spinnenkopmolen which was built to the south of Tijnedijk at . The mill was built before 1832 and it was still standing in 1928.\nPoldermolen Nr.28\nThis mill of unknown type stood to the west of Waterbies at . It was a drainage mill. The first mention of the mill was in 1832. It had been replaced by a windmotor by 1930.\nPoldermolen Nr. 29\nPoldermolen Nr. 29 was a spinnenkopmolen which was built to the east of Neptunusweg at . The mill was built before 1832. It was demolished c1951.\nPoldermolen Nr.30\nThis mill of unknown type stood on Froskepôle at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 30a\nPoldermolen Nr. 30a was a spinnenkopmolen which was built to the south of the Nieuwe Vaart at . The mill was built before 1832. It was demolished c1929.\nPoldermolen Nr.31, Old Feitmanspolder Molen\nThis grondzeiler stood to the north of the Nieuwe Vaart at . It was a drainage mill. The mill was built in 1880 and it was demolished c1975.\nPoldermolen Nr.32\nThis mill of unknown type stood to the north of the Oude Potmarge at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr.33\nThis mill of unknown type stood to the north of Pikemar at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 34, Teernserpoldermolen\nPoldermolen Nr. 34 or the Teernserpoldermolen was a grondzeiler which was built to the west of Nauwe Greuns at . An earlier mill may have stood here between 1832 and 1854. The date that the mill was built is unknown. It was dismantled in 1948 and the smock was demolished in 1975.\nPoldermolen Nr. 35\nPoldermolen Nr. 35 was an achtkantmolen which was built to the north of Jonkersleane at . An earlier mill stood on the site in 1811. The mill was built c1850. It was demolished in 1915.\nPoldermolen Nr.36\nThis mill of unknown type stood to the south of Jonkersleane at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 36\nPoldermolen Nr. 36 was a spinnenkopmolen which was built to the west of the Wirdummervaart, a little to the north of Goutum. The mill was built before 1864. It was demolished in the winter of 1928/29.\nPoldermolen Nr.37\nThis mill of unknown type stood on Ublingerplantage at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr.38\nThis mill of unknown type stood on Pikemar at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr.39\nThis mill of unknown type stood to the south of Glinswei at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 40\nPoldermolen Nr. 40 was a spinnenkopmolen which was built to the west of Hounsdijk at . The mill was built before 1832. It was standing in 1929.\nPoldermolen Nr. 40a\nPoldermolen Nr. 40a was a spinnenkopmolen which was built to the east of Wergeasterdijk at . The mill was built before 1832. It was standing in 1929.\nPoldermolen Nr. 41\nPoldermolen Nr. 41 was a spinnenkopmolen which was built to the south of Himpenserdijk at . The mill was built before 1832. It was demolished in 1972, leaving the base standing. This was demolished in 2000.\nPoldermolen Nr.42\nThis spinnenkopmolen stood on Sloalledyk at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr.42\nThis mill of unknown type stood on the south side of the Nieuwe Vaart at . It was a drainage mill. The first mention of the mill was in 1832 and it was demolished in 1892.\nPoldermolen Nr.43\nThis mill of unknown type stood to the east of Langelaan at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 44\nPoldermolen Nr. 44 was a spinnenkopmolen which was built to the east of the Nauwe Greuns at . The mill was built before 1832. It had been demolished by 1928.\nPoldermolen Nr.44a\nThis mill of unknown type stood on Suderbuorren at . It was a drainage mill. The first mention of the mill was in 1832 and it was still standing in 1850.\nPoldermolen Nr. 45\nPoldermolen Nr. 45 was a spinnenkopmolen which was built to the west of Suderbuorren at . The mill was built before 1832. It was still standing in 1926.\nPoldermolen Nr. 45\nPoldermolen Nr. 45 was a spinnenkopmolen which was built to the west of the Nauwe Greuns at . An earlier mill was marked on a map of 1832. The date this mill was built is not known, but may have been c1850. It had been demolished by 1928.\nPoldermolen Nr. 46\nPoldermolen Nr. 46 was a spinnenkopmolen which was built to the south of the Nauwe Greuns at . The mill was built before 1832. It had been demolished by 1928.\nPoldermolen Nr. 48\nPoldermolen Nr. 48 was a spinnenkopmolen which was built to the north of the Waldwei at . The mill was built before 1832. It was still standing in 1929.\nPoldermolen Nr. 49\nPoldermolen Nr. 49 was a mill of unknown type which was built to the north of the Waldwei at . The mill was built before 1832. It was demolished c1928.\nPoldermolen Nr. 50\nPoldermolen Nr. 50 was a spinnenkopmolen which was built to the north of the Waldwei at . The mill was built after 1850. It was still standing in 1929.\nPoldermolen Nr. 50a\nPoldermolen Nr. 50a was a mill of unknown type which was built to the south of the Waldwei at . The mill was built between 1832 and 1850. It was still standing in 1929.\nPoldermolen Nr. 50b\nPoldermolen Nr. 50b was a spinnenkopmolen which was built to the south of the Waldwei at . The mill was built after 1850. It was still standing in 1930.\nPoldermolen Nr. 51\nPoldermolen Nr. 51 was a spinnenkopmolen which was built to the north of the Waldwei at . The mill was built between 1832 and 1850. It was still standing in 1929.\nZaagmolen van Jildert Romein\nThis saw mill was a stellingmolen which was built to the west of Camstraburen at . The mill was built in 1840 and was burnt down in 1858.\nUnnamed mills\nA standerdmolen was built to the north of Leeuwarden before 1565 and stood until at least 1786. It was a corn mill. Its location was .\nA standerdmolen was built to the north of Leeuwarden before 1565 and stood until at least 1718, but had gone by 1786. The mill was a corn and barley mill. Its location was .\nA mill of unknown type was built between 1565 and 1603 on the Oosterkade at . The mill may have been a corn mill. It had been demolished by 1622.\nA mill of unknown type was built c1603 and removed by 1616. In 1638, an oil mill was noted as standing on this site, which lies behind De Beurs today at . This mill had been moved by 1642 to a new site in Leeuwarden (see De Jong Fenix).\nA spinnenkopmolen was built c1840 on the Bilgaardsdijk at . It drained a  polder. An electric motor was installed in the mid 1930s and the mill was demolished in 1937, the base surviving a few years longer.\nA mill of unknown type was built to the south of the Bonkevaart at  sometime after 1850. It was a drainage mill and had been demolished by 1930.\nA mill of unknown type stood at . It was built before 1850. It was a drainage mill and had been demolished by 1928.\nA mill of unknown type stood at Snekkerburen,  on the east side of the Dokkummer Ee at . The mill was built before 1718. It was a drainage mill and had been demolished by 1832.\nA mill of unknown type stood at Snekkerburen, on the west side of the Dokkummer Ee, . The mill was built before 1718. It was a drainage mill and had been demolished by 1832.\nA standerdmolen'' stood on the Zuidvliet at approximately . It was a corn mill that was standing in 1542. The mill stood in the grounds of the Sint Anthonie Gasthuis. It was advertised for sale for demolition in 1790 but may have stood until 1798 when a mill on the Vliet was sold to miller F B Schaafsma.\nA mill of unknown type was built in 1856. It was a chicory mill. A steam engine was installed in 1869 and the mill was probably demolished shortly after. It was owned by Fabrikaat M A Bokma de Boer.\nA mill of unknown type was built in 1842. It was a chicory mill. A steam engine was installed in 1855 and the mill was demolished shortly afterwards. It was owned by W ter Horst.\nA mill of unknown type stood on the south side of the Vrouwenpoortsdwinger, . The mill was built before 1565 and was demolished between 1664 and 1685.\nReferences\nSources\n* }}"
    }
  ]
}