{
  "content": [
    {
      "type": "text",
      "text": "# Wine warehouses of Bercy\n\nThe wine warehouses of Bercy were a commercial district reserved for wine merchants located in the Bercy neighborhood in the east of the 12th arrondissement of Paris. Located along the Seine, this area received, stored and distributed wines and spirits. During the late 19th and the early 20th century, the Bercy wine district was the largest wine market in the world.\nOrigin\nThe origins of the Bercy wine districts can be traced to a tax advantage as well as to the district’s proximity to the gates of Paris and the Seine river. Louis XIV granted the district a dispensation from duties on its wine entering Paris. This royal decree allowed the wines to not be subject to the ' (a municipal tax collected on various products brought into a district for local consumption or use) and set in motion the commercial development of Bercy and its port.\nBy 1800, the district of wine warehouses was developing rapidly. The district replaced an area that had formerly been occupied by private mansions built by wealthy Parisians on the edge of the Seine in a location that was, at the time, removed from the hustle and bustle of central Paris. These estates were sold by their owners at the end of the 18th century as the growing population of Paris pushed outside the city walls. Thus, the sumptuous mansions on the rue de Bercy and the buildings in the magnificent parks that surrounded them were gradually demolished during the first half of the 19th century.\nIn 1809, Mr. de Chabons, mayor of the town of Bercy, acquired an estate, the ', where he established cellars and a cooperage. This complex was bought in 1815 by Louis Gallois (successor to Mr. de Chabons as mayor of Bercy), who enlarged the cellars and subdivided the land, giving the main road the name of rue Gallois and the other service roads the first names of members of his family. In 1819, Baron Louis, Minister of Finance created warehouses on the land he owned between the Petit Château estate and rue de la Grange aux Merciers (the location of the current Saint-Émilion courtyard). These warehouses were destroyed by fire in 1820, but were rebuilt.\nAt the early stages of Bercy’s development, barrels of wine destined for Parisian consumption arrived by boat on the Seine and then were unloaded at the port of Bercy.\nRail transport\nin the early 1900s|alt=A postcard, with franked stamp, showing a row of railway wagons. Each wagon carries two large wine casks, bearing the name 'GRANDIN' ]]\nin 1933]]\nTransport of wine by rail to Bercy began with the creation of the railway line from Paris to Lyon in 1849 as well as with the establishment of the nearby Gare de Paris Bercy (train station). The wine district was served by a network of 9.48 kilometers of track and 42 hubs. During the first period, wine was transported in barrels from the wine growing regions that were crossed by the Paris-Lyon and, later, the Paris-Menton line; these regions are: Provence, the Rhône valley and Burgundy.\nWine consumption in Paris was increasing, along with the city’s growing population. It went from 1,000,000 hectolitres  in 1800 to 3,550,000 hectolitres in 1865. Despite the construction of a new wine market between 1811 and 1845, Bercy’s storage capacity proved insufficient to cope with the growth of consumption and the development of transport by rail.\nParis annexes most of the town of Bercy and its warehouses\nIn 1860, the commune of Bercy, until then independent, was dissolved, with some of it becoming part of the 12th arrondissement of Paris and the rest being incorporated into the city of Charenton. Normally, under the laws governing taxation of commerce, the Bercy warehouses located inside Paris should have been immediately subject to duties on wines coming from the provinces (since they were no longer eligible for Louis XVI’s dispensation). However, after hearing the protests of the newly Parisian merchants, the public authorities decided to allow a transition period of 10 years. The Franco-Prussian War lengthened this transition period by a further 10 years.\nThe flood of 1876 resulted in the City of Paris buying the entire warehouse district. A commission was created under the direction of Viollet-le-Duc. Its mandate was twofold: 1) to draw up plans for a new road system and infrastructure in and around the Bercy complex (which also involved an element of flood control); and 2) to build the so-called réel warehouses (that would be publicly owned and rented by the wine merchants). This system would replace the previous system (where the wine cellars were owned by the merchants). The réel warehouse district that was built under this plan had embedded in it the tax collection apparatus needed to implement the change in tax status, which became law by the decree of 6 August 1877. The warehouses thereby became public stores for which the owner, the City of Paris, issued concessions to traders.\nThe construction of the new wine district necessitated the demolition of buildings that were very much regretted by Parisians. The structures on the Quai de Bercy, including taverns and restaurants were destroyed as well as buildings of architectural and historical interest, including the Pâté-Pâris and the small castle of Bercy. Two pavilions were built on either side of rue de Dijon (rue Joseph-Kessel), at the entrance to the Tolbiac bridge. The whole, surrounded by 3 meter high gates, was divided into two parts—the 'Petit Bercy' was the upstream section and the 'Grand Bercy' was downstream section (to the west). To help prevent flooding, the Bercy quay was raised to 8.70 meters above the 1658 low water level.\nParts of Viollet-le-Duc’s design were building and delivered in 1878. In the end, though, the ambitious plans of Viollet-le-Duc were never fully realised, due to lack of funding and the resistance of wine merchants (who did not appreciate the plan for 2-story warehouses, which they thought were inconvenient). The City ended up renting existing buildings and vacant plots to the merchants, who were free to build their own facilities. This gave the Bercy district the idiosyncratic appearance that characterised it until the renovation of the late 20th century. Some of the more regular and uniform buildings built by the City of Paris at this time in Grand Bercy have been preserved to this day in the new Bercy Village, including those in the Cour Saint-Émilion and those between the rue Lheureux, rue des Pirogues de Bercy, rue Baron -Le-Roy and Avenue des Terroirs de Bercy, where the Museum of Circus Arts and the bakery and pastry school are located.\nApogee and prosperity\nAt its apogee, the wine district at Bercy was the largest wine market in the world. Advances in transport capabilities helped to promote the success of the Bercy wine warehouses. After the arrival of train service in 1847, the railway provided almost all wine transport between 1875 and 1914. The barrels were replaced by ' (specialised train cars transporting huge casks of wine, spirits or champagne); 20,000 of these specialised train cars were in service in 1910 and 8,850 in 1945. The rails in the modern Bercy complex have been preserved in memory of this transportation network.\nWater transport also developed and permitted international trade in wines. The boats transporting wines from Algeria, Spain and Portugal were unloaded onto barges in Rouen. The barges then proceeded up the river Seine to the port of Bercy.\nThe district had its own distinctive culture stemming from its mix of the working- and merchant-classes, all involved in the commerce of wines and spirits. It was governed by its own internal regulations. This community lived semi-self-sufficiently, with services nearby: schools, the church of Notre-Dame-de-la-Nativité de Bercy, a post office and a specialised newspaper, the '.\nOn 9 August 1905 parliament passed a law which required large wine merchants in Paris to have a storefront at the Bercy warehouse and its wine market. Until the beginning of the 20th century, the two Parisian warehouses (the other being the Saint-Bernard market on the left bank) were of about equal importance. But the specialization of the Saint-Bernard market in fine wines and alcohol and the expansion of Bercy in 1910 gave the advantage to the latter. In 1930, Bercy represented 70% of storage and exits compared to 30% for the Saint-Bernard market.\nDecline\nUntil the 1960s, blended wine products of dubious quality helped to enrich the Bercy wine merchants. However, consumers were becoming more demanding and began to prefer wines bottled on the wine properties in the wine-growing regions, as this was seen as a mark of quality. It was no longer commercially viable to 'improve' a Burgundy by mixing it with a Côtes-du-Rhône or of filling it out with an Algerian wine. Warehouse trading, after more than a century of existence, began to decline.\nFurthermore, the City of Paris began to look with an appraising eye at this site, which was poorly and haphazardly built (the buildings representing only 44% of the surface area) and which was conveniently located near the center of the city. In 1964, the leases were not renewed and improvement or modernization work was prohibited. The largest and most dynamic companies moved to the outskirts of Paris. Eight hectares of the wine district were eliminated in 1979 by the construction of the Bercy sports arena (now the Accor Arena) and the last traders still operating in Bercy were forced to leave. The last cellars were destroyed in 1993.\nReconversion\nwith railroad tracks from the wine depot period  ]]\nThe area containing these warehouses was profoundly restructured, beginning with the construction of the Bercy Arena (1984) and later of the Ministry of the Economy and Finance (1990). By the end of the 20th century, the restructuring and renovation of the district had sounded the death knell for the warehouses. However, their memory lives on in the parc de Bercy which replaced them and which has preserved several old pavilions and railroad tracks that are vestiges of Bercy's wine-making past.\nIn 1985, a few of Bercy’s wine warehouses were added to the Supplementary Inventory of Historic Monuments, including the Lheureux cellars in which ' took over in 1996. Around the year 2000, commercial and business districts were added. The architecture of the old warehouses inspired the design of a shopping center, Bercy Village. To the east of this area a business district was created, organized around the '.  begins at  and ends in a dead end on . It owes its name to Pierre Le Roy de Boiseaumarié (1890-1967), creator of the  (AOC; a labeling system for recognising regional agronomic characteristics and specialised production know-how for agri-food products, including wine). A Baron Le Roy station on line 3a of the Île-de-France tramway has been open since the end of 2012.\nReferences"
    }
  ]
}