{
  "content": [
    {
      "type": "text",
      "text": "# Winston-Salem War Memorial Coliseum\n\n| owner = City of Winston-Salem\n| operator = City of Winston-Salem\n| capacity = 8,200 (Basketball)\n| surface = Multi-Surface\n| opened = September 19th, 1955\n| closed = 1989\n| demolished = 1989\n| yearsactive = 1955 - 1989\n}}\nWinston-Salem War Memorial Coliseum was a multi-purpose arena in Winston-Salem, North Carolina. The arena, which opened in 1955, held 8,200 people and was eventually replaced by the Lawrence Joel Veterans Memorial Coliseum in 1989. It was home to the Wake Forest Demon Deacons men's basketball team from 1956 to 1989, though from 1959 onward the Deacons played many of their games at the Greensboro Coliseum as well.\nCarolina Cougars\nThe Coliseum was home to the Carolina Cougars of the American Basketball Association during some, but not all, of the team's tenure in North Carolina from 1969 through 1974. The Houston Mavericks relocated the franchise to North Carolina in 1969. The Cougars were a \"regional franchise,\" playing \"home\" games in Winston-Salem Memorial Coliseum, Greensboro Coliseum, the original Charlotte Coliseum and Raleigh's Dorton Arena and Reynolds Coliseum. Hall of Fame Coach Larry Brown  began his coaching career with the Cougars in 1972. Billy Cunningham was the ABA MVP for the Cougars in the 1972–73 season. Despite a strong fan base the Cougars were sold and moved to St. Louis in 1974, becoming the Spirits of St. Louis.\nHockey\nThe arena also hosted the Winston-Salem Polar Twins when they played in the Southern Hockey League and the Carolina/Winston-Salem Thunderbirds of the Atlantic Coast Hockey League. In addition, it was the site of the MEAC men's basketball tournament from 1980 to 1982.\nWake Forest Basketball\nWake Forest moved its entire home basketball schedule to the Memorial Coliseum in Winston-Salem for the 1956–57 season, although the team did play two games in the facility one year earlier. The historic building was not popular with Deacon followers in its final years, but no one could argue with the success Wake Forest teams had here. The Demon Deacons won 250 games in Memorial Coliseum and lost only 94 for an impressive 72.7 winning percentage. The Coliseum, which has been leveled and replaced by a parking lot adjacent to LJVM Coliseum, had a capacity of 8,200.\nHere are some notable games at the old Coliseum (Source: [http://wakeforestsports.cstv.com/sports/m-baskbl/spec-rel/05-mediaguide.html Wake Forest Media Guide]):\n*February 12, 1962: Len Chappell scores a then school record 50 points against Virginia.\n*December 11, 1966: North Carolina State and Wake begin what becomes the longest game in ACC history after the lights at the Coliseum are blackened due to a transformer fire with 10:02 remaining in the first half. The two teams resumed the game on February 23 with State taking a 101–75 win.\n*February 15, 1969: Charlie Davis scores a school record 51 points in a game against American.\n*December 17, 1985: Tyrone \"Muggsy\" Bogues ties a school record he set earlier in the month for the most steals in one game, 8, vs. Georgia Southern.\nReferences"
    }
  ]
}