{
  "content": [
    {
      "type": "text",
      "text": "# Wisconsin Institutes for Discovery\n\nThe Wisconsin Institutes for Discovery is a public-private research and outreach partnership that is located in the Discovery Building on the University of Wisconsin–Madison campus. It consists of two institutions: the privately funded Morgridge Institute for Research, and the publicly funded Wisconsin Institute for Discovery. Both institutes opened in 2010. The publicly funded institute is headed by Jo Handelsman, and the privately funded institute is led by chief executive officer Brad Schwartz.\nBoth institutes are housed in the same facility, the ground floor of which serves as a \"town center\", providing several small and large meeting and collaboration areas and variety of dining options. This town center design is based on the philosophies presented in the Wisconsin Idea. Above the town center on the ground floor, the building has three floors of modular, non-traditional research and lab space, designed to promote collaboration amongst researchers. The building is also designed using green techniques, and is expected to use 50% less energy and water than the next most recent research building on the UW–Madison campus.\nBuilding Design Information\n* Size: 330,000 square feet\n* Cost: $213 million\n* Architect, Design Architect, and Laboratory Planner: Ballinger, Philadelphia, PA\n* Associate Architect/Interior Designer: Uihlein Wilson Architects, Milwaukee, WI\n* MEP Engineer: Affiliated Engineers Inc., Madison, WI\n* Landscape Architect: Olin Partnership, Philadelphia, PA\n* Structural and Civil Engineer: Graef, Anhalt, Schloemer & Assoc. Inc., Madison, WI\n* Construction Manager: J.H. Findorff & Sons Inc., Madison, WI, and M.A. Mortensen Co., Brookfield, WI\n* Commissioning Engineer: Facility Dynamics Engineering, Columbia, MD and Champaign-Urbana, IL\n* Stone Fabricator: Quarra Stone Company LLC, Madison WI\nAwards\n* Awarded 2012 Laboratory of the Year by R&D Magazine http://www.rdmag.com/articles/2012/06/laboratory-all\n* Received the 2012 Innovation in Green Building Award http://www.usgbc.org/articles/university-wisconsin-%E2%80%93-madison-receives-2012-innovation-green-building-award\nSee also\n*John Morgridge\n*James Thomson (cell biologist)\n*Patricia Flatley Brennan\nReferences\nExternal links\n*[http://discovery.wisc.edu Wisconsin Institutes for Discovery - Discovery Building Home]"
    }
  ]
}