{
  "content": [
    {
      "type": "text",
      "text": "# Witching Culture\n\nWitching Culture: Folklore and Neo-Paganism in America is a folkloric and anthropological study of the Wiccan and wider Pagan community in the United States. It was written by the American anthropologist and folklorist Sabina Magliocco of California State University, Northridge and first published in 2004 by the University of Pennsylvania Press. It was released as a part of a series of academic books titled 'Contemporary Ethnography', edited by the anthropologists Kirin Narayan of the University of Wisconsin and Paul Stoller of West Chester University.\nMagliocco became interested in studying the American Pagan movement in the mid-1990s, following the culmination of her fieldwork research in a Sicilian village. From 1995 through to 1997, she began studying the Pagan community in the San Francisco Bay Area, joining a Wiccan group, the Coven Trismegiston, which was led by the high priest Don Frew and high priestess Anna Korn. Becoming involved with the faith, Magliocco noted that she no longer remained an objective outsider, but became an active participant after experiencing altered states of consciousness during several Pagan rituals. In 2002 she published her first book on the subject, Neo-pagan Sacred Art and Altars: Making Things Work, which was followed by the more general Witching Culture two years later.\nWitching Culture provides an anthropological study of the Wiccan and wider Pagan community in the U.S., with a particular emphasis on the role that folklore has within the movement; in this it looks both at how Pagans have adopted pre-existing folklore and how unique Pagan folklore actually develops within the community. It deals with the influence of folkloristic on the early development of Wicca, in particular the influence of figures like Sir James Frazer, Charles Leland and Margaret Murray.\nThe reviews published in specialist academic journals were predominantly positive, with James R. Lewis and Jacqueline Simpson being particularly praiseworthy, although some reviewers opined that Magliocco's openly Pagan beliefs had some negative repercussions for the study.\nBackground\nPaganism and Wicca in the United States\nContemporary Paganism, or Neo-Paganism, is a wide variety of modern religious movements influenced by the various pagan beliefs of pre-modern Europe. The religion of Pagan Witchcraft, or Wicca, was developed in England during the first half of the 20th century and is one of several Pagan religions. The figure at the forefront of Wicca's early development was the English occultist Gerald Gardner (1884–1964), the author of Witchcraft Today (1954) and The Meaning of Witchcraft (1959) and the founder of a tradition known as Gardnerian Wicca. Gardnerian Wicca revolved around the veneration of both a Horned God and a Mother Goddess, the celebration of eight seasonally-based festivals in a Wheel of the Year and the practice of magical rituals in groups known as covens. Gardnerianism was subsequently brought to the U.S. in the early 1960s by an English initiate, Raymond Buckland (1934–2017), and his then-wife Rosemary, who together founded a coven in Long Island.\nIn the U.S., new variants of Wicca developed, including Dianic Wicca, a tradition founded in the 1970s that was influenced by second wave feminism, emphasized female-only covens, and rejected the veneration of the Horned God. One initiate of both the Dianic and Gardnerian traditions was a woman known as Starhawk (1951–) who went on to found her own tradition, Reclaiming Wicca, as well as publishing The Spiral Dance: a Rebirth of the Ancient Religion of the Great Goddess (1979), a book that helped spread Wicca throughout the U.S.\nAcademic fieldwork into Paganism\nPrior to Magliocco's work, multiple American researchers working in the field of Pagan studies had separately published investigations of the Pagan community in both the United States and the United Kingdom. The first of these had been the practicing Wiccan, journalist and political activist Margot Adler in her Drawing Down the Moon: Witches, Druids, Goddess-Worshippers, and Other Pagans in America Today, first published by Viking Press in 1979. A second study was produced by the anthropologist Tanya M. Luhrmann in her ''Persuasions of the Witches' Craft: Ritual Magic in Contemporary England'' (1989), in which she focused on both a Wiccan coven and several ceremonial magic orders that were then operating in London. This was followed by the sociologist Loretta Orion's Never Again the Burning Times: Paganism Revisited (1995), which focused on Pagan communities on the American East Coast and Midwest. 1997 then saw the publication of Witchcraft and Paganism in Australia, authored by the anthropologist Lynne Hume.  Next came the work of the American sociologist Helen A. Berger with her A Community of Witches: Contemporary Neo-Paganism and Witchcraft in the United States (1999). Then there was Jone Salomonsen's study of the Reclaiming tradition in San Francisco, Enchanted Feminism: The Reclaiming Witches of San Francisco (2002).\nMagliocco and her research\nMagliocco became interested in Paganism in the mid-1990s, intending to explore \"the confluence of ritual, festival, gender and politics – the subject of my earlier research in Italy – in a new context\". Initially she was interested in Paganism as a \"folk revival, in issues surrounding the use of folklore from academic sources, cultural appropriation, and the construction of authenticity in the invention of rituals\" rather than in any actual spiritual capacity. In February 1995, Magliocco attended the first Pantheacon conference, a meeting of practicing Pagans and academics held at a hotel in San Jose, California. It was at the conference that she took part in a ritual led by members of the Reclaiming Wiccan tradition, later characterizing it as \"my first powerfully affecting ritual experience in a Neo-Pagan context\".\n}}\nMagliocco had initially intended to conduct a long-term period of fieldwork among a single Pagan group, with a focus on understanding their \"dynamics of ritual creation\", but ultimately was unable to do this; from 1994 through to 1997, she held a series of temporary academic appointments at universities across the United States, preventing her from staying in one area for any lengthy period of time and studying any one particular group there. However, from 1995 through to 1997, she was living in Berkeley, California, where she immersed herself in one of \"the country's oldest and most active Neo-Pagan communities\", that of the San Francisco Bay Area. Here, she befriended Holly Tannen, a folklorist and ballad performer who was well known and respected among the Pagan community of northern California. It was through Trennan that she was introduced to many other members of the Pagan community, including to a local Gardnerian Wiccan coven.\nIn 1996, she moved into a \"small rental house\" in the Berkeley Flats along a line of houses that were nicknamed \"Witch Row\" (a fact that she was unaware of at the time), and it was here that she befriended further members of the Pagan community; her neighbors were elders in the Fellowship of the Spiral Path, while another neighboring house was the home of Judy Foster, a founding member of the New Reformed Orthodox Order of the Golden Dawn. Several streets away lived Don Frew and Anna Korn, the high priest and high priestess of a Gardnerian group known as the Coven Trismegiston. Deciding that she wanted to actively participate in the religions she was studying, Magliocco was initiated into the Coven Trismegiston, and went on to begin training in the Reclaiming tradition.\nIn 2002 she published her first academic study of American Paganism, Neo-pagan Sacred Art and Altars: Making Things Work. Witching Culture was published in the \"Contemporary Ethnography\" series of books, edited by the anthropologists Kirin Narayan of the University of Wisconsin and Paul Stoller of West Chester University. Magliocco dedicated the book to the memory of Andrew Vázsonyi (1906–1986), a Hungarian folklorist and novelist who had worked for two decades at the Indiana University Bloomington in the United States.\nSynopsis\n}}\nIn her introduction, \"The Ethnography of Magic and the Magic of Ethnography\", Magliocco discusses how she first became involved with the Pagan movement, and includes extracts from the field notes that she made at the time. Going on to lay out the objectives of the book, Magliocco discusses the history of Wicca, and the influence that early anthropologists like Edward Taylor and James Frazer had on it as a burgeoning movement. Proceeding to discuss the pre-existing academic studies of the Pagan movement, she explains her own approach to the subject and how it differs from those of her predecessors, in particular focusing on her own spiritual experiences and altered states of consciousness that she experienced while taking part in Pagan ritual and her insider-outsider perspective on the Pagan movement.\nPart I: Roots and Branches\nChapter one, \"The Study of Folklore and the Reclamation of Paganism\", offers a historical introduction to Contemporary Paganism, looking at its roots in the Classical World of Greece and Rome, and then the successive influences of Neoplatonism, Renaissance magic, the Protestant Reformation and the Enlightenment. Magliocco then looks at the influence that 18th and 19th century folkloristics and anthropology had on the Romanticists and then Pagan movement, in particular the work of Jean-Jacques Rousseau, the Brothers Grimm and Sir James Frazer. Proceeding to look at this relationship, she highlights the work of Charles Leland, Margaret Murray and Gerald Gardner, who drew from folklore in their own books, all of which heavily influenced modern Paganism. Magliocco argues that Contemporary Paganism can be viewed as a \"folk tradition\" on two levels; firstly, because it continues to work with and propagate the spiritual traditions of western esotericism, and secondly, because it acts as a form of \"resistance culture\" in opposition to dominant trends in western culture. Finally, she borrows the concept of \"textual poachers\" from the French sociologist Michel de Certeau, arguing that the Pagan community fit this model well, collating elements from a wide variety of sources and composing them into something new, in this case a religious movement.\nChapter two, \"Boundaries and Borders: Imagining Community\", opens with a discussion of how Pagans distinguish themselves from one another and from the wider society around them, before delving into the idea that folklore is vital to Pagan \"group formation\". Magliocco goes on to describe the Pagan community, with a particular emphasis on those in the United States, dealing with such subjects as ethnicity, education, gender and sexual orientation. Moving on to look at how Pagans forge their own identities, she highlights factors such as costume and use of language, and whether such Pagan coding is explicit, complicit or implicit. Magliocco discusses the various different Pagan traditions, and the community division between those who call themselves \"witches\" and those who do not. She then rounds off the chapter with a discussion of the anthropological fieldwork that she undertook among the San Francisco Bay Area Pagan community between 1995 and 2000, the Coven Trismegiston that she worked with, and the local Gardnerian, Reclaiming and NROOGD traditions that she encountered there.\nPart II: Religions of Experience\nThe third chapter, \"Making Magic: Training the Imagination\", begins with Magliocco's assertion that the unifying feature of the Pagan movement is the ritual experiences that its practitioners undertake. Devoting the rest of the chapter to an examination of how Pagans \"conceive of and practice magic\", she argues that they do not do so in order to escape rationality, but rather they adopt a belief in magic in order to reclaim \"traditional ways of knowing that privilege the imagination\". Noting that within Paganism, artists are viewed as magicians, she suggests that magic should itself viewed as an art, with both having the goal of bringing about emotional reactions and changes of consciousness. Exploring the various different definitions of \"magic\" developed within anthropology, Magliocco notes that most contemporary North Americans equate \"magic\" with superstition and irrational behavior. She then looks at Pagan understandings of magic, highlighting that Pagans typically try to rationalize magic, viewing it as an energy force in an interconnected universe, one that must obey natural laws, rather than as some un-explainable \"supernatural\" force. Moving on, Magliocco discusses the Pagan concept of a sacred universe, looking at the veneration of the natural world and the celebration of seasonal Sabbats, and the relevance that that has for Pagan magical beliefs. Exploring Pagan ethics surrounding the practice of magic, in particular the Wiccan Rede and the Law of Threefold Return, Magliocco also studies the manner in which Pagans have re-adopted vernacular magic as a part of their religious practices.\nArguments\nInsider/outsider dichotomy\n}}\nIn undertaking her fieldwork, Magliocco discussed whether she took an \"outsider\" perspective, thereby being objective about those whom she was researching, or whether she had adopted an \"insider\" perspective, thereby being subjective in her views of Pagans and Paganism. She claimed that the question as to whether she was an insider or outsider researcher was akin to a question that she had been posed as a child; being an Italian American, Magliocco had often been asked whether she was Italian or American, to which she would respond that she was both. As she noted:\n:My answer to readers who want to know whether I am \"really\" an insider or an outsider to the Pagan community is that I am neither and both – that how I look at things depends very much upon context, but contains both anthropological and Pagan perspectives at the same time. The ethnographic perspective is not about being an objective observer of a culture, but rather about containing within one body multiple, simultaneous frames of reference with which to interpret experience, and being able to shift easily from one to the other.\nIn this position, Magliocco was in agreement with Jone Salomonsen, the feminist theologian and ethnographer who had performed fieldwork among the Reclaiming Witches of San Francisco in order to gain research for her book Enchanted Feminism (2002). Salomonsen had called this mixed insider/outsider approach the \"method of compassion\" and wrote that it \"does not refer to a wholesale positive embracement, nor to passionate criticisms and arguing, but to something in between... Engagement is more than participation, and something other than pretending. To allow oneself to become engaged is to take the ritual seriously. It is [being] willing to let the trance induction take you into trance, to be willing to be emotionally moved as is intended by certain ritual elements, and [to] go with what happens.\"\nAltered states of consciousness\nMagliocco also saw herself as an insider because she allowed herself to experience the altered states of consciousness that contemporary Pagan rituals are reported to induce. As she stated, \"I take an experiential approach to the extraordinary experiences\" that occur in ritual, and that the \"essence of this approach is twofold\". The first part of this involved the \"conscious, willing, and full participation in ritual experiences intended to induce alternate states of consciousness, and the interpretation of visions and dreams\" as different ways of interpreting life. The second part of this \"mandates that I consider informants' experiences seriously\" when they discuss altered states of consciousness.\nMagliocco highlighted the work of the anthropologists David Young and Jean-Guy Goulet in their Being Changed: The Anthropology of Extraordinary Experience (1994), who had argued that spiritual experiences were relatively common among anthropologists, but that most of those working in the discipline fail to speak publicly about their experiences because of a fear of \"ridicule and ostracism\" by their peers. She went on to highlight the work of other anthropologists who have discussed their own spiritual experiences that occurred while taking part in rituals in the midst of their fieldwork, such as Bruce Grindal's experience among the Sisala in Ghana, Raymond Lee's experience with Malay spirit possession rites, and Edith Turner's experience in a Ndembu healing ritual.\nReception and recognition\nAcademic reviews\n}}\nReviewing Witching Culture in The Pomegranate: The International Journal of Pagan Studies, the American religious studies scholar James R. Lewis described the work as \"the best survey to date\" of modern Paganism, \"particularly if the focus of one's interest is North American Paganism\". In his opinion, Witching Culture \"breaks important new ground in Pagan Studies. In fact, I anticipate that in the near future it will come to be regarded as a groundbreaking book—one to which all future studies of Paganism will refer.\" He went on to describe it as \"my first choice for a textbook in any university class with a significant component on contemporary Paganism\" and felt that \"Almost every chapter contains either new insights or original analyses that extend prior discussions to a new depth.\" Lewis noted that although he didn't have \"any real criticism\" of the book, he wished that it had discussed the role of solitary practitioners and teenage Wiccans, two significant sectors of the Pagan community whom Magliocco only mentioned in passing, and the infighting among the Wiccan community, which Magliocco hadn't even mentioned. Ultimately, Lewis remarked that \"I can heartily recommend this book as a 'must read' for anyone in this field, whether academic observers or reflective participants.\"\nIn her review for the Folklore journal, the English folklorist Jacqueline Simpson described Witching Culture as offering a \"fascinating analysis\" of how U.S. Pagans have \"adopted and adapted elements of European folk practice to fit the Gardnerian framework of their rituals and spells\". Ultimately, she characterised the work as being \"a very informative and well-researched study, and a most interesting read\". Roman I. Shiyan of the University of Alberta reviewed Witching Culture in the journal Ethnologies, stating that the work was \"lucid evidence of the growing popularity of neo-pagan topics in North America and the academic world in particular\" and that Magliocco \"raises several important theoretical issues\" regarding the topic. In conclusion, he felt that the book \"takes us deep into a largely obscure and often misunderstood culture, which offers a very different perspective of the world and the place of humans in it\".\nIn the Journal of American Folklore, the sociologist Gary Alan Fine published a review of Magliocco's work in which he described it as \"a richly textured ethnography, as fine a participant-observation account of an American scene as folklore has been gifted with since Leslie Prosterman's Ordinary Life, Festival Days\". Believing that Magliocco's analysis had revealed Paganism to be the most \"politically progressive and postmodern\" religion in existence \"despite [its] considerable borrowings of traditional themes\", Fine felt that Witching Culture was \"an effective and affectionate guide in mapping the development of Neo-Paganism in America and the multiple – and occasionally conflicting – strains from which it draws\". He did however note that in his opinion the author had failed to \"stand sufficiently back from the movement to gain the analytic purchase that comes from skepticism. Granted, all religions appear gawky in their adolescence, but sometimes disciplinary agnosticism permits us to discount desired but undeserved self-presentations. While no researcher should scorn the belief system of a group that she encounters, neither is it necessary to nuzzle. This attachment may cause Magliocco to downplay sexuality, drug use, and posturing in the community. These seekers often appear in her telling to be, frankly, rather puritanical.\" He went on to remark that a \"more distanced view would emphasize the struggles over political correctness that challenge the movement as it staggers toward a consensual theology\", in particular its controversial cultural borrowings from Native American cultures. Ultimately however, he felt that as an \"account of the folkloric practices of a burgeoning social scene\", Witching Culture warrants \"high praise\".\nIn her review, published in the History of Religions journal, Stefanie von Schnurbein of the Nordeuropa-Institut, Humboldt-Universität, Berlin, wrote that Magliocco dealt with \"a sadly understudied issue\" in her study, but that \"To the disappointment of a reader who expects a theoretically advanced discussion of these relations [between religious culture and academic thinking], the historical argument and material do not go far beyond Ronald Hutton's in-depth study of the history of modern pagan witchcraft, The Triumph of the Moon.\" Continuing with her review, Von Schnurbein opines that Magliocco manages to create a \"vivid impression of, and informed insights into, the different facets and contradictions of a contemporary religious movement\", one that \"allows for well-informed critiques of the problem of rooting spirituality in ethnic or cultural heritage and of the problem of cultural exploitation through borrowing\". Nonetheless, she notes that because Magliocco herself is a practicing Pagan, it \"limits to a certain degree the author's ability to scrutinize further some of the problems intrinsic to the reception and resignification of ideologically questionable concepts and theories\". She also notes that in Magliocco's work, \"art, creativity, and imagination are depicted as exclusively positive forces that are rooted in experience and are responsible for the potential of resistance to be found in neopagan ritual and religion\". In Von Schnurbein's opinion, \"The next step of critical investigation would be to analyze this concept of art as a construction as well.\"\nResponse from the Pagan community\nWriting on The Cauldron website, a practicing Pagan using the pseudonym of \"Pitch\" described the work as \"thoughtful, insightful, fruitful, grounded, and, maybe, provocative\" as well as being a \"Must Have, Double Bag!\" book that \"all of us should be proud to add to our libraries\".\nReferences\nFootnotes\nBibliography\nAcademic books and papers\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*  Republished in\n*\nAcademic book reviews\n*\n*\n*\n*\n*\n*\nWeb sources\n*\n*  |archive-date=24 March 2012 |archive-url=https://web.archive.org/web/20120324220925/http://www.upenn.edu/pennpress/series/CE.html |url-status=live }}"
    }
  ]
}