{
  "content": [
    {
      "type": "text",
      "text": "# Without Warning: The James Brady Story\n\n| writer               =\n| screenplay           = Robert Bolt\n| story                =\n| director             = Michael Toshiyuki Uno\n| starring             = Beau Bridges\n| narrated             =\n| theme_music_composer = Georges Delerue\n| country              = United States\n| language             = English\n| num_episodes         =\n| executive_producer   = David Puttnam\n| producer             = Fred Burner\n| location             = Texas Medical Center\n| editor               = Peter C. Frank\n| cinematography       = Bobby Bukowski\n| runtime              = 88 minutes\n| company              = Enigma ProductionsHBO Pictures\n| budget               =\n| network              = HBO\n| released             =\n}}\nWithout Warning: The James Brady Story is a 1991 American television film directed by Michael Toshiyuki Uno and starring Beau Bridges as James Brady, the White House Press Secretary who was shot during the attempted assassination of President Ronald Reagan in 1981.  The film is based on Mollie Dickenson's 1987 biography about Brady titled Thumbs Up.\nPlot\nIn 1980, Ronald Reagan is elected president. However, he is in need of a press secretary, and two men are the choice for the job: James (Jim) Brady and Lyn Nofziger. Later, Brady finds out he has the job. Jim is in office for 69 days. On March 30, 1981, Reagan visits the Washington Hilton Hotel for an AFL-CIO speech. At first, Jim is unsure if he would be attending due to low press, but after finding out the president will not be answering his own questions, he decides to attend the event. The president leaves the hotel after the speech, along with his guards and staff, including Brady. Waiting outside the hotel by the press is John Hinckley Jr. While Jim is walking towards the press, Hinckley pulls a Röhm RG-14 .22 caliber revolver, and begins firing at the president. Jim is struck by the first bullet, passing through\nunderneath his brain and shattering his brain cavity, exploding on impact. Three others are also wounded, one including President Reagan.\nAt home, Jim's wife, Sarah, finds out of the shooting by television, with a report saying James Brady had died. When arriving at the hospital, she finds her husband is still alive but in serious condition. After surgery, Jim begins a long recovery, which includes many more surgeries, seizures, regaining speech, rehabilitation and more. As many people sign petitions to have Jim sent home after many months, Dr. Art Kobrine is unsure he is ready to leave the hospital due to his actions. Finally, in May 1982, Jim is sent home. Requiring the use of a wheelchair, he and Sarah both face difficulties in their new life. One day, Brady goes out and buys a kite, having Sarah take him to a friends cottage on the beach along with their son, Scott. After many failed attempts to get the kite going, Jim gives up in a rage, causing him and Sarah to have a fight. Later that night, Jim and Sarah apologize to each other, with Jim telling her he will need her for the rest of his life. The movie ends with Jim and Sarah in Congress, explaining why the Brady Handgun Violence Prevention Act will save many lives and keep handguns out of the wrong hands.\nCast\n*Beau Bridges as James Brady\n*Joan Allen as Sarah Brady\n*David Strathairn as Dr. Art Kobrine\n*Bryan Clark as President Ronald Reagan\n*Steven Flynn as John Hinckley Jr.\n*Gary Grubbs as Larry Speakes\n*Susan Brown as Nancy Reagan\n*Christine Healy as Ruth\n*Tyrees Allen as FBI Agent\n*Gerry Becker as Detective\nAccolades\nBridges won the Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie.  He also won the Golden Globe Award for Best Actor – Miniseries or Television Film.\nThe film was nominated for the Primetime Emmy Award for Outstanding Television Movie.  Robert Bolt was nominated for the Primetime Emmy Award for Outstanding Writing for a Limited Series, Movie, or Dramatic Special.\nReferences\nExternal links\n*\n*"
    }
  ]
}