{
  "content": [
    {
      "type": "text",
      "text": "# Wokingham Town F.C.\n\n| season =\n| position =\n| website =\n| pattern_la1=_black_hoops|pattern_b1=|pattern_ra1=_black_hoops|leftarm1=FF6600|body1=FF6600|rightarm1=FF6600|shorts1=000000|socks1=000000\n}}\nWokingham Town Football Club is a football club based in Wokingham, Berkshire, England. Nicknamed \"the Satsumas\" in reference to their orange shirts, they are currently members of the  and play at Lowther Road.\nHistory\nWokingham Town\nThe club are reported to have been founded in 1875, although there are reports of meetings of the club in October 1874. They joined the Ascot & District League, and after absorbing Wokingham Athletic in 1910–11, the 1912–13 season saw the club win the Ascot & District League and the Camberley Hospital Cup. A dispute with the league led to the club leaving in 1921 and joining the Reading Temperance League.\nIn 1951 Wokingham joined Division One of the Great Western Combination. After winning the Division One title in 1953–54, the club joined the Metropolitan League. They transferred to the Delphian League in 1957 and then the Corinthian League in 1959. When the Corinthian League folded in 1963 the club joined Division One of the Athenian League. The 1968–69 season saw them win the Berks & Bucks Senior Cup, beating Slough Town 1–0 in the final. In 1973 they transferred to Division Two of the Isthmian League. Division Two was renamed Division One in 1977 and Wokingham were champions of the division in 1981–82, earning promotion to the Premier Division. The following season saw them reach the first round of the FA Cup for the first time. After holding Cardiff City to a 1–1 draw, they lost the replay 3–0. They ended the season by winning the Berks & Bucks Senior Cup for a second time, defeating Bracknell Town 2–0 in the final. They won the Senior Cup again in 1984–85 with a 1–0 win over Chesham United.\nWokingham remained in the Premier Division until finishing bottom of the table in 1994–95, resulting in relegation to Division One. Although they won the Berks & Bucks Senior Cup again in 1995–96, defeating Aylesbury United 1–0 in the final, they finished third-from-bottom of Division One in 1997–98 and were relegated to Division Two. After selling their Finchampstead Road ground in 1999 the club merged with Emmbrook Sports of the Reading Senior League to form Wokingham & Emmbrook in 2004, playing at Emmbrook Sports' Lowther Road ground.\nWokingham & Emmbrook\nThe new club dropped into Division One East of the Hellenic League due to Lowther Road not meeting ground grading requirements for higher levels. In 2008–09 they won the Reading Senior Cup, beating Woodley Town 3–0 in the final. They were runners-up in Division One East in 2009–10, earning promotion to the Premier Division, although this required groundsharing with Bracknell Town. In 2011–12 they won the Reading Senior Cup again, beating Highmoor Ibis 3–1 in the final. Although they retained the cup the following season, defeating Marlow United 2–1 in the final, the ground grading issues resulted in the club being demoted back to Division One East at the end of the season.\nWokingham & Emmbrook were Division One East runners-up in 2013–14 and won the Reading Senior Cup for a third successive season, beating Finchampstead 5–0 in the final. The club went on to win the cup for a fourth time in a row in 2014–15, defeating Binfield 2–1 in the final. The season also saw them win the Division One East title, securing promotion to the Premier Division. However, they finished bottom of the Premier Division the following season and were relegated back to Division One East. After the 2019–20 and 2020–21 seasons were abandoned due to the COVID-19 pandemic, the club were promoted to the Premier Division North of the Combined Counties League based on their results in the abandoned seasons.\nWokingham Town\nIn 2024 the club was renamed Wokingham Town.\nGround\nThe club initially played at Oxford Road, before moving to the cricket ground on Wellington Road. They relocated to Langborough Road in 1896 and then to Finchampstead Road in 1906. The club purchased Finchampstead Road in 1926 and built a new grandstand at a cost of £630. The new stand was officially opened during a friendly match against Chelsea. Floodlights were installed in 1966.\nHowever, Finchampstead Road was sold to cover over £500,000 of debt accumulated attempting to upgrade it to Football Conference standards, and the club left the ground in 1999, initially groundsharing with Windsor & Eton, before moving to the grounds of Flackwell Heath and Egham Town. In 2004 they returned to Wokingham, playing at Emmbrook Sports's Lowther Road ground, which was shared with a cricket team.\nIn 2010 the club started groundsharing with Bracknell Town in order to take promotion to the Premier Division of the Hellenic League, later also sharing with Henley Town. After planning permission was granted for a 100-seater stand and floodlights at Lowther Road in 2016, the club were able to return to the ground.\nHonours\n*Isthmian League\n**Division One champions 1981–82\n*Great Western Combination\n**Division One champions 1953–54\n*Hellenic League\n**Division One East champions 2014–15\n*Ascot & District League\n**Champions 1912–13\n*Berks & Bucks Senior Cup\n**Winners 1968–69, 1982–83, 1984–85, 1995–96\n*Reading Senior Cup\n**Winners 2008–09, 2011–12, 2012–13, 2013–14, 2014–15\n*Camberley Hospital Cup\n**Winners 1912–13\nRecords\n*Best FA Cup performance: First round, 1982–83\n*Best FA Trophy performance: Semi-finals, 1987–88\n*Best FA Vase performance: Second round, 1998–99, 2000–01, 2003–04\nSee also\n*\nReferences\nExternal links\n*[https://www.wokinghamtownfc.club Official website]"
    }
  ]
}