{
  "content": [
    {
      "type": "text",
      "text": "# Wolf Howard\n\n| birth_place   = Strood, Kent, England\n| death_date    =\n| death_place   =\n| nationality   = British\n| known_for     = Drums, painting, photography\n| training      = No formal art training\n| movement      = Stuckism (1999–2006)\n| notable_works =\n| patrons       =\n| awards        =\n}}\nWolf Howard (born 7 April 1968) is an English artist, poet and filmmaker living in Rochester, Kent and was a founder member of the Stuckists art group. He is also a drummer who has played in garage and punk bands, currently as a member of The Musicians of the British Empire (MBE's) with Billy Childish.\nLife\nSimon 'Wolf' Howard was born in Strood, Kent and attended Mid-Kent College for O-levels, where he \"doesn't think he got any but always tells people he got two\". In 1986 he began drumming, having taught himself, and has continued to do so ever since. From 1987 for 15 years he was on the dole, except for a total of two periods of two months, one day and half-an-hour, when he was respectively sweeping an ironmonger's warehouse floor, sweeping a neon light warehouse floor, picking apples and working in a frozen shepherds-pie factory. He decided against going to art college on the basis that it would \"worsen himself\". He lives in Chatham, where he works as a volunteer in an Oxfam shop.\nMusic\nWolf Howard. Wolf Howard on Drums\nWolf Howard has played drums in many bands. The most important are (in chronological order) The Daggermen, The James Taylor Quartet, The Prime Movers, The Solarflares, Dodsons Dogs and The Buff Medways. His drumming is \"louder than a self-propelled Howitzer.\"\nArt\nHoward was one of the 13 original founder members of the Stuckists, a pro-figurative painting, anti-conceptual art group, co-founded by Childish and Charles Thomson in 1999. Howard exhibited in group shows, including The Stuckists Punk Victorian (2004) at the Walker Art Gallery for the Liverpool Biennial and Go West at Spectrum London (2006). He left the group in 2006 to pursue a solo career.\nHe paints bold figurative images in a simple, vigorous, impasto style. This has incurred criticism for its apparent naivety. Howard has stated that his finished result only comes about after hard work, which can involve scraping the paint back to the canvas up to ten times.\nWolf Howard. Mrs Chippy\nHe has explained a particular painting, Mrs Chippy:\nIn Aesthetica magazine, Abby Jackson contrasted the different\nresponses of Howard and Luc Tuymans to the subject of 9/11: \"Tuymans chooses to avoid his subject matter, whereas Howard, as a Stuckist, approaches his subject head on.\"\nPinhole photography\nPinhole photograph of Billy Childish by Wolf Howard\nThe Pinhole Photography of a Gifted Gentleman Amateur, show by Wolf Howard, Stuckism International Gallery, 2003.\nWolf Howard is a member of the Stuckism Photography group and takes pinhole photographs. He uses a light-proof wooden box 4\" square with a fixed-size pinhole in the front. Photographic paper is placed at the back of the box. There is no lens and no viewfinder, so he estimates the aim of the camera. A wooden slider allows light into the box for an exposure which is between 40 seconds and 5 minutes. The camera is placed inside a light-proof bag to replace the photographic paper.\nHe develops a negative print (in his bathroom) and makes the final positive print by placing another sheet of photographic paper under the negative with a 5-second exposure under a light bulb. The whole process requires estimation throughout and he \"faces many disappointments in his darkroom. The hard work will eventually pay off.\"\nHe describes his motivation:\n:There is something special about a pinhole camera. There is a beauty in its simplicity and rawness that technology has not been able to better. There is a timeless quality that can make the most uncomplicated subject seem full of poetry.\n:In each pinhole picture I take I hope to capture the joy and excitement that the early pioneering photographers (Fox Talbot and friends) must have felt when they took and developed photographs for the very first time.\nAn exhibition of his work, The Pinhole Photographs of a Gifted Gentleman Amateur, was held at the Stuckism International Gallery in 2003 as part of Alternative Arts Photomonth. He was one of the four Stuckist Photographers showing work at the Lady Lever Art Gallery during the 2004 Liverpool Biennial. Jesse Richards wrote in a review of the show, \"Wolf Howard's pinhole photographs of a pocket watch, a trench cap, and his friend Billy Childish are beautiful haunting images that seem to be from a world long gone by. I've really never seen anything like it.\"\nGallery\nImage:Wolf Howard. Wolf in Tunisia.jpg|Wolf in Tunisia\nImage:Wolf Howard. Venice Mask.jpg|Venice Mask\nImage:Wolf Howard. Russian Girl.jpg|Russian Girl\nImage:Wolf Howard. Hunger.jpg|Hunger\nImage:Wolf Howard. Dog and Cat Underwater.jpg|Dog and Cat Underwater\nImage:Wolf Howard. Firing Squad.jpg|Firing Squad\nImage:Wolf Howard. Two Dogs Fighting.jpg|Two Dogs Fighting\nImage:Wolf Howard. Swan and Fox.jpg|Swan and Fox\nImage:Wolf Howard. El Toro.jpg|El Toro\nImage:Wolf Howard. Being on the Dole.jpg|Being on the Dole is like Playing Chess with Hitler\nImage:Wolf Howard. Superpowerless.jpg|Superpowerless\nImage:Wolf Howard. Tree in Snow.jpg|Tree in Snow (pinhole photograph)\nSee also\n*Stuckism\n*The Stuckists Punk Victorian\n*Stuckism Photography\n*Pinhole Photography\nFootnotes\nReferences\n*Evans, Katherine, ed. (2000), The Stuckists, Victoria Press,\n*[https://www.telegraph.co.uk/core/Slideshow/slideshowContentFrameFragXL.jhtml;jsessionidGH1MQNIPSPELJQFIQMGSFF4AVCBQWIV0?xml=/arts/slideshows/gowest/pixgowest.xml&site= \"Go West\"], Daily Telegraph. Retrieved 27 August 2007.\n*Lees, Alasdair (2005). [https://web.archive.org/web/20070930165136/http://arts.independent.co.uk/music/reviews/article17830.ece \"The Buff Medways, Pleasure Unit, London\"], The Independent, 5 January 2005. Retrieved 27 August 2007.\n*Milner, Frank, ed. (2004), The Stuckists Punk Victorian, National Museums Liverpool, . Abbreviated information on Howard from the book is on the Walker Art Gallery web site for [http://www.liverpoolmuseums.org.uk/walker/exhibitions/stuckists/wolfhoward.asp painting] and [http://www.liverpoolmuseums.org.uk/walker/exhibitions/stuckists/photography/wolfhoward.asp photography]. Retrieved 27 August 2007.\n*[http://www.stuckism.com/HowardPinhole/index.html \"Wolf Howard: Pinhole photographs\"], stuckism.com. Retrieved 21 April 2006\nExternal links\n*[http://wolfhoward.com/index.html Wolf Howard's Official Site]\n*[http://www.stuckism.com/howard/index.html Wolf Howard's paintings and a poem]\n*[http://www.stuckism.com/HowardPinhole/index.html Wolf Howard's pinhole photography]"
    }
  ]
}