{
  "content": [
    {
      "type": "text",
      "text": "# Woman in the Nineteenth Century\n\nWoman in the Nineteenth Century is a book by American journalist, editor, and women's rights advocate Margaret Fuller. Originally published in July 1843 in The Dial magazine as \"The Great Lawsuit. Man versus Men. Woman versus Women\", it was later expanded and republished in book form in 1845.\nSummary\nThe basis for Fuller's essay is the idea that man will rightfully inherit the earth when he becomes an elevated being, understanding of divine love.  There have been periods in time when the world was more awake to this love, but people are sleeping now; however, everyone has the power to become enlightened.  Man cannot now find perfection because he is still burdened with selfish desires, but Fuller is optimistic and says that we are on the verge of a new awakening.  She claims that in the past man, like Orpheus for Eurydice, has always called out for woman, but soon will come the time when women will call for men, when they will be equals and share divine love.\nAccording to Fuller, America has been hindered from reaching equality because it inherited depravity from Europe, hence its treatment of Native and African Americans.  Fuller quotes the ancient Medes on how all people are equal and bound to each other; those who infringe on others' rights are condemned, but the biggest sin is hypocrisy.  Man needs to practice divine love as well as feel it.  Among those who practice it are the abolitionists because they act on their love of humanity; many women are part of this group.\nFuller then begins to examine men and women in America.  She observes that many people think that in marriage, man is the head of the house and woman the heart.  Problems with the law derive from the problem of women being viewed as inferiors, equal to children but not men.  The truth is that women need expansion and seek to be like men; they need to be taught self-dependence.  The idea that equality between men and women would bring divinity to new heights because it would help fulfill the lives of both men and women is reinforced by looking at historical evidence where men and women were equally divine, including Christianity with its male and female saints.  Women, Fuller says, need not poetry or power to be happy, which they now have access to, but rather intellectual and religious freedom equal to men's.\nThe transition of marriage in earlier times as that of convenience into a union of equal souls is discussed in relation to four types of marriage, which Fuller ranks in ascending order.  The first type, the household partnership, is merely convenience and mutual dependence.  The man provides for the house, the woman tends to it.  The second type is mutual idolatry where the man and woman find in the other all perfection to the exclusion of the rest of the world.  The intellectual companionship is the next highest form of marriage.  In this, man and woman are friends, confidants in thought and feeling with a mutual trust, but rarely love.  Above all of these forms is the highest marriage, the religious union.  It envelopes the other three to include mutual dependence, idolatry, and respect.  The man and woman find themselves as equals on a \"pilgrimage towards a common shrine.\"  Fuller also makes brief mention of the life of \"old maids\", often looked down upon because they are not married, but she says that they have the opportunity for close communion with the divine which married people do not have to that extent.\nFuller then looks at the differences between men and women in order to enforce that women need their intellectual and spiritual resources strengthened.  She says that the souls of men and women are the same, even with differences in masculinity and femininity.  The differences are not between men and women, though, for both have masculine and feminine energies, but are between individuals:  \"There is no wholly masculine man, no purely feminine woman.\"\nThe conclusion of the essay is that before a true union can occur, each person must be an individual and self-dependent unit.  For women to become such individuals, men need to remove their dominating influence, but women also need to claim themselves as self-dependent and remove themselves from man's influence.  Fuller ends looking forward and making a call for the woman who will teach women to be individuals.\nComposition and publication history\n.]]\nFuller began writing her essay as she went on a trip to Chicago in 1843, perhaps inspired by a similar essay by Sophia Ripley. \"The Great Lawsuit: Man versus Men, Woman versus Women\" was originally published in serial form for The Dial, the transcendental journal for which Fuller served as editor. Publisher Horace Greeley was impressed and encouraged Fuller to rewrite it as a full-length book. After completing the expanded version, renamed Woman in the Nineteenth Century, she wrote to a friend: \"I had put a good deal of my true self in it, as if, I suppose I went away now, the measure of my footprint would be left on earth.\" About one-third of the book-length version was new. Greeley assisted in its publication and released it as part of his \"Cheerful Books for the People\" series in February 1845, selling for 50 cents a copy.\nAnalysis\nThere are many transcendentalist ideas expressed in the essay based on Fuller's strong dedication to transcendentalism.  One of the main ideas is the cultivation of the individual, which to Fuller included women as well as men.   The essay applies the idea of the individual to the enlightenment of all mankind:  allowing women as individuals to have greater spiritual and intellectual freedom will advance the enlightenment of both men and women and, therefore, all of mankind.\n\"The Great Lawsuit\" also makes reference to the abolitionist movement.  Women's lack of freedom is paralleled to that of the slaves, one that was actively fought against by many people in the North, men as well as women.  In doing this, Fuller is calling upon men's compassion for the slave to be applied to women as well, and for women to expand their energy fighting for slaves' freedom to their own.\nThe essay includes many allusions to other works in literature, history, politics, religion, and philosophy  in order to demonstrate to the reader that she was qualified to write the work in an age when women were not allowed a college education.  The work reflects her life, for she was very active in politics when women were still expected to devote themselves entirely to their family. Fuller identified with the Polish-Lithuanian heroine Emilia Plater, a woman who raised a regiment during the November Uprising against the Russian Empire.\nCriticism and legacy\nAn 1860 essay collection, Historical Pictures Retouched, by Caroline Healey Dall, called Fuller's Woman in the Nineteenth Century \"doubtless the most brilliant, complete, and scholarly statement ever made on the subject\". The typically harsh literary critic Edgar Allan Poe wrote of the work as \"a book which few women in the country could have written, and no woman in the country would have published, with the exception of Miss Fuller\", noting its \"independence\" and \"unmitigated radicalism\". Henry David Thoreau thought highly of the book, suggesting that its strength came in part from Fuller's conversational ability. As he called it, it was \"rich extempore writing, talking with pen in hand\". In the Evening Post, William Cullen Bryant noted \"the thoughts it puts forth are so important that we ought to rejoice to know it read by every man and woman in America\" despite some \"pretty strong\" language. Miriam Schneir also includes this text in her anthology Feminism: The Essential Historical Writings, labelling it as one of the essential feminist works.\nThe influential editor Rufus Wilmot Griswold, believing Fuller went against his notion of feminine modesty, referred to Woman in the Nineteenth Century as \"an eloquent expression of her discontent at having been created female\". American author Nathaniel Hawthorne, previously a supporter of Fuller, was critical of her after Woman of the Nineteenth Century was published. The same was true of his wife, Sophia Hawthorne, who had attended some of her \"Conversations\" in Boston. Of Woman in the Nineteenth Century, she wrote:\n}}\nWoman in the Nineteenth Century, which has become one of the major documents in American feminism, is considered the first of its kind in the United States. Scholars have suggested Woman in the Nineteenth Century'' was the first major women's rights work since Mary Wollstonecraft's A Vindication of the Rights of Woman (1792), beginning with a comparison between the two women made by George Eliot in her 1855 essay \"Margaret Fuller and Mary Wollstonecraft\". Even so, Fuller's work is considered mainly literary today because oratory was more valued in the politics of her time.  Oratory relied strictly on masculine conventions and women's writing was generally sentimental literature.  Sandra M. Gustafson writes in her article, \"Choosing a Medium:  Margaret Fuller and the Forms of Sentiment\", that Fuller's greatest achievement with \"The Great Lawsuit\" and Woman in the Nineteenth Century is the assertion of the feminine through a female form, sentimentalism, rather than through a masculine form as some female orators used.\nReferences\nExternal links\n*\n*\nFurther reading\nPrimary works\n* [https://archive.org/details/womaninnineteent1845full Woman in the Nineteenth Century (1845)]\nSecondary works\n*\n*\n*\n*"
    }
  ]
}