{
  "content": [
    {
      "type": "text",
      "text": "# Woman of Courage Award\n\nSince 1994, the National Organization for Women (NOW) has presented the Woman of Courage Award annually (in most years) at the National NOW Conference, and periodically at issue-based summits organized by NOW and/or the NOW Foundation. Honorees are chosen for having demonstrated personal bravery in challenging entrenched power and in carrying out action that has the potential to benefit women in general.\nRecipients of this award have been plaintiffs in lawsuits that challenged sex-based discrimination and pervasive sexual harassment. They have also been leaders who organized other women to promote better working conditions and opportunities in non-traditional careers, such as  New York firefighter Capt. Brenda Berkman. An awardee may be an individual who brought attention to an important issue through her own experience, such as Christy Brzonkala. After being raped by two football players at Virginia Tech, Brzonkala sued the university, and her case went all the way to the U.S. Supreme Court.\nAnother honoree was a young woman, Julia Gabriel, who took action to improve labor conditions by testifying against those who force illegal servitude. In a highly publicized case, future awardee Lilly Ledbetter took her case against sex-based pay discrimination by Goodyear Tire and Rubber to the Supreme Court at great personal cost. NOW also presents the Woman of Courage Award to women who have accomplished special or unique feats undertaken by few others, such as Barbara Hillary, who reached the North Pole at the age of 75.\n{| class=\"wikitable\"\n|-\n! Year\n! Winner\n! Occupation\n|-\n| 2014\n| Ruslana Lyzhichko\n| Singer, social activist\n|-\n| 2011\n| Nancy Hogshead-Makar\n| Title IX advocate, Olympic athlete (1984)\n|-\n| 2009\n| Susan Hill\n| Abortion rights activist\n|-\n| 2008\n| Barbara Hillary\n| Nurse, Traveler\n|-\n|2008\n| Lilly Ledbetter\n| Activist against wage discrimination\n|-\n| 2006\n| Dr. Susan Wood\n| Former Assistant Commissioner for Women's Health and Director of the Food and Drug Administration's (FDA) Office of Women's Health\n|-\n| 2006\n| Ani DiFranco\n| Singer, songwriter, vocalist, guitarist, activist\n|-\n| 2005\n| Tillie Black Bear\n| Founder of the first shelter for women of color\n|-\n| 2005\n| Sybil Niden Goldrich\n| Advocate for women on silicone breast implants\n|-\n| 2005\n| Kakenya Ntaiya\n| Educating African women\n|-\n| 2005\n| Katie Hnida\n| Footballer\n|-\n| 2004\n| Dr. Donna J. Nelson\n| Professor of organic chemistry, University of Oklahoma; Nelson Diversity Surveys author\n|-\n| 2004\n| Carol Moseley Braun\n| United States Senator (1992–98) and U.S. Ambassador (1999–2001)\n|-\n| 2003\n| Barbara Lee\n| U.S. Representative (D-Calif.)\n|-\n| 2002\n| Captain Brenda Berkman\n| Firefighter\n|-\n| 2002\n| JoDee Flockhart\n| Advocate against sexual harassment in workplace\n|-\n| 2001\n| Cheryl Haworth\n| Olympic weightlifter\n|-\n| 2001\n| Maryanne Connelly\n| Feminist politician, former mayor of Fanwood, NJ\n|-\n| 2000\n| Christy Brzonkala\n| First person in U.S. to sue her attackers under the Violence Against Women Act\n|-\n| 2000\n| Elaine Gordon\n| Trail-blazing legislator\n|-\n| 2000\n| Julia Gabriel\n| Activist against forced labor\n|-\n| 1999\n| Martina Pickett\n| Advocate for safe and just workplace\n|-\n| 1999\n| Tapestry of Polygamy\n| Group of women against the abuse of women and girls in illegal polygamous marriages\n|-\n| 1999\n| Del Martin\n| Lesbian rights activist (married to Phyllis Lyon)\n|-\n| 1999\n| Phyllis Lyon\n| Lesbian rights activist (married to Del Martin)\n|-\n| 1998\n| Sylvia Smith and the Tonawanda NOW chapter\n| Native American rights activist\n|-\n| 1997\n| Smith Barney Suit\n| Class-action sexual harassment and discrimination suit against Morgan Stanley Smith Barney, LLC.\n|-\n| 1997\n| Judge Lanier Suit\n| Supreme Court sexual assault case against Chancery Court Judge David Lanier in United States v. Lanier\n|-\n| 1997\n| Mitsubishi Suit\n| Lawsuit against Mitsubishi plant in Normal, Ill., for discrimination, verbal and physical abuse\n|-\n| 1996\n| Mimi Ramsey\n| Founder of FORWARD International, a group that opposes female genital mutilation\n|-\n| 1996\n| Claudia Crown Ades\n| Reproductive rights activist\n|-\n| 1996\n| Rachel Bauchman\n| Young feminist\n|-\n| 1995\n| Shannon Faulkner\n| First female member of the Corps of Cadets\n|-\n| 1995\n| Merari Ortiz\n| Then 10-year-old welfare rights activist\n|-\n| 1994\n| Lisa Tiger\n| Native American AIDS activist\n|-\n| 1994\n| Dolores Huerta\n| Co-founder of the United Farm Workers (UFW)\n|-\n| 1994\n| Fay Clayton\n| Chicago attorney who successfully argued NOW v. Scheidler\n|-\n| 1994\n| Dr. Susan Wicklund\n| Reproductive Justice advocate\n|}\nSee also\n* List of awards honoring women\nReferences"
    }
  ]
}