{
  "content": [
    {
      "type": "text",
      "text": "# Women in the Dominican Republic\n\n| matdeath = 150 (2010)\n| womparl  = 19.1% (2013)\n| femed    = 55.6% (2012)\n| womlab   = 51.2% (2012)\n| ggg      = 0.703 (2022)\n| ggg_rank = 84th out of 146\n| ggg_ref  = }}\nWomen in the Dominican Republic have equal constitutional rights as men in the economic, political, cultural and social fields, and in the family. Their character has been defined by their history, culture, tradition and experience.\nCharacter\nBy law, modern women in the Dominican Republic are equal to men in terms of rights and property ownership. Culturally, however Dominican women live under a machista tradition, where women understood and to a certain degree accepted the machismo nature of Dominican men. By tradition, Dominican Republic women are expected to be submissive housewives, whose role in the household include childbearing and rearing, taking care of and supporting their husbands, cooking meals, cleaning the house, and sewing.\nRole at work\nMany women in the Dominican Republic are culturally discouraged from working. They represent a significantly smaller portion of the workforce in a country that ranks as the 4th largest location of free trade zones globally. In 1990, the average salary of a working woman in the Dominican Republic was US$59.00, yet the unemployment rate among Dominican women was 23%. In rural areas, it is easier for women to find jobs but they are paid less than men. Many women from the Dominican Republic migrated to New York City in the United States in order to escape from the \"male-dominate culture\" of Dominican Republic society. One notable example of literature depicting the struggles of women in the Dominican Republic and their yearning for better life through education is Julia Alvarez's historical novel titled In the Time of the Butterflies, whose heroine Minerva Mirabal lived in the Dominican Republic during the reign of Rafael Trujillo.\nPolitical representation\n, second female vice-president of the Dominican Republic.]]\nIn 1931, the Dominican Feminist Action, led by Abigail Mejia, hosted the First Feminist movement in the country demanding equal rights under the Constitution. Dominican women won the right to vote in 1942, through the constitutional reform of that year, which were established in Articles 9 and 10. This marked an important civil and political change of women's rights in the Dominican Republic. The progressive policies implemented by the government of Juan Bosch in 1963 allowed women to begin to organize their grassroots movements at different levels of society.\nDecades later, in the early 90s, women's organizations in the Dominican Republic began to demand greater inclusion in elections. In that sense, the first female quota law was enacted on December 21, 1997, which established that at least 25 percent of candidatures for elective positions of the parties would be occupied by women. Subsequently, this percentage was raised to 33 percent. These laws set aside a minimum of candidates for elective office for women.\nEducation\nGender inequality for girls in the education system is not a significant issue in terms of participation. Attendance rates are slightly higher for girls between age 6-13 (87%) than for boys of the equivalent age (84%). As age increases, this difference becomes clearer as 40% of females aged 14–17 are enrolled and only 29% of males of the same age are enrolled. Thus, males are more likely than females to drop out of school. Literacy for females is listed at 92.3% while literacy for males is listed at 91.2%. Compared to the world, these numbers are higher than the average. Worldwide literacy is at 86.1%. For males, worldwide literacy is at 60.9% and for females world literacy is at 82.2%.\nThe CIA world factbook also shows data on the school expectancy of students in the Dominican Republic. For males, this expectancy is at 13 years old which is slightly lower than the female school expectancy of 14 years old. In 2005, a test was administered to students at grade levels 3, 4, and 5 to assess their competency in reading comprehension and mathematics curriculum from grade levels 1, 2, and 3. This test was called the Consorcio de Evaluación e Investigación Educativa (CEIE. The exam found that girls performed better on the reading comprehension test than boys.\nReproductive rights\nAbortion in the Dominican Republic is completely illegal. The Dominican Republic is one of the few countries of the world which have a complete ban on abortion, without an exception for saving maternal life.\nStatus in society\n.]]\nWomen of the Dominican Republic who belong to the lower-class live in families that have a matriarchal structure, often because the father is not at home. While among women who belong to the middle and upper-classes exist in families with patriarchal structures.\nEthics and etiquette\nIn rural areas, Dominican Republic women may wear dresses and skirts; while in urban locations, Dominican Republic women may prefer to wear short skirts and jeans. The clothing in both areas may be made up of bright coloration and shiny fabrics. Older or prominent women are often addressed as Doña followed by their surnames as a form of respect. Female greetings may involve women kissing each other on the cheek.\nIn relation to riding motorcycles, it is common for women of the Dominican Republic to sidesaddle while on the backs of such vehicles; the reason is that most women tend to wear skirts instead of jeans because of religious beliefs or due to culture.\nLife expectancy\nWomen in the Dominican Republic have an average life expectancy of 72 years.\nArts and crafts\nWomen who live in the rural areas of the Dominican Republic usually engage themselves in the manufacture of macramé hammocks, bags, baskets, products of palm weaving, and the creation of jewelry using coral, seashells, amber, and the semiprecious ocean-blue gemstone known as larimar (a gemstone that is native only in the country).\nSee also\n* Women in the Americas\nReferences\nExternal links"
    }
  ]
}