{
  "content": [
    {
      "type": "text",
      "text": "# Women in the Mexican–American War\n\nWomen played an important part in the Mexican-American War.\nContributions from Mexican women\nOn the battlefield\nSince Mexico fought the war on its home territory, a traditional support system for troops were women, known as soldaderas. They did not participate in conventional fighting on battlefields, but some soldaderas joined the battle alongside the men. These women were involved in fighting during the defense of Mexico City and Monterrey. Some women such as Doña Jesús Dosamantes and María Josefa Zozaya would be remembered as heroes. Dosamantes was known to have \"unsexed\" and disguised herself as a captain to fight directly in the face of danger alongside her fellow troops. On the other hand, Zozaya was known to have multiple versions of her story. Some of which included jumping onto rooftops in the city to provide food and munitions to her troops and dying on the battlefield. One version of her story was she was struck and killed by gunfire while gently lifting a soldier's head into her lap and binding his wounds with her own handkerchief. U.S. soldiers buried her body \"amid showers of grape and round shot.\" Deeply moved, U.S soldiers praised her humanity in the midst of war. Songs and poems were written to commemorate the compassion of the \"Maid of Monterrey\". While Dosamantes and María Josefa Zozaya were seen as die-hard patriots, some Mexican women during the war were described as \"angels\" as they came to the rescue of all wounded men on both sides. During the Battle of Monterrey, for example María Josefa Zozaya worked tirelessly to bring food and water to all, regardless of nationality. The Mexican women working alongside the male troops faced the same obstacles on the battlefront, however, they were not spared of their duties after returning from battle, for they still had to provide food and clothing. Known as the \"shadow army\" behind the Mexican force, Mexican women were able to unite by the hundreds behind their fellow soldiers to supply medical needs and boost their morale. On many occasions, soldaderas came to the aid of the opposing army, providing a share of their rations and the clothes on their backs. Constantly on the move between shelters and the battlefield, a soldadera's work was never done. Unlike the Americans who had a negative judgment of soldaderas, their visibility to the Mexican army was not ignored, whether they were coming to the aid of others or leading them into battle.\nOn the home front\nMore often than not, soldaderas had to carry the misconception of solely being seen as servants, especially by American soldiers. Americans had to come to terms with the fact that Mexican women were just as, if not more, patriotic and fearless than their male counterparts. Aside from providing their services during battle, Mexican women were able to do more than what was expected of  them domestically. Though they were not ideal circumstances, the war gave Mexican women the opportunity to find new independence within the public sphere. Mexican women were seen pushing the boundaries that were placed onto them by men. To display their pride in defense of their country, Mexican women created their own forms of propaganda. Amongst the faces of the enemy, after the Battle of Monterrey, many Mexican women were seen dressed in “mourning garb and draped their houses in black for three days, as church bells rang funeral tolls.\" Daniel Harvey Hill, American general, recalled seeing Mexican women paint their men performing domestic duties, such as sewing, while American officials stood by in full dress. Despite their losses, Mexican women still risked their lives in public in order to display their patriotism, aside from risking their lives in battle.\nAn interesting case is Mexican women’s treatment of the San Patricios, a group of Irish men who at first supported the Americans in the war then they defected and joined the Mexican side. Most Mexican women felt these men were doing more for the war front than the Mexican men could ever do.\nWomen on the home front wrote poems about the progress of the war. One example, titled “When the women oppose the cowardly men,” condemns the inability of Mexican men to defeat the invaders. The author declares that Mexican women, on the other hand, will be victorious, and urges Mexicans not to submit to \"a shameful peace.\"\nContributions from American women\nOn the battlefield\nIt was not common for American women to join the American forces in combat. Much like Mexican women, they were mostly recognized for their work as laundresses and cooks. However, there were notable American women who stepped out of their private sphere. For instance, Sarah Bowman was unlike most American women in Mexico. Not just for her appearance, but also her role on the battlefield. Standing at six foot two and weighing two hundred pounds, American troops stood in awe of Bowman's muscles and her ability to lift bodies and equipment with ease. Aside from providing food and clothing to the soldiers, many depended on Bowman to transport wounded soldiers to healthcare workers within the forts. One woman, Sarah Bowman, refused to take shelter and served food and water to the troops during the siege. Even though a bullet went through her sunbonnet, she served \"her boys\" as they defended the besieged fort. When faced with the dangers of bullets flying about and soldiers fighting, Bowman was still seen preparing food, delivering it, and even attacking the enemy. Her determination during the siege earned her the nickname \"the Heroine of Fort Brown\" and the honorary title of Colonel Bowman. When she died, this courageous woman was buried with full military honors. She traveled with Taylor's army as a nurse and cook, and participated in the Battle of Buena Vista.\nElizabeth Newcome, of Missouri, participated in the conquest of New Mexico. \"Bill\" Newcome served as a Private in Steven Watts Kearney's Army for 10 months before the discovery of her true identity. A doctor's examination of the Missouri soldier quickly revealed the private was female, and she was forced to leave. She was discharged from duty, but still received a veteran's land bounty after the war.\nOn the home front\nIn Mexico\nPrior to the war, New England industries had already expanded on Mexican territory. Therefore, American couples had already made the move to reside in Mexico. When American women were abandoned by their husbands to fight in the war, they were left to uphold the factories. Thus, factory women held supervising positions as well as labor jobs, especially in the textile industry. Among these women who became factory overseers was Ann Chase, another hero to the American forces. As an Irish immigrant, Chase was sympathetic towards the impoverished Mexican cities she resided in, especially Tampico, and even conducted her own research. As American citizens were told to evacuate Tampico, Chase was left to run her husband's business alone as she was exempted due to her British citizenship. Towards the beginning of the war, she was bombarded with increased pressures from Mexican officials to shut down her business and move away. With resentment towards the war, Chase began to send information to U.S. Navy troops upon the whereabouts of Mexican troops: \"Her balcony offered an eagle's perch from which to monitor the arrival and departure of troops, their size, point of origin, discipline, and morale.\" Even though Chase was impressed with the efforts of impoverished Mexican and soldaderas, she was willing to become a spy for U.S. troops if it meant the protection of her home and business.\nDuring the war, it was common for women to travel with their husbands to Mexico. While they had the same domestic duties as Mexican women, oftentimes, American women were hired to be laundresses and servants; American women were getting paid to work. White American women remained in the presence of American troops in terms of medical and domestic service. However, on rare occasions, some American women became prostitutes.\nIn the United States\nWhile some American women joined the war effort in Mexico, many were able to contribute from across the border. Whether they were in support or opposition to the war, many women decided to maintain their traditional values. Crafting art, flags, and quilts were among the most common forms for American women to display their patriotism, passing it on to their husbands and sons who had enlisted. However, many American women also took the opportunity to manage their businesses in the absence of men as well as protesting their concerns publicly. Also wanting to make their voices heard within the public sphere, some American women took advantage of their literacy to reach headlines across multiple states.\nWithin the male-dominated journalism space, American women stepped up in support and opposition of the war through their writing nationwide. Among the most prominent was Anne Royall, a Virginian journalist who, while at time holding various views on the war, eventually became opposed to the war as aggressions grew more violent. Aside from hearing about the tragedies in Mexico, Royall increasingly criticized America's fight for expansion, claiming that “the republic was simply becoming too large, too unmanageable.\" Royall sympathized for Mexican women as she demanded the prosecution of U.S. volunteers who raped and murdered them. Being recognized as the first women political journalist, Royall continued to advocate for women up until her death in 1854. Also in opposition of the war was Jane Swisshelm, a Pennsylvanian journalist who also advocated for abolitionism and women's rights. After witnessing families being separated due to the war, she began sending angry letters in opposition of the war to the Whig Daily Commercial Journal. Readers were entertained by how Swisshelm wrote with “reckless abandon” and colorful language, claiming that the war was unfair and denouncing anyone who was in support of it. Although they were across the border, both Royall and Swisshelm not only became vessels for the voices of those in opposition of the war, but also Mexican women who were being attacked. On the other hand, Jane Cazneau, a New York editor, became a spy for the Polk administration during the war. Although Cazneau wanted the gruesome fighting to end, she believed that the U.S. would benefit commercially from expansion in Mexico. Deemed as the “Mistress of Manifest Destiny”, Cazneau denounced Mexico's resistance: “Mexico is not true to herself, and even at this hour, she is doing more for the generals of the United States than they can do for themselves. [Mexico] would be more than ready to receive an American government.\" Although many thought that the war was unfair, Cazneau represented the voices of American women who were in support of the U.S. territorial expansion.  She witnessed Winfield Scott's capture of Vera Cruz in March 1847, becoming the first female war correspondent in U.S. history.\nReferences"
    }
  ]
}