{
  "content": [
    {
      "type": "text",
      "text": "# Women in 17th-century New England\n\n.]]\n}}\nThe experience of women in early New England differed greatly and depended on one's social group acquired at birth. Puritans, Native Americans, and people coming from the Caribbean and across the Atlantic were the three largest groups in the region, the latter of these being smaller in proportion to the first two. Puritan communities were characteristically strict, religious, and in constant development. The separate colonies that formed around Massachusetts and Rhode Island began as centralized towns that expanded quickly during the seventeenth century.\nPrior to European contact, gender roles in native societies were divided based on class and gender, and tended to be more equitable than in Puritan society. Native women were able to adapt to the societal changes that followed the introduction of European social, legal, and religious beliefs, while still maintaining their identities within their indigenous tribes. However, historical accounts of women who arrived as slaves and free people from the Caribbean are scarce, as most written records of their lives were recorded from the viewpoint of white male elites and slave owners, who regarded the women and men they owned as property.\nColonial women in 17th-century New England\nNew England colonists living in Puritan-established settlements in the seventeenth century dealt with many of the same realities. Colonial settlements in New England saw a rapid expansion from roughly 1620 onward. The common assumption that Puritan society was homogeneous holds some truth, excepting matters of wealth. As communities became more established, people naturally accumulated more material possessions, differing in quality from family to family. As little physical money circulated in the early colonies, tangible objects became proof of both wealth and status. Disparity in material wealth was a major force impacting daily life in places like Plymouth Colony; the recorded inventory of William Pontus in 1652 valued his land, house, and furnishings at thirteen pounds, while in 1654 the estate of \"Miss Ann Attwood\" recorded the ownership of eighteen tablecloths and sixty-six cloth napkins (not including other assets). However, the function of social norms outweighed wealth in relation to personal roles and interactions.\nSocial structure\nPuritan society was overwhelmingly male-dominated, reflected in most areas of public life. Women could not own property independently, and therefore could not vote, a privilege that was awarded to \"freemen,\" or men who owned property. Women were excluded from enacting laws, serving in courts, creating taxes, and supervising land distribution, all of which were government functions. The role of religion was also divided by gender, since nearly every colonist in New England was Christian in some form. In this area, women were also seen as lesser to God than men were. Men were inferior to God, and women were inferior to men according to the logic of social hierarchy.\nDespite these restrictions, some women did find ways to assert themselves and challenge societal norms. Anne Hutchinson, a well-known spiritual leader, publicly challenged the male religious authorities in Massachusetts Bay Colony. She held meetings in her home where she discussed religious matters, and her teachings gained a following. However, Hutchinson was eventually put on trial and banished from the colony for her outspoken beliefs, which were seen as heretical. Her case is often cited as an example of the limitations imposed on women in Puritan society.\nFamily life\nFamily life in Puritan society revolved around the nuclear family, with husbands as the heads of households and wives expected to be obedient and submissive. The primary role of women was seen as childbearing and raising children. Large families were common, and women often bore many children. The average number of children per marriage was around eight, but some women gave birth to as many as fifteen or twenty children. Child mortality rates were high, and women faced the constant risk of death in childbirth.\nDespite these challenges, women also played an essential role in maintaining the household and community. They were responsible for tasks such as cooking, cleaning, sewing, and gardening. Women's labor was crucial for the survival and well-being of the family. Additionally, women often served as midwives and healers, providing medical assistance and care to their communities.\nEducation\nFormal education opportunities for women were limited in Puritan society. While boys had access to schools and could pursue higher education, girls were primarily educated at home and taught skills necessary for domestic life. Some wealthier families might hire tutors to provide more extensive education for their daughters, but this was relatively rare.\nHowever, the importance of religious education was recognized, and girls were taught to read so that they could study the Bible and participate in religious activities. Puritans believed that women needed to be educated enough to read and understand religious texts, as their spiritual well-being was of great significance.\nMarriage\nMarriage was considered an essential aspect of a woman's life in Puritan society. It was seen as a way to fulfill her religious and societal duties. Women typically married in their early twenties, and marriage was often arranged by families based on economic and social considerations. Love and personal choice were not the primary factors in determining marriage partners.\nOnce married, women were expected to be subservient to their husbands. Husbands had legal control over their wives and could make decisions on their behalf. This was a concept known as coverture, meaning women were “covered” by their husbands. Divorce was rare and highly stigmatized, as marriage was viewed as a lifelong commitment.\nLegal rights\nWomen had limited legal rights in Puritan society. They could not enter into legal contracts independently or own property in their own name. In legal matters, women were represented by their husbands or other male relatives. However, widows did have some legal rights and could inherit property from their deceased husbands.\nThe colonial legal system differed greatly from the English legal system the settlers left behind, especially in New England. The Puritans in New England wanted to distance themselves as much as possible from England and its ties to the church. This meant their legal system was set up with this in mind. Women in England also had access to ecclesiastical courts, which were run by the clergy and not the government. The ecclesiastical courts were the place where women could be heard and represent themselves independently from their husbands. No ecclesiastical courts were established in any of the colonies, removing this benefit from women in the New World. Moore points out, “the percentage of women appearing as either plaintiffs or defendants in these courts reflects the fact that they took full advantage of the legal freedom that ecclesiastical courts allowed them,” a freedom women in the New World were never afforded.  Women in the New England colonies also lacked access to Chancery courts, or courts of equity, which were courts designed to protect married women’s property rights.  This meant women in the New England colonies had almost no legal avenues to pursue in comparison to their English and Southern colony counterparts.\nAnother legal system women were subjected to was coverture. Under this common law doctrine, men controlled any property, money, and other legal matters of their wives. Women who were married could be referred to as “feme covert,” while single or widowed women were “feme sole.” Married women did not have their own legal identity, but were rather legally “covered” by their husbands who had full membership in the legal, political, and economic aspects of life. Widows were no longer under coverture when their husbands died, but many women remarried. Unless specified in a will or estate, everything of hers would now be controlled by her new husband. Even though under Common Law women could not be named as an heir in a will, many women were still given dower rights, usually one-third of their husband’s property; however this was only available if the husband died and not under circumstances of divorce or separation. Because New England was mostly made up of Puritans, women in these colonies were more subjected to the rules of coverture than their counterparts in the other colonies. For example, Connecticut refused to acknowledge the separate estates of women, and Massachusetts did not uphold the laws definitely until the 19th century.\nSee also\n* New England Puritan culture and recreation\nReferences\nFurther reading\n*\n*"
    }
  ]
}