{
  "content": [
    {
      "type": "text",
      "text": "# Women in warfare and the military (2000–present)\n\nThis article is about women in warfare and the military (2000–present) throughout the world outside the United States. For women in warfare and the military in the United States since 2000, please see: Timeline of women in warfare and the military in the United States, 2000–2010 and Timeline of women in warfare and the military in the United States, 2011–present.\n]]\n]]\n]]\n]]\n]]\n]]\n]]\nLinda Corbould, RAAF (Ret.)]]\n]]\nSimone Wilkie ]]\n]]\n]]\n]]\nKristin Lund, Norwegian Army]]\n]]\n]]\n]]\n2000\n* 8 March: Lim Sok Bee becomes the first female commanding officer of an artillery battalion in Singapore.\n* 27 March: Elza Kungayeva, an 18-year-old Chechen woman, is abducted and murdered by a Russian Army Colonel during the Second Chechen War. Her murder was one of the first cases in which Russian authorities promptly and publicly acknowledged a war crime perpetrated by Russian federal forces against civilians in Chechnya.\n* September: West Side Boys, an armed group in Sierra Leone, are destroyed during Operation Barras, and subsequent operations by the Sierra Leone Army and the British Army's Royal Irish Rangers, the Parachute Regiment and the Special Air Service. The group had female fighters as well as male ones.\n* Lone Træholt became the first woman in the Danish Air Force to hold the rank of lieutenant colonel ().\n* María Elena Mendoza Quan graduated as Central America’s (and El Salvador’s) first female attack pilot of an A-37B warplane.\n* The Equality amendment to the Military Service law stated that \"The right of women to serve in any role in the IDF (Israel Defense Forces) is equal to the right of men\".\n* Major Micky Colton became the first female Hercules pilot in the Canadian military to complete 10,000 flying hours.\n* Lieutenant Ruth Ann Shamuhn became the first female combat diver in the Canadian military.\n* Brooke Chivers and Aroha Fifield became the Royal Australian Air Force's first women to graduate to fast jets.\n*Since 2000, women are allowed to voluntarily serve in the Mexican military, with restrictions to medical units.\n*Canada granted permission for females to serve in submarine units\n*\"Colonel Black Diamond\" joins the rebel group LURD, going on to command its all-female wing, the Women's Artillery Commandos, during the Second Liberian Civil War.\n2001\n* German women are allowed to serve in combat units as of 2 January 2001 rather than only being admitted to medical units/musicians in the military bands.\n*March: Hikaru Saeki became the first female star officer (admiral and general) in the history of the Japan Self-Defense Forces (JSDF) with her promotion to Rear Admiral.\n* April: The first female jet fighter pilot for the Israeli Air Force, Roni Zuckerman, received her wings in 2001.\n* May: Capt. Maryse Carmichael became the first female Snowbird pilot in Canada.\n* November: Chechen woman Aiza Gazuyeva assassinates a Russian general by suicide bombing. She is the first Chechen shahidka, or \"black widow\", a term for female suicide bombers. More women begin to copy her example.\n* December: Julie Hammer becomes the first woman Commandant of the Australian Defence Force Academy.\n*New Zealand women authorized to serve in all defense units.\n2002\n* Chief Warrant Officer Camille Tkacz is the first woman appointed to a Command Chief position as assistant deputy minister (Human Resources – Military) Chief Warrant Officer in Canada.\n* January: Yang Seung Sook becomes the first female general in the history of the South Korean military.\n* May: Captain Philippa Tattersall becomes the first woman to earn the Royal Marines green beret. She is not allowed to serve in combat, however.\n* 26 September: Three female airforce officers are appointed as airforce fighter pilots in South Korea, making them the first women to become fighter pilots in the history of the country.\n* Jang Se-jin became the first female transport plane pilot in South Korea.\n2003\n* Maj. Anne Reiffenstein became the first female in Canada to command a combat arms sub-unit.\n* Lt.-Cmdr. Marta Mulkins is the first woman to serve as a captain of a Canadian warship.\n* Maj. Jennie Carignan of 5 Combat Engineer Regiment (5 CER) becomes the first female Deputy Commanding Officer of a combat arms unit in Canada.\n* Leading Seaman Hayley John and Leading Seaman Marketa Semik are the first female clearance divers in Canada.\n* Master Seaman Colleen Beattie is the first woman in Canada qualified as a submariner, followed shortly by Master Seaman Carey Ann Stewart.\n* The first all-female Canadian military team to complete the Nijmegen March in the Netherlands carrying the same weight as male teams do so in 2003. The team members are: team leader Lieut. Debbie Scott, second-in-command Capt. Lucie Mauger, Lieut. Jody Weathered, Cpl. Elizabeth Mutch, Warrant Officer Nathalie Mercer, Warrant Officer Jackie Revell, Master Corporal Denise Robert, Cpl. Melissa Cedilot, Cpl. Danette Frasz, Lt.-Col. Teresa McNutt, Lieut. Donna Rogers and Cpl. Anne MacDonald.\n* Julie Hammer, RAAF, is promoted to Air Vice-Marshal. She is the first woman to achieve two-star rank in the history of the Australian Defence Force.\n* 27 February: Serbian politician Biljana Plavšić is sentenced to 11 years in prison for war crimes.\n* July: Lt.-Cdr. Marta Mulkins takes command of a Maritime Coastal Defence Vessel, HMCS Kingston. She is the first woman commanding officer of a Canadian Navy ship.\n* Women of Liberia Mass Action for Peace brings about the end of the Second Liberian Civil War. Leymah Gbowee and Ellen Johnson Sirleaf are instrumental in this, and were awarded the Nobel Peace Prize in 2011.\n* Pyeon Bo-ra became the first South Korean female fighter pilot.\n2004\n* Chief Petty Officer, 1st Class Jan Davis is appointed Coxswain of HMCS Regina and is the first woman Coxswain of a major warship in Canada.\n* Major D., an IAF MANAT (Flight Test Center) test-engineer flew the F-16I Sufa on Tuesday (27 April 2004). She was the first woman in the Israel Defense Forces to fly a F-16I jet.\n* 4 February: Italian war correspondent Giuliana Sgrena is kidnapped in Iraq by insurgents. The car carrying her and her companions was shot at while by American forces at a checkpoint during her release in March, wounding her and killing an Italian intelligence agent.\n* 9 March: American lawyer Fern Holland is killed while working for the Coalition Provisional Authority in Iraq.\n* 31 October: S/Sgt Denise Rose, British Army, becomes the first female British soldier to die in military operations in the Iraq War. Her death is ruled to be a suicide by an inquest.\n* Russia's first all-girls military school, Moscow Girls Cadet Boarding School No. 9, opened in 2004.\n* The law was changed in Switzerland to allow women to become fighter pilots.\n*Caracal Battalion, Israel's first mixed female and male combat unit, was created in 2004.\n2005\n* Elizabeth Cosson becomes the first woman to be promoted to the rank of Brigadier in the Australian Army.\n* War correspondent Gina Cavallaro watched her military escort, 20-year-old Spc. Francisco Martinez, be killed by an enemy sniper in Iraq. She later expanded upon her experiences in her book, Sniper: American Single-Shot Warriors in Iraq and Afghanistan.\n*The first woman to take command of an Italian war vessel was Catia Pellegrino after graduating the Naval Academy in 2005.\n2006\n* May: Flight Lieutenant Sarah-Jayne Mulvihill becomes the first British servicewoman to be killed in the Iraq War.\n* 17 May: Captain Nichola Goddard, (Canadian Forces Land Force Command), became the first Canadian woman to be killed in action since World War II, the first female Canadian Forces member killed during combat duty, and the first Canadian female combat soldier to be killed on the front lines. She was near the front lines serving as a forward artillery observer during a battle with Taliban forces. She was killed when a rocket-propelled grenade struck her light-armoured vehicle.\n* 16 June: Pte Michelle Norris, British Army, saves the life of her sergeant by climbing out of a vehicle and pulling him from the turret of the Warrior Patrol Vehicle that they were in while under heavy gunfire. She is eventually awarded the Military Cross for her actions, and is the first woman to receive one.\n* 12 August: Sgt. Maj. Keren Tendler, the first female Israeli helicopter flight mechanic, is killed in action during the 2006 Israel-Lebanon conflict along with four other crew members. A fund is later established in her name to help other women become flight mechanics.\n* 22 September: Aviation Cadet Saira Amin wins the Sword of Honour at The Pakistan Air Force Academy, becoming the first female aviation cadet to do so.\n* 7 October: War correspondent Anna Politkovskaya, who made her reputation reporting on Chechnya, was murdered.\n* 4 December: Linda Corbould led the RAAF's first all-female aircrew during a training flight. Corbould was subsequently appointed the Senior Air Force Officer in Tasmania, a position she had requested.\n* In December 2006 female cadets from the Pakistan Military Academy for the first time assumed guard duties at the mausoleum of Quaid-e-Azam at Karachi.\n* In this year women were enrolled in the Pakistani military for assignments other than duties in medical setups/units for the first time in history.\n* Bombardier Allison Jones became the first woman to fire the One O'Clock Gun at Edinburgh Castle.\n* Brigadier General Christine Whitecross became the first female Joint Task Force Commander in the Canadian military.\n* Line Bonde became the first female Danish fighter pilot.\n2007\n* In 2007 the Brigade of Gurkhas announced that women are allowed to join. Like their British counterparts, Gurkha women are eligible to join the Royal Engineers, Logistics Corps, Signals and brigade band, although not infantry units.\n* 19 January: The United Nations first all female peacekeeping force is set to deploy to Liberia. The peacekeeping force is made up of 105 Indian policewomen.\n* March: The Botswana Defence Force begins recruiting women into military service. Tebogo Masire, the commander, states that they will not receive special treatment.\n* March: Acting Leading Seaman Faye Turney, a British sailor, is captured by Iran along with fourteen other British sailors. While captive, she appears on television apologizing for trespassing in Iranian waters, and also writes a letter stating that she and her fellow sailors \"apparently trespassed\" on Iranian waters.\n* April: The fifteen British sailors captured by Iran are released. It is revealed that Acting Leading Seaman Faye Turney was separated from the other sailors and singled out for special treatment by the Iranians. In a news conference, some of the other sailors state that she was used as a propaganda tool by Iran. Iranian President Mahmoud Ahmadinejad criticizes the United Kingdom for sending Turney, the mother of a young child, into a war zone.\n* Since 2007, Mexico's army has allowed women soldiers to work as pilots and engineers in addition to nurses, doctors, and cooks. Women have been serving since the Mexican Revolution but often acting as men or cooks.\n* Lieutenant Colonel Tammy Harris became the first female Wing Commander in the Canadian military.\n* Commodore Jennifer Bennett became the first woman appointed Commander of the Naval Reserve and the first female to command a Formation in the Canadian military.\n* Pyeon Bo-ra became the first South Korean female flight instructor.\n* Pyeon Bo-ra became the first South Korean woman to compete in the Boramae Midair Shooting Competition; she won the grand prize in the low-altitude shooting category.\n2008\n* March: British Flight Lieutenant Michelle Goodman, a helicopter pilot, became the first woman to be awarded the Distinguished Flying Cross.\n* 23 May: Lt. Col. Pi Woo-jin, one of the first female helicopter pilots in the South Korean military, was reinstated into the military after a legal battle over her forced medical discharge after she underwent a mastectomy for breast cancer. She was the first soldier to ever be reinstated into the South Korean military after a forced medical discharge.\n* June: Corporal Sarah Bryant became the first female British soldier to be killed in Afghanistan when she and three SAS men died in a roadside bomb.\n* July: Aafia Siddiqui was arrested in Afghanistan on suspicion of terrorism.\n* Ofra Gutman became the first female officer in the Rabbinate Corps of the Israel Defense Forces, although she was not a rabbi.\n* Poland permitted women in combat roles, though it was not until 1999 that women were accepted in all Polish military schools. In December 2008, there were 1153 women in the Polish Army, and in 2004, a law was passed requiring women with college nursing or veterinary degrees to register for compulsory service. In December 2008, female platoon commanders deployed to Iraq and Afghanistan.\n* Lieut Cdr. Roberta O'Brien became the first female captain of an Irish Naval Service patrol vessel, LÉ Aisling.\n* Lone Træholt became the first woman in the Danish Air Force to hold the rank of colonel ().\n2009\n* Flt Lt Kirsty Moore became the first female aviator for the Royal Air Force's Red Arrows, the RAF's aerobatic team.\n* 21 January: Samira Jassam, an Iraqi recruiter of female suicide bombers, is captured. She admits to organizing rapes against potential recruits to convince them that martyrdom was the only means to escape their shame.\n* 8 April: Commander Josée Kurtz becomes the first woman to command a major Canadian warship.\n* April: Lance Corporal Amy Thomas finishes her six-month tour of duty, the last two months of which she spent attached to the elite Royal Marines of 42 Command. She is believed to be the British Army's first female combatant. Women are traditionally unable to join the Marines or infantry regiments in the British military.\n* August: Abu Sayyaf, a militant Islamic group in the Philippines, is reported to be recruiting female fighters.\n* Lance Corporal Katrina Hodge becomes Miss England 2009.\n* 25 November: Commandant Virginie Guyot, a French Air Force fighter pilot, is appointed leader of the Patrouille de France demonstration team, becoming the first woman in history to lead a military aerobatic team.\n* Karen Soria became the first female rabbi in the Canadian Forces; she was assigned to 3 Canadian Forces Flying Training School in Portage la Prairie, Manitoba.\n* From 2009, there were 800 German female soldiers in combat units.\n2010\n* 1 June: Sophia Bruun is killed on 1 June 2010 while on duty in Afghanistan; this makes her the first Danish woman soldier ever to be killed in action.\n* 18 July: A Taliban leader calls for the deaths of Afghan women training to join the Afghan military.\n* Divya Ajith Kumar becomes the first woman in the history of the Indian Army to receive the Sword of Honour, which is the highest award given to a cadet of the Officers Training Academy.\n* The Afghanistan army gets its first female officers.\n* Itunu Hotonu becomes the first Nigerian woman to be promoted to the rank of rear admiral by the Nigerian Navy.\n* Lieutenant Alexandra Hansen was made the first female commanding officer of a ship (HMNZS Pukaki) in the Royal New Zealand Navy.\n* Lieutenant Colonel Susan Wigg of the Canadian military, one of the initial women to enroll at Royal Military College in 1980, became its first female Director of Cadets.\n* Lieutenant Colonel Maryse Carmichael became the first female Commanding Officer of the Snowbirds in the Canadian military.\n* Major Eleanor Taylor, the first woman in the Canadian military to lead an infantry company in a combat zone, was deployed to Afghanistan.\n* Jang Se-jin became the first female pilot in the South Korean Air Force to become an instructor pilot.\n2011\n* Shikha Awasthi, a cadet of the Armed Forces Medical College (AFMC) at Pune, India, becomes the first woman to receive a Sword of Honour for overall excellence at the passing-out parade of the institute. She also becomes the first graduate of AFMC to receive all three top honours, namely, the Sword of Honour, the presidents Gold Medal and the Kalinga Trophy.\n* An anonymous woman becomes the first to undertake combat missions in the RAF's new Typhoon fighter.\n* Ramona Go is the Philippine army's first female general.\n* Captain Lisa Head is the first British female officer to be killed in Afghanistan. She is also the first British female bomb disposal expert to be killed in action.\n* Ramatoulie DK Sanneh is the first female Brigadier General in Gambia.\n* Rear-Admiral Jennifer Bennett is appointed as the first female Chief, Reserves and Cadets, in Canada.\n* Orna Barbivay becomes the first female Major General in the Israel Defense Forces.\n* Sarah West was appointed as the first female warship commander in the Royal Navy of the British Armed Forces.\n* Second Lieutenant Noy, a combat soldier in the Caracal Battalion, became the first female officer to command a sniper platoon in the Israel Defense Forces.\n* A 30-year-old RAF officer (Flight Lieutenant Rachael Cadman) became the first woman to complete the Enduroman Arch2Arc Challenge.\n* Warrant Officer Class One Esther Freeborn became the first female Bandmaster in the 350-year history of the Household Cavalry in England.\n* The first female pilots joined the Botswana Defence Force.\n* Proscovia Nalweyiso became the first female Brigadier General in Uganda.\n* Australia decided to gradually remove all restrictions on women serving in front-line combat over a period of five years.\n* Sapper Shanti Tigga became the first female jawan in the Indian army.\n* The first all-female team of skydivers of the Indian Air Force made its official debut during the annual Air Force Day parade.\n* Brigadier Simone Wilkie became the first woman to be in command of Australian soldiers at war. Specifically, Brigadier Wilkie, 47, was National Commander, Afghanistan, and was in charge of all 1500 Australian personnel serving with ADF units and embedded with international forces in the combat zone.\n* Blessing Liman became the first female pilot in the Nigerian Air Force.\n* The first woman joined the ranks of the Mexican navy's special forces.\n* Defence Secretary Philip Hammond confirmed that women are to be allowed to serve on the submarines of the Royal Navy (the naval warfare service branch of the British Armed Forces). The first women officers will begin serving on Vanguard-class nuclear subs in late 2013. They will be followed by female ratings in 2015, when women should also begin serving on the new Astute-class subs.\n* Robyn Walker became the first woman in the Royal Australian Navy to attain the rank of Rear Admiral, and also the first woman in the Australian Defence Force to take on the job of Surgeon‑General.\n* Lieutenant Commander Kay Burbidge became the first female senior observer in the Royal Navy.\n* The Skype scandal in the Australian military occurred when footage of a young male recruit having sex with a female classmate was streamed online to cadets in another room without her knowledge.\n*September: Polina Zherebtsova publishes the diary she kept as a child of Second Chechen War.\n2012\n* Five women were awarded their pilots' wings in a graduation ceremony with the Israeli air force; they were the most women ever to become Israeli air force pilots at one time.\n* South Korea's Navy appointed its first two female officers to command fast attack craft.\n* Florence Green, who was the last known living World War One veteran, died.\n* The first Saudi Arabian women have been recruited into the country's military service, Arab News reports. However, they will be stationed as privates as Passport Control departments on only border crossings.\n* It was announced that the Australian Defence Force would open all jobs in the military to women in 2013.\n* Carmen Melendez de Maniglia became the first female admiral in Venezuela. She was in the Navy.\n* Col. Tammy Harris became the commander of CFB Borden near Barrie, Ontario. She was the first woman to head a Canadian Forces base.\n* Colonel Marian Aleido became the first female Judge Advocate General in the Armed Forces of the Philippines (AFP).\n* A group of Chinese female pilots made their first solo flights in the J-10 combat aircraft, becoming the first female air force pilots capable of flying the multirole aircraftthe country's most advanced fighter jet.\n* Rear Adm. Robin Braun became the first female commander of the U.S. Navy Reserve, and the first woman to lead any Reserve component of the U.S. military.\n* Lance-Corporal Jacinda Baker, 26, became New Zealand's first female soldier killed in the war in Afghanistan, and in fact New Zealand's first female soldier killed since the Vietnam War.\n* Sherry-Ann Edwards became the first female fleet chief petty officer in the Trinidad and Tobago Coast Guard.\n* A British soldier, a Fijian national serving as a gunner with the Royal Artillery, gave birth to a boy while serving in Afghanistan. The birth, which occurred in a field hospital, is thought to be the first time a serving member of Britain's military went into labor in a combat zone.\n* Leading Hand Claire Butler, 29, from Middlesbrough, was named the first crew member on the largest warship built for the Royal Navy, the aircraft carrier HMS Queen Elizabeth. Bosses believe the ship, which will have 1,600 crew members when fully operational, will head to Portsmouth in 2017, with flying trials beginning in 2018 and deployment possible two years later.\n* For the first time ever, the Indian Air Force is preparing two of its women pilots for combat roles. Flight Lieutenants Alka Shukla and M P Shumathi were trained at the Yelahanka station in flying twin-engine Mi-8, a utility and medium-size assault helicopter. Both pilots are at their operational units where they will continue with their armament and special heli-operations training.\n* Zoe Briant-Evans, a Royal Navy Officer from Penzance, became the first woman appointed to the post of First Lieutenant at Britannia Royal Naval College (BRNC) in Dartmouth.\n* Mona Abdo became Israel's first female Arab combat commander.\n* Zubaida al-Meeki became the first female officer to quit President Bashar al-Assad's forces to join the Free Syrian Army.\n* Lieutenant Commander Kay Burbidge became the first woman in the Fleet Air Arm to have 3000 flying hours.\n* Lt. Nilofor Rhmani became the first female pilot in the Afghanistan air force to fly solo under the air force's pilot training program.\n* Channing Day, a British servicewoman, became the first woman killed by friendly fire in Afghanistan. She was also the first female soldier from Northern Ireland to be killed in Afghanistan, according to the British army.\n* Commander Sandra Walker became the first woman to take command of a major tanker in New Zealand. It was the 138m replenishment tanker, HMNZS Endeavour.\n* Dalva Maria Carvalho Mendes became the first female two-star rear admiral in the Brazilian Navy.\n* Australia made a parliamentary apology to mainly female victims of sexual and physical abuse in the military and set up a compensation fund after thousands of claims of rape and sexual assault. A report in 2011 detailed more than 1,000 claims of sexual and other forms of abuse in the Australian military.\n* The Royal Australian Navy appointed Capt. Angela Bond as the first female commanding officer of naval base HMAS Stirling near Rockingham.\n* An anonymous woman became the first Orthodox Jewish female combat navigator in Israel.\n*Akissi Kouamé became the first female general in the army of the Ivory Coast.\n2013\n* Pentagon lifts ban on American women in combat.\n* The Syrian government started recruiting female soldiers to perform security checks on veiled women.\n* In an address to her people, a Russian woman appeared in a video announcing her decision of joining the Free Syrian Army.\n* The first female Afghan National Army noncommissioned officers graduated from Regional Military Training Center-West.\n* Captain Jannatul Ferdous became Bangladesh Army's first female paratrooper.\n* Amira al-Aarour became the first Syrian woman to hold a leading post in the Free Syrian Army.\n* An all-female battalion was armed by the Syrian government to back the rule of Bashar al-Assad.\n* In Syria, Women's Protection Units, the first all-female battalion of Kurdish women was created. The battalion is named the Martyr Rokan Battalion. It fought against the regime of Bashar al-Assad and the Islamic State.\n* Eva Lizet Julca Anaya, a 23-year-old native of Peru, became the first foreign female cadet in the history of the Korea Military Academy.\n* Taiwan decided to cancel the 8 percent limit for women serving in its military, as part of efforts to recruit more female soldiers.\n*  Allison Jones, from Coatbridge, North Lanarkshire, became the first woman appointed to fire the Edinburgh's One o'clock Gun at Edinburgh Castle.\n* The Chinese army's first female special warfare unit was officially established in a brigade of the Nanjing Military Region.\n* The Maritime Self-Defense Force of Japan named its first female skippers for destroyers used in training exercises; they were Miho Otani and Ryoko Azuma, who were the first female graduates of the National Defense Academy of Japan.\n*  Capt. Lee Na-kyum and Capt. Oh Hyun-jin became the first all-female crew to fly a C-130 cargo aircraft in the South Korean Air Force.\n* Brigadier Dianne Gallasch was named as the first female commandant of the Royal Military College, Duntroon, in the institution's 102-year history.\n* The first female special operation company of the Army of the Chinese People's Liberation Army (PLAA) carried out the first parachute landing training in an area of North China on 14 May 2013. The 15 participating female special operation members parachuted successfully from 800 meters to 1,000 meters in the air at the first try. The female special operation company was founded in a brigade of the 38th Combined Corps of the Beijing Military Area Command (MAC) of the PLA on 30 March 2013. It is also known that besides the \"August 1\" Aerobatics Team and the airborne force of the PLA Air Force (PLAAF), it is the first time for the PLAA to organize air parachute landing for organic female soldiers.\n* Nilofar Rahmani, the first female pilot of Afghanistan to be trained inside the country earned her flying wing in May after graduating from Undergraduate Pilot Training. She is also the first female pilot to be trained in the Afghan Air Force in more than 30 years.\n* Armenia's Defense Ministry announced that, for the first time, women could be students at the nation's military schools.\n* Norway's parliament voted to conscript women into its armed forces, thus making Norway the first European and first NATO country to make military service compulsory for both genders.\n* 16 female students passed the final evaluation to become fighter-pilots and received their bachelor's degrees at a graduation ceremony in Shijiazhuang Aviation College in North China's Hebei province on 25 June 2013, thus becoming China's first female fighter-pilots.\n* Army. Lieutenant Ganeve Lalji became the first-ever female officer to be posted as the aide-de-camp (French for field assistance) of a top general in the army of India.\n* The first female commanding officer of a helicopter squadron at RAF Shawbury, Becky Frater, started work. The squadron is 705 Naval Air Squadron (NAS), one of the two basic helicopter training squadrons at the Defence Helicopter Flying School (DHFS) at RAF Shawbury.\n* On 5 July, Venezuelan president Nicolás Maduro promoted Carmen Melendez to admiral-in-chief rank and appointed her as the first female minister of defense in the history of Venezuela.\n* Sergeant Sophie Hobson, 35, who is based at RAF Brize Norton, became the first female ground engineer (GE) to work on the Hercules aircraft.\n* Deann Davis became the first female ship rider from the Royal Bahamas Defence Force (RBDF) to accompany a ship with the U.S. Coast Guard.\n* Pakistan's first group of female paratroopers completed their training. Captain Kiran Ashraf was declared the best paratrooper of the batch of 24, the military said, while Captain Sadia, referred to by one name, became the first female officer in the Pakistan military to jump from a MI-17 helicopter.\n* Lieutenant Colonel Bobeth O'Garro was confirmed as the Commandant for the Cayman Islands Cadet Corps, thus becoming the first female Commandant to lead a Corps in the Caribbean region.\n* The Royal Air Force appointed Elaine West as its first ever woman to hold the position of Air Vice-Marshal, and the U.K. military said it would encourage women to aim for high-ranking careers. As Air Vice-Marshal Elaine West had the highest rank a woman in the British military had ever held at the time.\n* For the first time in Myanmar's history, the Ministry of Defense invited women to join the army in jobs other than army nurse. An advertisement in the Myanmar Ahlin newspaper said the new cadets must be single, at least 5 feet, 3 inches (160 centimeters) tall, between 25 and 30 years of age, and weigh no more than 130 pounds (59 kilograms). The ad said successful candidates would be offered commissioned posts, starting as second lieutenants.\n* In a first, a female IDF [Israel Defense Forces] soldier was called up to the Torah during a service on a military base.\n* Private Elise Toft became the first Norwegian woman to be awarded a combat medal since World War II; she was honored for efforts during fighting in Afghanistan in 2011.\n* Luzviminda Camacho became the first female Filipino officer to head a Philippine peacekeeping force.\n* The Israeli Defense Forces announced they will, for the first time, allow a (MTF) transgender woman to serve in the army as a female soldier.\n* Russian war correspondent Elena Milashina was given the International Women of Courage Award for her journalism in Chechnya.\n* All male-only employment categories in the Australian Defence Force were opened to women then serving, with the exception of Special Forces.\n2014\n* Special Forces were opened to women serving with the Australian Defence Force.\n* The Israel Defense Forces appointed Major Oshrat Bacher as Israel's first female combat battalion commander.\n* Dr. Shani became the first female combat doctor in an elite counterterror unit in the Israel Defense Forces (specifically, the Duvdevan counterterrorism unit).\n* The Israel Defense Forces decided to allow female kosher supervisors to work in its kitchens on military bases.\n* The Israel Defense Forces announced the appointment of Or Cohen as their first female Navy captain.\n* Sri Lanka's military admitted its soldiers had abused and tortured women recruits.\n* Myanmar's military appointed its first women representatives to parliament; the two, Lieutenant-Colonel Soe Soe Myint and Lieutenant-Colonel San Thida, were sworn into the lower house of parliament in 2014.\n* Antonette Wemyss-Gorman became the first female commanding officer in the Jamaica Defence Force's Coast Guard.\n* South Korean female soldiers will be able to apply to all combat roles in the Army starting this year, as part of the military's efforts to integrate more women into closed units, the defense ministry said. The Army will allow all female soldiers and noncommissioned officers to apply for artillery and armored units and air defense forces in a bid to lower the gender barrier. The Navy is set to allow female soldiers except in four special forces units, including the Underwater Demolition Team, Underwater Demolition Unit, Ship Salvage Unit and Communications Intelligence Team. The Army Military Academy will also open the door for 20 female cadets next year for the first time since its establishment in 1968. The ministry plans to increase the number of female officers and noncommissioned officers to 7 percent and 5 percent of the total forces, respectively, by 2015.\n* The German Navy appointed Janine Asseln as its first female submarine officer.\n* French Defense Minister Jean-Yves Le Drian presented a report on the problem of sexual assault and sexual harassment in the French military and announced the French military's first effort to fix it. The report cited 86 reported cases of sexual assault or harassment since the start of 2013 alone.\n* French Defense Minister Jean-Yves Le Drian announced that three women would join a nuclear submarine crew by 2017, which would be a first for France.\n* Maxine Stiles, Alexandra Olsson, and Penny Thackray became the first female submariners in the Royal Navy of the United Kingdom.\n* The Chinese People's Liberation Army used women soldiers as honor guards during a diplomatic ceremony for the first time.\n* Over the weekend of 24–25 May, women in the villages of Attagara and Kawuri in Borno state, Nigeria disarmed 10 Boko Haram insurgents who tried to attack their communities, and lynched four of the attackers.\n* Mariam Hassan Salem al-Mansouri became the first Emirati woman to hold the rank of fighter pilot in the United Arab Emirates Air Force.\n* Major General Kristin Lund, from Norway, became the first woman appointed to command a United Nations peacekeeping force. She was appointed as the commander of the UN peacekeeping force in Cyprus.\n* Algeria appointed three women army Generals, making it the Arab country with the biggest number of high-ranking female army commanders at the time. Another female General had previously been appointed by the Algerian President Abdel Aziz Bouteflika in November 2010 as the first general of the Armée Nationale Populaire (ANP) or People's National Army.\n* The Women's League of Burma put out a statement citing the harassment of Chin women activists by authorities for their involvement in protests calling for greater women's rights and an end to sexual violence in Burma as evidence that the Burma Army protects rapists that belong to it.\n* Third Warrant Officer Shirley Ng became the first female Red Lion parachutist to jump at the National Day Parade in Singapore.\n* The Israel Defense Forces Artillery Corps opened its elite unit to female soldiers for the first time. Six female soldiers from last August's draft class passed the physical aptitude tests that allow them to join the elite Moran, Meitar, and Skyrider units, part of the Artillery Corps' David's Sling Formation.\n* 2 November: French war correspondent Ghislaine Dupont is abducted and murdered in Mali.\n* For the first time in more than half a century, a class of women military cadets graduated from Burma's Defense Services Academy.\n* It is reported that about 1/3 of the members of Syrian Kurdish People's Protection Units (YPG), guerrilla offshoots of the Democratic Union Party who fight the Islamic State (IS), are women (Women's Protection Units).\n* During the 2014 Israel–Gaza conflict about 50 Israeli women served inside Gaza, which was the highest number during an Israeli conflict.\n* Two female soldiers in the South Korean army, Staff Sgt. Kim Min Kyoung and Staff Sgt. Kwon Min Zy, earned the American Expert Infantryman Badge, making them the first women, Korean or American, to do so.\n* Colonel Leena Gaurav of the Indian Army's Judge Advocate General's (JAG) branch became the first female officer in India to attain the Colonel rank in a branch of service other than the Army Medical Corps.\n* A Canadian-born immigrant to Israel, Gill Rosenberg, became the first foreign woman to join Kurds battling the Islamic State of Iraq and the Levant.\n* Maj. Gal became the first woman chosen as Israeli Air Force deputy squadron commander.\n* For the first time in India's history, a special squad of women troops was deployed deep inside jungles to undertake active and prolonged operations against Naxalites.\n* In July 2014, Deepika Misra became the first woman pilot ever to join a formation display team in India, when she joined the Indian Air Force's helicopter display team Sarang.\n* In August 2014, Sharon Nesmith became the first woman to command a British Army brigade when she was chosen to command the 1st Signal Brigade.\n* Hsieh Shu-chen became Taiwan's first female Army ranger.\n*Norway established first all-female special forces group called Jegertroppen, Hunter Troop in English.\n2015\n* On 29 January, the first recruit batch of female soldiers passed out after one year training in Bangladesh Army.\n*Êzîdxan Women's Units are formed.\n* Wing Commander Nikki Thomas took charge of the newly reformed No. 12 Squadron RAF at RAF Marham in Norfolk, thus becoming the first woman to command an RAF fast jet squadron.\n* Wing Commander Pooja Thakur became the first woman to lead the ceremonial Guard of Honour at Rashtrapathi Bhavan.\n* For the first time, all-women contingents of air force, army, and navy personnel marched in India's Republic Day parade.\n* Danielle Welch, the first woman to become a Royal Navy \"ab-initio\" Lynx helicopter pilot (\"ab-initio\" meaning she trained from start to finish on the same aircraft) received her wings from Prince Andrew.\n* The Botswana Defence Force recruited its first female privates.\n* North Korea is making military service mandatory for young women in a bid to strengthen the nation's armed forces, sources inside North Korea told DailyNK. The measure is said to apply to women aged between 17 and 20, and has been handed down to mobilization offices in each province, city, and county. \"Unlike men, who have to serve for 10 years, mandatory service for women is only up to the age of 23\", the source said.\n* Gina Reque Terán was officially promoted to general, thus becoming Bolivia's first female army general. She is the daughter of retired general Luis Reque Teran, who led the final operation against Che Guevara.\n* Gina Reque Terán became the first woman in Bolivia's history to assume the post of chief of the Armed Forces High Command; she was sworn in 30 December.\n* Indian Navy Dornier crashed during a night sortie, and Lieutenant Kiran Shekhawat was among those who died there, making her the first female Indian officer to die in the line of duty. Lt Kiran Shekhawat was in combat role as an observer, flying tactical sorties over ocean and for tracking and engaging with hostile ships illegally crossing maritime boundaries.\n* North Korea introduced its first pair of female pilots of supersonic fighters, Jo Kum-hyang and Rim Sol, during a flight drill attended by leader Kim Jong-un, state media reported.\n* Gan Siow Huang became the first female general officer in the Singapore Armed Forces with her promotion to Brigadier-General.\n* Carla Higgins was appointed the first female commanding officer of the Faslane Patrol Boat Squadron, which is in Britain.\n* The British Army appointed Susan Ridge as its first female general. Now-Major General Susan Ridge is Director General Army Legal Services.\n* Fatumah Ahmed became the first female Brigadier of the Kenya Defence Forces.\n* Marise Payne became Australia's first female defense minister.\n* Lieutenant Ouma Laouali became Niger's first female pilot; she was one of the Nigerien Airforce members trained by the United States as part of a program to help fight the Islamist terrorist group Boko Haram.\n* Mariam Mukhtar became Pakistan's first female fighter pilot to die in the line of duty.\n* The Bolivian Air Force's first military pilot completed her solo-flight in August 2015.\n* The Royal Military Academy Sandhurst appointed Lucy Giles as the first female college commander in its history.\n*  The Air Force of Zimbabwe promoted Ellen Chiweshe to Air Commodore, the third highest rank in Zimbabwe's air force; this made her the first female Air Commodore in the Air Force of Zimbabwe and its highest ranking woman.\n* Lee Hyun-ok was promoted to major general, which was the first time a female ethnic Korean became a general officer in the Chinese People's Liberation Army.\n*Japan's Air Self Defense Forces authorized women to operate fighter jets and reconnaissance aircraft November 2015.\n* The Êzîdxan Women's Units is a Yazidi all-women militia formed in Iraq in 2015 to protect the Yazidi community in the wake of attacks by the Islamic State of Iraq and the Levant and other Islamist groups that view Yazidis as pagan infidels.\n2016\n* Capt. Kate Alfin, a Black Hawk Pilot with the 12th Combat Aviation Brigade, Ansbach Germany, graduated from the Allied Winter Course at the Norwegian School of Winter Warfare; she was the first female Soldier from an allied NATO military to complete the course.\n* The president of India announced that women will be allowed to occupy combat roles in all sections of India's army, navy and air force.\n* The Bangladesh Army deployed a contingent under the lead of a female officer (Lt. Col. Nazma Begum) for the first time ever in the UN peacekeeping mission in Ivory Coast.\n* Constance Ama Emefa Edjeani-Afenu became the Ghana Armed Forces' first female brigadier general.\n* Trooper Sara Spokes joined the 12th/16th Hunter River Lancers as the first female cavalry scout in the Australian armoured corps.\n* The Royal Thai Air Force started recruiting female pilots for the first time in its history, and Suwattana Chanthalert became the first woman to apply for a job as a pilot in the Royal Thai Air Force. Later in the same year, Karnchanok Janyarak, Peerasri Jalpaisarn, Chanakarn Sornjarn, Sireethorn Lawansatian and Chonnisa Supawannapong became the first women pilot trainees in the Royal Thai Air Force.\n* Miho Otani became Japan's first female captain of a destroyer.\n* Queen Elizabeth II became the longest serving Captain-General of the Honourable Artillery Company, with 64 years of service.\n* Jennie Carignan became Canada's first female combat officer to rise to the rank of general. Specifically, she was promoted to brigadier-general (one star) and put in charge of the Canadian army's day-to-day operations.\n* India's first women fighter pilots – Bhawana Kanth, Avani Chaturvedi and Mohana Singh Jitarwal – were commissioned in the Indian Air Force.\n* Maureen O'Brien became the first female to be promoted to the rank of Colonel with the Irish Defence Forces.\n* A ban on women serving in close combat roles in the British military was lifted by Prime Minister David Cameron.\n* Turkey appointed Esra Özatay as its first female air force wing commander; she took over the command of the 134th Squadron of the Turkish Air Force.\n* A transgender woman who was a soldier in the British army, Chloe Allen, became the first female to serve on the British army frontline.\n* Karyn Thompson became the first female commander at Waiouru Military Camp, which makes her the first such at any New Zealand army camp.\n* Male Israeli soldiers can request not to serve alongside women and to be excused from any military event that goes against their beliefs, according to a directive published in 2016. Such soldiers can now request not to serve with women nor share living spaces. Formal events, such as Independence Day and Memorial Day ceremonies, Holocaust Remembrance Day, services for fallen soldiers and Yitzhak Rabin's memorial day, will still be required and more difficult for soldiers to get out of, according to the directive. Other events, such as cultural or educational ones, including where females sing in front of men, will be at the discretion of the unit's commander, according to the directive.\n* Albania's Defense Ministry stated that Manushaqe Shehu was given the title of Brigadier General from 1 December 2016, which makes her the first female army general in Albania.\n* Indian Merchant Navy Captain Radhika Menon became the first woman to receive the International Maritime Organisation Award for Exceptional Bravery at Sea.\n* The Republic of Korea Army (RoKA) announced on 5 December that it had appointed its first ever female helicopter pilot instructor, Jung Eun-hee.\n* In 2016, Armed Forces of Ukraine Vitaliy Golota issued a decree of the Ministry of Defense No. 337 in revolutionary amendments to allow women to hold positions as snipers, intelligence officers, and commanders of military hardware.\n* Jang Se-jin became the first woman in the South Korean Air Force to become a group captain.\n* Alleged terrorist Allison Ekren allegedly became leader of an Islamic State unit called \"Khatiba Nusaybah\" in the Syrian city of Raqqa in late 2016. The all-female unit was trained in the use of AK-47 rifles, grenades and suicide belts.\n* Lone Træholt became the first female general in Denmark.\n2017\n* Jang Se-jin became the first woman in the South Korean Air Force to win the grand prize in the airdrop category at the Boramae Midair Shooting Competition.\n* Proscovia Nalweyiso became the first female Major-General in the Uganda People's Defence Forces (UPDF); this also made her the first woman soldier to hold such a rank in East Africa.\n* Nibal Madhat Badr became the first woman to assume the rank of Brigadier General in the Syrian Armed Forces.\n* Norway announced its first-ever appointment of a woman (Tonje Skinnarland) to head its air force.\n* A ban on female army officers in Turkey wearing the Muslim headscarf was lifted by the government. The new rules apply to regular women military officers, non-commissioned officers and female cadets. They are allowed to wear a headscarf under their caps or berets as long as they are the same color as their uniforms and are not patterned.\n* While conscription has not been abolished in the Netherlands, compulsory attendance has. Since 25 February 2017, women will also be conscripted in the Dutch Armed Forces.\n* Sweden instituted a military draft for both men and women.\n* Julie-Anne Wood became the first female Maritime & Coastguard Agency's Head of Maritime Operations in Her Majesty's Coastguard. In 2014 she temporarily covered the role of Head of Maritime Operations, and in January 2017, she was appointed to the position permanently. Being in this position made her the highest ranked woman in Her Majesty's Coastguard.\n* Czech President Milos Zeman promoted Lenka Smerdova to the rank of general, making her the first woman with the rank of general in the country's history.\n*The Czech Republic does not have women in close combat positions. The Minister of Defense in the Czech Republic passed guidelines enforcing equal opportunities in the Czech Armed Force, however it does not imply women in combat. Consequently, women are taken out of units where there's combat expected.\n* Lisa Hunn became the first woman to assume command of a New Zealand Navy frigate (the frigate HMNZS Te Mana).\n* Lorna Gray was appointed as the first female commanding officer of an RNZN offshore patrol vessel (HMNZS Otago).\n* Catherine Bowa became the first female aircraft engineer in the Papua New Guinea Defence Force.\n* The appointment of Captain (Navy) Geneviève Bernatchez as the fifteenth (and first female) Judge Advocate General (JAG) of the Canadian Forces was announced.\n* A Canadian soldier, Megan Couto, became the first female infantry officer to command troops guarding Queen Elizabeth II at Buckingham Palace.\n* Fatma Boudouani was promoted to Major-General, making her Algeria's first female to reach this top rank at the National People's Army.\n* Brenda Tinsley became the first female commander of a squadron at 22 Wing/Canadian Forces Base North Bay; specifically, she became the commander of 51 Aerospace Control and Warning (Operational Training) Squadron.\n* The Royal Air Force of Britain's ground-fighting force became open to women for the first time, making the Royal Air Force the first branch of the British military to open every role to female service personnel.\n* Rohana Jupri became the first woman in the history of the Royal Malaysian Navy to be appointed captain.\n* 13 Israeli women graduated the Israeli army's combat tank operators 5 December 2017, becoming the first females to do so.\n*  Jette Albinus became the first woman in the Royal Danish Army to hold the rank of general.\n2018\n* As of January 2018, Uruguay implemented an all-female M-24 tank crew in the Uruguayan National Army's Armored Infantry Battalion No. 13. The team is complete with 15 soldiers and four M-24s under the command of Second Lieutenant María Eugenia García.\n*Avani Chaturvedi became the first female pilot of the Indian Air Force to complete a solo flight in a MiG-21 Bison fighter aircraft.\n* Saudi Arabia allowed women to join its military for the first time.\n* Japan's navy appointed its first woman to command a warship squadron, Ryoko Azuma.\n* Amisah Kuiming, a Royal Malaysian Navy officer, became the first woman from rank and file to receive the Royal Malaysian Navy's Sailor of the Year award.\n* Phetogo Molawa became the first woman and the first black person to take command of a South African Airforce (SAAF) installation. Specifically, she became the new commanding officer of the SAAF base in Port Elizabeth.\n* For the first time in Israel Defense Forces history, four female soldiers, including a new immigrant from England, became tank commanders; they were the Israel Defense Forces' first female tank commanders.\n* Fatumah Ahmed became the first female Major General in the Kenya Defence Forces.\n* Sereima Naiqovu became the Fiji Navy's first female Commander-of-the-Day.\n* A woman was named the first female pilot to command an Israel Air Force flight squadron.\n* Janneke Olthuis became the first woman to top a New Zealand Defence Force survival course known as the Aumangea programme.\n* Misa Matsushima became Japan's first female fighter pilot.\n* Esita Batiniqila became the first female officer in the Republic of Fiji Military Forces Navy arm to be offered a scholarship to pursue further studies overseas.\n* The Bangladesh Army obtained its first female major general, Dr Susane Giti.\n* Liudmyla Shugaley was named general and appointed the head of the Military Medical Directorate of the Security Service of Ukraine. Because of this, she became the first woman to have been awarded the title of Major General in Ukraine's history.\n* It was announced that women were allowed to apply for all roles in the British military, including the Royal Armoured Corps.\n* Alenka Ermenc became the first woman to be promoted to the rank of Major general in the Slovenian Armed Forces.\n* Alenka Ermenc became Chief of the General Staff, which made her the first woman to hold that position in Slovenia and in NATO.\n* Peruvian Army officers Lourdes Aurelia Barriga Abarca and María Magdalena Dibós Mori became the first female colonels in the Peruvian Army in October 2018.\n* On 25 October 2018, the United Kingdom opened combat roles for women. Women currently serving at the time were eligible to transfer to infantry roles within the British Army, and recruits were made able to apply for infantry after 21 December 2018.\n* Japan's Maritime Self-Defense Force ended a ban on women on Japan's submarines.\n* Sulochana Poudel became the first woman officer in the Nepali Army to enlist in S.N. 25 Army Command and Staff Course.\n2019\n* Switzerland's first female fighter pilot was admitted officially into the Swiss Air Force 1 January 2019. Fanny \"Shotty\" Chollet is the first woman to be allowed to fly at F/A 18 outside of the United States military.\n*The Indian Air Force inducted Flight Lieutenant Hina Jaiswal as its first woman flight engineer.\n* For the first time, a female soldier completed infantry training in the British army.\n* Joselyn Bandarlipe became the first female officer to lead a brigade in the Philippine Army.\n* Bhawana Kanth became the first female pilot in the Indian Air Force to qualify to undertake combat missions in a fighter jet.\n* Three female officers of the Indian Air Force became India's first all-female crew to fly a medium lift helicopter.\n* Mohana Singh became the first woman fighter pilot in India to become fully operational by day on a Hawk advanced jet aircraft.\n* Minty Agarwal became the first woman in India's military history awarded the Yudh Seva Medal.\n* The Supreme Court of India granted women officers the legal right to be considered for permanent commissions for a long tenure with the Indian Air Force.\n* Shaliza Dhami became the first female officer to be given a permanent commission for a long tenure with the Indian Air Force.\n* Shaliza Dhami became the first female flight commander in India.\n* Anjali Singh became the first female Indian Air Force Officer to be posted as a military diplomat at an Indian Mission abroad.\n* Lt.-Col. G (her full name not given) became commander of the 122 squadron, the Israel Air Force's intelligence unit based out of the Nevatim Airbase in the South, which made her the first woman to lead an Israel Air Force squadron.\n* Melissa Ross became the first woman to achieve the rank of Commodore in the Royal New Zealand Navy.\n* Jang Se-jin became the first female battalion commander in South Korea.\n* The changing of the guards at the State House gates in Fiji included for the first time female guards from the military.\n* Kang Sun-young was promoted to become South Korea's first female two-star general.\n* Marie-Herene Maillet became the first female Canadian Armed Forces member to earn a perfect score on the annual FORCE Test.\n2020\n* Zeina Akar became the first female defence minister in Lebanon and the Arab world.\n* Risa Takenouchi became the first female student admitted to Japan's national naval submarine academy.\n* Yasmin Williams became the first female to pass out of the Infantry Training Centre with the Welsh Guards.\n* Rosie Wild became the first woman in the British Army to pass the All Arms Pre-Parachute Selection (AAPPS).\n* Janet Laurena became the first woman in the history of the Philippine Army to be appointed commander of the 1st Infantry Division.\n* India's Supreme Court ruled that the government must grant permanent commission and command positions to women military officers equally with men military officers.\n* Ruchi Sharma became the first female operational paratrooper in the Indian Army.\n* Georgia Sandover became the first woman to join the Royal Air Force Regiment.\n*Women in the Mexican Drug War served with and/or were harmed by all belligerents.\n* Ajeng Tresna Dwi Wijayanti became the first female fighter pilot in the Indonesian military.\n* Dewa Ayu Ardikna Suari was named by the Indonesian Air Force as its first female loadmaster.\n* Nigar Johar became the first female lieutenant general in the Pakistan Army.\n* Tahlia Britton became the Irish Navy's first female diver.\n* Roberta O'Brien became the first woman in the Irish Navy to achieve the rank of Commander.\n* Nigerian Air Force Flying Officer OO Oke became the first female pilot to fly solo on the L-39ZA in the history of 403 Flying Training School Kano.\n* The Dominican Republic's Air Force (FARD) announced the first woman in the Dominican Republic's aeronautical history to command a flight operations squadron: Lt. Col. Lee Geady Mateo Ramírez commanding the Air Transport Squadron of the FARD.\n* The first women in Japan became certified to serve as crew members aboard a Maritime Self-Defense Force submarine.\n* For the first time in the history of the Sri Lanka Air Force women became pilots; the women were Pilot Officer ADPL Gunarathe and Pilot Officer RT Weerawardana.\n* The Serbian Army inducted Ana Perisic as their first woman attack aircraft pilot.\n* LeeAnn Tucker became the first female soldier from the Royal Bermuda Regiment to complete the Sandhurst officers' course.\n* Patricia O’Sullivan became the first woman in the history of the Irish Naval Service to achieve the rank of Chief Petty Officer.\n* The Royal Malaysian Navy made Rohana Jupri its first woman to be promoted to First Admiral.\n* Lt. O (rest of name not given), from Boston, became Israel's first American female Air Force pilot.\n2021\n* Sharon Nesmith became the first woman to command a British division-level formation in 2021.\n* Yvonne Huynh was killed by a roadside bomb, making her the first woman from the French military to die in Mali.\n* Radhika Thapa became the first female soldier in the Nepali Army to have completed the Counter Insurgency and Jungle Warfare (CIJW) course.\n* Lt.-Gen Frances Allen became the first woman appointed as the Canadian military's vice-chief of defence staff.\n* Brig.-Gen. Lise Bourgon was named as the Royal Military College's first female commandant.\n* Women began to be allowed to join Saudi Arabia's military.\n* In Israel, Brig-General (Reserve) Rachel Tevet-Wiesel became the first woman appointed to the role of Soldiers' Complaints Commissioner.\n* Erika Raballo became the first female strike fighter pilot in the Italian Navy.\n* Major-General Thalita Mxakato was appointed as Chief of Defence Intelligence in the SANDF, making her the first woman to be appointed to the Military Command of the SANDF.\n* Women in the Ghor Province of Afghanistan were reported to have begun taking up arms against the Taliban.\n* The Indonesian army ended virginity tests on female cadets.\n* Indian Army got first batch of female soldiers.\n2022\n* In March, Bolor Ganbold was commissioned as Mongolia's first female brigadier general.\n* It was announced in April 2022 that Sharon Nesmith would be the next Deputy Chief of the General Staff, and would thus become the first woman to hold the rank of lieutenant general in the British Army. In August 2022, she took up the role of Deputy Chief of the General Staff and was promoted to lieutenant general.\n* Antonette Wemyss-Gorman became the first female chief of staff of the Jamaica Defence Force.\n* Women made up 10% of Ukrainian forces.\n* Abhilasha Barak became the Indian Army's first female combat aviator.\n* Reut Rettig-Weiss became the first female Israel Defense Forces Brigade Commander in a combat unit.\n* Anastasia Savitskaya is believed to have become in 2022 the first Russian female soldier killed in Russia's invasion of Ukraine.\n* Naama Rosen-Greenberg of the Israel Defense Forces was appointed as the first woman to serve as the military aide to the president of Israel.\n* Türkiye's Official Gazette stated that Özlem Yılmaz had been appointed as the first female general of the Turkish army.\n* Addy Carter of Hereford became the first female enlisted soldier to pass the Parachute Regiment’s P Company course.\n* In October, Allison Ekren was sentenced in the Eastern District of Virginia to 20 years in prison for organizing and leading an all-female military battalion in Syria on behalf of ISIS.\n* Vanesa Pía became the first military woman from Argentina to command a unit in Antarctica, as commander of the permanent Antarctic Base Carlini.\n2023\n* Avani Chaturvedi became the first woman fighter pilot of the Indian Air Force to take part in an aerial wargame abroad, which she did in Japan.\n* The Islamic Republic of Iran Armed Forces allowed women to join for the first time since the White Revolution.\n* Indian Air Force got the first batch of women agniveers.\n2024\n* Fatumah Ahmed became the first female commander of Kenya's air force, which also made her the first woman to lead one of Kenya's military services.\n* Anamika Rajeev became the Indian Navy's first woman helicopter pilot.\n* The Armed Forces of Bosnia and Herzegovina obtained a female military representative (Major Jasmina Omerbegovic) for the first time.\n* The Republic of Fiji Military Forces Engineers Regiment 1/24 Trade Training School graduation included that school’s first female graduate.\n* Sadhna Saxena Nair became the first woman appointed to the position of Director General Medical Services (Army) in India.\n* Micheline Bertrand became the first female chief warrant officer (CWO) at 2 Canadian Forces Flight Training School.\n* Lt. Jg. Mun Hee-woo became the South Korean Navy’s first female deep sea diver.\n* On 10 August 2024, in the Indian Navy's training center INS Chilka, 1389 agniveers passed out after completion of basic military training, among them 214 were women; Vinay Maruti Kadam received the 'Chief of Naval Staff Rolling Trophy' and Sanjana received 'Gold Medal', Sakshi Mohan Mirje was awarded with the 'Gen Bipin Rawat Rolling Trophy'.\n* Arti Sarin was appointed Director General Armed Forces Medical Services (DGAFMS), the senior-most appointment of the Armed Forces Medical Services, on 1 October 2024; this made her the first woman to serve as DGAFMS and the highest-ranking woman officer in the history of the Indian Armed Forces.\nSee also\n* Women in warfare and the military (1900–1945)\n* Women in warfare and the military (1945–1999)\nReferences\nFurther reading\n* Baaz, Maria Eriksson, and Maria Stern. \"Fearless fighters and submissive wives: negotiating identity among women soldiers in the Congo (DRC).\" Armed forces & society 39.4 (2013): 711–739. [https://www.researchgate.net/profile/Maria-Stern-2/publication/270727814_Fearless_Fighters_and_Submissive_Wives_Negotiating_Identity_among_Women_Soldiers_in_the_Congo_DRC/links/581346b408aeffbed6bc1c88/Fearless-Fighters-and-Submissive-Wives-Negotiating-Identity-among-Women-Soldiers-in-the-Congo-DRC.pdf online]\n* Bumiller, Elisabeth, & Tom Shanker,  (2013). \"Pentagon is set to lift combat ban for women' New York Times Jan 24, 2011 [https://www.nytimes.com/2013/01/24/us/pentagon-says-it-is-lifting-ban-on-women-in-combat.html?_r1⁄40 online]\n* Campbell, DAnn, and Karen Hagemann. \"Post-1945 Western Militaries, Female Soldiers and Gay and Lesbian Rights\" in The Oxford Handbook of Gender, War, and the Western World since 1600 (2020).\n* Carreiras, Helena. Gender and the military: Women in the armed forces of western democracies (Routledge, 2006). [https://www.taylorfrancis.com/books/mono/10.4324/9780203969038/gender-military-helena-carreiras online]\n* Fitriani, R., & Matthews, R. \"Women in ground close combat\" The RUSI Journal (2016). , 161(1), 14–24.\n* Karim, Sabrina, and Kyle Beardsley. Equal opportunity peacekeeping: women, peace, and security in post-conflict states (Oxford University Press, 2017).\n* Patten, Eileen, and Kim Parker. Women in the US military: Growing share, distinctive profile (Washington, DC: Pew Research Center, 2011). [https://www.givingtogether.org/resources/Events/Education%20Event%20Veterans%20Handouts/Pew%20Survey%20of%20Women%20Veterans%20December%202011.pdf online]\n* Pawelczyk, J. \"It wasn’t because a woman couldn’t do a man’s job: Uncovering gender ideologies in the context of interviews with American female and male war veterans\" Gender and Language (2017) 11(1), 121–150\n* Persson, Alma, and Fia Sundevall. \"Conscripting women: gender, soldiering, and military service in Sweden 1965–2018.\" ''Women's history review 28.7 (2019): 1039–1056. [https://www.tandfonline.com/doi/pdf/10.1080/09612025.2019.1596542 online]\n* Reis, João, et al. \"The obstacles women face in gaining access to special operations forces.\" in Developments and Advances in Defense and Security: Proceedings of MICRADS 2019 (Springer Singapore, 2020) [https://comum.rcaap.pt/bitstream/10400.26/28962/1/The%20Obstacles%20Women%20Face%20in%20Gaining%20Access%20to%20Special%20Operations%20Forces.pdf online].\n* Reis, João, and Sofia Menezes. \"Gender inequalities in the military service: a systematic literature review.\" Sexuality & Culture 24.3 (2020): 1004–1018. [https://comum.rcaap.pt/bitstream/10400.26/36406/1/10.1007s12119-019-09662-y.pdf online]\n* Stiehm, Judith, ed. It's our military too: women and the US Military'' (Temple University Press, 2009).\nExternal links\n*"
    }
  ]
}