{
  "content": [
    {
      "type": "text",
      "text": "# Women in the war in Donbas__disambig_1\n\nWomen in the war in Donbas have taken on many different roles, both in the military and as civilians. The role of women in the war in Donbas, a conflict that evolved into part of the broader Russo-Ukrainian War, has been significant and multifaceted. Ukrainian women have contributed not only as combatants but also as medics, volunteers, logisticians, and leaders in community support efforts. Their growing participation has challenged long-standing gender norms and reshaped the Ukrainian military landscape.\nWomen in the military\n-1 anti-aircraft gun in the Aidar Battalion, Luhansk Oblast, August 2014]]\nThe war has seen a significant increase in the number of women serving in the Ukrainian military, with several positions that had been reserved for men only being opened up to women. By 2016, 8.5 percent of the Ukrainian military were women and by March 2021, the percentage of women in the Armed Forces had risen to 22.8 percent, 15.5% of them described by the Ukrainian Ministry of Defence as \"service-personnel\".\nThe Ukrainian Center for Drone Intelligence, which builds drones for the Ukrainian army and provides training courses for drone warfare, was founded by Maria Berlinska, who had volunteered to serve on the front after graduating from university.\nA number of women soldiers have achieved high levels of public prominence during the war. Nadiya Savchenko, a fighter pilot who volunteered for the Aidar Battalion after her regular battalion was not deployed to the front, was named a Hero of Ukraine and elected to the Ukrainian Parliament after being captured by the Luhansk People's Republic.\nWomen have also featured in military propaganda in the war. In May 2014, Donetsk People's Republic Defence Minister Igor Girkin posted an online video calling for recruits, stating that \"if men are not capable of this, we will have to call on women.\" In March 2015, on International Women's Day, the DNR held a propaganda beauty pageant featuring all female soldiers.\nIn their 2019 book Insurgent Women: Female Combatants in Civil Wars authors Darden, Henshaw and Szekely, while confirming the combat role of women in several Ukrainian and pro-Russian armed forces and militias as medics, drivers, sentries or on patrol, say that their participation in the first line of action, particularly as snipers, has been usually overstated by the media, or at least hard to verify. They distinguish female combatants by their motivation to become involved in the war. On the Ukrainian side, women were strongly moved by Ukrainian nationalism, while their pro-Russian counterpart fought for more personal reasons, like defending their families or homes. According to these authors, Ukrainian female soldiers actively chose \"to go to the front. Those on the separatist side feel that the front came to them\".\nWomen have played vital roles in Ukraine’s Armed Forces since the start of the war in Donbas. While initially barred from combat positions, many women joined volunteer battalions and served unofficially on the frontlines. These women took on roles as snipers, medics, artillery operators, and infantry soldiers, despite not being formally recognized in such positions at the time.\nBy 2023, official data from the Ministry of Defence of Ukraine reported that over 68,000 women were serving in the Armed Forces, with around 5,000 in commanding positions. This growing presence is partly the result of activism and public pressure sparked by projects such as Invisible Battalion, which highlighted the discrepancy between women’s contributions and their formal recognition in the military structure.\nDiscrimination\nWomen in the Ukrainian military still face significant levels of discrimination and stigma, both formally, still being barred from a number of positions and with provisions like proper uniforms and maternity leave still lacking, and from their fellow soldiers. Harassment and sexual violence against female soldiers is common and rarely reported or investigated.\nOne female soldier recounted some of the discrimination she faced to Hromadske.TV: \"I liberated 11 cities, I was involved in prisoner releases, but, nonetheless, most people would say that I am a “Carpathian, who fought in the first months of her pregnancy,” without taking my military experience into account.\" According to the Atlantic Council: Women served in both the Ukrainian military and volunteer battalions. In the process, they experienced sexual harassment on the frontlines and faced sexual discrimination upon their return home. Many women soldiers were criticized for leaving their children and families to serve, stereotyped as sexually promiscuous, or even investigated by social services and had their children taken away. The discrimination is often so bad that women veterans will not wear uniforms. Women are encouraged to ignore their trauma. As one female volunteer put it, “Men go to the pubs with other men, but women must get back to their jobs and take care of their children.”\nIn July 2021, the Ukrainian military faced criticism after it announced that women soldiers would be marching in high heels in the parade marking 30 years of independence. The Ukrainian Ministry of Defense stated that the military's 2017 dress code included high heels.\nCivilians Roles and Social Contributions\nWomen civilians, especially in the areas where the conflict has been most intense, have faced a range of issues. The issues facing civilians in the conflict have sometimes been overlooked by the media, with journalist Alisa Sopova stating that \"Some journalists who come to Ukraine in search of military action often leave disappointed, overlooking the experiences of civilians because the war is simply not dynamic or thrilling enough to follow.\"\nWomen internal refugees have faced issues, especially as they are often left alone to take care of children, along with other discrimination against refugees, such as lack of accommodations for disabilities and accusations that refugees from Donetsk harbour pro-separatist sentiments.\nRoma women have faced particular levels of discrimination, often being refused internally displaced status and facing intense racism. A 2017 UN Women audit of the city of Kramatorsk found \"limited or no awareness among local service providers about the needs of women with disabilities.\" The conflict has also seen education in some areas disrupted and the growth of patriotic youth organizations that train children in combat and survival skills.\nIn December 2020, the United Nations in Ukraine launched an initiative to increase the participation of women in peace processes in the country.\nWomen’s involvement in the Donbas conflict extended beyond military roles. Throughout the war, women coordinated medical aid, organized evacuations, supported internally displaced persons, and helped maintain essential infrastructure. During later stages of the war, particularly following Russia’s full-scale invasion in 2022, women also took on leadership roles in community recovery, civil society organizing, and volunteer coordination efforts.\nThese contributions highlight a broader understanding of what it means to be “on the front line”, encompassing not just those in uniform but also those supporting societal resilience in wartime.\nThe Invisible Battalion Project\nThe Invisible Battalion project, launched in 2016, was one of the first comprehensive efforts to document and publicize the experience of women on the front lines of the Donbas war. Conducted with support from UN Women, the project featured interviews, case studies, and sociological analysis revealing how women performed combat tasks while being officially classified in support roles.\nIn 2019, a second phase of the project, Invisible Battalion 2.0, explored the experiences of women veterans returning to civilian life. It found that many faced reintegration challenges, including inadequate mental health care, economic insecurity, and social stigma. The research called for policy changes to address these gaps and support women’s transition from soldier to civilian.\nRecognition and Policy Reform\nThe influence of women’s active participation, along with research from organizations like UN Women and NATO, has led to several policy reforms. Ukraine expanded the list of military positions available to women, provided maternity and childcare support for service members, and adopted the Women, Peace and Security agenda outlined by the United Nations.\nInternational actors, including the NATO Parliamentary Assembly, recognised Ukraine’s progress while also noting ongoing challenges such as gender-based discrimination, lack of protective equipment tailored to women, and unequal career advancement opportunities within the armed forces.\nHuman rights abuses\nViolence against women, both civilian and military, has been a significant issue in the conflict, with rates of rape and domestic abuse being widespread. In 2014, the rate of sexual violence had almost doubled compared to 2007.\nIn 2015 the Office of the United Nations High Commissioner for Human Rights expressed a deep concern about rapidly worsening situation with violence against women in Ukraine. A 2020 report from Amnesty International found that \"gender-based violence is aggravated and intensified for those living in the conflict-affected Donetsk and Luhansk regions of eastern Ukraine,\" with women facing sexual harassment at military checkpoints and in detention, military and police personnel being exempt from Administrative Code provisions against domestic violence, women being discouraged from filing official reports and complaints of violence against them, and a lack of means to secure financial independence among women.\nIssues of violence and discrimination against women have been exacerbated by the increase in local far-right extremist groups during the war. The COVID-19 pandemic in Ukraine has also exacerbated violence against women, with calls to domestic violence helplines increasing by 50% in the war zone in 2020.\nIn the city of Donetsk, a prison named \"Izoliatsiia\" (Isolation) was set up in a former factory and art hub and has served as a concentration camp and torture site. Three of the eight cells in the prison were reserved for women, with women prisoners often being forced to clean up the torture rooms in addition to being tortured and raped.\nIn July 2021, Human Rights Watch reported that several women, including one who was pregnant, had been arrested in the Donetsk People's Republic on charges of espionage and had been deprived of appropriate healthcare, stating that \"the torture and other ill-treatment by armed groups is epitomized by their cruel treatment of women in custody.\"\nMobilization and Contemporary Challenges\nAs the war has intensified, especially following Russia’s full-scale invasion in 2022, Ukraine has faced growing pressure to expand its mobilisation pool. Public and political debates have increasingly focused on whether women should be subject to conscription, especially given their demonstrated commitment and capability in combat and support roles. While many women have voluntarily enlisted, the question of mandatory mobilization remains controversial, intersecting with broader conversations about gender equality, military necessity, and traditional gender roles.\nAt the same time, women serving in the Armed Forces continue to face systemic challenges, including inadequate access to properly fitted equipment, limited mental health resources, and persistent gender-based discrimination. Instances of harassment, unequal opportunities for promotion, and social stigma, particularly for mothers or returning veterans, further complicate their military careers and reintegration into civilian life. Although reforms have expanded the number of roles available to women and increased official recognition of their service, advocates and experts emphasise the need for deeper institutional and cultural change to ensure lasting gender equity in Ukraine’s defence sector.\nWomen's organisations\nA number of civil society organisations have been founded by women during the conflict, both centered on women's issues and on broader issues. Slavic Heart was founded by internally displaced women in Sviatohirsk in 2014 as a humanitarian support network.\nIn 2015, the Invisible Battalion was launched to advocate for gender equality in the Armed Forces of Ukraine after a study found that the majority of women who served in the war in Donbas were not enlisted officially and subsequently had no access to social or military benefits, military awards, social status, or career opportunities in the Armed Forces.\nThe Ukrainian Women Veteran Movement was also formed during the war to advocate for women veterans in Ukraine. During the COVID-19 pandemic in Ukraine, the group led a study on the pandemic's effects on women's veterans, with Yulia Kyrylova stating that they had \"found that 14 per cent of [women veterans] have lost their jobs during the quarantine, and 53 per cent of veterans reported a significant decrease in income during that time.\" The Union of Participants and Veterans of the Anti-Terrorist Operation was also founded by three women, who had each participated in the Maidan protests and who had worked as truck drivers to bring military equipment to the frontlines.\nPublic Perception and Media Representation\nIn 2019, the short film Anna was shortlisted in the BAFTA's British Short Film category and won the Best British Short category of 2019 British Independent Film Awards.\nThe increased presence of women in the military has slowly reshaped public perceptions of gender roles. Media outlets like BBC and Al Jazeera have profiled female soldiers, emphasizing their resilience and multifaceted roles as mothers, workers, and fighters. However, stereotypes persist, and female soldiers often face scrutiny or dismissal, especially when returning to civilian life.\nSee also\n* Women in Ukraine\n* Violence against women in Ukraine\n* Humanitarian situation during the war in Donbas\n* Women in the Russian invasion of Ukraine\nReferences\n*"
    }
  ]
}