{
  "content": [
    {
      "type": "text",
      "text": "# Women's Legal Centre Trust v President\n\n| image =\n| imagesize =\n| imagelink =\n| imagealt =\n| caption =\n| full name = Women's Legal Trust v President of the Republic of South Africa and Others\n| citations = ; 2009 (6) SA 94 (CC)\n| transcripts =\n| appealed to =\n| subsequent_actions = ''Women's Legal Centre Trust v President of the Republic of South Africa and Others''\n| related actions =\n| opinions =\n| judges = Langa CJ, Moseneke DCJ, Cameron J, Mokgoro J, Ngcobo J, Nkabinde J, O'Regan J, Sachs J, Skweyiya J and Yacoob J\n| number of judges = 10\n| decision by = Cameron J (unanimous)\n| keywords =\n| italic title =\n| docket = CCT 13/09\n| subsequent actions =\n}}'Women's Legal Centre Trust v President of the Republic of South Africa and Others' is a 2009 decision of the Constitutional Court of South Africa. The court dismissed an application for direct access lodged by the Women's Legal Centre, which sought an order directing the President and Parliament to pass legislation to provide for the recognition of Muslim marriages. The court did not express a view on the merits of the dispute but instead held that the application did not engage its exclusive jurisdiction in terms of section 167 of the Constitution. Justice Edwin Cameron delivered judgment on behalf of a unanimous court on 22 July 2009.\nApplication\nThe non-profit Women's Legal Centre applied for an order declaring that the President and Parliament had failed to fulfil their constitutional obligation to prepare legislation \"providing for the recognition of all Muslim marriages as valid marriages for all purposes in South Africa and regulating the consequences of such recognition\". The Centre contended that this failure violated various provisions of the Bill of Rights. It did not pursue litigation in the lower courts, but instead applied for direct access to the Constitutional Court of South Africa.\nThe Women's Legal Centre contended that its application met the criteria for direct access as set out in section 167 of the Constitution. First, it sought a declaration that Parliament and the President had failed to fulfil a constitutional obligation; under section 167(e), such a determination engaged the Constitutional Court's exclusive jurisdiction. Alternatively, and in any case, direct access would in the circumstances be in the interests of justice, and section 167(6)(a) provided that:National legislation or the rules of the Constitutional Court must allow a person, when it is in the interests of justice and with leave of the Constitutional Court, to bring a matter directly to the Constitutional Court.The Constitutional Court heard the application in May 2009, and it handed down judgment on 22 July 2009.\nJudgment\nIn a unanimous judgment written by Justice Edwin Cameron, the Constitutional Court dismissed the application for direct access. It therefore did not consider or comment on the merits of the application in respect of any constitutional imperative to recognise Muslim marriages. Instead, it found that the application was \"incorrectly conceived\" and that it should instead be lodged in the first instance in the High Court of South Africa and, contingent on an appeal, in the intermediate Supreme Court of Appeal.\nThe court did not accept the argument that the application engaged its exclusive jurisdiction. Section 167(4)(e) had an \"agent-specific focus\" and referred specifically to constitutional obligations of the President and Parliament. By contrast, though it named the President and Parliament in its application, the Women's Legal Centre sought relief from a far broader range of actors: it was \"the state\", not the President and Parliament alone, whom section 7(2) of the Constitution obliged to \"respect, protect, promote and fulfil the rights in the Bill of Rights\". Thus, per Cameron, \"the obligation to enact legislation to fulfil the rights in the Bill of Rights falls upon the national executive, organs of state, Chapter 9 institutions, Parliament and the President. The obligation does not fall on the President and Parliament alone.\" Cameron concluded of section 167(4)(e):Constitutional duties the state and its organs must perform collaboratively or jointly do not fall within its purview. The provision envisages only constitutional obligations imposed specifically and exclusively on the President or Parliament, and on them alone. It does not embrace the President when he or she acts as part of the national executive, nor Parliament when it is required to act not alone but as part of other constituent elements of the state. Were it to be otherwise, it would undermine the jurisdiction of the High Court and the Supreme Court of Appeal envisaged in section 172(2)(a)... The fact that the obligation on which the Women's Legal Centre relies may encompass the President and Parliament amongst other state actors (a matter we do not decide now) is not sufficient to bring it within the exclusive jurisdiction of this Court. It must fall on the President and Parliament alone.Likewise, the court did not agree that it would be in the interests of justice for the Constitutional Court to exercise its discretion in hearing the matter as a court of first and final instance. Cameron held that the court rarely granted such applications. In granting direct access in the absence of exclusive jurisdiction, and thereby bypassing the jurisdiction of lower courts, the Constitutional Court deprived the disputants of a right of appeal. It also deprived itself, the parties, and the public of other benefits of \"multi-stage litigation\", especially the opportunity to ventilate and clarify disputes of fact and of law. Indeed, the \"intense response\" to the current case demonstrated \"that not only the legal issues, but also the factual issues, are much in dispute. They may require the resolution of conflicting expert and other evidence.\"\nAftermath\nAs advised by the Constitutional Court, the Women's Legal Centre lodged its application in the Western Cape High Court, and the Constitutional Court ultimately heard the merits of the application in 2021 in ''Women's Legal Centre Trust v President (No. 2).\nSee also\n* South African family law\n* Daniels v Campbell\n* Hassam v Jacobs''\nNotes"
    }
  ]
}