{
  "content": [
    {
      "type": "text",
      "text": "# Woodbine, Queensland\n\n| pop                 = 27\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4343\n| area                = 10.2\n| timezone            = AEST\n| utc                 = +10:00\n| elevation           = 198-809\n| dist1               = 7.9\n| dir1                = SW\n| location1           = Mount Sylvia\n| dist2               = 31.0\n| dir2                = SSW\n| location2           = Gatton\n| dist3               = 55.1\n| dir3                = SE\n| location3           = Toowoomba CBD\n| dist4               = 124\n| dir4                = WSW\n| location4           = Brisbane\n| lga                 = Lockyer Valley Region\n| stategov            = Lockyer\n| fedgov              = Wright\n| near-n              = Mount Sylvia\n| near-ne             = Mount Sylvia\n| near-e              = Mount Sylvia\n| near-se             = Lefthand Branch\n| near-s              = Junction View\n| near-sw             = Junction View\n| near-w              = West Haldon\n| near-nw             = Mount Sylvia\n}}\nWoodbine is a rural locality in the Lockyer Valley Region, Queensland, Australia. In the , Woodbine had a population of 27 people.\nGeography\nThe elevation of the locality ranges between  above sea level with the lower lying land around Blackfellow Creek in the north and west  of the locality and the higher elevations in south and east of the locality. The highest point of the locality is on the upper slopes of Mount Michael in the southernmost point of the locality, whose the peak is just over the boundary in neighbouring Junction View to the south.\nThe main road route through the locality is Mount Sylvia Road which enters the locality from the north (Mount Sylvia) and exits to the south-west of the locality (Junction View).\nThe land use is predominantly irrigated horticulture in the lower elevations near the creeks in the north and west of the locality and grazing on native vegetation in the higher elevations in the south and east of the locality.\nDemographics\nIn the , Woodbine had a population of 20 people.\nIn the , Woodbine had a population of 27 people.\nEducation\nThere are no schools in Woodbine. The nearest government primary school is Mount Sylvia State School in neighbouring Mount Sylvia to the north. The nearest government secondary school is Lockyer District State High School in Gatton to the north. There is also a Catholic primary school in Gatton as well as a numbere of non-government schools in Toowoomba and its suburbs.\nReferences"
    }
  ]
}