{
  "content": [
    {
      "type": "text",
      "text": "# Wooden toymaking in the Ore Mountains\n\n(Seiffen, 1947)]]\nThe history of wooden toymaking in the Ore Mountains is closely bound to regional circumstances. The Ore Mountains are located in Central Europe on the border between Germany and the Czech Republic. For many centuries it was a countryside in which the local population eked out a hard existence from the land. Long and harsh winters restricted agriculture; in addition the region had very poor communications. With the onset of ore mining a new line of commerce developed, but the hard labour and high risks involved meant that it was only work for young and strong men. Many were injured or died as a result of accidents. The miners rose early in the morning whilst it was still dark in order to go to work and did not return home again until late in the evening after dark. From those times comes a custom that has survived to the present day, the practice of placing lights in the window. These lights were intended to show the miners the safe way back to the homes of their families.\nIt was not long before the winnings of silver ore fell in many parts of the mountains and numerous pits had to close. This hardship forced its inhabitants to look for other work and, thanks to abundance of timber in the region, the manufacture of wooden toys became an important secondary source of income. Entire families were engaged in wooden toymaking, especially in the harsh winters. Child labour in conditions of poor lighting and equipment was the rule rather than the exception. The children often had to work more than 12 hours a day. Families developed a high degree of specialisation. For example, an experienced turner would be working on turning animal shapes (Reifendrehen), another man carved the animal figures out of it and another family took over the painting and the manufacture of small boxes. Earnings from the individual steps in the process were very low. Production was usually bought by travelling merchants who used their position without mercy, to force down the prices. The majority of these products was taken to the toy markets of Nuremberg and redistributed from there. The formation of associations and cooperatives (such as Dregeno) was in order to ensure a minimum level of income.\nProduction is concentrated today in the toymaking village of Seiffen and its surrounding area in the middle of the so-called \"German Christmas Land\" as the Ore Mountains are called. A great variety of products has developed, but they are clearly associated with the Ore Mountains and go by the concept of Ore Mountain folk art. They include many typical wooden Ore Mountain products such as Christmas pyramids, wooden Räuchermann incense smokers, nutcrackers, wooden figures (Christmas angels, miners, turned animals, etc.), Christmas mountain scenes (Weihnachtsberge) and Ore Mountain candle arches.\nSee also\n* Ore Mountain Toy Museum, Seiffen\nReferences\nExternal links\n* [http://www.dregeno-seiffen.de/index.php?id=19&L=1 Homepage of Dregeno, Seiffen]"
    }
  ]
}