{
  "content": [
    {
      "type": "text",
      "text": "# Woodward Field (airport)\n\n| website      =\n| pushpin_map            = South Carolina\n| pushpin_mapsize        = 250\n| pushpin_map_caption    = Location of Woodward Field\n| pushpin_label          = KCDN\n| pushpin_label_position = bottom\n| built        =\n| r1-number    = 6/24\n| r1-length-f  = 5,000\n| r1-length-m  = 1,524\n| r1-surface   = Asphalt\n| r2-number    = 14/32\n| r2-length-f  = 2,998\n| r2-length-m  = 914\n| r2-surface   = Asphalt\n| stat-year    = 2018\n| stat1-header = Aircraft operations\n| stat1-data   = 8,250\n| stat2-header = Based aircraft\n| stat2-data   = 30\n| footnotes    = Source: Federal Aviation Administration\n}}\nWoodward Field  is a county-owned public-use airport located  northeast of the central business district of Camden, a city in Kershaw County, South Carolina, United States. It is also known as the Kershaw County Airport. The airport serves the general aviation community, with no scheduled commercial airline service.\nFacilities and aircraft\nWoodward Field covers an area of  at an elevation of  above mean sea level. It has two asphalt paved runways: 6/24 is a  lighted runway and 14/32 is  crosswind runway.\nFor the 12-month period ending 8 August 2018, the airport had 8,250 aircraft operations, an average of 23 per day: 93.2% general aviation, 3.8% air taxi and 3% military. At that time there were 30 aircraft based at this airport: 87% single-engine, 3% multi-engine, 6% jet and 3% helicopter.\nThe airport has two aviation related businesses: Camden Jet Center, a full-service FBO, and Aircraft Maintenance Services.\nHistory\nOrigins\nWoodward Field is named for philanthropist and equestrian Ernest Woodward, who donated  of land for an airport in 1929. The airport was dedicated on November 7, 1929, as the most modern airfield in the Southeast. Ernest Woodward and his wife Edith owned the 25 acre Holly Hedge estate in Camden as their winter home from 1926 to 1944 when they sold it to Marion duPont Scott. Woodward, with his brother, had sold the Jell-O Company in 1926 to Marjorie Merriweather Post and her husband E.F. Hutton as an early acquisition of what eventually became the General Foods Corporation. Woodward was a Director of General Foods until his death in 1948. He also provided the funds to build the Springdale Race Course and various other Camden properties.\nWorld War II\nIn 1941 the United States Army Air Forces indicated a need for the airfield as a training airfield. Activated on 22 March 1941, Woodward Field was used by the Army Air Forces Flying Training Command, Southeast Training Center (later Eastern Flying Training Command) as a basic flying training airfield, with instruction being carried out by the 64th Flying Training Detachment. The Camden-based Southern Aviation School was the civilian contractor performing the basic flight training. Flying training was performed with Fairchild PT-19s as the primary trainer. It also had several PT-17 Stearmans and a few P-40 Warhawks assigned.\nRobert K. Morgan, pilot of the Memphis Belle B-17 aircraft, had his primary training at Woodward Field.  Along with the USAAF flying cadets, Royal Air Force personnel were also trained at Woodward under the Arnold Scheme. Two small turf airfields were also used by the training school during the war.\nFlying training ended on 4 August 1944 and afterwards the airfield returned to civil control. The barracks used by the Southern Aviation School turned into Camden Academy in 1950, a military school established by locals. In 1958, the academy was reestablished as Camden Military Academy, which still connects to the airport.\nSee also\n* South Carolina World War II Army Airfields\n* 29th Flying Training Wing (World War II)\n* List of airports in South Carolina\nReferences\n* Manning, Thomas A. (2005), History of Air Education and Training Command, 1942–2002.  Office of History and Research, Headquarters, AETC, Randolph AFB, Texas\n* Shaw, Frederick J. (2004), Locating Air Force Base Sites, History’s Legacy, Air Force History and Museums Program, United States Air Force, Washington DC.\nExternal links\n*"
    }
  ]
}