{
  "content": [
    {
      "type": "text",
      "text": "# Woongarra, Queensland\n\n| pop                 = 585\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| local_map           = yes\n| zoom                = 12\n| postcode            = 4670\n| area                = 34.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 10.7\n| dir1                = SE\n| location1           = Bundaberg\n| dist2               = 369\n| dir2                = N\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Bundaberg Region\n| stategov            = Burnett\n| stategov2           = Bundaberg\n| fedgov              = Hinkler\n| near-n              = Windermere\n| near-ne             = Innes Park\n| near-e              = Elliott Heads\n| near-se             = Calavos\n| near-s              = Alloway\n| near-sw             = Thabeban\n| near-w              = Avenell Heights\n| near-nw             = Ashfield\n}}\nWoongarra is a rural locality in the Bundaberg Region, Queensland, Australia. In the , Woongarra had a population of 585 people.\nGeography\nLocated to the immediate south-east of the Bundaberg urban area, the locality is bounded to the north and east by Elliotts Head Road and to the south by Three Chain Road.\nThe terrain is relatively flat ranging from  above sea level. The land use is predominantly crop growing (mostly sugarcane and macadamia) and some grazing on native vegetation. There is a network of cane tramways in the locality to transport the harvested sugarcane to the local sugar mills for processing.\nHistory\nThe name Woongarra is an Aboriginal word meaning the brigalow tree.\nIn December 1878, tenders were called to erect a school and teacher's residence. When Woongarra State School opened on 13 August 1879 with 16 students, it was on the corner of  Wallace's Road and Lovers Walk Road (approx ). It moved to its present location on Elliott Heads Road in 1901.\nA Primitive Methodist Church opened circa August 1878.\nSt John's Anglican church was dedicated on 14 October 1883. It held its last service on 29 October 1967 because of a declining population.\nDemographics\nIn the , Woongarra had a population of 547 people.\nIn the , Woongarra had a population of 585 people.\nEducation\nWoongarra State School is a government primary (Prep-6) school for boys and girls at 468 Elliott Heads Road (). In 2017, the school had an enrolment of 459 students with 36 teachers (31 full-time equivalent) and 25 non-teaching staff (15 full-time equivalent). A special education program is available at the school.\nThere are no secondary schools in Woongarra. The nearest government secondary schools are Kepnock State High School in Kepnock to the north-west and Bundaberg State High School in Bundaberg South also to the north-west.\nReferences"
    }
  ]
}