{
  "content": [
    {
      "type": "text",
      "text": "# Working with the Elements\n\nWorking with the Elements is an album by saxophonist Glenn Spearman and bassist Dominic Duval. It was recorded on July 20 and 21, 1998, at the Spirit Room in Rossie, New York, and was released in 1999 by the CIMP label. It was one of Spearman's last recordings before his death in October 1998.\nReception\n| rev2 = The Penguin Guide to Jazz\n| rev2Score =\n}}\nIn a review for AllMusic, Steve Loewy wrote: \"Spearman is not quite in peak form, and his energy level seems understandably diminished. Still, there is plenty of fine blowing throughout, while Duval subordinates himself respectfully. The music is perhaps more lyrical, less outrageous, and a touch more disconnected than usual, yet considering the pain the saxophonist suffered, the results are remarkably good.\"\nThe authors of The Penguin Guide to Jazz Recordings noted that Spearman's \"failing health is all too evident,\" and commented: \"Duval holds things together as often as not... There are flashes here and there of the player who made Smokehouse, but they are few and far between.\"\nRon Welburn of JazzTimes stated that Spearman was \"concentrating more on patterns here; but not all his ruminations are convincing-several have the effect of woodshedding.\" However, he concluded: \"despite apparent tenor dominance, the even-handedness of Spearman's performances is evident.\"\nWriting for All About Jazz, Derek Taylor remarked: \"Though [Spearman] was suffering from the debilitating effects of the illness that would soon take his life his work here is still completely engrossing and illuminating... There are points where Spearman seems to lag a little in his inventions and rely on slow, raspy tones in order to perhaps catch a breath. But rather than being a reflection of any deficiency these moments... are often just as stunningly conceived as the more animated episodes.\"\nTrack listing\nComposed by Glenn Spearman and Dominic Duval.\n# \"Step Up\" – 9:32\n# \"Series Series\" – 12:19\n# \"Augh Oh\" – 11:11\n# \"Legato\" – 9:10\n# \"Sass Bolo\" – 5:47\n# \"Zantackin Down\" – 5:17\n# \"Call Separation\" – 5:32\n# \"Sitting In\" – 4:29\n# \"Senortolo - Back by the Bay\" – 3:35\nPersonnel\n* Glenn Spearman – tenor saxophone (tracks 1–4, 6–9)\n* Dominic Duval – bass (tracks 1–8)\nReferences"
    }
  ]
}