{
  "content": [
    {
      "type": "text",
      "text": "# Working Boy Center\n\n| type          =\n| status        =\n| purpose       =\n| headquarters  =\n| location      = José Nogales 69-172 & Piedras Negras, Quito, Ecuador\n| coords        =\n| region_served =\n| membership    =\n| language      =\n| general       =\n| leader_title  = Founder\n| leader_name   = John Halligan\n| leader_title2 =President\n| leader_name2  = John James Halligan\n| leader_title3 =  Director\n| leader_name3  = Gilberto Freire\n| leader_title4 =\n| leader_name4  =\n| key_people    =\n| main_organ    =\n| parent_organization =\n| affiliations  = Jesuit, Catholic\n| budget        =\n| num_staff     =\n| num_volunteers =\n| website       = [http://www.centromuchachotrabajador.org CMT]\n| remarks       =\n}}\nThe '''Working Boys' Center (: CMT), also known as the Center for Working Families''', is a facility in Quito, founded by the Society of Jesus in 1964. It offers social programs for the human and economic development of working boys (and girls since 1974) and their families. Its stated aim is to give working children help to escape from extreme poverty and to gain control of their own lives. CMT states its approach to achieving this is by providing education for the working children and for their families, together with meals, health services, housing assistance, loans to start up microbusinesses, and cultural enhancement.\nHistory\nIn 1964, the Working Boys' Center began with 200 shoeshine and street worker boys in the attic of the Church of the Society of Jesus in the old center of Quito. Early primary education was given, along with three daily meals and health care. Boys were trained in carpentry and shoemaking.\nIn 1974, a headquarters was set up at La Marin, a neighborhood in north Quito. Working children's families were included in a comprehensive training program, adding adult education and vocational education training in various technical skills.\nIn 1981, the opening of a second Working Boys' Center in northwest Quito, at Cotocollao, resulted in the extension of services to 400 families.\nIn 1984, the Craft Defense Board and the Ministry of Education gave official recognition to the technical education workshops. A clinic was later added to health services and health promoters were trained. Marketing was taught in a business school joined to the workshops. A training program for micro-entrepreneurs was launched and microfinance loans made available.\nProduct donation campaigns, begun as the CMT Milk Drop Society, led in 2002 to the , 'Drop of Milk' program. This provides nutritional supplementation and health care monitoring to malnourished children, along with child development and health promotion skills classes for their parents.\nAt a 2015 speaking appearance at the center, Ecuadoran President Rafael Correa acknowledged its help in reducing child labor over the past eight years from over 16% to under 3%.\nEducation\nPrimary education for working children and a program for children with disabilities are offered. Technical education, extending to adults, involves training and internships in workshops while students study the specialties of automotive and industrial mechanics, carpentry and furniture-making, plumbing, cosmetology (beauty treatments), sewing and dressmaking, foodservice (restaurant and catering industry), and bakery. Adult training also offers a diploma of completion of primary education. Technical high school education with IRFEYAL (, a distance education service based in Quito) is also available for those who wish to continue their studies. The center has offered a degree in Automotive Mechanics and was declared by the Ministries of Education and Labor the \"best technical school in the nation\" in 1997 and 2002.\nReferences\nFurther reading\n*\n*\nExternal links\n* [https://www.irfeyal.org/ IRFEYAL Radiophonic Institute website]\n* [http://www.alainet.org/es/active/54871  Latin American Information Agency]"
    }
  ]
}