{
  "content": [
    {
      "type": "text",
      "text": "# Working Daze\n\n}}\n|genre= Humor\n| altnames = Modern Daze\n|rating=\n|preceded by=\n|followed by=\n}}\nWorking Daze is a comic strip written by John Zakour and illustrated by a series of artists (currently Scott Roberts) that centers around the working relationships of a group of mostly geeks who work for MMM (which stands for either MicroMacroMedia or MacroMicroMedia), a D list giant, impersonal software/tech company.\nPublication history\nWorking Daze was co-created by Zakour and artist Andre Noel in the late 1990s.  It began as 2KTOONS and they did a few black and white samples under that name. The panels were picked up by intranetjournal.co and were run occasionally under the title Modern Daze.  Picked up by United Feature Syndicate, it began its full color run under the current title on December 17, 2001. Noel left in 2003, and Kyle Miller replaced him starting April 20 of that year, drawing the strip until June 14, 2008. Many new characters were introduced during Miller's time on the strip and readership increased. Scott Roberts took over on June 16, 2008, and continues to draw it today. All three artists delivered different, personal styles to the comic.\nAndre Noel era\nDuring the Noel period with the United Features Syndicate, Working Daze appeared six days a week in color online and in black-and-white in a handful of newspapers. At first it was a single panel gag with a caption beneath. During Noel's run, it changed format to employ word balloons, freeing it to have two or more panels as needed. It fell more in line with the traditional definition of a comic strip, although it retained its original dimensions. Noel experimented with different methods of coloring the strip, initially going for a hand-colored look. Later on, brighter, flatter colors were used, indicating that it was being computer colored. The art was fairly detailed, with a good deal of emphasis on backgrounds. The offices of MacroMicroMedia seemed to be located in a large city high-rise, probably an older building. The style was closer to The New Yorker cartoons than to newspaper strips.\nKyle Miller era\nRather than seek an artist who would mimic Noel's style, Zakour went with Kyle Miller, who brought a whole new look to the strip. Miller's style was clean and spare, more cartoony, and the characters were redesigned to reflect that look. Several new characters made their debut during Miller's time, including Carolina, Kathy, and Medusa.\nMiller used backgrounds sparingly, often they were only dashes of color. Some readers resisted the change at first, but in time many new readers came on board, and Miller was embraced as a full partner, his style as the true look of the strip. He stayed on much longer, ending a five-year run in 2008. His departure came as an upset to many readers, who were even less willing to accept the change than when he came on. Zakour announced the change well in advance of the actual event, but many were caught by surprise. Miller is a video game designer, and left to concentrate more time on that work.\nScott Roberts era\nRoberts had been working with Zakour since they were both a part of the Rugrats comic strip, and contributors to Nickelodeon Magazine. Zakour was hired to write gags for the Rugrats in its final year. Roberts had been writing gags and drawing the feature for five years, originally rotating with other artists and later providing all the penciling. Zakour and Roberts also collaborated on some comic stories for Nick Mag. After the strip folded, they started seeking other projects they could work on together, and peddled a strip that failed to sell. All this laid the groundwork for Zakour asking Roberts to become the new Working Daze artist.\nEven so, there was a great deal of resistance on the part of longtime readers. Once again, no effort was made to continue the established look. As negative reactions came in, Roberts altered and experimented, trying to find an approach that suited his own view of the characters.\nBut new readers continued to come on board, and the newest were not familiar with the Miller or Noel strips. These readers accepted the Roberts style as the look of the strip. Roberts drew the characters with more attention to anatomic reality, but still cartoony and caricatured, and put far more emphasis on backgrounds. By now it was clear that the company had relocated to an office park somewhere in the suburbs. A key change came in his second year, with use of photo backgrounds. This consists usually of scenes outside the windows of the office, but it can also include outdoor settings, props and set pieces, or images on computer screens. This multimedia approach met with a mixed reaction, some readers disturbed by it, others embracing it.\nThe comments on the Comics.com website increased. The gags occasionally touched upon real issues of the workplace or the economy. Sometimes older gags were dusted off, and reworked by Roberts in the new style. These were never meant to be improvements, but simply, a fresh way to look at the same idea. Roberts continues as the artist, and occasionally contributes to the writing as well.\nCharacters and story\nMMM began its corporate life as Dundaley Industrial.  It became Micro-Macro-Media (MMM) in 1967, \"selling computer services to companies that could never afford to own one [a computer].\"  The characters were inspired by real prototypes the creators knew in the workaday world.\n* Aisha -- the belly dancer model.\n* Andrew Norton -- the African-American self-proclaimed \"effortlessly cool\" artist and graphics designer.  He is said to have been inspired by artist and co-creator Andre Noel.\n* Andromeda -- Dana's cousin and Jay's live-in girlfriend. Like Dana, she has incredible powers and can \"piff\" people, but she has a curse. Each time she uses her powers it causes Adam Sandler to make a movie.\n* Carolina Lopez (pronounced KA-ro-LEE-nah) — works in marketing.  Carolina is single and dating, but too smart to fall for her co-workers' clumsy advances.\n* CJ Rapps -- an intern when her uncle was CEO (he's no longer with the company); now a paid employee, although it is uncertain in what capacity.  CJ has a deep grudge against Ed because she was written up when she tried to follow his example.\n* Dana Powers -- Rita's overworked assistant and office manager.  Dana is the most capable, trustworthy employee and the lowest paid. Dana has strange powers that she tries to control, but uses to \"poof\" people who annoy her.\n* Doris Jenson (usually referred to as Mrs. Jenson) -- the oldest employee at MMM. She's been there so long that no one remembers who hired her and what she does, so no boss wants to take responsibility.\n* Ed Kennedy -- a senior engineer who has been at MMM longer than Jay.  Ed resists authority and acts unmotivated, sleeping as much as possible.  He's actually brilliant and capable, but he's lazy and way overpaid for the small amount of work he achieves.\n* Elena Belloff -- a hypnotist who works as an outside contractor.\n* Herbie -- like CJ, started as an intern and was hired into some unspecified job.  Herbie considers himself a loser.\n* Jay Johnstone -- an engineer.  Jay is the everyman lead.  He has a bad habit of speaking without thinking first.  Some consider him a stand-in for writer Zakour (although he does not physically resemble him).  He has a twin sister Jane and nephew Felipe.\n*Jessie -- the younger of Rita's two daughters.  Jessie has turned her back on business for a career in medicine much to Rita's annoyance\n* Jimbo -- an intern who has plans of taking over someone's job -- when he decides whose job he wants.\n* Kathy Moon Hobbs -- Roy's wife and mother of Rey.  Kathy is almost as geeky as Roy, but with one foot still in the real world.  It's unknown what exactly she does at the office.\n* Lila (pronounced LEE-lah) -- Dana's mother; she is more powerful than either Dana or Andromeda.  She had a crush on Ed at one point.\n* Madam Shannon -- a sorceress who also works as an outside contractor.\n* Maxine -- another manager at MMM and Rita's arch-foe. She always dresses similarly to Rita (and looks similar, but is blonde), such that Rita thinks Maxine is copying her. However, Maxine is oblivious to Rita.\n* Medusa -- a Gorgon; started as a receptionist, but is now an assistant to the CEO. Medusa turns people to stone, but selectively -- it appears to be based upon who annoys her the most.\n* Melvin -- company function unknown.  Melvin is a clueless braggart and fool.\n* Nelle -- works in human resources.\n* Norm Steele -- manager.  Norm was once a confident and productive employee until he was promoted to management. Now he is a nervous wreck because he doesn't want to be in authority.\n* Rita McMahon -- the manager, a vice president at the company.  Rita is rather obtuse and single minded. Money-minded and ambitious, but she does have a good side deep down. Prone to causing disasters.  She has two daughters, Jessie and Sarah, as well as a granddaughter.\n* Roy Hobbs -- the IT guy; married to Kathy and father of Rey.  Roy is a proud geek and gamer.  He is also somewhat childlike at heart.\n* Rusty -- an occasional character.  Rusty is an old hippie with long hair and a mustache.\n* Sal Bandi -- the clueless and incompetent service representative.\n* Sam Deldom -- an occasional character who never smiles.\n*Sarah -- the older of Rita's two daughters and mother to Rita's granddaughter.\n* Sue Smith -- a burnt out employee who gets moved around by Rita to different positions.\nRoy and Dana were minor characters at first but grew to be the most popular.\nImage:Rita-miller.png|Rita drawn by Kyle Miller\nImage:Rita-roberts.png|Rita drawn by Scott Roberts\nBooks\n* Working Daze: Managers and other Unnatural Disasters (Metropolis Ink/End Table Books, 2005)\nReferences\nExternal links\n* [http://www.gocomics.com/working-daze/ Working Daze] at GoComics"
    }
  ]
}