{
  "content": [
    {
      "type": "text",
      "text": "# Working Women United\n\nWorking Women United (WWU) (later known as the Working Women United Institute) is a women's rights organisation based in the United States which was formed in Ithaca, New York in 1975, to combat sexual harassment of women in the workplace.\nIn the beginning of the organization's activism, their definition for sexual harassment was \"the treatment of women workers as sexual objects,\" but the organization did not specify which behaviors constituted such harassment.\nCarmita Wood\nThe founding of the group was inspired by the case of Carmita Wood, who quit her job at Cornell University due to sexual harassment and became one of the first women in the US to sue her employer on such grounds.\nIn 1975, Carmita Wood quit her position at Cornell University due to harassment from her supervisor, Boyce McDaniel, and the university's refusal to approve her request for a transfer. Wood was McDaniel's administrative assistant who was a nuclear physicist working on the Manhattan Project prior to joining the team at Cornell. McDaniel constantly made sexual gestures and remarks causing Wood to develop extreme anxiety that led to severe neck pains and numbness in the shoulders and arms. Wood was constantly in close proximity with McDaniel and endured this harassment until she quit her job at Cornell. One specific harassment happened at a Christmas party where McDaniel forcibly touched her and kissed her repeatedly. Before she resigned, Wood requested to be switched to another job, but her request was denied. Her physical and emotional symptoms started to subside when McDaniel went on leave, but when he came back, Wood immediately left. In June 1974, Wood resigned. Subsequently, Wood filed for unemployment benefits from the university. Cornell refused to approve the benefits, stating Wood had quit for \"personal reasons.\" Working Women United was formed to publicize Wood's case and held a \"Speak Out\" to give voice to other women's experience of sexual harassment at work. Cornell instructor Lin Farley, a key organizer in Working Women United, used the phrase \"sexual harassment\" at a hearing, and The New York Times reported on the hearing and the phrase used, helping to introduce the concept and phrase \"sexual harassment\" into the national lexicon. Carmita Wood eventually lost her appeal while Boyce McDaniel continued his career. McDaniel was even elected into the National Academy of Sciences in 1981, years after Wood filed her complaint. While Wood's case did not end with a positive result, it did help bring women together to fight sexual harassment and bring attention to the issue. Working Women United came together and protested the unfair treatment many women received in their workplace. Years after Wood, Farley, and many other women coined the term \"sexual harassment,\" the legal system made a big change. The Supreme Court ruled sexual harassment illegal in 1986 as it violated the sex discrimination law in the workplace.\nCarmita Wood reflects on her experiences going through a sexual harassment trial and how it affected her. Not only did this affect her future employment opportunities, but it affected her children at school. Her son defended her when children at school voiced their opinions about the issue which took a toll on him. While Wood explained the negative aspects, she also explained how the positives outweigh the negatives. Her bravery encouraged a group of 275 women to speak out against sexual harassment. When walking down the street, Wood was stopped by both men and women praising her for her courage and showing their support.\nDuring the Speak Out, Carmita Wood and others spoke about the feeling of being alone. They explained that working women were not alone, that there were many cases across the country at the time of the speak out. Their words pushed young women in the workforce to join Working Women United and to speak out for their rights. The event was inspiring as many of them wanted working women to come together and protect each other from sexual harassment in the workplace. Wood spoke about the changes in law that needed to be made in order for women to be able to work in a safe environment. These empowering words pushed other women to feel strength and courage to stand up for each other.\nAne Becker\nOn April 15, 1975, Ane Becker filed a complaint with the New York State Human Rights Commission against her employer, Borg Warner/Morse Chain, an international automotive supply corporation with a facility in Ithaca, alleging sexual discrimination. She did this on her own.\nShortly after the WWU hearing of her situation in the local media reached out to offer their support and guidance.  With no resources she gratefully accepted their support.\nFollowing on July 24, 1975, with the support of the WWU she filed suit against Morse Chain division of Borg Warner in Ithaca NY alleging sexual discrimination with the Equal Employment Opportunities Commission. Becker, an employee of 17 years, said she had been denied equal opportunities protected by the 1964 Civil Rights Act.\nBecker had worked as a purchasing in clerk for 13 years. She claimed that her responsibilities were virtually the same as the buyers making $30-$96 more per week.  \"If I had been a man, and done exactly what I have, the same thing, I would've been promoted 13 years ago\"\nYacknin of the WWU agreed that Ane Becker's case met many criteria for a discrimination case. Yacknin said \"there are no women buyers at the Morse Chain Ithaca plant, and there has not been for at least the past 18 years.\" \"Working women United believes that this situation indicates discrimination in hiring, promotion, wages, training, and titles,\" she said.\nBecker said that she had been \"terribly nervous\" for a long time to take that first step. \"I didn't have the guts for a long time, but I have a small son, and my finances were (less) drastic.\" \"So I dared,\" Becker said.  (Ithaca Journal, July 24, 1975)\nIn November 1975, with the support from WWU Becker was victorious in her lawsuit. Although Borg Warner automotive denied any wrongdoing, Becker was promoted to a Buyer classification, given a pay raise and two years of backpay. (Ithaca Journal, November 8, 1975)\nAne Becker retired from Borg Warner in 1988 after 30 years of service. Following her retirement she was routinely called back to work as a buyer for many years. She died in 2015 at the age of 89 and is remembered as a loving, feisty and independent spirit who championed change in the workplace to help women become more valued.\nHistory\nIn the mid-1970's, the feminist movement created social and conceptual spaces where women could speak out on the job about sexual harassment. As women had done previously with abortion, rape, and domestic abuse, identifying and speaking out about the violation legitimized their feelings of violation. &nbsp;This time, they focused on sexual harassment in the workplace, and the case of Carmita Wood inspired the movement. She was declined unemployment benefits when resigning as an administrative assistant to a professor at Cornell University because she had been physically ill from the pressure of avoiding his unwanted sexual advances.\nThe first organized response to sexual harassment grew out of the women's movement, arising at the intersection between protests against sexism in jobs and feminist opposition to violence against women. The problem of sexual harassment placed together complaints about women in the workforce with opposition to male sexual violence. Two groups founded in the mid-1970's to concentrate specifically on sexual harassment — Working Women United in Ithaca, New York, and the Cambridge, Massachusetts Alliance Against Sexual Coercion. On a Sunday afternoon, 4 May 1975, 275 women gathered at the Greater Ithaca Activities Center for the country's initial \"Speak Out\" testifying about personal experiences of sexual harassment. Working Women United (WWU), as well as the Human Affairs Program at Cornell University and the National Organization for Women's Chapter in Ithaca.\nThis campaign developed out of the wider women's movement, which provided the leaders of the fight against sexual assault with an institutional foundation, contact networks, policies, and philosophy.\nHuman Affairs Program (HAP)\nThe Human Affairs Program (HAP) was a program at Cornell University that offered academic courses and community organizing with theoretical and practical instructions in social, political, educational, and economic concerns. Originally this included prison reform, urban redevelopment, and money and banking. Susan Meyer and Karen Sauvigné were activists who offered support to Carmita Wood. They were part of the Humans Affair Program (HAP) at Cornell . In 1974, a women's section in HAP was formed in which Lin Farley, a long time activist, was the director of HAP. When Meyer, Sauvigné and Farley began talking to Wood, they discovered that women everywhere experienced a situation similar to Wood's where they got fired or quit due to not going along with unwanted sexual advances. The women began to take action as they found attorneys for Wood and argued that Title VII should include protecting women from sex-based intimidation in the work force. The women appealed Woods unemployment claim which they lost. Farley testified in 1975 for New York City Human Rights Commission Hearings on Women and Work to define sexual harassment. Farley's message became nationally known shortly and sexual harassment became well known around the world. By looking to support working women, these women from HAP created a working women's organization known as Working Women United (WWU).\nSpeak Out\nThe first protest occurred on May 4, 1975 as a \"Speak Out\" where women gave testimony of personal experiences of sexual harassment at work. The women speaking out broke the silence of sexual harassment, while also bringing awareness to the newly identified term. As a leader of the first protest against sexual harassment, Carmita Wood was supported by women who unfortunately were able to relate to a sexual harassment experience or by women who rallied for the protection of other victims. The protest was an opportunity for women to speak out about their challenges and exposure to sexual harassment. Speaking out allowed women to express the physical and emotional impacts that their experience with sexual harassment took upon them. In other words, women discussed their mental health prior to these unfortunate, life-changing experiences. At the time, women were oftentimes scared to speak up about their problems at work. In fact, many women kept it to themselves because they feared other individuals would not be able to relate to their experiences. Therefore, the women who spoke out on May 4, 1975, in Ithaca, New York are known to be inspirational and powerful for their courageous actions and ability to share their traumatic experience or experiences with sexual harassment. At this Speak Out against sexual harassment, there was a strict policy against media. Certain individuals worried that the use of media would shift the women's words and take away the power of their speeches and experiences. This lack of media allowed women to not be misspoken or misheard by the public.\nThis campaign developed out of the wider women's movement, which provided the leaders of the fight against sexual assault with an institutional foundation, contact networks, policies, and philosophy.\nWorking Women's United Survey on Sexual Harassment\nAlthough feminist activists were making extreme progress during the 1970s, they began to shift their focus a bit more on making it aware to the public of the seriousness associated with sexual harassment. In doing so, Working Women United continued to make attempts in implementing sexual harassment policies such as pieces of training within the workplace.\nHowever, the continuous debates on sexual harassment policy and those who opposed these policies often shared that their reasoning behind opposing these policies was because it was not a serious issue because, in their perspective, women brought sexual harassment upon themselves by their attire and having certain attitudes. In addition, those who opposed these sexual harassment policies often said that these issues were not a legal but a moral issue. The argument of sexual harassment not existing as an actual problem took many forms drawn from two major surveys conducted in 1975 and 1976.\nThe Redbook Magazine Survey\nThe Redbook survey of 1976 made room for crucial conversations about sexual harassment and women in the workplace. Although Redbook Magazine was known for doing mail-in surveys through their magazine, the number of statistics drawn from this one survey was overwhelming and can be said to have contributed to the various conversations that still take place. In the eyes of the public, this may have seemed like just numbers at first, but with the alarming rates of statistics present in the survey alone, it called for much more action and public attention than what the topic of sexual harassment was first getting. Such statistics showed that\nMerit System Protection Board Survey - Workplace and institutional harassment\nIn addition to these conversations, other women like Mary Coeli Meyer and her coauthors attempted to refrain from the idea majority of society had from sexual harassment as a personal problem by emphasizing that sexual harassment was actually gender-neutral in their book entitled Sexual Harassment written in 1981. The ideal intent for this book and neutralizing the term sexual harassment was more so to refrain it from feminine critique. This notion of not taking sexual harassment seriously became more and more difficult as more studies were showing that sexual harassment was becoming a widely spread issue and negatively affecting women in particular. This progressed in the 1980s particularly after the Merit System Protection Board's survey of 1980. This survey, in particular, had drawn closer attention to organized advocacy groups located in the dimensions of governments, academic settings, and other federal workplaces.\nTactics/Contributions\nLabor Pains\nIn August 1975, Working Women United began releasing a newsletter, titled Labor Pains. The articles in the newsletter covered women's issues in the workplace, including perspectives from a variety of experiences. The stories came from women of all ages, all backgrounds, and of all professions. The newsletter showed women that they were not alone in their struggles and that these struggles were valid.  Among these stories was Carmita Woods' encounter with sexual harassment and a summary of the May 4th 1975 Speak Out protest. Additionally, these articles offered women guidance in their fight back against sexual assault and sexual harassment in the workplace. The newsletter, along with other advocacy efforts of WWU, helped the organization gain national media attention. The efforts of Working Women United helped spread sexual assault awareness and resources to citizens all across the country. During the summer of 1975 through the middle of 1976, WWU appeared in the New York Times, Wall Street Journal, and the Chicago Tribune. Working Women United continued to publish issues of Labor Pains until early 1976. Later that year Working Women United disband and was replaced by Working Women Institute (WWUI).\nWorking Women Institute (WWI)\nTheory and Critics of Working Women Institute\nIn the late 1970s there was much discussion of the oppressive structures behind the sexual harassments of Women in the workplace, all rooted in feminist theory. Many feminist theorists often related sexual harassments to rape in that sexual harassment like rape is about power and not sex. For instance, WWI has stated understanding sexual harassments in the workplace to be economic rape and that inequality between the sexes is the basic cause of sexual harassments. WWI strongly supported legal solutions to sexual harassments while other organizations such as the Alliance Against Sexual Coercion (AASC), were more wary of the legal system. Members of WWI have also been criticized for their lack of intersectionality and sole focus on the patriarchy. In 1978, Lin Farley wrote Sexual Shakedown: The Sexual Harassment of Women on the Job, in which she stated patriarchy to be the root of sexual harassment.\nAn organizer from the AASC, Freada Klein, was one of Farley's biggest critic. Klein and AASC, argue that sexual harassment is the product of intersectional oppression. Klein argues that Farley's analysis is too simplistic and overlooks the role capitalism, race, and class play in sexual harassment. Farley responds to Klein in Aegis magazine, affirming her argument that patriarchy is the root of sexual harassments arguing that in capitalism women can now compete with men in a free labor market but not possible if male trade unions segregate training and job opportunities, making it rooted in patriarchy. All in all, Freada Klein acknowledged Lin Farley's ground breaking work and its role in discussion of sexual harassments.\nBrief Banks\nThe WWU created brief banks in order to file and organize previous sexual assault cases. Through the establishment of brief banks, WWI centralized access to a comprehensive body of legal knowledge on sexual harassment. WWI positioned itself as the leading authority on this subject, thus catapulting them into the public eye.\nReferences"
    }
  ]
}