{
  "content": [
    {
      "type": "text",
      "text": "# Workplace democracy\n\nWorkplace democracy is the application of democracy in various forms to the workplace, such as voting systems, consensus, debates, democratic structuring, due process, adversarial process, and systems of appeal. It can be implemented in a variety of ways, depending on the size, culture, and other variables of an organization.\nTheory\nEconomic argument\nFrom as early as the 1920s, scholars have been exploring the idea of increasing employee participation and involvement. They sought to learn whether including employees in organizational decision-making would lead to increased effectiveness and productivity within the organization. According to Lewin, individuals who are involved in decision-making also have increased openness to change.\nCitizenship argument\nWorkplace democracy may encourage public participation in a government's political process. Skills developed from democracy in the workplace can transfer to improved citizenship and result in a better functioning democracy.\nEthical justification\nPhilosopher Robert Dahl claims that, \"If democracy is justified in governing the state, it must also be justified in governing economic enterprises.\" Some political scientists have questioned whether the state-firm analogy is the most appropriate way to justify workplace democratization.\nEmployee power and representation\nWorkers working for democratic leaders report positive results such as group member satisfaction, friendliness, group mindedness, 'we' statements, worker motivation, creativity, and dedication to decisions made within an organization.\nWhen workplace democracy is used the effect typically is raised employee potential, employee representation, higher autonomy, and equal power within an organization. Workplaces can exhibit varying degrees of democratic governance, and such “democratic organizing”, ranging from codetermination and cooperatives to enhanced worker decision-making, has been linked not only to internal organizational outcomes but also to broader civic and democratic engagement in society.\nPolitical association\nWorkplace democracy theory closely follows political democracy, especially in larger workplaces. Democratic workplace organization is often associated with trade unions, anarchist, and socialist (especially libertarian socialist) movements. Most unions have democratic structures at least for selecting the leader, and sometimes these are seen as providing the only democratic aspects to the workplace. Not every workplace that lacks a union lacks democracy, and not every workplace that has a union necessarily has a democratic way to resolve disputes.\nThe Menshevik led Democratic Republic of Georgia experimented with workplace democracy by promoting cooperatives in the economy. These cooperatives were ended when Georgia was annexed into the Soviet Union.\nIn Sweden, the Swedish Social Democratic Party made laws and reforms from 1950-70 to establish more democratic workplaces.\nSalvador Allende championed a large number of such experiments in Chile when he became president of Chile in 1970.\nCurrent approaches\nEquity model\nIn the equity model, employees own voting shares of their company, most commonly through an employee stock ownership plan. The equity model of workplace democracy exists when bottom-up practices, such as participatory management, are combined with the top-down influence provided by their voting rights.\nStaff and Worker Representative Congresses\nIn China, a form of workplace democracy is mandated by law for state-owned enterprises and permitted in non-state-owned collectives and companies. This is done through Staff and Worker Representative Congresses (SWRCs), composed of workers directly elected by all workers in the workplace to represent them. As of the 1980s and 1990s, SWRCs were, in theory, broadly similar to continental European and Japanese workers' workplace councils in terms of rights and powers and consensus building, as opposed to the Anglo-American model \"adversarial model\" relating management and workers. Findings from interviews in 1997 suggested that in practice, SWRCs did have some real power, including some cases of dismissing managers.\nExamples of companies organized by workplace democracy\nMondragon\nMarland Mold\nMarland Mold was a company started in 1946 in Pittsfield, Massachusetts, by Severino Marchetto and Paul Ferland. The company at first, designed and built steel molds for plastic products throughout the 1950s and 60s. In 1969 the owners sold the company to VCA which was later bought by The Ethyl Corporation. The Marland Mold employees voted to join the International Union of Electrical Workers, because of a dispute that took place over health insurance. The plant's manager started to pay less attention and put less time into the Pittsfield plant so the profits declined. The plant was put up for sale in 1992. The employees ended up buying out the plant, even though they weren't fans of employee ownership before, they needed to save their jobs. There immediately was a burst in production and they were able to produce molds that normally took the 3,000 hours to make in 2,200 hours. They had financial stake in the company now which gave them new motivation for the company's success. The other two ideas that were key components to their success was the education of all members about their new roles, and building an ownership culture within the organization. In 1995, they had officially bought all ownership stock and buyout lenders and the company was completely employee owned. Through all of this employees were also able to gain a broader perspective on the company, like being able to understand others views of different conflicts in the workplace. In 2007, Marland Mold celebrated their 15th anniversary of employee ownership.\nIn 2010, Marland Mold were acquired by Curtil. In 2017, the Pittsfield plant was shut.\nSemco\nIn the 1980s, Brazilian businessman Ricardo Semler, converted his family firm, a light manufacturing concern called Semco, and transformed it into a strictly democratic establishment where managers were interviewed and then elected by workers. All managerial decisions were subject to democratic review, debate and vote, with the full participation of all workers. This radical approach to management got him and the company a great deal of attention. Semler argued that handing the company over to the workers was the only way to free time for himself to go build up the customer, government and other relationships required to make the company grow. By giving up the fight to hold any control of internals, Semler was able to focus on marketing, positioning, and offer his advice (as a paid, elected spokesman, though his position as major shareholder was not so negotiable) as if he were, effectively, an outside management consultant hired by the company. Decentralization of management functions, he claimed, gave him a combination of insider information and outsider credibility, plus the legitimacy of truly speaking for his workers in the same sense as an elected political leader.\nResearch on workplace democracy\nPublic opinion\nA 2023 study in the United States found that the people surveyed generally support workplace democracy, even in survey experiments where respondents are exposed to question framings that emphasize the costs of workplace democracy.\nManagement science studies\nLondon Business School chief, Nigel Nicholson, in his 1998 Harvard Business Review paper: \"How Hardwired is Human Behavior?\" suggested that human nature was just as likely to cause problems in the workplace as in larger social and political settings, and that similar methods were required to deal with stressful situations and difficult problems. He held up the workplace democracy model advanced by Ricardo Semler as the \"only\" one that actually took cognizance of human foibles.\nEffects on productivity\nA meta-analysis of 43 studies on worker participation found there was no negative correlation between workplace democracy and higher efficiency and productivity. A report looking at research on democratic workplaces in the USA, Europe and Latin America found workplace democracy had staff working 'better and smarter' with production organized more efficiently. They were also able to organize more efficiently on a larger scale and in more capital-intensive industries than hierarchical workplaces. A 1987 study of democratic workplaces in Italy, the UK and France found that workplace democracy has a positive relationship with productivity and that democratic firms do not get less productive as they get larger. A report on democratic workplaces in the USA found that they can increase worker incomes by 70-80%, that they can grow 2% faster a year than other businesses and have 9-19% greater levels of productivity, 45% lower turnover rates and are 30% less likely to fail in the first few years of operation. A 1995 study of workplace democracy in the timber industry in the Northwest United States found that productivity increased by 6 to 14% with workplace democracy. A 2006 meta-study on workplace democracy found that it can 'equal or exceed the productivity of conventional enterprises when employee involvement is combined with ownership' and 'enrich local social capital.' Another 2006 study reviewing existing evidence found that contrary to the popular idea that worker participation would decrease productivity, it actually increases it. A 1985 study in France that the typical increase to productivity from workplace democracy was about 5%. Another 2022 study using data from France found workplace democracy increases economic performance in knowledge-heavy sectors.\nHowever, a 1986 study of plywood companies in the USA found democratic workplaces lost productivity due to them hiring more workers who were not given equal democratic rights compared to original workers. Another study looking at evidence of construction companies in the 1980s indicated that democratic workplaces had equal or lower productivity compared to other workplaces.\nEffects on business longevity\nAccording to an analysis, businesses with democratic workplaces in British Columbia, Alberta, and Quebec in the 2000s were almost half as likely as businesses with hierarchical workplaces to fail in ten years. According to an analysis of all businesses in Uruguay between 1997 - 2009, businesses with democratic workplaces have a 29% smaller chance of closure than other firms. In Italy, businesses with democratic workplaces that have been created by workers buying a business when it's facing a closure or put up to sale have a 3 year survival rate of 87%, compared to 48% of all Italian businesses. In 2005, 1% of German businesses failed but the statistic for businesses with democratic workplaces was less than 0.1%. A 2012 study of Spanish and French businesses with democratic workplaces found that they “have been more resilient than conventional enterprises during the economic crisis.\" In France, the three year survival rate of businesses with democratic workplaces is 80%-90%, compared to the 66% overall survival rate for all businesses. During the 2008 economic crisis, the number of workers in businesses with democratic workplaces in France increased by 4.2%, while employment in other businesses decreased by 0.7%.\nEffects on workers\nA 2018 study from South Korea found that workers had higher motivation in democratic workplaces. A 2014 study from Italy found that democratic workplaces were the only kind of workplace which increased trust between workers. A 2013 study from the United States found that democratic workplaces in the healthcare industry had significantly higher levels of job satisfaction. A 2011 study in France found that democratic workplaces “had a positive effect on workers’ job satisfaction.” A 2019 meta-study indicates that “the impact [of democratic workplaces] on the happiness workers is generally positive”. A 1995 study from the United States indicates that “employees who embrace an increased influence and participation in workplace decisions also reported greater job satisfaction”. A 2008 study found mixed results for \"spillover\" effects on workers, where working in a democratic workplace doesn't increase the odds of voting but slightly increases the odds of community engagement. A 1986 study of plywood companies in the USA found that democratic workplaces tended to over-report accidents whilst conventional capitalist ones would under-report them. Contrary to theoretical expectations of democratic workplaces, they were not safer for workers than conventional capitalist workplaces.\nSee also\n*Aristocracy of labour\n*Cooperation Jackson\n*Deliberative democracy\n*Popular assembly\n*Theory X and Theory Y\n*Worker cooperative\n*Workers' control\n*Workers' self-management\nReferences\nExternal links\n*[http://economicdemocracy.org/workplacedemocracy.html Quotes and other writings on workplace democracy] (Chomsky, Wheatley, et al.)\n*[http://www.ellerman.org/Davids-Stuff/The-Firm/Firm%20T&P.htm#ESOP-Priv Articles] by David Ellerman on workplace democracy\n*[https://www.youtube.com/watch?v=uCIjSsrrtAA Workplace Democracy and Democratic Ownership]—Richard Wolff & Gar Alperovitz at Left Forum, 2013."
    }
  ]
}