{
  "content": [
    {
      "type": "text",
      "text": "# Work permit (United Kingdom)\n\nThe UK Work Permit scheme was an immigration category used to encourage skilled workers to enter the United Kingdom (UK) until November 2008, when it was replaced by the points-based immigration system. It provided an opportunity for overseas citizens seeking to gain valuable international work experience in the UK and was often used to enable UK employers to transfer key personnel to the UK from outside the European Economic Area (EEA) region.\nA valid job offer from a viable employer in the UK is a requirement for a work permit. A UK work permit is granted to a specific person for a specific role within a specific company and the permit holder must be able to accommodate and support themselves and any dependants without recourse to public funds. The application for a work permit must be made by the sponsoring company. The Highly Skilled Migrant Programme may be available to potential immigrants without a job offer.\nA work-permit-holder can apply for their dependants to join them in the UK, and their dependants will be able to work in the UK without restriction.\nIn order to change employer, a prospective employer will need to apply to the UK Border Agency to transfer the work permit prior to starting work with the new employer.\nEligibility\nDuration\nA work permit can be issued for any period of time between 1 month to 3 months. The duration of the work permit is dependent on the length of time requested by the sponsoring company, and is also at the discretion of the Home Office. A permit holder will be \"locked-in\" to their employer for the duration of the visa. Moving to another employer requires another application to be made.\nPosition\nThe position for which the work permit is required must meet National Vocational Qualification (NVQ) level 3 and above. For work in a certain professions, registration with the governing body of that profession may be required. For example, doctors must be General Medical Council (GMC) registered.\nEducation\nEligibility for a work permit requires:\n* A degree; or\n* A Higher National Diploma (HND) level qualification which is relevant to the position on offer; or\n* An HND level qualification which is not relevant to the position on offer plus one year of relevant full-time work experience at NVQ level 3 and above; or\nAdditional information\nEntry clearance/leave to remain\nOnce a work permit has been authorised it is the responsibility of the work permit holder (not the employer's responsibility), to apply for the correct leave in order to validate the work permit. This would be in the form of either a Leave to Remain application (if eligible to switch in the United Kingdom) to the United Kingdom Home Office, or an application for entry clearance (if overseas) to the nearest British High Commission/Embassy in the country of the worker's legal residence.\nShortage occupations\nIf the position for which the prospective employer is seeking a work permit is on the shortage occupation list, there is no requirement for the employer to meet the advertising criteria set by [http://www.ukvisas.gov.uk/ Work Permits (UK)]. Otherwise the employer will need to advertise for the position in a government accredited place - a broadsheet paper, online etc. This advert will have to be 'live' for a set period of time and the employer will have to prove that the applicant is the most qualified for that position.\nThe work permit shortage occupations list contains jobs within the engineering, healthcare, and other professions.\nSpouse/civil partners\nA work permit holder's partner may apply for entry clearance as a dependant on the work permit provided that they are either married or have entered into a civil partnership. The permit holder and their partner must demonstrate that they intend to live together in the United Kingdom and that a marriage or civil partnership subsists.\nThe partner of a work permit dependant visa holder will eligible to seek and take employment in the United Kingdom.\nDevelopments under the points-based system\nDuring the third quarter of 2008, the Work Permit scheme was scrapped and it became part of Tier 2 of the new points-based immigration system, the tier for skilled workers.  Tier 2 also replaced the existing provisions for ministers of religion, airport-based operational ground staff, overseas qualified nurse or midwife, student union sabbatical posts, seafarers, named researchers, Training and Work Experience Scheme (TWES), Jewish agency employees, and overseas representatives (news media).\nFuture outside the EU\nWhen Britain leaves the EU, citizens of the EU might need a work permit in the UK. If Britain gets an EEA agreement, they probably won't need a permit, in the same way as citizens of Norway don't need it. Without an EEA agreement, citizens of the EU will probably need work permits, in the same way as Swiss citizens who do need a permit, which other citizens like Serbians (Serbia is negotiating for EU membership) also need. Same principles will apply for Britons in EU countries as the other way around, that is depending on an EEA agreement.\nSee also\n* Points-based immigration system (United Kingdom)\n* Office of the Immigration Services Commissioner\n* Immigration Law Practitioners Association\nReferences"
    }
  ]
}