{
  "content": [
    {
      "type": "text",
      "text": "# World War Three (Doctor Who)\n\n| composer           = Murray Gold\n| production_code    = 1.5\n| series             = Series 1\n| length             = 42 minutes\n| date               =\n| preceding          = \"Aliens of London\"\n| following          = \"Dalek\"\n}}\n\"World War Three\" is the fifth episode of the first series of the British science fiction television programme Doctor Who which was first broadcast on BBC One on 23 April 2005. It is the second of a two-part story which began with \"Aliens of London\" on 16 April.\nIn the episode, set in London, the alien time traveller the Ninth Doctor (Christopher Eccleston) and his companion Rose Tyler (Billie Piper) team up with Rose's boyfriend Mickey Smith (Noel Clarke), her mother Jackie (Camille Coduri), and Member of Parliament Harriet Jones (Penelope Wilton) to foil the plan of the alien Slitheen family from selling the Earth for commercial purposes. The Slitheen, who have infiltrated the Government of the United Kingdom, plan to get the United Nations to release nuclear activation codes so they can trigger World War III on Earth and sell the remains.\nPlot\nMickey is able to push aside the impostor police inspector advancing on Jackie in her flat. Escaping the electrical pulse of the Slitheen in 10 Downing Street, the Ninth Doctor attempts to get the police, but by the time he has returned the Slitheen get back into their suits. The Doctor escapes to the upper floors of Downing Street and reunites with Rose and Harriet in the Cabinet Rooms. Just before sealing off the rooms, the Doctor confronts the Slitheen and learns that they are a family rather than a race. The Slitheen tell him that they are not invading Earth but raiding it for some commercial purpose.\nMaking contact with Mickey, the Doctor gives him instructions on how to log into the UNIT website on his computer. The Doctor uses the information to determine that the Slitheen ship is presently in the North Sea transmitting a signal. After the Doctor figures out the Slitheen are weak to acetic acid, Jackie and Mickey use gherkins, pickled onions and pickled eggs from Mickey's flat to kill the Slitheen who was impersonating the police inspector.\nGreen and the other Slitheen declare a national emergency and request that the United Nations release the activation codes to launch a nuclear strike against a fictitious mothership. The Doctor realises that the Slitheen actually plan to fire the weapons against other countries in order to start World War III. The Slitheen plan to sell the Earth's radioactive remains as a fuel source, which they have already begun advertising through the signal. Through Harriet's insistence, the Doctor helps Mickey to hack into the controls of a Royal Navy submarine and fire a missile at 10 Downing Street, even though the Doctor is unsure whether they will survive. The Slitheen are caught in the explosion when the missile hits but the Doctor, Rose, and Harriet all survive. With the Prime Minister dead, the Doctor suggests that Harriet could become prime minister.\nThe Doctor gives Mickey a CD to upload to the internet that will remove all mentions of the Doctor from the web. He also privately offers Mickey the chance to travel with him, but Mickey admits that he is too scared to handle it. He asks the Doctor not to tell Rose about his concerns. Rose arrives with a full backpack and asks the Doctor if Mickey can come along, and the Doctor covers for him.\nProduction\nAccording to Russell T Davies (among others), this episode was called \"Aliens of London, Part Two\" until the last minute, when the name was changed to \"World War 3\", soon amended to \"World War Three\". The Telos Publishing Ltd. book Back to the Vortex cites \"10 Downing Street\" as another working title. This decision has proved to be a precedent, as in the original series all multi-episode stories shared a title from \"The Savages\" onwards. All multi-episode stories in the new series have continued to have individual titles except \"The End of Time\" and \"Spyfall\".\nCast notes\nLachele Carl reappears as the American reporter seen in \"Aliens of London\". She is later seen in \"The Christmas Invasion\", \"The Sound of Drums\", \"The Poison Sky\", \"Turn Left\", \"The Stolen Earth\", \"The End of Time\", \"The Giggle\" and the Sarah Jane Adventures story Revenge of the Slitheen. In \"Turn Left,\" it is revealed that her name is Trinity Wells. She also appeared in the spin-off Torchwood, in the five-episode serial Children of Earth.\nBroadcast and reception\n\"World War Three\" received a final rating of 7.98 million viewers in the United Kingdom. The episode received an Audience Appreciation Index score of 81.\nLike the first part of the story, \"World War Three\" has received generally mixed reviews. Arnold T Blumburg of Now Playing gave the episode a grade of C+, finding it slightly better than \"Aliens of London\" because it minimized the \"juvenile\" humour associated with the Slitheen and had good performances by the actors portraying them, though some of the effects were lacking. He criticised the direction and \"thin\" resolution of the UNIT missile operated from a home computer, but he praised the storyline with Rose's family, highlighting the performances of Clarke and Coduri. In 2013, Patrick Mulkern of Radio Times felt that Wilton's performance as Harriet Jones was the best part of the \"flashy but silly, disappointing story\". He praised Rose's storyline due to the \"vivid\" characters, though he found Eccleston's performance lacking. He also was critical of the Slitheen as believable monsters to be taken seriously. The A.V. Club reviewer Alasdair Wilkins gave the episode a grade of B−. He found the problem to be more in the execution than conception; there was a possibility of satire in the fart jokes of the Slitheen, but the direction and performances let it down. Because it veered close to being silly and not taking the Slitheen seriously, he argued that the televised version did not display its more nuanced parts, like each Slitheen having individuality, the exploration of the human race knowing about extraterrestrials, and Rose's home life. Wilkins also questioned why the Slitheen would invade a country that required the UN's permission to launch nuclear missiles. In Who is the Doctor, a guide to the revived series, Graeme Burk noted that the story was \"loved and hated by fans in equal measure\" but it was an unexpected \"delight\" for him. He found the Slitheen's humour to work on many levels and highlighted the domestic conflict and the performances. Burk's coauthor Robert Smith? [the \"?\" is part of his nom de plume] called it the closest the new series and Davies \"ever gets to pastiching the Classic Series' most beloved writer, Robert Holmes.\" He also praised the domestic situation, though he found the political satire \"one-note\" and the direction disappointing. \"World War Three\" he described as \"slight\" on plot with improbable Internet-ready missiles, but the ending was still \"wonderful\" and Eccleston's performance of the more serious material sold the episode.\nReferences\nBibliography\n*\nExternal links\n*[https://web.archive.org/web/20090201043712/http://www.bbc.co.uk/doctorwho/episodes/2005/flash/homepages/index5.shtml BBC Doctor Who Homepage]\n*\n*\n*[https://www.bbc.co.uk/mediaselector/check/doctorwho/ram/confidential5?size=16x9&bgc=CC0000&nbram=1&bbram=1&nbwm=1&bbwm=1 Doctor Who Confidential]&nbsp;— Episode 5: Why on Earth?\n*[https://web.archive.org/web/20070301134340/http://www.bbc.co.uk/mediaselector/check/doctorwho/ram/ep5trail?size=16x9&bgc=CC0000&nbram=1&bbram=1 \"Planet Earth is at war.\"]&nbsp;— Episode trailer for \"World War Three\"\n*\n}}"
    }
  ]
}