{
  "content": [
    {
      "type": "text",
      "text": "# World Cultural Council 30th Award Ceremony\n\n| location = Nanyang Auditorium, Nanyang Technological University, Singapore\n| country = Singapore\n| presenter = World Cultural Council\n| host = Professor Bertil Andersson\n| reward = Medal, diploma and $10,000US\n| year =\n| year2 =\n| holder =\n| website =\n| image2 =\n| image2size =\n| alt2 =\n| caption2 =\n| previous = 29th\n| main = World Cultural Council\n| next = 31st\n| award1_type = Albert Einstein World Award of Science\n| award1_winner = Professor Sir Paul Nurse\n| award2_type = Leonardo da Vinci World Award of Arts\n| award2_winner = Professor Petteri Nisunen & Mr. Tommi Grönlund\n}}\nThe World Cultural Council had its 30th award ceremony on 2 October 2013 at Nanyang Auditorium, Nanyang Technological University, Singapore. The ceremony co-organized by host NTU was the opening event of the Times Higher Education World Academic Summit. Ms. Indranee Rajah, Senior Minister of State, Ministry of Law and Ministry of Education was the guest of honor of the event. Assistant Professor Lok Tat Seng, Director of the Students of NTU acted as Master of Ceremonies, and renown Singaporean pianist, Mr. Lim Yan, performed a few musical compositions before the ceremony and during an intermission.\nThe WCC presented two main awards during the ceremony: The Albert Einstein World Award of Science and the Leonardo da Vinci World Award of Arts. Nobel laureate Professor Sir Paul Nurse received the Albert Einstein World Award of Science for his career as a scientific leader and his studies on cyclin-dependent protein kinases and their role in regulating cell reproduction. Professor Petteri Nisunen and Mr. Tommi Grönlund were the winners of the Leonardo da Vinci World Award of Arts because of their contribution to contemporary arts; for their interdisciplinary approach that inspires innovation and creativity. Aalto University President, Professor Tuula Teeri and Mr. Tommi Grönlund received the Leonardo da Vinci World Award of Arts during the ceremony. Professor Tuula Teeri accepted the award on behalf of Professor Petteri Nisunen.\nProfessor Colin Blakemore, Vice President of the WCC, presented the Award Winners' Book to the laureates. Professor Sir Paul Nurse, Professor Tuula Teeri, in representation of Professor Petteri Nisunen, and by Mr. Tommi Grönlund signed the book in the presence of witnesses of honor from NTU and from WCC.\nProfessor Bertil Andersson received the WCC Medal of Educational Merit as an acknowledgement to the contribution of ascendancy of NTU.\nThe WCC provided special recognitions to NTU researchers, because of their international impact of their studies: Assistant Professor Juliana Chan, Associate Professor David Lou Xiong Wen, Associate Professor Jasmine Sim Boon Yee, Assistant Professor Wang Qijie, and Professor Zhang Hua. Each received a commemorative diploma from the WCC, and a grant of $5,000 SGD from NTU.\nPrior to the award ceremony, Professor Sir Paul Nurse performed a public lecture titled \"Controlling the Cell Cycle\". Also, Nobel laureate Professor Edmond Fischer, Honorary President of the WCC, and Professor Colin Blakemore conducted public lectures in support of the ceremony.\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*"
    }
  ]
}