{
  "content": [
    {
      "type": "text",
      "text": "# World Conquest Zvezda Plot\n\n| writer          =\n| music           = Tatsuya Kato\n| studio          = A-1 Pictures\n| licensee        =\n| network         = Tokyo MX, GTV, GYT, MBS, TVA, BS11\n| network_en      =\n| first           = January 11, 2014\n| last            = March 29, 2014\n| episodes        = 12 + OVA\n| episode_list    = #Episode list\n}}\nis a Japanese anime television series produced by A-1 Pictures and directed by Tensai Okamura. It premiered on Tokyo MX, GTV and GYT on January 11, 2014. The series is written by Okamura and Meteor Hoshizora of the Japanese game company Type-Moon, with original character designs by Kouhaku Kuroboshi and Keigo Sasaki, and music by Tatsuya Kato.\nThree manga adaptations began serialization in January 2014: one by Manatsu Suzuki and one by Hamao in Ichijinsha’s Comic Rex magazine, and one by Hori in Manga 4koma Palette magazine. Aniplex USA has licensed the series from streaming and home video release in North America. Crunchyroll had added the series to its streaming. DAISUKI.net streamed the episodes as simulcast on their Website starting on 11 January with English subtitles for audience from US, Canada, South America, Africa (except Tunisia & Algeria), Europe (except Ireland, UK, France/German speaking areas), India, Russia and Middle East (all countries). Animax Asia began to add the series alongside Love, Chunibyo & Other Delusions season 2, Nisekoi, and Hamatora to premiere in Winter 2014 season. Aniplex Japan later released the series alongside Magical Warfare on March 19, 2014.\nPlot\nWorld Conquest Zvezda Plot centers around a little girl named Kate Hoshimiya (also known as Lady Venera), who is at the helm of an organization called Zvezda, which has the purpose of World Conquest. In her organization she is joined by Itsuka Shikabane (also known as Lady Plamya), Natalia \"Natasha\" Vasylchenko (also known as Professor Um), Yasubee \"Yasu\" Morozumi, Goro Shikabane (also known as General Pepel), and a robot named Roboko. One day, Asuta Jimon, a middle school boy who ran away from home due to family issues, ends up meeting Kate on the street, and subsequently getting roped into joining Zvezda with them. However, in order to conquer the world, they must defeat an organization called White Light, which is contracted out by the Japanese government to defeat Zvezda and put an end to their plots of World Conquest once and for all. White Light is composed of Renge Komadori (also known as White Robin), Miki Shirasagi (also known as White Egret), and Kaori Hayabusa (also known as White Falcon).\nCharacters\nMain characters\n; /\n:\n: A young girl of undisclosed age, and the leader of Zvezda (Russian for \"star\"), a secret organization bent on conquering the world. Despite usually behaving as a child her age, Kate has a group of loyal followers that gathered around her out of respect, friendship or fear. She also possesses the secret power of persuading every being with a human heart to do her bidding. It is later revealed, that she is immortal resp. ageless and was the leader of Zvezda since countless millennia.\n; /\n:\n:Asuta is a second-year middle school student who ran away from home. After running into Kate and getting caught in one of Zvezda's conquests, he became a member of Zvezda. A running gag is how people he meets pronounce his name wrong, calling him Jimon Asatte (meaning day after tomorrow) or Jimon Shiasatte (meaning two days from tomorrow). Having no fighting power at all unlike his peers, Asuta becomes useful to Zvezda by his cooking skills; he nevertheless possess inexplicable skills at survival, often demonstrated by his repeated success at escaping with his life every time White Heron targets him. His Zvezda alter-ego, Dva, unintentionally won White Robin's heart after he saved her from being publicly humiliated by Zvezda. It is later revealed that he is the son of the governor of Tokyo. The name Dva if translated from Russian to English is the number two. So Asuta is literally Kate's #2 henchman.\nZvezda\n; /\n:\n: A girl wearing an eye patch. She is the vanguard of the group and fights with a sword. She is Goro's daughter. She is easily irritated and usually has an angry demeanor, but is shown to have a great deal of affection for her leader Kate Hoshimiya. Shikabane is shown to have very poor culinary skills (her food actually make Asuta feel as though the world just ended after he tried it), and as a result, many of Zvezda's members skip dinner when she is cooking.\n;/\n:\n: A blonde girl who wears glasses. She is in charge of the science and technology for Zvezda. Her casual attire consists rarely of anything but black undergarments and a white lab coat. She speaks in Hiroshima dialect. Natasha originally came from Ukraine and was rescued by Kate from unknown beings (she called them \"fairies\") roaming the Ancient Udogawan tunnel between Ukraine and Japan.\n; /\n:\n: The self proclaimed \"chief soldier\" of Zvezda. In reality, Yasu is the only other low rank soldier other than Asuta Jimon. He has a tendency to get into trouble using Natasha's technology. Yasu is addicted to cigarettes, much to the resent of his fellow Zvezda members. He says he smokes them to uphold the \"bad-boy image\" he has worked hard to achieve. His loyalty to Zvezda stems from a fear of Kate Hoshimiya.\n; /\n:\n: The largest member of Zvezda, Goro Shikabane utilizes handheld explosives to fight against his opponents. He is Itsuka's father. It is shown that he and Yasu Morozumi were gangsters in the past, with Yasu working under Goro. He has a penchant for sweets, as he is shown eating cakes and various desserts even in the midst of battle. He substitutes sweets for his past addiction to cigarettes. In the epilogue, he and his sister-in-law Kaori are married to each other.\n;\n:\n: A robotic girl. She joined Zvezda after meeting up with Natasha in the tunnels left behind by the ancient Udogawa civilization and being rescued by Kate. She eats udo as the source of her power.\nWhite Light\n; /\n:\n: One of Asuta's classmates. She is secretly Second Lieutenant White Robin, a member of the justice squad White Light and White Egret's subordinate. She has romantic feelings for Asuta, but initially had total disdain for his alter ego Dva after he accidentally acted perversely towards her as White Robin. She is clumsy at school, which she attributes to fatigue from her work as White Robin. Together with Miki, she is tasked with stopping Zvezda's world conquest. Despite her desire to bring justice, she is willing to disobey her superiors if she believes that their orders are unjust.\n; /\n:\n: Another one of Asuta's classmates. She is secretly Sergeant White Egret, a member of White Light and is a proficient fighter, capable of taking on both Plamya and General Pepel at the same time. She is a model student at school who excels at sports and gets the top grades on exams. Together with Renge, she is tasked with stopping Zvezda's world conquest. She will carry out any orders intended to bring justice by her superiors even if she believes they are unjust.\n; /\n:\n: A voice actress who is also an agent for White Light called White Falcon. She is the voice of the heroine in Kate's favorite TV show Robo Butler under the alias Kaorin Machimoto. She is Goro's sister-in-law and Itsuka's aunt. She has a strong hatred towards Zvezda for causing the death of her older sister Tsubaki. In the epilogue, with her marriage to Goro, she joined Zvezda.\nOther characters\n;\n:\n: Asuta's father, as well as the Governor of Tokyo. He has been keeping a close watch on the activities of Zvezda and uses military force to stop them. He is on a quest to annex all of Japan to become part of Tokyo so that he can rule all of Japan. He is quick to resort to military force which eventually causes him to lose the support of the Prime Minister.\n;\n: Goro's deceased wife, Itsuka's mother, and Kaori's older sister. Her death led Kaori to join White Light.\n;\n: A pastry chef who was once a member of Goro's gang. He sacrifices himself to allow Goro to escape with the military force in pursuit. In the epilogue, it is revealed that he survived.\nEpisode list\n{|class=\"wikitable plainrowheaders\" style=\"width:98%; margin:auto; background:#FFF;\"\n|-\n! style=\"width:3em;\"  | No.\n! Title\n! Directed by\n! Written by\n! style=\"width:12em;\" | Original air date\n|-\n| ShortSummary    = A young runaway named Asuta Jimon has a chance encounter with a young girl while wandering the streets at night. Little does he know this cute little girl, Hoshimiya Kate, is really the leader of Zvezda, an organization bent on world conquest. Taking her talk of world conquest as a simple flight of fancy Asuta walks with her and plays along to an extent. He soon realizes the import of her words when he is confronted with a swarm of dangers and strange happenings.\n}}\n| WrittenBy = Meteo Hoshizora\n| OriginalAirDate =\n| ShortSummary    = Asuta having wondered the streets all night sleeps through school. After the bell, he is greeted by Itsuka, a member of Zvezda, who was sent to bring him back to Zvezda's secret headquarters, coerced with the promise of food he follows her. Asuta is dismayed by the horrible quality of the food Itsuka herself prepared, as were the Zvezda members, most of which ran out on the meal. There is an introduction to another secret society in this episode, White Light. To make things worse, Zvezda's giant biological weapon is deployed prematurely, forcing the members of Zvezda to subdue it. That said and done with, a fight breaks out about Itsuka's questionable cooking ability, after which it is resolved that Asuta should do the cooking and also teach Itsuka how to cook.\n}}\n| WrittenBy = Tensai Okamura\n| OriginalAirDate =\n| ShortSummary    = After booting Yasu out of the hideout for smoking, the group go out for a meal, only to have their experience ruined by more smokers. Having had enough, Kate declares war on smokers, soon rallying the city's residents to drive them out of town. This ends up pushing the remaining smokers to their most desperate, resulting in a chaos that neither Zvezda nor White Light can vanquish.\n}}\n| WrittenBy = Meteo Hoshizora\n| OriginalAirDate =\n| ShortSummary    = The Zvezda hideout's energy source, generated from the Udo that grows underneath the base, ceases to supply power. Kate, Asuta, Natasha, and Roboko go underground to investigate what is causing the Udo to die out.\n}}\n| ShortSummary    = As Kate tasks the others with figuring out the secret identity of White Light's captain, White Robin, Asuta suspects that it may be his classmate, Renge Komadori.\n}}\n| WrittenBy = Shōtarō Suga\n| OriginalAirDate =\n| ShortSummary    = Kate and Roboko enroll into Asuta's class and, together with Asuta and Renge, they investigate a mysterious After School Treasure Club and infiltrate it.\n}}\n| WrittenBy = Shōtarō Suga\n| OriginalAirDate =\n| ShortSummary    = The Treasure Club turns out to be a trap laid out by White Light's White Egret, aka Miki Shirasagi, whilst Asuta and Kate come across a more incredible and dangerous treasure.\n}}\n| WrittenBy = Meteo Hoshizora\n| OriginalAirDate =\n| ShortSummary    = White Light's commander, White Falcon, aka Kaori Hayabusa, hatches a plan to trick Kate into bringing her into her hideout.\n}}\n| WrittenBy = OKSG\n| OriginalAirDate =\n| ShortSummary    = Both Zvezda and White Light coincidentally have company vacations at a masked hot spring inn, where Asuta (as Dva) and Renge (as White Robin) get to know each other. Objecting to this, Miki launches her attack, during which Renge stands to protect Dva, learning of his identity as Asuta.\n}}\n| WrittenBy = Meteo Hoshizora\n| OriginalAirDate =\n| ShortSummary    = West Udogawa is in a state of emergency as White Light declares war on Zvezda and destroys their base, having Kate and the others on the run.\n}}\n| WrittenBy = Meteo HoshizoraOKSG\n| OriginalAirDate =\n| ShortSummary    = With the city taken over by White Light and many of the Zvezda members captured, Asuta contemplates what he should do.\n}}\n| WrittenBy = Meteo Hoshizora\n| OriginalAirDate =\n| ShortSummary    = The members of Zvezda gather for the final battle against Asuta's father, the Governor of Tokyo, to make their very first step to world domination.\n}}\n| WrittenBy = Shōtarō Suga\n| OriginalAirDate =\n| ShortSummary =\n}}\n|}\nReferences\nExternal links\n* [http://www.sekaiseifuku-zzz.com/ Official Website]\n* [http://www.aniplexusa.com/zvezda/ Official USA Website]\n*"
    }
  ]
}