{
  "content": [
    {
      "type": "text",
      "text": "# World War II in popular culture\n\nThere is a wide range of ways in which people have represented World War II in popular culture. Many works were created during the years of conflict and many more have arisen from that period of world history.\nSome well-known examples of books about the war, like Nobel laureate Kenzaburō Ōe's Okinawa Notes, could only have been crafted in retrospect.\nArt\nThe years of warfare were the backdrop for art which is now preserved and displayed in such institutions as the Imperial War Museum in London and the National Maritime Museum at Greenwich.\nIconic memorials created after the war are designed as symbols of remembrance and as carefully contrived works of art.\nLiterature\nThe war also figures prominently in many thousands of novels and other works of literature, including many published in the 1990s and 2000s.\nPoetry\n* High Flight (1941) by John Gillespie Magee Jr. (US pilot flying with a Canadian Spitfire squadron during the Battle of Britain).\nDrama\n* Misha: A Mémoire of the Holocaust Years (1997)\n* Watch on the Rhine (1940)\n* Winged Victory (1943)\n* Mister Roberts (1948)\n* South Pacific (1953)\nNovels\nManga\n* Barefoot Gen\n* Onward Towards Our Noble Deaths\n* Showa: A History of Japan\n* Tetsujin 28-go\nMovies and television\nSocial historians regard the works of popular culture from the World War II era as documents that mirror and define crucial issues and concerns during that time. Individual combatants and those on the home fronts during World War II experienced the war through newspaper reports, radio broadcasts, films, stage plays, books and popular music—all become noteworthy aspects of understanding the period and its impact on what happened afterward.\nWorld War II has provided material for many films, television programmes and books, beginning during the war. The film aspect had reached its peak by the 1960s, with films such as The Longest Day (which had been adapted from a book), The Great Escape, Patton and Battle of Britain. In the United Kingdom the actor Sir John Mills became particularly associated with war dramas, such as The Colditz Story (1954), Above Us the Waves (1955) and Ice Cold in Alex (1958), and was seen as the personification of Britain at war, conveying heroism and humility.\nMovies about World War II continued for the rest of the 20th century and into the 21st century, though less in number and included ''Schindler's List (1993), The boy in the Striped Pajamas (2009), The Thin Red Line (1998), Saving Private Ryan (1998), Flags of Our Fathers (2006) and Red Tails (2012) about the African-American Air Fighter pilots of the Tuskegee Airmen. Movies and television programs about the war continued to be made into the 21st century, including the television mini-series Band of Brothers, The Pacific and Dunkirk. The majority of World War II films are portrayed from the Allied perspective. Some exceptions include Das Boot (1981), Downfall (2004), Letters from Iwo Jima (2006), Stalingrad (1993), Joy Division (2006), and Cross of Iron (1977). World War II used to provide most of the material for the History Channel (United States). Mel Brooks used the theme in the fictitious musical \"Springtime for Hitler\" which appears in his film The Producers (1968), later the basis for the 2001 musical.\nMany television comedy sitcoms have used the war as a setting, e.g. Hogan's Heroes from America, which follows the actions of a group of Allied POWs involved in covert activities. Three British sitcoms from David Croft are Dad's Army which satirizes the British Home Guard, an anti-invasion force of men who are mostly too old to join the forces; It Ain't Half Hot Mum about a Forces Concert Party entertaining troops in India and Burma, and 'Allo 'Allo! which finds humour in the French Resistance. In \"The Germans\" episode of Fawlty Towers, Basil Fawlty (John Cleese) repeatedly insists his staff be polite to their German guests (\"don't mention the War!\") which he signally fails to demonstrate himself. In 2009, an anime adaptation of the webcomic Hetalia: Axis Powers was released and parodies the characters as countries and their transactions in the war through social adult issues.\nMany non-war-related TV shows in the United States, such as The Simpsons, South Park, The Looney Tunes Show and Seinfeld frequently make references to World War II-related persons and subjects, such as Adolf Hitler, Franklin Roosevelt, battles during the war, The Holocaust and the bombings of Hiroshima and Nagasaki. During the war several Donald Duck shorts were also propaganda films.\nHolocaust films\nAlso, some films and TV series attempt to show and educate the future generation about the horror of racism and discrimination when taken into a national frenzy by making films based on the Holocaust and other German war crimes. Movies like Schindler's List, Anne Frank: The Whole Story, Life Is Beautiful, The Devil's Arithmetic, The Pianist, The Boy in the Striped Pajamas and many other films depict the hardship the Jews endured in Auschwitz and other concentration camps.\nEastern Asia\nDue to the still sensitive subject between China, Japan and Korea, the War in the Pacific and the Second Sino-Japanese War is hardly made into any historical war films intended for entertainment use in these countries. However, reference about the ongoing war as a background setting is heavily used as a setpiece to drive the storyline on. For example, Hong Kong martial arts films have used the \"cartoon villain\" portrayal of Japanese soldiers or generals being defeated by the Chinese lead character in an attempt to stop the Japanese from using biological weapons or stealing Chinese treasures (films like Fist of Fury, Millionaire's Express and Fist of Legend). Some films that depict Japanese war crimes were also made, such as the controversial exploitation film Men Behind the Sun.\nMore serious documentary style films have also been made such as the German made documentary Nanking. However the depiction of the Defense of Sihang Warehouse was made in 1938, one year after the actual Battle of Shanghai, probably one of the earliest Sino-Japanese war film intended for entertainment and moral boosting propaganda. Also recently, to celebrate the Chinese Red Army first victory (out of two major battles the Communists actually fought) over the Japanese, a heavy-handed propaganda film that depict the Battle of Pingxingguan was made in 2005 to commemorate the 60th anniversary. However it was heavily criticised by the government of Taiwan, accusing the PRC government for hiding the truth by discrediting the Nationalist Revolutionary Army who took the brunt of the battles as it was they who did most of the fighting against the invaders in more than twenty battles. Actually, the PRC has made several films focusing on battles fought by Nationalist soldiers, such as the Battle of Taierzhuang and Battle of Kunlun Pass.\nSouth Korea, which still has strong anti-Japanese sentiments, recently made a TV series about the Japanese assassination of Empress Myeongseong and the unfair treatment of the Korean people; several films based on Kim Du-han as a freedom fighter were made.\nAnti-Nazism and Anti-Fascism\n* Confessions of a Nazi Spy (1939)\n* Night Train to Munich (1940)\n* The Great Dictator (1940)\n* Man Hunt (1941)\n* Casablanca (1942)\n* Watch on the Rhine (1943), film version of 1940 play on Broadway\n* Remake (2003)\nPatriotism\n* Sherlock Holmes and the Secret Weapon (1942)\n* The Voice of Terror (1942)\n* Yankee Doodle Dandy (1942)\n* Sherlock Holmes in Washington (1943)\nHeroism\nWartime problems\n* Thank Your Lucky Stars (1943)\n* The More the Merrier (1943)\n* Cover Girl (1944)\n* Since You Went Away (1944)\n* A Bell for Adano (1945), film version of 1944 Pulitzer Prize-winning novel\nEscapism\n* Sun Valley Serenade (1941)\n* Harvey (1950), film version of 1944 play on Broadway\n* Oklahoma! (1955), film version of 1943 play on Broadway\n* Arsenic and Old Lace (1944), film version of 1941 play on Broadway\n* The Harvey Girls (1946), film version of 1942 novel\n* Willy Wonka & the Chocolate Factory: The photo used to describe the fraudulent golden ticket finder in Paraguay is a photograph of Martin Bormann, who was rumored to have escaped to Paraguay after the war.\nPropaganda\n* Target for Tonight (1941)\n* U-Boote westwärts (1941)\n* Battle of Midway (1942)\nGames\nTraditional board wargaming has replicated World War II from the tactical to the grand strategic levels. Axis & Allies and other such games continue to be popular. Avalon Hill and other wargame companies produced such complex games as Squad Leader and PanzerBlitz'' in the 1970s. Other popular World War II games still in production include Australian Design Group's World in Flames and Decision Games reproductions of SPI World War II games.\nWorld War II has also been replicated through miniatures tabletop wargaming. Games like Flames of War, Command Decision, Spearhead, BlitzkriegCommander and others have become popular among historical miniature wargamers. A novelty is the upcoming of free internet based wargames in high quality such as Final Round.\nWorld War II has long been a popular setting for video games. In fact, the first historically-based war video game was Computer Bismarck (1980), a turn-based game which focused on the last battle of the battleship Bismarck. The war has been one of the most popular settings for video games and the setting of some of the most popular games, though the proportion of war video games in a modern setting increased following the 2003 invasion of Iraq.\nSome of the most prominent World War II game series include Medal of Honor, Battlefield and Call of Duty, though these series eventually branched out beyond that setting. Certain games are set entirely in one battle or operation (such as Attack on Pearl Harbor), certain games are set in one theater (such as Medal of Honor: Rising Sun) and certain games take place in multiple theaters (such as Battlefield 1942). The setting has appeared in diverse genres of video games but is used most often for first-person shooters, real-time tactics games and flight simulators.\nThe Soviet Union and Russia\nThe Soviet Union incurred the heaviest casualties in World War II, and its history gave rise to an impressive number of films, poetry and prose, both in Russian and in many other languages of the country. The cultural homage to the Soviet soldiers and victims of World War II has been brought for decades; films about the war are shot in modern-day Russia up to present day.\nA few pinnacles of the Soviet cinema dedicated to World War Two include:\nThe Cranes Are Flying by Mikhail Kalatozov, ''Ivan's Childhood by Andrei Tarkovsky and The Alive and the Dead'' by Aleksandr Stolper. Elem Klimov's Come and See is widely considered to be one of the greatest war movies ever made.\nPoetry: \"the Cranes\" by the renowned Dagestani poet Rasul Gamzatov, \"Wait for me\" by Konstantin Simonov, \"I am Goya\" by Andrei Voznesensky, \"It has snowed for three days\" by Mustai Karim (a Bashkir poet).\nSensitive issues\nIn 1970, Ōe wrote in Okinawa Notes that members of the Japanese military had coerced masses of Okinawan civilians into committing suicide during the Allied invasion of the island in 1945. In 2005, two retired Japanese military officers sued Ōe for libel; and in 2008, the Osaka District Court dismissed the case because, as the judge explained, \"The military was deeply involved in the mass suicides\". Ōe commented succinctly by saying, \"The judge accurately read my writing.\"\nWorld War II reenactment\nSee also\n* World War I in popular culture\n* The Holocaust in popular culture\n* List of World War II films\n* Waffen-SS in popular culture\n* Winter War in popular culture\n* Japanese history textbook controversies\n* Prelude to War\n* Adolf Hitler in popular culture\nNotes\nReferences\n* Henkes, Robert. (2001). [https://archive.org/details/worldwariiinamer0000henk  World War II in American Art.] Jefferson, North Carolina: McFarland.\n* Meredith, James H. (1999). [https://archive.org/details/understandinglit0000mere  Understanding the Literature of World War II: A Student Casebook to Issues, Sources, and Historical Documents.] Westport, Connecticut: Greenwood Publishing Group.\n* Rosenfeld, David M. (2002). [https://books.google.com/books?id=iIeyCNiD43sC  Unhappy Soldier: Hino Ashihei and Japanese World War II Literature.] Lanham, Maryland: Lexington Books.\n*Roy, Pinaki (2006) \"The Stomach of a War: Perceiving Second World War through Keith Douglas's Poems\". The Atlantic Critical Review Quarterly (; ) 5(4), October–December 2006: 1–13.\n* Roy, Pinaki (2010). The Scarlet Critique. New Delhi:Sarup Book Publishers.\n* Roy, Pinaki (2011). \"''Here're the War poets: Keith Douglas and Other English Versifiers of the Second World War\". The Atlantic Literary Review Quarterly (, )12 (4), October–December 2011: 23–36.\n* Roy, Pinaki (2013). \"Love in Times of War: Amorous English Poems of the Second World War\". The Visva-Bharati Quarterly () 21 (3 & 4) and 22 (1 & 2), October 2012 – September 2013: 142–55.\n* Roy, Pinaki (2014). \"Muses at Arms: Reading Select Second World War Poems by Keith Douglas and Alun Lewis\". Modernism vis-à-vis Postmodernism: A Sojourn. Ed. Dasgupta, A. Howrah: Imprint, 2014. pp.&nbsp;148–56.\n* Roy, Pinaki (2020). \"The History of War-plays: A Brief International Exploration\". Theatre International'' (ISSN 2278-2036), XII (January 2020): 90–99.\n*\nExternal links\n* Canadian War Museum: [http://www.warmuseum.ca/cwm/exhibitions/artwar/introduction_e.shtml  \"Australia, Britain and Canada in the Second World War\"], 2005.\n* [http://litten.de/fulltext/ehon.pdf F.S. Litten: \"Animals, children and war in Japanese picture books\", 2011]\n* [https://www.imdb.com/title/tt0068161/ A zori zdes tikhie] a film by Stanislav Rostotsky"
    }
  ]
}