{
  "content": [
    {
      "type": "text",
      "text": "# World War III (miniseries)\n\n| last_aired           =\n}}\nand David Soul]]\nWorld War III is a miniseries that aired on the NBC television network on January 31, 1982.\nPlot\nThe story begins in 1987. At the critical point of the Cold War, two US Air Force airmen monitor their radar screens at a quiet and remote NORAD facility in Alaska. Suddenly, one of the radar operators notices an unidentified aircraft sneaking in on the leading edge of a weather front. He alerts his partner about the threat and begins to contact Elmendorf AFB. The other Airman retrieves a silenced MAC-10 from his desk and kills him. He then proceeds to shoot the remaining station personnel while they are sleeping in their bunks. Lighting a cigarette, the traitor notifies Elmendorf that the station will be out of commission for the next hour to repair a malfunctioning generator. It is learned later that the traitor was a deep cover KGB operative who had been in the Air Force for 15 years. The necessary blind spot has been created in the radar for the plane to continue undetected into Alaska.\nOut of the plane, the Soviets launch a secret incursion into Alaska. The Soviets have inserted a cold weather Spetsnaz assault force of approximately 35 to 40 KGB desant ski troops led by Soviet Colonel Alexander Vorashin (Jeroen Krabbé) into northern Alaska with a track-driven armored vehicle. Vorashin's orders are to seize control of a strategically located pumping station along the Trans-Alaska Pipeline to threaten the placement of floating explosive devices in the stream of oil and to destroy substantial portions of the pipeline. The operation is being conducted in response to the US grain embargo of the Soviet Union, just as the 1980 grain embargo was in response to the 1979 Soviet Invasion of Afghanistan.  The governments of Canada, Australia, and Argentina have joined the US in the embargo, which has caused severe food shortages and domestic unrest inside the Soviet Union. A squad of 18 lightly armed soldiers of the Alaska Army National Guard and Alaskan Scouts, which is on a training exercise, is discovered, ambushed, and killed by the Soviet invaders. At Fort Wainwright, Colonel Jake Caffey (David Soul), a combat veteran of the Vietnam War, is sent by his commanding officer to locate the soldiers, who are 24 hours late in reporting back from the training exercise. Caffey flies to the National Guard temporary patrol base to meet with the other half of the Guard company. Caffey goes out on a search mission and discovers one of the Alaskan Scouts still alive and learns of the Soviet incursion. Caffey then shadows the Soviet troops after notifying the Fort Wainwright commander, General Roberts. The general flies to the scene but is killed in a firefight. Caffey takes command of the Guardsmen and notifies the Pentagon by radio of the situation.\nUpon learning of the situation, US President Thomas McKenna (Rock Hudson) orders Caffey's National Guard troops to be federalized and orders Caffey to do all that he can to stop the Soviet troops. McKenna orders a media blackout on the emergency but then orders US forces to be mobilized in response to the Soviet incursion under the pretext of unscheduled training exercises. McKenna fears that the US people will demand a declaration of war against the Russians for the attack. Fierce winter weather prevents US military units from bases and forts in southern Alaska from reinforcing Caffey's unit. Caffey deduces the Soviet assault unit's goal. He uses the two US Army helicopters at his disposal to move his unit to a new pumping station ahead of the Soviets.\nMeanwhile, Soviet Premier Gorny (Brian Keith) has learned that the Soviet military and KGB leadership have executed the plan without his permission. He is informed of the US mobilization and orders Soviet forces to a similar posture. In Alaska, Colonel Caffey realizes that his men have an inadequate supply of ammunition, grenades, and mines. Using combat tactics that he learned in Vietnam, Caffey sets up a defensive perimeter around the pumping station making use of surplus lengths of large-bore oil pipe to establish a position from which to ambush the enemy. The Soviet troops approach the pumping station, unaware of the American soldiers' presence until they trigger US land mines buried in the snow. The Soviets suffer casualties and fall back, but they continue to surround the buildings. McKenna and Gorny secretly meet in Iceland to negotiate an end to the crisis. They are unable to reach an agreement, and both return to their countries but promise each other that the talks will continue.\nThe US responds to the Soviets' continuing mobilizations, as officials recognize that they are consistent with a fictional contingency plan, Красный Флаг, or \"Red Flag.\" McKenna orders all American ballistic missile submarines, surface warships, B-1s, and B-52s to deploy in readiness for war. He directs US bombers to fly continuous paths just outside Soviet airspace. Caffey and his soldiers continue to repel the Soviet attacks on the pumping station in Alaska, but his soldiers are running low on ammunition and supplies.  McKenna contacts Caffey by radio and asks him and his soldiers to hold out at all costs in the hope that the weather will break so that reinforcements can be sent to relieve them. Caffey obeys but hopes for a diplomatic solution. Gorny also hopes for a negotiated settlement to the crisis. However, hardline members of the Communist Party and the KGB, who remain incensed by the Soviet food shortage, suddenly launch a coup d'état. They use a car bomb to assassinate Gorny while he visits the school that is attended by his young son, Sasha.\nIn the meantime, the Soviet troops in Alaska launch a final assault on the pumping station. Soviet Colonel Vorashin, however, has become concerned about the rapidly-growing prospect of a nuclear war and requests a parley with Caffey. After an emotional conversation, Vorashin and Caffey agree to discontinue the fighting. However, at that moment, the Russian political officer, Major Nicolai Samaaretz, hurls a grenade, which kills both men.\nThe situation collapses in bloodshed, with a sergeant of the Alaskan Scouts managing to send one final message that the last US position is being overrun. Receiving the news, McKenna calls the Soviet leadership and discovers that Gorny is unavailable to speak with him. The Soviet leadership claims that Gorny has been felled by severe intestinal flu and that their forces will withdraw to pre-crisis positions, but McKenna does not believe them and realizes that pro-war elements of the KGB are seizing control of the Soviet Union. Once the telephone conference ends, McKenna submits to the National Security Council his belief that Gorny has been killed and that total war is imminent. He is correct since at that moment, the coup leaders decide on an all-out nuclear strike, some of them mistakenly believing that US law requires the President to obtain congressional approval before an American nuclear attack. However, McKenna has already deduced the enemy strategy. Horrified and nearly in tears, he concludes that the situation is unrecoverable and so orders a full nuclear counterstrike on the Soviet Union.\nCold War themes\nThe film focuses on a number of Cold War themes, including brinksmanship, political loyalty and the mutual distrust as both sides attempt to resolve the issue diplomatically while they escalate their military alert levels to force the other to back down.\nCast\nThe cast included Rock Hudson as the US president, Brian Keith as the Soviet premier, and Cathy Lee Crosby and David Soul as US military officers. It also included Jeroen Krabbé, Robert Prosky, Katherine Helmond and James Hampton.\nProduction notes\nRobert L. Joseph wrote the miniseries.\nThe director, Boris Sagal, was killed in a helicopter accident in Oregon during the early stages of production. He was replaced by David Greene.\nAccording to Rock Hudson and other sources, prior to Sagal's death, the ending of the miniseries was left open-ended so that either a sequel miniseries or a full season series could be spun off if the first miniseries was a ratings success. However, it was not, and the miniseries concludes with the US releasing nuclear forces against the Soviets and vice versa since the Soviets feel that the US will not abandon the grain embargo. The miniseries ends with a photo montage that is rather similar to Fail-Safe of large groups of people across the globe in various international settings looking up to the skies. It includes the sound effects of missiles and jets escalate in tone and volume and concludes with a shot of a sunset and a quick cut to black.\nNovelization\nA novelization of the teleplay, which differs from the miniseries as aired in several key respects, was written by Harold King under the pen name Brian Harris. Its 1981 publication by Pocket Books anticipated the airing of the miniseries by several months. It is undocumented whether the changes were King's, or whether they reflected an earlier draft of the script.   Among the key differences (1) Gorny is not killed by the KGB but in the end does their bidding (2) the US forces actually beat back the Soviet attempted seizure of the pipeline but because of a loss of communications, the US and Soviet leaders never learn this.\nReferences\nExternal links\n*"
    }
  ]
}