{
  "content": [
    {
      "type": "text",
      "text": "# Worldwar series__disambig_1\n\nWarworld}}\n}}\n| author        = Harry Turtledove\n| country       = United States\n| language      = English\n| genre         = Science fictionAlternate history\n| publisher     =\n| pub_date      = 1994–2004\n| media_type    = Print (hardback & paperback)\n| pages         =\n| preceded_by   =\n}}\nThe Worldwar series is the fan name given to a series of eight alternate history science fiction novels by Harry Turtledove. Its premise is an alien invasion of Earth during World War II, with a timeline ranging from 1942 to 2031. The series includes Turtledove's Worldwar tetralogy, the Colonization trilogy, and the novel Homeward Bound. The early series was nominated for a Sidewise Award for Alternate History in 1996.\nSeries premise\nWorldwar deals with a military invasion that begins on or around May 30, 1942 by a reptilian species of aliens that calls itself The Race. It had reached Earth's orbit in December 1941 but delayed the attack for various reasons.\nAlthough the Race has the advantage of superior technology, its information on humanity had been collected by a robotic probe during the 12th century AD. The invaders are surprised to find that humanity progressed far more rapidly than any other species that they had previously studied and conquered. At the time of invasion, the Race's technology is only marginally more advanced than 20th-century Earth technology. The commander hesitates and considers turning back without revealing The Race's presence to the humans, but ultimately decides to avoid the disgrace of doing so.\nThe narrative follows the intersecting paths of a large number of human and alien characters. Notably, the series depicts how the Axis and Allied powers must cooperate to fight the alien menace.\nIt is gradually revealed that the Race unified its home planet into a single state with military technology at a level similar to that of humans in the late 20th century. For most of the tens of thousands of years afterwards, it fought no wars and so had no incentive or need to develop more advanced weapons; most of the time, it maintained no army at all. Only the discovery of other planets with intelligent beings made the Emperor proclaim a \"Soldier's Time\" and build up an army. The weapons developed during the previous wars, when the home planet was unified, were enough to conquer the other planets. With Earth, the various human nations were faced with arms some decades ahead of theirs but were soon able to close the gap.\nLiterary theme\nTurtledove approaches the novels' science fiction scenario by focusing less on the technological and fantasy elements that are typically associated with the genre. Instead, he shows more concern for the role of more mundane affairs, such as the political repercussions of an alliance between the Allied and the Axis powers, the impact the presence of alien creatures has on human society, and the ways in which warfare is paradoxically a hindrance to civilization and simultaneously a catalyst for the progress of civilization.\nParticular attention is given to the deep dilemma facing the Jews in both Poland and Palestine. The invaders, by landing in 1942, stop the ongoing Holocaust and close down Auschwitz. The Jews are grateful, but collaborating with the reptile invaders would brand the Jews as traitors to humanity.\nFirst series\nThe first series consists of four volumes:\n* Worldwar: In the Balance (1994)\n* Worldwar: Tilting the Balance (1995)\n* Worldwar: Upsetting the Balance (1996)\n* Worldwar: Striking the Balance (1996)\nIt ends with neither humanity nor the aliens triumphing. Instead, each side fights to the point that, facing mutually-assured destruction, they settle into an uneasy ceasefire. The aliens want to colonize Earth and have nuclear weapons, but they want to use them only sparingly as they cannot colonize a radioactive wasteland after a full-scale nuclear exchange.\nThe invasion ultimately ends with all of the major Allied and Axis powers managing to develop their own nuclear weapons, which results in a stalemate. The Race is left in control of roughly half the planet, primarily colonial possessions in the Southern Hemisphere: Africa, South and Central America, Australia, and most of Asia aside from the Soviet Union and a few Japanese coastal holdings.\nColonization trilogy\nThe second series of novels, the Colonization trilogy, is set in the 1960s:\n*Second Contact (1999)\n*Down to Earth (2000)\n*Aftershocks (2001)\nThe series deals with the interaction between surviving humans and the Race. Opening with the arrival of the colonization fleet, the series ends with the defeat of Nazi Germany and the establishment of a permanently occupied US space station in the asteroid belt. Part of the series focuses on the Reich-Race War of the mid-1960s, when the Greater German Reich and the Race fight a nuclear war.\nThe Germans lose and are forced to allow France to become an independent nation again under a new Fourth Republic. Nonetheless, it is a costly victory for the Race since fighting Germany on its own after 20 years of human technological advancement proved to be much more difficult than fighting all free human nations earlier. It is left obvious to both sides that the long-term trends are in humanity's favor.\nThe Race is also faced with ongoing guerilla wars in much of the territory that they conquered, especially by insurgents such as the Kuomintang and Communists in China, as well as militants in the Middle East influenced by Khomeini. The Race, who are conservative monarchists and chauvinists who take the superiority of the Empire as axiomatic, find it difficult to understand why the \"Big Uglies\" (a derogatory term for the Race's enemy similar to 'Hun' or 'Charlie' in WWI or Vietnam) continually and constantly attempt to rebel against them, as well as why some of their policies (like introducing a tax on religious worship) do not work. Nonetheless, they recognise the recklessness of, and danger posed by, the Tosevites (Tosev being the Race's term for earth).\nAnother major issue turns out to be ginger, an innocent flavoring in human cuisine but a powerful narcotic for the Race's metabolism. It creates problems of addiction and helps create new criminal networks involving both humans and rogue members of the Race. Moreover, inhaling ginger causes females of the Race to become sexually active outside of their normal mating season. This creates new problems, as the Race has no concept whatsoever of sexual activity being private, and when sexually aroused, it tends to engage in indiscriminate orgies to the scandal of the humans who happen to watch. Members of the Race find it difficult to understand humans' insistence on sex being a private act, as well as the humans' great annoyance when reptiles walk in on them while engaged in it.\nThe cultural gap between the males of the Conquest Fleet of the Race; and the males and females of the Colonization fleet who did not know of the state of affairs at Tosev; is also explored. The latter is appalled at the former for not having conquered the planet in its entirely and at having to share it with native \"Big Uglies\", while the former is disgusted by the dogmatism, naivety, and rigidity of the Colonization Fleet, whom they judge to have no idea of the people around them and the effort taken to secure the Race's position as the overlord of half the planet.\nHomeward Bound\nThe final novel in the saga deals with humanity reaching the Race's homeworld, \"Home\" (Tau Ceti II).\n*Homeward Bound (2004)\nList of characters\nHumans\n*'Mordechai Anielewicz (historical): Anielewicz, together with other Polish Jews, is liberated from Nazi occupation by the Race. In the wake of salvation, Anielewicz is faced with the agonizing dilemma between siding with the Race against Nazi Germany or fighting against the Race, an act that would make them allies of the Nazis.\n*Flight Lieutenant George Bagnall: A flight engineer in the Royal Air Force.\n*David Goldfarb: A radar operator in the Royal Air Force.\n*Lieutenant Ludmila Gorbunova:' One of many female pilots in the Soviet Union's Red Air Force.\n*'Colonel Leslie Groves (historical):' The head of America's atomic bomb development.\n*Colonel Heinrich Jäger: A tank commander in the German Sixth Army who is advancing on Stalingrad when the alien invasion begins. He is depicted as a good and somewhat charismatic officer.\n*Jens Larssen: A physicist at the University of Chicago. He is sent on a cross-country trip to alert the US government of the importance of the atomic bomb project.\n*'Vyacheslav Molotov (historical):' The head of the Soviet Union's Foreign Ministry. He is among the first humans to orbit the Earth and is instrumental in negotiating the Peace of Cairo with the Race.\n*Moishe Russie: A student of medicine in Poland when the Germans invaded in 1939.\n*'Otto Skorzeny (historical): The Waffen-SS Hauptsturmführer, he is known for his unconventional thinking. The commando becomes a particularly feared human to the Race.\n*Sam Yeager: A minor-league ball player with the Decatur Commodores when the invasion takes place. Like many young men, he tried to enlist in the army in the wake of the Japanese attack on Pearl Harbor at the end of 1941 but was rejected for a medical issue.\n*Liu Han: A Chinese housewife whose innocuous village was raided by the Race and Japanese forces almost simultaneously. Kidnapped by the Race to be a part of their experiments, she becomes connected with the communist guerrillas in China, eventually joins the party, and rises through the ranks to become a leader in the revolutionary movement.\nThe Race\n*Fleetlord Atvar:' The commander of the Race's Conquest Fleet.\n*Flight Leader Teerts: A killercraft pilot from the Conquest Fleet. He is among the jet fighters that rapidly neutralize human air power in the opening days of the invasion.\n*Straha: A Shiplord (ship captain) who vocally opposes Atvar's strategies.\n*Ussmak: A driver for the crew of a landcruiser in the Conquest Fleet. He is one of the Lizard \"Everyman\" viewpoint characters.\nHistorical characters\nNumerous historical characters also appear, some having brief cameos and others having significant parts in the plot:\n; In the Balance\n* Tadeusz Bór-Komorowski: General in the Polish Home Army. In reality, he became commander of the Home Army in the second half of 1943, after the previous commander, Stefan Grot-Rowecki, was arrested by the Gestapo.\n* Winston Churchill: Prime Minister of the United Kingdom\n* Adolf Hitler: German Führer\n* Cordell Hull: US Secretary of State\n* George Marshall: US Army Chief of Staff\n* George S. Patton: US Army Major General\n* Joachim von Ribbentrop: German foreign minister\n* Leó Szilárd: Nuclear physicist, University of Chicago Metallurgical Laboratory\n* Hans Thomsen: German ambassador to the United States\n* Shigenori Tōgō: Japanese foreign minister\n* Walter Henry Zinn: Nuclear physicist, University of Chicago Metallurgical Laboratory\n* Enrico Fermi: Italian nuclear physicist, University of Chicago Metallurgical Laboratory\n; Tilting the Balance\n* Eric Blair: BBC talks producer, Indian Section, London. Better known by his pen name, George Orwell.\n* Kurt Chill: Wehrmacht general and interpreter in Pskov\n* Arthur Compton: Nuclear physicist with the Metallurgical Laboratory\n* Kurt Diebner: Nuclear physicist, Hechingen, Germany\n* Enrico Fermi: Nuclear physicist with the Metallurgical Laboratory\n* Laura Fermi: Enrico Fermi's wife\n* Georgy Flyorov: Soviet nuclear physicist\n* Winston Churchill: Prime Minister of the United Kingdom\n* Werner Heisenberg: Nuclear physicist, Hechingen, Germany\n* Cordell Hull: US secretary of state\n* Ivan Konev: Red Army general\n* Igor Kurchatov: Soviet nuclear physicist\n* Edward R. Murrow: Radio news broadcaster\n* Yoshio Nishina: Japanese nuclear physicist\n* Joachim von Ribbentrop: German foreign minister\n* Franklin D. Roosevelt: President of the United States\n* Mordechai Chaim Rumkowski: Eldest of the Jews in the Łódź ghetto\n* Joseph Stalin: General Secretary of the Communist Party of the Soviet Union\n* Leó Szilárd: Nuclear physicist with the Metallurgical Laboratory\n* Shigenori Tōgō: Japanese foreign minister\n* Georgy Zhukov: Marshal of the Soviet Union\n; Upsetting the Balance\n* Max Aitken, Lord Beaverbrook: British Minister of Supply\n* Kurt Chill: Wehrmacht Lieutenant General\n* Kurt Diebner: Nuclear physicist, Tübingen, Germany\n* Albert Einstein: Physicist, Couch, Missouri\n* Dwight D. Eisenhower: U.S. Army general, Couch, Missouri\n* Enrico Fermi: Nuclear physicist, Denver, Colorado\n* Robert H. Goddard: Rocket expert, Couch, Missouri\n* Lord Halifax: British ambassador to the United States\n* Benito Mussolini: Il Duce (Italian Dictator)\n* Joachim von Ribbentrop: German foreign minister\n* Joseph Stalin: General Secretary, Communist Party of the Soviet Union\n* Leó Szilárd: Nuclear physicist, Denver, Colorado\n; Striking the Balance\n* Menachem Begin: Jewish guerrilla, Haifa, Palestine\n* Omar Bradley: US Army lieutenant general, outside Denver\n* Walter von Brockdorff-Ahlefeldt: Wehrmacht lieutenant general, Riga, Latvia\n* Kurt Chill: Wehrmacht lieutenant general, Pskov, Soviet Union\n* William Joseph Donovan: US Army major general, Hot Springs, Arkansas\n* Anthony Eden: British foreign secretary\n* Robert H. Goddard: Rocket scientist, Hot Springs, Arkansas\n* Cordell Hull: President of the United States following the death of Franklin D. Roosevelt\n* Igor Kurchatov: Nuclear physicist, north of Moscow\n* Mao Zedong: Communist Party leader, Peking\n* George Marshall: US Secretary of State\n* Joachim von Ribbentrop: German foreign minister\n* Joseph Stalin: General Secretary of the Communist Party of the Soviet Union\n* Shigenori Tōgō: Japanese foreign minister\nSee also\n* Alien space bats\n* Kishin Corps, another alternate history series involving an alien invasion during World War II\nReferences\nExternal links\n* [http://www.stevenhsilver.com/worldwar.html Worldwar Series]; Official website"
    }
  ]
}