{
  "content": [
    {
      "type": "text",
      "text": "# World Day for Audiovisual Heritage\n\nThe World Day for Audiovisual Heritage takes place every 27 October. This commemorative day was chosen by UNESCO (the United Nations Educational, Scientific and Cultural Organization) in 2005 to raise awareness of the significance and preservation risks of recorded sound and audiovisual documents (films, sound and video recordings, radio and television programmes).  Events are held in many countries, organised by national and regional sound and film archives, broadcasters, museums and libraries, and major audiovisual associations including the Association of Moving Image Archivists (AMIA), International Council on Archives (ICA), International Association of Sound and Audiovisual Archives (IASA), and the International Federation of Film Archives (FIAF)).\nThe main objectives of designating the date of 27 October were listed by UNESCO:\n* raising public awareness of the need for preservation;\n* providing opportunities to celebrate specific local, national or international aspects of the heritage;\n* highlighting the accessibility of archives;\n* attracting media attention to heritage issues;\n* raising the cultural status of audiovisual heritage;\n* highlighting audiovisual heritage in danger, especially in developing countries.\nThe 2012 and 2013 events were co-ordinated by the Coordinating Council of Audiovisual Archives Associations, through the SouthEast Asia & Pacific Audiovisual Archives Association (SEAPAVAA) and International Association of Sound and Audiovisual Archives (IASA).\nSee also\n* List of commemorative days\n* International observance\nReferences\n* [http://www.bangkokpost.com/lifestyle/music/375579/sights-sounds-and-slogans-world-day-for-audiovisual-heritage-contest \"Sights, Sounds and Slogans! world day for audiovisual heritage contest\"]. Bangkok Post. October 21, 2013.\nExternal links\n* [http://www.iasa-web.org/world-day-audiovisual-heritage Official World Day for Audiovisual Heritage website]\n* [https://www.un.org/en/events/audiovisualday/index.shtml Official United Nations site]\n* [http://www.unesco.org/new/en/communication-and-information/access-to-knowledge/archives/world-day-for-audiovisual-heritage/ Official UNESCO site]\n* [https://www.un.org/en/events/observances/days.shtml United Nations List of International Days ]"
    }
  ]
}