{
  "content": [
    {
      "type": "text",
      "text": "# World Cultural Council 29th Award Ceremony\n\n| location = The Main Hall, Aarhus University, Aarhus\n| country = Denmark\n| presenter = World Cultural Council\n| host = Professor Lauritz B. Holm-Nielsen\n| reward = Medal, diploma and $10,000US\n| year =\n| year2 =\n| holder =\n| website =\n| image2 =\n| image2size =\n| alt2 =\n| caption2 =\n| previous = 28th\n| main = World Cultural Council\n| next = 30th\n| award1_type = Albert Einstein World Award of Science\n| award1_winner = Professor Michael Grätzel\n| award2_type = José Vasconcelos World Award of Education\n| award2_winner = Professor Hans Ulrich Gumbrecht\n}}\nThe World Cultural Council celebrated its 29th award ceremony on 18 April 2012 at The Main Hall, Aarhus University, Aarhus, Denmark. Aarhus University was the co-organizer of the ceremony, which was the opening event of the conference \"Excellence Revisited – The Value of Excellence.\"\nThe WCC bestowed two awards at the ceremony, which were the Albert Einstein World Award of Science and the José Vasconcelos World Award of Education.\nProfessor Michael Grätzel received the Albert Einstein World Award of Science as a recognition for his studies in photonics, and the conversion of solar energy into electricity. Among his contributions, he co-invented the dye-sensitized solar cell, which can be manufactured using low-cost materials. Professor Hans Ulrich Gumbrecht won the José Vasconcelos World Award of Education because of his thought provoking influence in philosophy.\nJussi Nuorteva, member of the WCC and Director of the National Archives of Finland, presented the Winners' Book. Both laureates Professor Michael Grätzel and Professor Hans Ulrich Gumbrecht signed the WCC book having witnesses from Aarhus University and the WCC.\nProfessor Lauritz B. Holm-Nielsen, Rector of Aarhus University, received the Medal for Educational Merit for his contribution and development of the Danish research and innovation system and university education.\nThe WCC did a special recognition to eight talented researchers for their outstanding contribution in sciences: Anders Baun, Trine Bilde, Peter Brodersen, Johan P. U. Fynbo, Anja Groth, Jakob Søndergaard Jensen, Lars Bojer Madsen, and Jesper Buus Nielsen.\nPrior to the award ceremony, Professor Michael Grätzel, Nobel laureate Professor Edmond Fischer, and Professor Hans Ulrich Gumbrecht presented public lectures\nReferences\nFurther reading\n*\n*\n*\n*\n*"
    }
  ]
}