{
  "content": [
    {
      "type": "text",
      "text": "# Wrecking ball__disambig_1\n\n, Germany]]\n, Germany]]\nA wrecking ball or demolition ball is a heavy steel ball, usually hung from a crane, that is used for demolishing large buildings. They were most commonly in use during the 1940s and 1950s. Several wrecking companies claim to have invented the wrecking ball.  An early documented use was in the breaking up of the  in 1888–1889, by Henry Bath and Co, at Rock Ferry on the River Mersey.\nIn 1993, the wrecking ball was described as \"one of the most common forms of large-scale coarse demolition.\"  With the invention of hydraulic excavators and other machinery, the wrecking ball has become less common at demolition sites as its working efficiency is less than that of long reach excavators.\nWrecking balls should be distinguished from overhaul hook balls, which although superficially similar looking, are different and serve a different purpose.\nConstruction and design\nModern wrecking balls have had a slight re-shaping, with the metal sphere changed into a pear shape with a portion of the top cut off. This shape allows the ball to be more easily pulled back through a roof or concrete slab after it has broken through.\nWrecking balls range from about  to around . The ball is made from forged steel, which means the steel is not cast into a mold in a molten state; rather, it is formed under very high pressure while the steel is red hot (soft but not molten) to compress and to strengthen it.\nMethod of use\nTo demolish roofs and other horizontal spans, the ball is typically suspended by a length of steel chain attached to the lifting hook of a crane boom above the structure, the rope drum clutch is released and the ball is allowed to free-fall onto the structure. To demolish walls the ball is suspended at the desired height from a crane boom and a secondary steel rope pulls the ball toward the crane cab.  The lateral rope drum clutch is then released, and the ball swings as a pendulum to strike the structure.  Another method for lateral demolition is to pivot the crane boom to accelerate the ball toward the target. This is repeated as needed until the structure is broken down into debris that can easily be loaded and hauled away. The demolition action is carried out entirely through the kinetic energy of the ball.\nDemolition work has been carried out using a  wrecking ball suspended from a Kaman K-MAX helicopter.\nThe same mechanism is applied to quarrying rock where an excavator lifts and releases a loose ball (called a drop ball) onto large rocks to reduce them to manageable size.\nAlternative demolition techniques\nThe advancement of technology led to the development and use of blasting charges, safer than dynamite and more efficient or practical than wrecking balls, to destroy buildings. The most common use of blasting charges is to collapse a building, thus limiting collateral damage; see demolition. Wrecking balls are more likely to cause collateral damage, because it is difficult to completely control the swing of the ball.\nHowever, wrecking balls are still used when other demolition methods may not be practical. For example, the Hubert Humphrey Metrodome was demolished primarily by wrecking ball. The Leaning Tower of Dallas also necessitated a wrecking ball until it was reduced in height sufficiently for a long-reach excavator to complete the demolition.\nReferences\nFurther reading\n* Byles, Jeff (2005). Rubble: unearthing the history of demolition. New York: Harmony Books. .\n* Diven, Richard J. and Mark Shaurette (2010). Demolition: practices, technology, and management. Purdue University Press, West Lafayette, Indiana. .\n* Liss, Helene, (2000). Demolition: the art of demolishing, dismantling, imploding, toppling & razing. New York: Black Dog & Leventhal: Distributed by Workman Pub. Co. .\nExternal links\n*"
    }
  ]
}