{
  "content": [
    {
      "type": "text",
      "text": "# WrestleWar '91\n\n|venue      = Arizona Veterans Memorial Coliseum\n|city       = Phoenix, Arizona, United States\n|attendance = 6,800\n|buyrate    = 160,000\n|lastevent  = Starrcade\n|nextevent  = WCW/New Japan Supershow I\n|event      = WrestleWar\n|lastevent2 = WrestleWar '90: Wild Thing\n|nextevent2 = 1992\n}}\n'''WrestleWar '91''' was a professional wrestling pay-per-view (PPV) event produced by World Championship Wrestling (WCW). It took place on February 24, 1991, from the Arizona Veterans Memorial Coliseum in Phoenix, Arizona, in the United States. This was the first PPV not produced under the National Wrestling Alliance banner. In 2014, WrestleWar '91 was made available for streaming on the WWE Network.\nEleven matches were contested at the event, including one dark match. In the main event, The Four Horsemen (Ric Flair, Barry Windham and Sid Vicious) and Larry Zbyszko defeated Sting, Brian Pillman and The Steiner Brothers (Rick Steiner and Scott Steiner) in a WarGames match. In other prominent matches, The Fabulous Freebirds (Michael Hayes and Jimmy Garvin) defeated Doom (Ron Simmons and Butch Reed) to win the WCW World Tag Team Championship, and Lex Luger successfully retained his WCW United States Heavyweight Championship against Dan Spivey.\nStorylines\nThe event featured wrestlers from pre-existing scripted feuds and storylines. Wrestlers portrayed villains, heroes, or less distinguishable characters in the scripted events that built tension and culminated in a wrestling match or series of matches.\nEvent\n{| class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+ Other on-screen personnel\n!Role:\n!Name:\n|-\n|rowspan=2|Commentators\n|Jim Ross\n|-\n|Dusty Rhodes\n|-\n|Ring announcer\n|Gary Michael Cappetta\n|-\n|rowspan=2|Interviewers\n|Tony Schiavone\n|-\n|Missy Hyatt\n|-\n|rowspan=3|Referees\n|Randy Anderson\n|-\n|Nick Patrick\n|-\n|Lee Scott\n|-\n|}\nIn a dark match, that did not air on pay-per-view, Eddy Guerrero and Ultraman defeated Huichol and Rudy Boy.\nThe pay-per-view broadcast opened with a six-man tag team match for the WCW World Six-Man Tag Team Championship with Ricky Morton, Tommy Rich and Junkyard Dog defending against Big Cat and The State Patrol (Lt. James Earl Wright and Sgt. Buddy Lee Parker). Morton, Rich, and Junkyard Dog retained their titles when Morton (whom at the time was not the legal wrestler for his team) pinned Parker using a big splash.\nIn a promo segment, Alexandra York indicated that she wanted to expand the York Foundation. She then stated that the York Foundation computer predicted that fellow member Terry Taylor would win his match before 15 minutes and 20 seconds had elapsed during the match.\nNext, Bobby Eaton took on Brad Armstrong. Eaton won the match by pinfall following an Alabama Jam.\nThe third match was a tag team match pitting Itsuki Yamazaki and Mami Kitamura against Miki Handa and Miss A. The match ended when Yamazaki pinned Miss A using a roll-up.\nIn the fourth match, Buddy Landel faced Dustin Rhodes. Rhodes won the match by pinfall following a bulldog.\nNext, Missy Hyatt entered the male locker room to carry out interviews, only to be chased out by Stan Hansen (a reference to an incident in the New England Patriots' locker room involving Lisa Olson that took place in September 1990).\nThe fifth match was a tag team match pitting The Royal Family (Jack Victory and Rip Morgan) against The Young Pistols (Steve Armstrong and Tracy Smothers). The match ended when The Royal Family attempted to give Smothers a double suplex, only for Armstrong to dropkick them resulting in Smothers landing atop Morgan and pinning him. The power to the Arizona Veterans Memorial Coliseum went out during the match.\nIn a no disqualification match Terry Taylor defeated \"Z-Man\" Tom Zenk using a roll-up.\nNext, Paul E. Dangerously (dressed as a matador) interviewed the Argentinean wrestler El Gigante. After Dangerously repeatedly insulted Latin Americans, El Gigante body slammed him.\nIn the seventh match, Big Van Vader faced Stan Hansen. The match ended in a double disqualification after both wrestlers threw the referee out of the ring to continue their brawl.\nWCW United States Heavyweight Champion Lex Luger defend his title against Dan Spivey. Luger pinned Spivey using a cradle to retain his title. Following the match, supposedly retired wrestler Nikita Koloff and Grizzly Smith, came to the ring to present Luger with a new United States championship, only for Koloff to attack Luger.\nNext, WCW World Tag Team Champions Doom (Butch Reed and Ron Simmons) defended their titles against The Freebirds (Jimmy Garvin and Michael Hayes). The Freebirds won the titles after Reed accidentally struck Simmons with a foreign object, enabling Garvin to pin him. After the match Reed and manager Teddy Long turned on their longtime partner Ron Simmons, ending Doom as a team and allowing Ron Simmons to become a \"face\" in the eyes of the fans. Due to WCW's television taping schedule the Fabulous Freebirds had already wrestled a match against The Steiner Brothers where they lost the championship six days prior to the PPV, but the match had not yet aired on TV.\nThe main event was a War Games match pitting Sting, Brian Pillman, and The Steiner Brothers (Rick Steiner and Scott Steiner) against The Four Horsemen (Ric Flair, Barry Windham, Sid Vicious) and Larry Zbyszko) (Zbyszko was not a member of the Horsemen but brought in as a replacement for Arn Anderson who was injured at the time.) The match ended after Sid Vicious repeatedly powerbombed Brian Pillman, including at least one powerbomb where Pillman's head legitimately hit the roof of the cage. Unable to continue El Gigante came to the ring and surrendered the match on Pillman's behalf.\nReception\nDave Meltzer wrote in the March 4, 1991 issue of the Wrestling Observer Newsletter that the show was the best he'd seen live since 1989's The Great American Bash. Meltzer referred to the War Games match as one of the best he'd ever seen live. A fan vote in the same issue of the Wrestling Observer Newsletter had 221 out of 227 fans give the show a thumbs up. The other six votes were thumbs down. Meltzer noted at that point that the 97.3% thumbs up rate was the third best in the history of the poll, only behind 100% for 1989's WrestleWar and 99.8% for 1989's Clash of the Champions IX. An updated count in the March 11 issue had 522 thumbs up votes, 33 thumbs down votes, and 2 in between votes.\nIn a March 11 poll, the War Games match received the majority of votes for the show's best match, with 428. The match for the WCW World Six-Man Tag Team Championship received the most votes for the worst match of the night with 153; the tag match between The Young Pistols and The Royal Family received 129 votes for the night's worst match.\nDave Meltzer reported the show was attended by 6,800 people, with 4,300 paying for tickets for a live gate of $53,000. He also reported that the PPV was purchased in between 140,000 and 170,000 homes, for a gross of $2.8 to $3.4 million. WCW's share would have been between approximately $1.1 and $1.4 million.\nThe World Wrestling Federation ran a show the night before in the same market, drawing 4,800 paying tickets out of a total of 6,000, with a reported gate of $60,000.\n|note1 = dark\n|match1 = Eddy Guerrero and Ultraman defeated Huichol and Rudy Boy\n|stip1 = Tag team match\n|time1 = 07:39\n|match2 = Ricky Morton, Tommy Rich and Junkyard Dog (c) defeated Big Cat and The State Patrol (Lt. James Earl Wright and Sgt. Buddy Lee Parker) by pinfall\n|stip2 = Six-man tag team match for the WCW World Six-Man Tag Team Championship\n|time2 = 09:54\n|match3 = Bobby Eaton defeated Brad Armstrong by pinfall\n|stip3 = Singles match\n|time3 = 12:51\n|match4 = Itsuki Yamazaki and Mami Kitamura defeated Miki Handa and Miss A by pinfall\n|stip4 = Tag team match\n|time4 = 06:47\n|match5 =Dustin Rhodes defeated Buddy Landel by pinfall\n|stip5 = Singles match\n|time5 = 06:33\n|match6 =The Young Pistols (Steve Armstrong and Tracy Smothers) defeated The Royal Family (Jack Victory and Rip Morgan) by pinfall\n|stip6 = Tag team match\n|time6 = 12:05\n|match7 =Terry Taylor (with Alexandra York) defeated \"Z-Man\" Tom Zenk by pinfall\n|stip7 = No Disqualification match\n|time7 = 10:59\n|match8 =Big Van Vader vs. Stan Hansen ended in a double disqualification\n|stip8 = Singles match\n|time8 = 06:21\n|match9 =Lex Luger (c) defeated Dan Spivey by pinfall\n|stip9 = Singles match for the WCW United States Heavyweight Championship\n|time9 = 12:52\n|match10 = The Fabulous Freebirds (Michael Hayes and Jimmy Garvin) (with Big Daddy Dink and Diamond Dallas Page) defeated Doom (Ron Simmons and Butch Reed) (c) (with Teddy Long)\n|stip10 = Tag team match for the WCW World Tag Team Championship\n|time10 = 06:56\n|match11 = The Four Horsemen (Ric Flair, Barry Windham and Sid Vicious) and Larry Zbyszko (with Arn Anderson) defeated Sting, Brian Pillman and The Steiner Brothers (Rick Steiner and Scott Steiner)\n|stip11 = WarGames match\n|time11 = 21:50\n}}\nReferences\nExternal links\n*"
    }
  ]
}