{
  "content": [
    {
      "type": "text",
      "text": "# Wu Feng (Qing dynasty)\n\n]]\nWu Feng (; 1699, Pinghe County, Fujian-1769, Zhuluo County) was a Chinese merchant whose legend was once popular in Taiwan.\nDescription\nWu Feng was a Han Chinese who befriended aborigines. According to the popular story about him, which was not recorded before 1855, he tried to persuade the A-li-shan tribe to give up their practice of headhunting, but his attempts were unsuccessful. On one occasion he declared that on the following day the aborigines would see a man in a red cloak. He told them they would cut off the man's head, but it would be the last head they ever took. The next day, the aborigines saw a man in a red cloak and decapitated him, only to find out they had killed Wu Feng himself. Horrified, they gave up the practice of headhunting forever.\nIn the early 19th century, before 1820, a small mausoleum was built for Wu Feng. It was rebuilt and expanded in the early 20th century. This mausoleum is now a cultural landmark.\nThis story was in school history books during the martial law period. In the 1970s, it was the subject of a long form modern dance piece, containing echoes of The Rite of Spring, by Cloud Gate Dance Theater.\nSome said it purports to show an example of the Han Chinese having a \"civilising\" influence on the Taiwanese aborigines through heroic personal sacrifice. During the Kuomintang rule of Taiwan, Wu Feng was considered a minor national hero.\nIn 1989, soon after the 1987 lifting of martial law in Taiwan and taking advantage of a new-found emphasis on human rights, aborigines who had long been offended by their perception of racism in the Wu Feng story protested against its continued presence in history books. As part of the protest, they demolished statues of Wu Feng \"wherever they found them.\", and Wufeng Township in Chiayi, named after the legend, was renamed Alishan Township. The same year, Minister of Education Mao Gao-wen agreed to remove the story from Taiwanese history books. The legend remains in oral tradition of some Han Chinese.\nReferences\nExternal links\n* [http://www.nict.gov.tw/tc/index.php?option=com_content&task=view&id=100&Itemid=68 吳鳳及其相關問題之研究]"
    }
  ]
}