{
  "content": [
    {
      "type": "text",
      "text": "# Wurtulla, Queensland\n\n| pop                 = 6254\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4575\n| area                = 3.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 7.1\n| dir1                = S\n| location1           = Kawana Waters\n| dist2               = 6.5\n| dir2                = N\n| location2           = Caloundra\n| dist3               = 14.4\n| dir3                = S\n| location3           = Maroochydore\n| dist4               = 97.3\n| dir4                = NNE\n| location4           = Brisbane\n| lga      = Sunshine Coast Region\n| county   = Canning\n| parish   = Bribie\n| stategov = Kawana\n| fedgov   = Fisher\n| near-n              = Bokarina\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Coral Sea\n| near-s              = Currimundi\n| near-sw             = Currimundi\n| near-w              = Birtinya\n| near-nw             = Birtinya\n}}\nWurtulla is a coastal suburb of Kawana Waters in the Sunshine Coast Region, Queensland, Australia. In the , Wurtulla had a population of 6,254 people.\nGeography\nWurtulla is located within the Kawana Waters urban centre.\nWurtulla is bounded by the Coral Sea to the east, Currimundi Creek (also known as Currimundi Lake) to the south, Pangali Canal and Lake Kawana to the west and Lake Kawana Boulevarde and Wurley Drive to the north.\nThe Nicklin Way passes through the suburb from north (Bokarina) to south (Currimundi).\nCurrimundi Lake (Kathleen McArthur) Conservation Park is a protected area in the south-east of the locality of natural bushland, predominantly the wallum heath that was once commonplace in the coastal areas of South-East Queensland.\nHistory\nWurtulla was originally named as a town by Queensland Place Names Board on 1 September 1967 using a name suggested by the developer Alfred Grant Pty Ltd on 31 March 1960. The name is an Aboriginal word meaning southward. It was gazetted as a suburb and bounded on 8 July 1989.\nDemographics\nIn the , Wurtulla had a population of 5,905 people.\nIn the , Wurtulla had a population of 6,254 people.\nEducation\nThere are no schools in Wurtulla. The nearest government primary schools are Kawana Waters State College in neighbouring Bokarina to the north and Talara Primary College in neighbouring Currimundi to the south. The nearest government secondary school is Kawana Waters State College in Bokarina.\nReferences\nExternal links\n*"
    }
  ]
}