{
  "content": [
    {
      "type": "text",
      "text": "# WVUE (Delaware)\n\n| last_airdate = |()}}\n| location =\n| country = United States\n| owner =\n| former_callsigns =\n| former_channel_numbers = Analog: 7 (VHF, 1949–1951)\n| former_affiliations =\n| erp =\n}}\nWVUE (channel 12) was a television station licensed to Wilmington, Delaware, United States, which operated from 1949 to 1958. For the last part of its history, it attempted to target the Philadelphia, Pennsylvania, market. The station's studios were located in Wilmington.\nHistory\nWVUE began test broadcasts on June 20, 1949, and started its regular programming on June 30 as WDEL-TV, owned by the Steinman family of Lancaster, Pennsylvania, along with WDEL radio (AM 1150 and FM 93.7, now WSTW). It received a full license on June 30. It shared a studio and tower on Shipley Road in north Wilmington with its radio sisters. It operated on channel 7 as the NBC affiliate for Wilmington, and also carried a secondary affiliation with the DuMont Television Network. At the time, Wilmington was a separate television market.\nHowever, WDEL-TV found the going somewhat difficult. It was forced to operate at only 1,000 watts because it was sandwiched between New York City's WJZ-TV (now WABC-TV) and Washington, D.C.'s WMAL-TV (now WJLA-TV). This resulted in hit-or-miss reception outside of Wilmington itself. In 1951, WDEL-TV moved to channel 12 for two reasons—to allow its sister station in Lancaster, WGAL-TV, to move to channel 8 and to alleviate the aforementioned interference from WJZ-TV and WMAL-TV. The channel switch allowed WDEL-TV to significantly increase its power to cover much of the Philadelphia market. While Philadelphia already had an NBC affiliate, WPTZ-TV (channel 3, later WRCV-TV and now KYW-TV), its transmitter was not strong enough to cover Wilmington at the time. The Steinmans realized that Philadelphia and Wilmington were going to be a single market (Wilmington is only  southwest of Philadelphia). In hopes of boosting the station's profile, the Steinmans persuaded Joe Pyne, who had been a popular talk show host on WILM radio, to come back to Wilmington and start a talk show there. Pyne stayed at the station for two years before going to Los Angeles.\nIn early 1955, the Federal Communications Commission (FCC) officially collapsed Wilmington into the Philadelphia market. By this time, NBC was negotiating to buy channel 3, and informed the Steinmans that in the event negotiations were successful, it would pull its affiliation from channel 12. With that in mind, the Steinmans opted to sell channel 12 to Paul F. Harron, owner of Philadelphia radio powerhouse WIBG (now WNTP). The sale closed in March 1955, and channel 12 changed its calls to WPFH, after its new owner. Harron turned channel 12 into Philadelphia's first independent station. However, he continued to lease space on WDEL-AM-FM's tower. On March 25, 1956, Philadelphia minister George A. Palmer began a Sunday afternoon television version of his popular Morning Cheer daily radio show on WPFH.\nTwo years later, Harron sold WPFH and WIBG to Storer Broadcasting, who changed channel 12's calls to WVUE. The station did not go on the air for a week during the call sign transition. Storer operated the station out of a studio on Baynard Boulevard in downtown Wilmington, with a satellite studio at Suburban Station in Philadelphia. Storer also moved the transmitter to Glassboro, New Jersey. Plans were in the works to build a new transmitter at the Roxborough tower farm in Philadelphia, but while Storer bought land for a new tower, it was never built.\nIn 1958, Storer brought Pyne back to Wilmington to host a late-night talk show. Pyne's program reportedly boosted the station's ratings 30-fold. However, it wasn't enough to keep the station going. Later in 1958, Storer bought WITI in Milwaukee. At that time, Storer owned VHF stations in Atlanta, Detroit, Cleveland and Toledo in addition to WVUE, and the purchase of WITI would have left the company one VHF station over the FCC ownership limit of the time. As a result, Storer had to either sell off or shut down WVUE in order to comply with the ownership limit. There were no interested buyers, however, so Storer took the station off the air on September 13 of the same year. The license was returned to the FCC on December 18.\nAround this time, Philadelphia's public television station, WHYY-TV, was looking for a way to boost its coverage. Operating on channel 35, it had difficulty attracting an audience because of the limitations of UHF's reach at the time. Shortly after WVUE went off the air, WHYY-TV's owners, the Metropolitan Philadelphia Educational Radio and Television Corporation, asked the FCC for permission to move to channel 12. There were no free VHF allocations in Philadelphia itself, and the channel 12 allocation in Wilmington was the only available VHF allocation on the New Jersey or Delaware sides of the market that could cover Philadelphia with a city-grade signal. The FCC granted the request in early 1963, and on September 12, WHYY-TV moved to channel 12. It operated from the old WVUE facility in Glassboro until moving to the Roxborough tower farm in 1971. The WVUE calls currently belong to the Fox-affiliated television station in New Orleans.\nReferences\nExternal links\n*[http://www.fybush.com/site-030925.html Scott Fybush on the old WDEL-TV]\n*[http://www.broadcastpioneers.com/wdeltv49.html Essay at Broadcast Pioneers of Philadelphia]"
    }
  ]
}