{
  "content": [
    {
      "type": "text",
      "text": "# WZ-122 main battle tank__disambig_1\n\nType 80}}\n|production_date=\n|number= Only several prototypes\n|length=Unknown\n|width=Unknown\n|height=Unknown\n|primary_armament=Experimental 120mm smoothbore tank gun\n| secondary_armament = 1 × 12.7 mm AA MG1 × 7.62 mm MG4 × Anti-tank guided missile\n| engine             = Diesel\n| engine_power       =  (in 1970s plan)\n| suspension         = Hydropneumatic suspension (WZ-122A)torsion-bar (WZ-122B)\n}}\nThe WZ-122 () was a main battle tank developed by the People's Republic of China. With its development starting in March 1970, the WZ-122 would implement several experimental technologies, including hydromatic transmission system, hydropneumatic suspension and a 120mm smoothbore gun, as an effort to develop China's first indigenous second-generation main battle tank. After several prototypes were built, the plan was largely abandoned in 1974.\nThe development was reinstated in 1977 and into the 1980s with several prototypes such as the WZ-1224 and WZ-1226. Most of the prototypes were not accepted into production due to reliability and technology issues (with the exception of Type 80), still, WZ-122 project provided a technological basis for the development of various later Chinese vehicles, such as China's own third-generation main battle tank, the ZTZ-96 and ZTZ-99.\nHistory\nAfter the Zhenbao Island incident (:zh:珍寶島事件) in 1969, PRC leaders decided on the necessity to develop new second-generation tank models. These new tanks included WZ-132, WZ-121 (Type 69) and WZ-122, development of which commenced in March 1970.\nEarly prototypes\nThe first prototype, designated WZ-122A, was finished on 25 September 1970. This tank is largely based on Soviet designs in terms of external shape but with a different suspension and main gun. The tank utilized a hydromatic transmission system, hydropneumatic suspension, and hydraulic assisted power steering, nicknamed the \"three liquid\" system. The technical indicators of the WZ-122 also featured an NBC protection system, four anti-tank missiles mounted on the sides of the turret, and an advanced target acquisition system including a laser rangefinder, night vision devices, and a ballistic computer. It was also mounted with a Chinese-developed 120mm smoothbore gun. However, in the following tests in 1970, the \"three liquid\" system proved very unreliable, especially the complicated hydraulic transmission and assisted power steering systems. On October 5, 1970, the Fifth Machine Industry Ministry and various other military apparatuses deemed the various tanks developed during this period (WZ-122, WZ-132, etc.) impractical and unreliable, and thus lowered the unattainable technical expectations to a still somewhat high but realistic level. In January 1971, another prototype was finished. Commonly known as the WZ-1222 or WZ-122B, this prototype used many mature parts and proven technology, such as using to a more conservative \"three mechanical\" system consisting of a torsion bar suspension, mechanical transmission, and mechanical steering. However, many issues were still found during the test, which led to a temporary abandonment of the design.\nWZ-1223\nAnother design, known as the WZ-1223, incorporated western technology into a more traditional layout similar to the Type 59. According to one source, this prototype would eventually develop into the Type 80 Main Battle Tank, but according to the other source used for this article, this role belonged to the fifth prototype, the most conservative design of all six prototypes, and the initial design of the later Type 80.\nWZ-1224\nThe WZ-1224, designed throughout the late 1970s, is a Chinese attempt to design a western-style main battle tank (MBT). In the 1970s, China had the opportunity to send military officials to visit KraussMaffei, the main producer of the Leopard 2. Chinese officers seemed interested in the Leopard 2, especially its mobility, but the People's Liberation Army was unable to procure the tank or the license to produce it due to financial strain and possible maintenance problems. Due to this, the PLA decided to start the development of new tanks with western technical support to lower production and maintenance costs. In August 1978, a Fifth Machine Industry Ministry conference in Datong, Shanxi deemed a new main battle tank necessary to combat the Soviet T-72, one of the most advanced tanks of its time. The conference resulted in a new tank project with specifications including a mass of 43-45 tonnes, a 120mm smoothbore gun that is capable of penetrating the frontal armor of the T-72 in the range of 2000 meters, a new 900-1000hp engine, giving the tank a hypothetical top speed of 65km/h and an average speed of 45km/h, as well as an NBC protection system and a fire extinguishing system. Finally, due to China's lack of heavy duty road infrastructure and bridgelaying vehicles, the new tank is required to have deep fording abilities.\nWith the first prototype produced in 1978, the WZ-1224 is a completely different project from its predecessors, completely ditching Soviet influences in armor design and opting for a western-style welded turret. It also has six smaller road wheels on each side, similar to contemporary American, German, and French tanks. This tank also placed its ammunition rack in a separate compartment, similar to western tanks. There were also plans to develop a 17-round autoloader, but they were later abandoned due to reliability issues. For power, the WZ-1224 utilized an MTU MB8V331 TC41 engine, a German on-the-shelf civilian product, and indigenous torque and two-plate planetary gear system from Factory 617.\nThe torsion bar suspension and transmission of this tank are also mostly imported from Germany. The WZ-1224 later conducted tests with the domestic 12150ZL V12 engine developed by Factory 616 with an output of approximately 987hp. Another planned engine of the WZ-1224 was a new 8V150 engine made by Factory 636. However, the latter option was canceled due to the 60-degree angle between the cylinders (instead of the 90° angle used by most tank engines) and other design problems related to this placement causing disrupt rotational balance, resulting in excessive vibration, obstructing the engine from acceleration beyond a certain speed. There are also two large fans installed on top of the engine compartment due to the unsatisfactory cooling system of the MB8V331. The engine compartment was also visibly elevated to fit the large size of the engine. During the spring of 1977, the Fifth Machine Industry Ministry began work on reverse engineering the Rheinmetall Rh-120 smoothbore gun with possible technical assistance from Germany. The new tank gun's first firing test was conducted on February 29, 1979, in which it reached the muzzle velocity of approximately 1700m/s, and in the following test, penetrated a 204mm plate with a 68 degrees slope with a muzzle velocity of 1411.2m/s. After the completion of this vehicle in 1979, tests were conducted from March until the end of the year, during which most components of the vehicle proved reliable, but overheating problems occurred due to the engine cooling system, which suited the civilian MB8V331 well, did not cool the 12150ZL to a sufficient level due to the latter being larger and having more output. Generally, the vehicle proved satisfactory but not necessarily excellent, according to both sources, so the Fifth Machine Industry Ministry moved on to creating a new prototype.\nWZ-1226\nThe result of the formerly mentioned development on the WZ-1224 is the WZ-1226, a more conservative design with a round cast turret and more domestically produced parts. There are two tanks in this prototype stage: the WZ-1226 and the WZ-1226F2; the two tanks have no visible difference. The only significant difference is that the former used an 8V165 engine produced by Factory 636. The latter used an improved version of the 12150ZL engine produced by Factory 616. Both tanks used a hydraulic automatic gearbox with four forward gears and one reverse, developed by Factory 617, combining the transmission and engine into a single modular power pack that is easily replaceable and removable. The prototypes also replaced the torsion bar suspension with a combined suspension utilizing both torsion bar and hydro-pneumatic systems similar to the suspension on the Japanese Type 74 Main Battle Tank. Combined with the hydraulic-assisted power steering, the \"three-liquid\" technical expectation was realized on the WZ-1226, more than ten years after the original WZ-122 prototype. The tanks inherited the 120mm smoothbore gun from the WZ-1224 but simplified the loading mechanism to a semi-automatic loader. The WZ-1226 prototypes also featured composite armor. The prototypes were tested from 1981 to 1982, with satisfactory results. However, due to the unreliability of the transmission as well as the low durability of some parts, the tank was set aside by the PLA with some technologies proven by the tank used by other vehicles, such as the PTZ-89 tank destroyer, using a modified version of the gun on the WZ-122 series. The project also provided the Chinese military industry with experience in producing a modern main battle tank, which would prove valuable in the development of Chinese third-generation MBTs.\nVariants\n;WZ-122A: The first prototype in Project 122. Fitted with indigenously developed hydromatic transmission system, hydropneumatic suspension, and hydraulic assisted power steering, NBC protection system, four anti-tank missiles mounted on the sides of the turret, 120mm smoothbore gun, and an advanced fire control system. Nicknamed the \"three liquid\" prototype.\n;WZ-122B: The second prototype in Project 122 with firepower comparable to the WZ-122A, but the driving train was replaced by all mechanical systems. Nicknamed the \"three mechanical\" prototype.\n;WZ-1223: Based on Type 59 tank with imported Western technologies.\n;WZ-1224: Prototype tank based on Western design philosophies.\n;WZ-1226: A more conservatively designed prototype based on WZ-1224.\nSee also\n* Type 69\n* Type 80\nReferences"
    }
  ]
}