{
  "content": [
    {
      "type": "text",
      "text": "# Xavien Howard\n\n| birth_place  = Houston, Texas, U.S.\n| death_date   =\n| death_place  =\n| height_ft    = 6\n| height_in    = 1\n| weight_lbs   = 203\n| high_school  = Wheatley (Houston, Texas)\n| college      = Baylor (2012–2015)\n| draftyear    = 2016\n| draftround   = 2\n| draftpick    = 38\n| pastteams    =\n* Miami Dolphins ()\n* Indianapolis Colts ()\n| status       =\n| highlights   =\n* First-team All-Pro (2020)\n* Second-team All-Pro (2018)\n* 4× Pro Bowl (2018, 2020–2022)\n* 2× NFL interceptions leader (2018, 2020)\n* First team All-Big 12 (2015)\n| statweek     =\n| statseason   =\n| statlabel1   = Total tackles\n| statvalue1   = 342\n| statlabel2   = Sacks\n| statvalue2   = 2.0\n| statlabel3   = Forced fumbles\n| statvalue3   = 4\n| statlabel4   = Fumble recoveries\n| statvalue4   = 6\n| statlabel5   = Interceptions\n| statvalue5   = 29\n| statlabel6   = Pass deflections\n| statvalue6   = 95\n| statlabel7   = Defensive touchdowns\n| statvalue7   = 4\n| pfr          = HowaXa00\n}}\nXavien Howard (born July 4, 1993) is an American former professional football cornerback. He played college football for the Baylor Bears and was selected in the second round of the 2016 NFL draft by the Miami Dolphins, where he spent eight seasons with the team. During his tenure in Miami, Howard was a four-time Pro Bowler, a two-time All-Pro member, and led the league in interceptions twice. He briefly played for the Indianapolis Colts in 2025 before retiring mid-season.\nEarly life\nHoward was born on July 4, 1993, and grew up in Houston, Texas. He attended and played football at Wheatley High School in the city, where he was teammates with fellow NFL cornerback William Jackson III. He committed to Baylor University to play college football.\nCollege career\nHoward played at Baylor from 2012 to 2015. During his career, he had 98 tackles, 10 interceptions 1.5 sacks, and one touchdown. After his junior year, he declared for the 2016 NFL draft.\nStatistics\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! colspan=\"7\" style=\";\"| Baylor Bears\n|-\n! Season !! GP !! Cmb !! TfL !! PD !! Int !! FF\n|-\n! 2012\n| colspan=\"6\"| Redshirt\n|-\n! 2013\n| 3 || 5 || 0 || 0 || 1 || 1\n|-\n! 2014\n| 13 || 51 || 4.5 || 13 || 4 || 0\n|-\n! 2015\n| 12 || 42 || 1 || 10 || 5 || 0\n|-\n! [https://www.sports-reference.com/cfb/players/xavien-howard-1.html Career] || 28 || 98 || 5.5 || 23 || 10 || 1\n|}\nProfessional career\nPre-draft\nHoward attended the 2016 NFL Scouting Combine in Indianapolis, Indiana. He completed all of the combine drills and finished tied for 12th among defensive backs in the short shuttle. He also attended Baylor's pro day. Howard opted to redo the majority of workouts and improved on all his combine numbers with scouts and representatives from all 32 NFL teams looking on. Prior to the draft, Howard was projected to be a second or third-round pick.\n}}\nMiami Dolphins\n2016\nThe Miami Dolphins selected Howard in the second round with the 38th overall pick in the 2016 NFL draft. In order to draft Howard, the Dolphins traded their second-round pick (42nd overall) and fourth-round pick (107th overall) in the 2016 NFL draft to the Baltimore Ravens in exchange for their second-round pick (38th overall). Howard was the sixth cornerback selected in 2016.\nOn May 18, 2016, the Dolphins signed Howard to a four-year, 6.12 million contract with $3.83 million guaranteed and a signing bonus of $2.65 million.\nDuring organized team activities and minicamp, Howard competed for job as the No. 2 starting cornerback against Tony Lippett. On the final day of minicamp, Howard suffered a knee injury and was placed on the physically unable to perform list after it was discovered he would require surgery. Howard underwent arthroscopy surgery and was unable to physically participate in training camp. Although he missed the first three preseason games, head coach Adam Gase elected to name Howard the second starting cornerback, alongside veteran Byron Maxwell, to begin the regular season.\nHe started the Dolphins' season-opener at the Seattle Seahawks and recorded a season-high 11 combined tackles during their 12–10 loss. On October 6, 2016, Howard suffered another knee injury during practice. The meniscus injury required surgery and he missed the next nine games (Weeks 5–14). On December 17, 2016, Howard appeared in his first game since his knee injury and collected three solo tackles and had a season-high three pass deflections during a 34–13 victory at the New York Jets. He finished his rookie season in  with 40 combined tackles (29 solo) and six pass breakups in eight games and eight starts. The Dolphins finished their first season under head coach Adam Gase second in the AFC East with a 10–6 record. On January 8, 2017, Howard started his first career playoff game and recorded five combined tackles, broke up two passes, and made his first career interception off of a pass attempt by Ben Roethlisberger as the Dolphins were defeated by the Steelers in the AFC Wild Card Round.\n2017\nHoward entered training camp in 2017, slated as the Dolphins' No. 1 cornerback. He was named the starting cornerback to start the regular season, along with Byron Maxwell. Bobby McCain and Alterraun Verner were named the backup cornerbacks.\nHoward started the Dolphins' season-opener at the Los Angeles Chargers and recorded a season-high seven combined tackles during their 19–17 victory. In Week 13, Howard recorded a solo tackle, a season-high five pass breakups, two interceptions, and returned one for a touchdown during the Dolphins' 35–9 win against the Denver Broncos. During the second quarter, Howard intercepted a pass by Trevor Siemian and returned it for a 30-yard touchdown to mark the first score of his career. The following week, he deflected three passes and intercepted New England Patriots quarterback Tom Brady twice during their 27–20 win on Monday Night Football. He earned AFC Defensive Player of the Week honors for his performance against the Patriots. On December 17, 2017, Howard collected four solo tackles and made his first career sack on Tyrod Taylor, as the Dolphins were defeated by the Buffalo Bills 24–16. Howard finished  with 48 combined tackles (42 solo), 13 pass deflections, four interceptions, and a sack in 16 games and 16 starts.\n2018\nDuring the Jets home opener in Week 2, Xavien Howard got his first interception of the season. One week later, Howard recorded his third career game with two interceptions on Derek Carr in the 28–20 victory over the Oakland Raiders. Howard also intercepted Indianapolis Colts quarterback Andrew Luck twice in a span of 14 seconds during the Dolphins' loss on the road against the Colts. In Week 13 of the 2018 season, Howard injured his knee after intercepting Bills' quarterback Josh Allen for the second time that afternoon. He went on to miss the final four games of the regular season. Howard ended the 2018 season leading the league interceptions with Chicago Bears corner Kyle Fuller and Atlanta Falcons safety Damontae Kazee with seven. Howard was named to his first Pro Bowl and first second-team All-Pro. He was ranked 55th by his fellow players on the NFL Top 100 Players of 2019.\n2019\nOn May 9, 2019, Howard signed a five-year, $76.5 million contract extension with the Dolphins with $46 million guaranteed, making him the highest-paid cornerback in the league. In week 3 against the Dallas Cowboys, Howard was ejected after slapping wide receiver Cedrick Wilson Jr. on the facemask. Prior to being ejected, Howard recorded two tackles in the 31–6 loss. Howard was forced to miss the next three games due to a knee injury. He made his return in Week 8 against the Steelers. In the game, Howard recorded an interception off a pass from Mason Rudolph that was intended for JuJu Smith-Schuster before reinjuring his knee. Without Howard, the Dolphins lost 27–14. He was placed on injured reserve on October 29, 2019, with a knee injury.\n2020\nHoward was placed on the active/physically unable to perform list by the Dolphins at the start of training camp on July 28, 2020. He was moved to the reserve/COVID-19 list by the team on August 11, 2020. He was activated from both lists on August 27, 2020.\nIn Week 3 against the Jacksonville Jaguars on Thursday Night Football, Howard recorded his first interception of the season during the 31–13 win.\nIn Week 4 against the Seahawks, Howard recorded his second interception of the season off a pass thrown by Russell Wilson during the 31–23 loss. Howard’s second interception surpassed his previous season’s interception total.\nIn Week 6 against the Jets, Howard recorded an interception off a pass thrown by Joe Flacco during the 24–0 win. This was Howard's fourth game in a row with an interception. In Week 13 against the Cincinnati Bengals, Howard was ejected after he and Tyler Boyd were involved in an altercation. Before Howard was ejected, he recorded his eighth interception of the season, a career high.\nIn Week 14 against the Kansas City Chiefs, Howard recorded a one handed interception off a pass thrown by Patrick Mahomes during the 33–27 loss.\nIn Week 17 against the Bills, Howard recorded his league leading 10th interception of the season off a pass thrown by Matt Barkley during the 56–26 loss. He was named to his second Pro Bowl. On January 8, 2021, Howard was named as a first team All-Pro, the first time he had earned that honor (he had been a 2nd-team All-Pro in 2018). He was ranked 17th by his fellow players on the NFL Top 100 Players of 2021.\n2021\nIn July 2021, Howard announced that he had requested a trade from the Dolphins due to feeling undervalued and underpaid, also stating \"I am just here so I don't get fined\" in regards to him reporting to training camp. On August 8, the Dolphins reworked Howard's contract that would make him the highest-paid cornerback of 2021 with incentives and bonuses.\nIn Week 10, had five tackles, a forced fumble, and a 49-yard fumble recovery touchdown in a 22–10 win over the Ravens, earning AFC Defensive Player of the Week. He was named to his third Pro Bowl. He was ranked 56th by his fellow players on the NFL Top 100 Players of 2022.\n2022\nOn April 1, 2022, Howard signed a new five-year contract with $50.691 million in new money. In Week 12, Howard had a 16-yard fumble return for a touchdown in the 30–15 victory over the Texans. In the 2022 season, Howard had 45 total tackles (35 solo), one interception, 12 passes defended, and two forced fumbles. He was named to the Pro Bowl.\n2023\nFollowing the 2023 season on March 13, 2024, the Dolphins released Howard with a post-June 1 designation.\nIndianapolis Colts\nOn August 18, 2025, Howard signed with the Indianapolis Colts after having not played during the entire 2024 NFL season. After starting the first four games, on October 1, Howard retired from professional football.\nNFL career statistics\n{| class=\"wikitable\"\n|-\n! colspan=\"2\"| Legend\n|-\n| style=\"background:#cfecec; width:3em;\"|\n| Led the league\n|-\n| Bold\n| Career high\n|}\nRegular season\n{|class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\"| Year\n! rowspan=\"2\"| Team\n! colspan=\"2\"| Games\n! colspan=\"4\"| Tackles\n! colspan=\"6\"| Interceptions\n! colspan=\"3\"| Fumbles\n|-\n! GP !! GS !! Cmb !! Solo !! Ast !! Sck !! PD !! Int !! Yds !! Avg !! Lng !! TD !! FF !! FR !! TD\n|-\n! 2016 !! MIA\n| 7 || 6 || 40 || 29 || 11 || 0.0 || 6 || 0 || 0 || 0.0 || 0 || 0 || 1 || 0 || 0\n|-\n! 2017 !! MIA\n| 16 || 16 || 48 || 42 || 6 || 1.0 || 13 || 4 || 71 || 17.8 || 30 || 1 || 0 || 0 || 0\n|-\n! 2018 !! MIA\n| 12 || 12 || 35 || 25 || 10 || 0.0 || 12 || style=\"background:#cfecec; width:3em;\"| 7 || 52 || 7.4 || 39 || 0 || 0 || 1 || 0\n|-\n! 2019 !! MIA\n| 5 || 5 || 17 || 12 || 5 || 0.0 || 4 || 1 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0\n|-\n! 2020 !! MIA\n| 16 || 16 || 51 || 40 || 11 || 0.0 || style=\"background:#cfecec; width:3em;\"| 20 || style=\"background:#cfecec; width:3em;\"| 10 || 77 || 7.7 || 29 || 0 || 1 || 0 || 0\n|-\n! 2021 !! MIA\n| 16 || 16|| 50 || 39 || 11 || 1.0 || 16 || 5 || 54 || 10.4 || 37 || 1 || 2 || 2 || 1\n|-\n! 2022 !! MIA\n| 15 || 15 || 45 || 35 || 10 || 0.0 || 12 || 1 || 0 || 0.0 || 0 || 0 || 0 || 2 || 1\n|-\n! 2023 !! MIA\n| 13 || 13 || 45 || 36 || 9 || 0.0 || 12 || 1 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0\n|-\n! 2025 !! IND\n| 4 || 4 || 11 || 7 || 4 || 0.0 || 0 || 0 || 0 || 0.0 || 0 || 0 || 0 || 1 || 0\n|-\n! colspan=\"2\"| [https://www.pro-football-reference.com/players/H/HowaXa00.htm Career] !! 104 !! 103 !! 342 !! 265 !! 77 !! 2.0 !! 95 !! 29 !! 254 !! 8.8 !! 39 !! 2 !! 4 !! 6 !! 2\n|}\nPlayoffs\n{|class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\"| Year\n! rowspan=\"2\"| Team\n! colspan=\"2\"| Games\n! colspan=\"4\"| Tackles\n! colspan=\"6\"| Interceptions\n! colspan=\"3\"| Fumbles\n|-\n! GP !! GS !! Cmb !! Solo !! Ast !! Sck !! PD !! Int !! Yds !! Avg !! Lng !! TD !! FF !! FR !! TD\n|-\n! 2016 !! MIA\n| 1 || 1 || 5 || 3 || 2 || 0.0 || 2 || 1 || 11 || 11.0 || 11 || 0 || 0 || 0 || 0\n|-\n! 2022 !! MIA\n| 1 || 1 || 3 || 3 || 0 || 0.0 || 2 || 1 || style=\"background:#cfecec; width:3em;\"|49 || 49.0 || style=\"background:#cfecec; width:3em;\"|49 || 0 || 0 || 0 || 0\n|-\n! colspan=\"2\"| [https://www.pro-football-reference.com/players/H/HowaXa00.htm Career] !! 2 !! 2 !! 8 !! 6 !! 2 !! 0.0 !! 4 !! 2 !! 60 !! 30.0 !! 49 !! 0 !! 0 !! 0 !! 0\n|}\nPersonal life\nIn June 2024, Howard was accused in a lawsuit of engaging in revenge porn stemming from a 2022 incident.\nReferences\nExternal links\n*[http://www.baylorbears.com/sports/m-footbl/mtt/xavien_howard_810058.html Baylor Bears bio]\n*"
    }
  ]
}