{
  "content": [
    {
      "type": "text",
      "text": "# Xavier Centre of Historical Research\n\n-->\n| merger =\n| merged =\n| type =\n| status =\n| purpose = Historiography\n| professional_title =\n| headquarters =\n| location = Alto Porvorim, Goa\n| coords =\n| region_served =\n| services =\n| membership =\n| language =\n| general =\n| leader_title = Director\n| leader_name = Dr. Anthony da Silva SJ\n| leader_title2 =\n| leader_name2 =\n| leader_title3 =\n| leader_name3 =\n| leader_title4 =\n| leader_name4 =\n| key_people = Teotónio de Souza, Charles Borges, Delio Mendonca, Savio Abreu, Rinald D'Souza\n| main_organ =\n| parent_organization =\n| subsidiaries =\n| affiliations = Goa University\n| budget =\n| num_staff =\n| num_volunteers =\n| slogan =\n| website = [http://www.xchr.in/ Xavier Centre of Historical Research]\n| remarks =\n| footnotes =\n}}\nThe Xavier Centre of Historical Research is a Jesuit history research centre located in Alto Porvorim, Goa in India. It was founded in the late 1970s and its first director was John Correia Afonso SJ. After John Correia Afonso, Dr. Teotonio R. de Souza was the next director of the Centre (1979–1994). Charles Borges SJ who had served as Administrator and Associate Director, took over the direction of XCHR until the year 2000, when he left for Maryland College in Baltimore as its faculty staff.  He was succeeded by Delio Mendonca, SJ and Savio Abreu, SJ. The present director is Anthony da Silva SJ. It is a prominent institution in Asia for its focus on Indo-Portuguese issues, and besides organising seminars and talks, it also publishes a number of books related to the Portuguese in India and Asia, Goa, the Jesuits and other historical themes. A few years ago, the focus of the institute was expanded to study Jesuit History of the Society of Jesus in South Asia. It has set up an art gallery.\nBackground and current position\nThe Xavier Centre of Historical Research (XCHR) was set up by the Jesuits of the Goa-Poona Province in 1977. XCHR activities were inaugurated on November 4, 1979, under the direction of Teotónio R. de Souza who did the groundwork and accompanied the activities of the XCHR until April 1994. Till 1983, the institution was provisionally situated at Miramar, in Goa. Currently, it is located at Bakibab Borkar Road, Alto Porvorim, Goa.\nPresent for the inauguration in 1979 were Professor P.M. Joshi, the retired director of the Maharashtra Archives, and Dr. José Blanco, then administrator of Calouste Gulbenkian Foundation of Lisbon.\nIndo-Portuguese relations\nXCHR's founding came at a time when relations between India and Portugal, which had soured because of the Annexation of Goa in 1961, were just starting to thaw, following the 1974  Carnation Revolution in Portugal.\nISIPH\nCajetan Coelho, a historian himself connected with this institution until recently, argues that the XCHR \"has helped this process at the cultural level by its involvement in the organization of the series of International Seminars on Indo-Portuguese History ISIPH, initiated by Rev. John Correia-Afonso former director of the Heras Institute in Bombay in December 1978.\"\nOther seminars and workshops\nThe XCHR has been organizing local and national history seminars since 1980 to facilitate an interchange among professional historians and students of history. The XCHR says its aims and objectives include promoting research in history and related disciplines by providing inter-disciplinary methodology, sharing its perspectives where the \"voiceless and subalterns find a privileged place\".\nThe Centre builds \"consciousness among the local talent\" through lectures, seminars, publications, exhibitions and, of late, through an art museum and audio-visuals; by providing research facilities such as guidance, scholarships, books, documents and language tools; by preserving records and objects of interest related to local history and culture.\nThese writings and seminars have focussed on themes of religion in Goa, the Church in Goa and Goan history and society, including the freedom struggle. Overall, the focus is on the challenges facing Goa.\nInstitutional collaboration\nThe Xavier Centre has been a recognized institution of Goa University for Ph.D. research since 1986, with its director Prof. Teotonio R. de Souza as a Ph.D. guide for History. Resulting from this collaboration were two Pd.D. degrees of the Goa University, and two publications edited by Teotonio R. de Souza for Goa University, namely Essays in Goan History(1989) and Goa Through the Ages: An Economic History. The XCHR also maintains close links with the Jesuit Historical Institute in Rome and Heras Institute of the Jesuits in Mumbai. It says that several eminent personalities visit the XCHR and avail of its research facilities. There are facilities for small group conferences and seminars. The Centre also has accommodation facilities for scholars.\nNew premises\nSupport for this institution came from Josef Ubelmesser of Nuremberg and Teotónio de Souza's friends at the Sussen Parish in what then was the Federal Republic of Germany. The Alto Porvorim premises were inaugurated on  January 27, 1983, when the Xavier Centre of Historical Research organized the third ISIPH. In that meet, some sixty scholars studying Indo-Portuguese issues from twelve different countries took part.\nXCHR's library\nAn article says: \"On one of the well-maintained shelves, one can page through original copies of the first newspaper to be published from Goa. Gazeta de Goa was brought out in 1821 and lists political and other \"news\" across its now-fragile pages. One brief item reports on the war between Russia and Turkey, giving a hint of what readers in Goa got to read in those days.\"\nIt adds: \"On other shelves of this library, one can learn a whole vast amount of interesting tid-bits about Goa.... XCHR's book collection has been steadily growing. From 1993 to 1995, for instance, it grew from 13,000 to 16,000.... Computer printouts of the indexes of XCHR are available, while there is also a microfilm reader on hand. In keeping with the wealth of information this centre contains, even the prestigious US Library of Congress has evinced interest in\nits information.\"\nThe research library has a \"substantial collection\" of published and unpublished research material in English, Portuguese and other languages. This includes the manuscripts from the Mhamai House of Panjim (Panaji), which pertains to private coastal and hinterland trade during the late eighteenth and early nineteenth centuries.\nAccording to the XCHR, its library shelves house over 30,000 volumes with its main sections comprising books dealing with:\n* Asia during the Portuguese presence in the East.\n* Issues impacting developing countries.\n* The Church in Goa/ India.\n* Jesuits in Goa/India.\n* Goan and Indo-Portuguese history.\n* History of Indo-Portuguese Christian Art.\nBooks can be consulted in a reading room on the XCHR premises, for which library membership is required.\nHistory Hour\nXavier Centre of Historical Research currently (2006) holds a series of programmes called the History Hour that feature historians and others, talk about fairly contemporary issues of relevance to Goan society. Recent programmes also presented various, if conflicting, viewpoints related to language and script debates in Goa.\nXCHR regularly invites speakers to deliver a  talk or join in a discussion during its History Hour series. History Hour is \"a forum to present facts and views on the history, culture, society of Goa in relation to  broader national and international contexts.\" XCHR says the History Hour \"has become a meeting point for all those interested in Goan history and culture and its impact on present-day questions and challenges.\" It is open to all.\nMuseum\nThe XCHR museum was initiated already in 1983 with some rare pieces of Indo-Portuguese Christian art and a valuable collection of Indo-Portuguese numismatics. It has now added to an existing collection of a dozen pieces of Angelo Fonseca's paintings several new rare paintings of the same Goan pioneer of Indian Christian art.\nThe goal of the museum, according to the XCHR, is the \"appreciation, preservation, enhancement and dissemination of Goan heritage which has been harmonious and peaceful, through awareness and education\".\nThis is planned to be built into an interactive museum supported by a series of multimedia and audio-visual presentations which are in preparation.\nPortuguese-language courses\nThe XCHR organizes basic courses in Portuguese. These courses are of short and long duration. The courses aim to provide the required tool for those who have to do research in documentation in the Portuguese language.\nTimings, etc\nThe XCHR is open on Mondays to Friday from 9.30 am to 1 pm and 2 pm to 5 pm, and on Saturdays from 9.30 am to 1 pm.  It has an outdoor Xavier Gardens and lawn. Talks, programmes and films are presented here during the fair-weather (non-monsoon) season.\nXCHR's outreach programme involves collaboration with non-government organisations, visits to schools and colleges. It also has a Xavier Auditorium, a Xavier Art Gallery and the Xavier Museum, which houses a collection of Indian and Indo-Portuguese art. It includes twenty original paintings by the renowned Goan painter Angelo da Fonseca.\nEleven books have been published under the XCHR Studies Series, in keeping with its goal of informing scholars, institution and the public about new developments in the fields of Indo-Portuguese and Goan history. XCHR also hosts the History Hour series of talks, on social issues relating to Goan heritage and contemporary life.\nReferences\nBibliography\n* Teotonio R. de Souza, Xavier Centre of Historical Research, in Handbook of Libraries, Archives & Information Centres in India, Vol. 9, Humanities, Part 2, ed. B.M. Gupta, Delhi, Aditya Prakashan, 1991,  pp.&nbsp;239–242\nExternal links\n*\n* [http://www.goajesuits.com The Goa Jesuit Province of the Society of Jesus]  - The Jesuits in Goa\n* [https://web.archive.org/web/20220606030101/http://www.geocities.com/teodesouza/written_word_trs.pdf Article on Goan Archives, incl. XCHR (1987) by Teotonio R. de Souza]\n* [https://web.archive.org/web/20160303212720/http://connection.ebscohost.com/c/articles/33134501/xavier-centre-historical-research-goa Article on XCHR  by Teotonio R. de Souza]\n* [https://archive.today/20130415032456/http://en.ignatianwiki.org/~ignatian/en/wiki/index.php?title=Xavier_Centre_of_Historical_Research XCHR on the Ignatian Wiki]"
    }
  ]
}