{
  "content": [
    {
      "type": "text",
      "text": "# Xbox system software\n\nThe Xbox system software is the operating system developed exclusively for Microsoft's Xbox home video game consoles. Across the four generations of Xbox consoles, the software has been based on a version of Microsoft Windows and incorporating DirectX features optimized for the consoles. The user interface, the Xbox Dashboard, provides access to games, media players, the Xbox operating system provides standardized tools that facilitate game development specifically for Xbox, potentially limiting portability, and applications, and integrates with the Xbox network for online functionality.\nThough initial iterations of the software for the original Xbox and Xbox 360 were based on heavily modified versions of Windows, the newer consoles feature operating systems that are highly compatible with Microsoft's desktop operating systems, allowing for shared applications and ease-of-development between personal computers and the Xbox line.\nCommon features\nAcross all four generations of the Xbox platform, the user interface of the system software has been called the Xbox Dashboard. While its appearance and detailed functions have varied between console generations, the Dashboard has provided the user the means to start a game from the optical media loaded into the console or off the console's storage, launch audio and video players to play optical media discs, or start special applications for the Xbox such as streaming media services from third parties. The Dashboard also provides a menu of settings and configuration pages for the console that the user can adjust.\nThe Dashboard has supported integration with the Xbox Live service since November 2002. Xbox Live provides online functionality to the Xbox, including a friends list, game achievement tracking, matchmaking support for online games, in-game communications, and a digital game storefront. While some portions of the Xbox Live service are free, a subscription-tier Xbox Live Gold is generally required to play most multiplayer games on the console.\nStarting with the Xbox 360 and continuing through its current consoles, Microsoft has offered a means for users to opt into a beta test version of the console's system software. When first launched for the Xbox 360 in September 2010, this was called the Xbox Live Preview Program, and initially required an invitation from Microsoft after applying for the program. On the release of the Xbox One in 2014, the program was renamed to Xbox Preview Program, and Microsoft made this program open to all rather than restricting through invitation. Later in November 2016 rebranded to the Xbox Insider Program, corresponding to the similar Windows Insider program for those testing its computer operating system. With the Xbox Insider Program, testing not only included updates to the system software but upcoming game and application patches from both first and third-parties.\nEach iteration of the Xbox software has brought some form of backward compatibility to the newer console. On the Xbox 360, selected original Xbox games could be played through emulation after downloading an emulation profile to local storage. The Xbox One was not initially shipped with backward compatibility support, but was later added by January 2015 by another emulator to support selected Xbox 360 games, with hundreds of titles added over the following years. A similar emulator was developed and released in October 2017 for the Xbox One for a limited selection of original Xbox console games. Achieving Xbox One-backward compatibility on the Xbox Series X and Series S was a target goal for the newer consoles, and as such, these new consoles are fully backward compatible with all games in the Xbox One library with the exception of those requiring Kinect support. The supported list includes the Xbox and Xbox 360 games that were playable via emulation on the Xbox One.\nOriginal Xbox system software\nThe original Xbox runs a custom operating system which is based on a heavily modified version of Windows 2000, an approach that Microsoft engineer Don Box called \"fork and run\". It exports APIs similar to those found in Microsoft Windows, such as Direct3D.  While Windows 2000 was built for multitasking of multiple applications including memory paging, the Xbox console was planned to only run one application at a time, and these features were removed for the Xbox software. When loading a game, the operating system would unload itself to give all of the console's resources to the game, and then when the player left the game, the operating system would load back up again.\nXbox Live support was not originally part of the system software as shipped in 2001, but added later in November 2002. While the Xbox was still being supported by Microsoft, the Xbox Dashboard was updated via Live several times to reduce cheating and add features.\nMicrosoft released a dynamic background for its current Xbox Series X/S system software in May 2021 that is based on the original Xbox system software appearance.\nThe original Xbox operating system source code was leaked in 2020.\nXbox 360 system software\n| language =\n| website =\n| programmed_in = C, C++ and HTML for settings\n| working_state = Discontinued\n| source_model = Closed source\n| latest_release_version = 2.0.17559.0\n| latest_release_date =\n| latest_preview_version = 2.0.17511.0\n| latest_preview_date =\n| updatemodel = Direct Download USB RecoveryGame DiscOptical Disc Recovery\n| supported_platforms = Xbox 360\n| preceded_by = Original Xbox system software\n| succeeded_by = Xbox System Software\n}}\nThe Xbox 360 system software was again based on a modified version of Windows 2000, though expanded beyond the original Xbox console's operating system. This would prove troublesome for Microsoft from multiple directions. For the Xbox division, it made it difficult to bring in other Microsoft applications like Internet Explorer and Silverlight which had to be modified to work on the Xbox software. For Microsoft, the separate fork of these apps for the Xbox 360 and for the versions they were developing for the mobile-based Windows CE environment became difficult to maintain. These complexities led Microsoft towards its \"Windows Everywhere\" approach , reviewing all the dependencies within the desktop, Xbox, and mobile versions of Windows atop the MinWin process and creating a CoreSystem that contained the basic functionality of Windows that could be ported to other systems.\nUser interface\nMicrosoft released the Xbox 360 console on November 22, 2005, a year earlier than both the Sony PlayStation 3 and Nintendo Wii. Having the advantage of the lead, Microsoft was able to experiment with various customization options for the consumer's individual consoles. The ability to customize the way the console looked with various themes to fit the front and sides of it was something very different for home console users. In system, the Xbox 360 Dashboard had the ability to have multiple profiles with password on the same console with each user being able to customize the dashboard to exactly fit their own unique style. There were premium themes available for purchase on the Xbox Live Marketplace apart from the default styles. Originally there were four (later five, after the introduction of the \"Marketplace\" blade in late 2006) tabs or sections known as the \"blades\" for the Xbox 360 menu, namely Xbox Live, Games, Media and System. In scrolling from left to right, each section would have a different-colored background signifying its own unique area but users also had the option to change all sections to one background color as well.\nAt E3 2008, Microsoft announced that all Xbox 360 owners would receive a new dashboard update, called the \"New Xbox Experience\" (NXE), on November 19, 2008, that added several new features. A major new feature was the ability to install an entire game disc onto the Xbox 360's hard drive, which decreases loading times, and significantly reduces noise due to the game being read from the hard drive and not the louder disc drive. For most games this feature also reduces the amount of time spent reading the disc, thereby helping to extend the life-span of the optical drive mechanism.\nThe Xbox Guide was redesigned. If a user has installed any game onto their Xbox 360 hard drive, they are able to immediately start the game from the guide, whether they are in a game or in the dashboard. The update gives players the ability to create Avatars, which were required by Xbox Live. They also announced that the update supports 16:10 on VGA or HDMI, expanding the choice of resolutions.\nOn September 22, 2010, Microsoft announced that the Xbox Live dashboard would be updated again. The new design, nicknamed the \"Kinect\" dashboard, would incorporate the Metro interface used in other Microsoft products, such as Zune HD and Windows Phone. As well as a new color scheme and other minor tweaks to the overall layout, the update would also include a \"Kinect hub\", designed specifically for the Kinect sensor for easier dashboard navigation. The update was released on November 1, 2010.\nAt E3 2011, it was announced that the dashboard would be updated once again to have the interface look even more like the Metro design in Windows 8 and Windows Phone 8, and to include the Bing search engine. Kinect would also be updated allowing users to navigate the dashboard and Bing using their voice. Other updates would include cloud storage, YouTube access, and live television streaming. The new dashboard, nicknamed the \"Metro\" dashboard, officially went live on December 6, 2011.\nOn July 29, 2024, along with the discontinuation of the console's Xbox Games Store, the dashboard received an online-only update to remove most tabs, narrowing down its options to only show the remaining functionality of Xbox Live and the console's built-in features. The Microsoft Movies and TV app was also discontinued on this date. While the store cannot process new purchases from the console, some of its functionality is available in a read-only state and can be accessed by users using various dashboard actions that were not removed after the discontinuation of the store. However, backwards-compatible Xbox 360 content that is purchased from the Microsoft Store after the Games Store's closure can be downloaded on the console, as well as any content purchased before the discontinuation of the storefront.\nOn June 25, 2025, The Dashboard received yet another online-only update that fixed game thumbnails that were previously distorted and stretched out. It also added advertisements for Xbox Series X|S consoles, added an easier way to get access to previous purchases, and an online profile to the homepage.\nXbox System Software (2013–present)\n| released = 6.2.9781.0  /\n| language count = 33\n| language footnote =\n| language =\n| programmed in = C, C++ (back-end), C#, JavaScript, XML, Ajax (UI) and Assembly language\n| website =\n| working_state = Current\n| source_model = Closed source\n| latest_release_version = 10.0.26100.6194\n| latest_release_date =\n| updatemodel =\n}}\n| supported_platforms =\n| kernel_type = Hybrid (Windows NT based Xbox system software running on top of Hyper-V)\n| userland =\n| ui =\n| license =\n| preceded_by = Xbox 360 system software\n}}\nSystem\nThe Xbox System Software contains a heavily modified Hyper-V hypervisor (known as NanoVisor) as its host OS and two partitions. One of the partitions, the \"Exclusive\" partition is a custom virtual machine (VM) for games; the other partition, the \"Shared\" partition is a custom VM for running multiple apps including the OS.\nAs part of its ongoing \"Windows Everywhere\" approach, Microsoft revamped the operating system on Xbox to be closer to its current Microsoft Windows products to provide greater compatibility between personal computers and the Xbox line. The OS was based on Windows 8 Core at the Xbox One launch in 2013. The UI maintained the same \"Metro\" design that had been used in the last Xbox 360 update, and which resembled the desktop Windows 8 interface.\nIn November 2015, Microsoft released the \"New Xbox One Experience\" which replaced the base system with Windows 10 Core, allowing Universal Windows Platform apps to be available on Xbox One. According to the current head of Microsoft's Gaming division, Phil Spencer, \"The importance of entertainment and games to the Windows ecosystem has become really prevalent to the company\". The program that Microsoft launched allows developers to build a single app that can run on a wide variety of devices, including personal computers and Xbox One video game consoles. According to Polygon, Microsoft removed the distinction between Xbox One and Windows PC, and the software has been called \"Windows 10 on Xbox One\".\nSince 2016, all Xbox One consoles could be updated to include a development kit for universal Windows applications on Xbox One, with official support for the platform and Cortana coming in summer 2016.\nAs Microsoft continued to refine Windows 10 with the Fluent Design System, the Xbox One interface was also modified to reflect these changes by 2017. Microsoft has since continued to refine this interface to add and remove integrated features, such as inclusion of Xbox Game Pass support and removal of Cortana voice commands. Ahead of the release of the Xbox Series X and Series S consoles in November 2020, Microsoft updated the Xbox One software to reflect changes in the Dashboard that would also be present in the newer consoles. This included improved performance in some of the storefront features and readability improvements to the interface, which were also propagated across Xbox Game Pass and mobile apps.\nUser interface\nThe system software's interface uses a geometrical placement of squares and rectangular items that scrolls as a continuous vertical line, using the Metro design language that is also seen in Windows 8, Windows 10, and other Microsoft products.\nWhen Microsoft upgraded the Windows 8-based Core to a Windows 10-based one, they made a tour of the new user interface up on Xbox Wire, promising faster, easier navigation, improved community features and the return of Xbox Avatars. The UI includes a HOME screen, consisting of the top bar, the screenshot viewer (\"Album\") Icons, and shortcuts to the Microsoft Store, News, and Settings. The main feature on the home screen is a list of the most recently played games. Selecting any given title will give users more information about announcements, achievements, social activity and so forth. It is also more focused on the actual games they are playing, which is part and parcel of the company's new direction under Phil Spencer, the current head of Microsoft's Xbox division.\nUpdates\nMicrosoft aims to release frequent updates to the Xbox System Software, mainly containing new or improved features and faster installation and loading times for games and apps. Along with introducing improvements and fixes for native console apps and software, the monthly updates to the Xbox System Software introduce major features that are voted on or requested by the community, though some months have included more than one update. Starting in February 2014, beta releases of updates are tested before going live to check for unwanted bugs and stability.\nThe following table lists major updates to the Xbox One and Xbox Series X/S system software.\n{| class=\"wikitable\"\n! Update release !! Update !!\n|-\n| November 2013 || Day-one patch for removal of always-on digital rights management features originally announced at E3 2013 ||\n|-\n| February 2014 || Support for USB keyboards, disk space availability ||\n|-\n| March 2014 || Support for video output at 50 frames per second for 50&nbsp;Hz devices common in Europe/PAL regions ||\n|-\n| June 2014 || Support for external hard drives greater than 256&nbsp;GBs, and multiple hard drives via USB 3.0 ||\n|-\n| July 2014 || Improved voice recognition support for regional dialects||\n|-\n| August 2014 || Support for SmartGlass ||\n|-\n| October 2014 || Updated media player support with newer codecs and DLNA streaming support ||\n|-\n| March 2015 || Simplified online screenshot sharing ||\n|-\n| April 2015 || Modified power settings for Instant-On and energy saving mode ||\n|-\n| November 2015 || New Xbox One Experience interface based on Windows 10; streaming to Windows 10 personal computers; backward compatibility for several Xbox 360 games ||\n|-\n| February 2016 || Better customized pin and game display support, global leaderboards ||\n|-\n| March 2016 || Twitch integration; party chat; better Xbox 360 game integration; improved Game Hubs; system restore without deleting games or apps ||\n|-\n| July 2016 || Refreshed interface, Cortana voice command integration, Facebook integration ||\n|-\n| March 2017 || Refreshed interface, improved screenshot and video sharing controls; Beam integration; accessibility improvements ||\n|-\n| October 2017 || Update to Fluent Design System; content transfer system; support for USB webcams; backward compatibility support for original Xbox console games ||\n|-\n| April 2018 || Auto low-latency mode; support for FreeSync displays; support for up to 1440p resolutions; Mixer and Twitter integration ||\n|-\n| May 2018 || Support for 120&nbsp;Hz refresh rate; support for \"Groups\" for managing games and pings; improved Family Settings; captive portal connectivity support ||\n|-\n| September 2020 || Interface updates across Xbox One, Xbox Series X/S, Xbox Game Pass, and Xbox mobile apps to improve performance ||\n|-\n| November 2020 || Dynamic backgrounds; tags for \"Optimized for Series X/S\" games and backward compatible HDR games ||\n|-\n| March 2021 || FPS boost; certain backwards compatible games can now achieve 60 FPS on the Series X/S line of consoles ||\n|-\n| April 2021 || Option to suspend active games to prioritize download speeds ||\n|-\n| May 2021 || Added ability for users to enable passthrough audio, for better sound quality ||\n|-\n| August 2021 || Updated Windows core to match Windows 11 ||\n|-\n| September 2021 || Add Dolby Vision support on Series X/S; update Microsoft Edge to Chromium version; streaming to Windows 11 personal computers||\n|-\n| October 2021 || 4K Dashboard for Series X; night mode; quick settings ||\n|-\n| November 2021 || Xbox Cloud Gaming (Beta) support; accessibility update ||\n|-\n| February 2022 || Use Microsoft Edge to set custom backgrounds ||\n|-\n| June 2022 || Option to reveal Secret Achievements ||\n|-\n| September 2022 || Games and apps library streamlined; Change default installation locations; Party chat noise suppression; Windows 11 22H2 core update ||\n|-\n| October 2022 || Games and apps library the icon for disc-based titles is not appearing on the dashboard; Power option names simplified; Xbox passkeys and guest keys are now on Xbox PINs ||\n|-\n| November 2022 || Discord support; Send as Gift on Microsoft Store; Streaming with Twitch, Lightstream, and Streamlabs ||\n|-\n|July 2023\n|UI change\n|\n|-\n|September 2023\n|Windows 11 23H2 \"Zinc\" core update\n|\n|-\n|August 2024\n|Windows 11 24H2 core update\n|\n|}\nReferences\nExternal links\n* [https://support.xbox.com/help/hardware-network/settings-updates/whats-new-xbox-one-system-updates What's new: Xbox system updates]\n* [https://www.xbox.com/consoles?xr=shellnav Xbox Consoles]"
    }
  ]
}