{
  "content": [
    {
      "type": "text",
      "text": "# Xena: Warrior Princess season 1__disambig_1\n\n| last_aired    =\n| num_episodes  = 24\n}}\nThe first season of the television series Xena: Warrior Princess commenced airing in the United States and Canada on September 4, 1995, concluded on  July 29, 1996, and contained 24 episodes. It introduces Gabrielle (Renee O'Connor), the series co-star, beside Xena (Lucy Lawless), previously a secondary character in the TV series Hercules: The Legendary Journeys. Gabrielle becomes Xena's greatest ally; her initial naiveté helps to balance Xena and assists her in recognizing and pursuing the \"greater good.\"\nThe first season aired in the United States in syndication; reruns later ran on the USA Network. The season was released on DVD as a seven disc boxed set under the title of Xena: Warrior Princess: The Complete First Season on April 23, 2003 by Anchor Bay Entertainment.\nProduction\nCrew\nThe season was produced by Pacific Renaissance Pictures in partnership with Universal Studios and was aired in first-run syndication in the U.S. The executive producers were Robert Tapert (series creator), with Sam Raimi and R. J. Stewart. The main staff writers were Tapert, Stewart and many others, as Steven L. Sears (co-executive producers), Terence Winter, Peter Allan Fields and Roy Thomas. Some of the first season's episodes were written or co-written by writers on a freelance basis. The regular directors throughout the season were Doug Lefler, Michael Levine, Charles Siebert, Jace Alexander, Josh Becker, John Cameron and Gary Jones. The theme music and opening sequence was composed by Joseph LoDuca.\nCast\nThe initial season used many New Zealand natives like Jay Laga'aia in the cast. Willa O'Neill played the sister of Gabrielle, Lila.  Only the name of Lucy Lawless appears in the opening sequence although Renee O'Connor also stars.\nDanielle Cormack played Ephiny, an Amazon warrior, and Alison Bruce played Melosa, queen of the Amazons. The main actors of Hercules: The Legendary Journeys, Kevin Sorbo and Michael Hurst, appeared during the season. Robert Trebor played Salmoneus, a friend of Hercules's famous for his \"get rich quick\" schemes. Kevin Tod Smith portrayed Ares in two episodes and in later seasons. The American actor Bruce Campbell portrayed Autolycus, the king of thieves, a character he originated in Hercules. Tim Thomerson played Meleager, a friend of Gabrielle and reformed drunk. Karl Urban played the biblic Mael, Karl also played Cupid and Julius Caesar in later seasons. Ted Raimi played Joxer and Hudson Leick played Callisto; both are idols of the series' fandom.\nNumerous supporting characters have been given expansive and recurring appearances in the progressive storyline, including: Scott Garrison as Perdicas, Darien Takle as Cyrene, Tom Atkins as Atrius and Leslie Wing as Karis.\nReception\nThe pilot episode garnered 4.5 million viewers, ranked in No. 44 in U.S. syndicated rank, behind Hercules: The Legendary Journeys and Star Trek: Deep Space Nine. Based on its strong opening, Robert Tapert produced another 23 episodes of the same style and duration. Season episode No. 12 garnered 6.3 million viewers, and was ranked in No. 13 in U.S. syndicated rank, only behind of Hercules: The Legendary Journeys. The season was down on viewers on its last episode, that garnered 3.9 million viewers, again behind Hercules and Deep Space Nine.\nThe first season was released in another 27 countries between 1995 and 1996, eventually being seen in 105 countries.\nEpisodes\n|OriginalAirDate =\n|ShortSummary = Xena returns to Amphipolis, the place she grew up, in order to try to make up for past sins. On the way, she saves the people of Potidaea from the warlord Draco; her actions attract the attention of a young girl called Gabrielle, who decides to follow Xena in the hopes of a more exciting life.\n|LineColor = 291823\n}}\n|OriginalAirDate =\n|ShortSummary = While defending a small and peaceful settlement from a vicious warlord and his son, Xena is shot with an arrow. She is cared for by a local family while Gabrielle is left to defend herself in the local tavern, which is filled with thieves and cut-throats.\n|LineColor = 291823\n}}\n|ShortSummary = When Manus (the High Priest of the Dream God Morpheus) kidnaps Gabrielle, Xena must face the demons of her past and enter the dream world to rescue her friend.\n|LineColor = 291823\n}}\n|ShortSummary = Xena and Gabrielle go undercover after learning of a ransom put on an infant who is prophesied to one day take the throne from a powerful king.\n|LineColor = 291823\n}}\n|ShortSummary = Xena is forced to pretend to be her old self, a money hungry warlord named Mezentius in order to save a young princess. However, along the way she is pushed to her limits when she discovers an old lover is working for an arms dealer.\nIt is in this episode that series lead Lucy Lawless first sings the dirge \"Burial,\" whose music she composed herself.\n|LineColor = 291823\n}}\n|ShortSummary = Xena is mistakenly put on trial for killing a group of townspeople, causing Ares, God of War (Kevin Tod Smith), to be delighted with a plan he has enacted.\n|LineColor = 291823\n}}\n|ShortSummary = Gabrielle reads an incantation from a script that releases three titans from being a stone tomb. She convinces them she is a Goddess and has them perform helpful tasks for a small village nearby; however, after they soon start to suspect her of lying, they turn on the town and threaten to destroy the town for good.\n|LineColor = 291823\n}}\n|ShortSummary = Xena and Hercules join forces to free Prometheus; however, his reprieve comes with a price...\n|LineColor = 291823\n}}\n|OriginalAirDate =\n|ShortSummary = When ailing King Sisyphus is visited by Celesta, Goddess of death, he holds her captive. Unable to hold her death candle, it quickly begins to melt away, and all of mankind is unable to die - even when fatally wounded. It is up to Xena and Gabrielle, with the help of a new friend, to rescue Celesta before the candle burns out.\n|LineColor = 291823\n}}\n|ShortSummary = Someone is trying to start a war between the Amazons and the centaurs, which Xena tries to prevent after a dying Amazon princess leaves Gabrielle her right of caste.\n|LineColor = 291823\n}}\n|ShortSummary = King Xerxes arrests a group of villagers, demanding they surrender the mysterious \"Black Wolf\" and followers. Xena arranges to be arrested to help them escape.\n|LineColor = 291823\n}}\n|OriginalAirDate =\n|ShortSummary = Xena and Gabrielle arrive to Troy during the Trojan War when the warrior princess is required by an old friend, Helen of Troy. While Xena tries to win the war, Gabrielle meets Perdicas, her ex-fiancé, who now works as a mercenary for Troy.\n|LineColor = 291823\n}}\n|ShortSummary = Gabrielle auditions to attend the Athens City Academy to train as a bard -- but others trying for the few open spots include Homer and Euripides.\n|LineColor = 291823\n}}\n|ShortSummary = Xena and Gabrielle join two men of doubtful reputation (including Xena's ex-fiancé) in order to find the Treasure of the Sumerians and prevent the wrong hands from getting the most valuable.\n|LineColor = 291823\n}}\n|ShortSummary = Someone is trying to kill Princess Diana, so Xena has to protect her. Since Xena and Diana are physically identical (because series lead Lucy Lawless acts out both in a dual role), they exchange their roles so Xena can discover who the killer is.\n|LineColor = 291823\n}}\n|ShortSummary = Xena's dead love Marcus appears on Earth to tell her the underworld has been taken over by mad Atyminius, who has confined the good souls to Tartarus and given evil the run of the Elysian Fields.\n|LineColor = 291823\n}}\n|ShortSummary = Xena drafts Autolycus (Bruce Campbell, one of Sam Raimi's partners in Pacific Renaissance Pictures) to steal back the property of some friends of hers, which turns out to be the Ark of the Covenant.\n|LineColor = 291823\n}}\n|ShortSummary = After she and Xena are assaulted, Gabrielle asks herself if that is really the kind of life she wants to spend and returns to her village, Potadeia...which is going to be attacked.\n|LineColor = 291823\n}}\n|ShortSummary = Xena rescues a young boy on the run from his father, who wants to sacrifice him.\n|LineColor = 291823\n}}\n|ShortSummary = An old warrior claiming to be Xena's father complicates her rescue of a group of slaves.\n|LineColor = 291823\n}}\n|ShortSummary = Xena gets poisoned, and Gabrielle must take her place in fighting a warlord and protecting a village and the merchant Salmoneus (Robert Trebor), a.k.a. Lord Seltzer.\n|LineColor = 291823\n}}\n|ShortSummary = A blonde woman called Callisto (Hudson Leick) kills innocent people stating that she is Xena, Warrior Princess, and the real Xena and Gabrielle try to stop her. The two also meet, for the first time, a warrior-wannabe called Joxer (Ted Raimi).\n|LineColor = 291823\n}}\n|ShortSummary = Xena finally confronts Cortese, the warlord who burned her village and turned her into a warrior.\n|LineColor = 291823\n}}\n|ShortSummary = When Xena and Gabrielle take a wounded and pregnant Ephiny to a healing temple in the middle of a civil war, Xena is forced to take over as healer when the priests would rather pray than act.\n|LineColor = 291823\n}}\n}}\nHome release\nThe DVD release of season one was released by Anchor Bay Entertainment in the U.S. on September 23, 2003 after it had completed broadcast on television. As well as every episode from the season, the DVD release features bonus material including deleted scenes, bloopers and behind-the-scenes featurettes.\n{| class=\"wikitable\" style=\"font-size: 95%;\"\n|- style=\"background:#EFEFEF\"\n| colspan=\"5\" | The Complete First Season\n|-valign=\"top\"\n| align=\"center\" width=\"400\" colspan=\"3\"| Set details\n| width=\"300\" align=\"center\" |Special features\n|-valign=\"top\"\n| colspan=\"3\" align=\"left\" width=\"400\"|\n* 24 episodes\n* 1080 minutes\n* 7-disc set\n* 5.1 Surround Sound\n* Languages:\n** English (Dolby Digital 5.1)\n| rowspan=\"4\" align=\"left\" width=\"300\"|\n*Director and Actor Biographies\n*Series Trivia\n*Xena Chronicles\n*Season One Photo Gallery\n*Direct Access Screens\n*Xena Screensaver\n|-\n| colspan=\"3\" align=\"center\" | Release dates\n|-\n|align=\"center\" | UK\n|align=\"center\" | USA\n|align=\"center\" |\n|-\n|align=\"center\" | June 6, 2006\n|align=\"center\" | April 23, 2003\n|align=\"center\" | October 12, 2005\n|}\nReferences\nExternal links\n* [https://www.imdb.com/title/tt0112230/episodes#season-1 Xena: Warrior Princess Season 1] at Imdb.com"
    }
  ]
}