{
  "content": [
    {
      "type": "text",
      "text": "# Xena: Warrior Princess season 6__disambig_1\n\n| last_aired    =\n| episode_list  = List of Xena: Warrior Princess episodes\n}}\nThe sixth and final season of the television series Xena: Warrior Princess commenced airing in the United States and Canada on October 2, 2000 and concluded on June 18, 2001, and contained 22 episodes.\nThe sixth season aired in the United States on the USA Network. The season was released on DVD as a ten disc boxed set under the title of Xena: Warrior Princess: Season 6 on March 8, 2005 by Anchor Bay Entertainment.\nEpisodes\n|ProdCode = V1411\n|ShortSummary=A mortal Ares tries to convince his armies that he is still a god. Meanwhile, the Furies pose as Xena, Gabrielle and Eve in an effort to drive him mad so he will kill Xena.\n|LineColor=839CA4\n}}\n|OriginalAirDate=\n|ProdCode = V1401\n|ShortSummary=Xena and Gabrielle take Eve back to Amphipolis to meet her grandmother again. They find the village deserted and that Cyrene had been executed as a witch. Xena discovers that Mephistopheles is behind it all. Xena brings him into this world in order to defeat him.\n|LineColor=839CA4\n}}\n|ProdCode = V1402\n|ShortSummary=After killing Mephistopheles, Xena must take his place as the ruler of Hell, but she plans to lure Lucifer to take the place instead. She manages to tempt Lucifer into becoming the ruler of Hell.\n|LineColor=839CA4\n}}\n|OriginalAirDate=\n|ProdCode = V1404\n|ShortSummary=Visiting Gabrielle's homeplace, the intrepid pair discover that during their absence, Gabrielle's parents have been killed and that Gabrielle's niece Sara has been captured and taken into the harem of the warlord Gurkhan. They set sail to \"Mogador\" in Morocco. To keep a vengeful Gabrielle from endangering her own life, Xena slips her a sleeping potion in the guise of a sea sickness cure. While Gabrielle sleeps, Xena has herself sold into the Gurkhan household as a member of Gurkhan's harem, and is planning Sara's rescue. When Gabrielle awakens, she also has herself sold into the harem and performs a belly dance in the presence of Gurkhan and the undercover Xena. As Gabrielle dances closer to Gurkhan, Xena notices a glistening knife on Gabrielle's person; she obviously intends using it to get her revenge. Xena jumps on Gabrielle and neck-chops her unconscious for her own protection. Unaware of the assassination plan, the guards club Xena into unconsciousness and she falls atop her sidekick. After a torture session, Xena escapes and leads Gabrielle into Gurkhan's chamber. Gabrielle learns she is unwilling to kill even for the man's horrible crimes, but she still hates him enough to knock him unconscious and leave him with his face covered in Sara's prison cell. The guards come to behead Sara; after realizing it is Gurkhan they have executed, they run away panic-stricken, expecting severe repercussions from their mistake. Xena, Gabrielle and Sara escape in the confusion.\n|LineColor=839CA4\n}}\n|ProdCode = V1405\n|ShortSummary=In the desert, Xena and Gabrielle meet the female warrior Kahina. Kahina is the leader of one of two warring tribes who want Xena's help in their fight against the Romans. When Gabrielle is condemned for the accidental death of an innocent man, Xena betrays both tribes to the Romans so that she can save Gabrielle.\n|LineColor=839CA4\n}}\n|ProdCode = V1406\n|ShortSummary=Virgil and Gabrielle are captured by a group of cannibals and it is up to Xena to figure out a plan to rescue her friends.\n|LineColor=839CA4\n}}\n|ProdCode = V1408\n|ShortSummary=Xena heads north to Scandinavia to right an old wrong, and Gabrielle follows against Xena's wishes. Gabrielle meets Brunhilda, who tells the legendary tale of Xena, Odin's most feared Valkyrie. Xena joins up with a fellow warrior, Beowulf to find Grendel, a monster with a mysterious origin.\n|LineColor=839CA4\n}}\n|ProdCode = V1409\n|ShortSummary=Gabrielle and Brunhilda follow Xena and Beowulf as they hunt for Grendel. They also search for the Rheingold ring that Xena forged from the stolen Rheingold 35 years before. Odin pursues them with his Valkyries in order to retrieve the ring for himself.\n|LineColor=839CA4\n}}\n|ProdCode = V1410\n|ShortSummary=Beowulf finds Xena, a year after she first put on the ring and lost her memory, now living as Wealtheow, the bride of King Hrothgar. He rescues her and takes her back to defeat the monster Grendel and free Gabrielle from Brunhilda's ring of fire.\n|LineColor=839CA4\n}}\n|ProdCode = V1414\n|ShortSummary=Xena and Gabrielle hide the mortal Ares in her family's old farm, when his enemies put a bounty on his head. They disguise him as a farmer and manage to drive off the bounty hunters.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=The Amazons are being hunted by Prince Morloch, until he meets Xena. He decides she is a more worthy prize. Xena and Moloch battle it out, but things do not go as planned with the arrival of Varia.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Caligula (Alexis Arquette) has captured Aphrodite and is sapping her immortality so that he can become a god, with Ares stating that the two's lifeforces are bound together. Xena and Gabrielle pose as a charioteer and her manager so they can rescue their friends, which includes Eve. Also during this time, an encounter in which Xena tries to kill the Archangel Michael results in Xena losing her power to kill gods.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Xena and her friends are hounded by a TV crew while she tries to obtain the Golden Apples of Valhalla to restore Ares' and Aphrodite's godhood. The TV crew are eager to discover the true extent of Xena's relationship with Gabrielle and believe that Xena wants the apple so she can become a god herself.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Varia is now the new queen of the Amazons and decides to team up with Ares. He leads them into battle against the Romans, who are slaughtered by the Amazons. Meanwhile, Varia condemns Eve for her past crimes as Livia. In order to save Eve, Queen Gabrielle issues a customary challenge whereby she will fight Varia, the outcome determining whether Eve lives or dies. In what closely resembles an ancient kickboxing match, Gabrielle gets in some impressive kicks, but with Ares being the real power behind Varia she beats Gabrielle savagely, finally knocking her out cold, forcing Xena to intrude on Amazon tradition and battle Varia herself.\n|LineColor=839CA4\n}}\n|ProdCode = V1419\n|ShortSummary=Bellerophon, the son of Artemis in this Xena episode, wants revenge for the death of his \"mother\". He kidnaps Varia to lead the Amazons into battle. Xena and Gabrielle lead then in the attack, but they suffer greatly.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Alti is alive in the 21st Century. She uses genetic engineering to clone Xena and Gabrielle. Her plan is to tell the world that Xena was really evil and then conquer the world together.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Gabrielle is visited by the spirit of Ephiny, pleading with her to protect her centaur son, Xenan. Borias' son Belach is a warlord, who is killing Centaurs because he thinks that Xenan has kidnapped his daughter, Nicha. Belach believes that his father Borias was a terrible man, and Xena tries to convince him that Borias's legacy was as a friend to the centaurs and a changed man for the good when he died.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Caesar escapes Tartarus, and capturing the Fates, uses their loom to change his destiny. In this life, he and Xena rule Rome, Gabrielle is a playwright and Alti is High Priestess of Rome.\n|LineColor=839CA4\n}}\n|ProdCode = V1426\n|ShortSummary=On the day before Gabrielle's birthday, Xena and Gabrielle are traveling to Thebes where Xena wants to pick up her gift for Gabrielle and to drop off the Helmet of Hermes which gives the wearer the power to fly. The two women rescue a young virgin who wants to be sacrificed, and they enlist Aphrodite to help her change her mind. All the while, Gabrielle has to put up with Xena's tradition of birthday pranks before giving the present. And the warlord Ferragus wants to steal the Helmet of Hermes.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=In the past, after Gabrielle fell into the lava pit with Hope, Xena and Joxer search for her. Xena is blackmailed into marrying Ares to get Gabrielle back. Xena hides the marriage scroll in a sea cave, where it is found in the present day by some archaeologists.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=After getting a call for help, Xena and Gabrielle travel to Japan. Xena tells Gabrielle about a time in her past when her friend Akemi murdered her father, who then became Yodoshi, the Lord of the Dark Land and eater of souls (\"Yokai-Daimyo\"). Xena realizes she must die so that the souls of those who died can be set free.\n|LineColor=839CA4\n}}\n|ProdCode = N/A\n|ShortSummary=Xena allows herself to be killed so that her ghost can fight Yodoshi and save the souls of the people who died as a result of her actions. Meanwhile, Gabrielle sets out to recover her body and resurrect her using the sacred fountain on Mount Fuji. Though Yodoshi is defeated, Xena chooses not be resurrected so that the souls of the people she killed may be avenged and enter a state of grace. The series concludes with Gabrielle inheriting Xena's weapons and cause as a warrior of the people, with a ghostly Xena by her side.\n|LineColor=839CA4\n}}\n}}\nReferences"
    }
  ]
}