{
  "content": [
    {
      "type": "text",
      "text": "# Xẻo Quýt Historical Site\n\n| image =\n| alt =\n| caption =\n| location = Mỹ Hiệp and Mỹ Long communes, Cao Lãnh district, Đồng Tháp province, Vietnam\n| nearest_city = Cao Lãnh\n| coordinates =\n| area_ha = 50\n| established = 1992 (national historical site)\n| visitation_num =\n| governing_body =\n| url =\n}}Xẻo Quýt Historical Site (Vietnamese: Khu di tích Xẻo Quýt) is a national historical relic and eco-tourism area located in the communes of Mỹ Hiệp and Mỹ Long, Cao Lãnh district, Đồng Tháp province, Vietnam. Approximately 30 km from Cao Lãnh city, the site spans 50 hectares, including 20 hectares of melaleuca (tràm) forest, and served as a key revolutionary base during the Vietnam War from 1960 to 1975. It was officially recognized as a national historical site in 1992 and has since been developed for tourism, attracting visitors interested in history, nature, and biodiversity.\nHistory\nDuring the Vietnam War, Xẻo Quýt functioned as the base for the Provincial Committee of Kiến Phong (now Đồng Tháp) from 1960 to 1975, playing a crucial role in the resistance against American forces. The site's dense forests and waterways provided natural camouflage and strategic advantages for revolutionary activities. After the war, it was preserved and designated a national historical site in 1992 to commemorate its role in Vietnam's struggle for independence.\nGeography and ecology\nXẻo Quýt is situated in the Mekong Delta region, characterized by its melaleuca forests, canals, and wetlands. The area boasts rich biodiversity, with approximately 170 plant species, including 158 wild species and 12 woody trees, and around 200 animal species, such as 7 amphibians, 22 reptiles, 73 fish, 91 birds, and 7 mammals. Notably, 13 species are listed in Vietnam's Red Book of endangered species, including the Siamese crocodile, king cobra, box turtle, and various birds like the greater coucal. The site also features a collection of nearly 20 varieties of water lilies, introduced for tourism in 2015.\nTourism\nToday, Xẻo Quýt is a popular destination for eco-tourism and historical education, offering activities such as boat rides through canals, exploring revolutionary bunkers, and experiencing local culture. It attracts school groups from the Southwest region for educational trips and is part of broader Đồng Tháp tourism routes, including nearby sites like Gáo Giồng and Tràm Chim National Park. Visitor numbers have grown significantly; during the April 30-May 1 holiday in 2025, it welcomed 18,027 tourists, a nearly 450% increase from the previous year. The site also hosts events like tourism festivals and cultural performances.\nReferences"
    }
  ]
}