{
  "content": [
    {
      "type": "text",
      "text": "# Xindian culture\n\n|||none}}\n|mapalt      =\n|altnames    =\n|horizon     =\n|region      = Gansu\n|period      =\n|dates       = ca. 1500&ndash;1000 BCE\n|typesite    =\n|majorsites  =\n|extra       =\n| precededby  = Qijia culture\n| followedby  = Shajing culture (800-200 BCE)\nMajiayuan (3rd-2nd c.BCE)\n}}\nXindian culture () was a Bronze Age culture in the Gansu and Qinghai provinces of China. Xindian culture is dated ca. 1500&ndash;1000 BCE, a radiocarbon testing of an artefact produced a date around 1000 BCE, which roughly corresponds to the Western Zhou period of the Central Plain area (in the middle and lower course of the Yellow River).\nGeography\nThe Xindian culture is named after a site discovered in 1923–24 in Xindian, Lintao County, Gansu. The culture was mainly located in Gansu in the middle and lower course of the Tao River and Daxia River, and in Qinghai in the basin of the Huangshui River.\nCultural context\nXindian culture was predominantly agricultural, with breeding pigs and cattle, at the sites of the culture were found bronze castings and traces of copper smelting production. Some small bronzes have been discovered at Huizui in Lintao county. They include knives, awls and buttons.\nXindian culture belongs to the painted pottery cultures found in Central Asia, India, and China, among others.\nXindian culture postdates the Qijia culture; the pottery evidence demonstrates a cultural continuity, though genetically it is not related with it.\nThe shape of some Xindian culture pottery vessels, as well as the decorative patterns on pottery reveal correlations with the Tangwang culture.\nIn the same area in close proximity are distributed early sites of the contemporary neighboring Siwa culture, though Xindian culture and Siwa culture followed their own paths of development. The later Xindian culture expanded westward and came closer to the Kayue culture, it was possibly absorbed by the Kayue culture.\nFile:Anthropomorphic spatula, Xindian culture, 1900-1500 BCE. Gansu Museum.jpg|Anthropomorphic spatula, Xindian culture, 1900-1500 BCE. Gansu Museum\nFile:Pottery Jar (9830492813).jpg|Xindian pottery jar\nFile:Chinese jar, Neolithic period, painted earthenware, HAA.JPG|Xindian jar with two lug handles, Gansu, around 1,000 BCE, painted earthenware, Honolulu Academy of Arts\nFile:Jarre, M.C. 2001-19(2).jpg|Jar, Xindian culture. Musée Cernuschi.\nFile:Xindian pit and oracle bone.jpg|Xindian pit with oracle bone\nNotes\nExternal links\n* [https://web.archive.org/web/20060329124532/http://www.gs.xinhuanet.com/gansucaitao/2005-04/20/content_4098830.htm Xindian wenhua] - (In Chinese)\n* [http://www.invaluable.com/auction-lot/a-rare-large-neolithic-painted-pottery-jar-xindia-1-c-hwbbpolssm A rare large Neolithic painted pottery jar Xindian culture, c. 1500 - 1000 BC]\n* [http://www.snapchina.com/main.php/v/antique/Pottery/album_001/ Xindian Culture Painted Pottery]"
    }
  ]
}