{
  "content": [
    {
      "type": "text",
      "text": "# Xinjiang (historical area)\n\nXinjiang (新疆; Uyghur: شىنجاڭ), alternatively romanized as Sinkiang, is an area located in Central Asia, between 73 ° 5 'to 96 ° 4' east and 35 ° 5 'and 49 ° north, in total 1,660,000 square km, sharing borders with Mongolia, Russia, Kazakhstan, Kyrgyzstan, Tajikistan, Afghanistan, India, Pakistan and China's Tibet Autonomous Region, Qinghai Province and Gansu Province. This region has been called Western Regions () in China's history and is currently known as China's Xinjiang Uyghur Autonomous Region, a provincial-level jurisdiction.\nThe name 'Xinjiang' literally means \"new territory\" in Chinese, and originated in the early Qing dynasty, it referred to Manchu's newly conquered lands, such as 'Yunnan Xinjiang' (literally \"the Yunnan new territory\"), 'Guangxi Xinjiang' (literally \"the Guangxi new territory\"). The lands of Dzungar Khanate and Yarkent Khanate later conquered by the Qing empire in the mid-18th century, were also named 'Xiyu Xinjiang' (literally \"the Western Regions new territory\"). This area revolted against the Qing empire in the middle of the 19th century and the rebels against the regime were subsequently reunified by Yaqub Beg of West Turkestan. In 1884, the area was conquered again by the Qing empire and set up as a 'Xinjiang Province'. In the subsequent changes, the administrative area of this region has been shrinking and was eventually reduced to the extent of today's Xinjiang Uyghur Autonomous Region.\nFor the indigenous peoples of this region (mainly Turkic peoples), the word 'Xinjiang' is a foreign language word with colonialist implications and no connection to the local historical and cultural traditions. They use the name East Turkestan (Uyghur: شەرقىي تۈركىستان, Sherqiy Türkistan; Chinese: 东突厥斯坦, Pinyin: Dōng Tūjuésītǎn) to refer to this area. Due to the existence of the East Turkestan independence movement, apart from the original cultural and geographical meaning, this name has political overtones. It is not accepted by those who are against independence for East Turkestan. Therefore, for those opponents, East Turkestan is no better than Xinjiang (新疆).\nSo Xinjiang (新疆) may refer to:\nGeographic areas\n* Western regions, which basically includes the area before the Qing dynasty.\n* The land of the Dzungar Khanate and the Yarkent Khanate after their conquest by the Qing empire.\n* East Turkestan, as a historical, geographical and cultural concept, is the eastern part of Turkestan. Its scope is a little fuzzy, but quite similar to the territory of Xinjiang under Qing rule in the Qianlong period. As a political concept, according to East Turkestan independence movement advocates, its scope is quite similar to Xinjiang Uyghur Autonomous Region.\nChinese administrative divisions\n(1912–1949)]]\n(1949–)]]\n* Xinjiang Province (Qing) (1884–1912).\n* Xinjiang Province (Republic of China) (1912–1992) The actual control of the region by the Republic of China was interrupted between 1933 and 1946 and ended entirely in 1949, but after the Central Government of the Republic of China moved to Taiwan, the government of Xinjiang Province (Republic of China) was abolished in 1992.\n* Xinjiang Autonomous Province (Republic of China) (1933–1944) was a semi-independent local government established by Sheng Shicai (盛世才, Pinyin: Shèng Shìcái) in Xinjiang Province (Republic of China).\n* '''Xinjiang Province (People's Republic of China) (1949–1955) was replaced in 1955 by the newly established Xinjiang Uyghur Autonomous Region.\n* Xinjiang Uyghur Autonomous Region''', an administrative autonomous region set up by the People's Republic of China in 1954.\nReferences"
    }
  ]
}