{
  "content": [
    {
      "type": "text",
      "text": "# XXX Corps (United Kingdom)\n\n| allegiance                    =\n| branch                        =  British Army\n| type                          = Corps\n| role                          =\n| size                          =\n| command_structure             =\n| garrison                      =\n| equipment                     =\n| current_commander             =\n| ceremonial_chief              =\n| colonel_of_the_regiment       =\n| notable_commanders            = William RamsdenSir Oliver LeeseGerard BucknallSir Brian Horrocks\n| identification_symbol         =\n| identification_symbol_2       =\n| nickname                      =\n| patron                        =\n| motto                         =\n| colors                        =\n| march                         =\n| mascot                        =\n| battles                       =\n*World War II\n**North African campaign\n***Second Battle of El Alamein\n**Italian campaign\n**Battle of Normandy\n**Operation Market Garden\n**Operation Veritable\n| anniversaries                 =\n| decorations                   =\n| battle_honours                =\n}}\nXXX Corps (30 Corps) was a corps of the British Army during the Second World War. The corps was formed in the Western Desert in September 1941. It provided extensive service in the North African Campaign and many of its units were in action at the Second Battle of El Alamein in late 1942. It then took part in the Tunisia Campaign and formed the left flank during the Allied invasion of Sicily in 1943.\nIt returned briefly to the United Kingdom; it then served in the Allied Invasion of Normandy in June 1944. In September 1944, it formed the Garden (cross land) contingent of Operation Market Garden; due to the failure of the Market (airborne) contingent to seize the bridge at Nijmegen, XXX Corps arrived too late at the subsequent ()and ultimateArnhem bridge, effectively resulting in the loss of the British 1st Airborne Division in the prolonged Battle of Arnhem. XXX Corps continued to serve in the Netherlands, and finally in Operation Veritable in Germany until May 1945.\nNorth Africa Campaign\nXXX Corps was formed in the Western Desert under Lieutenant-General Vyvyan Pope in September 1941. It played a major role in the Western Desert Campaign, where it was initially formed for the British armoured units in North Africa in preparation for Operation Crusader, the last British attempt to relieve the siege of Tobruk.\nXXX Corps suffered many casualties, mainly because of obsolete British tank tactics (especially charging anti-tank guns), but finally forced the Panzerarmee Afrika to withdraw to El Agheila in Central Libya. In spring 1942, Rommel had counter-attacked and driven the British back to Gazala, a few miles west of Tobruk. The plan of the Eighth Army Commander Neil Ritchie was to have XIII Corps hold the line, while XXX Corps would stop any attempt to outflank the position south of Bir Hachiem, held by the 1st Free French Brigade. They managed to slow the Afrika Korps tanks into \"The Cauldron\", the gap left in the British Lines by the destruction of the 150th Infantry Brigade, part of the 50th (Northumbrian) Infantry Division in late May 1942. British counterattacks attempted to crush it but failed. Eventually, the Free French at Bir Hachiem were forced to withdraw and Rommel was able to break out of the Cauldron. XXX Corps was forced to retreat to Mersa Matruh, held by the new X Corps. The Germans quickly broke through, surrounded X Corps (which fortunately for the British, managed to break out) and pushed XXX Corps back to El Alamein in June 1942.\nEl Alamein\nThe depleted XXX Corps pulled back to El Alamein, the last defensible position west of the River Nile. It was the only place in the Western Desert campaign in which there would not be an open flank (a normal rule of desert warfare), due to the soft ground of the Qattara Depression, immediately south of the opposing forces and the Mediterranean Sea. The northern, coastal sector was assigned to XXX Corps.\nDue to casualties and equipment losses, XXX Corps was reinforced at Alamein by the attachment of units from other Commonwealth armies (that had been attached to XIII Corps), the 1st South African Infantry Division and the 9th Australian Infantry Division. The corps's other main unit was the British 23rd Armoured Brigade Group.\nIn July 1942, XXX Corps again suffered many casualties, at the First Battle of El Alamein, although a major Axis offensive was repelled. Willoughby Norrie was replaced as corps commander by William Ramsden.\nIn August, the Prime Minister, Winston Churchill, dismissed Claude Auchinleck as commander-in-chief of Middle East Command and General Officer Commanding (GOC), Eighth Army. Auchinleck was replaced as Allied commander by Harold Alexander and as GOC, Eighth Army by William Gott (previously commander of XIII Corps). Gott was killed soon afterwards, when the aircraft carrying him was shot down; he was replaced by Bernard Montgomery.\nAt the end of August, Rommel again decided to attempt a breakthrough, this time at the southern end of the line in the Battle of Alam Halfa. While this was directed mainly at XIII Corps, XXX Corps was the subject of several diversionary raids. In September, Ramsden was replaced by Oliver Leese.\nXXX Corps was to be the focus of Montgomery's first offensive, codenamed Operation Lightfoot. The 2nd New Zealand Division (previously XIII Corps), the 51st (Highland) Infantry Division and the 4th Indian Infantry Division, along with the 9th Armoured Brigade were added to the corps.\nOn the night of 24/25 October, Lightfoot commenced with a prolonged and intense artillery bombardment, XXX Corps attacked and quickly suffered many casualties but the Australian, New Zealand, South African and Highland divisions continued to attack, creating several gaps in the minefields, before German resistance stopped further advances. To bring XXX Corps up to strength, the 50th (Northumbrian) Infantry Division (XIII Corps) was added.\nEarly on the morning of 2 November, X Corps and XXX Corps launched the fourth phase of Lightfoot, codenamed Operation Supercharge. By 4 November the tanks of X Corps had broken through and the British had won the Second Battle of El Alamein.\nThe 9th Australian Division was transferred to the South West Pacific theatre. The 1st South African Division was left in Egypt. After El Alamein, XXX Corps pushed forward steadily. It stopped its advance at the Mareth Line in Tunisia in late February 1943.\nTunisia\nOn 19 March, XXX Corps launched an attack on the Mareth Line as part of Operation Pugilist, with the 50th (Northumbrian) Infantry Division and the 51st (Highland) Infantry Division in the lead. They managed to create a gap but it was quickly contained by the 15th Panzer Division. During Operation Supercharge II a force commanded by Lieutenant-General Brian Horrocks composed of the New Zealand Corps and the 1st Armoured Division from X Corps exploited a flanking position established by the New Zealanders during Pugilist and broke the German flank defences on the night of 26/27 March, forcing the outflanked German forces to withdraw northwards to Wadi Akarit.\nIn mid-April, XXX Corps attempted to attack the position head on but made little progress against determined German and Italian resistance. By that time the First Army had broken through the German line on their left in central Tunisia and the Axis forces were forced to surrender.\nSicily\nOn 10 July 1943, XXX Corps was part of the Allied invasion of Sicily. The corps (under Lieutenant General Oliver Leese) was to compose the left flank of the Eighth Army. It was reinforced with the 1st Canadian Infantry Division, the 1st Canadian Armoured Brigade, and the 231st Infantry Brigade of units from Malta.\nXXX Corps landed near Pachino and made early gains against the Italian 206th Coastal Division and the 54th \"Napoli\" Division. By 18 July, it was halfway to Messina. Progress slowed considerably after that because Sicily's mountainous terrain favoured well-equipped defenders (like the German forces in Group Schmalz) and they managed to move very little. The Axis began withdrawing troops from Sicily and the Germans put up a brave fighting withdrawal. By 17 August, the last German troops had crossed the straits of Messina and the Allies were in control of Sicily. XXX Corps was then pulled out of the line and sent to the United Kingdom to re-fit and re-train for Operation Overlord.\nNorth West Europe\nOrder of Battle\nThe order of battle was as follows:\nGeneral Officer Commanding Lt-Gen Gerard Bucknall (to 3 August 1944)Lt-Gen Brian Horrocks (from 4 August 1944)\n* Corps Troops:\n** 11th Hussars (armoured cars)\n** 73rd Anti-Tank Regiment, Royal Artillery\n** 27th Light Anti-Aircraft Regiment, RA\n** 4th (Durham) Survey Regiment, RA\n** XXX Corps Troops, Royal Engineers\n** XXX Corps Postal Unit, Royal Engineers\n** XXX Corps Signals, Royal Corps of Signals\n* 5th Army Group, RA\n** 4th Regiment, Royal Horse Artillery\n** 7th Medium Regiment, RA\n** 64th (London) Medium Regiment, RA\n** 84th (Sussex) Medium Regiment, RA\n** 121st (West Riding) Medium Regiment, RA\n** 52nd (Bedfordshire Yeomanry) Heavy Regiment, Royal Artillery\n* Divisions (for the invasion of Normandy):\n** 7th Armoured Division;\n** 49th (West Riding) Infantry Division;\n** 50th (Northumbrian) Infantry Division.\n* Divisions (17 September 1944):\n** Guards Armoured Division;\n** 43rd (Wessex) Infantry Division\n* Divisions (May 1945):\n** 5th Infantry Division;\n** 43rd (Wessex) Infantry Division;\n** 51st (Highland) Infantry Division;\n** 3rd Canadian Infantry Division;\n** 8th Armoured Brigade\nNormandy\nIn Normandy XXX Corps, now commanded by Lieutenant-General Gerard Bucknall, again included the 50th Division which landed on Gold Beach. It quickly overwhelmed the German defenders of the 716th Infantry Division and had linked up with the I Corps by the end of D-Day. Following D-Day the corps launched Operation Perch. It made slow gains facing stiff resistance but by 10 June had linked up with US forces advancing from Omaha Beach. On 12 June, an opportunity arose. The Germans had a gap in their front lines near the Town of Caumont-l'Éventé. The 7th Armoured Division was sent to exploit the gap and head towards Villers-Bocage to outflank the German Panzer-Lehr-Division and force them to withdraw, resulting in the Battle of Villers-Bocage. This attack was thwarted by elements of the Panzer Lehr Division and the 101st SS Heavy Panzer Battalion. Bucknall was heavily criticised for his decisions during the operation and battle.\nXXX Corps was then involved in a battle of attrition with only minor gains being made. Up to 24 July, the front line remained relatively unchanged. The next day the Americans launched Operation Cobra, an attack on German positions on the western end of the Contentin Peninsula. They made considerable progress and the Second Army launched Operation Bluecoat to support the attack and to exploit the momentum. VIII Corps, on the right flank made considerable progress but XXX Corps was sluggish. Montgomery sacked Bucknall and replaced him with Lieutenant-General Brian Horrocks, a distinguished veteran of North Africa. After the sacking of Bucknall, the performance of XXX Corps improved considerably and it managed to keep up with the other British corps during the Battle for the Falaise Gap. After the German collapse, XXX Corps quickly advanced north-east and liberated Brussels and Antwerp in Belgium. There the advance was halted because of a shortage of fuel. Elements of the Guards Armoured Division and the 2nd Household Cavalry Regiment managed to secure a bridge across the Maas-Schelde canal into the Netherlands. This bridge was nicknamed Joe's Bridge in honour of Lieutenant Colonel Joe Vandeleur of the 2nd Battalion, Irish Guards who captured the bridge.\nOperation Market Garden\nAfter the success in France and Belgium, General Montgomery commanding the 21st Army Group turned his attention to outflanking the Siegfried Line and invading the Ruhr in a pincer movement. The northern part of the pincer would be near Arnhem at the Dutch–German border. Allied troops would concentrate at this point to form the northern part of the pincer. XXX Corps, consisting of approximately 50,000 men, would advance along the main axis of the Second Army and reach Arnhem within 48 hours, and continue on to the Dutch–German border. XXX Corps was to be the GARDEN part of the operation to advance past Arnhem. This required crossing water obstacles, the last of them a road bridge at Arnhem. When the pincer closed, this would allow the British to trap the 15th Army, splitting it from the 1st Parachute Army on the way around the northern flank of the Siegfried Line.\nThe MARKET part of the operation was to seize the bridges up to Arnhem. Montgomery requested from General Dwight D. Eisenhower, the Supreme Allied Commander on the Western Front, to deploy the First Allied Airborne Army. The 101st Airborne Division (Major General Maxwell D. Taylor) was dropped at Eindhoven, to secure the Son and Wilhelmina Canal bridges, the 82nd Airborne Division (Brigadier General James M. Gavin), dropped at Nijmegen, to secure the Grave and Nijmegen bridges, while the British 1st Airborne Division (Major-General Roy Urquhart), dropped at Arnhem, to secure the bridgehead over the Neder Rijn. Attached to the 1st Airborne Division was the 1st Polish Parachute Brigade (Major-General Stanisław Sosabowski).\nVehicles of the Guards Armoured Division of XXX Corps passing through Grave having linked up with the US 82nd Airborne Division.\nOperation Market Garden commenced at 14:00H on Sunday 17 September 1944, with the artillery preparation by 350 guns at 14:35. It was to be the most ambitious ground offensive operation by the British Army in the war so far. It was beset by problems. The ground was assessed to be too soft to accommodate the Sherman tanks of the leading Irish Guards Battle Group, forcing the entire Guards Armoured Division to stay on the single highway. As XXX Corps advanced north-east, it became obvious that the highway was prone to traffic jams and was extremely vulnerable to enemy counter-attacks.\nThe lead elements of XXX Corps, the Guards Armoured Division (Major-General Allan Adair) were ambushed by German anti-tank defences, causing delays to the advance. As a result, they were far short of the 82nd Airborne Division objectives, having not even reached the 101st Airborne Division by the end of the first day. On the second day of GARDEN, the Guards Armoured Division continued northwards to Eindhoven, where they met elements of the 2nd Battalion, 506th Parachute Infantry Regiment of the 101st Airborne Division. They soon discovered that 101st had failed to secure the bridge at Son intact, creating more delays before XXX Corps engineers arrived to build a Bailey bridge.\nOn the morning of 19 September the Guards Armoured Division advanced without facing much resistance reaching the Nijmegen Bridge on schedule the same day, where they found that the U.S. 82nd Airborne Division had failed to capture the road bridge at Nijmegen, with troops only at the southern end of the bridge. XXX Corps brought up boats used by bridge engineers, allowing two companies of the 3rd Battalion, 504th Parachute Infantry Regiment (Major Julian Cook) to cross the river to assault the bridge from the northern end. XXX Corps captured the Nijmegen bridge by running their tanks over. The Guards Armoured Division advanced and quickly established positions on the north bank to secure the bridge.\nFurther south, in the 101st Airborne Division sector, many units from XXX Corps had to be detached to fight off repeated attempts by the German 106th Panzerbrigade to cut the highway. The 231st Infantry Brigade (from the 50th Division) and the 4th Armoured Brigade spent most of the time during Operation Market Garden reacting to these probes by German Panther tanks and panzergrenadiers. This created traffic jams and delayed reinforcements reaching the Guards Armoured Division–particularly the 43rd (Wessex) Infantry Division (Major-General Ivor Thomas) and the 69th and 151st Brigades of the 50th Division, which further slowed down the XXX Corps advance.\nBy 21 September the Guards Armoured Division was exhausted and Horrocks also took ill, with XXX Corps periodically being commanded by its Brigadier General Staff (BGS) Brigadier Harold Pyman, for which he would be made Chief of Staff of the Second Army after the operation. They had fought continuously for five days, much of it against fierce German resistance and were unable to continue the offensive. The 43rd Division was brought up to continue and managed to defeat elements of the 10th SS Panzer Division that penetrated to Nijmegen area and advanced to the Neder Rijn and the area called \"the Island\". There the 4th Battalion, Dorset Regiment crossed the Rhine as a diversion, so that the remnants of the 1st Airborne Division could withdraw more safely but many men of the 4th Dorsets were left behind on the north bank of the Rhine when the division withdrew.\nThe failure of the 82nd Airborne Division to seize the Nijmegen bridge caused a long delay for the XXX Corps to arrive at the Arnhem bridge as planned. This caused the 1st Airborne Division, which was surrounded in the  Battle of Arnhem and suffered many casualties, to retreat from the Arnhem bridge after the delay enabled the Germans to reinforce with armoured divisions. Most of the 1st Airborne Division was killed, surrendered or withdrew to the 1st Polish Parachute Brigade positions, which ended the offensive.\nArdennes\nDuring the Battle of the Bulge, units of XXX Corps moved to secure the bridges over the Meuse. On 27 December the Corps pushed the 2nd Panzer Division out of Celles. On 31 December they captured Rochefort at the western end of the salient.\nThe Rhineland Campaign\nRees on the banks of the Rhine, 26 May 1945.]]\nXXX Corps was involved in the fighting that preceded Operation Plunder the Rhine crossings. Under command of the First Canadian Army and with additional divisions, it was responsible for the difficult advance through the Reichswald Forest that was the first phase of Operation Veritable in February 1945. The subsequent phases were renamed Operation Blockbuster. The terrain now allowed a two corps front, with XXX Corps taking the western side until meeting at Geldern with elements of the 9th US Army on 3 March. on 23rd March XXX Corps began Operation Turnscrew within the framework of Operation Plunder the Rhine Crossing at Rees.\nGeneral Officers Commanding\nCommanders included:\n* Aug–Oct 1941 Lieutenant-General Vyvyan Pope\n* Nov 1941 – Jul 1942 Lieutenant-General Willoughby Norrie\n* Jul–Sep 1942 Lieutenant-General William Ramsden\n* Sep 1942 – Dec 1943 Lieutenant-General Oliver Leese\n* Jan–Jul 1944 Lieutenant-General Gerard Bucknall\n* Aug 1944 – Dec 1945 Lieutenant-General Brian Horrocks\n* Dec 1945 – Sep 1946 Lieutenant-General Alexander Galloway\nSee also\n* Battle of Gazala\nNotes\nReferences\n*\n*\n*\n*\n*\n*  (published in UK as A full life)\n*\n*\n*\n|last=Mellenthin |first=Major General F. W. von |title=Panzer Battles: A Study of the Employment of Armour in the Second World War |edition=1st |orig-year=1956 |location=New York |publisher=Ballantine Books |year=1971 |isbn=0-345-24440-0|title-link=Panzer Battles (book) }}\n*\n*\n*\n*\n*\n|first1=Major-General I. S. O. |last1=Playfair |author1-link=Ian Stanley Ord Playfair |first2=Brigadier C. J. C. |last2=Molony |first3=Captain F. C. |last3=with Flynn RN |first4=Group Captain T. P. |last4=Gleave |editor-last=Butler |editor-first=J. R. M. |editor-link=James Ramsay Montagu Butler |title=The Mediterranean and Middle East: The Destruction of the Axis Forces in Africa |volume=IV |series=History of the Second World War United Kingdom Military Series |orig-year=1st. pub. HMSO 1966 |year=2004 |publisher=HMSO |location=London |edition=Naval & Military Press |isbn=1-84574-068-8 |display-authors=1}}\n*\n*\n*\nExternal sources\n* [https://ra39-45.co.uk Royal Artillery 1939–45]"
    }
  ]
}