{
  "content": [
    {
      "type": "text",
      "text": "# XYZZY Awards__disambig_2\n\nThe XYZZY Awards are the annual awards given to works of interactive fiction, serving a similar role to the Academy Awards for film. The awards were inaugurated in 1997 by Eileen Mullin, the editor of XYZZYnews. Any game released during the year prior to the award ceremony is eligible for nomination to receive an award. The decision process takes place in two stages: members of the interactive fiction community nominate works within specific categories and sufficiently supported nominations become finalists within those categories. Community members then vote among the finalists, and the game receiving a plurality of votes is given the award in an online ceremony.\nSince 1997, the XYZZY Awards have become one of the most important events within the interactive fiction community. Together with events like the Interactive Fiction Competition and Spring Thing, the XYZZY Awards provide opportunities for the community to encourage and reward the creation and development of new works within a genre that is no longer commercially lucrative.\nThe name of the awards comes from the magic word \"xyzzy\" causing teleportation from the popular early text adventure game Adventure.\nAwards\nThe awards have been presented in the following categories.\n* 2013: Captain Verdeterre in Captain Verdeterre’s Plunder by Ryan Veeder\n* 2014: The Empress in With Those We Love Alive by Porpentine and Brenda Neotenomie\n* 2015: Bell Park in Birdland by Brendan Patrick Hennessy\n* 2016: The robot (variously-named) in The Mary Jane of Tomorrow by Emily Short\n* 2017: Squire Tuck in The Wizard Sniffer by Buster Hudson\n* 2018: The bogeyman in Bogeyman by Elizabeth Smyth\n* 2019: Turandot in Turandot by Victor Gijsbers\n* 2020: The parrot in The Magpie Takes the Train by MathBrush; Kingfisher in Vain Empires by Thomas Mack, Xavid (tie)\n* 2021: Liz in Sting by Mike Russo\n* 2022: Computerfriend in Computerfriend by Kit Riemer\n}}\nBest individual PC\nA particularly well-defined and well-written player character.\nBest use of medium\nThe category had no specific criteria given to voters; many chose to interpret this award as a recognition of particularly daring interpretations of the limits and abilities of interactive fiction,  especially as regards the relationship between the player, narrator, and player character.  This award was retired in 2010, when Best Implementation and Best Use of Innovation were introduced as replacements.\nBest implementation\nIntroduced in 2010 along with Best Use of Innovation, to replace the Best use of Medium award. It recognizes \"completeness of implementation, excellence in parser messages, etc\".\nBest use of innovation\nIntroduced in 2010 along with Best Implementation, to replace the Best use of Medium award. It recognizes the \"most innovative game\".\nBest technological development\nRecognizes \"interpreters, authoring systems, libraries, utilities, and so on\".\n}}\nFurther reading\n*\nExternal links\n*[http://xyzzyawards.org/ Xyzzy Awards]\n*[https://web.archive.org/web/20070210041114/http://www.spod-central.org/~psmith/IF/xyzzies.html XYZZY Award Results 1996-2004 (with game files)]"
    }
  ]
}