{
  "content": [
    {
      "type": "text",
      "text": "# Yaar Mera Titliaan Warga\n\n| runtime        = 110 minutes\n| country        = India\n| language       = Punjabi\n| budget         =\n| gross          =\n}}\nYaar Mera Titliaan Warga  is a 2022 Indian Punjabi-language, romantic comedy drama film with Gippy Grewal and Tanu Grewal in the lead roles. The film also features Karamjit Anmol and Raj Dhaliwal. The film was directed by Vikas Vashisht, and was released on 2 September 2022. According to the Box office India, the film collected approximately ₹95,00,000 (US$116,322) on the opening day.\nPlot\nIt’s been over six years since the marriage of Gurmail Singh, and Beant Kaur. In the early years of their marriage, they found perfect happiness in each other. Things turn a downside, when their first child, Sundi, is born. Beant gives exclusive time and attention to Sundi. Gurmail starts feeling extremely frustrated as he is unable to maintain a sexual relationship with Beant, as their child is always with them. As the time goes on, so does Gurmail’s disappointment of making love to his wife. He is often surprised to find married to be happy.\nOne day, Gurmail’s friend, Semma gives him an idea of creating a fake Facebook account, with a fake name and a fake picture of a handsome man. All of a sudden Gurmail finds himself on cloud nine, as he sends friend requests to several girls and many of his requests get accepted. He starts spending most of his time of mobile phone, liking girls’ pictures and looking for fresh girls’ profiles. In the meantime, Beant’s friend, Chhindo, notices that Beant is spending excessive time on his mobile phone. She advises Beant to be cautious as she assumes Gurmail may be cheating on her by talking to his female Facebook friends. Soon, Beant establishes that Chhindo’s intuition was correct.\nChhindo comes up with an idea and asks Beant to create a fake Facebook account with a fake name and some random NRI girl’s image. She guides that, when Gurmail notices Beant doing same things too, he would quit those online activities with girls. Fate takes a strange turn as Gurmail sends a friend request to his own wife and she accepts it. Both of them are unaware of this fact. They both start talking to each other on Facebook Messenger Voice, changing their accents, so that they don’t get caught. One they decided to meet up at a shopping mall, but seeing each other there and hurriedly leave the premises.\nBeant confesses to Gurmail that she has developed friendship with some man in order to mend Gurmail’s ways. Gurmail infuriates and tells her that he wants to file a divorce against her. They decided to meet at the same shopping mall again, however, Semma and Chhindo, informs them, though the accounts of the couple are fake, the real person behind them are no one but Gurmail and Beant. Gurmail releases that relationships are so strange, the Beant whom he hated was her same Facebook friend. He concludes that it’s all about one’s perspective about relationships. Gurmail asks Beant for her forgiveness and once again, they become a happy couple and soon their second child is born.\nCast\n*Gippy Grewal as Gurmail Singh\n*Tanu Grewal as Beant Kaur\n*Karamjit Anmol as Semma\n*Raj Dhaliwal as Chinndo\nRelease and reception\nThe film was released theatrically on 2 September 2022, and on 30 September the film was launched on Amazon Prime. On\nCritical response\nThe Times of India gave the film 3.5 stars out of 5 and praised the performances of cast. The Tribune India appreciated the role played by Tanu Grewal but didn't find any difference in Gippy Grewal's role from his earlier role in Shava Ni Girdhari Lal.\nReferences"
    }
  ]
}