{
  "content": [
    {
      "type": "text",
      "text": "# Yak: The Giant King\n\n| runtime        = 105 minutes93 minutes (international version)\n| country        = Thailand\n| language       = Thai\n| budget         = 100,000,000 Baht\n| gross          = $1,668,124\n}}\nThe Giant King (; ; ) (released as The Robot Giant in some countries and Yak in Thailand) is a 2012 Thai animated comic science fiction children's/family film starring Santisuk Promsiri, Kreadtisuk Udomnak, Boribroon Junrieng, Weranut Tippayamontol, Pawanrat Naksuriya, Caninap Sirisawut, Udom Tarpanich, Bawriboon Chanreuang, Nathan LaVelle, Santisuk Promsiri, Udom Taephanit, Kerttisak Udomnak and Chris Wegoda, directed by Prapas Cholsaranont and Chaiporn Panichrutiwong and distributed by Workpoint Picture. The story is a futuristic adaptation of the fable of Tosakan and Hanuman the Monkey King from the Thai version of the Ramayana, with robots for the main characters.\nPlot\nA re-interpretation of Ramayana, the Thai animation film tells the story of a giant robot, Na Kiew, who's left wandering in a barren wasteland after a great war. Na Kiew meets Jao Phuek, a puny tin robot who's lost his memory and is now stuck with his new big friend. Together they set out across the desert populated by metal scavengers, to look for Ram, the creator of all robots.\nCast\nOriginal version\n* Santisuk Promsiri\n* Kreadtisuk Udomnak\n* Boribroon Junrieng\n* Weranut Tippayamontol\n* Pawanrat Naksuriya\n* Caninap Sirisawut\n* Udom Tarpanich\n* Bawriboon Chanreuang\n* Santisuk Promsiri\n* Udom Taephanit\n* Kerttisak Udomnak\n* Chris Wegoda\n1st English version\n* Todd (tongdee) Lavelle as Big Green/Tossakan/The old mechanic/Brooks/9 Heads/Planet/Fireman/Fire foreman\n* Hugh Gallagher as Whitey/Hanuman\n* Stephen Thomas as Kum/Kok/Bartender/Mayor/Dr. Watt/Fireman/Work foreman/Old woman\n* Hailey Rodee as Rusty\n* Tabitha King as Sadayuu\n* Vincent Junior Bergeron as Mayor's son\n* Sean Bergeron as Friend of Mayor's son/Boy\n* Chris Wegoda as Fireman/Work foreman/Old woman\n* Mariam Tokarsky as Mayor's wife/Woman was robbed/Cat's owner\n* Ananya LO as Girl\n2nd English version\n* Bella Thorne as Pinky\n* Russell Peters as Zork and Ram\n* Meg DeAngelis as Rusty\n* Gregg Sulkin as Flapper\n* Carlos PenaVega as Krudd\n* Romeo Lacoste as Bartender\n* Nathan Barnatt as Scrap Metal Dealer\n* Mark Steines as Bob the Mechanic\n* Gina Briganti as Mama Robot\n* Joseph Pfeiffer as Dad Robot\n* Dan O'Day-McClellan as Mayor\n* Mychal Simka as Various robots (uncredited)\nCharacters\n;Lead characters\n* Na Khiaw (Big Green/Tosakan, Zork in the U.S. version) - A giant war robot that is kind and innocent and sees the world only in beauty. It was different from the appearance of the other body hidden inside. When he returns to Ravana, he will be a fierce person.\n* Phuak (Whitey/Hanuman, Pinky in the U.S. version) – A clever, spunky, and cunning tin robot that is actually Hanuman. The great soldier of Ram, although small in size, is feared by all the giant robots in the war due to his strength and wit. In the American version, he is a female character.\n; Supporting characters\n* Kum (Krudd in the U.S. version) - He is a giant robot who is a true fan of Tosakan. The leader of the troupe performs a trick selling merchandise. Kum is a deformed figure, both physically and mentally. Go out and earn money to buy war weapons and keep accumulating them. A dream is to join the battle with the Deccan army. Even though he had never seen the real Ravana before.\n* Sanim (Rusty in both English versions) - a female tin robot who is a member of Kum's show troupe. Rust is shy and somewhat allergic. There is always rusty water flowing from the nose. Until it became an inferiority complex that no one wanted to play with for fear of being rusty. He is a character that makes everyone see the importance of the word friendship. In this story, she is a newly created character. Not an original character from the Ramayana\n* Sadayuu (Flapper in the U.S. version) - A sarcastic bird robot. A wartime fighter plane that is ready to fly for anyone who winds it up, moves its wings, and propellers for her. But at the same time, she is ready to taunt those who ride her all the time, according to her habit. In the American version, she is a male character.\n* Kok - a junk type robot with a career in finding scrap metal to sell in Xiang Kong. He is a moody, cunning, and selfish robot. Kok is the one who found Na Khiaw and Phuak. and bring it back to life.\n* Brooks - A robot climber, his duty is to climb the mountain without asking why. His ultimate dream is to climb the Sat Sun at noon, which is the highest pole, making it the most difficult climb.\n* Uncle Mechanic - The city's robot repairman. Having lived here for a long time, he knows many stories from the past, including the stories of Ravana and Hanuman.\n* Ram - A satellite floating outside the world. It is like the computer's mechanical brain (Ram) that controls and issues commands. Can create and destroy everything. Like Rama in the Ramayana who is a powerful person. There is a sacred command. He is the leader of Hanuman and the enemy of Ravana. The character does not speak in the Thai or original English versions, but does speak with a Russian accent in the American version, and despite carrying the same name, it is now an acronym for \"Remote Automated Motherbot\".\n* Sun Robot - A giant artificial sun robot. It looks like a giant metal ball. His face was on fire all the time. The rest of the surface is charcoal black. Has high heat It has a radius of metal blades rotating around it. The lower part is equipped with wheels that allow it to run along the track at the drop of the timekeeping post. Do your duty to create light for the world. (Representing the sun) On the outside, he appears to be a proud, honest person and will not give in to anyone easily. But he was only fulfilling the duty for which he was created.\n* Arun looks like the sun. But the sun is smaller, about 1 in 4. The surface is lined with a golden-yellow metal sheet that reflects the entire sun. Will run ahead some distance from the sun to deal with obstacles. (Representing Phra Arun Sun's sage) appears only once in the film, towards the end of the story. He was stopped by Na Khiaw because he mistook it for the sun. before being hit by the sun that followed him and causing him to fall off the rails\nAwards\nThe Best Directors are Prapas Cholsaranont and Chaiporn Panichrutiwong, The Best Score is Jakkrapat Iamnoon, The Best Editors are Smith Timsawat, Punlop Sinjaroen and Prapas Cholsaranont, The Best Art Direction is Chaiporn Panichrutiwong, The Best Sound is made by Richard Hocks and The Best Original Song is \"Kerd Ma Pen Phuen Ther\" performed by Apiwat Eurthavornsuk.\nRelease\nThe film was theatrically released in 2012 and 2013 in Thailand and Russia in cinemas and in Australia and New Zealand at the DVD Premieres. Two English dubs of the film were produced, one in its home country of Thailand, and another in 2015 by Grindstone Entertainment Group. While the original English dub stays very close to the Thai script, the Grindstone dub makes heavy changes to the story, with all the references to Ramayana removed, along with changing some of the character names, personalities, and even some of the genders of characters.\nHome media\nYak: The Giant King was released on Blu-ray by Happy. Outside of Thailand, it was first released in Australia on DVD by Eagle Entertainment on December 28, 2013. The Grindstone dub was released straight-to-DVD by Lionsgate on December 22, 2015.\nA sequel short film was released as part of the three shorts in Khun Tong Daeng: The Inspirations.\nTheme song\n*\"We Were Born To Be Friends\"\n**Artist: ROOM 39\n**Composition: Stamp\nReferences\nExternal links\n*\n*"
    }
  ]
}