{
  "content": [
    {
      "type": "text",
      "text": "# Yamato Kingship__disambig_1\n\nThe  |ヤマト王権|Yamato Ōken}} was a tribal alliance centered on the Yamato region (Nara Prefecture) from the 4th century to the 7th century, and ruled over the alliance of noble families in the central and western parts of the Japanese archipelago.  The age is from the 3rd to the 7th century, later than the Yamatai Kingdom. After the Taika Reform, the ōkimi as an emperor, at that time, was in power, and the Yamato period ended. The time period is archaeologically known as the Kofun period. Regarding its establishment, due to the relationship between Yamatai and Yamato's succession to the king's power, there are very different views on it.\nThe Yamato Kingship refers to the regime that emerged in the Nara region (Yamato region) since the 4th century. But the term does not imply the origin of Japan, which is disputed in Japanese history. At the same time as the rise of the , there were probably several or even dozens of power centers in the Japanese archipelago. This is an issue that Japanese academia attaches great importance to.\nIn the course of the development of the tribes from the state of separation to the direction of union between the 2nd and 3rd centuries, the Japanese royal power had become the center of the tribes. In order to establish its position as a united ally, the Japanese royal power attached importance to foreign relations, paid tribute to China's Eastern Jin and Liu Song dynasties, and made every effort to maintain close relations with the countries on the Korean peninsula (Baekje and Gaya), monopolizing various technologies imported by foreigners. In the second half of the 5th century, it was able to overwhelm the gentry in the capital and the local clans.\nName\nUntil the early 1970s, the \"\" was widely used as a time period from the 4th to the 6th century, and the name \"\" was used unambiguously as the political power that ruled the main part of the Japanese archipelago during that period.\nHowever, since the 1970s, with the discovery of significant kofuns and excavations, the use of physical and chemical dating and dendrochronology became available. As the accuracy of these methods improved, research on the chronology of kofun tombs progressed remarkably, and the view that it was not necessarily appropriate to use the words \"Yamato\" and \"imperial court\" to describe the period emerged, and this view became influential in historical societies in Japan, and thus the term \"Yamato period\" was replaced by \"Kofun period\" instead of \"Yamato period\" has become a common name in Japanese historical research and higher education in Japan. However, dendrochronology and radiocarbon dating have not yet reached a stage where they can actually be called established techniques, and many researchers have pointed out shortcomings and problems with their accuracy and measurement methods of the Kofun period.\nIn this article, these \"\" and \"\" will be explained. In the first half of the Kofun period, terms such as \",\" \",\" and \"\" have also been used in recent years (for details, see the section \"About Names\"). After the Kofun period, from the Asuka period onward, the Japanese centralized organization led by a great king/emperor is commonly described as the \"\" both in historical research and in most of the world.\nHowever,  is also used by some researchers. This reflects the fact that various views on the use of the terms \"\" and \"\" exist side by side in the academic community.\nAs of 2020, \"\" and \"\" are also used in the media, but \"\" is also used and is not unified. まちの話題  佐賀新聞ニュース |trans-title= Iseyama Shrine Spring Festival to be held on August 8 to pray for a good harvest and peace in the world. |url=https://www.saga-s.co.jp/articles/-/494176 |access-date=2022-06-13 |website=佐賀新聞 |language=ja}}\nAbout \"Yamato\"\nYamato|Wa (Japan)}}\nIn the Kojiki and Nihon Shoki, completed in the first half of the eighth century, as well as in other documents, metal and stone writings, and wooden tablets from the seventh century and earlier, the characters  is not used for \"Yamato\", but  is written. \"Wa (倭)\" was the Chinese name for Japan in ancient times, but the oldest source on its origin is a document written in the 200s by the Wei official (魏の官人) Rujun (如淳), who argued that Wa was derived from the word \"people\" (人偏) who had the custom of \"tattooing (委) on the face.\" This theory is also supported by many Japanese scholars, as the indigenous Ainu people of Japan have the custom of tattooing (sinuye).　Furthermore, Chinese from the Qin and Han dynasties to the Sui and Tang dynasties is known to have a pronunciation close to modern Cantonese, and even in modern Cantonese, the pronunciation of \"委奴: Wainu (wai2 nou4)\" and \"倭奴: Wainu (wai1 nou4),\" referring to the \"Ainu (Wainu) people,\" has remained unchanged from ancient times to the present day\nIn the third century, the description about Yamataikoku is appeared in the Wajinden, in the Book of Wei. With the enactment of the Taiho Ritsuryō (Taihō Code) in 701, a name of country (as well as a name of county and village) was to be written in two characters, and accordingly, the expression of the country was changed to  (the reading is the same Yamato). After the some change in 737 by Fujiwara no Nakamaro and other reasons, the expression of the country was changed to  (Yamato) in around late 757. Since the expression  was used widely from the enactment of the Yōrō Code, there is an opinion that it is not appropriate to use this kanji name () for the political center or power before the seventh century. 。However, there are the researchers, such as Makoto Takemitsu, who use this name from the late third century.\nThe word \"Yamato\" also means.\n# Yamato is also a kun-yomi reading of the national name \"Japan\" (i.e., the entire nation of Japan in ancient times).\n# Yamato as a province of Japan (above)\n# Yamato in the southeastern Nara Basin at the foot of Mount Miwa (i.e., the Isojigun, Juichi-gun, and Yamato-kuzo in the Yamato Province)\nIt has three different meanings 、Yamato, the narrowest of the three, is the area where the emergence-period burial mounds are concentrated, and it is thought to be the place where the center of the royal administration existed. Rather than \"Yamato,\" which is immediately associated with the imperial Yamato State (2), \"Yamato\" which clearly implies 3 is more appropriate.\nShiraishi further points out that from the Nara and Kyoto basins to the Osaka Plain, the Yodo River system in the north and the Yamato River system in the south have very different types of ancient tombs. Yamato\" is rather the area of the Yamato River system, i.e., the combination of the later Yamato and Kawachi (including Izumi).。In other words, according to Shiraishi, the katakana notation \"Yamato\" is used because it can comprehensively handle the meaning of the Yamato River system (Yamato and Kawachi) in addition to 1. to 3.\nOn the other hand, Kazuhiko Seki states that \"Yamato\" was used from the 8th century, and before that, it was written as \"Yamato\" or \"Daiwa\", so that although \"Yamato\" or \"Daiwa\" is appropriate to describe the regime in the 4th and 5th century, \"Yamato\" is appropriate to prevent confusion between the two. 。\nOn the other hand, there are researchers who use the \"Yamato\" notation, such as Takemitsu mentioned above. 。\nAccording to Takemitsu, the ancients called the area at the foot of Mt. Miwa \"Yamato,\" a name that distinguished it from other areas in the Nara Basin such as \"Asuka\" and \"Ikaruga,\" and the current terminology of calling the entire Nara Prefecture \"Yamato\" did not appear until the 7th century. Takemitsu, who considers Garthrace to be the birthplace of the \"Yamato Court,\" calls the whole area \"Yamato,\" the ancient city. 。\nOn the \"Royal Court\"\nThe term \"Royal court\" has its original meaning as a governmental office where the Son of Heaven conducted political affairs such as dynastic government and Ritual, collectively known as dynastic rites. Bureaucracy with a Centralised Government and Emperor as a sovereign title, and that it is inappropriate to use the term \"Imperial Court\" in a situation where the various governmental systems are not in place. For example, Kazuhiko Seki defines \"imperial court\" as \"the political seat of the emperor\" and argues that it is inappropriate to refer to the 4th century and 5th century regimes as the \"Yamato Imperial Court\" and Kito Kiyoaki also argued in a book for the general public that multiple dynasties could have existed in the Kinki region at the time of the Iwai Rebellion, and that before the Emperor Keitai The term \"Yamato Court\" should be used only from the 6th century after Emperor Tsugitai, as \"there may be cases where the Yamato Court is unrelated to the Emperor Keitai.\n\"State\" \"Government\" \"Kingship\" \"Royal Court\"\nKazuhiko Seki said that \"kingship\" is \"the political power of the king\" as opposed to \"the court\" which is the \"political place of the emperor\".  \"Government\" is defined as \"ultra-historical political power\", and \"state\" is defined as \"the entire power structure that embraces them\". As for the inclusion of words, the scheme of imperial court\nAbout the term \"Yamato kingship\"\nThe ancient historian Yukihisa Yamao explains that \"Yamato kingship\" \"refers to the power structure of kings established in the central Kinki region in the 4th and 5th centuries, and is seen in the emperor genealogies of Kojiki and Nihon Shoki as corresponding roughly from Sujin to Yūryaku\".\nIn another book, Yamao also defines \"kingship\" as \"an organism of power in which a community of privileged groups assembled as the king's vassals\" is \"the center of a hierarchical unity\" of \"a race of subordinates to the king, with the king as their apex authority\", which \"emerged clearly in the Kofun period. On the other hand, Taiichiro Shiraishi refers to the \"coalition of political forces from all over the Japanese archipelago except for the north and south\" and the \"wide-area political coalition\" as the \"Yamato government\", and states that it is \"the leader of the coalition of chiefs of the Kinai and the coalition of political forces from all over the Japanese archipelago. The \"Yamato kingship\" is the name given to the \"Kinai kingship, which was both the leader of the Kinai confederation of chiefs and the ally of the Yamato government, which was a federation of political forces from all over the Japanese archipelago.\nAlso, according to Yamao.\n* 190s-260s The period of the emergence of royal power.\n* 270s–370s: Early royal period.\n* 370–490 The period of completion of kingship. This is followed by the unification of tribes by kingship (from the 490s), and then the construction of early states (from around 530).\nThe term is used to describe the period from the time of the completion of the kingship to the time of the unification of the tribes by the kingship (from the 490s), and the construction of the early state (from around 530).\nThe term was first used by Ishimoda Tadashi in his Iwanami Koza Nihon Rekishi in 1962. It is also used as a concept of classification, but it is not necessarily strictly defined and there is no common understanding of the use of the word\nYamato Imperial Court\nThe term Yamato court has three meanings:\n#  is a powerful political force and organization based in the Nara period before the establishment of the Ritsuryo state.\n# The government and administration of the Yamato period (Kofun period). Yamato kingship.\n# , a centralisation government or administration with a bureaucracy led by the Son of Heaven (Emperor of Japan) during the Asuka period or late Kofun period.\nIn the pre-war period, the term was used in the sense of 1. but after the war, it came to mean simply \"the government of the Yamato period or Kofun period\" (2.). However, with the examination of the word \"dynasty\" and the progress of archaeology research on kofun, especially on the anterior and posterior tombs, the word is increasingly used in a more limited sense, as in 3.\nAt present, researchers and authors who use the term \"Yamato Court\" in the sense of 1. include Takemitsu Makoto and Takamori Akinori. Takemitsu, in his Encyclopedia of the Kojiki and Nihonshoki (1999), lists the Jimmu expedition and Naganohiko's setsuwa as the \"origin of the Yamato Court\".\nWhen using \"Yamato Court\" as a topic in comprehensive ancient history research that also takes into account Chinese archival materials, or in archaeological research based on archaeological materials, the words \"Yamato (Yamato) kingship\" and \"Yamato Court\" are used interchangeably. In some cases, words such as \"Yamato (Yamato) kingship\" and \"Yamato Imperial Court\" are used interchangeably for chronological purposes. For example.\n* \"Yamato kingship\" before Emperor Ankang, and \"Yamato court\" after Emperor Yusei in the late 5th century – Kunio Hirano\n* Before Emperor Seonghwa, \"Yamato royal authority\" or \"Yamato royal authority\", and after Emperor Kinmei in the middle of the 6th century, \"Yamato court\" – Kiyoaki Kito\nThe establishment of kingship\nOccurrence of small countries\nIn the Yayoi period, as there is the description of \"Wa-kokuō Suishō\" (, Suishō the King of Wa) dated 107 in the \"History of Tō-i (Eastern I)\" () in the Book of the Later Han, we can see that there were a certain territory called \"Wa\" and its monarch called \"King\". However, the details of the political organization are not known, and since there is a report in the Wajinden, in the  Record of the Three kingdoms (), which says \"there are currently 30 countries with which our envoys can contact and communicate\", it is likely that the state of separation of small countries continued until the third century.\nIn addition, from the description in the Book of Later Han, which reports \"During the reign of Emperor Huan and Emperor Ling of Han, Wakoku was largely disturbed, and countries fought each other, and thus there was no Lord for a long period.\" (, Kan-Rei no kan, Wakoku ōini midare, komogomo ai-kōbatsu-shite, rekinen aruji nashi.), it is clear that the political bond among the small countries was not necessarily strong. This description is also supported by the archaeological materials. They show that moated settlements with deep moats and earthworks, and highland settlements, which seem to have had a watchful function, were built in high places unsuitable for rice cultivation, and that many of the bodies in the tombs, which were clearly killed or injured in the battle, were unearthed. In the Jōmon period, stone arrowheads were used exclusively as tools for hunting small animals, but in the Yayoi period, they had become larger and were transformed into weapons that could be used against humans. These archaeological evidences suggest that conflicts between small countries were fierce.\nThe Yamatai Kingdom and Queen Himiko\nThe Wajinden states that Himiko came to prominence in Yamatai in the first half of the 3rd century, and that the states (probably city-states) \"co-established\" Himiko and made her queen, thus ending the strife and creating a federation of about 30 small countries. The Wajinden also states that the Emperor of the Wei awarded Himiko the seal of }}. It also states that Yamatai had a certain degree of social stratification and organization, such as differences in status between the governing , }}, and }}; a system of punishment and taxation; and the establishment of an inspector-like office under the title of , which helped to oversee territories north of Yamatai itself.\nThere are two theories about the location of the Yamatai Kingdom: the Honshu Theory, and the Kyushu Theory. According to the Honshu Theory, a political coalition covering a wide area from the Kinki region to northern Kyushu was already established in the third century, and this was likely the precursor to the later Yamato court. Meanwhile, the Kyushu Theory holds that the coalition under Himiko was only a local regional group, unrelated to the Yamato court.\nStruggle between the Yamataikoku and the Kununokuni\nIn Japan, there was a war between the Yamataikoku and the Kununokuni, and in 247 (the eighth year of the Shosho Era), the director of the Obikata County, Zhang Zheng, who was sent to Japan to receive reports of the conflict between the two countries, admonished the queen with a proclamation. In addition, according to the Book of Records of the Wei Dynasty, after the death of Himiko, a male king took over but there was a civil war and a 13-year-old girl from Himiko's clan, Iyoyo (壹與, or Toyo (臺與) in later historical books), became king and ruled again. In the Empress Jingu period of the Chronicles of Japan, the Jin Ki-ui-note (no longer extant) cited in the Empress Jingu period of the Chronicles of Japan mentions that in 266 (the second year of Tai-chou (an error in \"Tai-shi\")), an envoy of the Queen of Japan went to Luoyang, the capital of the Western Jin Dynasty, to pay tribute to Luoyang, the capital of the Western Jin Dynasty, and this queen is thought to be Taiyou. Therefore, it is possible that the \"Nihon Shoki\" assumes that the actions of Taeyo were those of Empress Jingu. In addition, there is no mention of a queen in the extant Book of Jin, although the Siyi biography and the Wudieki do mention a Japanese tribute in 266.\nIn addition, the location of the Kununokuni is to the south of the Yamatai Kingdom. In the Wajinden, there is another Japanese country a thousand miles across the sea to the east of the Yamatai Kingdom, and in the west of the Yamatai Kingdom is the Land of the Rising Sun. To the northwest of the Yamatai Kingdom is Obikata County, and to the north is Itokoku.\nYamataikoku Union and the Garnet Ruins\nTaiichiro Shiraishi states, \"The political coalition of the wide area centered on the Yamataikoku, which was greatly revolutionized by the reorganization of the coalition order following the death of Himiko in the middle of the third century and the expansion of the map following the merger with the Kununokuni coalition, is none other than the Yamato government from the latter half of the third century onward. 。\nAs a basis for this, it is claimed that the site of Nara Prefecture was the center of a federation of small states in the Kinai region at that time. 。This site is located at the foot of Mt. Miwa in the southeastern part of the Nara Basin, where the \"Great City\" is said to have been located in the Asuka Period. Remains, which are said to be traces of urban planning, have been found, and civil engineering works such as canal have been carried out. As a political city, more than 30 pits for storing ritual tools, ritual halls, and temporary buildings for rituals were found, and the site was located in the Tōkai region, Hokuriku, Kinki, Asan Setouchi, Kibi, Izumo, and a small number of northern Kyushu pottery. It is a huge site comparable to the Fujiwara Palace at the end of the 7th century, which is about ten times larger than the Karako-Kagi site, one of the largest moat encircling settlements in Japan, and about six times larger than the Yoshinogari site. It is said to be a huge ruin, possibly surpassing the scale of Taga Castle ruins. 。Takemitsu Makoto states that the Garou site is the birthplace of the \"Yamato Imperial Court\".\nThe unique scallop-shaped burial mounds (called \"scallop-shaped burial mounds. These mounds, with a mound length of 90 meters, are much larger than those in other regions, and they are also said to have inherited the culture of each region in a comprehensive manner, such as the four-cornered protruding mound tombs in the San'in region (Izumo) and the shield-built mound tombs in the Kibi region. Shiraishi Taichiro states that Kibi was an important ally of the Yamato, as special vessels and vases that were erected on top of mounds in Kibi were adopted. 。\nThe site of Garnet from the standpoint of the Kyushu theory of the Yamataikoku\nHowever, according to the Wajinden, Yamatai is located in the south of Ito Province, which is compared to Itoshima, and it is said that the country was prosecuted with a major leader in Ito Province, and that it produced ironware and Silk, which have only been excavated in Kyushu. Furthermore, the artifacts excavated from the site of Garenguma are scarce in terms of Kyushu and Korean origin, and there are no traces of active trade with the continent as described in the Wajinden, and the site itself is located inland, far from the sea.\nAccording to Sekikawa Naokoh of the Archaeological Institute of Kashihara, Nara Prefecture, the large number of Han mirrors, later Han mirrors, and swords that indicate exchange with Korea have been excavated in Kitakyushu, while none have been excavated at the Garenguma site, and therefore, the active exchange with the peninsula and Korea shown in the \"Wajinden\" has not been proven, and the Garenguma site is not the site of the Yamatai Kingdom. 。\nIn addition, there is an excavation of a large mirror with a flower design in the same size and style as the Yata no Kagami of the Three Sacred Treasures from the Hirabaru site in Itoshima, which raises the question of its relationship to the Yata no Kagami, which is a strong candidate for the Yamataikoku, is a burial site with a burial chamber. |The Gionyama burial mound, which has a large number of mass graves and jar coffins and is said to be similar in size and shape to those recorded, is also still a popular theory for the Kyushu region of the Yamatai Kingdom. In the case of this theory, the question arises as to the relationship between the Yamataikoku and the Yamato government that developed in the Kinai region, and whether the Yamataikoku in Kyushu was destroyed or, as in the myth, moved eastward to the Kinai region and became the Yamato government.\nEstablishment of Yamato \"kingship\"\nThere is a prevailing view that the establishment of the Yamato kingship was based on the appearance and spread of the anterior and posterior round tombs. The date of its establishment varies slightly depending on the researcher, such as mid-3rd century, late third century, and early fourth century. The Yamato Kingdom is thought to have been a coalition government that included not only the Kinki region but also the powerful clans of various regions, while others believe that it was a centralized state led by an Okimi.\nAround the latter half of the third century, burial mounds with large mounds appeared in the Kinki region and other parts of western Japan. All of these tombs were either anterior-ventral or posterior-ventral mounds, and the bodies were buried in split bamboo wooden coffins several meters long inside pit-type stone chambers, and the secondary funerary objects included numerous bronze mirrors with magical meanings and weapons. This is often referred to as the \"emergence period\". This is often referred to as an \"emergence period tomb. However, due to the technical shortcomings of Radiocarbon dating and Dendrochronology, and the large discrepancy between the measured values and the written records, some argue for a fourth century appearance based on conventional pottery dating.\n]]\nThe uniformity of the tumulus during the period of its appearance (the first half of the Kofun period) shows that the tumulus was created as a common grave system for the chiefs of each region, and the chiefs were also jointly funeralized. There is an opinion that the alliance between them was established and a wide-area political union was formed. The spread is from Tokai / Hokuriku to northern Kyushu centering on Kinki. On the other hand, as mentioned above, around the 4th century, it is thought that it overlaps with the reigning age of Emperor Sujin. There is also an opinion that it spread because the ancient burial mounds appeared together, and the central lords were dispatched to various places as chiefs (Kuni no miyatsuko) instead of the regional coalition.\nThe only emergence-period burial mounds with a mound length of more than 200 meters are the Hashihaka Kofun (280 meters) in Sakurai, Nara, Nara Prefecture, and the Nishidenozuka burial mound (234 meters) in Tenri, Nara. Kofun (280 meters) and the Nishidenozuka tumulus (234 meters) in Tenri City, which are concentrated in the southeastern part of the Nara Basin (Yamato in the narrowest sense) and are isolated in scale from the rest of the region. This indicates that this political coalition was led by the forces of the Kinki region, centered on Yamato. This is why this regime is called the \"Yamato regime\" or the \"Yamato kingdom. This regime is sometimes referred to as the \"anterior-anterior-cylindrical tomb system\" because the establishment of the regime is based on the appearance of uniform anterior-anterior-cylindrical tombs.\nKingship?\nYukihisa Yamao writes: \"It is highly probable that a 'kingship' was established in the Kinki region in the latter half of the third century, but whether it can be called a 'kingship' or not is left to future research. However, it is not clear whether this can be called a 'kingship' or not, and whether a 'royal lineage' already existed or not is left to future research.\" Yamao himself is cautious about using the term \"Yamato kingship\". Yamao himself is of the opinion that \"the establishment of kingship can be recognized in the period of Yusei and the establishment of royal lineage in the period of King Meiji\", so a systematic study of the history of state formation including this perspective is required.\nThe relationship between the \"Yamato kingship\" and the Yamataikoku\nTakehiko Yoshimura, in \"Iwanami Lecture on the History of Japan, Volume 2: Ancient Times I,\" refers to \"the royal power assumed after Emperor Sujin\" as the \"Yamato royal power,\" and describes the relationship between the early Yamato royal power and the Yamataikoku: \"According to recent archaeological research, the possibility that the location of the Yamataikoku was in the Kinki region has become stronger. However, this has not been proven historically. However, this has not been proven historically, and the genealogical relationship with the early Yamato kingdom seems to be rather unconnected. 。\nYoshimura points out that \"it is problematic whether the construction of a burial mound implies the establishment of a regime or a state,\" and argues that the conventional viewpoint that ascribes a political foundation to the location of a burial mound needs to be reconsidered. He argues that we need to reconsider the conventional viewpoint that ascribes political bases to the location of ancient tombs. If a group of chiefs exercising influence over a specific region had only a specific sub-region as their base, then phenomena such as the \"successive relocations\" in the Chronicles would not have occurred. 。\nYoshimura's view is that regardless of the early or late appearance of the anterior and posterior round burial mounds, there is a discrepancy of several decades between the time of the establishment of the Yamato kingship and the appearance of the Andonzan burial mound (present-day Sojinryo). 。\nTheory of Multiple Dynasties and Parallelism of Two Dynasties\nIn addition to the Kyushu dynasty theory, there is another theory that advocates the coexistence of two dynasties the Multiple dynasty theory, the Yamataikoku in Kyushu and the Yamato kingdom in the Kinai region, as well as the multiple dynasties theory that believes there were certain forces in ancient Izumo and Kibi. There is also a theory of multiple dynasties that believes that there were certain forces in Izumo and Kibi in ancient times. In the theory of two dynasties in parallel, there is a theory that the Yamato Kingdom expanded its power after branching off from the Yamataikoku and destroyed the main Yamataikoku.\nDevelopment of royal power\nThe first half of the early Kofun period.\nThe Japanese archipelago from the late third century to the first half of the 4th century therefore lacks almost all history, including gold and stone texts, and thus the political and cultural aspects of the period can only be examined from archaeological sources.\nBy the middle of the fourth century at the earliest, stylized kofun tombs had spread from the southern Tohoku region to the southern Kyushu region. This means that a vast area of eastern Japan was incorporated into a broad political union (Yamato kingship) with Yamato as its leader. However, in western Japan, most of the tombs that were considered to be tombs of chiefs in the early stages of their emergence were anterior and posterior round tombs, while in eastern Japan, most of them were anterior and posterior. This is how the Kofun period began in most areas of the Japanese archipelago, and Kofun tombs were constructed in earnest.\nBelow, the following three periods are set as the period division of the Kofun period, as is commonly accepted.\n* Early Kofun period ... From the latter half of the third century to the end of the fourth century\n* Mid Kofun period ... From the end of the fourth century to the end of the fifth century\n* Late Kofun period ... Early sixth century to early seventh century\nThis division is further subdivided into the first half of the early period (first half of the 4th century), the second half of the early period (second half of the 4th century), the first half of the middle period (end of the 4th century, first half of the 5th century), the second half of the middle period (second half of the 5th century), and the first half of the late period (first half of the 6th century to the latter half of the 7th century), and the following sections are based on this classification. The latter half of the Late Period (late 6th/early 7th century) corresponds to the first half of the Asuka Period as a political period name.\n.]]\nKofun tumuli come in a variety of shapes, such as anterior and posterior round tombs, anterior and posterior square tombs, round tombs, and square tombs. Although the number of tombs was dominated by round tombs and square tombs, in terms of the size of the tombs, the top 44 tombs were all post-anterior-round tombs, which were considered the most important. The distribution of these tombs spans the Yamagata and Kitakami basins in the north, and Osumi and Hyūga in the south, suggesting that the hierarchy that built the tombs was the Chief class that controlled vast areas throughout the archipelago.\n}}\nOn the top of the mound of the Early Period burial mound, cylindrical haniwa (clay figurines), which originated from the special vessel bases that were grave goods in the Kibi region in the late Yayoi period, are placed side by side, and many of them have their surfaces covered with Fukiishi, and some of them have Moat around them. The funerary objects include bronze mirrors such as triangular-rimmed mirrors and mirrors with painted bands, bracelets made of jasper, jade (magatama, ), iron weapons and agricultural machinery. The buried chief was not only a political leader in each region, but also a Priest who worshipped God while actually performing agricultural rituals. Priests who worshipped God while also performing rituals (ritual unity).\nAmong the chiefs who made up the Yamato coalition government, the above-mentioned Kibi and the northern Kanto region were particularly important. The Keno region, especially in Ueno, had large burial mounds and played an important role. The Hyūga in southern Kyushu and the Sendai Plain in Rikutsu were also important regions. Taiichiro Shiraishi attributes this to the fact that both regions were frontier regions for the Yamato government coalition. 。\nSeven-Branched Sword and the Monument to Kōkaido-ō (Late Early Kofun Period)\nIn the latter half of the fourth century, the Seven-Branched Swords found at the Isonokami Shrine (Nara Prefecture) are dated to 369 by their inscriptions. The seven-branched sword was made for the King of Japan by the crown prince of Baekje, who founded his kingdom in Mahan confederacy in 356, indicating the establishment of the alliance between the Yamato and Baekje kingdoms. In addition, it is important to note that the seven Chinese zodiac signs were actually presented to the King of Yamato in the \"Nihon Shoki\", and the actual date was 372 when the zodiac signs were carried forward two orders.\nIn any case, Japan had a close relationship with the Gaya countries, especially Mimana, and secured the iron resources produced in the region. In the northern part of the peninsula, on the other hand, there is the Mimana, where the Japanese government was closely involved with the Mimana, especially with the Mimana, and secured the iron resources produced in the region.\nOn the other hand, in the northern part of the peninsula, Goguryeo, the Yemaek nation, a state of the Tungusic peoples, which originated in the forest area in the eastern part of Manchuria, was established in 313 in Lelang-gun, Daifang Commandery. Goguryeo, invaded and destroyed Daifang Commandery in 313, and continued its southward expansion in the late fourth century. The Gwanggaeto King Monument in Jilin Province, China, which was established to record the achievements of the King Gwanggaeto (Kōkaido-ō in Japanese), states that Goguryeo defeated Baekje, which was connected to Japan, and engaged the Japanese twice in 400 and 404 to rescue Silla from the Japanese invasion. It is engraved that it was done ( Korean literature related to Wa and Wajin ).\nThe Age of Giant Tombs (First Half of the Middle Kofun Period)\nSakai City)]]\nThe entire period from the end of the 4th century to the 5th century is considered the middle period in the archaeological classification of the Kofun period. In this period, the proportion of weapons and armors among the burial accessories increased, and horse harnesses and Tankō and Kabuto increased. These cavalry skills, weapons, and tools are thought to have been brought to Japan through the above-mentioned war against the Koguryo in the late 4th to early 5th centuries, when the Koguryo warriors fought with cavalry units. There was once a time when by overestimating these changes in the burial accessories, the Horserider Theory, which insists that the Northern Eurasian nomads conquered Japanese agricultural people and established the \"Yamato Court\", was widely advocated.\nIt is true that the tombs of \"square-front, round-posterior\" (, zenpō-kōen-fun, circular‐shaped ancient tomb with rectangular frontage), which are thought to be originated in Yamato have been found in the Korean peninsula before the fifth century, but there are little evidences that cavalry technology, armors and tools were rapidly entered as influx to Japan and transformed the regime as insisted in the theory by Namio Egami.  In the meantime, the types of tombs for chiefs and kings have remained unchanged in Japan since the third century, with the construction of a continuous series of zenpō-kōen-fun, and there is a strong continuity between the early and middle burial mounds, rather than the discontinuity that Egami pointed out. This theory is less supported in comparizon with the former.\nThe most striking tendency of the mid-period kofun (tumuli) is their gigantic in size. Especially in the first half of the fifth century, in the Kawachi Plain (southern part of the Osaka Plain), there were the  (mound 420 meters long, traditionally, Tomb of Emperor Ōjin) and the Daisen Kofun (mound 525 meters long, traditionally, Tomb of Emperor Nintoku), both of which are world largest tombs, comparable with Mausoleum of the First Qin Emperor, which well shows the magnitude of the power and authority of the Yamato kingship. This also means that the center of the Yamato kingship was shifted from the Nara Basin to the Kawachi Plain, but Taichirō Shiraishi, who focuses on water systems, says that the Yamato-Yanagimoto Kofun Cluster (southeastern Nara Basin), the Saki-tachinami Kofun Cluster (northern Nara Basin), the Umami Kofun Cluster (southwestern Nara Basin), and the Furuichi Kofun Cluster (in the Kawachi Plain), and Mozu Kofun Cluster (in the Kawachi Plain) in the fourth to sixth centuries are distributed exclusively in the Yamato River basin. This indicates that the large tombs of the Kinai ruling class moved within this water system throughout the Kofun period, indicating the movement of alliances within the Yamato kingship. 。Mitsusada Inoue also once pointed out that the Kawachi kings were connected to the earlier Yamato royal family in the form of a groom. 、At the very least, it suggests that they had established an authority that could not be easily supplanted by others.\nOn the other hand, there is a theory that assumes a change of dynasties, or \"dynastic change theory,\" based on the fact that in the fourth century, huge burial mounds were concentrated in the vicinity of Mt. Miwa in the Nara Basin, while in the fifth century, large burial mounds were notably created in Kawachi. In other words, based on the archaeological findings of the distribution of burial mounds and the emperors' Japanese style posthumous names appeared in the Kojiki and the Nihon Shpoki, the dynasty of the fourth century (early Kofun period) is called the Miwa dynasty (\"Iri\" dynasty, or Sujin dynasty), while the power in Kawachi in the fifth century (middle Kofun period) is called the Kawachi dynasty (\"Wake\" dynasty, or Ōjin dynasty or Nintoku dynasty). This theory was developed by Yu Mizuno. This theory was advocated by Yu Mizuno, and developed into the Ōjin new dynasty theory by Mitsusada Inoue and the Kawachi dynasty theory by Masaaki Ueda, which was taken over by Kōjirō Naoki and Seiji Okada. However, this theory of dynastic alternation has been criticized from a number of perspectives. A typical example is the \"regional state\" theory. In addition, from the late fourth century to the fifth century, the Yamato and Kawachi powers were united, and the two were in a coalition relationship that could be called the \"Yamato-Kawachi United Kingdom. 。Taichiro Shiraishi, who emphasizes the movement between Yamato River basins, takes a similar view.\nIn the first half of the fifth century, large anterior-posterior mounds were also created in places other than Yamato, such as Hyūga, Tsukushi, Kibi, Kono, and Tango. Among them, the Zozan burial mound (360 meters long) in Okayama City is the fourth largest burial mound in Japan in terms of mound length, suggesting that the powerful Kibi clan, which later became the Kibi clan, had great power and used iron tools, and played an important role in the union of the Yamato regime. This suggests that the powerful clans of each region, while subordinate to the Yamato kingship, also developed their own power in their own areas.\nThe \"regional state theory\" mentioned above is the idea that in the first half of the fifth century, there were regional states of considerable scale in various regions, such as Kibi, Tsukushi, Kono, and Izumo. As one of such states, there was naturally a regional state \"Yamato\" in the Kinai region, which stood side by side or in a coalition, and that a unified state was born from the competition. Researchers such as Kenichi Sasaki have argued in favor of such a theory. However, there is no proof of the existence of political, tax collection, military, or judicial institutions that would be expected of a state in such a region, and some argue that it is a leap of logic to advocate the theory of regional states based on giant ancient tombs alone.\nThe beginning of the fifth century was also the time of the first wave of the toraijin (immigrants from the continent or Korean peninsula - naturalized people), and the Nihon Shoki and Kojiki tell us that Wani, Achi no omi, and Yuzuki no kimi (the ancestors of Yamato no Aya clan () and Hata clan () were naturalized in the age of the Ōjin dynasty. The use of Sue ware began around this time, and is thought to have been a technique brought by the toraijin.\nIn the fifth century, the country of Japan again appeared in the Chinese history books. It is believed that the technology was brought to Japan by the toraijin. The five kings of Wa, that is, San (), Chin (), Sei (), Kō (), and Bu (), sent envoys to the Southern dynasties of China, bringing tributes to the emperors, thus they became vassals of the emperors and were given the titles and ranks. The international order in East Asia with the Chinese emperor at the top is called the Saku-hō system (, Sakuhō taisei, in Japanese). It is believed that the purpose of this was to gain an advantage in acquiring concessions in the southern countries of the Korean peninsula (Mimana and Kara), and in fact, Sei and Bu were granted control of the southern part of the Korean peninsula.\nThe kings of Wa entered the Saku-hō system to make the Southern dynasties of China to acknowledge their mastery power in the Korean peninsula. Thus, Chin was awarded the title \"King of Wa, General of Anton\" in 438. Sei was also granted the same title in 443, and in addition he was awarded the title \"Governor and General of Six Provinces\" in 451. Kō was granted the title \"King of Wa, General of Anton\"  in 462.   It is noteworthy that Chin and Sei asked the Chinese emperor for the title of \"vassal\" to their own subjects. This is thought to have been a way for the tribute to help establishing order within the Yamato government.\nGovernment of Wakatakeru (Late Middle Kofun Period)\nIn 475, the capital of Baekje, Hanseong, fell to a large army of Goguryeo, King Gaero and many other members of the royal family were killed, and Baekje moved the capital to Ungjin in the south. Due to these situations in the Korean peninsula, many peoples who were called Imaki no Ayahito (), mainly Baekje origin, came to Japan. The era of Emperor Yūryaku, from the late fifth to the sixth century, was also the time of the second wave of immigrants. Emperor Yūryaku was identified as King Bu, one of the five kings of Wa mentioned above.\nIn the \"Jōhyōbun (diplomatic message, ) by King Bu of Wa\" dated 478, which was cited in the \"History of Wakoku\" in the Book of Song, states that the kingship of Wa (that is, ancestors of King Bu) conquered many countries in the east (, Emishi), the west (, Shūi) and the north (, Kaihoku). It suggests that kingship of Wa expanded its own power to subjugate local tribes. Since   is thought to refer to the Korean peninsula, this message is also considered to be related to the second wave of immigrants to Japan.\nAn iron sword (Inariyama Sword) unearthed from the Inariyama Kofun in Saitama Prefecture, which is thought to date from this period, has an inscription dated to the year of Shingai ( (471). The name \"Wakatakeru Daiō\" appears on it. This name is consistent with the real name of Emperor Yūryaku as reported in the Nihonshoki and Kojiki, and this name is also found in the inscription on an iron sword unearthed from the Eta Funayama Kofun in Kumamoto Prefecture. The fact that the name \"Wakatakeru\" is found in the kofun located both in the eastern provinces and Kyūshū is consistent with the description of the conquest achievements in the above-mentioned \"Jōhyōbun by King Bu of Wa\".\nIt is known that in the iron sword inscriptions unearthed from the Inariyama kofun, a powerful clan from the eastern part of Japan served the palace of the \"Daiō\" as a chief of the bodyguards (, jōtōjin no kashira), and that in the iron sword inscriptions unearthed from the Eda Funayama kofun, a powerful clan from the western part of Japan served as a civil officer of the Ōkimi's entourage (, tensō-jin), thus we may know they played a part in the royal power. Similar examples appeared in the \"Record of Yūryaku\" in the Nihon Shoki, the relationship of service between the Yamato kingship and the power of the countryside during this period is known as \"Nin-Sei (, ja)\", a kind of very proto-bureaucracy.\nIn addition, the inscriptions also include the phrases \"\" (Eta Funayama Kofun) and \"\" (), indicating the emergence of a concept of \"\" centered on the Ōkimi of Japan, separate from the Tianxia (whole World) centered on the Song Emperor. This tells us that an order was being formed under the Okimi with a certain degree of independence from Chinese authority.\nThe above-mentioned \"Imarai Han people\" were organized into groups of technicians (hina-bu), such as the pottery-making, brocade-making, saddle-making, and painting divisions, and entrusted to the Shinabe clan for management. Many of the people who used Chinese characters to record various aspects of the Yamato kingdom, to receive and dispatch goods, and to write diplomatic documents were also called Fuhitobe, and they were responsible for the organization of the Yamato kingdom. It is thought that the organization of these visitors led to the gradual creation of a bureaucratic organization consisting of the , the administrator, and the Bemin under his control.\nOn the other hand, an examination of the distribution of kofun tombs in the second half of the fifth century (the second half of the middle Kofun period) shows that during this period, the construction of large anterior and posterior round tombs ceased in Chikushi, Kibi, Kono, Hyuga, Tango, and other areas where large kofun tombs were constructed in the first half of the middle Kofun period, and only the kings of the Yamato regime continued to construct large anterior and posterior round tombs with mound lengths exceeding 200 meters. Only the kings of the Yamato regime continued to construct large anterior and posterior circle tombs with mound lengths of over 200 meters. It can be pointed out from the viewpoint of archaeological materials that the authority of the Okimi, the king of the Yamato regime, was significantly extended during this period, and the character of the Yamato regime was greatly changed.\nKunio Hirano, in his article on the  in the 1988 edition of the Heibonsha World Encyclopedia, advocates the concept of a \"dynasty\" as \"a stage in which a political organization with a certain number of vassals centered on the royal authority was formed,\" and expresses the view that the \"Yamato Court\" was established at the time of Wakatakeru.\nDynastic Turmoil and Transformation\nEstablishment of the Keitai and Kinmei dynasties (first half of the Late Kofun period)\nAfter the death of Wakatakeru, from the latter half of the fifth century to the end of the fifth century, the construction of giant  began to decline, and they generally became smaller. These trends indicate that the authority of the large local chiefs who had built the giant tombs was relatively declining, and that the small and medium-sized chiefs were gaining power. There is a view that Wakatake's plan to strengthen the royal authority was successful, but at the same time led to a backlash from the old powers, and as a result, the royal authority was temporarily weakened. 。\nAs to the relationship between the local chiefs and the Yamato kingship from the late fifth century onward, as the inscriptions on the Inariyama iron sword and the Eda Funayama sword, as well as their archaeological interpretations, suggest, it is thought that the relationship was not direct linkage, but rather indirect one, that the bond was based on a strong relationship between the local chiefs and the dominant clans in the Kinai region, such as the Ōtomo clan, Mononobe clan, and Abe clan, and other clans, which made up the Yamato kingship. 。The king came to hold tyrannical power as \"Okimi,\" and at the same time, the ties between Ōkimi and the chiefs of the various regions seem to have diminished. The position of Ōkimi itself gradually transformed into an organ of the Kinai confederation of powerful clans. 。From the end of the fifth century to the beginning of the 6th century, the Chronicles of Japan (Nihon Shoki) mentions that the four Ōkimi, that is, Emperor Seinei, Emperor Kenzō, Emperor Ninken, and Emperor Buretsu appeared one after another in a short period of time, suggesting that the royal line itself was severely shaken. There is also a theory (dynastic alternation theory) that the subsequent accession of King Wohodo (, ie., Emperor Keitai) is regarded as a break in the royal line or a change of dynasty.\nAgainst the backdrop of these royal upheavals, communication with the Chinese dynasties was also cut off during this period. The Yamato Kingship also had an economic and political base in the southern part of the Korean peninsula based on friendly relations with Baekje, but with the retreat of Baekje's power, the position of the Yamato Kingship in the peninsula also declined relatively. As a result, the import of iron resources decreased and the agricultural development in the Wa stagnated, and so there is also a view that the political and economic centripetal force of the kingship and its affiliated clans declined. In the sixth century, both Baekje and Silla, which had been oppressed by Goguryeo, established political systems and regained power, and began to expand into the Gaya region.\nAgainst this backdrop, in the early sixth century, Ōkimi Wohodo (Emperor Keitai) emerged from the Ōmi to the Hokuriku with a background of chieftains, and was received by Yamato to unify the royal line. However, it took 20 years for Wohodo to enter the Nara Basin, which indicates that the establishment of this royal power was not always smooth. In 527, during the reign of Ōkimi Wohodo, the Tsukushi no Kimi Iwai (), a powerful family from Northern Kyūshu, collaborated with the Shilla and came into military conflict with the Yamato kingship (Iwai Rebellion). Although the rebellion was quickly suppressed, it led to a decline in royal expansion into the southern part of the Korean Peninsula, and the Korean policy of Ōtomo no Kanamura failed, rapidly shaking the influence of Wa on the Korean Peninsula. After the death of Emperor Keitai, from 531 to 539, there was a possible division of royal power, and some believe that the kingship of Ankan and Senka conflicted with that of Kinmei (The civil war of the Keitai and Kinmei dynasties). On the other hand, there is the dominant view that, after the appearance of Ōkimi Wohodo, the integration of the entire regions from the Tōhoku region to the southern part of Kyūshu region progressed rapidly, and especially after the Iwai Rebellion, an area under direct jurisdiction, called  (), was settled in various regions, and the political unification progressed domestically. By the way, in 540, Ōtomo no Kanamura who had supported Ōkimi Wohodo lost his position.\nFrom the Yamato State to the Ritsuryo System (Late Kofun Period)\nIn the first half of the sixth century, the Yamato Kingship was reluctant to deal with external affairs, partly because iron manufacturing methods using iron sand were developed and self-sufficiency in iron became possible. In 562, the countries in Gaya  came under the control of both Baekje and Silla, and the Yamato Kingship lost its power base in the Korean Peninsula. On the other hand, the Yamato Kingship strengthened its internal administration by gradually introducing things Chinese such as calendars from the peninsula, as well as affiliating and organizing its powerful clans and people. Within the Yamato kingship, there was a series of conflicts over the leadership of the central powerful clans in the government, as well as over the acquisition of tadokoro (, ja) and bemin (, ja). After the downfall of the Ōtomo clan, Soga no Iname and Mononobe no Okoshi confronted each other over whether to revere or reject Buddhism. In the next genenation of them, ōomi Soga no Umako and ōmuraji Mononobe no Moriya finally led to an armed struggle (Soga-Mononobe conflict).\nSoga no Umako, who won the Soga-Mononobe conflict, installed Prince Hatsusebe as an Okimi (Emperor Sushun), but the two gradually came into conflict, and Umako finally killed the Okimi. He then enthroned his niece, Princess Nukkatabe, as Empress Suiko, and together with Umayado no ōkimi (, Prince Umayado, ie., Prince Shōtoku), they built a strong political foundation, establishing the Twelve Level Cap and Rank System and the Seventeen-article constitution. Thus they positively proceeded the strengthening and reform of the power of Ōkimi based on the above-mentioned establishment of the bureaucracy.\nBuddhism, which was introduced to Japan in the middle of the sixth century, was emphasized as an Ideology to support governance and rule, and historical books such as Tennōki and Kokki were compiled as well. After this, the political forms and systems based on the clan system were gradually dissolved, and the Yamato State phase came to an end, and the ancient Ritsuryo State was formed.\nTo \"Japan\"\nIn the mid-7th century, when the Tang dynasty began to invade Goguryeo, the need for centralized power in Yamato increased, and the Taika-no-Kaishin took place at Naniwa Palace. Emperor Tenmu, who won the right of succession to the great throne in the Jinshin War, began to build the Fujiwara-kyō and moved the capital from Asuka, Yamato in the reign of Emperor Empress Jitō. Asuka period, Yamato period. With the completion of the Taihō Code in 701, the Yamato Kingdom began to use \"Japan\" as its national name (initially written as \"Japan\" and pronounced \"Yamato\"), and formally designated the new sovereign as \"Emperor\" to replace the Okimi.\nRelated Shrines\n* Ise Grand Shrine:\n** A shrine whose main deity is the Amaterasu, the ancestral deity of the Imperial Family. Taruhito's fourth daughter, Watahime-no-mikoto, traveled eastward through Yamato, Omi, and Mino in search of a land to worship Amaterasu, and then oracle to establish a shrine in Ise where the Great God resides, which is said to be the origin of this shrine.\n* Ōmiwa Shrine:\n** This shrine is located in the southeastern part of the Nara Basin, which is believed to be the birthplace of the Yamato Imperial Court. It is the Ujigami of the Miwa clan, who were the first inhabitants of the area before the Jimmu's Eastern Expedition. The main deity is Omononushi-Ōkami, and Mount Miwa is the Sacred mountains. The origin of this shrine is said to be that Omikijin made the god of Omiwa, his Mitama, a happy soul and strange spirit, to live in a palace on Mount Miwa in Japan. Even today, the shrine does not have a main hall, but retains the form of Ko-Shintō (primitive Shintoism) in which the deity is worshipped from the Prayer hall. The Suwa-taisha, which does not have the mountain as its deity but does not have a main shrine like the Okami Shrine, was dedicated by the Suwa clan, who were members of the same clan as the Miwa clan\n* Atsuta Shrine:\n** The main deity is Atsuta no Okami, who is the deity of one of the three Imperial Regalia of Japan, Kusanagi no Tsurugi. After his expedition to the east, Yamato Takeru is said to have married Miyazu-hime, the daughter of the Owari provincial governor, and to have collapsed at Nokono-no.\n* Isonokami Shrine:\n** The Ujigami of the Mononobe clan, a powerful clan that has served Emperor Jinmu since his time. It was founded during the reign of Emperor Sujin. It is said that when Taruhito asked the brothers Emperor Keiko what each of them wanted, the older brother wanted a bow and arrow and the younger brother wanted the throne, and when Emperor Keikō made 1,000 swords and stored them at the Ishigami Shrine, they came to be revered as guardian deities.\nSee also\n* Emishi\n* Protohistory\n* Wago\nAnnotations\nFootnotes\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}