{
  "content": [
    {
      "type": "text",
      "text": "# Yan Kingdom (Han dynasty)\n\nYan () was a kingdom/principality in early Imperial China. It first appeared during the interregnum between the Qin and Han dynasties as one of the Eighteen Kingdoms created by Xiang Yu, and was subsequently dissolved and recreated multiple times, mainly during the Han dynasty. It was eventually dissolved in the War of the Eight Princes during the Jin dynasty.\nHistory\nThe first Prince of Yan was Zang Tu, a national of the former Yan state in the Warring States period who served under Xiang Yu during the rebellion against the Qin dynasty. In 202 BC, Zang swore fealty to Liu Bang, the founder of Han dynasty. Later that year, Zang rebelled against Han, and was captured and executed. Yan was subsequently granted to Lu Wan, a trusted general and early follower of the emperor.\nIn 195 BC, Lu defected to Xiongnu, and the land was granted to Liu Jian (劉建), the eighth son of Liu Bang. He died In 182 BC, and his only heir was killed by Empress Dowager Lü. Afterwards, the principality passed to Lü Tong, the grandson of a brother of the empress dowager. Lü Tong was killed in the campaign to eliminate the Lü Clan only one year later. In 180 BC, Liu Ze (劉澤), a former Prince of Langya, was granted the Principality of Yan.\nYan's territory and autonomy were much reduced during Emperor Jing of Han's reign. The Yan territories in early Han dynasty consisted of six Qin-era commanderies, including Shanggu, Yuyang, Youbeiping, Liaoxi, Liaodong and Guangyang. Five of them were revoked around 155 BC, and the remaining territory was equivalent to the Guangyang Commandery of Qin dynasty.\nThe kingdom passed to his grandson Liu Dingguo (定國), Dingguo practiced incest with his own daughters as well as concubines of his father and brother, and committed suicide after the act was exposed in 128 BC. After his death, the territory was taken over by the imperial central government and administered as a commandery.\nIn 117 BC, the principality was recreated and granted to Liu Dan, a son of Emperor Wu. He committed suicide in 80 AD after two failed attempts of rebellion. Afterwards, the territories was reorganized into Guangyang Commandery.\nIn Cao Wei, Guangyang Commandery again became the fief of Princes of Yan. The title was first granted to Cao Yu in 232 AD. After the Jin dynasty was established, the principality was granted to Sima Ji (司馬機), and Yuyang Commandery was added to its territory. The principality was dissolved after the War of the Eight Princes.\nList of rulers\n*Zang Tu (臧荼), 206 BC – 202 BC;\n*Lu Wan (盧綰), 202 BC – 195 BC;\n*Liu Jian (劉建), King Ling (靈) of Yan, 195 BC – 182 BC;\n*Lü Tong (呂通), 181 BC – 180 BC;\n*Liu Ze (劉澤), King Jing (敬) of Yan, 180 BC – 179 BC;\n*Liu Jia (劉嘉), King Jia (嘉) of Yan, 179 BC – 170 BC;\n*Liu Dingguo (劉定國), 170 BC – 128 BC;\n*Liu Dan (劉旦), King La (剌) of Yan, 117 BC – 79 BC;\n*Cao Yu (曹宇), 232 – 265;\n*Sima Ji (司馬機), 266 – ?\n*Name unknown, ? – ?.\nSee also\n* History of Beijing\n* Jicheng (Beijing)\nReferences"
    }
  ]
}