{
  "content": [
    {
      "type": "text",
      "text": "# Yanagiwara family\n\n}}\nThe Yanagiwara family (柳原家, Yanagiwara-ke) is a Japanese aristocratic family descending from the Fujiwara clan's Hokke house. Its kuge family rank was meike. After the Meiji Restoration, the family was appointed Count.\nOrigins\n, ancestor of the Yanagiwara family]]\nThe Yanagiwara family descends from the Fujiwara clan's Hokke house through Fujiwara no Manatsu, the elder brother of Fujiwara no Fuyutsugu. Through Manatsu, they descend from the Hino family lineage. The family was founded in the late Kamakura period by Yanagiwara Sukeakira, the fourth son of Gon-Dainagon Hino Toshimitsu.  Sukeakira took the name Yanagiwara from the Yanagiwara Mansion that he lived in.\nHistory\nYanagiwara Sukeakira was the younger brother of Hino Suketomo, and because his eldest brother Hino Sukena was Emperor Kōgon's favorite, he served the Northern Court building up his power. He later moved to live at the Yanagiwara Mansion taking his family name from its name.\nThe descendants of Sukeakira began writing, and this became the family business. Members of the family excelled in kidendō (the academic study of poetry) and were appointed bunshō-hakase (kidendō teachers). However, the hereditary succession of this position died out in 1471, Yanagiwara Kazumitsu being the last family member appointed bunshō-hakase.\n]]\nAfter the Meiji Restoration, the family was appointed to the kazoku (hereditary peerage) with the title of Count. Count Yanagiwara Sakimitsu's sister, Yanagiwara Naruko, became a concubine of Emperor Meiji in 1873, and subsequently, the mother of Emperor Taishō. Sakimitsu's daughter, Byakuren Yanagiwara, was a poet and novelist who rose to prominence in 1921 following the Byakuren incident.\nThe family has branches such as Mushanokōji and Machijiri.\nClan heads\n# Yanagiwara Sukeakira (1297–1353)\n# Yanagiwara Tadamitsu (1334–1379)\n# Yanagiwara Sukehira (1363–1404)\n# Yanagiwara Yukimitsu (1393–1443)\n# Yanagiwara Suketsuna (1417–1500)\n# Yanagiwara Kazumitsu (1448–1510)\n# Yanagiwara Sukesada (1495–1578)\n# Yanagiwara Atsumitsu (1541–1597) (son of Machi Sukemasa)\n# Yanagiwara Sukeatsu (1580–1596)\n# Yanagiwara Suketoshi (1584–1602)\n# Yanagiwara Shigemitsu (1595–1654)\n# Yanagiwara Sukeyuki (1621–1679)\n# Yanagiwara Sukekado (1644–1712)\n# Yanagiwara Hidemitsu (1664–1683)\n# Yanagiwara Sukemoto (1685–1705)\n# Yanagiwara Suketaka (1692–1716)\n# Yanagiwara Mitsutsuna (1711–1760) (son of Reizei Tametsuna)\n# Yanagiwara Motomitsu (1746–1800)\n# Yanagiwara Tadamitsu (1772–1812)\n# Yanagiwara Takamitsu (1793–1851)\n# Yanagiwara Mitsunaru (1818–1885)\n# Yanagiwara Sakimitsu (1850–1894)\n# Yanagiwara Yoshimitsu (1874–1946)\n# Yanagiwara Hiromitsu (1889–1966) (son of Ōhara Shigetomo)\n# Yanagiwara Ukemitsu (1916–2011)\n# Yanagiwara Yorimitsu (1940–2007)\n# Yanagiwara Yūjirō (1967-)\nSee also\n* Fujiwara clan\n* Byakuren Yanagiwara\n* Yanagiwara Naruko\nReferences"
    }
  ]
}