{
  "content": [
    {
      "type": "text",
      "text": "# Yandina Creek, Queensland\n\n| pop                 = 872\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4561\n| area                = 26.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.9\n| dir1                = WNW\n| location1           = Coolum Beach\n| dist2               = 24.2\n| dir2                = NE\n| location2           = Nambour\n| dist3               = 41.5\n| dir3                = N\n| location3           = Caloundra\n| dist4               = 123\n| dir4                = N\n| location4           = Brisbane\n| lga                 = Sunshine Coast Region\n| stategov            = Ninderry\n| fedgov              = Fairfax\n| near-n              = Verrierdale\n| near-ne             = Verrierdale\n| near-e              = Coolum Beach\n| near-se             = Coolum Beach\n| near-s              = Maroochy River\n| near-sw             = Maroochy River\n| near-w              = Valdora\n| near-nw             = North Arm\n}}\nYandina Creek is a rural locality in the Sunshine Coast Region, Queensland, Australia. In the , Yandina Creek had a population of 872 people.\nGeography\nYandina Creek is in the Sunshine Coast hinterland. The Yandina-Coolum Road runs along the western boundary before crossing to the east.\nHistory\nThe name Yandina comes from Indigenous words yan meaning to go and dinna meaning feet.\nYandina Creek Provisional School opened on 16 June 1914.  On 1 May 1917, it became Yandina Creek State School. It closed on 30 September 1920. On 9 May 1932, the school reopened and then closed in December 1941. In 1949, the school building from the former Valdora State School was relocated to Yandina Creek and re-opened on 1 February 1949 as Yandina Creek State School. It closed on 7 August 1964. The school was at 931 North Arm Yandina Creek Road ().\nOn 4 January 2004, Coolum Beach Christian College was established by the Coolum Christian Family Church with 35 primary school children. In 2007, it expanded to offer secondary education.\nDemographics\nIn the , Yandina Creek had a population of 760 people.\nIn the , Yandina Creek had a population of 872 people.\nEducation\nCoolum Beach Christian College is a private primary and secondary (Prep-12) school for boys and girls at 2 Arcoona Road (). In 2017, the school had an enrolment of 295 students with 23 teachers (20 full-time equivalent) and 23 non-teaching staff (13 full-time equivalent). In 2018, the school had an enrolment of 356 students with 28 teachers (25 full-time equivalent) and 24 non-teaching staff (15 full-time equivalent).\nThe nearest government primary schools are in Coolum Beach and North Arm. The nearest government secondary schools are in Coolum Beach and Nambour.\nReferences\nFurther reading\n*\n*\nExternal links\n*"
    }
  ]
}