{
  "content": [
    {
      "type": "text",
      "text": "# Yankton Treaty\n\n]]\nThe Yankton Treaty was a treaty signed in 1858 between the United States Government and the Yankton Sioux Tribe (Western Dakota), that ceded most of eastern South Dakota (11 million acres) to the U.S. Government. The treaty was signed in April 1858, and ratified by the United States Congress on February 16, 1859.\nBackground\nThe 1851 Treaty of Traverse des Sioux, which ceded vast tracts of Sioux land to the U.S. government, was signed only by representatives of the Sisseton and Mdewakanton bands. The Yankton and Yanktonai tribes were not consulted.  Governor  Ramsey used the  Nicollet map of the Upper Mississippi River basin from 1840 to draw the boundaries. He saw the Big Sioux  River as a geographic feature separating the Sisseton and Yankton and Yanktonai tribes. Chief Waanata 1 of the Yanktonai claimed from  Granite Falls to the Missouri River. Chief Struck-by-the-Ree of the Yankton claimed the land into Minnesota to the Jeffers Petroglyphs.  The Yankton made their objections known.  The Government realized the Yankton claim was so strong that the Yankton treaty was drawn up.  As the Government felt it did not have free and clear title to the land for the statehood of Minnesota.  Paragraph 1 of the 1858 Yankton treaty addresses these claims immediately.  However, Struck-by-the-Ree would not sign without a provision for the  Pipestone quarry.  Article 8 was added giving the Yankton a one mile square  Reservation at Pipestone.  Struck-by-the-Ree signed and one month later Minnesota gained statehood.  The Yanktonai being more remote failed to have their objections considered.  The 1858 treaty immediately opened this territory up for settlement, resulting in the establishment of an unofficial local government not recognized by Washington. The treaty also created the primary 430,000 acre Yankton Sioux Reservation, now located in Charles Mix County in South Dakota.\nNegotiations\nSmutty Bear (Ma-to-sa-be-che-a), a Yankton chief, was opposed the treaty because he felt it would only bring further white intrusions as they pushed to settle the open prairie with no obvious impediments. Strike-the-Ree (Pa-le-ne-a-pa-pe, also known as \"The Man that Struck the Ree\"), the elder Yankton Sioux chief, also felt that too many whites were settling there, but decided that opposing them was futile, and he signed the treaty. Charles F. Picotte, speculator, entrepreneur, and translator was compensated with a 640-acre land grant in the newly incorporated territory.  That parcel later became a major portion of the city of Yankton, South Dakota.\nTerms\nThe terms of the treaty can be summarized as follows:\nDate and Parties\nThe treaty was signed on April 19, 1858, in Washington, D.C., by Charles E. Mix, representing the United States government, and various chiefs and delegates of the Yankton tribe of Sioux or Dacotah Indians.\nArticle 1 - Lands Ceded\nThe Yankton tribe ceded and relinquished all their lands except for 400,000 acres, which were specified in detail. They also abandoned all claims and complaints related to previous treaties, including those negotiated by other Indians, except for their annuity rights under the Treaty of Laramie of September 17, 1851.\nArticle 2 - Boundaries of Ceded Land\nThe ceded land was described by specific geographic boundaries, including the Missouri River, various rivers, lakes, and other natural features.\nArticle 3 - Reservation and Roads\nThe United States was granted permission to construct roads across the Yankton reservation with consent from the Secretary of the Interior. The Yankton tribe agreed to settle on the reservation within a year, and until then, they were guaranteed undisturbed possession of their current settlements.\nArticle 4 - Agreements by the United States\nThe U.S. agreed to protect the Yankton tribe on their reserved land and pay annuities totaling $1,600,000 over 50 years, with varying amounts for different periods. Additional funds were allocated for subsistence, schools, and other improvements.\nArticle 5 - Mills, Mechanic Shops, and Property\nThe U.S. agreed to provide mills, mechanic shops, and dwelling houses for the benefit of the Yankton tribe. The Yankton tribe pledged not to damage or destroy these properties, and upon meeting certain conditions, they would gain ownership of the houses and property.\nArticle 6 - Payment of Debts\nThe Yankton chiefs could authorize the payment of up to $150,000 from their annuities to settle debts, subject to approval by the agent and Secretary of the Interior.\nArticle 7 - Land Grants and Entry for Non-Indians\nCertain individuals, including Charles F. Picotte and Zephyr Rencontre, were granted land. Non-Indians residing in the ceded territory could purchase land at a specified rate.\nArticle 8 - Use of Pipestone Quarry\nThe Yankton tribe was guaranteed access to the red pipestone quarry, with the U.S. responsible for surveying and marking the area.\nArticle 9 - Military Posts and Indian Agencies\nThe U.S. had the right to establish military posts, roads, and Indian agencies within the Yankton reservation, with compensation provided for any property taken.\nArticle 10 - Restrictions on Trade and Land Alienation\nOnly licensed individuals could trade with the Yankton tribe, and non-Indians were prohibited from residing or making settlements on the reservation. Land could only be alienated to the U.S., and the Secretary of the Interior would determine land divisions among the tribe.\nArticle 11 - Friendly Relations and Surrender of Offenders\nThe Yankton tribe pledged to maintain friendly relations with the United States and other tribes, surrender offenders, and submit disputes to the President of the United States.\nArticle 12 - Punishment for Intemperance\nAnnuitants who engaged in or provided intoxicating liquor would have their annuities withheld for at least a year.\nArticle 13 - Protection of Annuities from Debts\nAnnuities could not be used to pay debts except as stipulated in the agreement or under U.S. trade and intercourse laws.\nArticle 14 - Release of Demands\nThe Yankton tribe released the United States from all demands except those specified in the treaty.\nArticle 15 - Appointment of Indian Agent\nThe U.S. agreed to appoint an agent to reside on the Yankton reservation, with land allocated for their use.\nArticle 16 - Expenses\nThe United States would bear all expenses related to the treaty, including surveying the reservation and pipestone quarry.\nArticle 17 - Effective Date\nThe treaty would take effect upon ratification by the Senate and the President of the United States.\nAftermath\nIn 1863 when Congress annulled the treaties of the eastern Dakota tribes and confiscated their Reservations, the Yankton were not included. The Yankton Reservation at Pipestone remained untouched.\nSee also\n* Treaty of Mendota\n* Treaty of Traverse des Sioux\nReferences"
    }
  ]
}