{
  "content": [
    {
      "type": "text",
      "text": "# Yediyur Siddhalingeshwara Swamy Temple\n\nYediyuru Siddhalingeshwara Temple is  a pilgrimage centre situated in Yedeyuru Village, Kunigal Town of the Indian state of Karnataka State.\nIt contains Nirvikalpa Shivayoga Samadhi of Tontada Siddalinga, a revered Lingayata Saint who flourished late in the 15th century.\nThe temple holds annual festivals during Maha Shivaratri and Ugadi.\nOn the 7th day of the Hindu calendar (Ugadi) Chaitra bahula saptami, jathre is performed to mark the attainment of the Samadhi of Sri Siddhalingeshwara. Every year on Maha Shivarathri, Sahasra Rudrabhisheka is performed. The Sahasra Kamala Pooja, Laksha Bilvarchane pooja is performed in the month of Shravana and Kumbhabhisheka is performed on each new moon day. During the annual festival of Deepavali (festival of lights) Laksha Deepotsava is performed by illuminating the temple with oil lamps as per Hindu tradition. The temple has a large wooden chariot (ratha). The festival is held on the 7th lunar day of the bright fortnight of Chaitra Masa (March–April).\nSri Siddalingeshwara Swamy a great revered Sharana Saint in the path of Lingayatha Shiva Sharana Parampare of diffusion of Thatva of Life called VACHANAS. He travelled far and wide preaching Sharana faith which is predominantly praying with ISHTA LINGA (atma linga) as envisaged by Basavanna, Allamaprabhu and a vast group of learned men and women from all walks of life (12th century in present-day Bijapur district).\nHe performed 12 years of penance at a garden belongs to Vokkaligara Nambiyana (Thota) and hence came to be known as Thontada Siddalingeshwara Swamy. He headed the Murugi Mutha and had a large following of disciples some of who wrote on Lingayat faith and philosophy. Hence Yedeyuru is deemed to be a seat of awakened spiritual consciousness.\nHe wrote Shathsthala Jnana Saramrutha, containing 701 Vachanas (Poems) which are directing Sthalas (route) to Attain Ikya, i.e., involvement to light.\nHe travelled far and wide, preached eternal truth and performed many miracles for scores of people irrespective of their caste or creed. His life and values held by him demonstrated the divine powers attained by him to heal the sick and suffering.\nHe is regarded as one of the greatest Saints of the Sharana Sect in the Lingayat religion.\nThe temple contact number is 08132228224\nSources\n* Yediyur Temples :[http://yedeyursiddalingeshwara.com/ Yediyur Temples]\n* Kunigal Town Government Municipal Council http://kunigaltown.gov.in/Tourism\n* Karnataka Tourist Paradise ( A handbook of Karnataka ) gazetteer.kar.nic.in/data/gazetteer/postind/Kar_Handbook_2005_Chapter14.Pdf -\n* South India Handbook, The Travel Guide books.google.co.in/books?..."
    }
  ]
}