{
  "content": [
    {
      "type": "text",
      "text": "# Yeke Kingdom__disambig_1\n\n}.svg\" (size 30) --->\n| image_p1               =\n| s1                     = Congo Free State\n| flag_s1                = Flag of the Congo Free State.svg|\n| image_map              = Msiri's kingdom in 1880 760x460 lo-res.jpg\n| image_map_caption      = South-central Africa in 1880 showing the central position of Msiri’s Kingdom and the principal trade routes, with the approximate territories of Msiri’s main allies (names in yellow) and the European powers (names in orange) before borders were settled by the Berlin Conference. The east coast trade was controlled by the Sultan of Zanzibar. Areas of influence of other tribes and of France and Germany not shown|\n| capital                = Bunkeya\n| latd                   =\n| latm                   =\n| latNS                  =\n| longd                  =\n| longm                  =\n| longEW                 = |\n| national_motto         =\n| national_anthem        =\n| common_languages       =\n| religion               =\n| currency               = |\n| leader1                = Msiri\n| year_leader1           = 1856–1891\n| title_leader           = |\n| footnotes              =\n}}\nThe Yeke Kingdom (also called the Garanganze or Garenganze kingdom) of the Garanganze people in Katanga, DR Congo, was short-lived, existing from about 1856 to 1891 under one king, Msiri, but it became for a while the most powerful state in south-central Africa, controlling a territory of about half a million square kilometres. The Yeke Kingdom also controlled the only trade route across the continent from east to west, since the Kalahari Desert and Lozi Kingdom in the south and the Congo rainforest in the north blocked alternative routes. It achieved this control through natural resources and force of arms—Msiri traded Katanga's copper principally, but also slaves and ivory, for gunpowder and firearms—and by alliances through marriage. The most important alliances were with Portuguese–Angolans in the Benguela area, with Tippu Tip in the north and with Nyamwezi and Swahili traders in the east, and indirectly with the Sultan of Zanzibar who controlled the east coast traders.\nMsiri was in fact a Nyamwezi (also known as 'Yeke' or 'Bayeke') from Tabora in Tanzania who got himself appointed as successor to a Wasanga chief west of the Luapula River by defeating the chief's Lunda enemies. Once installed he conquered the neighbouring tribes and expanded the chieftainship into a kingdom.\nFrom its capital at Bunkeya, the Yeke Kingdom took over the western territory of Mwata Kazembe, stopped the southwards expansion of the Luba Empire and subjugated tribes in the southwest, on the trading route to Angola.\nWhen King Leopold II of Belgium was told that the Yeke Kingdom controlled east-west trade and was rich in copper and possibly gold, he sent expeditions to try to obtain a treaty for the kingdom to join his Congo Free State (CFS). Cecil Rhodes also sent expeditions to sign up the kingdom to his British South Africa Company's chartered territories. The 'scramble for Katanga' was won by Leopold's Stairs Expedition, which ended the kingdom by killing Msiri, and took over the territory for the CFS, but with its own administration until it was more closely incorporated into the Belgian Congo.\nCaptain Stairs, the expedition's leader, installed one of Msiri's adopted sons, Mukanda-Bantu, as his successor but of a vastly reduced area with a radius of only 20&nbsp;km from Bunkeya, and with the status of a chief. The chieftainship continues to this day under the title Mwata Msiri.\nSee also\n*Msiri\n*Stairs Expedition\n*Garanganze people\n*Katanga Province\n*Congo Free State\n*Luba Empire\n*Kazembe\nReferences"
    }
  ]
}