{
  "content": [
    {
      "type": "text",
      "text": "# Yellow-throated warbler__disambig_1\n\n| genus = Setophaga\n| species = dominica\n| authority = (Linnaeus, 1766)\n| synonyms =\n*Motacilla dominica Linnaeus, 1766\n*Dendroica dominica (Linnaeus, 1766)\n| range_map = Dendroica_dominica_map.svg\n| range_map_caption = Range of S. dominica\n}}\nThe yellow-throated warbler (Setophaga dominica) is a small migratory songbird species in the New World warbler family (Parulidae) found in temperate North America.\nTaxonomy\nThe yellow-throated warbler was formally described in 1766 by the Swedish naturalist Carl Linnaeus in the twelfth edition of his Systema Naturae under the binomial name Motacilla dominica. Linnaeus based his account on \"Le Figuier cendré de S. Dominigue\" that had been described and illustrated in 1760 by the French zoologist Mathurin Jacques Brisson in his multivolume Ornithology. Linnaeus specified the location as Jamaica and Dominica but this was restricted to Santo Domingo in the Dominican Republic by the American Ornithologists' Union in 1910. The yellow-throated warbler is now one of over 30 species placed in the genus Setophaga that was introduced by the English naturalist William Swainson in 1827. The genus name Setophaga combines the Ancient Greek σης/sēs, σητος/sētos meaning \"moth\" with -φαγος/-phagos meaning \"-eating\".\nThree subspecies are currently accepted:\n* S. d. albilora (Ridgway, 1873) – breeds in central east USA, west of the Appalachian Mountains\n* S. d. dominica (Linnaeus, 1766) – breeds in east, southeast USA, east of the Appalachian Mountains\n* S. d. stoddardi (Sutton, 1951) – breeds in northwest Florida and south Alabama (southeast USA), south of the Appalachian Mountains\n, Missouri; pure white supercilium]]\nThe differences between the subspecies are small, and some authors treat the species as monotypic. The most obvious variation is that S. d. dominica usually (but not always) has some yellow at the front end of the supercilium, while S. d. albilora always has an entirely white supercilium. The southern subspecies S. d. stoddardi has the same supercilium variation as S. d. dominica, but differs in a slightly slenderer bill, and is non-migratory rather than a short-distance migrant like the other two subspecies.\nA similar bird from the Bahamas was formerly treated as a fourth subspecies, but is now treated as a separate species, the Bahama warbler Setophaga flavescens. It was separated on the basis of having a longer bill, and in having extensive yellow down the entire underparts to the legs, versus white on the lower breast and belly in yellow-throated warbler.\nGrace's warbler S. graciae from the southern Rocky Mountains is also closely related and similar in appearance, but lacks the white patch on the neck side, being uniformly gray there.\nYellow-throated warblers will occasionally hybridize with northern parulas (Setophaga americana), resulting in a hybrid known as \"Sutton's warbler\". Sutton's warblers lack the black streaks bordering the breast indicative of yellow-throated warblers, and have a suffused greenish-yellow wash on their back, which is also not indicative of yellow-throated warblers.  The Sutton's warbler was first discovered in 1940 in West Virginia.\nDescription\n, New Jersey.]]\nThe yellow-throated warbler is  long, with a wingspan of , and weighs .\nIn summer, male yellow-throated warblers display gray upperparts and wings, with double white wing bars. Their throats are yellow, and the remainder of their underparts are white, and are streaked with black on the flanks. Their heads are strongly patterned in black and white, with a long supercilium. The remiges and rectrices are black.\nThe females, immatures and non-breeding males resemble washed-out versions of the summer males; in particular they have a less crisply defined strong head pattern. They also have less bright yellows, and dark gray feathers instead of black ones in the body plumage. Compared to many other New World warblers, sexual dimorphism is slight.\nThe males' songs are clear, descending whistles. The calls are high sees or sharp chips.\nDistribution and habitat\nThese birds breed in southeastern North America, and their breeding ranges extend from southern Pennsylvania and northern Missouri, to the Gulf of Mexico. One subspecies, from northwest Florida, is resident all year round. The other populations of this species are migratory, wintering at the Gulf Coast, eastern Central America, and the Caribbean. Vagrant wintering birds are sometimes seen in northernmost South America.\nIn the United States, its range differs from typical Setophaga warblers because they have a more expansive resident population in the South than other Setophaga warblers. Moreover, their breeding range is more southerly, and their wintering range more is northerly, than the other warblers in the genus. According to McKay et al., \"[t]he near absence of the species from the lower Piedmont of the Carolinas and Georgia ... presents a puzzle.\"\nThe yellow-throated warbler is a woodland species with a preference for coniferous or swamp tree species, in which it preferably nests.\nBehavior and ecology\nFood and feeding\nThey are insectivorous, but will include a considerable amount of berries and nectar in their diet outside the breeding season. Food is typically picked off tree branches directly, but flying insects may be caught in a brief hover.\nBreeding\nThese birds build cup-shaped nests which are built in trees, and are concealed amongst conifer needles or Spanish moss (Tillandsia usneoides). Their clutches consist of 3–5 (usually 4) eggs.\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}