{
  "content": [
    {
      "type": "text",
      "text": "# Yengarie, Queensland\n\n| pop                 = 615\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4650\n| area                = 27.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 13.6\n| dir1                = W\n| location1           = Maryborough\n| dist2               = 42.6\n| dir2                = SW\n| location2           = Hervey Bay\n| dist3               = 116\n| dir3                = S\n| location3           = Bundaberg\n| dist4               = 258\n| dir4                = N\n| location4           = Brisbane\n| lga                 = Fraser Coast Region\n| stategov            = Maryborough\n| fedgov              = Wide Bay\n| near-n              = Oakhurst\n| near-ne             = Tinana\n| near-e              = Tinana\n| near-se             = Tinana\n| near-s              = Grahams Creek\n| near-sw             = Yerra\n| near-w              = Dunmora\n| near-nw             = Dunmora\n}}\nYengarie is a rural locality in the Fraser Coast Region, Queensland, Australia. In the , Yengarie had a population of 615 people.\nGeography\nThe North Coast railway line enters the locality from the south (Grahams Creek) and exits to the north (Oakhurst).  The locality is served by Yengarie railway station ().\nHistory\nYengarie School opened on 30 March 1868 as a non-vested school (funded by the Queensland Government but not operated by the government). On 14 July 1873, it became Yenagarie State School (operated by the government). In 1873, it had 89 students and a new school building was being constructed to replace the old building described as \"dilapidated and overcrowded\". It closed in 1963. It was at 340 Old Mill Road ().\nYengarie Hall was opened in 1886. It was designed by architect James Robertson. It was used for meetings of the Antigua Divisional Board until 1903 and then the Antigua Shire Council until 1917 .\nDemographics\nIn the , Yengarie had a population of 460 people.\nIn the , Yengarie had a population of 615 people.\nHeritage listings\nYengarie has a number of State and Local heritage-listed sites, including:\n* Central Sugar Mill Ruins, Old Mill Road\n* Yengarie Sugar Refinery Ruins, Old Mill Road\n* Yengarie Hall, Mungar Road\nEducation\nThere are no schools in Yengarie. The nearest government primary schools are Mungar State School in Mungar to the south and Sunbury State School in Maryborough to the north-east. The nearest government secondary school is Aldridge State High School in Maryborough.\nAmenities\nYengarie Hall is a community centre on Mungar Road (). Its grounds contain facilities for tennis and basketball as well as a playground and BBQ/picnic facilities.\nPleasant View Park is at the end of Pleasant View Road and on the bank of the Mary River (). Pleasant View Road boat ramp is within the park providing access to the river (). It is managed by the Fraser Coast Regional Council.\nSee also\n* List of tramways in Queensland\nReferences\nFurther reading\n*  Includes Yerra & Pilerwa, Yengarie, Antigua, Pioneers Rest — [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/1dejkfd/alma997190554702061 via State Library of Queensland]\nExternal links\n*\n*  — a description of Yengarie in 1873\n*  - history of the Yengarie Hall and local government in the area"
    }
  ]
}