{
  "content": [
    {
      "type": "text",
      "text": "# Yeppoon War Memorial\n\n| location = Normanby Street, James Street and Anzac Parade, Yeppoon, Shire of Livingstone, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1919–1930s (interwar period)\n| built = 1921, 1984\n| built_for =\n| demolished =\n| architect =\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = Yeppoon War Memorial\n| designation1_type = state heritage (landscape, built)\n| designation1_date = 23 July 1999\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 602126\n| designation1_free1name = Significant period\n| designation1_free1value = 1920s, 1950s, 1980s (fabric)\n| designation1_free2name = Significant components\n| designation1_free2value = memorial – cairn, memorial – obelisk, plaque, memorial – tree/avenue of trees\n| designation1_free3name = Builders\n| designation1_free3value =\n}}\nYeppoon War Memorial is a heritage-listed memorial avenue of trees in Normanby Street, James Street and Anzac Parade, Yeppoon, Shire of Livingstone, Queensland, Australia. It was built in 1921 and 1984. It was added to the Queensland Heritage Register on 23 July 1999.\nHistory\nThe Yeppoon War Memorial comprises a series of avenues of trees, located over Anzac Parade, James and Normanby Streets planted in 1921 and 1984, to commemorate the servicemen lost from the local community. The ANZAC Parade avenue of trees was officially opened on 26 December 1929 by the Chairman of the Livingstone Shire Council, Cr, T. Smith, whilst driving through ribbons held by returned servicemen in uniform. The memorial obelisk, erected in 1952, is located in Beaman Park at the intersection of Normanby and James Streets, commemorates all servicemen and women from the Yeppoon district. Together they create an integrated precinct of remembrance for the international conflicts in which Australia participated.\nUp until the early twentieth century, there were few statues or monuments in Queensland. However, as a result of World War I (1914–1918), memorials were erected in almost every Queensland town. Such public expression of both grief for the dead and pride in the nation has not been generated by previous or subsequent wars. Memorials erected following subsequent wars were often adjuncts to the original commemorative symbols.\nWorld War I had an enormous impact on the Australian population. Of those who went to war, almost one in five did not return. It was common for families to lose more than one son and for small communities to lose a whole generation of men.\nIn 1916, the British Government prohibited the exhumation and return of bodies. This, coupled with the impracticality of visiting distant graves ensured war memorials became an expression of public mourning, revered as cenotaphs (literally meaning empty tomb) by those who erected them. Placed in prominent locations, such as planting of memorial trees in Yeppoon's main thoroughfares, they became symbols of remembrance and were considered to be as sacred as gravesites.\nMaterials, design principles and symbols suggesting permanence, reverence and commemoration were important elements. In Yeppoon, trees symbolising continuing life were planted in 1921, at The Esplanade, James and Normanby Streets, as the original public commemoration. Native Australian Hoop Pines were selected as the preferred tree, suited to the harsh seaside conditions and longevity of up to 700 years making them an ideal choice for a continuing memorial. At this time The Esplanade was renamed Anzac Parade. While the trees in Anzac Parade flourished, those in James Street declined after the 1940s. Most of the memorial plaques for individual lost soldiers located under trees in James Street had disappeared. In 1984, Yeppoon Returned Services League and Livingstone Shire Council cooperated to replace the trees and plaques and to extend the memorial to those who died in World War II, Korea and Vietnam. Palm Trees were planted in James Street and plaques moulded in brass in the pattern of the originals and set in small concrete cairns honour 29 Yeppoon residents.\nThe Ulam marble Yeppoon Honour Board, financed by public subscription and listing 68 townsmen enlisted in World War I, was originally housed in a glass-fronted case in the Yeppoon railway station. This marble tablet was incorporated into the 1952 obelisk placed in Beaman Park as the Yeppoon War Memorial. A marble plaque reading \"Lest we forget\" inserted above the original inscriptions, was a gift from local businessman, B.C. Kent. Plaques commemorating the enlisted for World War II, Korea and Vietnam have also been added to the obelisk.\nDescription\nThe Yeppoon War Memorial is situated over three streets and a park in Yeppoon, all located in the central section of the town. The beach foreshore and esplanade, Anzac Parade has a row of mature hoop pines (Araucaria cunninghamii) evenly spaced by approximately two metres. This row extends around the corner into Normanby Street, with four mature hoop pines centre planted into a specially created tree reserve. The avenue continues in Normanby Street between Mary Street and Arthur Street planted in the roadside reserve. A row of Coconut Palm Trees is centre planted in James Street under which small concrete cairns are located. Each cairn carries two brass plaques commemorating an individual serviceman. Two original plaques remain in situ, on a short timber pickets.\nThe monumental style War memorial is located in Beaman Park. A simple white concrete obelisk is located in the centre of a double stepped base that has polished concrete horizontal surfaces and white vertical surfaces. The obelisk has marble tablets inset into each face of the obelisk, representing the four conflicts in which Yeppoon residents enlisted. The obelisk culminates in a pyramidal apex.\nHeritage listing\nYeppoon War Memorial was listed on the Queensland Heritage Register on 23 July 1999 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nWar Memorials are important in demonstrating the pattern of Queensland's history as they are representative of a recurrent theme that involved most communities throughout the state. They provide evidence of an era of widespread Australian patriotism and nationalism, particularly during and following World War I. They manifest a unique documentary record and are demonstrative of popular taste in the post war periods.\n'''The place demonstrates rare, uncommon or endangered aspects of Queensland's cultural heritage.\nAvenues of trees were uncommon in Queensland, a form of memorial favoured by the southern states and in particular rural Victoria.\nThe place is important in demonstrating the principal characteristics of a particular class of cultural places.'''\nThe memorial at Yeppoon demonstrates the principal characteristics of a commemorative form erected as an enduring record of this community's contribution to events of national significance. In Yeppoon, this is achieved through a combination of avenues of trees, the renaming of Anzac Parade, plaques to individuals sacrificed in war and a symbolic monument dedicated to all who enlisted in the Australian armed forces.\nThe place is important because of its aesthetic significance.\nThe Yeppoon War Memorials are an important aesthetic element in the townscape.\nThe place has a strong or special association with a particular community or cultural group for social, cultural or spiritual reasons.\nThe range and extent of memorial selected by this small community demonstrates the enormous impact that war had and the importance of the commemorative process.\nThe mature hoop pines on Anzac Parade and Normanby Streets have landmark qualities for the township of Yeppoon.\nReferences\nAttribution\nExternal links"
    }
  ]
}