{
  "content": [
    {
      "type": "text",
      "text": "# Yet Soo War Way Lee\n\nYet Soo War Way Lee (1853-1909) was a Chinese-Australian merchant.\nPersonal life\nWay Lee was born in Tungkun, Guangdong, China in about 1853, the only child of a rice-miller. He migrated to Australia in 1874, joining his uncle in Sydney, New South Wales, before spending time in Brisbane, Queensland, and settling in Adelaide, South Australia.\nHe became a naturalised citizen of the colony of South Australia in 1882 and also joined the United Tradesmen's Masonic Lodge.\nIn 1889, he married Margaret Ann McDonald. They had 3 children. Way Lee died 21 August 1909 in Adelaide, South Australia.\nWay Lee & Company\nBy 1878, Way Lee had established an importing firm, Way Lee & Co. in Hindley Street, Adelaide The company dealt in tea, porcelain, fireworks, Chinese medicines and general bric-a-brac. He expanded its operations across regional Australian with branches in Wentworth and Wilcannia in New South Wales, Quorn and Hawker, and further interests in the Daly River, Northern Territory and Millicent, South Australia.\nWay Lee had one of the government contracts to supply the Ghan railway from Port Augusta to Hergott Springs/Maree. He partnered with several other Chinese merchants, including Hu Ting, to deliver food and other supplies to the expanding railway in the late 1880s.\nWay Lee and other Chinese Australian merchants of the time formed the Chinese Empire Reform Association, of which he was president.\nAdvocacy\nWay Lee was a leader of the South Australian Chinese community, actively participating in community events, including hosting Chinese New Year dinners and providing support for disaster relief efforts in China. He advocated for the rights of Chinese residents of Australia, focusing on education, living conditions, and opposing opium trafficking.\nHe and Hu Ting authored at least one letter to the Editor during the height of the Anti-Chinese immigration debates in South Australia in the 1880s and advocated to remove laws or rules that limited the ability of Chinese individuals to travel freely between the colonies.\nIn connection with the Jubilee Exhibition of 1887, Chinese Commissioners visited Adelaide and appointed Way Lee, along with three others including Quong Wing from Melbourne and Quong Tart from Sydney, to deliver a memorial from the Chinese community in Australia to the Beijing Government. During the presentation of this document, Way Lee was honored with the rank of Fourth Mandarin.\nIn 1909, Way Lee was appointed Chinese Vice-Consul for South Australia but died before taking up the post. He is buried in West Terrace Cemetery, where thousands reportedly attended his funeral, including the South Australian Chief Justice, Sir Samuel Way, represented by his associate, Mr. W. L. Stuart.\nFurther reading\n*\n* THE CASE OF MR. WAY LEE. (1889, January 11). Bendigo Advertiser (Vic. : 1855 - 1918), p. 2. Retrieved December 10, 2024, from http://nla.gov.au/nla.news-article88558885\nReferences"
    }
  ]
}