{
  "content": [
    {
      "type": "text",
      "text": "# Yongzheng Emperor__disambig_1\n\n| image        = 雍正朝服像轴.jpg\n| image_size = 210px\n| caption      = Portrait in the Hong Kong Palace Museum\n| succession1  = Prince Yong of the First Rank\n| reign1       = 1709–1722\n| reign-type1  = Tenure\n| succession   = Emperor of the Qing dynasty\n| reign        = 27 December 1722 – 8 October 1735\n| predecessor  = Kangxi Emperor\n| successor    = Qianlong Emperor\n| birth_date   =\n| birth_place  = Yonghe Palace, Forbidden City, Beijing\n| death_date   =\n| death_place  = Imperial Gardens, Beijing\n| burial_place = Tai Mausoleum, Western Qing tombs\n| spouses      =\n*\n}}\n| spouse-type  = Consort(s)\n| issue        =\n| issue-link   = #Family\n| issue-pipe   = more...\n| full name    = )\n* Manchu: In jen ()\n}}\n| era name     = Yongzheng ()\n| era dates    = 5 February 1723 – 11 February 1736Manchu: Hūwaliyasun tob ())}}\n| regnal name  =\n| posthumous name =  Jingtian Changyun Jianzhong Biaozhen Wenwu Yingming Kuanren Xinyi Ruisheng Daxiao Zhicheng  (}})\n* Manchu: Temgetulehe Hūwangdi ()\n}}\n| temple name  = )\n* Manchu: Šidzung ()\n}}\n| house        = Aisin-Gioro\n| dynasty      = Qing\n| father       = Kangxi Emperor\n| mother       = Empress Xiaogongren\n| religion     = Tibetan Buddhism\n| signature_type = Seal, Chénhàn) seal used for calligraphy and handwritten works.}}\n| signature    = Chenhan Seal of the Yongzheng Emperor.svg\n| module       =\n}}\n}}\nThe Yongzheng Emperor (13 December 1678 – 8 October 1735), also known by his temple name Emperor Shizong of Qing, personal name Yinzhen, was the fourth emperor of the Qing dynasty, and the third Qing emperor to rule over China proper.\nThe fourth son of the Kangxi Emperor, Yongzheng ascended the throne following prolonged disputes over succession. A hard-working ruler, he aimed to create a more effective government, cracked down on corruption and reformed the personnel and financial administration. His reign also saw the formation of the Grand Council, an institution that had a major impact on the future of the dynasty. Militarily, Yongzheng continued his father's efforts to consolidate Qing's position in Outer Mongolia and Tibet through force.\nThe Yongzheng Emperor died in 1735 at the age of 56 and was succeeded by his fourth son, who assumed the throne as the Qianlong Emperor. Although his reign was much shorter than that of both his father and his son, the Yongzheng era achieved important reforms, but also considered by many to be authoritarian, with some describing him as a benevolent despot while others note that autocratic policies went too far.\nBirth and early life\nYinzhen was the eleventh recorded son of the Kangxi Emperor, and the fourth prince to survive into adulthood. His mother, historically known as Empress Xiaogongren, was originally a court attendant from the Manchu Uya clan. Around the time when Yinzhen was born, his mother was of low status and did not have the right to raise her own children. For most of his childhood, Yinzhen was raised by Noble Consort Tong, the daughter of Tong Guowei, the Kangxi Emperor's maternal uncle and an eminent official in the early part of the Kangxi Emperor's reign. She died when Yinzhen was just 9 years old. After she gave birth to more children, Yinzhen's mother was promoted to a pin and then to a fei, and became known as defei or \"Virtuous Consort\". The Kangxi Emperor did not raise his children only inside the palace. He also exposed his sons (including Yinzhen) to the outside world and gave them a rigorous education. Yinzhen accompanied his father on several inspection trips around the Beijing area, as well as one further south. He became the honorary leader of the Plain Red Banner during the Battle of Jao Modo between the Qing Empire and the Mongol Dzungar Khanate led by Galdan Khan. Yinzhen was made a beile in 1689 along with several brothers and promoted to junwang (second-rank prince) in 1698.\nIn 1709, the Kangxi Emperor stripped his second son Yinreng of his position as crown prince. Yinreng had been the crown prince for his whole life; his removal left the position of heir open to competition among the Emperor's remaining sons (the Kangxi Emperor had 24 sons who reached adulthood). In the same year, the Kangxi Emperor promoted Yinzhen from junwang to qinwang (first-rank prince) under the title \"Prince Yong of the First Rank\" (; Manchu: hošoi hūwaliyasun cin wang). Yinzhen maintained a low profile during the initial stages of the succession struggle. To appoint a new heir, the Kangxi Emperor decreed that officials in his imperial court would nominate a new crown prince. The Kangxi Emperor's eighth son, Yinsi, was the candidate preferred by the majority of the court as well as many of the Kangxi Emperor's other sons. The Kangxi Emperor, however, opted not to appoint Yinsi as his heir apparent largely due to apprehension that Yinsi's political clout at court was beginning to overshadow his own. Thereafter, Yinzhen sensed that his father was in favour of re-instating Yinreng as heir apparent, thus he supported Yinreng and earned the trust of his father.\nYongzheng's quote\nYinzhen (, 13 December 1678 – 8 October 1735) had the highest honor to orchestrate the imperial ceremonies and rituals during the reign of the Kangxi emperor, which illustrated that Yinzhen was well acquainted with the Confucianism traditions and customs. In the imperial court, Yinzhen was also deeply immersed in the state's affairs and heavily engaged in the political debates where he acquired diplomatic skills. As the Yongzheng Emperor (, r. 1723–1735 CE) of Qing China, Yinzhen was indubitably a very diplomatically inclined ruler who created an institution of a \"moral government\" based on the Confucian principles. Yinzhen sought four distinctive qualities: loyalty—, fairness—, sincerity—, and capability—, from his subjects in order to run an effective court and to achieve stability. Li Wei (, February 2, 1687 – December 3, 1738) was a recruit among the Qing officials to possess the desired virtues, and was regarded highly by Yongzheng.\nA notable quote from Yinzhen captured during his reign as the Yongzheng Emperor in the 1720s expresses his imperial will:\n:— page 190, lines 7–10\nIf it is a trivial matter, do not just simply neglect the issue because it seems insignificant. If it is a complex matter, do not just simply conceal away the issue because it could become a challenge. To have good governance and dissuade seditionists, is all in the ruler's wish. If civilians see a judicious court that is loyal and wholeheartedly for the country, and see that the court embraces its people; and civilians feel the virtue in their court marshalls, then the people would not perceive the court as a threat. Thus, there would be no reason to have seditionaries.\nIn short, after several years of political chaos, Yongzheng earnestly strived to restore a functional court with \"good government\", immediately after he ascended the throne in 1723 CE, to stabilize Qing into a unified and harmonious empire. In 1733 CE, Yongzheng successfully institutionalized the Grand Council, which allows Qing to relay communication effectively and efficiently from region to region, thereby enabling the implementation of his domestic reform policy.\nWith the establishment of his Grand Council, Yongzheng was not only able to discourage corruption, but he was in a position to launch several domestic reforms beneficial to the empire and its people. Canals and irrigation systems were reconstructed to support agriculture and maintain farmlands. During famines, he provided relief to the affected regions by distributing resources. In reparation to the people, who were the backbone of the country, he issued an imperial decree to emancipate slaves under his reign. One of the several tax reform policies Yongzheng introduced was to shift the head taxation to the property taxation on landowners, which greatly reduced the tax burden on civilians. Additionally, Yongzheng was indeed in full support with the construction of orphanages to shelter orphans, in building elementary schools to educate children, and poorhouses to house  paupers. Perhaps the Yongzheng era (雍正, r. 1723–1735 CE) may have been overshadowed by his predecessor's accomplishments, the Kangxi Emperor, and his achievements may not have been as glorious as his successor, the Qianlong Emperor; however, the Yongzheng era did serve as a remediation to the people, and resentments began to gradually decrease. Hence the Yongzheng era was a peaceful and prosperous reign of Qing China.\nStruggle for the crown prince's position\nKangxi's choices of the crown princes\nIn 1712, the Kangxi Emperor deposed Yinreng again, and chose not to designate an heir apparent for the remaining years of his reign. This resulted in competition among his sons for the position of crown prince. Those considered 'frontrunners' were Yinzhi, Yinsi, and Yinti (Yinzheng, Yunti) (the third, eighth and 14th princes, respectively). Of these, Yinsi received the most support from the Mandarins, but not from his father. Yinzhen had supported Yinreng as heir, and did not build a large political base for himself until the final years of the Kangxi Emperor's reign. Unlike Yinsi's high-profile cultivation of a partisan base of support, Yinzhen did so largely away from the limelight. When the Kangxi Emperor died in December 1722, the field of contenders shrank to three princes after Yinsi pledged his support to the 14th prince, Yinzheng.\nAt the time of the Kangxi Emperor's death, Yinzheng, who held the appointment of Border-Pacification General-in-Chief (), was leading a military campaign in northwestern China. He was also awarded an apparently grandiose title of \"Fuyuan General-in-chief Prince\" (撫遠大将軍王) and his departure ceremony was solemnly held. Some other princes, such as Yinsi and his clique, interpreted that Yinzheng might be chosen as heir and, therefore, pledged their support to Yinzheng and encouraged him to make military achievements to prove his \"worthiness\".\nHowever, Yi Zhongtian argued that such a \"promotion\" was Kangxi's way of protecting Yinzhen, Kangxi's secret chosen heir, by distracting the public's attention away from Yinzhen. The court officials, who believed that Yinzheng would be chosen as the heir, would also no longer pester Kangxi about the crown prince issue. Sending Yinzheng away to the northwestern border was also meant to separate him from Yinsi, his newly formed ally, and potential flatterers who wanted to curry favour with Yinzheng. Yinzheng would also be unable to use his commanded troops to make a coup d'état, since Nian Gengyao, Yinzhen's close aide, controlled the food supply and the return route of Yinzheng's troops. Promoting Yinzheng was also a way for Kangxi to control Yinzhen: if Kangxi's \"investment\" in Yinzhen turned out to be a failure, he still had Yinzheng as alternative choice. With Yinzheng as a potential competitor, Yinzhen would not fall into self-complacency and turn against Kangxi. Yinsi's clique, clinging to the hope of Yinzheng's future prospect, would also not do anything reckless. As a result, Yinzheng's \"General-in-chief Prince\" title appeared grandiose, but was actually hollow and dubious; it was neither \"general\" nor \"prince\" and could be interpreted in various ways, which could be used in favour of either Yinzheng or Yinzhen should the situation arise. Such dubious words with multiple interpretations was a traditional trick in Chinese politics.\nThe popular history writer Yi Zongtian thinks that there were signs that showed Yinzhen as Kangxi's secret choice. First, according to Yongzheng's edicts and official historical account, Kangxi mentioned that Yinzhen alone was raised by Kangxi and how he expressed filial piety to Kangxi. In another occasion though, Yongzheng said that he was not a prince who was raised in the palace. Professor Lin Qian on the other hand notes that the fourteenth prince was the only son Kangxi always kept with him, until his death, despite the fact he already married  (the fourteenth prince's wife lived inside his father's palace too) and had a princely mansion outside.\nSecond, according to Yi, at Kangxi's 60th regnal year (1721) memorial event, Yinzhen was given the task of holding the ritual ceremonies for the royal family's ancestors in Three Great Mausoleums in Shenyang. Shortly after that, Yinzhen was also tasked to organize the Sacrifice to the Heaven (南郊禮), the most sacred ceremony in Confucian tradition, on the day of winter solstice. Others note that the third prince Yinzhi also had presided over these ceremonies before, the fifth prince Yinqi was presiding over the Veneration of Ancestor ceremony at the time Kangxi was dying, and even eighth prince Yinsi (who had had many clashes with Kangxi) made the lists of candidates. The only one among adult princes who was put aside was Yinxiang, Yongzheng's important ally. Lin Qian also suspects that Yongzheng organizing the Sacrifice of Heaven of the sixty first year was an event invented later to justify Prince Yong's strange behaviours at that time, since no other records mention it other than Shilu, which was written under the supervision of Yongzheng and Zhang Tingyu . Moreover, according to Lin Qian, when the fourteen prince prepared for his expedition, Kangxi himself perform the Veneration of the Flags, which also belonged to the highest ceremonies of the dynasty.\nYi also says that Kangxi highly favoured Yinzhen's son Hongli (the future Qianlong Emperor) and that might also contribute to Kangxi's support for Yinzhen as his heir, similar to how the Yongle Emperor chose his heir due to his favour to the crown prince's son. Historian Yang Zhen though notes that Kangxi was kind to his grandchildren in general but especially to the sons of the second and the fourteenth princes.\nOfficial court records state that on 20 December 1722 the ailing Kangxi Emperor called seven of his sons and the general commandant of the Beijing gendarmerie, Longkodo, to his bedside. Longkodo read the will and declared that Yinzhen would be the Kangxi Emperor's successor. Some evidence has suggested that Yinzhen contacted Longkodo months before the will was read in preparation for his succession through military means, although in their official capacities frequent encounters were expected.\nHistorian Qin Hui writes that it is largely recognized that Yongzheng forged the succession edicts together with Nian Gengyao. Qin Hui criticizes Feng Erkang, who also recognizes the forgery, for failing to explain why Yongzheng would have needed a forged edict if he had truly been the legal heir. Yongzheng also changed his story several times. When he punished Longkodo (who was supposed to be the only person who was informed of Kangxi's succession plan and informed Yongzheng and others about it after Kangxi's death), Yongzheng himself said that Longkodo was not present by the emperor's side on that day. According to historian Dai Yi, a report by Longkodo to Yongzheng also shows that the prince Yunli (who was cited by Yongzheng as one of the witnesses in his later version of the events; this prince did not participate in the fight for the throne but later became Yongzheng's ally during the latter's reign) was not present – when he was rushing to Kangxi's resident after being informed of his father's death, the prince met Longkodo who told him about Yongzheng's ascension and became so horrified that he returned to his house immediately, looking like a mad man.\nDai Yi, Meng Shen, Wang Zhonghan, Lin Qian and Yang Zhen are the notable historians who maintain that the fourteenth prince Yinzheng (later renamed Yunti) was Kangxi's intended heir. They point out that the conflict against the Zhungar was of such an existential importance to the Qing dynasty (which threatened to rip half of their territories apart together with the Mongol-Manchu alliance) that it is hard to imagine Kangxi would have sent anyone but his most trusted son to deal with the crisis.  Due to this, the \"Fuyuan General-in-chief\" position (which was already bestowed on Kangxi on his trusted generals several times before and carried with it exceptional powers) was raised to an unprecedented level of power and prestige unseen since the beginning of the dynasty. The deposed crown prince, Yinreng, and Yinzhen fought for the position too, but failed to get it. Lin Qian writes that there are many signs that show Yongzheng did alter records to make the title \"General-in-chief Prince\" less impressive, and that the fourteenth prince's rank was actually Prince (wang). Kangxi even made the apparently longterm investment by sending several young members of the imperial family to the fourteenth prince so he could raise them as his apprentices. This intent was shown, when the fourteenth prince requested them to be sent back to the capital, Kangxi refused and told him that they needed to be trained (obviously to serve the fourteenth later). Lin Qian notes that with sixteen people holding titles ranging from beizi to wang and other important officials sent to follow the fourteenth prince, Kangxi had already organized a mini imperial court for him. When he returned to the capital on the sixtieth year of his father's rule, he was welcomed with unprecedent ceremonies. His third and fourth brothers were ordered to lead the court officials to welcome him at the gate of the city (郊迎). Abulan, a member of the imperial clan and a high official, knelt before him – an act that later earned him a rebuke from Yongzheng (as emperor) but was never criticized by Kangxi, who later sent a poem to Yinzheng to congratulate him on the occasion. Even from the capital, the prince continued to command the Tibet theater (even though his General-in-chief Prince's seal had been entrusted to his second-in-command).\nYang Zhen opines that when Kangxi encouraged his son to engage with the local chiefs, the emperor did not think about their usefulness in the current campaign alone, as he told the prince that their dedication to the person of the prince \"will be of use later\", and that their service would be more valuable to that of the Han. In another occasion, he taught the prince how to win the heart of generals and soldiers, while carefully instructing him that he should not disclose that this idea came from the emperor, but acted like it was his own. Bai Xinliang notes that most of the letters and documents exchanged between Kangxi and the fourteenth prince had been either destroyed or altered by Yongzheng and his officials. The documents of the last year of Kangxi in particular were almost completely lost, while the remaining pieces exist because Yongzheng committed some mistakes out of inexperience in his early reign.\nYinzhen's tactics\nYinzhen's tactics during the struggle for crown prince's position were to do practically nothing and to stay out of the limelight. Instead, he focused on filial piety towards Kangxi and dutifully performed the given tasks as a subordinate of the Emperor. Compared to other siblings (Yinzhi, Yinsi, Yinti, Yinreng), Yinzhen had no clear advantage. Unlike Yinsi, Yinzhen had neither a close association nor a good relationship with the majority of court officers and magistrates, he was also shunned due to his cold appearance and the legalist-style harsh treatment for any kinds of moral sin and legal violation of the magistrates. Acknowledging that fact, Yinzhen intentionally showed no ambition to be the heir  in order to not attract any unnecessary attention and animosity; he watched as other contenders fought each other to the death, a policy more beneficial for him. Yinzhen even pleaded many times for Kangxi's mercy and pardon for other princes, including the deposed Yinreng, which gained him the praise and favour from Kangxi.\nAs an experienced player in politics, Kangxi himself knew that Yinzhen's humility and filial piety was not really sincere and more of a cover to protect himself, nonetheless Kangxi still made lavish praise to Yinzhen and enjoyed the apparently good relationship with his son. In the situation when his offspring openly trampled on family relationships, Yinzhen's \"false\" filial piety and kindness was already a haven for Kangxi. Kangxi also hoped that Yinzhen, despite being pretentious, might not actually mistreat his deceased father and the deposed Yinreng in the future, which was proven to be relatively correct. As a result, Kangxi not only didn't expose Yinzhen, but also became the accomplice with Yinzhen's act.\nDisputes over succession\nAlthough Kangxi's meticulous plan enabled Yinzhen later to be crowned as emperor, it also created many disputes about Yinzhen's succession as there was no direct, intuitive way to prove Yinzhen's legitimacy. Kangxi's choice as Yinzhen was a shock to many other princes (even Yinzhen also pretended to be shocked). Kangxi also did not make any mention about his choice for the crown prince position, his will was only known via the deceased emperor's testament provided by Longkodo, and there was no decisive evidence proved that the testament was not fabricated. For the contemporary public, there was also no evidence to directly infer, or to explain why, Kangxi thought of Yinzhen as his choice. As a result, Yinzhen's succession faced fierce opposition from former contenders such as Yinti, Yinzhi and Yinsi. Purging the dissidents and solidifying his own position occupied much of Yinzhen's initial reign as emperor.\nResearchers at Academia Sinica have disproved the theory, as official Qing documents, when mentioning sons of the Emperor, always list the son's title, as well as the son's rank amongst the emperor's sons and the son's name. In this case, the will mentions \"Prince Yong, Emperor's Fourth Son, Yinzhen\" (), as well as Kangxi Emperor's high regards for Yinzhen, and his belief that Yinzhen can succeed on the throne.\nThe problem with the will, or at least the Chinese version, as currently preserved, is that it was not Kangxi's creation. It was drafted three days after Kangxi's death by Longkodo under Yongzheng's instruction. Yongzheng's order is still preserved by Museum of the Institute of History & Philology, Academia Sinica There are debates about the authenticity of extant copies of the Manchu version, but not only the part that mentions the heir's name is destroyed, the important sentence that praises Yinzhen's virtues (as recorded by official records of the dynasty) also does not appear at all.\nLegends about the will\nThere is a widely circulated legend, persisting even to the present day, that Yinzhen was crowned emperor after he modified Kangxi Emperor's final will that detailed who will succeed him. There are two versions of the legend, both of which involves the Chinese character \"}}\" (), and by extension, Yunti, Prince Xun. One version involves changing the \"\" in the phrase \"transfer the throne to the Fourteenth Prince\" () to \"}}\" (), which changed the phrase to \"pass the throne on to the Fourth Prince\" ). Another version states the character \"\" was changed to \"}}\" (), which means \"sequence number\" (四 = four, 第四 = the fourth / number four), thus changing the phrase to \"transfer the throne to the Fourth Prince\" ().\nReign\nAfter ascending the throne in December 1722, Yinzhen adopted the era name \"Yongzheng\" ( lit. \"Harmonious Justice\") in 1723 from his peerage title \"yong\" ( lit. \"harmonious\") and \"zheng\" ( lit. \"just, correct, upright\"). It has been suggested that the second character of his era name was an attempt to cover up his illegal claim to the throne by calling himself \"justified\". Immediately after succeeding to the throne, the Yongzheng Emperor chose his new governing council. It consisted of the eighth prince Yinsi, 13th prince Yinxiang, Zhang Tingyu, Ma Qi, and Longkodo. Yinsi was given the title \"Prince Lian\" while Yinxiang was given the title \"Prince Yi\", and these two held the highest positions in the land.\nContinued battle against princes\nof the Yongzheng Emperor wearing a European wig and dress, preparing to strike a tiger with a trident|alt=Painting of Chinese man, in Western clothes, attacking a tiger with a pitchfork-like staff]]\nThe nature of his succession remained a subject of controversy and overshadowed the Yongzheng Emperor's reign. As many of his surviving brothers did not see his succession as legitimate, the Yongzheng Emperor became increasingly paranoid that they would plot to overthrow him. The earlier players in the battle for succession, Yinzhi, the eldest, and Yinreng, the former crown prince, continued to live under house arrest. Yinreng died two years after the Yongzheng Emperor's reign began.\nThe Yongzheng Emperor continued to perceive Yinsi and his party, consisting of the princes Yintang, Yin'e, Yinti, and their associates, as his greatest political challenge in the early years of his reign. To diffuse their political clout, the Yongzheng Emperor undertook a 'divide and conquer' strategy. Immediately after ascending the throne, the emperor bestowed on Yinsi the title \"Prince Lian\", nominally of the highest noble rank. Yinsi was also then appointed as the Minister of the Lifan Yuan (Feudatory Affairs Office) and the top-ranking member of the imperial council assisting the Yongzheng Emperor; some historians believe his position at the time was essentially that of a \"Chancellor or Prime Minister\". By ostensibly elevating Yinsi to a more prominent political role, the Yongzheng Emperor held Yinsi under close watch and kept him busy with affairs of state, reducing the chance of him conducting behind-the-scenes political maneuvers. Yinsi's allies received notably different treatment. Yintang was sent to Qinghai under the pretext of military service, but in reality was watched over by the Yongzheng Emperor's trusted protégé, Nian Gengyao. Yin'e, the tenth prince, was told to leave the capital to send off a departing Mongol prince, but since he refused to complete this trip as the emperor commanded, the Yongzheng Emperor stripped him of all his titles in May 1724 and sent him north to Shunyi to languish in solitude.\nThe 14th prince, Yinti, born to the same mother as the Yongzheng Emperor, was recalled to Beijing from his military post. The emperor selected Nian Gengyao to replace Yinti as the commander of the northwestern expeditionary force. Yinti, who expected to be placed on the throne himself, was reluctant to recognise the Yongzheng Emperor's succession as legitimate. Yinti was accused of violating imperial decorum at the funeral proceedings of the late emperor, and placed under house arrest by the Yongzheng Emperor at the imperial tombs in western Beijing. Historians believe that their mother, Empress Dowager Renshou, favoured Yinti partly because she raised him herself, while she did not raise the Yongzheng Emperor. Nonetheless, the increasingly sharp conflict between her two surviving sons caused their mother great sorrow. She died less than six months after the Kangxi Emperor.\nBy forcibly dispatching Yinsi's party to separate locations geographically, the Yongzheng Emperor made it extremely inconvenient for his rivals to link up and conspire against him. While some of Yinsi's subordinates were appointed to high office, others were demoted or banished, making it difficult for Yinsi's party to maintain the same set of partisan interests. The Yongzheng Emperor publicly reprimanded Yinsi in 1724 for mishandling an assignment, eventually removing him from office and then sending him into house arrest. Yinsi was forced to rename himself \"Acina\", a derogatory slur in the Manchu language. The emperor also confiscated the assets of Yintang and Yin'e.\nDescendants of the Ming dynasty's imperial family\nIn line with his father the Kangxi Emperor's wish for an integrated Manchu—Han Chinese nation, the Yongzheng Emperor in 1725 bestowed a hereditary marquis title on Zhu Ming, a descendant of the imperial family of the Ming dynasty. This action was also seen as fulfilling a long-standing Chinese custom (purportedly dating back to the Shang dynasty) for the Emperors of a new dynasty to enfeoff a member of the overthrown previous dynasty with a noble title, the so-called \"Two Crownings and Three Respects.\"\nZhu was also paid by the Qing government to perform rituals at the Ming tombs and induct the Chinese Plain White Banner into the Eight Banners. Later in 1750, during the reign of the Yongzheng Emperor's successor, the Qianlong Emperor, Zhu Ming was posthumously honoured as \"Marquis of Extended Grace\". The marquis title was passed on to Zhu's descendants for 12 generations until the end of the Qing dynasty in the early 20th century.\nNian Gengyao and Longkodo\nNian Gengyao was a supporter of the Yongzheng Emperor long before the latter ascended the throne. In 1722, when he was recalling his brother Yinti from the northwest border in Xinjiang, the Yongzheng Emperor appointed Nian as the commander of the Qing army in Xinjiang. The situation in Xinjiang at the time was volatile, and a strong general was needed in the area. After several military conquests, however, Nian's stature and power grew. Some said he began seeing himself as equal to the emperor. Seeing Nian as no longer within his control, the Yongzheng Emperor issued an imperial edict demoting Nian to the position of a general of the Hangzhou Command. As Nian continued to remain unrepentant, he was eventually given an ultimatum and forced to commit suicide by consuming poison in 1726.\nLongkodo was the commander of the militias stationed at the capital at the time of the Yongzheng Emperor's succession. He fell into disgrace in 1728 and died while under house arrest.\nAfter taking the throne, the Yongzheng Emperor suppressed writings he deemed unfavorable to his court, particularly those with an anti-Manchu bias. Foremost among these were those of Zeng Jing, an unsuccessful degree candidate heavily influenced by the 17th-century scholar Lü Liuliang. Zeng had been so affected by what he read that he attempted to incite the governor-general of Shaanxi-Sichuan, Yue Zhongqi (a descendant of anti-Jurchen General Yue Fei), to rebel against the Qing government. Yue Zhongqi promptly turned him in, and in 1730 news of the case reached the Yongzheng Emperor. Highly concerned with the implications of the case, the emperor had Zeng Jing brought to Beijing for trial. The emperor's verdict seemed to demonstrate a Confucian sovereign's benevolence: He ascribed Zeng's actions to the gullibility and naïveté of a youth taken in by Lü Liuliang's abusive and overdrawn rhetoric. In addition, the emperor suggested that Lü Liuliang's original attack on the Manchus was misplaced, since they had been transformed by their long-term exposure to the civilising force of Confucianism.\nThe Yongzheng Emperor is also known for establishing a strict autocratic-style rule during his reign. He detested corruption, and punished officials severely when they were found guilty of an offense. In 1729, he issued an edict prohibiting the smoking of madak, a blend of tobacco and opium. The Yongzheng Emperor's reign saw the Qing dynasty further establish itself as a powerful empire in Asia. He was instrumental in extending what became known as a \"Kangqian Period of Harmony\" (; cf. Pax Romana). In response to the tragedy of the succession struggle during his father's reign, the Yongzheng Emperor created a sophisticated procedure for choosing a successor. He was known for his trust in Mandarin officials. Li Wei and Tian Wenjing governed China's southern areas with the assistance of Ortai.\nCultural and economic achievements\nRationalization of personnel appointment system\nIn the early Qing period, the majority of middle-to-low government posts were subject to a mechanical appointment procedure managed by the Board of Personnel, which was a lottery rule. More specifically, candidates would first be classified into three categories, namely degree holders, office purchasers, and officials waiting for promotion, based on their sources of candidature. These candidates or so-called offices-in-waiting were then assigned to different posts by drawing lots on a monthly basis, known as month selection. This random appointment procedure stemmed from the late Ming dynasty. Sun Piyang, a minister of the Board of Personnel during the Wanli emperor's reign of Ming, was said to have invented the method of drawing lots with the intention of introducing fairness into personnel selection when the Ming court was mired in faction politics.\nConsidering the limitation of monthly selection, the Yongzheng Emperor, inspired by a memorial of Jin Hong, the provincial administrative commissioner of Guangxi province, decided to launch a structural reform to the appointment system in 1731. In the new appointment system, local jurisdictions first were classified into two groups according to governance difficulties. More specifically, to prioritize local jurisdictions and allocate appointment power accordingly, the governability of each jurisdiction was decomposed into four elements, or four \"characters\": Chong, Fan, Pi, and Nan. \"Chong\" (thoroughfare) referred to places at busy highways and was designed to capture the characteristics of commercial potential or military significance. \"Fan\" (troublesome) stood for places with a great deal of onerous official business. \"Pi\" (wearisome) indicated areas having difficulty collecting taxes. \"Nan\" (difficult) referred to the places with crime-prone subjects and recurring violent engagement. Moreover, posts of jurisdictions containing all four elements would be ranked as very important positions and posts of places with three elements would be rated as important posts, whereas posts of places having less than two elements would be tagged as middle-level positions (two elements) or easy posts (one-zero element) respectively.\nIn this way, the post designation (Chong, Fan, Pi, and Nan) was linked to the importance rating system hand in hand. The appointment power then was allocated based on the importance rating system; posts marked as very important and important were subject to the discretionary appointment by the emperor or provincial leaders, whereas other less important posts still were assigned by drawing lots. As a result, the high-quality officials were matched to the important positions and in turn promoted local governance.\nYi Zhongtian commented that Yongzheng had a very flexible and pragmatic tastes of talent enrollment, based on the advice of Ortai: \"Amongst affairs, there are both essential and trivial, easy and challenging. Amongst people, there are both soft and hard, long and short.\" The emperor, therefore, did not use dogmatic and abstract criteria of \"talents\" and \"morality\", instead he acknowledged that every person has both strengths and defects and the tasks given to him should be tailored to suit his specific traits. For example, Li Wei had a very rude personality, but he was brave and clever, Yongzheng assigned him tasks related to law enforcement, criminal punishment and rebel liquidation. Zhu Shih, a scholar with upright and good personality, was appointed as teacher for the future Qianlong Emperor. Tian Wenjing had many personality defects and was heavily criticized by contemporaries, but was favoured by Yongzheng due to his hard-work, devotion and loyalty. Chang Sanle, Wuqiao district chief, had upright and transparent moral conduct, but lacked fervor in work, hence he was re-assigned to an educational post and removed from administrative work. However, the most critical criterion for the government magistrate was \"sincerity\" towards the emperor. The magistrate's works, reports, criticisms, suggestion, even flattery and blandishment, should be performed with sincere devotion to and sympathy with the emperor's interests and stance. Suggestion and criticism with adequate \"sincerity\", even if they were flawed and incorrect, was usually praised by Yongzheng. On the other hand, suggestions which were considered to only serve the magistrate's selfish interests and fame, or to only curry favour from the emperor, even if the suggestions were accurate and reasonable, would be heavily criticized by Yongzheng and the magistrate could be punished severely. That was the reason behind Yongzheng's apparently \"erratic\" and \"unpredictable\" behaviors in punishing and rewarding his subordinates.\nCorruption crackdown and financial reform\nEmperor Kangxi's long reign left lasting achievements, but also many flaws and maladies, including budget deficit, inadequate tax revenues, and huge debts. Corruption was widespread, and magistrates and aristocrats frequently borrowed money from the national treasure without any sign of returning the money. Therefore, immediately after his enthronement, Yongzheng began a crackdown against corruption and financial issues. Utilizing his experience during the time as a prince, the emperor used an unconventional approach: first he anticipated the counter-measures that corrupt magistrates might employ to evade state punishment, and then devised the emperor's own counter-measures against the magistrates.\nTo counter the local magistrates well-built networks, Yongzheng organized a group of inspectors consisted of independent Imperial Commissioners and \"clean\" local chiefs, assisted with a group of regional officer-to-be. When a regional magistrate was found guilty, he would be replaced by a corresponding member amongst the inspector group who had no connection of interest with the local clique and therefore would naturally do his best to continue the purge. Furthermore, local people were forbidden to lend money to their magistrates, preventing them from temporarily transferring the borrowed money to the local treasure to mask the deficits. Yongzheng also created an independent Inquisition Association to examine all the spending and revenue documents to prevent local officers from bribing the Ministry of Revenue to fabricate financial reports. To prevent the magistrates from fabricating the corruption cases as merely \"deificit spending\", Yongzheng demanded that the case of deficit spending must be investigated first, and punishment, sanction and compensation should be performed first in the case of deficit spending. Equivocation between deficit spending and corruption was strictly prohibited.\nTo prevent the guilty magistrates from further exploiting the people to compensate for their deficit spending, Yongzheng immediately dismissed the magistrate before compensation began. Dismissed magistrates no longer had authority over the people and had no choice but to use their own properties to compensate. As the punished magistrate might use other connections as an alternative for their lost authority, paying compensation on behalf of them was also strictly prohibited. The properties of their families and relatives were also confisticated for the compensation payment if necessary. In the cases of magistrates committing suicide to avoid punishment, Yongzheng demanded that their family and descendants should shoulder the punishment and compensation for the deceased magistrate. The emperor himself admitted that he wanted to see the guilty magistrate's descendants \"live in poverty and misery.\" Yongzheng's drastic punishment earned him the nickname \"Emperor of confiscation\".\nBeside harsh punishment, Yongzheng also improved the state officer's income to remove their incentive for corruption. He created a \"Fund for transparency nurturing\" from government additional revenues, which was now regulated and controlled by the central government, to provide copious allowance for state magistrate, enabling their daily expenses to be covered without accepting bribes. Magistrates not eligible for the Fund's money also received other kinds of allowances, and officers on business trips were also provide an allowance to cover their essential expenses, which had to be reported to the government. The \"transparency nurturing\" allowances beside removing the corruption incentive, also helped to publicized the magistrate's incomes, enabled the state to monitor, evaluate and detect any potential signs of corruption. Furthermore, all kinds of gifts and \"ritual fees\" was now strictly prohibited.\nThe \"secret report\" system\nTo effectively grasp the situation of his subordinates, Yongzheng utilized the \"secret report\" system which originated from the Shunzhi Era, which also suited his own tastes of having personal connection separately with each subordinate. The emperor recruited secret informants from the trusted subordinates who had the privilege to privately report to the Emperor whatever they felt suspicious. The components of secret informants was quite varied, including even some low-ranked officers, and was widely distributed all over the empire. To encourage the sincerity and eagerness of informants, their identity and reports' content was kept strictly confidential; even informants did not know each other, and the procedures and writing style requirements were greatly simplified. Such \"secret reporters\" enabled the emperor to maintain an extensive information network without a specialized internal espionage bureau. The secret informants also had no privileges beside the secret reports and the reports had no legal authority, which prevented authority abuse from informants like the Ming internal espionage agents. Also, to avoid false accusation and incorrect reports from informants, Yongzheng collected information from various sources, and the accused person also had a chance to defend their actions and prove their innocence. Popular historian Yi Zhongtian opines that under a capable ruler, secret reports actually protected innocent magistrates from wrong accusations, as the reports provided alternative information sources beside the official charges. Fu Zhengyuan writes that the secret report system created an atmosphere of mutual distrust, which encouraged people to spy and report on others' behaviours instead of forming bonds. Officials from the circuit censorate and supervising censorate had to write daily reports to be sent to the emperor. If they could not detect abnormal things, they had to state the reason.\nFarming and land tax\nDuring the massive population growth in the Qing dynasty and increasing demand from peasant and military populations for grain, the Yongzheng emperor launched a grain campaign in which he incentivized officials in local and provincial governments to compete in buying land meant specifically for farming. The Yongzheng emperor offered officials 5-10 year tax holidays in which they were free from paying taxes. This campaign led to more than one million new acres of farmable land. While these campaigns led to more food and land for the population to use for farming, it also led to officials lying about the amount of farmable land they were contributing in order to win the tax holidays. These tax holidays also pushed the burden of paying taxes elsewhere.\nYongzheng's fusion of ding tax (a tax on the individual) and the mu, or field tax (Tangding rumu, Chinese: 攤丁入畝) has been praised as one of the efficient and beneficient policies of the emperor by historians like Lin Qian and Wang Yuchen. Lin Qian says that, \"This continued the effect of the Ming Dynasty's Single Whip Tax, further reducing or even eliminating the tax burden on landless or land-poor peasants, creating free labor. To some extent, it can be said that the first real \"migrant worker boom\" in Chinese history occurred after Yongzheng's equalization of land tax and ding tax policy. This helped alleviate the burden on peasants, even promote urbanization, and achieve basic social fairness[...] However, the implementation [...] encountered strong backlash or resistance in every province. Those with abundant land were mostly from the powerful and wealthy class, so they would protect their own interests. However, one of the best things Yongzheng did was avoid a one-size-fits-all approach, without a timetable or roadmap. Instead, he implemented a policy of deregulation, allowing each province to implement the policy gradually based on its own circumstances, with the governors-general, provincial governors, and provincial administration commissioners submitting petitions. Therefore, in some places, the policy wasn't fully implemented until the Qianlong era.\" Wang Yuchen writes that the policy reduced the burden of people, saved money and promoted agriculture. Historian Dai Hui notes that the policy \"shifted China's feudal tax collection system, which had existed for nearly two thousand years, towards a unified system of land and ding tax, abolishing corvée labor and legally abolishing the feudal ding tax, thereby significantly weakening feudal dependency relationships. Furthermore, the policy objectively reduced the burden on the landless and those with little land, helping to ease class contradictions and consolidate the foundation of rule.\", although, because it was \"marked by feudalism from the outset\", even this well-meaning policy could not \"fundamentally solve the social problems arising from the inherent flaws of feudal society itself\".\nLocal charity\nEthnicity in Qing China could vary depending on where one was from even locally in China. This ethnic separation along with the booming population led to reduced access to the Civil Service Examinations based on ethnicity and locality. The Yongzheng emperor, in an attempt to allow as many people to take the Civil Service Examination as possible, set up special exams for people in rural China. These special exams were called Miao exams and were located in Yunnan. In the 1730s, landholding shed people such as the Hakka were still not allowed to take the exams, Yongzheng made it legal for these people to take the exams in an attempt to dispel anger at being excluded from the exams.\nA growing number of orphaned children or poor families came with the massive Qing population growth. The Yongzheng emperor sought to remedy this by mandating that orphanages (also called poor houses) be built in every county. These were funded not by local, provincial or high level government but privately funded and maintained. These orphanages existed less to help the local population out of poverty and more to model how wealthy officials should act towards the impoverished populations.\nGentry privileges\nThe Kangxi Emperor mandated that scholars that had passed the Civil Service Examination at any level were able to bypass punishments from the legal system depending on which level of the exams they had passed. Instead of legal repercussions for crimes, criminal officials were instead recommended to the county education commissioner for counseling. This led to corruption among officials who were no longer bound by law. In an attempt to stop this the Yongzheng emperor made it illegal to offer privileges to officials going through the legal system. This did not last long as the Qianlong Emperor reinstated legal privileges for officials that had passed the Civil Service Examination shortly after becoming emperor after Yongzheng.\nTax privileges\nIn the mid-1720s Qing empire, complex levels of tax hierarchies put in place by the Kangxi emperor existed to separate the population into different tax brackets. Households with government officials were in privileged tax brackets that brought with it tax exemptions for not only the immediate family in the household but also for extended family members. The Yongzheng emperor removed these privileged tax brackets as he saw the local gentry as competition to the throne. Just like the legal privileges that passing the Civil Service Examination offered, soon after the end of the Yongzheng emperor's reign, the Qianlong Emperor quickly reinstated the privileged tax brackets.\nReligious policy\nGrowing distrust of Jesuit missionaries by the Kangxi emperor and later by Yongzheng in the early 1720s led to prohibition and action against the Christian presence in China. The Kangxi emperor had banned foreign missions (outside of Beijing and Guangzhou), and Yongzheng took this one step further by removing all foreign priests from China. All Christian churches were shut down and repurposed as local public offices.\nCohong\nChinese merchant houses belonging to Canton station were grouped together under a larger organization by Yongzheng called Cohong in 1725. This group was responsible for policing all trade within the Canton system.\nMeltage fees and silver\nAs silver became more widely used as a currency in Qing China, the validity and purity of the currency being exchanged had to be verified. Silver taels were sent to official appraisers to do the job of verification. During the appraisal some silver was lost in the process, this lost silver had to be covered by the payer. This extra charge on the lost silver became known as a meltage fee. These meltage fees were a very important source of income for local governments. It became a practice to bribe appraisers to avoid meltage fees. Yongzheng attempted to ban all bribing to avoid these fees and also officially mandated meltage fees as a source of local income. These mandates helped silver become a major part of the Qing economy.\nExpansion in the northwest\nof \"China and Chinese Tartary\" from the Yongzheng era (1734)|alt=1734 map of China]]\nLike his father, the Yongzheng Emperor used military force in order to preserve the Qing Empire's position in Outer Mongolia. When Tibet was torn by civil war in 1727–1728, he intervened. After withdrawing, he left a Qing Resident (the amban) and a military garrison to safeguard the dynasty's interests.\nOn 1 November 1728, after the Qing reconquest of Lhasa in Tibet, several Tibetan rebels were punished with ling chi (slow mutilation until Death) by Qing Manchu officers and officials. The Qing Manchu President of the Board of Civil Office, Jalangga, Mongol sub-chancellor Sen-ge and brigadier-general Manchu Mala ordered the Tibetan rebels Lum-pa-nas and Na-p'od-pa to be sliced to death. They ordered gZims-dpon C'os-ac'ad (Hsi-mu-pen ch'ui-cha-t'e), son of Lum-pa-nas and rNog Tarqan bsKal-bzajn-c'os-adar and dKon-mc'og-lha-sgrub (Kun-ch'u-k'o-la-ku-pu) and dGa'-ldan-p'un-ts'ogs (K'a-erh-tan-p'en-ch'u-k'o), sons of Na-p'od-pa to be beheaded. Byams-pa (Cha-mu-pa) and his brother Lhag-gsan (La-k'o-sang) and their brothers, younger and older, daughters, wives and mother were exiled after their father sByar-ra-nas was beheaded. The Manchus wrote that they \"set an example\" by forcing the Tibetans to publicly watch the executions of Tibetan rebels of slicing like Na-p'od-pa since they said it was the Tibetan's nature to be cruel. The exiled Tibetans were given as slaves to soldiers in Ching-chou (Jingzhou), K'ang-zhou (Kangzhou) and Chiang-ning (Jiangning) in the marshall-residences there. The Tibetan rNam-rgyal-grva-ts'an college administrator (gner-adsin) and sKyor'lun Lama were tied together with Lum-pa-nas and Na-p'od-pa on 4 scaffolds (k'rims-sin) to be sliced. The Manchus used musket matchlocks to fire 3 salvoes and then the Manchus strangled the 2 Lamas while slacing (Lingchi) Lum-pa-nas and Na-p'od-pa to death while they beheaded the 13 other rebels leaders. The Tibetan population was depressed by the scene and the writer of MBTJ continued to feel sad as he described it 5 years later. All relatives of the Tibetan rebels including little children were executed by the Qing Manchus except the exiled and deported family of sByar-ra-ba which was condemned to be slaves and most exiles sentenced to deportation died in the process of deportation. The public executions spectacle worked on the Tibetans since they were \"cowed into submission\" by the Qing. Even the Tibetan collaborator with the Qing, Polhané Sönam Topgyé (P'o-lha-nas) felt sad at his fellow Tibetans being executed in this manner and he prayed for them. All of this was included in a report sent to the Qing emperor at the time, the Yongzheng Emperor. Qing Han Chinese general Yue Zhongqi interviewed the Tibetan collaborator with the Qing, Polhané Sönam Topgyé (P'o-lha-nas) concerning his involvement in crushing the Tibetan rebels and sent a report to the Qing Yongzheng emperor on 17 August 1728.\nFor the Tibetan campaign, the Yongzheng Emperor sent an army of 230,000 led by Nian Gengyao against the Dzungars and their army of 80,000. Due to geography, the Qing army (although superior in numbers) was at first unable to engage their more mobile enemy. Eventually, they engaged the Dzungars and defeated them. This campaign cost the treasury at least eight million silver taels. Later in the Yongzheng Emperor's reign, he sent a small army of 10,000 to fight the Dzungars again. However, that army was annihilated and the Qing Empire faced the danger of losing control of Mongolia. A Khalkha ally of the Qing Empire would later defeat the Dzungars.\nFollowing the reforms of 1729, the treasury's income increased from 32,622,421 taels in 1721 to about 60 million taels in 1730, surpassing the record set during the Kangxi Emperor's reign; but the pacification of the Qinghai area and the defence of border areas were heavy burdens on the treasury. Safeguarding the country's borders cost 100,000 taels per year. The total military budget came up to about 10 million taels a year. By the end of 1735, military spending had depleted half the treasury, leaving 33.95 million taels. It was because of the cost of war that the Yongzheng Emperor considered making peace with the Dzungars.\nIdentification of Qing with China\nSince the Shunzhi Emperor's time, the Qing emperors had identified China and the Qing Empire as the same, and in treaties and diplomatic papers the Qing Empire called itself \"China\". During the Kangxi and Yongzheng emperors' reigns, \"China\" (Dulimbai Gurun in Manchu) was used as the name of the Qing Empire in official Manchu language documents, identifying the Qing Empire and China as the same entity, with \"Dulimbai Gurun\" appearing in 160 official diplomatic papers between the Qing Empire and the Russian Empire. The term \"China\" was redefined by the Qing emperors to be a multi-ethnic entity which included non-Han Chinese ethnic groups and their territories. China and Qing were noticeably and increasingly equated with each other during the Qianlong Emperor's reign, with the Qianlong Emperor and the Qing government writing poems and documents using both the Chinese name Zhongguo and the Manchu name Dulimbai Gurun. Compared to the reigns of previous Qing emperors such as the Yongzheng and Kangxi emperors, the use of China to refer to the Qing Empire appears most during the Qianlong Emperor's reign, according to scholars who examined documents on Sino-Russian relations.\nThe Yongzheng Emperor spoke out against the claim by anti-Qing rebels that the Qing were only rulers of Manchus and not China, saying \"The seditious rebels claim that we are the rulers of Manchus and only later penetrated central China to become its rulers. Their prejudices concerning the division of their and our country have caused many vitriolic falsehoods. What these rebels have not understood is the fact that it is for the Manchus the same as the birthplace is for the people of the central plain. Shun belonged to the Eastern Yi, and King Wen to the Western Yi. Does this fact diminish their virtues?\" (\nReligion\n|alt=Painting of people on a path in a large courtyard, flanked by soldiers, viewed from a distance]]\nCommoners throughout Qing China were extremely diverse and multi-ethnic because not every region underwent sinification under the Manchu's suzerain. In accordance to the Book of Rites, Manchus of Qing chose to respect the local's cultural heritage and decided not to force their subjects to acculturate and sinicize. Manchus of Qing acknowledged that each region had the prerogative to preserve their identity, heritage, and cultural tradition and their religious faith. Hence, each region was allowed to keep their beliefs and way of worshipping the heavens. On the other hand, since the commoners preserved their ways, Qing, Yongzheng in particular, highly encouraged that Manchu elites should also preserve their ethnic identity and their distinctive ways of worshipping the heaven as well. The Yongzheng Emperor stated: \"The Lord of Heaven is Heaven itself.... In the empire we have a temple for honouring Heaven and sacrificing to Him. We Manchus have Tiao Tchin. The first day of every year we burn incense and paper to honor Heaven. We Manchus have our own particular rites for honouring Heaven; the Mongols, Chinese, Russians, and Europeans also have their own particular rites for honouring Heaven. I have never said that he [Urcen, a son of Sunu] could not honour heaven but that everyone has his way of doing it. As a Manchu, Urcen should do it like us.\" Evidently, the Qing state practiced various religions, which was similar to the previous dynasty, the Ming. During the Ming, in the mid-1580s an Italian Jesuit, Matteo Ricci not only studied the Chinese language to understand the people and the Chinese culture, he also delved into the Confucian classics and adopted the scholar's official-literati robe during his stay near the Canton trading province. Introducing China to his religious faith was in Matteo Ricci's mission, and he successfully built a church in 1601 at Beijing, called Cathedral of Immaculate Conception. Johann Adam Schall von Bell, who was a German Jesuit, went to China in 1619, learned the Chinese language in 1623 in Macau, and was later appointed into the Imperial Astronomical Bureau in 1630 by the Ming, even after the fall of Ming to the rise of Qing, Schall's presence was welcomed by the Manchu of Qing and he was appointed as the head of the Imperial Astronomical Bureau. The accounts of Matteo establishing the institution of his Church during the Ming dynasty and Jesuits such as Schall who was able to acquire a bureaucratic position in the Qing's court make evident that China at one point did welcome things beyond its borders, such as religious faith that was brought by the missionaries. Even though the Catholic church condemned the practice of the Chinese rites in 1645 throughout China, Catholic missionaries continued their practice until the Rites Controversy was concluded in 1742 CE.\nThe Yongzheng Emperor was firmly against Christian converts among the Manchus. He warned them that the Manchus must follow only the Manchu way of worshipping Heaven since different peoples worshipped Heaven differently.\nIn 1724, the Yongzheng Emperor issued a decree proscribing Catholicism. This was followed by the persecution of Chinese Christians that steadily increased during the reign of the Yongzheng Emperor's son, the Qianlong Emperor.\nJan Jakob Maria wrote \"Nor did the Islamitic heretics escape the notice of this potentate. It has frequently been reported to me, he writes in a decree of the 7th of the fourth month (May 4) 1729 (Sh. h. 7), that these Mohammedans all follow one doctrine, that they use a peculiar language and dress, and constantly behave contrary to the laws, so that severe measures should be taken for their repression. But I desire that they shall be looked upon as my ordinary subjects, as \"babes of the dynasty\" (國家之赤子); for although they have their own mosques, and a peculiar language and religion handed down to them by their forefathers, they have the same manners and customs as the rest of the people; for their religion alone it would not do to prosecute them. There are, moreover, several state-servants among them, who are not without their good qualities. They muster strongest in Shensi, and there they are persecuted more than anywhere else, on account of their clubbing together to gamble, their secreting weapons, and for various other illegal acts. There they also unreservedly give expression to their wrath about the Imperial decrees forbidding the slaughter of horned cattle which are so indispensable to agriculture. They should therefore constantly be reminded to be kind and tolerant, not wantonly to oppress the weaker, nor by their greater intelligence to take in the ignorant, nor on the plea of their special religion to further their own interests, etc. Our will in this matter shall be proclaimed by the Viceroys and Governors throughout all the provinces.\"\nAccording to D.E.Mungello, Yongzheng, unlike his more cosmopolitan father Kangxi, adopted a strongly Sinified and nativist outlook grounded in Confucian principles of jiaohua and jiaoyang, thus regarding Christianity as heterodox and incompatible with loyalty expected from subjects. His position is laid out in a 1727 edict based on a memorial from the Nine Chief Ministers. The edict contrasts orthodox and unorthodox teachings, describing Buddhism, Daoism, and Christianity as parochial. Mungello writes that, this contrasted with Kangxi's openness to Jesuit scholarship, such as Figurist interpretations and comparisons between Leibniz’s binary arithmetic and the Yijing. The edict concludes with the assertion: \"China has the teachings of China [...] and the West has the teachings of the West [...] The teachings of the West certainly cannot be applicable in China, and, as for the teachings of China, how can they be applicable in the West?\"\nDuring the Kangxi era, it was known that the Jesuits at Peking cultivated a relationship with the fourteenth prince, whom they believed would become the next empepor. When Yongzheng won the throne, he spent the next three years eliminating and prosecuting his rivals and their supporters, among whom were the Jesuits.\nDestruction of ethnic minority autonomy\nThe Yongzheng Emperor appointed the Manchu official Ortai who violently abolished hereditary ethnic minority states such as those belonging to ethnic minority Miao people across southwest China in Yunnan, Guizhou and Guangxi.\nDeath and succession\nThe Yongzheng Emperor ruled the Qing Empire for 13 years before dying suddenly in 1735 at the age of 56. Legend holds that he was assassinated by Lü Siniang, a daughter or granddaughter of Lü Liuliang, whose family was executed for literary crimes against the Qing government. Another theory was that Lü Siniang was the Yongzheng Emperor's lover, and the real mother of the Qianlong Emperor, but he refused to let her become the empress.\nIt is generally accepted that he died while reading court documents, and it is likely that his death was the result of elixir poisoning from an overdose of the elixir of immortality he was consuming in the belief that it would prolong his life. According to Zhang Tingyu, Yongzheng on his deathbed exhibited symptoms of poisoning, and in the wake of his death, his successor the Qianlong Emperor evicted all Taoist priests from the palace, possibly as punishment for this incident.\nTo prevent a succession crisis like he had faced, the Yongzheng Emperor was said to have ordered his third son Hongshi (an ally of Yinsi) to commit suicide. He also devised a system for his successors to choose their heirs in secret. He wrote his chosen successor's name on two scrolls, placed one scroll in a sealed box and had the box stored behind the stele in the Qianqing Palace. He kept the other copy with him or hid it. After his death, the officials would compare the scroll in the box with the copy he had kept. If they were deemed identical, the person whose name was on the paper would be the new emperor.\nThe Yongzheng Emperor was interred in the Western Qing tombs  southwest of Beijing, in the Tai (泰) mausoleum complex (known in Manchu as the Elhe Munggan). His fourth son Hongli, then still known as \"Prince Bao (of the First Rank)\", succeeded him as the Qianlong Emperor. The Qianlong Emperor rehabilitated many figures who had been purged during his father's reign, including restoring honours to many of his uncles who were formerly his father's rivals in the succession struggle.\nFamily\nEmpress\n* Empress Xiaojingxian (孝敬憲皇后) of the Ula-Nara clan (烏拉那拉氏; 28 June 1681 – 29 October 1731), personal name Duoqimuli (多棋木理)\n** Honghui (弘暉), Prince Duan of the First Rank (端親王; 17 April 1697 – 7 July 1704), first son\n* Empress Xiaoshengxian (孝聖憲皇后) of the Niohuru clan (鈕祜祿氏; 12 January 1692 – 2 March 1777)\n** Hongli (弘曆), the Qianlong Emperor (乾隆帝; 25 September 1711 – 7 February 1799), fifth (fourth) son\nImperial Noble Consort\n* Imperial Noble Consort Dunsu (敦肅皇貴妃) of the Nian clan (年氏; ? – 23 December 1725)\n** Fourth daughter (15 April 1715 – June/July 1717)\n** Fuyi (福宜; 30 June 1720 – 9 February 1721), seventh son\n** Fuhui (福惠), Prince Huai of the First Rank (懷親王; 27 November 1721 – 11 October 1728), eighth son\n** Fupei (福沛; 12 June 1723 – ?), ninth son\n* Imperial Noble Consort Chunque (純愨皇貴妃) of the Geng clan (耿氏; December 1689/January 1690 – 27 January 1785)\n** Hongzhou (弘晝), Prince Hegong of the First Rank (和恭親王; 5 January 1712 – 2 September 1770), sixth (fifth) son\nConsort\n* Consort Qi (齊妃) of the Li clan (李氏; 1676 – 31 May 1739)\n** Princess Huaike of the Second Rank (和碩懷恪公主; 15 August 1695 – April/May 1717), second daughter\n*** Married Xingde (星德; ? – 1739) of the Manchu Nara clan in September/October 1712\n** Hongfen (弘昐; 19 July 1697 – 30 March 1699), second son\n** Hongyun (弘昀; 19 September 1700 – 10 December 1710), third (second) son\n** Hongshi (弘時; 18 March 1704 – 20 September 1727), fourth (third) son\n* Consort Ning (寧妃) of the Wu clan (武氏; ? – 25 June 1734), personal name Lingyuan (令媛)\n* Consort Qian (謙妃) of the Liugiya clan (劉佳氏; 1714 – 17 June 1767), personal name Xiangyu (香玉)\n** Hongyan (弘曕), Prince Guogong of the Second Rank (果恭郡王; 9 May 1733 – 27 April 1765), 10th (sixth) son\nConcubine\n* Concubine Mao (懋嬪) of the Song clan (宋氏; 1677 – October/November 1730)\n** First daughter (10 April 1694 – April/May 1694)\n** Third daughter (8 January 1707 – January/February 1707)\nNoble Lady\n* Noble Lady Guo (郭貴人)\n* Noble Lady Li (李贵人)\n* Noble Lady An (安贵人)\n* Noble Lady Hai (海贵人)\n* Noble Lady Zhang (张贵人)\n* Noble Lady Lao (老貴人)\nFirst Class Attendant\n* First Class Attendant Na (那常在)\n* First Class Attendant Li (李常在)\n* First Class Attendant Ma (馬常在)\n* First Class Attendant Chun (春常在)\n* First Class Attendant Gao (高常在)\n* First Class Attendant Chang (常常在)\n* First Class Attendant Gu (顧常在)\nSecond Class Attendant\n* Second Class Attendant Su (蘇答應)\n* Second Class Attendant Yun (雲答應)\nLady\n* Lady of Qixiang Palace (啟祥宮姑娘)\nMistress\n* Mistress Yi (伊格格)\n* Mistress Zhang (張格格)\n* Mistress Su (蘇格格)\nSee also\n* Chinese emperors family tree (late)\n* Treason by the Book\nNotes\nReferences\nCitations\nSources\n*\nFurther reading\n* Bartlett, Beatrice S. (1991). ''Monarchs and Ministers: The Grand Council in Mid-Ch'ing China, 1723–1820''. Berkeley: University of California Press. .\n*"
    }
  ]
}