{
  "content": [
    {
      "type": "text",
      "text": "# Yoshiwara\n\n, woodblock print, depicting the main street lined with tea houses, 1848-1849.]]\npainting by Katsushika Ōi]]\n]]\nis a red-light district in Tokyo, Japan. Established in 1617, Yoshiwara was one of three licensed and well-known famous  created during the early 17th century by the Tokugawa shogunate, alongside Shimabara in Kyoto in 1640 and Shinmachi in Osaka.\nCreated by the shogunate to curtail the tastes of and sequester the nouveau riche  (merchant) classes, the entertainment offered in Yoshiwara, alongside other licensed districts, would eventually originate geisha, who would become known as the fashionable companions of the  classes and simultaneously cause the demise of , the upper-class courtesans of the red-light districts.\nHistory\nEdo period\nMap of Yoshiwara from 1846\nMap of Yoshiwara as of 1905\nYoshiwara during the Taisho era in the 1920s\nThe licensed district of Yoshiwara was created in the city of Edo (present day Tokyo), near to the area today known as Nihonbashi, itself close to the beginning of the Tōkaidō road, the primary route to western Kyoto during the Edo period.\nIn 1656, due to the need for space as the city grew, the government decided to relocate Yoshiwara, with plans being made to move the district to its present location north of Asakusa on the outskirts of the city. The location corresponds to modern-day Senzoku 4-Chōme in Tokyo Taitō-ku. It was accessible via the Sanyo canal which was eventually filled in.\nHaving been established some decades earlier, the original Yoshiwara district burned down, along with much of the city, in the Great fire of Meireki of 1657; it was then rebuilt in its new location, named 'Shin Yoshiwara' ('New Yoshiwara'), the old location being known as 'Moto Yoshiwara' ('Original Yoshiwara'), though the moniker of 'new' was eventually dropped, with the rebuilt district becoming known simply as Yoshiwara.\nYoshiwara was home to some 1,750 women in the 18th century, with records of some 3,000 women from all over Japan at one time. Many were typically indentured to their brothel; if indentured by their parents, a larger advance payment would often be received. Though contracts of indenture often did not last more than five to ten years, the debt sometimes accrued by these women could keep them working there for much longer. However, a significant number either served out their contracts and married a client, went into other employment (including other forms of prostitution), or returned to their family homes. In these cases, the advanced payments a woman's parents received could be used to fund her dowry. Despite this, many women also died of sexually transmitted diseases, or following failed abortions, before completing their contracts.\nIf chosen to receive the correct training at a young age, a girl indentured to a brothel could become an apprentice to a high-ranking courtesan; when the girl was old enough and had completed her training, she would become a courtesan herself and work her way up the ranks. Another path to success and eventual freedom for a working woman in Yoshiwara was for a rich man to buy out her contract from the brothel, and thus keep her as his wife or mistress; a further path would be for a woman to work successfully enough that she could eventually buy her own freedom, though this was an uncommon and infrequent occurrence.\nSocial classes were not strictly divided in Yoshiwara; a commoner with enough money would be served as an equal to a samurai, and though samurai were discouraged from entering Yoshiwara, they often did so, the only requirement being that their weapons be left at the town's entrance. By law, brothel patrons were only allowed to stay for a night and a day at a time. Like all official policies for Yoshiwara, this was rarely enforced.\nFollowing its inception, Yoshiwara became a strong commercial area, with the fashions created in the town by prostitutes changing frequently and creating a great demand for merchants and artisans. Traditionally, prostitutes were supposed to wear only simple blue robes, but this was rarely enforced. In contrast, the highest ranking  (courtesans) came to be emblematic of the height of Edo period fashion, wearing colourful and expensive silk kimono alongside elaborate hairstyles and a number of hair accessories; these outfits frequently dictated the contemporary trends of fashion in Japan of the time.\n: Its cemetery is the resting place of thousands of prostitutes in Yoshiwara]]\nDespite the reputation of Yoshiwara and its highest-ranking courtesans, most prostitutes working in the area came from poor families, would be commonly exploited, and were so poor that, when they died, their bodies would be brought anonymously to Jōkan-ji temple and left at the back entrance, a proper burial being too expensive to afford. The temple therefore also became known as 'Nage-komi dera' ('Throw-away temple'); a memorial in the temple to thousands of anonymous prostitutes of Yoshiwara was consecrated in the Meiji era.\nModern Japan\nThe area had over 9,000 women in 1893, many of whom suffered from syphilis. In 1913, the area was damaged by an extensive fire, and further damaged to the point of near-obliteration a decade later by the 1923 Great Kantō earthquake. However, Yoshiwara remained in business as a traditional red-light district until prostitution was outlawed by the Japanese government in 1958 following World War II.\nThough technically illegal – with the definition of prostitution under the Prostitution Prevention Law being 'compensated penetrative sex with an unspecified person' other forms of sex work that do not violate this law continue to exist in the modern area of Yoshiwara, with the portion of the town near Minowa Station on the Hibiya Line, now known as Senzoku Yon-chōme, retaining a large number of soaplands and other façades for sexual services.\nPeople and services\n, folio from the series  of the Yoshiwara, published 1776 by Tsutaya Jūzaburō and Yamazaki Kinbei]]\nPeople involved in  would include  (comedians), kabuki actors, dancers, dandies, rakes, tea-shop girls, Kanō (painters of the official school of painting), courtesans who resided in  (green houses) and geisha in their .\nThe sex workers found within Yoshiwara would consist of  (; the district's rank and file prostitutes),  (young female students),  (senior female students),  (lower-ranking courtesans),  (high-ranking courtesans just below ),  (high-ranking courtesans), ,  (older chaperones for an ), and the  who replaced the  when they were priced out of the market.\nIn addition to courtesans, there were also geisha, apprentice geisha,  geisha (male geisha),  (patrons of geisha), and the female managers of teahouses and . The lines between geisha and courtesans were, officially, sharply drawn soon after the inception of the geisha profession; laws were passed forbidding a geisha from being sexually involved with a customer. In reality a number of exceptions existed, with geisha ranging from little more than  themselves to geisha who offered only artistic entertainment and companionship.\nToday\nToday, Yoshiwara roughly corresponds to . Yoshiwara today looks very similar to many other neighborhoods of modern Tokyo, but it retains legacies to its past, as it contains commercial establishments engaged in the sex trade although police cracked down on the soaplands in 2007. The street grid pattern and the temples and shrines from times past still exist.\nIn popular culture\n* The second act of Pietro Mascagni's opera Iris (1898) is set in Yoshiwara.\n* \"Yoshiwara\" is the name of the futuristic red-light district in the classic silent German film Metropolis (1927).\n* The 1937 French film Yoshiwara, directed by Max Ophüls, is set in Yoshiwara in the mid-19th century.\n* The 1956 Japanese film Street of Shame, directed by Kenji Mizoguchi, is set in Yoshiwara in the mid-20th century.\n*The 1955 Japanese film Growing Up, directed by Heinosuke Gosho, is set in Yoshiwara in the early years of the Meiji era.\n* Yoshiwara regularly appears in the anime Gin Tama.\n* In a side chapter of Rurouni Kenshin: To Rule Flame, Shishio Makoto met his lover Komagata Yumi in Yoshiwara. Yumi was working as a high-ranking  there.\n* In the  manga , the protagonist Haru Hanamori time travels to Edo period Yoshiwara and becomes an .\n* French jazz-progressive band Ghost Rhythms' disc Live at Yoshiwara (2019), on Cuneiform Records, is named after the Yoshiwara Club in the classic silent German film Metropolis (1927).\n* The Japanese soundtrack for the video game Silent Hill 4: The Room, composed by Akira Yamaoka, includes the audio drama Inescapable Rain in Yoshiwara narrated by Teisui Ichiryusai. The song is a  set in the Edo era about a woman who is deceived and sends her daughter to do maid work for a relative, not knowing she will be forced to work in a brothel.\n* The red-light district in Yoshiwara serves as the setting for the second season of the anime series Demon Slayer: Kimetsu no Yaiba. The finale of said arc also makes an allusion to the 1913 fire.\n* The red-light district of Yoshiwara was a recurring setting in the manga Jin by Motoka Murakami, as well as the 2009–2011 TV series Jin.\n* The 1913 fire is referenced in J-pop group Nobodyknows's song \"Heroes Come Back!!\" which served as the first opening of Naruto: Shippuden\n* In 2012, Asa, a music producer in Japan, released a song called \"Yoshiwara Lament\", sung by Kasane Teto, a vocal for the UTAU software, with spoken lines by Oyamano Mayo, Teto's Voice Provider. It is about a prostitute who lives in Yoshiwara. It would go on to receive over 1 Million views on YouTube, and received a cover performed by famous Enka singer Sachiko Kobayashi in 2017 to celebrate the song's 5th Anniversary.\nSee also\n*Bousbir\n*Ukiyo-e\nReferences\nBibliography\n*Waley, P. Tokyo Now & Then. First Edition (1984). John Weatherhill, Inc. .\nExternal links\n*\n* [https://web.archive.org/web/20030605144624/http://www.artgallery.sbc.edu/ukiyoe/yoshiwara.html Information about the Yoshiwara District]\n* [http://www.oldtokyo.com/yoshiwara.html Pictures and Information]\n* [http://www.oac.cdlib.org/affiliates/images/grunwald/gcga_1965.30.135_1_2.jpg Image of Yoshiwara]\n* [https://web.archive.org/web/20100519163138/http://www.ginacolliasuzuki.com/author/the-glittering-world-of-the-japanese-courtesan.html The Glittering World of the Japanese Courtesan?]\n* [http://shunga.honolulumuseum.org/2012/index.php?page=52 What was the Yoshiwara District?]  by Honolulu Museum of Art\n* [http://shunga.honolulumuseum.org/2012/index.php?page=63 The Social Structure of the Yoshiwara Before 1750]  by Honolulu Museum of Art\n* [http://shunga.honolulumuseum.org/2012/index.php?page=77 The Social Structure of the Yoshiwara After the 1760s]  by Honolulu Museum of Art\n* [http://shunga.honolulumuseum.org/2013/index.php?page=104 The Gentrification of the Yoshiwara]  by Honolulu Museum of Art"
    }
  ]
}