{
  "content": [
    {
      "type": "text",
      "text": "# Youngest British soldier in World War I\n\nThe youngest authenticated British soldier in World War I was twelve-year-old Sidney Lewis, who fought at the Battle of the Somme in 1916. Lewis' claim was not authenticated until 2013. In World War I, a large number of young boys joined up to serve as soldiers before they were eighteen, the legal age to serve in the army. It was previously reported that the youngest British soldier was an unnamed boy, also twelve, sent home from France in 1917 with other underage boys from various regiments.\nGeorge Maher\nGeorge Maher (20 May 1903 – 27 July 1999) at age thirteen lied to a recruiting officer, claiming he was eighteen. He joined up with the 2nd Battalion King's Own Royal Lancaster Regiment. In the front lines, Maher began crying during heavy shelling. He was taken before an officer of his regiment when his young age was discovered and subsequently locked in a train with a number of other underage boys. Maher said, \"The youngest was twelve years old. A little nuggety bloke he was, too. We joked that the other soldiers would have had to have lifted him up to see over the trenches\".  Maher's story was first reported in Richard van Emden's 1998 book Veterans: the last survivors of the Great War and was later featured in Last Voices of World War 1, a 2009 television documentary. The boy Maher met was formerly reported as the youngest British soldier in World War I, but the claim has never been authenticated.\nSidney Lewis\nSidney George Lewis (24 March 1903 – 1969) enlisted in the East Surrey Regiment in August 1915 at the age of twelve. His parents had no idea where he was. He fought in the Battle of the Somme in 1916, then aged thirteen, in the 106th Machine Gun Company of the Machine Gun Corps. Lewis fought for six weeks in the Battle of Delville Wood which saw some of the worst casualties on the Somme. His mother was told where her son was by a comrade home on leave, and she demanded that the War Office release him. It asked her for his birth certificate and discharged the boy. Lewis was awarded the Victory Medal and the British War Medal. He re-enlisted in 1918 and served with the army of occupation in Austria. He joined the police in Kingston upon Thames after the war and served in bomb disposal during World War II. Later, he ran a pub in Frant, East Sussex. He died in 1969.\nAlthough World War I army recruiters often turned a blind eye to underage recruits, another factor may have been Lewis's mature appearance. He was a tall heavily built boy, who would grow to  as an adult. The minimum height requirement of the British Army at the time was only .\nLewis' claim has been authenticated by the Imperial War Museum after research by van Emden uncovered the evidence, including family papers and Lewis's birth certificate. The family papers have been donated to the museum by Lewis' surviving son. Lewis' story was also found to have been reported in newspapers at the time.\nOthers\nAccording to the BBC documentary Teenage Tommies (first broadcast 2014), the British Army recruited 250,000 boys under eighteen during World War I. They included Horace Iles, who was shamed into joining up after he was handed a white feather by a woman when he was fourteen. He died at the Battle of the Somme at the age of sixteen.\nAlso signing up as a private at the age of fourteen was Reginald St John Battersby, who was promoted to 2nd Lieutenant at the insistence of his father and headmaster, who thought that his rank was inappropriate for a middle-class boy. Battersby was wounded by machine gun fire while he was leading his men over the top at the Somme. Three months later, he lost a leg to shellfire.\n14-year-old Valentine Strudwick enlisted in 1915. He was killed in action in Belgium at age 15.\nIt seems the East Surrey Regiments were happy to have young recruits. It was said that John Masters of Cowper Road Wimbledon told his real age when signing up and was told to walk around the block and do some maths to make him older. Whether this was a true story we will never know but at the age of 13 years and 8 months John Masters born William Masters in Tooting Wandsworth in 1902 signed up to the East Surrey Regiment and was sent to the front twice before his 15th birthday as reported in the Wimbledon Borough News on the 8th July 1916, page 2, under the heading of the Great War. The article stated, The boy is most keen of serving his country and begged that no attempt should be made to get him out of the Army as his great ambition was to get to the front and do his bit, and to judge from his letters though he has seen active service at the front so young his enthusiasm is no whit abated. John returned home without injury and would serve in the Wimbledon Home Guard in World War II.\nSee also\n*Momčilo Gavrić, in Serbian military from age eight; youngest soldier in World War I in any of the nations which fought in World War I.\n*John Condon, from Waterford, Ireland: incorrectly believed to have been the youngest Allied soldier killed (age 14), but later found to have been age 17 at his death.\nReferences\nExternal links\n*[http://www.loyalregiment.com/henry-and-thomas-c-marshall/ Private Henry Marshall − bandsman of the 5th Battalion Loyal North Lancashire Regiment]  — reported to be the youngest Territorial soldier of WW1."
    }
  ]
}