{
  "content": [
    {
      "type": "text",
      "text": "# Young Woman Engineer of the Year Award\n\nUnited Kingdom\n| presenter =\n| reward =\n| year =\n| holder =\n| website =\n}}\nThe Young Woman Engineer of the Year Awards are presented at the Institution of Engineering and Technology, London, England. Part of the IET Achievement Medals collection, the award was launched in 1978, and was originally known as the Girl Technician of the Year, until renamed in 1988. The award was first sponsored by the Caroline Haslett Memorial Trust, which was formed in 1945. It is now funded and sponsored by the Institution of Engineering and Technology and  Women's Engineering Society. Awarded to young female engineering apprentices in the UK.\nRecipients of the Young Woman Engineer of the Year Awards\n* 2020 Ella Podmore\n* 2019 Ying Wan Loh\n*2018 Sophie Harker\n* 2017 Ozak Esu\n* 2016 Jenni Sidey\n* 2015 Orla Murphy\n* 2014 Naomi Mitchison\n* 2013 Abbie Hutty\n* 2012 Yewande Akinola\n* 2011 Charlotte Joyce\n* 2010  Arlene McConnell\n* 2006 Katy Deacon\nRelated awards\nThe Mary George Memorial Prize for Apprentices\nMary George CBE was the Director and Secretary of the Electrical Association for Women. The prize is given annually to a young woman apprentice.\nThe winners so far have included:\n* 2019 Samantha Magowan\n*2018 Shajida Akthar\n* 2017 Jamie D’Ath\n* 2016 Gemma Dalziel\n* 2015 Emma Goulding\n* 2014 Jessica Bestwick\n* 2013 Sara Underwood\n* 2012 Jessica Jones\n* 2011 Laurie-Ann Smith\n* 2004 Katy Deacon\nWomen’s Engineering Society Prize\nThe Women's Engineering Society Prize is awarded to a young woman engineer who demonstrates exceptional talent within engineering alongside a commitment to improving diversity within engineering.\nThe winners so far have included:\n* 2022 Eneni Bambara-Abban\n* 2021 Eftychia Koursari\n* 2020 Shrouk El-Attar\n*2019 Dr. Claire Lucas, Associate Professor of Systems and Information Engineering at the University of Warwick\n*2018 Lorna Bennet\n* 2017 Larissa Suzuki\n* 2016 Bethan Murray\n* 2015 Helen Cavill\n* 2014 Lucy Ackland\n* 2013 Yasmin Ali\n* 2012 Charlotte Tingley\n* 2011 Kelly Walker\n* 2009 Farah Azirar\n* 2008 Bijal Thakore\n* 2007 Mamta Singhal\n* 2006 Maire McLoone\n* 2005 Rachael Johnson\n* 2004 Claire Woolaghanwon\nGender Diversity Ambassador Award\nThe Gender Diversity Ambassador Award was introduced in 2019 to recognise an individual who has worked for much of their career to support gender equality in engineering.\nWinners:\n* 2019 Wing Commander Glynis Dean, Royal Air Force Youth and Diversity Team.\nSee also\n* List of engineering awards\nReferences"
    }
  ]
}