{
  "content": [
    {
      "type": "text",
      "text": "# Young Voters for the President\n\nYoung Voters for the President was an entity created by Richard Nixon's 1972 campaign for President of the United States to mobilize youth voters in support of Nixon's reelection.\nAs of March 1972, only 22 percent of voters between the ages of 18 and 24 identified with the Republican Party. Young Voters for the President was created by public relations consultant Ken Rietz, whose plan for capturing the support of younger voters for the Republican Party in the 1972 presidential election was brought to the attention of the White House by United States Senator Bill Brock. Rietz was subsequently hired as director of the new group, leading a full-time staff of 120 persons, plus what was claimed to be 400,000 volunteers. Pam Powell, a 24-year-old Nixon supporter and the daughter of actor Dick Powell, was retained as chair of the group, becoming its public face.}}\nRietz identified that young voters were enthusiastic about some of Nixon's policies – such as ending military conscription – but ambivalent about the president himself and he, therefore, embarked on an effort to bridge the gap between the two. Rietz also determined that non-college youth were more likely to support Nixon than college-enrolled youth and that the former group significantly outnumbered the latter. Outreach efforts by Young Voters for the President have been credited with helping Nixon capture 48 percent of 18 to 24 year-old voters, and 52 percent of under 30 voters, in the 1972 presidential contest. Nixon ultimately won that election with roughly 61-percent of the popular vote and 97-percent of the electoral vote.\nHunter S. Thompson wrote extensively about Nixon's youth base and was, according to Boston University's Seth Blumenthal, known to have \"despised them\".\nNotes\nReferences\nExternal links\n* [https://cdn.theatlantic.com/assets/media/img/photo/2018/02/presidents/p06_AP364382576484/main_1500.jpg?1518037464 Photograph of Nixon with Pam Powell and Sammy Davis Jr.]"
    }
  ]
}