{
  "content": [
    {
      "type": "text",
      "text": "# Your Squaw Is on the Warpath\n\n}}\nYour Squaw Is on the Warpath is thirteenth solo studio album by American country music singer-songwriter Loretta Lynn. It was released on February 17, 1969, by Decca Records.\nThe album includes cover versions of hit country songs, including \"Harper Valley P.T.A.\" by Jeannie C. Riley and \"Kaw-Liga\" by Hank Williams, and the 1968 hit \"I Walk Alone\" by Marty Robbins.\nThe song \"Barney\" was on the original 1969 pressings of the album. The Salem cigarette company filed a claim that the music was a violation of their copyrighted theme for their commercials. As a result, the original LP was recalled and then re-released without this song on it.\nCritical reception\n}}\nThe review published in the March 8, 1969 issue of Billboard said, \"It appears Miss Lynn can do no wrong when it comes to unique and fine performances and top sales. The title tune of this hot LP  went right to the top of the country charts and this package of clever material will fast follow suit. Among the highlights are \"You've Just Stepped In\", \"Kaw-Liga\", and the compelling Teddy Wilburn ballad, \"Taking the Place of My Man\".\"\nCashbox published a review in the March 1, 1969 issue that said, \"Your Squaw Is on the Warpath is destined to beat a path straight to the charts for Loretta Lynn. Titled after her recent country chart topper, this album contains the classic \"Kaw-Liga\" as well as the contemporary hit \"Harper Valley P.T.A.\" Watch charts for rapid appearance.\"\nThe album was given a positive review by AllMusic, which gave the album 4 out of 5 stars, but criticized the album cover, calling it \"one of the classic politically incorrect album covers.\"\nCommercial performance\nThe album peaked at No. 2 on the US Billboard Hot Country LP's chart and No. 168 on the US Billboard Top LP's chart.\nThe album's first single, \"You've Just Stepped In (From Stepping Out on Me)\" was released in May 1968 and peaked at No. 2 on the US Billboard Hot Country Singles chart. The second single, \"Your Squaw Is on the Warpath, was released in September 1968 and peaked at No. 3.\nRecording\nRecording sessions for the album took place at Bradley's Barn in Mount Juliet, Tennessee, beginning on May 9, 1968. Three additional sessions followed on August 30, November 18 and 19. \"Living My Lifetime for You\" was recorded during the January 9 session for 1968's Fist City. \"(This Bottle's) Taking the Place of My Man\" was recorded during the April 20, 1967 session for Lynn's 1967 album, ''Singin' with Feelin'''.\nTrack listing\n| extra1 = November 18, 1968\n| length1 = 2:45\n| title2 = Let Me Go, You're Hurtin' Me\n| writer2 =\n| extra2 = May 9, 1968\n| length2 = 2:35\n| title3 = Harper Valley PTA\n| writer3 = Tom T. Hall\n| extra3 = November 19, 1968\n| length3 = 3:10\n| title4 = I Walk Alone\n| writer4 = Herbert Wilson\n| extra4 = November 19, 1968\n| length4 = 2:54\n| title5 = He's Somewhere Between You and Me\n| writer5 =\n| extra5 = November 19, 1968\n| length5 = 2:54\n}}\n*Note: \"Barney\" was only included on first pressings of the album. It was removed from all subsequent pressings and was also excluded from the album's digital download release.\nPersonnel\nAdapted from the Decca recording session records.\n*Harold Bradley – electric bass guitar\n*Owen Bradley – producer\n*Floyd Cramer – piano\n*Ray Edenton – acoustic guitar\n*Larry Estes – drums\n*Buddy Harman – drums\n*Junior Huskey – bass\n*The Jordanaires – background vocals\n*Loretta Lynn – lead vocals\n*Grady Martin – guitar, lead electric guitar\n*Harold Morrison – banjo\n*Norbert Putnam – bass\n*Hal Rugg – steel guitar\n*Pete Wade – guitar\n*Teddy Wilburn – background vocals\n*Joe Zinkan – bass\nCharts\nAlbum\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (1968)\n! scope=\"col\"| Peakposition\n|-\n! scope = \"row\" | US Hot Country LP's (Billboard)\n| 2\n|-\n! scope = \"row\" | US Top LP's (Billboard)\n| 168\n|-\n|}\nSingles\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n! scope=\"col\" rowspan = \"2\" | Title\n! scope=\"col\" rowspan = \"2\" | Year\n! scope=\"col\" colspan=\"2\"| Peak position\n|-\n! USCountry\n! scope=\"col\" |CANCountry\n|-\n! scope = \"row\" | \"You've Just Stepped In (From Stepping Out on Me)\"\n| rowspan = \"2\" | 1968\n| 2\n| —\n|-\n! scope = \"row\" | \"Your Squaw Is on the Warpath\"\n| 3\n| 17\n|-\n|}\nReferences"
    }
  ]
}