{
  "content": [
    {
      "type": "text",
      "text": "# YouTube Awards__disambig_2\n\n| year2          =\n| most_nominations=William Sledd (2)\n| website        =\n}}\nThe YouTube Awards (also known as the YouTube Video Awards) was a promotion run by YouTube to recognize the best user-generated videos of the year. The awards were presented twice, in 2007 and 2008, with winners being voted for by the site's users from shortlists compiled by YouTube staff. YouTube was founded on February 14, 2005, and quickly began to grow – by July 2006, traffic to the site had increased by 297 percent. As a result of this success, YouTube launched its own awards promotion in March 2007 to honor some of the site's best videos. Seven shortlists were compiled, with ten videos per shortlist. Users were invited to vote for the winners over a five-day period at a dedicated web page. Singer Damian Kulash, whose band OK Go won in the Most Creative category for their music video Here It Goes Again, said that receiving a YouTube Award was a surreal honor and that the site was changing culture \"quickly and completely\".\nThe YouTube Awards returned the following year, to commemorate the best videos of 2007. That year, the number of categories was expanded from seven to twelve, while the number of videos per shortlist was reduced from ten to six. Critics noted that unlikely newcomers, such as Battle at Kruger and Stop the Clash of Civilizations by Avaaz, had triumphed over more established videos, such as I Got a Crush...On Obama and Leave Britney Alone! Reaction to the YouTube Awards was generally negative. In 2007, commentators questioned why a promotion to recognize the best videos of 2006 was taking place so late into the year, and contrasted the awards with the similar Vloggies. Attention was also drawn to the timing of the 2007 awards: five days after media conglomerate Viacom had filed a $1&nbsp;billion lawsuit against YouTube for copyright infringement. Technology evangelist Don Dodge suggested that the awards were an attempt by YouTube to highlight content on their website that did not violate copyrights before the case went to trial.\nBackground\nYouTube was founded by Chad Hurley, Steve Chen and Jawed Karim, three former employees of PayPal. The website was activated on February 14, 2005, and quickly began to grow – in the six months to July 2006, traffic to the site grew by 297 percent. In October that year, Google bought YouTube for ; two months later, Time selected \"You\" as their 2006 Person of the Year, to recognize the growth of user-generated content on sites such as YouTube. Reflecting on the year, Jamie Byrne, YouTube's head of product marketing, remarked: \"[2006] was really a pioneering year for online video and for user-generated content.\" According to comScore Media Metrix, the website attracted 133.5&nbsp;million visitors worldwide during January 2007.\n2007 Awards\nAs a result of the growth and success achieved during 2006, YouTube launched its own awards promotion in March 2007 to recognize the best user-generated videos of the previous year. The launch of the YouTube Awards was formally announced via a press release on March 18. Awards were to be presented in seven categories: Most Creative, Most Inspirational, Best Series, Best Comedy Video, Best Music Video, Best Commentary and Most Adorable. Ten videos were shortlisted in each category, with the shortlists having been compiled by the site's staff. Byrne explained: \"We wanted to call out some of the most popular videos and let the users choose which ones deserve some additional recognition.\" YouTube users were invited to vote by visiting a dedicated webpage, which went live the following day, March 19. Users voted by ranking the ten videos in each category in order of preference, and could see what the up-to-date rankings were in real-time – Ben Fritz of Variety said that this made the process transparent.\nVoting lasted for five days, closing on March 23; winners were announced two days later. Their prize was a trophy (a large, glass Play Button on a heavy, metal base) and prominence for their winning video on YouTube. American rock band OK Go won the Most Creative award for their music video Here It Goes Again. Accepting the award, lead singer Damian Kulash said that it was a surreal honor and that YouTube was changing culture \"quickly and completely\". Singer-songwriter Terra Naomi, whose song \"Say It's Possible\" won in the Best Music category, thanked the voters, saying: \"The YouTube community has really embraced me; it means a lot to me.\" Naomi—who had signed a record deal with Island Records two months earlier—was 2007's only female winner. The remaining five winners were the Free Hugs Campaign (Most Inspirational), Ask a Ninja (Best Series), Smosh (Best Comedy), TheWineKone (Best Commentary) and Kiwi! (Most Adorable).\nWinners\n's music video Here It Goes Again was voted the most creative upload of the year.|alt=Color photograph of OK Go performing live in 2006]]\nfor their sketch Stranded.|alt=Color photograph of Ian Hecox and Anthony Padilla of Smosh in April 2010]]\nwon in the Best Music category for her song \"Say It's Possible\".|alt=Color photograph of Terra Naomi performing live in 2007]]\n(creator Juan Mann pictured) was voted the most inspirational video of 2006.|alt=Color photograph of a man holding a large sign saying \"FREE HUGS\" in a mall]]\n{|class=wikitable\n|+2007 YouTube Awards winners and nominations\n|-\n!scope=col style=\"width:50%\"|Most Creative\n!scope=col style=\"width:50%\"|Most Inspirational\n|-\n|valign=top|\n* (OkGo)\n** (mattharding2718)\n** (lassegg)\n** (NK5000)\n** (paravonian)\n** (Brt9003)\n** (MadV)\n** (snaketar)\n** (VancouverFilmSchool)\n** (pimplywimp)\n|valign=top|\n* (PeaceOnEarth123)\n** (Bye2Love)\n** (lokimdog)\n** (MHarris1920)\n** (worldofjeff)\n** (bfnmusic)\n** (taragolden)\n** (bbenefiel)\n** (tobeornot2b)\n** (nyOPERAguy)\n|-\n!scope=col style=\"width:50%\"|Best Series\n!scope=col style=\"width:50%\"|Best Comedy Video\n|-\n|valign=top|\n* (digitalfilmmaker)\n** (WilliamSledd)\n** (blamesocietyfilms)\n** (lonelygirl15)\n** (impytherap)\n** (Blendtec)\n** (valsartdiary)\n** (Zanzibar19)\n** (virtualmagician)\n** (soupcameron)\n|valign=top|\n* (smosh)\n** (HappySlip)\n** (BaratsAndBereta)\n** (aconover)\n** (dontbethatguyfilms)\n** (DCLugi)\n** (MediocreFilms)\n** (derrickcomedy)\n** (LisaNova)\n** (Zebro)\n|-\n!scope=col style=\"width:50%\"|Best Music Video\n!scope=col style=\"width:50%\"|Best Commentary\n|-\n|valign=top|\n* (terranaomi)\n** (GiR2007)\n** (jaybrannan)\n** (Nandrews)\n** (mrpitifulband)\n** (chudnovsky)\n** (periurban)\n** (RonnieShellist)\n** (DukeRightious)\n** (RyanLeslieTV)\n|valign=top|\n* (thewinekone)\n** (MarkDayComedy)\n** (Zipster08)\n** (Paperlilies)\n** (renetto)\n** (boh3m3)\n** (geriatric1927)\n** (Blunty3000)\n** (mrpregnant)\n** (littleloca)\n|-\n!scope=col style=\"width:50%\" colspan=\"2\"|Most Adorable\n|-\n|valign=top colspan=\"2\"|\n* (Madyeti47)\n** (sonoman)\n** (spudgy)\n** (sutatabo)\n** (nsayer)\n** (freejavaman)\n** (phathune)\n** (arikp)\n** (unobb)\n** (Adreamer323)\n|}\nReception\nReaction to the 2007 YouTube Awards was generally negative. A common criticism from writers and Mashable founder Pete Cashmore was the late date of the promotion, in that it was an event honoring 2006 videos in March 2007. Steve O'Hear of ZDNet proposed that the awards should have taken place closer to Time announcing of their 2006 Person of the Year. The five-day voting system was also panned. Journalist Virginia Heffernan described it as \"rushed and almost certainly screwy\", while Eric Auchard of Reuters remarked that asking users to vote for their favorite videos was anachronistic, since the site's five-star ratings system already tracked which videos were the most popular.\nBlogger Robert Scoble compared the YouTube Awards to his own video awards show, the Vloggies, which had taken place six months earlier, and suggested that YouTube had copied his idea. Josh Lowensohn of CNET also compared the YouTube Awards to the Vloggies, arguing that the former was not a new idea. Lowensohn additionally criticized the prizes that the winners received, remarking: \"I'd like to see YouTube offer some sort of cash or video camera prize.\"\nCommentators also noted the timing of the announcement of the 2007 awards: five days after media conglomerate Viacom had filed a $1&nbsp;billion lawsuit against YouTube for copyright infringement. Technology evangelist Don Dodge suggested that the awards were an attempt by YouTube to highlight content on their website that did not violate copyrights before the case went to trial. Dodge explained that he had been part of a similar program whilst at Napster, and that the awards might demonstrate to the courts that there was substantial non-infringing use of the website. Cashmore agreed with Dodge's assessment, pointing out that the awards were months too late, had no sponsor, and were concluded within a week. Writing for the Associated Press, Jake Coyle similarly described the awards as \"a quick, hasty process\".\n2008 Awards\nThe YouTube Awards returned the following year to recognize the best videos of 2007, and were announced via a post on YouTube's official blog on March 13, 2008. As with the previous year, shortlists were compiled by YouTube's staff, based on the number of views and general buzz – in total, the nominated videos had a combined view count of nearly a quarter of a billion. For the 2008 Awards, five new categories were added (Best Sports, Best Political, Best Eyewitness, Best Short Film and Best Instructional), and the shortlists were reduced from ten videos to six. The voting process through which users selected the winners was also changed: to remove potential bias, the featured thumbnail and order of the categories changed randomly each time the voting page was refreshed. Users could vote once per day until March 19; the winners were announced on March 21. At this time, hundreds of thousands of users had cast votes.\nIn some categories, the winning videos had not been the favorites. In the Best Eyewitness category, Battle at Kruger, described by The Guardian as an unlikely newcomer, won against the \"famous\" footage of the University of Florida Taser incident. Similarly, a video by YouTube channel Barely Political, I Got a Crush...On Obama, had been viewed more than seven&nbsp;million times and had spawned worldwide media attention by the time it was nominated in the Best Political category. Despite this, the award went to Stop the Clash of Civilizations, a more serious-minded video by global organization Avaaz. Aaron Ferstman, a spokesman for YouTube, praised Avaaz's video for dealing with \"serious issues like discrimination&nbsp;... in kind of a neat way that speaks to young people.\" He also noted that Stop the Clash of Civilizations was the only Best Political nominee not related to the 2008 United States presidential election. In the Best Commentary category, Michael Buckley's video LonelyGirl15 is Dead! beat Leave Britney Alone! by Internet star Cara Cunningham. In an interview with MSNBC, Cunningham applauded Buckley's success, saying: \"Congratulations to him!\". Ferstman remarked that the races for both the Best Political and Best Commentary awards had been close.\nThe 2008 promotion was the final time that the YouTube Awards were presented. The awards were retired in 2009, with YouTube choosing instead to focus on YouTube Live and the YouTube Symphony Orchestra, both of which had been launched towards the end of the previous year.\nWinners\nsaid it was \"definitely exciting\" and \"really an honor\" to win the 2008 Best Music Award.|alt=Head-and-shoulders color photograph of Tay Zonday in 2009]]\n's video LonelyGirl15 is Dead! won in the Best Commentary category.|alt=Head-and-shoulders color photograph of Michael Buckley in 2010]]\nfor his video Potter Puppet Pals in \"The Mysterious Ticking Noise\".|alt=Head-and-shoulders color photograph of Neil Cicierega in 2010]]\nwon a YouTube Award in 2008 for his video on how to solve a Rubik's Cube.|alt=Color photograph of Dan Brown giving a talk in 2012]]\n{|class=wikitable\n|+2008 YouTube Awards winners and nominations\n|-\n!scope=col style=\"width:50%\"|Best Music\n!scope=col style=\"width:50%\"|Most Creative\n|-\n|valign=top|\n* (TayZonday)\n** (yurilane)\n** (lisalavie1)\n** (vegetableorchestra)\n** (miarose)\n** (spencer7910)\n|valign=top|\n* (notsonoisy)\n** (eggman913)\n** (PhotoAnimationGuy)\n** (tracecats)\n** (OneManSho)\n** (EclecticAsylumArt)\n|-\n!scope=col style=\"width:50%\"|Best Web Series\n!scope=col style=\"width:50%\"|Best Sports\n|-\n|valign=top|\n* (watchtheguild)\n** (Manintheboxshow)\n** (MyDamnChannel)\n** (CollegeHumor)\n** (waverlyflams)\n** (wwwBLACK20com)\n|valign=top|\n* (davetheknave)\n** (groms)\n** (IkeiUnderground)\n** (TeamFlightBrothers)\n** (etchedintime)\n** (priscadupontandco)\n|-\n!scope=col style=\"width:50%\"|Best Political\n!scope=col style=\"width:50%\"|Best Eyewitness\n|-\n|valign=top|\n* (AvaazOrg)\n** (barelypolitical)\n** (ParkRidge47)\n** (explorehuckabee)\n** (davisfleetwood)\n** (EmergencyCheese)\n|valign=top|\n* (Jason275)\n** (GainesvilleSun)\n** (TornadoVideosdotnet)\n** (JUVENILEBIRDS)\n** (utherexplorer)\n** (ryanremigiodotcom)\n|-\n!scope=col style=\"width:50%\"|Most Inspirational\n!scope=col style=\"width:50%\"|Best Short Film\n|-\n|valign=top|\n* (texascountryreporter)\n** (mwesch)\n** (Muradaldin)\n** (foureyedmonsters)\n** (maddogza)\n** (carnegiemellonu)\n|valign=top|\n* (sheltonfilms)\n** (andrewhu)\n** (EOG)\n** (juliapot)\n** (DarkHeartProductions)\n** (eightgr)\n|-\n!scope=col style=\"width:50%\"|Best Commentary\n!scope=col style=\"width:50%\"|Best Comedy\n|-\n|valign=top|\n* (WHATTHEBUCKSHOW)\n** (AngryLittleGirI)\n** (WilliamSledd)\n** (mememolly)\n** (olinkalex)\n** (itschriscrocker)\n|valign=top|\n* (NeilCicierega)\n** (liamkylesullivan)\n** (P0YKPAC)\n** (omovies)\n** (picnicface)\n** (ThoseLilRabbits)\n|-\n!scope=col style=\"width:50%\"|Best Instructional\n!scope=col style=\"width:50%\"|Most Adorable\n}}"
    }
  ]
}