{
  "content": [
    {
      "type": "text",
      "text": "# Yuxian (Qing dynasty)\n\n| death_place   = Lanzhou, Gansu, Qing China\n|office      =  Provincial Governor of Shandong\n|term_start  =  February 1899\n|term_end    =  February 1900\n|predecessor =  Zhang Rumei (張汝梅)\n|successor   =  Yuan Shikai\n|office1     =  Provincial Governor of Shanxi\n|term_start1 =  February 1900\n|term_end1   =  26 September 1900\n|predecessor1=  Deng Huaxi (鄧華熙)\n|successor1  =  Xiliang\n| blank1 = Clan name\n| data1 = Yanja (顔扎氏)\n| blank2 = Courtesy name\n| data2 = Zuochen (佐臣)\n|allegiance =\n|battles = Boxer Rebellion\n}}\nYuxian (1842–1901) was a Manchu high official of the Qing dynasty who played an important role in the violent anti-foreign and anti-Christian Boxer Rebellion, which unfolded in northern China from the fall of 1899 to 1901. He was a local official who rose quickly from prefect of Caozhou (in unruly southwestern Shandong) to judicial commissioner and eventually governor of Shandong province. Dismissed from that post because of foreign pressure, he was soon named governor of Shanxi province. At the height of the Boxer crisis, as Allied armies invaded China in July 1900, he invited a group of 45 Christians and American missionaries to the provincial capital, Taiyuan, saying he would protect them from the Boxers. Instead, they were all killed. Foreigners, blaming Yuxian for what they called the Taiyuan massacre, labeled him the \"Butcher of Shan-hsi [Shanxi]\".\nAfter Allied armies seized control of North China, Yuxian was blamed by both foreign and Chinese officials for having encouraged the Boxers, and at their insistence, he was beheaded. Historians have now shown that while Yuxian was strongly resistant to foreign influence, he was in fact actively involved in the suppression of Boxer groups in 1895–96 and 1899, but that his strategy of killing Boxer leaders without prosecuting their followers failed in late 1899, when the Boxers had changed in nature and their executed leaders could easily be replaced by new ones. They also suggest that the Christians in Taiyuan were killed by mob violence, not by Yuxian's order.\nOfficial career\nYuxian was a Manchu whose family was registered in the Bordered Yellow Banner, one of the Eight Banners. His father served in minor government positions in Guangdong. Instead of passing the civil service examination, Yuxian purchased a degree that qualified him to serve as an official. Although he bought a position of prefect in Shandong province in 1879, only in 1889 did he start to serve in Caozhou, an unruly prefecture in southwestern Shandong that was prone to flooding and plagued by bandits. The departure of local troops for the front of the Sino–Japanese War in 1894 led to a sharp increase in banditry in the area. Yuxian managed to keep bandits under control with the help of local self-defense groups like the newly founded Big Swords Society. Having developed a reputation for efficient administration, in 1895 he was promoted to the rank of circuit intendant (daotai ), with several prefectures under his jurisdiction.\nBuoyed by government support, the Big Swords Society grew dramatically and started to clash with Chinese who had recently converted to Christianity. In 1896, a land dispute erupted between two lineages in northern Jiangsu. One lineage converted to Catholicism French Jesuits had arrived in the area in 1890 while the other lineage called for the help of the Big Swords of Caozhou. When the Big Swords turned violent, Yuxian, who had recently become Shandong judicial commissioner (anchashi ), was put in charge of suppressing them. He had their leader, Liu Shiduan, and his main lieutenant arrested and beheaded, putting an end to Big Swords activity in southern Shandong.\nIn November 1897, a group of armed men attacked German Catholic missionaries. After the attacks the German government asked the Qing government to remove many Shandong officials from their post (including governor Li Bingheng) and to build three Catholic churches in the area (in Jining, Caozhou, and Juye) at its own expense. Yuxian devised a line of defense to say that the missionaries had been killed by robbers. This attack, known as the Juye incident, triggered a \"scramble for concessions\" in which foreign powers obtained concessions and exclusive spheres of influence in various parts of China.\nIn June 1898, Yuxian supported Shandong governor's Zhang Rumei project of integrating Boxers from Guan County, the site of more clashes between Chinese Christians and local self-defense groups, into local militias that would help suppress banditry and mediate conflicts between locals and Chinese Christians.\nIn 1898, Yuxian became Shandong lieutenant governor (buzengshi ), the second-highest-ranked official in the province. After serving in Hunan and Jiangsu provinces for a few months, he came back to Shandong in March 1899 to serve as provincial governor.\nIn mid-October 1899, a band of armed men calling themselves the \"Militia United in Righteousness\" known in English as the \"Boxers\" clashed with Qing government troops at the Battle of Senluo Temple. In December, Yuxian had Boxer leaders arrested and executed, but the policy of eliminating the leaders and dispersing the followers proved ineffective because the Boxer movement was quite different in structure from the Big Swords Society that Yuxian had faced in southern Shandong. Foreign powers blamed Yuxian for continued Boxer violence against Chinese Christians, until December 6, 1899, when the weight of the protests convinced the court to remove Yuxian from his post. He was replaced as Shandong governor by Yuan Shikai, who was fiercely anti-Boxer and led his modern army into Shandong. Yuxian returned to Beijing. His presence there in early January coincided with an imperial edict dated 11 January 1900 that allowed the Boxers to join into self-defense organizations as long as they did not break the law, a move that foreign powers interpreted as condoning the Boxers' activities.\nBoxer Uprising\nIn mid-March 1900, Yuxian was appointed governor of Shanxi province. Western powers protested his appointment, but in vain. The Qing declaration of war on foreign powers on 21 June of that year allowed the Boxer movement to expand freely from Shandong into northern China. Partly under Yuxian's encouragements, in Shanxi, which had seen little Boxer activity until then, thousands of people either supported the Boxers or joined their ranks. On 27 June, an English church in Taiyuan was besieged and set on fire. In the clash that followed, several Westerners burned to death, and dozens of Chinese were killed either by fire or by the firearms of the missionaries. Yuxian ordered Chinese Christians to stop associating with foreigners and tried to keep Taiyuan (the Shanxi capital) and its surroundings stable in the face of increased lawlessness and rumors that Christians were going to counterattack from the mountain strongholds where they had found refuge. He also mobilized new troops and prepared local militias for defense against these expected attacks.\nThe events that followed are difficult to document, because unlike the Siege of the International Legations in Beijing in the summer of 1900, no Westerners survived to recount them and even some of the official record was clearly altered. The usual account states that Yuxian called 18 Western missionaries and their families a total of 44 or 45 people, including women and children to Taiyuan under the false pretense of protecting them, and that he had them all executed on 9 July in the compound of the provincial government. This longstanding account of the \"Taiyuan massacre\" is based on a detailed document first published on 29 April 1941 that purported to be by an eyewitness: a Chinese convert named Yong Zheng. Historian Roger R. Thompson has questioned this document because it appeared nine months after the events, contains an unusual amount of detail on the individual fate of each victim, and is similar in style and details to ''Foxe's Book of Martyrs'', a book that was highly influential in British evangelical circles at the time. Using Chinese official documents and missionary accounts written between June and September 1900, he concludes that the \"weight of evidence\" indicates that the missionaries had been killed by a violent mob rather than on Yuxian's orders.\nAbout 130 foreigners and 2,000 Chinese Christians died in Shanxi during the Boxer uprising, in part because of government support.\nYuxian received the imperial convoy in Taiyuan for several weeks after it had fled Beijing on 15 August. Only in November 1900 was he removed from his post.\nIn addition to imposing heavy indemnities on the Qing government, the Boxer Protocol signed on 7 September 1901 mandated that Yuxian should be beheaded for his role in killing foreign missionaries during the rebellion.\nLegacy\nFollowing news that Yuxian had presided over the execution of 44 missionaries in Taiyuan, foreigners portrayed Yuxian as a \"profoundly demonized villain\". As early as 1902, for instance, some foreigners claimed that Yuxian had \"officially started the Boxer organization\".}}\nReferences\nCitations\nWorks cited\n*\n*\n*\n* Paperback:\n*\n* Paperback:"
    }
  ]
}