{
  "content": [
    {
      "type": "text",
      "text": "# Zabibah and the King__disambig_1\n\nZabibah and the King ( Zabībah wal-Malik) is a romance novel, originally published anonymously in Iraq in 2000, that is credited to Saddam Hussein.\nCharacters\n*Ahab – The protagonist of the story, the novel follows 'Ahab as he becomes king of Iraq. Believed to represent Saddam Hussein.\n*Zabibah (زبيبة) – A poor woman in an unhappy marriage, she is the love interest of 'Ahab. Believed to represent the people of Iraq.\n*'''Zabibah's husband – A cruel unnamed man. Believed to represent the United States.\n*Hezkel''' – An emir and an antagonist to 'Ahab. Zabibah lives in a small hut next to Hezkel's palace. Believed to represent Israel.\n*Shamil – Another enemy of 'Ahab, Believed to represent both Jews and merchants.\n*Nuri Chalabi – An antagonist to 'Ahab and a feudal lord. Believed to represent Ahmed Chalabi, leader of the Iraqi National Congress, an American-funded Iraqi opposition movement.\nPlot summary\nThe plot is a love story about a powerful ruler of medieval Iraq and a beautiful commoner girl named Zabibah. Zabibah's husband is a cruel and unloving man who rapes her. The book is set in 7th- or 8th-century Tikrit, Hussein's home town. Although the book is on the surface a romance novel, it is (and was intended to be read as) an allegory. The hero is Hussein and Zabibah represents the Iraqi people.\nThe vicious husband is the United States and his rape of Zabibah represents the U.S. offensive against Iraqi forces at the end of the Gulf War, as illustrated by the date of the rape being January 17—the same date that U.S.-led forces commenced the 1991 offensive that drove Iraq out of Kuwait. In the novel, the king dies after capturing the rapists and avenging the honor of Zabibah.\nDistribution\nThe book was a best seller in Iraq when it was originally published for 1,500 dinars (about US$0.50). It is estimated that over one million copies were sold.\nRoyalties, according to the back cover, were to go to \"the poor, the orphans, the miserable, the needy, and [other] charities\". The Iraqi publishers appropriated four paintings by Canadian artist Jonathon Earl Bowser, to illustrate the novel, putting his \"The Awakening\" on the cover. Bowser did not authorize their use of his work and has attempted with no success to obtain compensation for copyright infringement.\nAuthorship\nThe authorship of the Zabibah and the King is a matter of controversy. Opinions range from Saddam being the author, to the book being written by a ghostwriter heavily supervised by Saddam, to the book being written entirely by a ghostwriter. In 2000, the CIA was under the belief that the Zabibah was not written by Saddam, but instead by a ghostwriter. The book was published anonymously, but the belief that Saddam was the author rapidly gained popularity.\nShortly after publication, Iraqi newspapers began to propagate \"rumors\" that Saddam was the author. It quickly received glowing reviews by Iraq's literary community, a 20-part Iraqi television series based off of it was announced, and the Iraqi National Theater announced a musical based on the novel, which became the country's single-biggest production. The Ministry of Culture printed thousands of copies, pricing them at 1,500 Iraqi dinars (under 1 U.S. dollar) per book. It became a best-seller. Saddam personally ordered that the visiting members of foreign delegations should be gifted a copy. The heavy use of Iraq's state arm to promote the novel has been cited as strong evidence that Saddam was either the author or heavily involved in writing it, in addition to the argument by some that the Arabic of the author was amateurish, which would not be expected from a professional ghostwriter of Saddam.\nSome people other than Saddam have been accused or claimed as the author of the Zabibah. This includes Gamal al-Ghitani, a notable Egyptian author, who was accused of being the author by Raad Bandar, one of Saddam's poets. Al-Ghitani denied the accusation. After Saddam was killed, an Iraqi women claimed that her husband was secretly forced to write the Zabibah for Saddam, only to be assassinated shortly after completing it.\nAdaptations\nA twenty-part television series, and a musical based on it, were later produced.\nBefore its release, it was rumored that the Sacha Baron Cohen comedy film The Dictator (2012) was adapted from the novel.\nThe book is also featured in Matt Ruff's alternate history novel The Mirage (2012), where in the novel's narrative it serves as an equivalent to O. J. Simpson's If I Did It (2007).\nSee also\n*Saddam Hussein's novels\nFootnotes\nExternal links\n*[http://www.jonathonart.com/saddam.html Zabibah and the King cover art]"
    }
  ]
}