{
  "content": [
    {
      "type": "text",
      "text": "# Zarafa (software)\n\n| license                = Server side: AGPL-3Other parts: proprietary\n| operating_system       = Linux, 32-bit Windows\n| programming_language = C++98\n| genre                  = Groupware\n| website                = [https://www.zarafa.com/ www.zarafa.com]\n}}\nZarafa was an open-source groupware application that originated in the city of Delft in the Netherlands. The company that developed Zarafa, previously known as Connectux, is also called Zarafa. The Zarafa groupware provided email storage on the server side and offered its own Ajax-based mail client called WebAccess and a HTML5-based, WebApp. Advanced features were available in commercially supported versions (\"Small Business\", \"Professional\" and \"Enterprise\" (different feature levels)). Zarafa has been superseded by Kopano.\nZarafa was originally designed to integrate with Microsoft Office Outlook and was intended as an alternative to the Microsoft Exchange Server. Connectivity with Microsoft Outlook was provided via a proprietary client-side plugin. Support for the plugin has been discontinued after Q1/2016, though Outlook from then on can use its own ActiveSync implementation instead. The WebApp (and WebAccess) has the same \"look-and-feel\" as the Outlook OWA. The software handles a personal address-book, calendar, notes and tasks, \"Public Folders\", a shared calendar (inviting internal and external users, resource management), exchange of files, and video chat. The open source edition does not support any MAPI-based Outlook users, while the community edition supports three Outlook users.\nAll server-side components and the WebApp/WebAccess of Zarafa are published under the Affero General Public License (AGPL), based on the GNU General Public License, version 2 (GPLv2). Introducing and maintaining a dual-licensing strategy, on 18 September 2008 Zarafa released the full core software, that is the server side software stack, under the GNU Affero General Public License, version 3 (AGPLv3).\nTechnology\nZarafa provides its groupware functionality by connecting the Linux-based server with Outlook clients using MAPI. The communication between server and client is based upon SOAP technology. The connection to Outlook clients can be secured using TLS/SSL, either directly between the Zarafa server program and the client, or via an HTTPS proxy.\nAll data is generally stored in a MySQL database, although attachments can be saved on the filesystem. The Zarafa server can get its user information from LDAP, Active Directory, Unix user accounts or the MySQL database.\nThe webmail is based on HTML5 (WebApp) and AJAX technology (WebAccess), with a PHP backend using a MAPI PHP extension.\nOther clients can connect via POP3, IMAP and iCalendar/CalDAV.\nZarafa initiated a project called Z-push in October 2007. It supports Exchange ActiveSync compatible devices (Symbian, Pocket PC, iPhone (firmware 2.0 and higher), Android (version 2.1 and higher), Nokia (mail4Exchange)) implementing the ActiveSync protocol and using the Incremental Change System (ICS) provided by the PHP-MAPI extension.\nSee also\n* List of collaborative software\nReferences\nPublications\n* Peter van Wijngaarden: Linux Magazine NL, Sep/2006, nr 4 -- Zarafa extended with real-time LDAP coupling\n* Sebastian Kummer und Manfred Kutas: Linux Magazine PRO (USA) Feb/2008 -- Zarafa - Exchange Alternative, Linux New Media AG, München, 2007\n* Roberto Galoppini and Davide Galletti: Open Source Messaging & Collaboration: Zarafa, SOS Open Source 2011\nExternal links\n* [https://www.zarafa.com/ Official website]"
    }
  ]
}