{
  "content": [
    {
      "type": "text",
      "text": "# ZD Awards\n\n| year = 1975\n| website = [http://zd-awards.ru/ Official website]\n}}\nZvukovaya Dorozhka, also known as ZD Awards (, \"sound track\") is Russia's oldest hit parade in the field of popular music. It was founded in 1975 and has been published monthly in Moskovskij Komsomolets since 1977. It features both Russian and international acts. Since 2003 it is presented in a ceremony in concert halls. It's considered one of the major Russian music awards.\nThe ZD Awards are similar to the Eastern European equivalent of the Billboard Music Awards. The award is given to popular performers from Eastern Europe, the Baltics, Scandinavia, Central Asia and other countries of the world. The award winners are determined based on the results of popular voting. The leaders of the charts over the years were performers from the countries of the former USSR, including Alla Pugacheva, Valery Leontyev, Mashina Vremeni, Bi-2, Kino, Laima Vaikule, A-Studio, t.A.T.u., Serebro, Vitas, Svetlana Loboda, Dan Balan, Zivert, Niletto and performers from other countries of the world, including Madonna, Army of Lovers,  Demis Roussos, Joe Dassin, Desireless, Enrique Iglesias, In-Grid, Jason Derulo, Billie Eilish, Alessandro Safina and others.\nHistory\nThe founder and first parade presenter was Yu. V. Filonov, who created its first issue in the fall of 1975. The column informed the audience about the existing Soviet performers and some foreign stars, usually from socialist countries. Based on the results of the popular vote, the 1977 hit parade included 9 songs by singer Alla Pugacheva, including Shakespeare’s Sonnet. From 1977 to the present, the editor of the column is music critic Artur Gasparyan. The first award ceremony based on readership polls was held in January 2003.\nCategories\n*Breakthrough of the Year\n*Person of the Year\n*Artist of the Year\n*Female Singer of the Year\n*Male Singer of the Year\n*Duet of the Year\n*Group of the Year\n*Innovator of the Year\n*Cover (Tribute) of the Year\n*Rock\n*Hip-Hop\n*Pop\n*Dance\n*Alternative\n*Album of the Year\n*Video of the Year\n*Russian Concert of the Year\n*Foreign Tour of the Year\n*Foreign Artist of the Year\n*Event of the Year\n*Trends (Fashionable Music) of the Year\n*Sexy Male\n*Sexy Female\n*Disappointment of the Year\nSee also\n* Russian pop music\n* Ovation\nReferences"
    }
  ]
}