{
  "content": [
    {
      "type": "text",
      "text": "# Zero-marking in English\n\nZero-marking in English is the indication of a particular grammatical function by the absence of any morpheme (word, prefix, or suffix). The most common types of zero-marking in English involve zero articles, zero relative pronouns, and zero subordinating conjunctions. Examples are I like cats in which the absence of the definite article, the, signals cats to be an indefinite reference, whose specific identity is not known to the listener; ''that's the cat I saw in which the relative clause (that) I saw omits the implied relative pronoun, that'', which would otherwise be the object of the clause's verb; and I wish you were here. in which the dependent clause, (that) you were here, omits the subordinating conjunction, that.\nIn some varieties of English, grammatical information that would be typically expressed in other English varieties by grammatical function words or bound morpheme may be omitted. For example, most varieties of English use explicit plural morphemes (singular mango and plural mangoes), West Indian creole languages refer to plural objects without such morphology (I find one dozen mango.).\nThe lack of marking to show grammatical category or agreement is known as zero-marking or zero morpheme realization. That information is typically expressed with prepositions, articles, bound morphemes or function words in other varieties of English.\nZero article\nThe term zero article refers to the phenomenon wherein grammatically valid noun phrases contain no articles, either definite or indefinite. It is also used in reference to a theoretical zero-length article that can be said to be used in place of an expected article in some situations.\nEnglish, like many other languages, does not require an article in plural noun phrases with a generic reference, that is, a reference to a general class of things.\nEnglish also uses no article before a mass noun or a plural noun if the reference is indefinite and not specifically identifiable in context. For example:\n*Generic mass noun: Happiness is contagious.\n*Generic plural noun: Cars have accelerators.\n*Generic plural noun: They want equal rights.\n*Indefinite mass noun: I drink coffee.\n*Indefinite plural noun: I saw cars.\nIn English, the zero article, rather than the indefinite article, is often used with plurals and mass nouns, although some can function like an indefinite plural article:\n* Friends have told us that they like our new house.\nThe definite article is sometimes omitted before some words for specific institutions, such as prison, school, and (in standard non-American dialects) hospital:\n* She is in hospital.\n* The criminal went to prison.\n* ''I'm going to school.\nThe article may also be omitted between a preposition and the word bed when describing activities typically associated with beds:\n* He is lying in bed.\n* They went to bed.\nWhere a particular location is meant, or when describing activities that are not typical, the definite article is used:\n* She was dismissed from the hospital.\n* The plumber went to the prison to fix the pipes.\n* We were jumping on the bed.\nThe zero article is also used in instructions and manuals. In such cases, all of the references in the text are definite and so no distinction between definite and indefinite is needed:\n*Grasp drumstick. Place knife between thigh and body; cut through skin to joint. Separate thigh and drumstick at joint.\nThe zero article is used with meals:\n*I have just finished dinner.\n*Breakfast is the most important meal of the day.\nThe zero article is used when describing calendar years:\n*I was born in 1978.\nThe zero article is used before titles or military ranks:\n*The Board appointed him Captain.\nDialects\nThere is variation among dialects concerning which words may be used without the definite article. American English, for example, requires the before hospital'', whereas Indian English frequently omits both definite and indefinite articles.\nZero relative pronoun\nEnglish can omit the relative pronoun from a dependent clause in two principal situations: when it stands for the object of the dependent clause's verb, and when it stands for the object of a preposition in the dependent clause. For example:\n*\"That's the car I saw\" (=\"That's the car that I saw\")\n*\"That's the thing ''I'm afraid of''\" (=\"That's the thing ''of which I'm afraid\")\nFurthermore, English has a type of clause called the reduced object relative passive clause, exemplified by\n*\"the man arrested at the station was a thief\" (=\"The man who was arrested at the station was a thief\")\nBoth the relative pronoun \"who\" and the passivizing auxiliary verb \"was\" are omitted.  Such a clause can cause confusion on the part of the reader or listener, because the subordinate-clause verb (\"arrested\") appears in the usual location of the main-clause verb (immediately after the subject of the main clause). However, the confusion cannot arise with an irregular verb with a past participle that differs from the past tense:\n*\"The horse taken past the barn fell\" (=\"The horse that was taken past the barn fell\")\nZero subordinating conjunction\nThe subordinating conjunction that is often omitted:\n*\"I wish you were here\" (=\"I wish that you were here\")\nThe dependent clause (that) you were here omits the subordinating conjunction, that.\nZero pronoun in imperative\nLike many other languages, English usually uses a zero pronoun in the second person of the imperative mood:\n*\"Go now\"\nHowever, the imperative is occasionally expressed with the pronoun being explicit (You go now).\nZero prepositions\nZero preposition refers to the nonstandard omission of a preposition.\nIn Northern Britain, some speakers omit the prepositions to or of'' in sentences with two objects.\n*\"So, she won't give us it.\" (She won't give it to us.)\nMany types of Aboriginal English spoken by Aboriginal Australians omit in, on and at to express a location.\n*\"I'll be the shop.\" (I'll be at the shop.)\nMany English speakers omit prepositions entirely if they would otherwise be stranded at the end of a sentence containing a relative clause. That may result from the longstanding but disputed rule against ending a sentence with a preposition. Such omissions are nonstandard but are not associated with any particular dialect.\n*\"That is something I'm really interested.\" (That is something I'm really interested in.)\nOther zero-marked forms\nZero do is the nonstandard absence of the word \"do\" or \"did\" in African American Vernacular English in some places in which Standard English uses it:\n*\"What you hit me for?\" (What did you hit me for?)\n*\"How much those flowers cost?\" (How much do those flowers cost)\nZero past marking is the absence of the past marker -ed in some nonstandard dialects like Caribbean English. Instead, the past is dealt with by other ways such as time markers:\n*\"Yesterday, I watch television.\"\n*\"I had pass the test.\"\nZero plural marking is the absence of the plural markers s and es in some nonstandard dialects like Caribbean English. The plural is instead marked by an article or a number:\n*\"I have two cat\" (I have two cats)\nIn grammar, zero plural also refers to the irregular plural in which the Standard English singular form and the plural form are the same: I have one sheep or I have two sheep.\nZero possessive marking is the absence of the possessive marker ’s in some nonstandard varieties of English, such as African American Vernacular English:\n*\"I went to my father house\" (I went to my father's house)\nZero third-person agreement is the absence of the third-person forms of verbs ending in s and es in some nonstandard dialects of English, such as African American Vernacular English. The feature is widely stigmatized as being a solecism.\nSee also\n*False title\n*Null morpheme\n*PRO (linguistics)\n*Zero (linguistics)\n*Zero-marking language\n*Zero copula\nReferences"
    }
  ]
}