{
  "content": [
    {
      "type": "text",
      "text": "# Zero-marking language\n\n}}\nA zero-marking language is one with no grammatical marks on either the dependents (or the modifiers) or the heads (or the nuclei) that show the relationship between different constituents of a phrase.\nPervasive zero marking is very rare, but instances of zero marking in various forms occur in quite a number of languages. Vietnamese and Indonesian are two national languages listed in the World Atlas of Language Structures as having zero-marking.\nIn many East and Southeast Asian languages, such as Thai and Chinese, the head verb and its dependents are not marked for any arguments or for the nouns' roles in the sentence. On the other hand, possession is marked in such languages by the use of clitic particles between possessor and possessed.\nSome languages, such as many dialects of Arabic, use a similar process, called juxtaposition, to indicate possessive relationships. In Arabic, two nouns next to each other could indicate a possessed-possessor construction:   \"Maryam's books\" (literally \"books Maryam\"). In Classical and Modern Standard Arabic, however, the second noun is in the genitive case, as in  .\nZero-marking, when it occurs, tends to show a strong relationship with word order. Languages in which zero-marking is widespread are almost all subject–verb–object, perhaps because verb-medial order allows two or more nouns to be recognized as such much more easily than subject–object–verb, object–subject–verb, verb–subject–object, or verb–object–subject order, for which two nouns might be adjacent and their role in a sentence possibly thus confused. It has been suggested that verb-final languages may be likely to develop verb-medial order if marking on nouns is lost.\nSee also\n* Analytic language\n* Dependent-marking language\n* Double-marking language\n* Head-marking language\n* Zero-marking in English\nReferences\n* Nichols, Johanna and Balthasar Bickel. \"Locus of Marking: Whole-Language Typology\", in Martin Haspelmath et al. (eds.) The World Atlas of Language Structures, pp.&nbsp;106–109. Oxford: Oxford University Press, 2005. .\nExternal links\n* [http://wals.info/feature/25 WALS Feature/Chapter 25: Locus of Marking: Whole-language Typology]"
    }
  ]
}