{
  "content": [
    {
      "type": "text",
      "text": "# Zhang Ping (Sixteen Kingdoms)\n\nZhang Ping}}\n| term_end            =\n| monarch             = Fu Jiàn/Fu Sheng/Fu Jiān\n| office1             = Inspector of Bingzhou (并州刺史)\n| term_start1         =\n| term_end1           = ?\n| monarch1            = Murong Jun\n| office2             = Inspector of Bingzhou (并州刺史)\n| term_start2         =\n| term_end2           =\n| monarch2            = Emperor Mu of Jin\n}}\nZhang Ping (died 361) was a warlord during the Sixteen Kingdoms period of China. He was initially the Inspector of Bingzhou under the Later Zhao dynasty who later gained autonomy over the province following the decline of the state at the start of the 350s. He wavered his loyalty between Former Qin, Former Yan and the Eastern Jin dynasties until he was able to muster the strength to briefly compete with the Former Qin and Former Yan as a rival state in 357. That year, he went to war with Fu Jiān (Emperor Xuanzhao of Former Qin) but was decisively defeated and forced back into submission. Shortly after his defeat, Zhang surrendered to the Former Yan. In 361, Zhang Ping rebelled against the Former Yan over a territorial dispute but was killed by invading Former Qin forces in the process.\nLife\nBackground\nZhang Ping was a native of Dai Commandery in Youzhou. He served as a subordinate general under Shi Hu in Later Zhao and was eventually appointed as Inspector of Bingzhou. Zhang Ping had an adopted son he named Zhang Ci, whose family name was initially Gong (弓). Ping loved Ci at first for his exceptional physical strength. One day, however, Ping discovered that one of his concubines was having an affair with Ci. After Ping confronted and severely scolded him, Ci swore to never do such a thing again by becoming a eunuch.\nAs a vassal lord\nLater Zhao entered a period of rapid decline in 349 due to internal conflicts within the ruling Shi clan. This resulted in Ran Min's establishment of Wei in 350 and the destruction of Zhao in 351. Zhang Ping was serving as Zhao's Inspector of Bingzhou during this period. In 350, he received the surrender of Zhao Ke (趙幷), a native of Dai Commandery who rebelled against Former Yan and brought with him 300 households to him.\nZhang Ping sought to maintain his power over Bingzhou. He, as well as contemporary Zhao generals, Li Li (李歷) and Gao Chang (高昌), planned to do so by appearing as neutral as possible, accepting offices from different states wherever they saw fit. In 351, while Zhao was still in existence, Zhang Ping submitted to Fu Jiàn (note the different pinyin) of Former Qin, who appointed him Grand General and Governor of Jizhou. After Ran Min's defeat in 352, an influx of Zhao generals surrendered to Former Yan and received positions from Murong Jun. Zhang Ping joined the trend and became Yan's Inspector of Bingzhou. However, some time later, he went back to Qin and retained his previous offices.\nIn 356, the roving Qiang warlord, Yao Xiang invaded the Hedong region (河東; around present-day Shanxi) and captured Xiangling (襄陵: in present-day Sui County, Henan) from Qin. Qin's emperor, Fu Sheng, ordered Zhang Ping to campaign against him. After Zhang Ping routed Yao Xiang, Xiang used bribes and modest words to appease Zhang. Zhang opened up to Xiang, and the two were said to have formed a bond as close as brothers. After swearing an oath of brotherhood, they withdrew their troops away from one another.\nState establishment and invasion of Former Qin\nBy 357, Zhang's territory encompassed the commanderies of Xinxing (新興; around present-day Xinzhou, Shanxi), Yanmen, Xihe, Taiyuan, Shangdang, and Shang. Under him, he had 300 fortified places as well as more than a hundred thousand households, both of Han Chinese and tribal ethnicities. Looking to start a state to rival Qin and Yan, he began appointing his own Generals Who Conquer and Generals Who Guard. In July 357, Zhang Ping sent his envoys to submit to the Jin dynasty and was appointed Inspector of Bingzhou. Later in October, he invaded Former Qin and plundered their territory.\nThe recently crowned Heavenly King of Qin, Fu Jiān, first responded by stationing Fu Liu (苻柳) at Puban (蒲阪, in modern-day Yuncheng, Shanxi) to defend against Zhang Ping. In January 358, Jin's Administrator of Shangdang, Feng Yang (馮鴦), allied himself with Zhang Ping but soon left to join Yan instead. Fu Jiān personally led his troops to face Zhang Ping. Fu Jiān's general, Deng Qiang, commanded the vanguard and brought 5,000 cavalries to Fenshang. Zhang Ping sent Zhang Ci to fight Deng Qiang, and the two battled for ten days, with neither side getting the upper hand.\nIn March 358, Fu Jiān arrived at Tongbi (銅壁, in modern-day Tongchuan, Shaanxi), and Zhang Ping brought his entire army to face him there. During the battle, Zhang Ci rode into the enemy lines several times while shouting. Fu Jiān had to ask for someone to stop Zhang Ci, and in the end, Fu Jian's general, Lü Guang, was able to bring him down with his spear, allowing Deng Qiang to capture him. Zhang Ci's capture shook Zhang Ping's army to the point of collapse. Terrified, Zhang Ping quickly offered his surrender to Fu Jiān. He was accepted back, reappointed as General of the Right and allowed to remain in Bingzhou while Zhang Ci was taken in to be one of Fu Jiān's own generals. Fu Jiān also relocated more than 3,000 households from Zhang Ping's domain to Chang'an.\nFinal years and death\nZhang Ping did not remain with Qin for long. Just months later in 358, Former Yan sent their generals to campaign against Zhang Ping, Li Li and Gao Chang, who had all previously submitted to Yan but later went over to Qin and Jin. Murong Jun commissioned for Murong Ping to attack Zhang Ping in Bingzhou. Zhang Ping's generals, Zhuge Xiang (諸葛驤), Su Xiang (蘇象), Qiao Shu (喬庶) and Shi Xian (石賢) quickly surrendered, and 138 of the fortified areas in Zhang Ping's territory capitulated during the invasion. Zhang Ping fled to Pingyang (平陽, in modern Linfen, Shanxi) with 3,000 soldiers, where he submitted back to Yan.\nFor the next three years, Zhang Ping remained as a Yan vassal. In 361, the people of Pingyang, which was a part of Zhang Ping's domain, surrendered to Yan, so Yan appointed their own Administrator and Protector for the commandery, Duan Gang (段剛) and Han Bao (韓苞). In late 361, Zhang Ping retaliated by attacking Pingyang, killing both Duan and Han. He then attacked Yanmen and killed the Yan Administrator, Dan Nan (單男). However, soon after, Qin attacked Zhang Ping, so Ping asked Yan for forgiveness and requested them to send him reinforcements. Yan could no longer trust him at this point and did nothing to help him. In the end, Zhang Ping was killed, and his forces were wiped out by Qin.\nAnecdote\nAn anecdote from the Spring and Autumn Annals of the Sixteen Kingdoms tells that Zhang Ping owned a dog he named Feiyan (飛燕) which had the shape of a small donkey. One night, Feiyan suddenly climbed onto the roof of a government office and made a voice that sounded like Zhang Ping. Zhang Ping was left greatly disturbed by the incident. Afterwards, Zhang Ping's power declined due to defeats to Qin and Yan.\nReferences\n* Fang, Xuanling (ed.) (648). Book of Jin (Jin Shu).\n* Sima, Guang (1084). Zizhi Tongjian.\n* Cui, Hong (501-522). Spring and Autumn Annals of the Sixteen Kingdoms (Shiliuguo Chunqiu)"
    }
  ]
}