{
  "content": [
    {
      "type": "text",
      "text": "# Zhang Li (Liao dynasty)\n\nZhang Li () (died June 21, 947), courtesy name Mengchen (), was an official of the Chinese Five Dynasties and Ten Kingdoms Period state Later Tang, as well as the Khitan state Liao.\nBackground\nIt is not known when Zhang Li was born, but it is known that he was from Fuyang (滏陽, in modern Handan, Hebei).  His male-line ancestors, including his grandfather Zhang Qing () and father Zhang Bao (), had been farmers for generations.  (Based on subsequent events, it appeared that Zhang Li's mother was Zhang Bao's wife.)  It was said that in Zhang Li's youth, he was studious and capable at writing.  Even though he was but a commoner, he would often attend court proceedings whenever he saw people disputing with each other, and make decisions about how he would have ruled had he been the magistrate, as he himself as capable of being an official in the future.\nDuring Later Tang\nEarly in the Tongguang era (923-926) of Later Tang's founding emperor Li Cunxu, Zhang Li passed the imperial examinations in the Jinshi class.  He was shortly after made a Zuo Shiyi (), a low-level consultant at the examination bureau of government (門下省, Menxia Sheng), and served as one of the editors of the imperial history.  When Li Cunxu's chief of staff (Shumishi) Guo Chongtao was put in actual charge of Later Tang's campaign against its southwestern neighbor Former Shu in 925 (with Li Cunxu's son Li Jiji the Prince of Wei in titular command), Guo put Zhang in charge of drafting military correspondences.  When, after the Later Tang army destroyed Former Shu, Li Jiji killed Guo at the orders of his mother (Li Cunxu's wife) Empress Liu, all of Guo's close associates fled.  Only Zhang went to Li Jiji's mansion to mourn Guo.\nShortly after, Li Jiji began to lead his army back toward the Later Tang capital Luoyang.  However, on the way, the general Li Shaochen rebelled.  Li Jiji sent the civilian official Ren Huan, who, despite his civilian background, was capable in military matters, against Li Shaochen.  Zhang advised Ren to first send the weakest among his soldiers against Li Shaochen, so that Li Shaochen would be enticed into attacking him, and then lay a trap for Li Shaochen.  Ren followed the advice and subsequently defeated Li Shaochen, forcing Li Shaochen to flee to Han Prefecture (漢州, in modern Deyang, Sichuan) and try to defend it.  Ren subsequently captured the city and took Li Shaochen captive.  Li Cunxu then issued an edict ordering Li Shaochen's death, but the eunuch monitor of Li Jiji's army, Li Congxi (), wanted to keep Li Shaochen alive so that he could think of a way to take credit for the victory and deny Ren the credit.  Ren hesitated.  Zhang spoke to him, arguing that Li Shaochen's crime deserved death, that Li Shaochen would still constitute a potential threat if left alive, and that, in any case, he should not disobey an imperial edict; Zhang also stated that he would execute Li Shaochen himself if Ren did not.  Ren agreed (albeit hesitantly) and put Li Shaochen to death.\nThe unjustified executions of Guo and his ally and fellow major general Li Jilin, meanwhile, spawned many rebellions against Li Cunxu throughout the Later Tang realm.  In summer 926, Li Cunxu was killed in a mutiny at Luoyang itself, and one of the rebel leaders, his adoptive brother Li Siyuan, subsequently arrived at Luoyang and took over, initially as regent and later claiming the title of emperor.  Li Jiji considered battling Li Siyuan, but his soldiers began to abandon him, and he committed suicide.  Early in Li Siyuan's Tiancheng era (926-930), Li Siyuan, who had previously been impressed with Zhang, commissioned him as an imperial scholar (翰林學士, Hanlin Xueshi).  When, thereafter, both of his parents died, he left governmental service to observe a period of mourning.  After the mourning period, he returned to the imperial government to again serve as imperial scholar.  He also successively carried the additional titles of Yuanwailang (員外郎, low-level official) at both the ministry of rites (禮部, Libu) and ministry of defense (兵部, Bingbu), as well as the drafter of edicts.  Not long after, his father's long-time concubine died.  While she was alive, he had respected her greatly because of the long-term relationship between his father and her, such that his own sons also referred to her as \"grandmother.\"  After her death, he was unsure whether to observe a mourning period for her, and he requested his colleagues' advice.  None had particular advice for him, and he decided to simply request a leave back to Fuyang, where he spent three years (the standard mourning period) not wearing mourning clothes but also not carrying out business.  The popular sentiment at the time by those in the know considered his actions on this matter appropriate.\nDuring the middle of the Qingtai era (934-936) of Li Siyuan's adoptive son Li Congke, Zhang returned to the imperial government to serve as Bibu Langzhong (), a supervisory official at the ministry of rites, as well as drafter of edicts and imperial scholar.  When Li Congke's brother-in-law (Li Siyuan's son-in-law) Shi Jingtang the military governor of Hedong Circuit (河東, headquartered in modern Taiyuan, Shanxi) rebelled against Li Congke in 936 with support from Later Tang's northern rival, Khitan Empire, one of the generals that Li Congke sent against Shi was another brother-in-law, his chief of staff Zhao Yanshou.  The imperial scholar He Ning was initially assigned to accompany Zhao to serve as his secretary.  Zhang, however, was not impressed with He, and volunteered to go instead.  Li Congke agreed.  Subsequently, however, when both Zhao and his father Zhao Dejun were defeated by Khitan's Emperor Taizong, Zhang and the Zhaos were all captured and taken to Khitan proper.  (Li Congke thereafter, finding the situation hopeless, committed suicide, ending Later Tang and allowing Shi's Later Jin to take over its former territory.)\nDuring Liao\nEmperor Taizong was impressed with Zhang Li's literary abilities, and he made Zhang an imperial scholar.  Around 937, Zhang made an attempt to flee back to Chinese territory, but was captured by the Khitan border guards.  Emperor Taizong rebuked him and stated, \"Why do you abandon me?\"  Zhang responded, \"Your subject is Chinese.  My food and clothing customs are different than yours.  Living is worse than dying.  I wish to be executed quickly.\"  Instead of punishing Zhang, Emperor Taizong rebuked the interpreter Gao Yanying (), whom he had put in charge of making the lives of the ethnic Han Chinese officials that he had captured comfortable, and whipped Gao.  After this incident, Zhang continued to serve Emperor Taizong, and was said to be faithful and honest, speaking straight off his mind without hiding anything.  Emperor Taizong thus respected him.  Early in Emperor Taizong's Huitong era (938–947), he was promoted to be chief imperial scholar (翰林學士承旨, Hanlin Xueshi Chengzhi) and the minister of civil service affairs (吏部尚書, Libu Shangshu).\nAfter Shi Jingtang's death, his nephew and successor Shi Chonggui turned away from a submissive stance toward Khitan (which had, by that point, been renamed Liao), and took a confrontational stance.  In 946, Emperor Taizong launched a major attack south, and, after defeating and forcing the surrender of the major Later Jin general Du Wei (Shi Jingtang's brother-in-law, Shi Chonggui's uncle), approached the Later Jin capital Kaifeng.  Finding the situation hopeless, Shi Chonggui surrendered, ending Later Jin and allowing (for the time being) Liao to take over its territory.  As the Liao army neared Kaifeng, Zhang, who accompanied Emperor Taizong on this campaign south, stated to Emperor Taizong:\nEmperor Taizong, however, did not listen to this advice.  However, after Emperor Taizong entered Kaifeng and claimed to be the emperor of China as well, Zhang and Zhao Yanshou recommended the Later Jin chancellor Li Song, and Emperor Taizong commissioned Li as chief of staff.  Zhang himself was subsequently commissioned as You Puye (右僕射, one of the heads of the executive bureau (尚書省, Shangshu Sheng)), Menxia Shilang (門下侍郎, the deputy head of the examination bureau), and chancellor (同中書門下平章事, Tong Zhongshu Menxia Pingzhangshi).  (He Ning was also made chancellor at the same time.)\nThe Liao soldiers mistreated the Chinese of the Central Plains badly, however, and soon the realm was overrun with rebellions.  Finding the situation troubling, Emperor Taizong decided to head back to Liao proper, leaving his brother-in-law Xiao Han (the brother of his deceased wife Empress Xiao Wen)in charge of Kaifeng as the military governor of Xuanwu Circuit ().  (According to Xiao later, Zhang opposed Xiao's commission, but was not listened to.)  As Emperor Taizong was traversing the devastated Chinese territory on his way back, he stated, \"What we have rendered China to be is the result of the sins of the Prince of Yan [(i.e., Zhao)].\"  He then turned toward Zhang and stated, \"You also had a part in it.\"\nEmperor Taizong, however, would never reach Liao proper, as he fell ill on the journey and died near Heng Prefecture (恆州, in modern Shijiazhuang, Hebei).  His nephew Yelü Ruan the Prince of Yongkang then claimed imperial title (as Emperor Shizong) (after preemptively arresting Zhao, who had planned to declare himself emperor of China).  As Emperor Shizong saw the likelihood that his grandmother (the mother of both Emperor Taizong and his own father Yelü Bei) would oppose his succession, he took the main Liao army and continued back toward Liao proper, leaving an army at Heng (which Emperor Taizong had designated as the middle capital) as its garrison, along with many Han officials, including Zhang.  When Xiao and Emperor Taizong's cousin Yelü Mada () subsequently withdrew from the Central Plains to Heng as well, they, still bearing grudges over Zhang's suggestion of commissioning only the Han Chinese to rule the Han Chinese, had their soldiers surround Zhang's mansion.  At that time, Zhang was already ill, but he came out to meet Xiao and Yelü Mada.  Xiao rebuked him, stating:\nXiao locked Zhang's arms in chains, but Zhang responded harshly, \"These are about the important matters of the state.  I did in fact say these things.  Kill me if you wish.  What is the point of locking me?\"  Yelü Mada, however, believed that even officials as honored as Zhang could not be killed so frivolously, and therefore insisted on sparing Zhang.  Xiao then released Zhang.  Nevertheless, Zhang died in anger and distress that night.  It was said that because Zhang often spoke righteously and had mercy on those who had talents, and he was willing to praise others for their good deeds and spend his wealth to help the poor, the Chinese scholars of the Central Plains, upon hearing of his death, mourned him.  His family members burned his body and returned the bones to Fuyang for burial.\nNotes and references\n* Old History of the Five Dynasties, vol. 98.\n* History of Liao, vol. 76.\n* Zizhi Tongjian, vols. 274, 280, 281, 285, 286, 287."
    }
  ]
}