{
  "content": [
    {
      "type": "text",
      "text": "# Zhū Jiāng Kingdom\n\nZhān Guó\n| s2                     = Zhān BóBó Guó\n| government_type        = Kingdom\n| today                   = Thailand\n}}\nZhū Jiāng Kingdom (; ) was an ancient kingdom in present-day central Thailand mentioned in the Chinese leishu, Cefu Yuangui, and the Book of Sui. It was located to the west of Zhenla.\nAfter Zhenla annexed Funan in 627, Zhū Jiāng, which has been identified as one of Dvaravati-influenced polities, and another kingdom, Cān Bàn, allied via royal intermarriage with Zhenla. They then fought several wars against Tou Yuan to the northwest. Tou Yuan later became a vassal of Dvaravati in 647. In addition, Zhenla also waged wars against Línyì to the northeast at the time mentioned.\nAccording to the Laotian , its proposed chief city, Champasri, and several satellite settlements, together with the neighboring kingdom of Kuruntha at Saket Nakhon (present-day Roi Et), were destroyed by King Fa Ngum of Luang Phrabang after he successfully reunited the Laotian Kingdoms in the 14th century. Local sage claims that King of Champasri had a close dynastic relation with Mahendravarman, King of Chenla.\nLocation\nIn the Book of Sui Volume 82, says Zhū Jiāng was southwest of Linyi, west of Zhenla, which itself bordered the Kingdom of Chequ to the south.\n...The Kingdom of Zhenla was located in the southwest of Linyi and was originally a vassal state of the Kingdom of Funan. It was 60 days’ boat ride away from Rinan County. It bordered the Kingdom of Chequ to the south and the Kingdom of Zhujiang to the west...\n|multiline=yes\n|author=Wang Qinruo and others of the Song Dynasty\n|title=Cefu Yuangui, volume 957\n}}\nChinese historian Chen Jiarong () proposes that Zhū Jiāng means a red river, referring to the Chao Phraya River in Thailand, and Zhujiang is another name for Duò Luó Bō Dǐ (; Dvaravati) in its lower basin. In this case, Zhū Jiāng royal intermarried with Zhenla, and annexed Tou Yuan to the northwest, potentially leading the Old Book of Tang Volume 197 to assert that the Pyu Kingdoms bordered Zhenla to the east.\nSome say Zhū Jiāng is a corrupted name of Zhū Bō () in the New Book of Tang, which is identified with Pyu Kingdoms in present-day Myanmar, or it might be some country that controlled the Irrawaddy River Basin, which was called by the Chinese the \"Black Water Silt River\" (). Its water is turbid and slightly red, so it is named the \"Zhu River\" (). Some believe it was in the Mekong Basin, or the Mun Valley.\nReferences"
    }
  ]
}