{
  "content": [
    {
      "type": "text",
      "text": "# Zhu Ling (Three Kingdoms)\n\n220\n| term_end = ?\n| monarch = Cao Pi\n| birth_date = Unknown\n| birth_place = Dezhou, Shandong\n| death_date = between October 228 and August 243\n| occupation = Military general\n| blank1 = Courtesy name\n| data1 = Wenbo (文博)\n| blank2 = Posthumous name\n| data2 = Marquis Wei (威侯)\n| blank3 = Peerage\n| data3 = Marquis of Gaotang Village (高唐亭侯)\n}}\nZhu Ling  (180-228), courtesy name Wenbo, was a Chinese military general of the state of Cao Wei during the Three Kingdoms period of China. He previously served under the warlords Yuan Shao and then Cao Cao during the late Eastern Han dynasty.\nLife\nZhu Ling was from Shu County (), Qinghe State (), which is located between present-day Pingyuan and Xiajin counties in Shandong. He started his career as a military officer under the warlord Yuan Shao. Around 193 or 194, when Yuan Shao's ally Cao Cao was attacking Xu Province, Yuan Shao sent Zhu Ling and some troops to assist Cao Cao. During this time, Zhu Ling became so impressed with Cao Cao that he remained with Cao Cao and never returned to Yuan Shao. His troops followed his decision and remained with Cao Cao too.\nIn 199, Cao Cao sent Zhu Ling and Liu Bei to lead troops to intercept the warlord Yuan Shu, who was attempting to escape to northern China to join Yuan Shao after his defeat. Starting with the Battle of Guandu in 200, Zhu Ling participated in Cao Cao's battles against Yuan Shao and later against Yuan Shao's heirs throughout the 200s. In 208, after Cao Cao received the surrender of Liu Cong, the Governor of Jing Province, he put Zhu Ling in charge of one of the seven divisions stationed in Jing Province under the command of the general Zhao Yan. Zhu Ling fought on Cao Cao's side at the Battle of Red Cliffs in the winter of 208–209 against the allied forces of the warlords Liu Bei and Sun Quan.\nIn 211, Zhu Ling accompanied Cao Cao on a campaign against a coalition of warlords from the west of Tong Pass and engaged them at the Battle of Tong Pass. During the battle, Cao Cao ordered Zhu Ling and Xu Huang to lead a detachment north into Hedong Commandery to establish a bridgehead at the Puban crossing of the Yellow River so he could launch an oblique attack on Huayin County. After Cao Cao returned to Ye city in 212 following his victory at the Battle of Tong Pass, Zhu Ling remained in Chang'an and served as a subordinate of the general Xiahou Yuan, who continued to launch attacks against the warlords. In 215, Zhu Ling participated in the battle against the Di people in Wudu Commandery and opened the path for Cao Cao's later invasion of Hanzhong Commandery.\nDespite Zhu Ling's contributions and achievements, Cao Cao never seemed to favour him for reasons unknown. Cao Cao did not pay much attention to Zhu Ling and used to put him under the command of the general Yu Jin. However, Zhu Ling did not show any disappointment or anger towards Cao Cao for neglecting him; on the contrary, he fought fiercely for Cao Cao in battles and was known for being one of the best commanders. According to the Wen Di Ji Ji Jie (), Zhu Ling's actions in battle earned him a reputation that put him on par with Xu Huang, whom the historian Chen Shou named one of the Five Elite Generals serving under Cao Cao.\nFollowing Cao Cao's death in 220, his son Cao Pi usurped the throne from the figurehead Emperor Xian, ended the Eastern Han dynasty and established the Cao Wei state with himself as the emperor. Shortly after his coronation, Cao Pi appointed Zhu Ling as General of the Rear (). Cao Pi initially wanted to enfeoff Zhu Ling as the Marquis of Shu () but Zhu Ling requested to be the Marquis of Gaotang Village () instead, so Cao Pi agreed.\nIn 228, after the Wei general Cao Xiu lost at the Battle of Shiting against forces from Wei's rival state Eastern Wu, Zhu Ling and other officers led troops to drive back the enemy, who were pursuing Cao Xiu as he was retreating, and managed to save Cao Xiu. Zhu Ling died of illness after the Battle of Shiting in an unknown year and was honoured with the posthumous title \"Marquis Wei\" ().\nIn August 243, during the reign of Cao Fang, sacrifices were made to Zhu Ling at the temple dedicated to Cao Cao.\nSee also\n* Lists of people of the Three Kingdoms\nReferences\nBibliography\n* Chen, Shou (3rd century). Records of the Three Kingdoms (Sanguozhi).\n*\n* Pei, Songzhi (5th century). Annotated Records of the Three Kingdoms (Sanguozhi zhu).\n* Sima, Guang (1084). Zizhi Tongjian."
    }
  ]
}