{
  "content": [
    {
      "type": "text",
      "text": "# Zimbabwe People's Revolutionary Army__disambig_1\n\n|allegiance= ZAPU\n|branch= Irregular military\n|type= Guerrilla army\n|role= Military wing of ZAPU\n|size= 20,000 personnel in 1979\n|command_structure=\n|garrison=\n|garrison_label=\n|motto=\n|colors=\n|colors_label=\n|march=\n|mascot=\n|battles= Rhodesian Bush War\n|decorations=\n|battle_honours=\n|commander2=\n|commander2_label=\n|commander3=\n|commander3_label=\n|notable_commanders= Alfred Nikita MangenaLookout Masuku\n|identification_symbol= ZIPRA\n|identification_symbol_label= Abbreviation\n}}\n'''Zimbabwe People's Revolutionary Army (ZIPRA''') was the military wing of the Zimbabwe African People's Union (ZAPU), a Marxist–Leninist political party in Rhodesia. It participated in the Rhodesian Bush War against white minority rule in Rhodesia (modern Zimbabwe). ZIPRA (or often ZPRA) was formed during the 1960s by the nationalist leader Jason Moyo, the deputy of Joshua Nkomo. Its sponsors included the Organisation of African Unity and Soviet Union and its base of support lay in Ndebele and other non-Shona minorities in southwestern Zimbabwe, the home region of many of its leaders. After the war, it was edged out of power by ZANU-PF.\nOperations\ntank at the Zimbabwe Military Museum, Gweru.]]\nBecause ZAPU's political strategy combined political negotiations and armed force, ZIPRA developed by elaborately training both regular soldiers and guerrilla fighters. However, by 1979, it had an estimated 20,000 combatants, based in camps around Lusaka, Zambia and at the front. ZIPRA's crossing points into Zimbabwe were at Feira in Zambia, opposite Mashonaland East and West. For example, the operational boundary was Sipolilo, where ZIPRA, Zimbabwe African National Liberation Army (ZANLA) and Rhodesian Security Forces clashed. ZIPRA operated alone in Mashonaland West. No ZANLA combatants were present in that area until the war's later stages.\nBesides the overall political ideologies, the main differences between ZIPRA and ZANLA were that:\n*ZIPRA did not follow ZANLA's ideology (inspired by Maoism) but followed Soviet Marxist-Leninist principles.\n*ZIPRA controlled zones from Sipolilo to Plumtree.\nZIPRA formally allied with uMkhonto we Sizwe (MK), the ANC's militant wing. In the mid-1960s, ZIPRA and MK mounted a celebrated, if strategically unsuccessful, raid into Rhodesia. Rhodesian Security Forces, working in concert with the South African Police, stopped the incursion.\nDowning of passenger planes\nof Air Rhodesia (pictured in the early 1970s), similar to the Hunyani and the Umniati.]]\nIn 1978 and 1979, ZIPRA downed two civilian passenger planes of Air Rhodesia, killing a total of 107 passengers and crew. Air Rhodesia Flight 825 (named the Hunyani) was a scheduled flight from Kariba to Salisbury that was shot down on 3 September 1978 by ZIPRA guerrillas using an SA-7 surface-to-air missile (SAM). ZAPU (the political body behind ZIPRA) leader Joshua Nkomo publicly claimed responsibility for shooting down the Hunyani on BBC Television the same evening, saying the aircraft had been used for military purposes, but denied that his men had killed survivors on the ground. Eighteen of the fifty-six passengers in the Air Rhodesia plane survived the crash, most of whom were seated in the rear. Three crash survivors who remained on the aircraft managed to avoid being killed by running away and hiding in the bush. A second plane, Air Rhodesia Flight 827 (named the Umniati), was shot down on 12 February 1979 by ZIPRA guerrillas, again using an SA-7 SAM.\nZIPRA commanders and soldiers\n.]]\n*Dumiso Dabengwa, head of intelligence and member of the ZIPRA high command\n*John Dube, commander at the Wankie battle\n*Tshinga Dube, head of signals and member of the ZIPRA high command\n*Alfred Nikita Mangena, first commander of ZIPRA\n*Robson Manyika, member of the ZIPRA high command\n*Lookout Masuku commanded ZIPRA after the death of Nikita Mangena\n*Report Mphoko, chief of logistics and member of the ZIPRA high command\n*Austin Moyo, intelligence officer in Northern Front Regional Command\n*Ambrose Mutinhiri, commander at Morogoro\n*Ackim Ndlovu, member of the ZIPRA high command\n*Roy Reagen Ndlovu\n*Zenzo Ntuliki, intelligence officer and security for Joshua Nkomo\n*Joseph Nyandoro, member of the ZIPRA high command\n*Irvine Khulukani Sibanda, commander of the Southern Front\n*Philip Valerio Sibanda\n*Eddie Sigoge\n*Cephas Cele, chief of staff and training and member of the ZIPRA high command\nReferences\nFurther reading\n*Rasmussen, R. K., & Rubert, S. C., 1990. A Historical Dictionary of Zimbabwe, Scarecrow Press, Inc., Metuchen, N.J., United States of America.\n*Chatambudza, Takawira, 2025. The Zimbabwe Liberation Struggle: A Military History of the Zimbabwe People’s Revolutionary Army (ZIPRA), 1963-1979, PhD Dissertation. University of Calgary.\n*Sunday mail, Sunday, 8 October 2006, Zimbabwe's true armed struggle history must be told"
    }
  ]
}