{
  "content": [
    {
      "type": "text",
      "text": "# Zionism as settler colonialism\n\nshowing the population shift from 1947 to 1951 in Israel–Palestine, plotted with the % of land controlled by what he calls the \"Jewish establishment\".]]\nDescribing Zionism as settler colonialism is a framing of the Zionist movement to form a state in the region of Palestine as a settler colonialist movement replacing the indigenous population of the region. In the modern era it is a perspective on the Israeli–Palestinian conflict typically employed by critics of Zionism and the state of Israel.\nMany early leading Zionists such as Theodor Herzl, Max Nordau, and Ze'ev Jabotinsky unapologetically described Zionism as colonization. Although they used words such as 'colonize' and 'colonization,' the specific phrase 'settler colonialism' was only academically formulated later and applied to the conflict in the 1960s. The paradigm of settler colonialism was also later applied to Zionism by various scholars and figures, including Patrick Wolfe, Edward Said, Ilan Pappé, Noam Chomsky, Fayez Sayegh and Maxime Rodinson.\nThe settler colonial framework on the conflict emerged in the 1960s during the decolonization of Africa and the Middle East, and re-emerged in Israeli academia in the 1990s led by Israeli and Palestinian scholars, particularly the New Historians, who refuted some of Israel's foundational myths and considered the Nakba to be ongoing. This perspective contends that Zionism involves processes of elimination and assimilation of Palestinians, akin to other settler colonial contexts similar to the creation of the United States and Australia.\nCritics of the characterization of Zionism as settler colonialism, such as Benny Morris, Yuval Shany and Ilan Troen, argue that it does not fit traditional colonial frameworks, seeing Zionism instead as the repatriation of an indigenous population and an act of self-determination. This debate reflects broader tensions over competing historical and political narratives regarding the founding of the State of Israel and the Israeli–Palestinian conflict.\nConcepts\nIn Patrick Wolfe's model, settler colonialism differs from classical colonialism in that it focuses on eliminating or removing, rather than exploiting, the original inhabitants of a territory. As theorized by Wolfe, settler colonialism is an ongoing \"structure, not an event\" aimed at replacing a native population. Settler colonialism operates by processes including physical elimination of native inhabitants but also can encompass projects of assimilation, segregation, miscegenation, religious conversion, and incarceration. Commentators, such as Daiva Stasiulis, Nira Yuval-Davis, and Joseph Massad have included Israel in their global analysis of settler societies.\nAncient Israel has also been analyzed as a case of settler colonialism.\nBackground\nin Palestine c.1920-1925]]\nMany of the fathers of Zionism themselves described it as colonisation, such as Vladimir Jabotinsky who said \"Zionism is a colonization adventure\". Theodore Herzl, in a 1902 letter to Cecil Rhodes, described the Zionist project as \"something colonial\". Previously in 1896 he had spoken of \"important experiments in colonization\" happening in Palestine. In 1905 Max Nordau said, \"Zionism rejects on principle all colonization on a small scale, and the idea of 'sneaking' into Palestine\", and that instead it advocates \"that the existing and promising beginnings of a Jewish colonization shall be looked after and maintained till the movement will be possible on a large scale\".\nMajor Zionist organizations central to Israel's foundation held colonial identity in their names or departments, such as the Jewish Colonisation Association, the Palestine Jewish Colonisation Association, the Jewish Colonial Trust, and The Jewish Agency's colonization department.\nIn 1905, some Jewish immigrants to the region promoted the idea of Hebrew labor, arguing that all Jewish-owned businesses should only employ Jews, to displace Arab workforce hired by the First Aliyah. Zionist organizations acquired land under the restriction that it could never pass into non-Jewish ownership. Later on, kibbutzim—collectivist, all-Jewish agricultural settlements—were developed to counter plantation economies relying on Jewish owners and Palestinian farmers. The kibbutz was also the prototype of Jewish-only settlements later established beyond Israel's pre-1967 borders.\ns (magenta) in the occupied West Bank in 2020]]\nZionist leader Chaim Weizmann wrote in his autobiography that at the 1919 Paris Peace Conference he had spoken to US Secretary of State Robert Lansing of \"the hope that by Jewish immigration, Palestine would ultimately become as Jewish as England is English\" and described how he had taken as his example \"the outstanding success which the French had at that time made of Tunisia.\" \"What the French could do in Tunisia,\" Weizmann said, \"the Jews would be able to do in Palestine\". Anthropologist Scott Atran wrote of this comparison between Zionism and French colonialism in Tunisia that \"whereas direct French colonial rule sought to utilize, rather than displace, the fellah's labor (Poncet 1962), Zionist colonization had no use for Arab labor, at least in principle\".\nIn 1948, 750,000 Palestinians fled or were forcibly displaced from the area that became Israel, and 500 Palestinian villages, as well as Palestinian-inhabited urban areas, were destroyed. Although considered by some Israelis to be a \"brutal twist of fate, unexpected, undesired, unconsidered by the early [Zionist] pioneers\", some historians have described the Nakba as a campaign of ethnic cleansing. In the aftermath of the Nakba, Palestinian land was expropriated on a large scale and Palestinian citizens of Israel were encircled in specific areas.\nIn a 1956 speech, Israeli Chief of Staff Moshe Dayan stated in regards to Palestinian political violence: \"Who are we that we should argue against their hatred? For eight years now, they sit in their refugee camps in Gaza and, before their very eyes we turn into our homestead the land and the villages in which they and their forefathers have lived. We are a generation of settlers, and without the steel helmet and the cannon we cannot plant a tree and build a home.\"\nArnon Degani argues that ending military rule over Israel's Palestinian citizens in 1966 shifted from colonial to settler-colonial governance. After the Israeli capture of the Golan Heights in 1967, there was a nearly complete ethnic cleansing of the area, leaving only 6,404 Syrians out of about 128,000 who had lived there before the war. They had been forced out by campaigns of intimidation and forced removal, and those who tried to return were deported. After the Israeli capture of the West Bank, about 250,000 of 850,000 inhabitants fled or were expelled.\nScholarly development\nThe settler colonial framework on the Palestinian struggle emerged in the 1960s during the decolonization of Africa and the Middle East, and re-emerged in Israeli academia in the 1990s led by Israeli and Palestinian scholars, particularly the New Historians, who refuted some of Israel's foundational myths and considered the Nakba to be ongoing. This coincided with a shift from supporting a two-state solution to a one-state solution that constitutes a state for all citizens equally, which challenges the Jewish identity of Israel.\nProponents of the paradigm of Zionism as settler colonialism include Edward Said, Rashid Khalidi, Noam Chomsky, Ilan Pappé, Fayez Sayegh, Maxime Rodinson, , Ibrahim Abu-Lughod, Baha Abu-Laban, , Rosemary Sayigh, Amal Jamal and Ismail Raji al-Faruqi.\n1960s\nOne early analysis was that of Palestinian writer Fayez Sayegh in his 1965 essay \"Zionist Colonialism in Palestine\", which was unusual for the pre-1967 era in specifying Zionism as a form of settler colonialism. Sayegh later drafted the UN's \"Zionism is racism\" resolution. After Israel assumed control of the whole Mandatory Palestine in 1967, settler-colonial analyses became prominent among Palestinians. Sayegh argues that  Zionists originally formed a \"settler-community\" during the first fifteen years of Zionist colonization (1882-1897) before fulfilling what had been their aspiration from the outset: to form a \"settler-state\" (pp.2-3).  For Sayegh, the \"special character\" of \"Zionist colonization\" distinguishing it from European colonization was three-fold: (1) the latter was driven  \"either by economic or by politico-imperialist motives: they had gone either in order to accumulate fortunes by means of privileged and protected exploitation of immense natural resources, or in order to prepare the ground for (or else aid and abet) the annexation of those coveted territories by imperial European governments\", whereas Zionism was animated by the desire to attain nationhood; (2) other European settlers could co-exist with natives, but Zionism was incompatible with the continued existence of a native population; (3) other settlers were protected by their imperial metropole, while Zionism was at the mercy not only of local opposition but also Ottoman opposition. This third element, he argued, led the Zionists into alliance with British imperialism (pp.6-9).\nIn 1967, the French historian Maxime Rodinson published Israel: A Colonial Settler-State? (originally published in French). In it, he describes Europe as a whole as the metropole of Israeli settler colonialism. Rodinson had probably read Sayegh's work as his 1965 booklet had been translated into English and French.\n1980–2000\nThe \"colonization perspective\" emerged in the scholarship on Israeli history in the 1980s. This was associated with the New Historians movement in Israel, which focused on Israeli-Palestinian relations rather than only Jewish history and was willing to examine Zionist settlement's colonial character. Alongside explicitly settler colonial analysis, other scholars of the 1980s and 1990s, such as Abdo and Yuval-Davis, argued that the \"Zionist national project has been predicated on the destruction of the Palestinian one\".\nMuslim philosopher and scholar of religion Isma'il Raji al-Faruqi characterized Zionism as a project that sought \"to empty Palestine of its native inhabitants and to occupy their lands, farms, homes, and all movable properties,\" describing it as involving \"robbery by force of arms\" and \"slaughter of men, women, and children.\" He viewed these actions as expressions of what he considered the movement's colonial nature.\n2000s\nAccording to Israeli sociologist Uri Ram, the characterization of Zionism as colonial \"is probably as old as the Zionist movement\". John Collins states that studies have \"definitively established\" that \"the architects of Zionism were conscious and often unapologetic about their status as colonizers whose right to the land superseded that of Palestine's Arab inhabitants\". Other settler colonial projects did not lay out their plans for dispossessing and eliminating the inhabitants in detail and in advance.\nAccording to Patrick Wolfe, Israel's settler colonialism manifests in immigration policies that promote unlimited immigration of Jews while denying family reunification for Palestinian citizens. Wolfe adds, \"Despite Zionism's chronic addiction to territorial expansion, Israel's borders do not preclude the option of removal [of Palestinians] (in this connection, it is hardly surprising that a nation that has driven so many of its original inhabitants into the sand should express an abiding fear of itself being driven into the sea).\"\nHussein Ibish argues that such zero-sum calls are \"a gift that no occupying power and no colonizing settler movement deserves.\"\nThe peer-reviewed journal Settler Colonial Societies has published three special issues focused on Israel/Palestine. Its editor Lorenzo Veracini, who describes Israel as a colonial state, states that Jewish settlers could only expel the British in 1948 because they had their own colonial relationships inside and outside Israel's new borders. He suggests, however, that the possibility of an Israeli disengagement is always latent and that this colonial relationship could be severed if a one-state solution is reached which includes the \"accommodation of a Palestinian Israeli autonomy within the institutions of the Israeli state\".\nScholar Amal Jamal, of Tel Aviv University, has described Israel as the result of \"a settler-colonial movement of Jewish immigrants\", stating that Israel has continued to strengthen \"exclusive Jewish control\" of the land and its resources, while diminishing Palestinian rights and denying Palestinian self-determination.\nAccording to Israeli academics Neve Gordon and Moriel Ram, the incompleteness versus completeness of ethnic cleansing in the territory occupied by Israel has affected the different forms that Israeli settler colonialism has taken in the West Bank versus the Golan Heights. For example, the few remaining Syrian Druze were offered Israeli citizenship in order to further the annexation of the area, while there was never an intention to incorporate West Bank Palestinians into the Israeli demos. Another example is the dual legal structure in the West Bank compared to the unitary Israeli law imposed in the Golan Heights.\n2010s–2020s\ngraffiti spray-painted on a home in a-Sawiyah, Nablus District by Zionist settlers in 2018 reads \"Kill or deport.\"]]\nSalamanca et al. state that Israeli practices have often been studied as distinct but related phenomena, and that the settler-colonial paradigm is an opportunity to understand them together. As examples of settler colonial phenomena they include \"aerial and maritime bombardment, massacre and invasion, home demolitions, land theft, identity card confiscation, racist laws and loyalty tests, the wall, the siege on Gaza, cultural appropriation, dependence on willing (or unwilling) native collaboration regarding security arrangements\".\nAnthropologist Anne de Jong says that early Zionists promoted a narrative of binary conflict between two competing groups with equally valid claims in order to deflect criticisms of settler colonialism. In 2013, historian Lorenzo Veracini argued that settler colonialism has been successful in Israel proper but unsuccessful in the territories occupied in 1967. Historian Rashid Khalidi argues that all other settler-colonial wars in the twentieth century ended in defeat for colonists, making Palestine an exception: \"Israel has been extremely successful in forcibly establishing itself as a colonial reality in a post-colonial age\".\nAlthough settler colonialism is an empirical framework, it is associated with favoring a one-state solution. Sociologist Rachel Busbridge argues that settler colonialism is \"a coherent and legible frame\" and \"a far more accurate portrayal of the conflict than the picture of Palestinian criminality and Israeli victimhood that has conventionally been painted\". She also argues that settler colonial analysis is limited, especially when it comes to the question of decolonization.\nHistorian Nur Masalha says, \"The Palestinians share common experiences with other indigenous peoples who have had their narrative denied, their material culture destroyed and their histories erased or reinvented by European white settlers and colonisers.\" This paradigm has gained significant traction among left-leaning activists at universities. Palestinian-American historian Rashid Khalidi states that settler-colonial projects are usually \"extensions of the people and of the sovereignty of the mother country\", whereas Zionism is an independent \"national movement\" whose means were nevertheless \"explicitly settler-colonial\".\nElia Zureik's ''Israel's Colonial Project in Palestine: Brutal Pursuit'', updates his earlier work on colonialism and Palestine and applies Michel Foucault's work on biopolitics to colonialism, arguing that racism plays a central role and that surveillance becomes a tool of governance. It also analyses the dispossession of indigenous people and population transfer, including sociological, historical and postcolonial studies into an examination of the Zionist project in Palestine. Sánchez and Pita argue that Israeli settler colonialism has had far more severe effects on the indigenous Palestinian population than the discriminations suffered by the Spanish and Mexican populations in the Southwest of the United States in the wake of the Treaty of Guadalupe Hidalgo which ended the Mexican–American War. Most scholars who have addressed Israeli settler colonialism have not discussed the Golan Heights.\nSociologist Areej Sabbagh-Khoury suggests that \"in tracing the settler colonial paradigm ... Israeli critical sociology, albeit groundbreaking, has suffered from a myopia engendered through hegemony.\" She states that \"until recently, most Israeli academics engaged in discussing the nature of the state ignored its settler colonial components\", and that scholarship conducted \"within a settler colonial framework\" has not been given serious attention in Israeli critical academia, \"perhaps due to the general disavowal of the colonial framework among Israeli scholars.\"\nCritiques of the framework\nScholarly Rejections\nGerman philosopher Ingo Elbe argues that applying the settler colonialism paradigm to Zionism \"leads to a lack of sensitivity for the specific nature of Zionism\" by reducing it to a form of white settler colonialism. He notes that such critiques often ignore key historical realities: that Jews \"have always resided in the area that was named 'Palestine' by the Romans,\" that they maintained \"a special cultural connection to Eretz Israel,\" and that Zionism's \"civilizing mission... was primarily directed at the Jewish people itself.\" Elbe emphasizes that European Jews did not migrate from a colonial metropole but were \"looking for a safe haven from their systematic antisemitic marginalization and eventual extermination,\" while Jews from Arab countries also fled persecution.\nIsraeli historian S. Ilan Troen suggests that Zionism was the repatriation of a long displaced indigenous population to their historic homeland, and that Zionism does not fit the framework of a settler society as it \"was not part of the process of imperial expansion in search of power and markets\". With his wife Carol Troen, a former applied linguist at Ben-Gurion University of the Negev, Troen writes that the concept of Palestinian indigeneity is a recent addition to the \"linguistic arsenal of lawfare\" used to deny Israel's legitimacy. They suggest this frames Israel as inherently settler colonial and as \"reprehensible in its exploitation of the indigenous\".\nSome critics highlight ideas such as the putative non-exploitation of indigenous labor by Zionists as a reason not to consider it a colonial movement. Historian Benny Morris suggests that Zionism does not meet the definition of colonialism since it did not involve \"an imperial power acquiring political control over another country, settling it with its sons, and exploiting it economically\". Historian Tom Segev states that \"colonialism is irrelevant to the Zionist experience\" because most Jewish immigrants came as refugees, and Zionists did not seek to \"dominate the local population\".\nJournalist Roger Cohen and law scholar Yuval Shany, describe the Israeli–Palestinian conflict as one between two indigenous groups. Shany argues that labelling Israel's establishment as a colonial enterprise is \"a significant category error\". He says that Israel cannot be considered colonialist because it was not an \"imposed power\" and its creation \"was endorsed by the United Nations\". Cohen states that Israel's \"very diverse, multihued society\" includes many Jews who fled persecution in the Middle East and Europe, and who had no metropole they could flee to, unlike most settler colonial societies.\nSome scholars have stated the lack of an imperial power to benefit from exploiting the region, means a colonial paradigm does not apply. Other scholars have stated that Israel's external supporters, either private organizations or various states (such as the United Kingdom, France, Germany, Australia, or the United States), may function as a metropole (defined as the homeland of a colonial empire).\nReception among Jews and Israelis\nThe portrayal of Zionism as settler colonialism is strongly rejected by most Zionists and Israeli Jews, and is perceived either as an attack on the legitimacy of Israel, a form of antisemitism, or historically inaccurate.\nActivist usage\nAccording to The Economist, the Palestinian diaspora has sought to reframe the Israeli-Palestinian conflict from \"a clash between two national movements\" to \"a generational liberation struggle against 'settler colonialism'\". This paradigm has gained significant traction among left-leaning activists at universities.\nSociology professor Jeffrey C. Alexander refers to colonialism as \"the go-to term for total pollution\" of Israel's legitimacy. According to scholar Bernard D. Goldstein, \"The accusation of 'settler colonialism' is increasingly used to attack Israel and justify its destruction.\"\nSee also\n* Anabaptist settler colonialism\n* Indigeneity in the Israeli-Palestinian conflict\nReferences\nNotes\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*  |doi-access=free |issn=2201-473X |hdl-access=free |hdl=1854/LU-4141856}}\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}