{
  "content": [
    {
      "type": "text",
      "text": "# Zivar bay Ahmadbayov Monument\n\n|image         = Building on Zargarpalan Street 133.jpg\n|caption       =\n|coordinates   =\n|location      = Baku, Azerbaijan\n|designer      =\n|type          =\n|material      = bronze\n|length        =\n|width         =\n|height        =\n|open          = May 26, 2011\n|dedicated_to  =Zivar bay Ahmadbayov\n|map_image     =\n|map_text      =\n|map_width     =\n|relief        =\n|extra         =\n}}\nZivar bay Ahmadbayov Monument () is a monument to the Azerbaijani architect Zivar bay Ahmadbayov, located in Baku, the capital of Azerbaijan, in the Yasamal district of the city. The monument is placed in front of the Nizami Ganjavi metro station, in the park named in Zivar bay Ahmadbayov honour, on the Jafar Jabbarli street. The sculptor of the monument is Natig Aliyev, the People's Artist of Azerbaijan.\nHistory\nThe place for locating the monument in front of the Nizami Ganjavi metro station was not chosen by chance, as the building situated on the left side of the station was designed by Zivar bay Ahmadbayov himself.\nThe park and the monument were created in accordance with the order of the President of Azerbaijan. The opening ceremony of the Zivar bay Ahmadbayov park and monument took place on 26 May 2011. The ceremony was attended by the President of Azerbaijan, Ilham Aliyev, as well as by the head of the Executive Power of Baku Hajibala Abutalibov.\nThe territory where the park and the monument are located was desolate for a long time. In the course of the work, canteens and kiosks were removed, and a park was created on the territory of which various trees and flower bushes were planted, landscaping strips were laid, and a modern lighting system was installed. A complex of fountains was built at the entrance to the park and behind the monument. In addition, during the construction work, the Jafar Jabbarli street, located in front of the park, was covered with asphalt, and new granite sidewalks were built.\nReferences"
    }
  ]
}