{
  "content": [
    {
      "type": "text",
      "text": "# Zorawar Singh (Dogra general)\n\n| death_date    =\n| birth_place   = Ansar, Kahlur (present-day Himachal Pradesh, India)\n| death_place   = Tibet\n| allegiance    = Gulab Singh of Jammu\n| relations     = Bhim Singh (great-grandson)\n}}\nZorawar Singh (1784–12 December 1841) was a military general of the Dogra Rajput ruler, Gulab Singh, who served as the Raja of Jammu under the Sikh Empire. He was born in the Chandel Rajput family in the  princely state of Kahlur (Bilaspur, state of Chandels), in present-day Himachal Pradesh, hence known as Kahluria. He served as the governor (wazir-e-wazarat) of Kishtwar and extended the territories of the kingdom by conquering Ladakh and Baltistan. He also attempted to conquer the Western Tibet (Ngari Khorsum) but was killed in battle of To-yo during the Dogra-Tibetan war. Due to his role in the conquests in the Himalaya Mountains Zorawar Singh has been referred to as the \"Conqueror of Ladakh\".\nEarly life and career\nHe was born in September 1784 in a  Hindu Chandel Rajput family in the princely state of Kahlur (Bilaspur, of Chandels, in present-day Himachal Pradesh, hence known as Kahluria. His family migrated to the Jammu region where, on coming of age, Zorawar took up service under Raja Jaswant Singh of Marmathi (modern Doda district). Zorawar Singh was employed by the ambitious Raja Gulab Singh of Jammu and was placed under the commandant of the Reasi fort (Bhimgarh fort).  While delivering a routine message to the Gulab Singh, Zorawar told him of the financial waste occurring in the fort administration and boldly presented his own scheme to effect savings. Gulab Singh was impressed by Zorawar's sincerity and appointed him commandant of Reasi.\nZorawar Singh fulfilled his task and his grateful ruler made him commissariat officer of all forts north of Jammu. He was later made governor of Kishtwar and was given the title of Wazir (minister).\nOfficial Records of the Sikh Empire show that Zorawar Singh was in command of his personal battalion of 875 men with a salary of Rs. 7,604 per month.\nEven though it was a newly conquered region Zorawar had no trouble in keeping the peace; many of the local Rajputs were recruited into his army. In 1835 the nearby region of Paddar was taken from Chamba (now in Himachal Pradesh) in the course of a battle. Paddar later became known for its sapphire mines. But this was a mere sideshow to General Zorawar Singh's more famous expeditions, on which he had already embarked in the previous year.\nLadakh campaigns\nwas the first Qiladar (commandant).]]\nTo the east of Kishtwar and Kashmir are the snow-clad mountains of the upper Himalayas — the rivers of Zanskar Gorge, Suru River, and Drass rise from these snows, and flow across the plateau of Ladakh into the Indus River. Several petty principalities in this region were tributary to the Gyalpo of Ladakh (King).  In 1834 one of these, the Raja of Timbus, sought Zorawar's help against the Gyalpo. Meanwhile, the Rajput general had been burning to distinguish himself by expanding the territory of Raja Gulab Singh — also at that time, according to the Gulabnama, Kishtwar went through a drought that caused a loss of revenue and forced Zorawar to extract money through war.\nThe Rajputs of Jammu and Himachal have traditionally excelled in mountain fighting; therefore Zorawar had no trouble in crossing the mountain ranges and entering Ladakh through the source of the Suru River where his 5000 men defeated an army of local Botis. After moving to Kargil and subduing the landlords along the way Zorawar received the submission of the Ladakhis — however Tsepal Namgyal, the Gyalpo (ruler), sent his general Banko Kahlon by a roundabout route to cut off Zorawar's communications. The astute general doubled back to Kartse, where he sheltered his troops through the winter. In the spring of 1835 he defeated the large Ladakhi army of Banko Kahlon and marched his victorious troops towards Leh. The Gyalpo now agreed to pay 50,000 rupees as war-indemnity and 20,000 rupees as an annual tribute.\nAlarmed at the gains of the Dogras, the governor of Kashmir, Mehan Singh, incited the Ladakhi chieftains to rebel but Zorawar quickly marched back to the Himalayan valleys and subdued the rebels, now forcing the Raja of Zanskar to also pay a separate tribute to Jammu. But in 1836 Mehan Singh, who was in correspondence with the Lahore durbar, this time instigated the Gyalpo to revolt — Zorawar force-marched his army in ten days to surprise the Ladakhis and forced them to submit. He now built a fort outside Leh and placed there a garrison of 300 men under Dalel Singh — the Gyalpo was deposed to an estate and a Ladakhi general, Ngorub Stanzin, was made King. But the latter did not prove to be loyal hence the Gyalpo was restored to his throne in 1838.\nBaltistan campaign\nTo the northwest of Ladakh, and to the north of Kashmir, lies the region of Baltistan. Muhammad Shah, the son of the ruler of Skardu, Raja Ahmad Shah, fled to Leh and sought the aid of the Gyalpo and Zorawar against his father. But some of the Ladakhi nobles allowed Ahmad Shah to imprison his son and sought his aid in a general rebellion against the Dogras. After defeating the Ladakhi rebels Zorawar invaded Baltistan in the winter of 1839/40, adding a large contingent of Ladakhis to his army.\nThe advance brigade of 5,000 under Nidhan Singh lost its way in the cold and snow and was surrounded by the enemy; many soldiers perished from the cold. Then Mehta Basti Ram, a prominent Rajput from Kishtwar, established contact with the main force. On their arrival the Botis of Skardu were defeated and forced to flee. They were chased to the fort of Skardu which was invested by Zorawar for a few days. One night the Dogras scaled the steep mountain behind the fort and after some fighting captured the small fort on its crest. From this position the next day they began firing down at the main fort and forced the Raja to surrender. Zorawar built a fort on the banks of the Indus where he placed a contingent of his soldiers.\nAfter placing Muhammad Shah on the throne for an annual tribute of 7000 rupees, a Dogra contingent under Wazir Lakhpat advanced westwards, conquered the fort of Astor and took its Darad Raja prisoner. However this Raja was tributary to Mehan Singh, the governor of Kashmir, who was alarmed at the Dogra conquests since they only expanded the kingdom of Gulab Singh while not bringing any benefit to the Lahore durbar. His complaint at Lahore was forwarded to Raja Gulab Singh at Jammu and he ordered the Darad Raja to be released.\nTibet expedition and Death\ndepicting Zorawar Singh]]\nZorawar Singh had expressed his desire to expand the territories of Gulab Singh and the Sikh Empire. According to Sohan Lal Suri, an attorney in the court of the Sikh Empire, Zorawar Singh had met Maharaja Ranjit Singh in March 1836 and asked him for permission to start a campaign in Tibet, the Maharaja however had declined his request. However, Zorawar Singh would finally get permission under Maharaja Sher Singh in 1841, which allowed the Sikh Empire to expand northwards without violating their treaties with the East India Company.\nOne column under the Ladakhi prince, Nono Sungnam, followed the course of the Indus River to its source. Another column of 300 men, under Ghulam Khan, marched along the mountains leading up to the Kailas Range and thus south of the Indus. Zorawar himself led 4,000 men along the plateau region where the vast and picturesque Pangong Lake is located. Sweeping all resistance before them, the three columns passed the Lake Manasarovar and converged at Gartok, defeating the small Tibetan force stationed there. The enemy commander fled to Taklakot but Zorawar stormed that fort on 6 September 1841. Envoys from Tibet now came to him as did agents of the Maharaja of Nepal, whose kingdom was only fifteen miles from Taklakot.\nThe fall of Taklakot finds mention in the report of the Chinese Imperial Resident, Meng Pao, at Lhasa: On my arrival at Taklakot a force of only about 1,000 local troops could be mustered, which was divided and stationed as guards at different posts. A guard post was quickly established at a strategic pass near Taklakot to stop the invaders, but these local troops were not brave enough to fight off the Shen-Pa (Dogras) and fled at the approach of the invaders. The distance between Central Tibet and Taklakot is several thousand li…because of the cowardice of the local troops; our forces had to withdraw to the foot of the Tsa Mountain near the Mayum Pass. Reinforcements are essential in order to withstand these violent and unruly invaders.\nZorawar and his men now went on pilgrimage to Mansarovar and Mount Kailash. He had extended his communication and supply line over 450 miles of inhospitable terrain by building small forts and pickets along the way. The fort Chi-T’ang was built near Taklakot, where  Mehta Basti Ram was put in command of 500 men, with 8 or 9 cannon. With the onset of winter all the passes were blocked and roads snowed in. The supplies for the Dogra army over such a long distance failed despite Zorawar's meticulous preparations.\nOwing to intense cold and fatigue, many of the soldiers lost their fingers and toes to frostbite. Mehta Basti Ram writes of men being unable to use weapons effectively due to cold. Others starved to death, while some burnt the wooden stock of their muskets to warm themselves. The Tibetans and their Chinese allies regrouped and advanced to give battle, bypassing the Dogra fort of Chi-T’ang.\nZorawar and his men met them at the Battle of To-yo on 12 December 1841 — in the early exchange of fire the general was wounded in his right shoulder by a matchlock ball. Zorawar was tired of the fighting and said, \"Either the Tibetans will take my head and neck, or I shall take it myself (commit suicide)!\" Then, shouting Gulab Singh's name, Zorawar said, \"The omens are not good!\". After he had killed four or five Tibetans, a lance hurled against him thrust right through his chest. He fell to the ground, not uttering a single sound and his sword escaped his hand. Once more the thought occurred to him to seize his sword, but he could not. The Tibetan executioner drew out the lance from Zorawar's chest and also took his sword from the belt. He then cut off Zorawar's head and carried it off. Zorawar Singh's head, hands and ears were cut off and sent to Lhasa authorities.\nThen the Dogra soldiers lost their way. When the Tibetan infantry also pressed into the entrenchments, the Dogra officers as well as the Ladakhi noblemen became confused. He who could save his life fled, the remainder were killed. A little after noon the battle came to an end.\nLegacy\nThe Zorawar LT is an Indian light tank, named for Zorawar Singh.\nSee also\n* Mehta Basti Ram\n* Dogra-Tibetan war\nReferences\nFurther reading\n* Frederick Drew, The Jummoo & Kashmir territories\n* Alexander Cunningham, Ladak\n* A. H. Francke, Antiquities of Indian Tibet\n* Fisher, Rose, and Huttenback, The Himalayan Battle-ground"
    }
  ]
}