{
  "content": [
    {
      "type": "text",
      "text": "# Zulkiflee Anwar Haque\n\n|birth_place = Gurun, Kedah, Federation of Malaya (now Malaysia)\n|education =\n|alma_mater =\n|nationality = Malaysian\n|years_active = 1982–present\n|other_names = Obanana\n|known_for   =\n|occupation  = Cartoonist\n|spouse =\n|children =\n|relatives =\n}}\nZulkiflee bin SM Anwar Ulhaque (born 15 May 1962), better known by his pen name Zunar, is a Malaysian political cartoonist. In 2015, he faced up to 43 years in prison for criticising the Malaysian government in a number of posts on Twitter and was charged under the Sedition Act 1948. The charges were dropped following the change in government at the 2018 Malaysian general election.\nIn May 2016, he was the recipient of the Cartooning for Peace award in Geneva.\nBackground\nZunar was born on 15 May 1962, at Bukit Junun, Gurun, Kedah. He had previously worked as a laboratory technician and during his pastime delved in drawing cartoons. He was also a secretary to the Association of Selangor and Federal Territory cartoonists. Quite often he held workshops for individuals wanting to venture into the cartoon business.\nZunar often likes to bring along a pen and notebook inside his travel bag during his drawing excursions, from which he will record ideas from all walks of life and would translate them into caricatures or cartoons.\nCareer as a cartoonist\nZunar produced his first works as early as 1973 which were published in the magazine Bambino. Upon the encouragement of family and friends, his drawings were also published weekly in newspapers and magazines such as the Kisah Cinta magazine and issues of Gila-Gila, a publication by Creative Enterprise Sdn Bhd.\nIn Gila-Gila, from time to time his cartoons began attracting the attention of readers and publishers as well as due to their cynical and political nature. This gave him an advantage for his work to be published in issues of the Cili Padi magazine (part of the Gila-Gila magazine) under the title Gebang-Gebang.\nZunar then began producing work in a daily-news comic strip called Papa. Zunar's name became well known when he got himself involved in the Reformasi movement following the sacking of then-Deputy Prime Minister Anwar Ibrahim in 1998. His involvement in the movement led to his detention along with several other activists.\nAfter his release, he concentrated on drawing political cartoons. He produced several books of cartoons touching on many reform movements that he had previously participated in.\nTo date he continues to draw political cartoons, namely for politically owned newspapers, including Harakah.\nDescription of his work\nZunar is a cartoonist who always employs sharp satirical humor in his drawings.\n* One of his work entitled Ofis Korner is a biting satire on office staffs slacking at work.\n* Liza deals with a character called Kadok, a dumb person who tries to win over a girl by the name of Liza.\n* Papa, which appeared in the newspaper Berita Harian, featured the life and fate of two siblings in the middle of the rat race and fast-paced city. It represents groups from all walks of life, including the squatters.\nIssues and controversies\nBanning of books\nOn 24 June, 2010, \"1 Funny Malaysia\", a book of his published works on the Malaysiakini website, and \"Gedung Kartun\", \"Perak Dalam Kartun\" and \"Isu Dalam Kartun\" which were a series of magazines about political issues in Malaysia and Perak (published by his company Sepakat Efektif Sdn. Bhd.) were banned and prohibited by the Malaysian Home Ministry to be sold in public.\nHe contended that the bans were illegal and contrary to the rights of free speech guaranteed by the Constitution of Malaysia. On 27 July, 2010, he and his employer Malaysiakini filed two separate suits in the Kuala Lumpur High Court to challenge the decision of the Ministry of Home Affairs in banning his books.\nArrest for sedition\nOn 24 September, 2010, Zunar was arrested by the police and charged for sedition, 3 hours prior to the launching of his just-published book \"Cartoon-O-Phobia\" and jailed for one day. He faced possible charge under the Sedition Act of 1948 which carries a maximum three years imprisonment. During the arrest the police seized 66 copies of the book.\nOn 10 February, 2016, he was arrested at his home in Kuala Lumpur, and detained for three days without charge. He was later charged in relation to nine political images he had posted online, with a potential penalty of up to 43 years in prison. Five of his books were also banned on the grounds that their contents were \"detrimental to public order\".\nPeople's Uprising Rally, 2013 @ #HKR112\nOn 12 January, 2013, Zunar together with other opposition leaders and supporters organized a demonstration against the government. The rally was organized by Mohamad Sabu to show support for the then-opposition's change agenda.\nZunar was also referred to as the Commander during the HKR rally with a group of cartoonist Iss who claim that they are from the independent cartoonist group. Zunar was the leader for the Brickfields and KL Central group.\nTea with Zunar\nIn December 2016, Zunar held a public fan event called Tea with Zunar. In Fall of 2017, he filed a lawsuit against the police to recoup the $5,200 for the merchandise (books, T-shirts, etc.) seized in the raid.\nReferences\nExternal links\n*"
    }
  ]
}