{
  "content": [
    {
      "type": "text",
      "text": "# ZX Spectrum software\n\n}}\nThe ZX Spectrum's software library was very diverse. While the majority of the software produced for the system was video games, others included programming language implementations, Sinclair BASIC extensions, databases, word processors, spread sheets, drawing and painting tools, and 3D modelling tools.\nGames\nYour Sinclair top 10\nBetween October 1991 and February 1992 Your Sinclair published a list of what they considered to be the top 100 games for the ZX Spectrum. Their top 10 were:\n# Deathchase\n# Rebelstar\n# All or Nothing\n# Stop the Express\n# Head Over Heels\n# R-Type\n# The Sentinel\n# Rainbow Islands\n# Boulder Dash\n# Tornado Low Level\nCRASH top 10\nBetween August and December 1991 CRASH published their list of the top 100 ZX Spectrum games, including in the top 10:\n# Rainbow Islands\n# Chase H.Q.\n# RoboCop\n# RoboCop 2\n# Dizzy\n# Target: Renegade\n# Magicland Dizzy\n# Batman: The Movie\n# Operation Wolf\n# Midnight Resistance\nTechradar's \"Top 30\"\nTechradar published their list of the best 30 ZX Spectrum games in 2012, underlining which games stood the test of time.\n# Elite – Firebird Games\n# R-Type – Electric Dreams Software\n# Chuckie Egg: A'n'F Software\n# Manic Miner: Bug-Byte Software Ltd\n# Knight Lore: Ultimate Play the Game\n# Back to Skool: Microsphere\n# Football Manager: Addictive Games Ltd\n# Lunar Jetman: Ultimate Play the Game\n# Horace Goes Skiing – Beam Software\n# Boulder Dash – Front Runner\n# Sim City: Infogrames\n# Underwurlde: Ultimate Play the Game\n# Super Hang-On: Electric Dreams Software\n# Jet Set Willy: Software Projects Ltd\n# Rainbow Islands: Ocean Software Ltd\n# Tornado Low Level: Vortex Software\n# Ant Attack: Quicksilva Ltd\n# Chase H.Q.: Ocean Software Ltd\n# Deus Ex Machina: Automata UK Ltd\n# Lode Runner: Software Projects Ltd\n# Gauntlet: US Gold Ltd\n# Fantasy World Dizzy: Code Masters Ltd\n# The Hobbit: Melbourne House\n# Atic Atac: Ultimate Play the Game\n# Tetris: Mirrorsoft Ltd\n# Hyper Sports: Imagine Software Ltd\n# The Way of the Exploding Fist – Melbourne House\n# Daley Thompson's Decathlon: Ocean\n# Skool Daze: Microsphere\n# The Great Escape: Ocean\nNotable developers\nA number of current leading games developers and development companies began their careers on the ZX Spectrum. David Perry of Shiny Entertainment wrote Three Weeks in Paradise and Dan Dare. Tim and his brother Chris Stamper, along with Tim's girlfriend (later wife) Carole Ward and John Lathbury, published Jetpac, Atic Atac, Sabre Wulf and Knightlore: and many others, as Ultimate Play the Game, now known as Rare, maker of many famous titles for Nintendo and Xbox game consoles. Alan Cox wrote Blizzard Pass, and is an ardent supporter of open source software.\nOther notable Spectrum game developers include:\n* Jonathan \"Joffa\" Smith wrote Cobra, Hysteria, Firefly and a conversion from the Green Beret arcade among other games which prove that smooth scrolling was never a problem on the ZX Spectrum, as long as the developer had the necessary technical knowledge.\n* Matthew Smith wrote the Spectrum titles Manic Miner and Jet Set Willy, proving that it was possible to have continual music during game play on a Spectrum;\n* Nigel Alderton was the 16-year-old author of Chuckie Egg, published by A'n'F Software on the Spectrum and BBC Micro;\n* The first author of an isometric 3D game: Ant Attack, published by Quicksilva: was Sandy White;\n* Julian Gollop wrote Rebelstar and Laser Squad;\n* Jon Ritman was the author of Match Day and Head Over Heels;\n* The Oliver Twins wrote the Dizzy series of games;\n* David and Helen Reidy wrote Skool Daze and Back to Skool for Microsphere;\n* Christian Penfold and Mel Croucher, of Automata, authors of Pimania, My Name Is Uncle Groucho, You Win A Fat Cigar and Deus Ex Machina;\n* Paul Owens and Christian Urquhart, developers of ''Daley Thompson's Decathlon for Ocean Software;\n* Philip Mitchell and Veronika Megler of Beam Software, who wrote The Hobbit published by Melbourne House;\n* Platinum Productions (David J Anderson and Ian Morrison), authors of the conversions of Lode Runner, Beach Head and Rambo;\n* Costa Panayi, who wrote Android, Android Two, Highway Encounter, Cyclone and Tornado Low Level for Vortex Software;\n* William Tang wrote the Horace series of games (Hungry Horace, Horace Goes Skiing and Horace and the Spiders) for Beam Software, published by Sinclair Research and Melbourne House.\nDemos\nMany demos were made for the Spectrum and compatible computers. The demo scene on the Spectrum can probably be traced back to Castor Cracking Group, The Lords and a few other groups and individuals back in 1986.  The ZX Spectrum demo scene was slow to start, but it started to rise in the late 1980s, most noticeably in Eastern Europe and southern Europe. Some demos were also released with magazines on cover tapes.\nAlthough there are many demos made for the 48K Spectrums, most current Spectrum demos require the additional features found in the Spectrum 128K, that is, 128 KiB of RAM and the AY-3-8912 sound chip. Also, many demos have been designed to run from a floppy disk rather than a cassette tape. In many eastern European countries, the various Spectrum clones used to be more common than the original models, a fact that also reflects in the choices of hardware among the demoscene. For example, on most Russian demoscene events, the standard \"compo Spectrum\" is the Pentagon 128 with a floppy disk drive. Since there are considerable technical differences between the Pentagon and the original Spectrum, particularly in the video timing, there are also many demos that require a Pentagon to run properly. Piotr Marecki, cultural studies and digital culture scholar at Jagiellonian University, argues that this makes the ZX Spectrum demoscene unique. Nowadays clones and interfaces are being created that can run demos for various ZX Spectrum hardware accessories and clones, such as the ZX-UNO, the ZX Spectrum Next and the MB03+ Ultimate interface. The eLeMeNt ZX computer is specially designed to support enhancements used by demomakers, that includes 3 memory models of the Pentagon and the ability of switching, on fly, between various zx-clones timings, CPU speeds and gigascreen graphics.\nThe earliest demos were simple music players with music ripped from games and perhaps simple effects or text scrollers. Many scrolltext may contain rude words.  Many later demos feature so-called 'multicolor' effects (changing the color attributes of the ZX Spectrum's display configuration of 768 character blocks), which have to be fixed to a specific ZX Spectrum model. Megademos, demos with more content, usually split into several parts, appeared in the beginning of 90's, with the advent of The Lyra II by ESI.  Most of the demos since 1996 have been \"trackmos\" (effects fixed to music), often featuring 3D objects, sometimes in low resolutions, to achieve more colours.\nIn the former Soviet Union and Eastern/Central Europe, the ZX Spectrum often has a cult status similar to the Commodore 64 in the Western Europe: it was the most popular 8-bit homecomputer and also the first computer for many computer and demoscene enthusiasts. Therefore, whereas many major Western European demo parties organise demo, music and graphics competitions for the Commodore 64, the parties in the east often have the corresponding ZX Spectrum competitions instead.\nZX Spectrum demos have been shown at multi-platform demoparties such as Assembly, and there used to be various Spectrum-only parties, such as Funtop in Moscow.  The largest party today that regularly features the ZX Spectrum is Chaos Constructions in Saint Petersburg. Outside of Russia there is the Forever demoparty.\nOther software\nOther software released for the Spectrum included:\n; Programming language implementations:\n* C\n* Pascal\n* Prolog\n* Forth\n* Z80 assemblers/disassemblers:\n** OCP Editor/Assembler\n** HiSoft Devpac\n** ZEUS Assembler\n** Artic Assembler\n* Sinclair BASIC extensions and compilers:\n** Beta BASIC\n** Mega Basic\n** MCoder\n** COLT\n** HiSoft BASIC\n** ToBoS-FP\n; Databases:\n* VU-File), word processors (e.g.: Tasword II\n; Spreadsheets:\n* VU-Calc\n; Drawing and painting tools:\n* OCP Art Studio\n* The Artist\n* Paintbox\n* Melbourne Draw\n; 3D modelling tools:\n* VU-3D\nMedia\nTape\nBecause most British home computer owners used tape instead of disk storage into the mid-1980s, most ZX Spectrum software was originally distributed on audio cassette tapes. The software is encoded on tape as a sequence of pulses that sound similar to the noises made by a modem. Since the Spectrum has only a rudimentary tape interface, data is recorded using an unusually simple and very reliable modulation: similar to pulse-width modulation but without a constant clock rate. Pulses of different widths (durations) represent 0s and 1s. A \"zero\" is represented by a ~244&nbsp;μs pulse followed by a gap of the same duration (855 clock ticks each at 3.5&nbsp;MHz) for a total ~489&nbsp;μs; \"one\" is twice as long, totalling ~977&nbsp;μs. This allows for 1,023 \"ones\" or 2,047 \"zeros\" to be recorded per second. Assuming an even proportion of each, the resulting mean transmission rate is ~1,365 average bits/s. Higher speeds are possible using custom machine code loaders instead of the ROM routines.\nIn theory, a standard 48K program may take about 5&nbsp;minutes to load: 49,152 bytes × 8 = 393,216 bits; 393,216 bits / 1,365 baud ≈ 288&nbsp;seconds = 4:48&nbsp;minutes. In practice, however, such a program usually takes between 3–4&nbsp;minutes to load (because of different number of 0s and 1s encoded using audio frequency shift keying, and not all memory needs loading), and 128K programs could take up to 11:23 minutes to load. Experienced users can often tell the type of a file, e.g. file header, screen image or main block of code, from the way it sounds on the tape.\nThe standard method of storing files on tape uses a combination of header and associated data blocks. Both types of blocks are preceded by pilot and synchronization signals, used to accommodate numerous physical variations present such as tape deck speed and distortion arising from tape stretching. Headers have a short size of 19 bytes (1 zero-value flag byte, 17 header information bytes, and 1 checksum byte), where the header information consists of a type byte, a 10-byte filename, a word data block length, and two-word parameters. Depending on the type byte, the loader presents one of the follow messages: Program:  for programs written in BASIC; Bytes:  for machine code, screen dumps, etc.; or Character array:  for an ASCII-encoded file.\nDuring standard loading and saving processes, the border of the screen flashes with cyan/red stripes for the pilot signal and yellow/blue stripes for the header and data blocks; which colour of the pair is used depends upon the bit that was last read from the tape. Pilot and synchronization signals are usually represented with a thick stripe size; on header and data blocks, the stripes are thinner. Striped border effects, as used in the standard loader or more complex ones (see below) can also be found on games written for other 8-bit computers, such as the Commodore C64, and the Amstrad CPC 464/664/6128: which, as it used the same Z80 CPU, often received ports of loading routines originally for the Spectrum.\nThe Spectrum was intended to work with almost any cassette tape player, and despite differences in audio reproduction fidelity, the software loading process was designed to be reliable; nevertheless it was still possible for tapes to fail loading with the message R Tape loading error, 0:1. One common cause was the use of a cassette copy from a tape recorder with a different head alignment to the one being used. This could sometimes be fixed by pressing on the top of the player during loading, or wedging the cassette with pieces of folded paper, to physically shift the tape into the required alignment. A more reliable solution was to realign the head, which was easily accessible on a number of tape players, with a small (jeweller's) screwdriver.\nTypical settings for loading were ¾ volume, 100% treble, 0% bass. Audio filters like loudness and Dolby Noise Reduction had to be disabled, and it was not recommended to use a Hi-Fi player to load programs. There were some tape recorders built specially for digital use, such as the Timex Computer 2010 Tape Recorder or Grundig CR 100 Data Recorder. The ZX Spectrum Plus 2 and 2A models are fashioned after an Amstrad CPC 464 and feature a built-in tape \"datacorder\".\nIt is possible to alter the colours between which the border alternates during loading, and/or to use more than two colours, to obtain more flashy visual effects during the loading process.\nComplex loaders with unusual speeds or encoding were the basis of the ZX Spectrum copy protection schemes, although other methods were used including asking for a particular word from the documentation included with the game – often a novella – or the notorious Lenslok system. This had a set of plastic prisms in a fold-out plastic holder: the idea was that a scrambled two-letter code would appear on the screen, which could only be read by holding the prisms at a fixed distance from the screen courtesy of the plastic holder. This relied rather too much on everyone using the same size television, and Lenslok became a running joke with Spectrum users.\nOne very interesting kind of software was copiers.  Most were copyright infringement oriented, and their function was only tape duplication, but when Sinclair Research launched the ZX Microdrive, copiers were developed to copy programs from audio tape to microdrive tapes, and later on diskettes.  Best known were the Lerm suite produced by Lerm Software and Trans Express by Romantic Robot.  As the protections became more complex (e.g. Speedlock) it was almost impossible to use copiers to copy tapes, and the loaders had to be cracked by hand, to produce unprotected versions.  Special hardware, like Romantic Robot's Multiface which was able to dump a copy of the ZX Spectrum RAM to disk/tape at the press of a button, was developed, entirely circumventing the copy protection systems.  \"Snapshots\" generated by these black boxes would later become the original filetype recognised by emulators: .SNA: although these memory dumps have been generally replaced by more complex files, incorporating original loading features and multi-level options.\nZX Microdrive\nZX Microdrive cartridge\nThe ZX Microdrive system was released in July 1983. While the drives were cheaper than floppy disk drives, the media was very expensive for software publishers to use for mass market releases (by a factor of 10, compared to tape duplication) and acquired a reputation  for unreliability, with publishers reluctant to QA each and every item shipped.\nThe main use became to complement tape releases, usually utilities and niche products like the Tasword word processing software and Trans Express.\nNo games are known to be exclusively released on Microdrive, but some companies allowed, and even aided, their software to be copied over.  One such example was Rally Driver by Five Ways Software Ltd.\nFloppy disk\nThe CF has a harder casing than a 3-inch floppy; the metal door is opened by a sliding plastic tab on the right side\nSeveral floppy disk systems were designed for the ZX Spectrum.  The most popular (excepting Eastern Europe,) were the DISCiPLE and +D systems released by Miles Gordon Technology in 1987 and 1988 respectively.  Despite becoming popular and being reliable (from using standard Shugart disk drives), most releases were utility software.  However, both systems had the ability to store memory images onto disk, snapshots, which later on could be loaded back into the ZX Spectrum and execution would commence from the point where they were \"snapped\", making them perfect for \"backups\".  Both systems were also compatible with the Microdrive command syntax, which made porting existing software simpler.\nThe ZX Spectrum +3 featured a built-in 3\" disk drive and enjoyed more success when it came to commercial software releases.\nMost Russian releases since 1989 are made for the Beta 128 disc interface, the only system now in use there.\nOthers\nIn addition, software was also distributed through print media, fan magazines and books.  The prevalent language for distribution was the Spectrum's BASIC dialect Sinclair BASIC.  The reader would type the software into the computer by hand, run it, and save it to tape for later use.  The software distributed in this way was in general simpler and slower than its assembly language counterparts, and lacked graphics.  But soon, magazines were printing long lists of checksummed hexadecimal digits with machine code games or tools.  There was a vibrant scientific community built around such software, ranging from satellite dish alignment programs to school classroom scheduling programs.\nOne unusual software distribution method were radio or television shows in e.g. Croatia (Radio 101), Serbia (Ventilator 202), Slovenia (Radio Študent), Poland, Czechoslovakia, Romania, Lebanon or Brazil, where the host would describe a program, instruct the audience to connect a cassette tape recorder to the radio or TV and then broadcast the program over the airwaves in audio format. In former Soviet Union, mostly in Russia and Ukraine unauthorised radio operators (so-called radio hooligans) often exchanged software from cassette tapes for Spectrum and other popular computers by broadcasting it.\nAnother unusual method which was used by some magazines were 7\" 33⅓ rpm \"flexidisc\" records, not the hard vinyl ones, which could be played on a standard record player. These disks were known under various trademarked names including \"Floppy ROM\", \"Flexisoft\", and \"Discoflex\".\nPopular music\nA few pop musicians included Sinclair programs on their records. The Buzzcocks front man, Pete Shelley, put a Spectrum program including lyrics and other information as the last track on his XL-1 album. The punk band Inner City Unit put a Spectrum database of band information on their 1984 release, 'New Anatomy'. Also in 1984, the Thompson Twins released a game on vinyl. The Freshies had a brief flirtation with fame and Spectrum games, with Frank Sidebottom making an early appearance in The Biz. (Previously, Freshies frontman Chris Sievey's song Camouflage contained a ZX81 music video as a B-side.) Aphex Twin included various loading noises on his Richard D. James album in 1996, most notably part of the loading screen from Sabre Wulf on Carn Marth. Shakin' Stevens included his Shaky Game at the end of his ''The Bop Won't Stop album. The aim of the game was to guide your character around a maze, while avoiding bats. Upon completion your score would be given in terms of a rank of disc, e.g. \"gold\" or \"platinum\". The game had a minor connection with one of his tracks, It's Late. Scottish band Urusei Yatsura included a Spectrum program that showed a satanic message in the beginning of the song Thank You (from the album Everybody Loves Urusei Yatsura'').\nOther notable inclusions include the eighth studio album by the Stranglers, Aural Sculpture. Track 7 of side B on the cassette release includes a game called Aural Quest. This was developed by the band's keyboard player, Dave Greenfield, using the Quill Adventure System. It is notable for having two distinct versions, included on different masters of the album. In 2017, Radiohead released a special edition of their OK, Computer album, called OKNOTOK. The included cassette tape features a ZX Spectrum program that generates random text and colours, while playing tones akin to a track included on the cassette.\nThere was also a music program for the Spectrum 48K which allowed to play two notes at a time, by rapidly switching between the waveforms of the two separate notes, a big improvement over the mono Spectrum sound. The program was branded after the popular '80s pop band Wham!, and some of the biggest hits of this group could be played with the Spectrum. The program was called Wham! The Music Box and released by Melbourne House, one of the most prolific publishing houses at the time.\nSee also\n* ZX Spectrum demos\n* List of ZX Spectrum games\nReferences"
    }
  ]
}